*          DATA SET DDSHADEDDS AT LEVEL 001 AS OF 10/05/82                      
*PHASE DDSSHADE,+0                                                              
DDSSHADE CSECT                                                                  
         DC    C'Y'                                                             
         DC    X'01'                                                            
         DC    38X'00'                                                          
         DC    12XL16'00'                                                       
         DC    AL1(5,29,49,74,97,122,0,0,0,0,0,0,0,0,0,0)                       
         DC    AL1(5,30,49,75,97,122,0,0,0,0,0,0,0,0,0,0)                       
         DC    AL1(5,7,29,31,49,51,74,76,97,99,120,122,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,96,98,119,121,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,96,98,119,121,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,96,98,119,121,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,96,98,119,121,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,95,97,118,120,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,95,97,118,120,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,95,97,118,120,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,95,97,118,120,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,94,96,117,119,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,94,96,117,119,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,94,96,117,119,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,94,96,117,119,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,94,96,117,119,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,94,96,117,119,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,94,96,117,119,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,95,97,118,120,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,95,97,118,120,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,95,97,118,120,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,95,97,118,120,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,96,98,119,121,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,96,98,119,121,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,96,98,119,121,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,96,98,119,121,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,97,99,120,122,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,97,99,120,122,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,97,99,120,122,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,97,99,120,122,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,97,99,120,122,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,97,99,120,122,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,97,99,120,122,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,96,98,119,121,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,96,98,119,121,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,96,98,119,121,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,96,98,119,121,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,95,97,118,120,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,95,97,118,120,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,95,97,118,120,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,95,97,118,120,0,0,0,0)                 
         DC    AL1(5,7,30,32,49,51,75,77,94,96,117,119,0,0,0,0)                 
         DC    AL1(5,32,49,77,94,119,0,0,0,0,0,0,0,0,0,0)                       
         DC    AL1(5,32,49,77,94,119,0,0,0,0,0,0,0,0,0,0)                       
         DC    4XL16'00'                                                        
**PAN#1  CSECT                                                                  
**PAN#1  DC    CL21'001DDSHADEDDS10/05/82'                                      
         END                                                                    
