*          DATA SET FACRNDX    AT LEVEL 027 AS OF 03/11/19                      
*PHASE T00AFFA                                                                  
         TITLE 'FACPAK - CORE RESIDENT PHASE INDEX'                             
T00AFF   RSECT                                                                  
         DC    X'73',X'00',CL7'REQTWA'                                          
         DC    AL2(VSYSFAC0-SYSFACD,CREQTWA-COMFACSD)                           
         DC    X'FF'                                                            
         DC    X'D0',X'00',CL7'DDISP'                                           
         DC    AL2(VSYSFAC0-SYSFACD,CT00AD0-COMFACSD)                           
         DC    X'FF'                                                            
         DC    X'D1',X'00',CL7'DEMOTAB'                                         
         DC    AL2(VSYSFAC0-SYSFACD,CDEMTABS-COMFACSD)                          
         DC    X'FF'                                                            
         DC    X'D9',X'00',CL7'DEMOVAL'                                         
         DC    AL2(VSYSFAC0-SYSFACD,CDEMOVAL-COMFACSD)                          
         DC    X'FF'                                                            
         DC    X'DA',X'00',CL7'DEMOMATH'                                        
         DC    AL2(VSYSFAC0-SYSFACD,CDEMOMTH-COMFACSD)                          
         DC    X'FF'                                                            
         DC    X'DB',X'00',CL7'DEMEL'                                           
         DC    AL2(VSYSFAC0-SYSFACD,CDEMEL-COMFACSD)                            
         DC    X'FF'                                                            
         DC    X'DC',X'00',CL7'DEMAINT'                                         
         DC    AL2(VSYSFAC0-SYSFACD,CDEMAINT-COMFACSD)                          
         DC    X'FF'                                                            
         DC    X'DD',X'00',CL7'DEMAND'                                          
         DC    AL2(VSYSFAC0-SYSFACD,CDEMAND-COMFACSD)                           
         DC    X'FF'                                                            
         DC    X'DE',X'00',CL7'DEMADDR'                                         
         DC    AL2(VSYSFAC0-SYSFACD,CDEMADDR-COMFACSD)                          
         DC    X'FF'                                                            
         DC    X'DF',X'00',CL7'DEMOUT'                                          
         DC    AL2(VSYSFAC0-SYSFACD,CDEMOUT-COMFACSD)                           
         DC    X'FF'                                                            
         DC    X'E0',X'00',CL7'DEMOCON'                                         
         DC    AL2(VSYSFAC0-SYSFACD,CDEMOCON-COMFACSD)                          
         DC    X'FF'                                                            
         DC    X'E6',X'00',CL7'DEMAND1'                                         
         DC    AL2(VSYSFAC0-SYSFACD,CDEMAND1-COMFACSD)                          
         DC    X'FF'                                                            
         DC    X'F0',X'00',CL7'GENERAL'                                         
         DC    AL2(VSYSFAC0-SYSFACD,CGENERAL-COMFACSD)                          
         DC    X'FF'                                                            
         DC    X'F8',X'00',CL7'SEARCH'                                          
         DC    AL2(VSYSFAC0-SYSFACD,CSEARCH-COMFACSD)                           
         DC    X'FF'                                                            
         DC    X'74',X'00',CL7'MINIO'                                           
         DC    AL2(VSYSFAC0-SYSFACD,CMINIO-COMFACSD)                            
         DC    X'FF'                                                            
         DC    X'7E',X'00',CL7'LOCKET'                                          
         DC    AL2(VSYSFAC0-SYSFACD,CLOCKET-COMFACSD)                           
         DC    X'FF'                                                            
         DC    X'50',X'00',CL7'QSORT '                                          
         DC    AL2(VSYSFAC0-SYSFACD,CQSORT-COMFACSD)                            
         DC    X'FF'                                                            
         DC    X'FB',X'00',CL7'PERVAL'                                          
         DC    AL2(VSYSFAC0-SYSFACD,CPERVAL-COMFACSD)                           
         DC    X'FF'                                                            
         DC    X'12',X'00',CL7'XSORT'                                           
         DC    AL2(VSYSFAC0-SYSFACD,CXSORT-COMFACSD)                            
         DC    X'FF'                                                            
         DC    X'1A',X'00',CL7'PARSNIP'                                         
         DC    AL2(VSYSFAC0-SYSFACD,CPARSNIP-COMFACSD)                          
         DC    X'FF'                                                            
         DC    X'2C',X'00',CL7'WRKIO  '                                         
         DC    AL2(VSYSFAC0-SYSFACD,CWRKIO-COMFACSD)                            
         DC    X'FF'                                                            
         DC    X'90',X'00',CL7'MBVAL'                                           
         DC    AL2(VSYSFAC4-SYSFACD,SMBVAL-MBFACSD)                             
         DC    X'FF'                                                            
         DC    X'91',X'00',CL7'MBVAL1'                                          
         DC    AL2(VSYSFAC4-SYSFACD,SMBVAL1-MBFACSD)                            
         DC    X'FF'                                                            
         DC    X'92',X'00',CL7'MBVAL2'                                          
         DC    AL2(VSYSFAC4-SYSFACD,SMBVAL2-MBFACSD)                            
         DC    X'FF'                                                            
         DC    X'9C',X'00',CL7'MBVAL3'                                          
         DC    AL2(VSYSFAC4-SYSFACD,SMBVAL3-MBFACSD)                            
         DC    X'FF'                                                            
         DC    X'9D',X'00',CL7'MBVAL4'                                          
         DC    AL2(VSYSFAC4-SYSFACD,SMBVAL4-MBFACSD)                            
         DC    X'FF'                                                            
         DC    X'93',X'00',CL7'MBSPVAL'                                         
         DC    AL2(VSYSFAC4-SYSFACD,SMBSPVAL-MBFACSD)                           
         DC    X'FF'                                                            
         DC    X'94',X'00',CL7'MBLVAL'                                          
         DC    AL2(VSYSFAC4-SYSFACD,SMBLVAL-MBFACSD)                            
         DC    X'FF'                                                            
         DC    X'95',X'00',CL7'MBQED'                                           
         DC    AL2(VSYSFAC4-SYSFACD,SMBQED-MBFACSD)                             
         DC    X'FF'                                                            
         DC    X'96',X'00',CL7'MBNMVAL'                                         
         DC    AL2(VSYSFAC4-SYSFACD,SMBNMVAL-MBFACSD)                           
         DC    X'FF'                                                            
         DC    X'97',X'00',CL7'MBQCOMP'                                         
         DC    AL2(VSYSFAC4-SYSFACD,SMBQCOMP-MBFACSD)                           
         DC    X'FF'                                                            
         DC    X'98',X'00',CL7'MBDATER'                                         
         DC    AL2(VSYSFAC4-SYSFACD,SMBDATER-MBFACSD)                           
         DC    X'FF'                                                            
         DC    X'99',X'00',CL7'MBDCALC'                                         
         DC    AL2(VSYSFAC4-SYSFACD,SMBDCALC-MBFACSD)                           
         DC    X'FF'                                                            
         DC    X'9A',X'00',CL7'MBLOOK'                                          
         DC    AL2(VSYSFAC4-SYSFACD,SMBLOOK-MBFACSD)                            
         DC    X'FF'                                                            
         DC    X'03',X'00',CL7'DAYVAL'                                          
         DC    AL2(VSYSFAC4-SYSFACD,SDAYVAL-MBFACSD)                            
         DC    X'FF'                                                            
         DC    X'0F',X'00',CL7'UNDAY'                                           
         DC    AL2(VSYSFAC4-SYSFACD,SUNDAY-MBFACSD)                             
         DC    X'FF'                                                            
         DC    X'76',X'00',CL7'CODEX'                                           
         DC    AL2(VSYSFAC4-SYSFACD,SCODEX-MBFACSD)                             
         DC    X'FF'                                                            
         DC    X'AE',X'00',CL7'SOFDAT'                                          
         DC    AL2(VSYSFAC0-SYSFACD,CSOFDAT-COMFACSD)                           
         DC    X'FF'                                                            
         DC    X'E2',X'00',CL7'LINKIO'                                          
         DC    AL2(VSYSFAC0-SYSFACD,CLINKIO-COMFACSD)                           
         DC    X'FF'                                                            
         DC    X'24',X'00',CL7'SPGTIUN'                                         
         DC    AL2(VSYSFAC0-SYSFACD,CSPGTIUN-COMFACSD)                          
         DC    X'FF'                                                            
         DC    X'26',X'00',CL7'DEFINE'                                          
         DC    AL2(VSYSFAC0-SYSFACD,CDEFINE-COMFACSD)                           
         DC    X'FF'                                                            
         DC    X'E3',X'00',CL7'GENNEW'                                          
         DC    AL2(VSYSFAC0-SYSFACD,CGENNEW-COMFACSD)                           
         DC    X'FF'                                                            
         DC    X'E5',X'00',CL7'DDLINK'                                          
         DC    AL2(VSYSFAC0-SYSFACD,CDDLINK-COMFACSD)                           
         DC    X'FF'                                                            
         DC    2X'00'                                                           
         EJECT                                                                  
* FASYSFAC                                                                      
         PRINT OFF                                                              
       ++INCLUDE FASYSFAC                                                       
         PRINT ON                                                               
* DDCOMFACS                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDCOMFACS                                                      
         PRINT ON                                                               
* DDMBFACS                                                                      
         PRINT OFF                                                              
       ++INCLUDE DDMBFACS                                                       
         PRINT ON                                                               
**PAN#1  CSECT                                                                  
**PAN#1  DC    CL21'027FACRNDX   03/11/19'                                      
         END                                                                    
