*          DATA SET GAANA01    AT LEVEL 003 AS OF 08/22/00                      
*PHASE TB1501A                                                                  
         TITLE 'GAANA GAME - DICTIONARY'                                        
ANAGRAM  CSECT                                                                  
*                                                                               
         DC    C'   SCAPEGOAT*GETSOAPAC   CAVIAR*ACIRAV            '            
         DC    C'OUTRAGEOUS*ROUTESAUGO   TRIUMPH*THIRPUM           '            
         DC    C'ADMINISTRATION*TIIDOMANTRASNI  BRONZE*NORBEZ      '            
         DC    C'JUSTICE*TUCEJIS   SCORPION*PINSOCOR               '            
         DC    C'PHYSICIAN*YIPACHSIN  UNIVERSITY*SYTRINIVUE        '            
         DC    C'COMPUTER*MUCTROPE   GRAPEFRUIT*PRAFUGITER         '            
         DC    C' STIGMA*MIGSAT    WILDERNESS*SENDWELRIS           '            
         DC    C'  HEDGEHOG*GODEGHEH   DISHARMONY*SHANDYRIMO       '            
         DC    C'  GENTLEMAN*TENGAMELN   CHAMPAGNE*MAPHANCEG       '            
         DC    C'  CORRESPONDENT*SNEERNODPROCT                     '            
         DC    C'  MISADVENTURE*ADVERTSUNIME SOFTWARE*AFROSTEW     '            
         DC    C'  OPERATION*NORPEATIO  STALAGMITE*SMELTAGAIT      '            
         DC    C'  POMEGRANATE*MEANOGRAPET HISTRIONICS*SHIRTISNOCI '            
         DC    C'  GOOSEBERRY*YESGROBERO    PEANUT*TUNEPA          '            
         DC    C' ORANGOUTANG*GOATARUNNOG  DICTIONARY*TINRYDCIAO   '            
         DC    C'  UNEMPLOYMENT*POULMENTMENY  FORTUNE*TONERUF      '            
         DC    C'  MAHOGANY*GONYAMHA   HANDICRAFT*CHARFATDIN       '            
         DC    C' GENERATION*GROANNITEE CONFIGURATION*FROGINAUCTION'            
         DC    C' ALGORITHM*MORALTIGH  BACKGROUND*GRABNODUCK       '            
         DC    C' ADVERTISEMENT*REDSINMATEVET  INDUSTRY*TINYURDS   '            
         DC    C' LAMPSHADE*PEALMASHD  LIBERAL*BELLAIR             '            
         DC    C' CONSERVATIVE*VERTICAVNOSE  RHETORIC*TORCHERI     '            
         DC    C' DEMOCRAT*DREAMCOT  DEVELOP*LOVDEEP               '            
         DC    C' APATHETIC*CHAPATTIE  SUBLIME*LUBEISM             '            
         DC    C' INTERNATIONAL*TINTINALOANER  BRIGADE*DAREBIG     '            
         DC    C' SOPHISTICATE*PISTTACHIOES  SPANNER*SNRAPEN       '            
         DC    C' FEMINIST*SNIFTIME  BROTHER*HORBERT               '            
         DC    C' XENOPHOBIA*HIPAXOBONE  PARSLEY*SLYRAPE           '            
         DC    C' PERSUADE*USEDPEAR   DECEPTION*CENTIPODE          '            
         DC    C' SOCIALIST*LAISISCOT  PELICAN*PLAICEN             '            
         DC    C' PARASITE*ASTRAPIE  VEGETARIAN*EVAGRANITE         '            
         DC    C' MUNDANE*MANNUDE  PARTICULAR*PLATACURRI           '            
         DC    C' DICTATE*CATDIET  IGNORANCE*NEOCARING             '            
         DC    C' OBLIGE*BOILEG  MANIFESTO*FEMINOSTA               '            
         DC    C' PASTORAL*ORSPATAL  MACHINE*HAMINEC               '            
         DC    C' CHAOS*COSHA   IMAGINE*ENIGMIA                    '            
         DC    C' SPOONERISM*MINORPOSSE  HEROINE*RENOIHE           '            
         DC    C' RESPONSE*PORENESS  HYPERBOLE*HELPBOREY           '            
         DC    C' ARTISTIC*SIRTACIT  REPORTER*PETERROR             '            
         DC    C' MARGERINE*NEARGRIME  HAUNTED*NUTHEAD             '            
         DC    C' DEPARTMENTAL*PETALTRAMNED  TYPICAL*PILTACY       '            
         DC    C' BUILDING*UGLIBIND  METROPOLIS*PRIMESTOOL         '            
         DC    C' CHRISTMAS*SHAMTRICS  INFERNO*FOREINN             '            
         DC    C' STAIRCASE*CEASARIST  MONSTER*TORMENS             '            
         DC    C' UNCOMFORTABLE*FRANCEBOTOLUM  NATURAL*LUNARAT     '            
         DC    C' MOTORBIKE*KERMITOOB  MACKINTOSH*STONKHAMIC       '            
         DC    C' PUBLICAN*BUNICLAP  COLLIERY*ROLYLICE             '            
         DC    C' SILENCE*CLINEES  FINGERPRINT*FIRRTINNPEG         '            
*                                                                               
**PAN#1  CSECT                                                                  
**PAN#1  DC    CL21'003GAANA01   08/22/00'                                      
         END                                                                    
