*          DATA SET GABOG01    AT LEVEL 007 AS OF 08/22/00                      
*PHASE TB1801A                                                                  
GABOG01  CSECT                                                                  
         DC    AL2((GABOG01X-GABOG01S)/5)                                       
GABOG01S EQU   *                                                                
*        DC    C'ABACA'                                                         
*        DC    C'ABACI'                                                         
         DC    C'ABACK'                                                         
*        DC    C'ABAFT'                                                         
         DC    C'ABASE'                                                         
         DC    C'ABASH'                                                         
         DC    C'ABATE'                                                         
         DC    C'ABBEY'                                                         
         DC    C'ABBOT'                                                         
         DC    C'ABEAM'                                                         
*        DC    C'ABELE'                                                         
         DC    C'ABHOR'                                                         
         DC    C'ABIDE'                                                         
         DC    C'ABLER'                                                         
         DC    C'ABODE'                                                         
         DC    C'ABOIL'                                                         
         DC    C'ABORT'                                                         
         DC    C'ABOUT'                                                         
         DC    C'ABOVE'                                                         
         DC    C'ABUSE'                                                         
         DC    C'ABUZZ'                                                         
*        DC    C'ABYSM'                                                         
         DC    C'ABYSS'                                                         
         DC    C'ACERB'                                                         
         DC    C'ACHED'                                                         
*        DC    C'ACING'                                                         
*        DC    C'ACOCK'                                                         
         DC    C'ACORN'                                                         
         DC    C'ACRID'                                                         
         DC    C'ACTED'                                                         
         DC    C'ACTIN'                                                         
         DC    C'ACTOR'                                                         
         DC    C'ACUTE'                                                         
         DC    C'ADAGE'                                                         
         DC    C'ADAPT'                                                         
*        DC    C'ADDAX'                                                         
         DC    C'ADDED'                                                         
         DC    C'ADDER'                                                         
         DC    C'ADDLE'                                                         
         DC    C'ADEPT'                                                         
         DC    C'ADMIT'                                                         
         DC    C'ADMIX'                                                         
         DC    C'ADOPT'                                                         
         DC    C'ADORE'                                                         
         DC    C'ADORN'                                                         
*        DC    C'ADOWN'                                                         
         DC    C'ADULT'                                                         
*        DC    C'ADUNC'                                                         
*        DC    C'ADUST'                                                         
*        DC    C'AECIA'                                                         
*        DC    C'AEDES'                                                         
         DC    C'AEGIS'                                                         
         DC    C'AERIE'                                                         
         DC    C'AFFIX'                                                         
         DC    C'AFIRE'                                                         
         DC    C'AFOOT'                                                         
         DC    C'AFORE'                                                         
         DC    C'AFOUL'                                                         
*        DC    C'AFRIT'                                                         
         DC    C'AFTER'                                                         
         DC    C'AGAIN'                                                         
*        DC    C'AGAMA'                                                         
         DC    C'AGAPE'                                                         
         DC    C'AGATE'                                                         
         DC    C'AGAVE'                                                         
         DC    C'AGAZE'                                                         
         DC    C'AGENT'                                                         
         DC    C'AGILE'                                                         
         DC    C'AGING'                                                         
*        DC    C'AGLET'                                                         
*        DC    C'AGLEY'                                                         
         DC    C'AGLOW'                                                         
         DC    C'AGONE'                                                         
         DC    C'AGONY'                                                         
*?       DC    C'AGORA'                                                         
         DC    C'AGREE'                                                         
         DC    C'AHEAD'                                                         
         DC    C'AIDED'                                                         
         DC    C'AIDER'                                                         
         DC    C'AILED'                                                         
         DC    C'AIMED'                                                         
         DC    C'AIMER'                                                         
         DC    C'AIRED'                                                         
         DC    C'AIRER'                                                         
         DC    C'AISLE'                                                         
         DC    C'AITCH'                                                         
         DC    C'ALACK'                                                         
*        DC    C'ALAMO'                                                         
         DC    C'ALARM'                                                         
*        DC    C'ALARY'                                                         
*        DC    C'ALATE'                                                         
         DC    C'ALBUM'                                                         
         DC    C'ALDER'                                                         
*        DC    C'ALDOL'                                                         
*        DC    C'ALEPH'                                                         
         DC    C'ALERT'                                                         
         DC    C'ALGAL'                                                         
*        DC    C'ALGID'                                                         
*        DC    C'ALGIN'                                                         
*        DC    C'ALGUM'                                                         
         DC    C'ALIAS'                                                         
         DC    C'ALIBI'                                                         
         DC    C'ALIEN'                                                         
         DC    C'ALIGN'                                                         
         DC    C'ALIKE'                                                         
         DC    C'ALINE'                                                         
         DC    C'ALIVE'                                                         
         DC    C'ALKYD'                                                         
         DC    C'ALKYL'                                                         
         DC    C'ALLAY'                                                         
         DC    C'ALLEY'                                                         
*        DC    C'ALLOD'                                                         
         DC    C'ALLOT'                                                         
         DC    C'ALLOW'                                                         
         DC    C'ALLOY'                                                         
*        DC    C'ALLYL'                                                         
*        DC    C'ALMUD'                                                         
*        DC    C'ALMUG'                                                         
         DC    C'ALOFT'                                                         
         DC    C'ALOHA'                                                         
*        DC    C'ALOIN'                                                         
         DC    C'ALONE'                                                         
         DC    C'ALONG'                                                         
         DC    C'ALOOF'                                                         
         DC    C'ALOUD'                                                         
         DC    C'ALPHA'                                                         
         DC    C'ALTAR'                                                         
         DC    C'ALTER'                                                         
*        DC    C'ALTHO'                                                         
*        DC    C'ALULA'                                                         
         DC    C'ALWAY'                                                         
         DC    C'AMAIN'                                                         
         DC    C'AMASS'                                                         
         DC    C'AMAZE'                                                         
         DC    C'AMBER'                                                         
*        DC    C'AMBIT'                                                         
         DC    C'AMBLE'                                                         
*        DC    C'AMBRY'                                                         
         DC    C'AMEBA'                                                         
         DC    C'AMEER'                                                         
         DC    C'AMEND'                                                         
*        DC    C'AMENT'                                                         
*        DC    C'AMICE'                                                         
         DC    C'AMIDE'                                                         
         DC    C'AMIDO'                                                         
         DC    C'AMINE'                                                         
         DC    C'AMINO'                                                         
         DC    C'AMISS'                                                         
         DC    C'AMITY'                                                         
*        DC    C'AMOLE'                                                         
         DC    C'AMONG'                                                         
*        DC    C'AMORT'                                                         
*        DC    C'AMOUR'                                                         
         DC    C'AMPLE'                                                         
         DC    C'AMPLY'                                                         
*        DC    C'AMPUL'                                                         
         DC    C'AMUCK'                                                         
         DC    C'AMUSE'                                                         
*        DC    C'ANCON'                                                         
*        DC    C'ANEAR'                                                         
*        DC    C'ANELE'                                                         
         DC    C'ANENT'                                                         
         DC    C'ANGEL'                                                         
         DC    C'ANGER'                                                         
         DC    C'ANGLE'                                                         
         DC    C'ANGRY'                                                         
         DC    C'ANGST'                                                         
*        DC    C'ANILE'                                                         
*        DC    C'ANIMA'                                                         
*        DC    C'ANIME'                                                         
         DC    C'ANION'                                                         
         DC    C'ANISE'                                                         
         DC    C'ANKLE'                                                         
*        DC    C'ANKUS'                                                         
         DC    C'ANNAL'                                                         
         DC    C'ANNEX'                                                         
         DC    C'ANNOY'                                                         
         DC    C'ANNUL'                                                         
*        DC    C'ANODE'                                                         
*        DC    C'ANOMY'                                                         
*        DC    C'ANTAE'                                                         
         DC    C'ANTIC'                                                         
*        DC    C'ANTRE'                                                         
         DC    C'ANVIL'                                                         
         DC    C'AORTA'                                                         
         DC    C'APACE'                                                         
         DC    C'APART'                                                         
         DC    C'APEAK'                                                         
*        DC    C'APERY'                                                         
         DC    C'APHID'                                                         
*        DC    C'APHIS'                                                         
         DC    C'APIAN'                                                         
         DC    C'APING'                                                         
         DC    C'APISH'                                                         
         DC    C'APNEA'                                                         
         DC    C'APORT'                                                         
         DC    C'APPAL'                                                         
         DC    C'APPLE'                                                         
         DC    C'APPLY'                                                         
         DC    C'APRON'                                                         
*        DC    C'APSIS'                                                         
         DC    C'APTER'                                                         
         DC    C'APTLY'                                                         
*        DC    C'AQUAE'                                                         
         DC    C'ARBOR'                                                         
         DC    C'ARCED'                                                         
*        DC    C'ARDEB'                                                         
         DC    C'ARDOR'                                                         
*        DC    C'AREAL'                                                         
*        DC    C'ARECA'                                                         
         DC    C'ARENA'                                                         
*        DC    C'ARETE'                                                         
*        DC    C'ARGAL'                                                         
*        DC    C'ARGOL'                                                         
         DC    C'ARGON'                                                         
         DC    C'ARGOT'                                                         
         DC    C'ARGUE'                                                         
*        DC    C'ARIEL'                                                         
         DC    C'ARISE'                                                         
*        DC    C'ARLES'                                                         
         DC    C'ARMED'                                                         
         DC    C'ARMER'                                                         
*        DC    C'ARMET'                                                         
         DC    C'ARMOR'                                                         
*        DC    C'AROID'                                                         
         DC    C'AROMA'                                                         
         DC    C'AROSE'                                                         
*        DC    C'ARRAS'                                                         
         DC    C'ARRAY'                                                         
*        DC    C'ARRIS'                                                         
         DC    C'ARROW'                                                         
*        DC    C'ARSIS'                                                         
         DC    C'ARSON'                                                         
*        DC    C'ARTAL'                                                         
*        DC    C'ARTEL'                                                         
         DC    C'ASCOT'                                                         
*        DC    C'ASCUS'                                                         
*        DC    C'ASDIC'                                                         
         DC    C'ASHEN'                                                         
         DC    C'ASIDE'                                                         
         DC    C'ASKED'                                                         
         DC    C'ASKER'                                                         
         DC    C'ASKEW'                                                         
*?       DC    C'ASPEN'                                                         
         DC    C'ASPEN'                                                         
*        DC    C'ASPER'                                                         
         DC    C'ASPIC'                                                         
         DC    C'ASSAY'                                                         
         DC    C'ASSES'                                                         
         DC    C'ASSET'                                                         
         DC    C'ASTER'                                                         
         DC    C'ASTIR'                                                         
         DC    C'ATILT'                                                         
         DC    C'ATLAS'                                                         
*        DC    C'ATMAN'                                                         
         DC    C'ATOLL'                                                         
*        DC    C'ATOMY'                                                         
         DC    C'ATONE'                                                         
*        DC    C'ATONY'                                                         
         DC    C'ATRIA'                                                         
*        DC    C'ATRIP'                                                         
         DC    C'ATTAR'                                                         
         DC    C'ATTIC'                                                         
         DC    C'AUDIO'                                                         
         DC    C'AUDIT'                                                         
         DC    C'AUGER'                                                         
         DC    C'AUGHT'                                                         
         DC    C'AUGUR'                                                         
*        DC    C'AULIC'                                                         
         DC    C'AUNTY'                                                         
         DC    C'AURAE'                                                         
         DC    C'AURAL'                                                         
*        DC    C'AURAR'                                                         
         DC    C'AURIC'                                                         
*        DC    C'AURUM'                                                         
*        DC    C'AUXIN'                                                         
         DC    C'AVAIL'                                                         
         DC    C'AVAST'                                                         
*        DC    C'AVENS'                                                         
         DC    C'AVERT'                                                         
         DC    C'AVIAN'                                                         
         DC    C'AVOID'                                                         
         DC    C'AWAIT'                                                         
         DC    C'AWAKE'                                                         
         DC    C'AWARD'                                                         
         DC    C'AWARE'                                                         
         DC    C'AWASH'                                                         
         DC    C'AWFUL'                                                         
         DC    C'AWING'                                                         
*        DC    C'AWNED'                                                         
         DC    C'AWOKE'                                                         
         DC    C'AXIAL'                                                         
*        DC    C'AXILE'                                                         
         DC    C'AXING'                                                         
         DC    C'AXIOM'                                                         
*        DC    C'AXLED'                                                         
*        DC    C'AZIDE'                                                         
*        DC    C'AZINE'                                                         
*        DC    C'AZOIC'                                                         
*        DC    C'AZOLE'                                                         
*        DC    C'AZOTE'                                                         
*        DC    C'AZOTH'                                                         
         DC    C'AZURE'                                                         
         DC    C'BAAED'                                                         
         DC    C'BABKA'                                                         
*        DC    C'BABOO'                                                         
*        DC    C'BABUL'                                                         
         DC    C'BACON'                                                         
         DC    C'BADGE'                                                         
         DC    C'BADLY'                                                         
         DC    C'BAGEL'                                                         
         DC    C'BAGGY'                                                         
         DC    C'BAIRN'                                                         
*        DC    C'BAISA'                                                         
         DC    C'BAIZE'                                                         
         DC    C'BAKED'                                                         
         DC    C'BAKER'                                                         
*        DC    C'BALAS'                                                         
         DC    C'BALED'                                                         
         DC    C'BALER'                                                         
         DC    C'BALKY'                                                         
         DC    C'BALMY'                                                         
         DC    C'BALSA'                                                         
         DC    C'BANAL'                                                         
         DC    C'BANDY'                                                         
         DC    C'BANJO'                                                         
*        DC    C'BANNS'                                                         
         DC    C'BARED'                                                         
         DC    C'BARER'                                                         
         DC    C'BARGE'                                                         
*        DC    C'BARIC'                                                         
*        DC    C'BARMY'                                                         
         DC    C'BARON'                                                         
         DC    C'BASAL'                                                         
         DC    C'BASED'                                                         
         DC    C'BASER'                                                         
         DC    C'BASES'                                                         
         DC    C'BASIC'                                                         
         DC    C'BASIL'                                                         
         DC    C'BASIN'                                                         
         DC    C'BASIS'                                                         
         DC    C'BASTE'                                                         
         DC    C'BATCH'                                                         
*        DC    C'BATED'                                                         
         DC    C'BATHE'                                                         
         DC    C'BATIK'                                                         
         DC    C'BATON'                                                         
         DC    C'BATTY'                                                         
*        DC    C'BAULK'                                                         
         DC    C'BAWDY'                                                         
         DC    C'BAYED'                                                         
         DC    C'BEACH'                                                         
         DC    C'BEADY'                                                         
         DC    C'BEAMY'                                                         
         DC    C'BEARD'                                                         
         DC    C'BEAST'                                                         
         DC    C'BEAUX'                                                         
*        DC    C'BEDEW'                                                         
*        DC    C'BEDIM'                                                         
         DC    C'BEECH'                                                         
         DC    C'BEEFY'                                                         
         DC    C'BEERY'                                                         
         DC    C'BEFIT'                                                         
         DC    C'BEFOG'                                                         
         DC    C'BEGAN'                                                         
         DC    C'BEGAT'                                                         
         DC    C'BEGET'                                                         
         DC    C'BEGIN'                                                         
         DC    C'BEGOT'                                                         
*        DC    C'BEGUM'                                                         
         DC    C'BEGUN'                                                         
         DC    C'BEIGE'                                                         
         DC    C'BEING'                                                         
*        DC    C'BELAY'                                                         
*        DC    C'BELGA'                                                         
*        DC    C'BELIE'                                                         
         DC    C'BELLE'                                                         
         DC    C'BELLY'                                                         
         DC    C'BELOW'                                                         
         DC    C'BENCH'                                                         
         DC    C'BERET'                                                         
*        DC    C'BERME'                                                         
         DC    C'BERRY'                                                         
         DC    C'BERTH'                                                         
         DC    C'BERYL'                                                         
         DC    C'BESET'                                                         
*        DC    C'BESOM'                                                         
         DC    C'BESOT'                                                         
         DC    C'BETEL'                                                         
*        DC    C'BETTA'                                                         
         DC    C'BEVEL'                                                         
         DC    C'BEZEL'                                                         
*        DC    C'BHANG'                                                         
         DC    C'BIALY'                                                         
         DC    C'BIBLE'                                                         
         DC    C'BIDDY'                                                         
         DC    C'BIDED'                                                         
         DC    C'BIDER'                                                         
         DC    C'BIDET'                                                         
*        DC    C'BIELD'                                                         
*        DC    C'BIFID'                                                         
         DC    C'BIGHT'                                                         
         DC    C'BIGOT'                                                         
         DC    C'BIJOU'                                                         
         DC    C'BIKED'                                                         
         DC    C'BIKER'                                                         
*        DC    C'BILBO'                                                         
         DC    C'BILGE'                                                         
*        DC    C'BILGY'                                                         
*        DC    C'BILLY'                                                         
         DC    C'BINAL'                                                         
         DC    C'BINGE'                                                         
*        DC    C'BIOME'                                                         
         DC    C'BIPED'                                                         
         DC    C'BIPOD'                                                         
         DC    C'BIRCH'                                                         
*        DC    C'BIRLE'                                                         
         DC    C'BIRTH'                                                         
         DC    C'BISON'                                                         
         DC    C'BITCH'                                                         
         DC    C'BITER'                                                         
         DC    C'BITTY'                                                         
         DC    C'BLACK'                                                         
         DC    C'BLADE'                                                         
*        DC    C'BLAIN'                                                         
         DC    C'BLAME'                                                         
         DC    C'BLAND'                                                         
         DC    C'BLANK'                                                         
         DC    C'BLARE'                                                         
         DC    C'BLASE'                                                         
         DC    C'BLAST'                                                         
         DC    C'BLAZE'                                                         
         DC    C'BLEAK'                                                         
         DC    C'BLEAR'                                                         
         DC    C'BLEAT'                                                         
         DC    C'BLEED'                                                         
         DC    C'BLEND'                                                         
*        DC    C'BLENT'                                                         
         DC    C'BLESS'                                                         
*        DC    C'BLEST'                                                         
         DC    C'BLIMP'                                                         
         DC    C'BLIND'                                                         
         DC    C'BLINI'                                                         
         DC    C'BLINK'                                                         
         DC    C'BLISS'                                                         
         DC    C'BLITZ'                                                         
         DC    C'BLOAT'                                                         
         DC    C'BLOCK'                                                         
         DC    C'BLOND'                                                         
         DC    C'BLOOD'                                                         
         DC    C'BLOOM'                                                         
         DC    C'BLOWN'                                                         
*        DC    C'BLOWY'                                                         
*        DC    C'BLUED'                                                         
         DC    C'BLUER'                                                         
*        DC    C'BLUET'                                                         
         DC    C'BLUFF'                                                         
         DC    C'BLUNT'                                                         
         DC    C'BLURT'                                                         
         DC    C'BLUSH'                                                         
         DC    C'BOARD'                                                         
         DC    C'BOAST'                                                         
*        DC    C'BOBBY'                                                         
         DC    C'BOCCE'                                                         
         DC    C'BOCCI'                                                         
         DC    C'BODED'                                                         
         DC    C'BOGEY'                                                         
         DC    C'BOGIE'                                                         
*        DC    C'BOGLE'                                                         
*        DC    C'BOLAS'                                                         
*        DC    C'BOLUS'                                                         
         DC    C'BONED'                                                         
         DC    C'BONGO'                                                         
         DC    C'BONNY'                                                         
         DC    C'BONUS'                                                         
*        DC    C'BONZE'                                                         
         DC    C'BOOBY'                                                         
         DC    C'BOOED'                                                         
         DC    C'BOOST'                                                         
         DC    C'BOOTH'                                                         
         DC    C'BOOTY'                                                         
         DC    C'BOOZE'                                                         
*        DC    C'BOOZY'                                                         
         DC    C'BORAX'                                                         
         DC    C'BORED'                                                         
         DC    C'BORER'                                                         
*        DC    C'BORIC'                                                         
         DC    C'BORNE'                                                         
         DC    C'BORON'                                                         
*        DC    C'BORTZ'                                                         
*        DC    C'BOSKY'                                                         
         DC    C'BOSOM'                                                         
         DC    C'BOSON'                                                         
         DC    C'BOSSY'                                                         
         DC    C'BOSUN'                                                         
         DC    C'BOTCH'                                                         
         DC    C'BOUGH'                                                         
*        DC    C'BOULE'                                                         
         DC    C'BOUND'                                                         
*        DC    C'BOURG'                                                         
*        DC    C'BOURN'                                                         
*        DC    C'BOUSE'                                                         
         DC    C'BOVID'                                                         
         DC    C'BOWED'                                                         
         DC    C'BOWEL'                                                         
         DC    C'BOWER'                                                         
*        DC    C'BOWSE'                                                         
         DC    C'BOXED'                                                         
         DC    C'BOXER'                                                         
*        DC    C'BOYAR'                                                         
         DC    C'BRACE'                                                         
*        DC    C'BRACH'                                                         
*        DC    C'BRACT'                                                         
         DC    C'BRAID'                                                         
         DC    C'BRAIL'                                                         
         DC    C'BRAIN'                                                         
         DC    C'BRAND'                                                         
*        DC    C'BRANT'                                                         
         DC    C'BRASH'                                                         
         DC    C'BRASS'                                                         
         DC    C'BRAVA'                                                         
         DC    C'BRAVE'                                                         
         DC    C'BRAVO'                                                         
         DC    C'BRAWL'                                                         
         DC    C'BRAWN'                                                         
*        DC    C'BRAXY'                                                         
         DC    C'BRAZE'                                                         
         DC    C'BREAD'                                                         
         DC    C'BREAK'                                                         
*?       DC    C'BREAM'                                                         
*        DC    C'BREDE'                                                         
         DC    C'BREED'                                                         
*        DC    C'BRENT'                                                         
*        DC    C'BREVE'                                                         
         DC    C'BRIAR'                                                         
         DC    C'BRIBE'                                                         
         DC    C'BRICK'                                                         
         DC    C'BRIDE'                                                         
         DC    C'BRIEF'                                                         
         DC    C'BRIER'                                                         
*?       DC    C'BRILL'                                                         
         DC    C'BRINE'                                                         
         DC    C'BRING'                                                         
         DC    C'BRINK'                                                         
         DC    C'BRINY'                                                         
         DC    C'BRISK'                                                         
         DC    C'BROAD'                                                         
*        DC    C'BROCK'                                                         
         DC    C'BROIL'                                                         
         DC    C'BROKE'                                                         
*        DC    C'BROME'                                                         
         DC    C'BROOD'                                                         
         DC    C'BROOK'                                                         
         DC    C'BROOM'                                                         
*        DC    C'BROSE'                                                         
         DC    C'BROTH'                                                         
         DC    C'BROWN'                                                         
*        DC    C'BRUIT'                                                         
*        DC    C'BRUME'                                                         
         DC    C'BRUNT'                                                         
         DC    C'BRUSH'                                                         
         DC    C'BRUSK'                                                         
         DC    C'BRUTE'                                                         
*        DC    C'BUBAL'                                                         
*        DC    C'BUCKO'                                                         
         DC    C'BUDDY'                                                         
         DC    C'BUDGE'                                                         
         DC    C'BUGGY'                                                         
         DC    C'BUGLE'                                                         
         DC    C'BUILD'                                                         
         DC    C'BUILT'                                                         
         DC    C'BULGE'                                                         
         DC    C'BULKY'                                                         
*        DC    C'BULLA'                                                         
         DC    C'BULLY'                                                         
         DC    C'BUMPY'                                                         
         DC    C'BUNCH'                                                         
         DC    C'BUNNY'                                                         
*        DC    C'BURAN'                                                         
         DC    C'BURET'                                                         
*        DC    C'BURGH'                                                         
*        DC    C'BURIN'                                                         
*        DC    C'BURKE'                                                         
         DC    C'BURLY'                                                         
         DC    C'BURNT'                                                         
         DC    C'BURRO'                                                         
         DC    C'BURRY'                                                         
         DC    C'BURSA'                                                         
         DC    C'BURSE'                                                         
         DC    C'BURST'                                                         
*        DC    C'BUSBY'                                                         
         DC    C'BUSED'                                                         
         DC    C'BUSHY'                                                         
         DC    C'BUSTY'                                                         
         DC    C'BUTCH'                                                         
*        DC    C'BUTEO'                                                         
         DC    C'BUTTE'                                                         
         DC    C'BUTYL'                                                         
         DC    C'BUXOM'                                                         
         DC    C'BUYER'                                                         
         DC    C'BWANA'                                                         
         DC    C'BYLAW'                                                         
*        DC    C'BYSSI'                                                         
         DC    C'CABAL'                                                         
         DC    C'CABBY'                                                         
*        DC    C'CABER'                                                         
         DC    C'CABIN'                                                         
         DC    C'CABLE'                                                         
         DC    C'CABOB'                                                         
         DC    C'CACAO'                                                         
         DC    C'CACHE'                                                         
         DC    C'CADDY'                                                         
         DC    C'CADET'                                                         
         DC    C'CADGE'                                                         
*        DC    C'CADGY'                                                         
         DC    C'CADRE'                                                         
         DC    C'CAGED'                                                         
         DC    C'CAGER'                                                         
         DC    C'CAGEY'                                                         
*        DC    C'CAIRD'                                                         
*        DC    C'CAIRN'                                                         
         DC    C'CAKED'                                                         
         DC    C'CALIF'                                                         
         DC    C'CALIX'                                                         
*        DC    C'CALLA'                                                         
         DC    C'CALVE'                                                         
         DC    C'CALYX'                                                         
*        DC    C'CAMAS'                                                         
         DC    C'CAMEL'                                                         
         DC    C'CAMEO'                                                         
*        DC    C'CAMPI'                                                         
*        DC    C'CAMPO'                                                         
         DC    C'CAMPY'                                                         
         DC    C'CANAL'                                                         
         DC    C'CANDY'                                                         
         DC    C'CANED'                                                         
*        DC    C'CANNA'                                                         
         DC    C'CANNY'                                                         
         DC    C'CANOE'                                                         
         DC    C'CANON'                                                         
*        DC    C'CANST'                                                         
         DC    C'CANTO'                                                         
*        DC    C'CANTY'                                                         
         DC    C'CAPED'                                                         
         DC    C'CAPER'                                                         
         DC    C'CAPON'                                                         
         DC    C'CARAT'                                                         
         DC    C'CARED'                                                         
         DC    C'CARER'                                                         
         DC    C'CARET'                                                         
         DC    C'CARGO'                                                         
*        DC    C'CARLE'                                                         
*        DC    C'CARNY'                                                         
         DC    C'CAROB'                                                         
         DC    C'CAROL'                                                         
         DC    C'CAROM'                                                         
*        DC    C'CARPI'                                                         
         DC    C'CARRY'                                                         
         DC    C'CARTE'                                                         
         DC    C'CARVE'                                                         
         DC    C'CASED'                                                         
         DC    C'CASTE'                                                         
         DC    C'CATCH'                                                         
         DC    C'CATER'                                                         
         DC    C'CATTY'                                                         
         DC    C'CAULK'                                                         
         DC    C'CAUSE'                                                         
         DC    C'CAVED'                                                         
*        DC    C'CAVER'                                                         
         DC    C'CAVIL'                                                         
         DC    C'CEASE'                                                         
*        DC    C'CECUM'                                                         
         DC    C'CEDAR'                                                         
         DC    C'CEDED'                                                         
*        DC    C'CEIBA'                                                         
*        DC    C'CELLA'                                                         
         DC    C'CELLO'                                                         
*        DC    C'CELOM'                                                         
*        DC    C'CENSE'                                                         
*        DC    C'CENTO'                                                         
*        DC    C'CEORL'                                                         
*        DC    C'CERED'                                                         
*        DC    C'CERIA'                                                         
*        DC    C'CERIC'                                                         
*        DC    C'CESTA'                                                         
         DC    C'CHAFE'                                                         
         DC    C'CHAFF'                                                         
         DC    C'CHAIN'                                                         
         DC    C'CHAIR'                                                         
         DC    C'CHALK'                                                         
         DC    C'CHAMP'                                                         
         DC    C'CHANT'                                                         
         DC    C'CHAOS'                                                         
*        DC    C'CHAPE'                                                         
         DC    C'CHARD'                                                         
*        DC    C'CHARE'                                                         
         DC    C'CHARM'                                                         
*        DC    C'CHARR'                                                         
         DC    C'CHART'                                                         
         DC    C'CHARY'                                                         
         DC    C'CHASE'                                                         
         DC    C'CHASM'                                                         
         DC    C'CHEAP'                                                         
         DC    C'CHEAT'                                                         
         DC    C'CHECK'                                                         
         DC    C'CHEEK'                                                         
         DC    C'CHEEP'                                                         
         DC    C'CHEER'                                                         
*        DC    C'CHELA'                                                         
*        DC    C'CHERT'                                                         
         DC    C'CHESS'                                                         
         DC    C'CHEST'                                                         
*        DC    C'CHETH'                                                         
         DC    C'CHEVY'                                                         
         DC    C'CHEWY'                                                         
         DC    C'CHICK'                                                         
         DC    C'CHIDE'                                                         
         DC    C'CHIEF'                                                         
*        DC    C'CHIEL'                                                         
         DC    C'CHILD'                                                         
         DC    C'CHILL'                                                         
*        DC    C'CHIMB'                                                         
         DC    C'CHIME'                                                         
         DC    C'CHIMP'                                                         
         DC    C'CHINA'                                                         
*        DC    C'CHINE'                                                         
         DC    C'CHINK'                                                         
         DC    C'CHINO'                                                         
*        DC    C'CHIRK'                                                         
*        DC    C'CHIRM'                                                         
         DC    C'CHIRP'                                                         
*        DC    C'CHIRR'                                                         
         DC    C'CHIVE'                                                         
         DC    C'CHIVY'                                                         
         DC    C'CHOCK'                                                         
         DC    C'CHOIR'                                                         
         DC    C'CHOKE'                                                         
         DC    C'CHOKY'                                                         
         DC    C'CHOMP'                                                         
         DC    C'CHORD'                                                         
         DC    C'CHORE'                                                         
         DC    C'CHOSE'                                                         
*        DC    C'CHOTT'                                                         
         DC    C'CHUCK'                                                         
*        DC    C'CHUFF'                                                         
         DC    C'CHUMP'                                                         
         DC    C'CHUNK'                                                         
         DC    C'CHURL'                                                         
         DC    C'CHURN'                                                         
*        DC    C'CHURR'                                                         
         DC    C'CHUTE'                                                         
         DC    C'CHYLE'                                                         
*        DC    C'CHYME'                                                         
         DC    C'CIDER'                                                         
         DC    C'CIGAR'                                                         
         DC    C'CILIA'                                                         
*        DC    C'CIMEX'                                                         
         DC    C'CINCH'                                                         
         DC    C'CIRCA'                                                         
*        DC    C'CIRRI'                                                         
         DC    C'CITED'                                                         
         DC    C'CITER'                                                         
         DC    C'CIVET'                                                         
         DC    C'CIVIC'                                                         
         DC    C'CIVIL'                                                         
*        DC    C'CLACK'                                                         
         DC    C'CLAIM'                                                         
         DC    C'CLAMP'                                                         
         DC    C'CLANG'                                                         
         DC    C'CLANK'                                                         
*        DC    C'CLARO'                                                         
*        DC    C'CLARY'                                                         
         DC    C'CLASH'                                                         
         DC    C'CLASP'                                                         
         DC    C'CLASS'                                                         
         DC    C'CLAVE'                                                         
         DC    C'CLEAN'                                                         
         DC    C'CLEAR'                                                         
         DC    C'CLEAT'                                                         
*        DC    C'CLEEK'                                                         
         DC    C'CLEFT'                                                         
*        DC    C'CLEPE'                                                         
         DC    C'CLERK'                                                         
         DC    C'CLICK'                                                         
         DC    C'CLIFF'                                                         
         DC    C'CLIMB'                                                         
         DC    C'CLIME'                                                         
*        DC    C'CLINE'                                                         
         DC    C'CLING'                                                         
         DC    C'CLINK'                                                         
         DC    C'CLOAK'                                                         
         DC    C'CLOCK'                                                         
*        DC    C'CLOMB'                                                         
*        DC    C'CLOMP'                                                         
         DC    C'CLONE'                                                         
*        DC    C'CLONK'                                                         
         DC    C'CLOSE'                                                         
         DC    C'CLOTH'                                                         
         DC    C'CLOUD'                                                         
         DC    C'CLOUT'                                                         
         DC    C'CLOVE'                                                         
         DC    C'CLOWN'                                                         
         DC    C'CLUCK'                                                         
         DC    C'CLUED'                                                         
         DC    C'CLUMP'                                                         
         DC    C'CLUNG'                                                         
         DC    C'CLUNK'                                                         
         DC    C'COACH'                                                         
         DC    C'COACT'                                                         
         DC    C'COAST'                                                         
*        DC    C'COATI'                                                         
*        DC    C'COBLE'                                                         
         DC    C'COBRA'                                                         
*        DC    C'COCCI'                                                         
         DC    C'COCKY'                                                         
         DC    C'COCOA'                                                         
         DC    C'CODED'                                                         
         DC    C'CODER'                                                         
*        DC    C'CODEX'                                                         
*        DC    C'COGON'                                                         
         DC    C'COKED'                                                         
         DC    C'COLIC'                                                         
*        DC    C'COLLY'                                                         
         DC    C'COLON'                                                         
         DC    C'COLOR'                                                         
*        DC    C'COLZA'                                                         
*        DC    C'COMBE'                                                         
         DC    C'COMBO'                                                         
         DC    C'COMER'                                                         
         DC    C'COMET'                                                         
         DC    C'COMFY'                                                         
         DC    C'COMIC'                                                         
         DC    C'COMMA'                                                         
*        DC    C'COMPO'                                                         
         DC    C'CONCH'                                                         
         DC    C'CONED'                                                         
         DC    C'CONEY'                                                         
         DC    C'CONGA'                                                         
*        DC    C'CONGE'                                                         
         DC    C'CONGO'                                                         
         DC    C'CONIC'                                                         
*        DC    C'CONTE'                                                         
*        DC    C'CONTO'                                                         
         DC    C'COOED'                                                         
         DC    C'COOER'                                                         
         DC    C'COOKY'                                                         
*        DC    C'COOMB'                                                         
         DC    C'COOPT'                                                         
         DC    C'COPAL'                                                         
         DC    C'COPED'                                                         
         DC    C'COPER'                                                         
         DC    C'COPRA'                                                         
         DC    C'COPSE'                                                         
         DC    C'CORAL'                                                         
         DC    C'CORED'                                                         
         DC    C'CORER'                                                         
         DC    C'CORGI'                                                         
         DC    C'CORKY'                                                         
*        DC    C'CORNU'                                                         
         DC    C'CORNY'                                                         
         DC    C'CORPS'                                                         
         DC    C'CORSE'                                                         
*        DC    C'COSEC'                                                         
*        DC    C'COSET'                                                         
         DC    C'COSEY'                                                         
*        DC    C'COSIE'                                                         
*        DC    C'COSTA'                                                         
*        DC    C'COTAN'                                                         
         DC    C'COTED'                                                         
         DC    C'COTTA'                                                         
         DC    C'COUCH'                                                         
         DC    C'COUGH'                                                         
         DC    C'COULD'                                                         
         DC    C'COUNT'                                                         
         DC    C'COUPE'                                                         
         DC    C'COURT'                                                         
         DC    C'COUTH'                                                         
         DC    C'COVED'                                                         
         DC    C'COVEN'                                                         
         DC    C'COVER'                                                         
         DC    C'COVET'                                                         
*        DC    C'COVEY'                                                         
*        DC    C'COVIN'                                                         
         DC    C'COWED'                                                         
         DC    C'COWER'                                                         
*        DC    C'COWRY'                                                         
*        DC    C'COZEN'                                                         
         DC    C'CRACK'                                                         
         DC    C'CRAFT'                                                         
*        DC    C'CRAKE'                                                         
         DC    C'CRAMP'                                                         
         DC    C'CRANE'                                                         
         DC    C'CRANK'                                                         
*?       DC    C'CRAPE'                                                         
         DC    C'CRASH'                                                         
         DC    C'CRASS'                                                         
         DC    C'CRATE'                                                         
         DC    C'CRAVE'                                                         
         DC    C'CRAWL'                                                         
         DC    C'CRAZE'                                                         
         DC    C'CRAZY'                                                         
         DC    C'CREAK'                                                         
         DC    C'CREAM'                                                         
         DC    C'CREDO'                                                         
         DC    C'CREED'                                                         
         DC    C'CREEK'                                                         
*        DC    C'CREEL'                                                         
         DC    C'CREEP'                                                         
         DC    C'CREME'                                                         
         DC    C'CREPE'                                                         
         DC    C'CREPT'                                                         
         DC    C'CRESS'                                                         
         DC    C'CREST'                                                         
         DC    C'CRICK'                                                         
         DC    C'CRIED'                                                         
         DC    C'CRIER'                                                         
         DC    C'CRIES'                                                         
         DC    C'CRIME'                                                         
         DC    C'CRIMP'                                                         
         DC    C'CRISP'                                                         
         DC    C'CROAK'                                                         
         DC    C'CROCK'                                                         
*        DC    C'CROFT'                                                         
         DC    C'CRONE'                                                         
         DC    C'CRONY'                                                         
         DC    C'CROOK'                                                         
         DC    C'CROON'                                                         
*        DC    C'CRORE'                                                         
         DC    C'CROSS'                                                         
         DC    C'CROUP'                                                         
         DC    C'CROWD'                                                         
         DC    C'CROWN'                                                         
*        DC    C'CROZE'                                                         
         DC    C'CRUDE'                                                         
         DC    C'CRUEL'                                                         
         DC    C'CRUET'                                                         
         DC    C'CRUMB'                                                         
*        DC    C'CRUMP'                                                         
*        DC    C'CRUOR'                                                         
*        DC    C'CRUSE'                                                         
         DC    C'CRUSH'                                                         
         DC    C'CRUST'                                                         
*        DC    C'CRWTH'                                                         
         DC    C'CRYPT'                                                         
         DC    C'CUBBY'                                                         
*        DC    C'CUBEB'                                                         
         DC    C'CUBED'                                                         
         DC    C'CUBER'                                                         
         DC    C'CUBIC'                                                         
         DC    C'CUBIT'                                                         
         DC    C'CUDDY'                                                         
         DC    C'CUING'                                                         
*        DC    C'CULCH'                                                         
*        DC    C'CULET'                                                         
*        DC    C'CULEX'                                                         
*        DC    C'CULLY'                                                         
         DC    C'CUMIN'                                                         
*        DC    C'CUPEL'                                                         
*        DC    C'CUPPA'                                                         
*        DC    C'CURCH'                                                         
         DC    C'CURDY'                                                         
         DC    C'CURED'                                                         
         DC    C'CURER'                                                         
         DC    C'CURET'                                                         
         DC    C'CURIA'                                                         
         DC    C'CURIE'                                                         
         DC    C'CURIO'                                                         
         DC    C'CURLY'                                                         
         DC    C'CURRY'                                                         
         DC    C'CURSE'                                                         
*        DC    C'CURST'                                                         
         DC    C'CURVE'                                                         
         DC    C'CURVY'                                                         
*        DC    C'CUSEC'                                                         
         DC    C'CUSHY'                                                         
*        DC    C'CUTCH'                                                         
         DC    C'CUTER'                                                         
*        DC    C'CUTIN'                                                         
*        DC    C'CUTIS'                                                         
*        DC    C'CUTTY'                                                         
         DC    C'CYCAD'                                                         
*        DC    C'CYCAS'                                                         
         DC    C'CYCLE'                                                         
*        DC    C'CYDER'                                                         
*        DC    C'CYLIX'                                                         
*        DC    C'CYMAR'                                                         
         DC    C'CYNIC'                                                         
         DC    C'DADDY'                                                         
         DC    C'DAFFY'                                                         
         DC    C'DAILY'                                                         
         DC    C'DAIRY'                                                         
         DC    C'DAISY'                                                         
         DC    C'DALLY'                                                         
*        DC    C'DAMAN'                                                         
*        DC    C'DAMAR'                                                         
         DC    C'DANCE'                                                         
         DC    C'DANDY'                                                         
*        DC    C'DANIO'                                                         
         DC    C'DARED'                                                         
         DC    C'DARER'                                                         
         DC    C'DATED'                                                         
         DC    C'DATER'                                                         
*        DC    C'DATTO'                                                         
         DC    C'DATUM'                                                         
         DC    C'DAUNT'                                                         
*        DC    C'DAVIT'                                                         
         DC    C'DAZED'                                                         
         DC    C'DEALT'                                                         
         DC    C'DEARY'                                                         
         DC    C'DEATH'                                                         
         DC    C'DEBAR'                                                         
         DC    C'DEBIT'                                                         
         DC    C'DEBUG'                                                         
         DC    C'DEBUT'                                                         
         DC    C'DECAL'                                                         
         DC    C'DECAY'                                                         
         DC    C'DECOR'                                                         
         DC    C'DECOY'                                                         
         DC    C'DECRY'                                                         
*        DC    C'DEDAL'                                                         
         DC    C'DEFER'                                                         
*        DC    C'DEGAS'                                                         
         DC    C'DEICE'                                                         
         DC    C'DEIFY'                                                         
         DC    C'DEIGN'                                                         
         DC    C'DEISM'                                                         
         DC    C'DEIST'                                                         
         DC    C'DEITY'                                                         
         DC    C'DELAY'                                                         
         DC    C'DELED'                                                         
         DC    C'DELTA'                                                         
         DC    C'DELVE'                                                         
*        DC    C'DEMIT'                                                         
*        DC    C'DEMOB'                                                         
         DC    C'DEMON'                                                         
*        DC    C'DEMOS'                                                         
         DC    C'DEMUR'                                                         
         DC    C'DENIM'                                                         
         DC    C'DENSE'                                                         
         DC    C'DEPOT'                                                         
         DC    C'DEPTH'                                                         
*        DC    C'DERAY'                                                         
         DC    C'DERBY'                                                         
         DC    C'DERMA'                                                         
         DC    C'DERRY'                                                         
         DC    C'DESEX'                                                         
         DC    C'DETER'                                                         
         DC    C'DEUCE'                                                         
         DC    C'DEVIL'                                                         
*        DC    C'DEWAN'                                                         
*        DC    C'DHOLE'                                                         
*        DC    C'DHOTI'                                                         
         DC    C'DIARY'                                                         
*?       DC    C'DIAZO'                                                         
         DC    C'DICED'                                                         
         DC    C'DICER'                                                         
         DC    C'DICEY'                                                         
*        DC    C'DICKY'                                                         
*        DC    C'DICOT'                                                         
         DC    C'DICTA'                                                         
*        DC    C'DIDST'                                                         
*        DC    C'DIGHT'                                                         
         DC    C'DIGIT'                                                         
         DC    C'DIKED'                                                         
         DC    C'DILDO'                                                         
*        DC    C'DIMER'                                                         
         DC    C'DIMLY'                                                         
         DC    C'DINAR'                                                         
         DC    C'DINED'                                                         
         DC    C'DINER'                                                         
         DC    C'DINGY'                                                         
         DC    C'DINKY'                                                         
         DC    C'DIODE'                                                         
         DC    C'DIPPY'                                                         
         DC    C'DIRER'                                                         
         DC    C'DIRGE'                                                         
         DC    C'DIRTY'                                                         
         DC    C'DITCH'                                                         
         DC    C'DITTO'                                                         
         DC    C'DITTY'                                                         
         DC    C'DIVAN'                                                         
         DC    C'DIVED'                                                         
         DC    C'DIVER'                                                         
         DC    C'DIVOT'                                                         
         DC    C'DIVVY'                                                         
*        DC    C'DIXIT'                                                         
*        DC    C'DIZEN'                                                         
         DC    C'DIZZY'                                                         
*        DC    C'DJINN'                                                         
*        DC    C'DOBLA'                                                         
         DC    C'DODGE'                                                         
         DC    C'DODGY'                                                         
*        DC    C'DOEST'                                                         
*        DC    C'DOETH'                                                         
*        DC    C'DOGGO'                                                         
         DC    C'DOGGY'                                                         
         DC    C'DOGMA'                                                         
         DC    C'DOILY'                                                         
         DC    C'DOING'                                                         
         DC    C'DOLED'                                                         
         DC    C'DOLLY'                                                         
         DC    C'DOLOR'                                                         
*        DC    C'DOMAL'                                                         
         DC    C'DOMED'                                                         
         DC    C'DONEE'                                                         
         DC    C'DONOR'                                                         
         DC    C'DONUT'                                                         
*        DC    C'DORMY'                                                         
*        DC    C'DORTY'                                                         
         DC    C'DOSED'                                                         
         DC    C'DOTED'                                                         
         DC    C'DOTER'                                                         
         DC    C'DOTTY'                                                         
         DC    C'DOUBT'                                                         
*        DC    C'DOUCE'                                                         
         DC    C'DOUGH'                                                         
         DC    C'DOUSE'                                                         
         DC    C'DOWDY'                                                         
         DC    C'DOWEL'                                                         
         DC    C'DOWER'                                                         
         DC    C'DOWNY'                                                         
         DC    C'DOWSE'                                                         
         DC    C'DOYLY'                                                         
         DC    C'DOZED'                                                         
         DC    C'DOZEN'                                                         
         DC    C'DOZER'                                                         
*        DC    C'DRAFF'                                                         
         DC    C'DRAFT'                                                         
         DC    C'DRAIN'                                                         
         DC    C'DRAKE'                                                         
         DC    C'DRAMA'                                                         
         DC    C'DRANK'                                                         
         DC    C'DRAPE'                                                         
*        DC    C'DRAVE'                                                         
         DC    C'DRAWL'                                                         
         DC    C'DRAWN'                                                         
         DC    C'DREAD'                                                         
         DC    C'DREAM'                                                         
         DC    C'DREAR'                                                         
         DC    C'DRECK'                                                         
         DC    C'DREED'                                                         
         DC    C'DRESS'                                                         
*        DC    C'DREST'                                                         
         DC    C'DRIED'                                                         
         DC    C'DRIER'                                                         
         DC    C'DRIES'                                                         
         DC    C'DRIFT'                                                         
         DC    C'DRILL'                                                         
         DC    C'DRILY'                                                         
         DC    C'DRINK'                                                         
*        DC    C'DRIPT'                                                         
         DC    C'DRIVE'                                                         
         DC    C'DROIT'                                                         
         DC    C'DROLL'                                                         
         DC    C'DRONE'                                                         
         DC    C'DROOL'                                                         
         DC    C'DROOP'                                                         
*        DC    C'DROPT'                                                         
         DC    C'DROSS'                                                         
         DC    C'DROVE'                                                         
         DC    C'DROWN'                                                         
         DC    C'DRUID'                                                         
         DC    C'DRUNK'                                                         
*        DC    C'DRUPE'                                                         
*        DC    C'DRUSE'                                                         
*        DC    C'DRYAD'                                                         
         DC    C'DRYER'                                                         
         DC    C'DRYLY'                                                         
         DC    C'DUCAL'                                                         
         DC    C'DUCAT'                                                         
         DC    C'DUCHY'                                                         
         DC    C'DUCKY'                                                         
*        DC    C'DULIA'                                                         
         DC    C'DULSE'                                                         
         DC    C'DUMMY'                                                         
         DC    C'DUMPY'                                                         
         DC    C'DUNCE'                                                         
         DC    C'DUNGY'                                                         
         DC    C'DUPED'                                                         
         DC    C'DUPER'                                                         
         DC    C'DUPLE'                                                         
         DC    C'DURAL'                                                         
*        DC    C'DURED'                                                         
*        DC    C'DURRA'                                                         
*        DC    C'DURST'                                                         
         DC    C'DURUM'                                                         
         DC    C'DUSKY'                                                         
         DC    C'DUSTY'                                                         
         DC    C'DUTCH'                                                         
         DC    C'DWARF'                                                         
         DC    C'DWELL'                                                         
*        DC    C'DWELT'                                                         
         DC    C'DWINE'                                                         
         DC    C'DYING'                                                         
         DC    C'DYKEY'                                                         
         DC    C'EAGER'                                                         
         DC    C'EAGLE'                                                         
*        DC    C'EAGRE'                                                         
         DC    C'EARED'                                                         
         DC    C'EARLY'                                                         
         DC    C'EARTH'                                                         
         DC    C'EASED'                                                         
         DC    C'EASEL'                                                         
         DC    C'EATEN'                                                         
         DC    C'EATER'                                                         
         DC    C'EBBED'                                                         
         DC    C'EBONY'                                                         
         DC    C'ECLAT'                                                         
         DC    C'EDEMA'                                                         
         DC    C'EDGED'                                                         
         DC    C'EDGER'                                                         
         DC    C'EDICT'                                                         
         DC    C'EDIFY'                                                         
         DC    C'EDILE'                                                         
         DC    C'EDUCE'                                                         
         DC    C'EDUCT'                                                         
         DC    C'EERIE'                                                         
*        DC    C'EGEST'                                                         
         DC    C'EGGED'                                                         
         DC    C'EGRET'                                                         
         DC    C'EIDER'                                                         
         DC    C'EIGHT'                                                         
*        DC    C'EIKON'                                                         
         DC    C'EJECT'                                                         
         DC    C'EKING'                                                         
*        DC    C'ELAND'                                                         
         DC    C'ELATE'                                                         
         DC    C'ELBOW'                                                         
         DC    C'ELDER'                                                         
         DC    C'ELECT'                                                         
         DC    C'ELEGY'                                                         
*        DC    C'ELEMI'                                                         
         DC    C'ELFIN'                                                         
         DC    C'ELIDE'                                                         
         DC    C'ELITE'                                                         
*        DC    C'ELOIN'                                                         
         DC    C'ELOPE'                                                         
         DC    C'ELUDE'                                                         
         DC    C'ELUTE'                                                         
*?       DC    C'ELVER'                                                         
         DC    C'ELVES'                                                         
*        DC    C'EMBAY'                                                         
         DC    C'EMBED'                                                         
         DC    C'EMBER'                                                         
         DC    C'EMBOW'                                                         
         DC    C'EMEER'                                                         
         DC    C'EMEND'                                                         
         DC    C'EMERY'                                                         
*        DC    C'EMMER'                                                         
*        DC    C'EMMET'                                                         
         DC    C'EMOTE'                                                         
         DC    C'EMPTY'                                                         
         DC    C'ENACT'                                                         
         DC    C'ENDED'                                                         
         DC    C'ENDOW'                                                         
*        DC    C'ENDUE'                                                         
         DC    C'ENEMA'                                                         
         DC    C'ENEMY'                                                         
         DC    C'ENJOY'                                                         
         DC    C'ENNUI'                                                         
         DC    C'ENROL'                                                         
         DC    C'ENSUE'                                                         
         DC    C'ENTER'                                                         
         DC    C'ENTRY'                                                         
         DC    C'ENURE'                                                         
         DC    C'ENVOI'                                                         
*        DC    C'EOSIN'                                                         
         DC    C'EPACT'                                                         
*        DC    C'EPHAH'                                                         
*        DC    C'EPHOD'                                                         
*        DC    C'EPHOR'                                                         
         DC    C'EPOCH'                                                         
         DC    C'EPODE'                                                         
         DC    C'EPOXY'                                                         
         DC    C'EQUAL'                                                         
         DC    C'EQUIP'                                                         
         DC    C'ERASE'                                                         
         DC    C'ERECT'                                                         
         DC    C'ERGOT'                                                         
         DC    C'ERODE'                                                         
*        DC    C'EROSE'                                                         
         DC    C'ERRED'                                                         
         DC    C'ERROR'                                                         
*        DC    C'ERUCT'                                                         
         DC    C'ERUPT'                                                         
*        DC    C'ESKAR'                                                         
*        DC    C'ESKER'                                                         
         DC    C'ESSAY'                                                         
         DC    C'ESTER'                                                         
         DC    C'ESTOP'                                                         
         DC    C'ETHER'                                                         
         DC    C'ETHIC'                                                         
         DC    C'ETHOS'                                                         
         DC    C'ETHYL'                                                         
         DC    C'ETUDE'                                                         
*        DC    C'ETWEE'                                                         
         DC    C'EVADE'                                                         
         DC    C'EVENT'                                                         
         DC    C'EVERT'                                                         
         DC    C'EVERY'                                                         
         DC    C'EVICT'                                                         
         DC    C'EVOKE'                                                         
         DC    C'EXACT'                                                         
         DC    C'EXCEL'                                                         
         DC    C'EXERT'                                                         
         DC    C'EXILE'                                                         
         DC    C'EXIST'                                                         
         DC    C'EXPEL'                                                         
         DC    C'EXTOL'                                                         
         DC    C'EXTRA'                                                         
         DC    C'EXUDE'                                                         
         DC    C'EXULT'                                                         
         DC    C'EYING'                                                         
         DC    C'EYRIE'                                                         
*        DC    C'EYRIR'                                                         
         DC    C'FABLE'                                                         
         DC    C'FACED'                                                         
         DC    C'FACER'                                                         
         DC    C'FACET'                                                         
         DC    C'FACIA'                                                         
         DC    C'FADED'                                                         
         DC    C'FAERY'                                                         
         DC    C'FAGOT'                                                         
         DC    C'FAINT'                                                         
         DC    C'FAIRY'                                                         
         DC    C'FAITH'                                                         
         DC    C'FAKED'                                                         
         DC    C'FAKIR'                                                         
         DC    C'FALSE'                                                         
         DC    C'FAMED'                                                         
         DC    C'FANCY'                                                         
         DC    C'FANON'                                                         
         DC    C'FARAD'                                                         
         DC    C'FARCE'                                                         
*        DC    C'FARCY'                                                         
         DC    C'FARED'                                                         
         DC    C'FATAL'                                                         
         DC    C'FATED'                                                         
         DC    C'FATLY'                                                         
         DC    C'FATTY'                                                         
*        DC    C'FAUGH'                                                         
         DC    C'FAULT'                                                         
         DC    C'FAUNA'                                                         
*        DC    C'FAUVE'                                                         
         DC    C'FAVOR'                                                         
*        DC    C'FAVUS'                                                         
         DC    C'FAZED'                                                         
         DC    C'FEAST'                                                         
*        DC    C'FEAZE'                                                         
         DC    C'FECAL'                                                         
         DC    C'FECES'                                                         
*        DC    C'FEEZE'                                                         
         DC    C'FEIGN'                                                         
         DC    C'FEINT'                                                         
*        DC    C'FELID'                                                         
*        DC    C'FELLY'                                                         
         DC    C'FELON'                                                         
         DC    C'FEMME'                                                         
         DC    C'FEMUR'                                                         
         DC    C'FENCE'                                                         
*        DC    C'FENNY'                                                         
*        DC    C'FEOFF'                                                         
         DC    C'FERAL'                                                         
*        DC    C'FERIA'                                                         
*        DC    C'FERMI'                                                         
         DC    C'FERNY'                                                         
         DC    C'FERRY'                                                         
*        DC    C'FESSE'                                                         
         DC    C'FETAL'                                                         
         DC    C'FETCH'                                                         
         DC    C'FETED'                                                         
         DC    C'FETID'                                                         
*        DC    C'FETOR'                                                         
         DC    C'FETUS'                                                         
         DC    C'FEVER'                                                         
         DC    C'FEWER'                                                         
         DC    C'FIBER'                                                         
         DC    C'FIBRE'                                                         
*        DC    C'FICHU'                                                         
         DC    C'FIELD'                                                         
         DC    C'FIEND'                                                         
         DC    C'FIERY'                                                         
         DC    C'FIFED'                                                         
         DC    C'FIFER'                                                         
         DC    C'FIFTH'                                                         
         DC    C'FIFTY'                                                         
         DC    C'FIGHT'                                                         
*        DC    C'FILAR'                                                         
         DC    C'FILCH'                                                         
         DC    C'FILED'                                                         
         DC    C'FILET'                                                         
         DC    C'FILLY'                                                         
         DC    C'FILMY'                                                         
         DC    C'FILTH'                                                         
         DC    C'FILUM'                                                         
         DC    C'FINAL'                                                         
         DC    C'FINCH'                                                         
         DC    C'FINED'                                                         
         DC    C'FINER'                                                         
         DC    C'FINIS'                                                         
*        DC    C'FINNY'                                                         
         DC    C'FIORD'                                                         
         DC    C'FIRED'                                                         
         DC    C'FIRER'                                                         
         DC    C'FIRRY'                                                         
         DC    C'FIRST'                                                         
         DC    C'FIRTH'                                                         
         DC    C'FISHY'                                                         
         DC    C'FITCH'                                                         
         DC    C'FITLY'                                                         
         DC    C'FIVER'                                                         
         DC    C'FIXED'                                                         
         DC    C'FIXER'                                                         
         DC    C'FIXES'                                                         
         DC    C'FIZZY'                                                         
*        DC    C'FJELD'                                                         
         DC    C'FJORD'                                                         
         DC    C'FLACK'                                                         
         DC    C'FLAIL'                                                         
         DC    C'FLAIR'                                                         
         DC    C'FLAKE'                                                         
         DC    C'FLAKY'                                                         
         DC    C'FLAME'                                                         
*        DC    C'FLAMY'                                                         
         DC    C'FLANK'                                                         
         DC    C'FLARE'                                                         
         DC    C'FLASH'                                                         
         DC    C'FLASK'                                                         
*        DC    C'FLAXY'                                                         
         DC    C'FLEAM'                                                         
         DC    C'FLECK'                                                         
         DC    C'FLEER'                                                         
         DC    C'FLEET'                                                         
         DC    C'FLESH'                                                         
         DC    C'FLICK'                                                         
         DC    C'FLIED'                                                         
         DC    C'FLIER'                                                         
         DC    C'FLIES'                                                         
         DC    C'FLING'                                                         
         DC    C'FLINT'                                                         
         DC    C'FLIRT'                                                         
*        DC    C'FLITE'                                                         
         DC    C'FLOAT'                                                         
         DC    C'FLOCK'                                                         
         DC    C'FLOOD'                                                         
         DC    C'FLOOR'                                                         
         DC    C'FLORA'                                                         
         DC    C'FLOSS'                                                         
         DC    C'FLOUR'                                                         
         DC    C'FLOUT'                                                         
         DC    C'FLOWN'                                                         
         DC    C'FLUFF'                                                         
         DC    C'FLUID'                                                         
         DC    C'FLUKE'                                                         
         DC    C'FLUKY'                                                         
         DC    C'FLUME'                                                         
         DC    C'FLUMP'                                                         
         DC    C'FLUNG'                                                         
         DC    C'FLUOR'                                                         
         DC    C'FLUSH'                                                         
         DC    C'FLUTE'                                                         
         DC    C'FLUTY'                                                         
         DC    C'FLYER'                                                         
*        DC    C'FLYTE'                                                         
         DC    C'FOAMY'                                                         
         DC    C'FOCAL'                                                         
         DC    C'FOCUS'                                                         
*        DC    C'FOEHN'                                                         
         DC    C'FOGEY'                                                         
         DC    C'FOGGY'                                                         
         DC    C'FOIST'                                                         
*        DC    C'FOLIA'                                                         
         DC    C'FOLIO'                                                         
         DC    C'FOLLY'                                                         
         DC    C'FONDU'                                                         
*        DC    C'FOOTY'                                                         
         DC    C'FORAY'                                                         
*        DC    C'FORBY'                                                         
         DC    C'FORCE'                                                         
*        DC    C'FORDO'                                                         
         DC    C'FORGE'                                                         
         DC    C'FORGO'                                                         
         DC    C'FORTE'                                                         
         DC    C'FORTH'                                                         
         DC    C'FORTY'                                                         
         DC    C'FORUM'                                                         
*        DC    C'FOSSA'                                                         
*        DC    C'FOSSE'                                                         
         DC    C'FOUNT'                                                         
*        DC    C'FOVEA'                                                         
         DC    C'FOYER'                                                         
         DC    C'FRAIL'                                                         
         DC    C'FRAME'                                                         
         DC    C'FRANC'                                                         
         DC    C'FRANK'                                                         
         DC    C'FRAUD'                                                         
         DC    C'FREAK'                                                         
         DC    C'FREED'                                                         
         DC    C'FREER'                                                         
         DC    C'FRESH'                                                         
         DC    C'FRIAR'                                                         
         DC    C'FRIED'                                                         
         DC    C'FRIER'                                                         
         DC    C'FRIES'                                                         
         DC    C'FRILL'                                                         
*        DC    C'FRISE'                                                         
         DC    C'FRISK'                                                         
         DC    C'FRITH'                                                         
         DC    C'FRITZ'                                                         
         DC    C'FROCK'                                                         
         DC    C'FROND'                                                         
*        DC    C'FRONS'                                                         
         DC    C'FRONT'                                                         
         DC    C'FRORE'                                                         
         DC    C'FROST'                                                         
         DC    C'FROTH'                                                         
         DC    C'FROWN'                                                         
         DC    C'FROZE'                                                         
         DC    C'FRUIT'                                                         
         DC    C'FRUMP'                                                         
         DC    C'FRYER'                                                         
*        DC    C'FUBSY'                                                         
*        DC    C'FUCUS'                                                         
         DC    C'FUDGE'                                                         
         DC    C'FUGAL'                                                         
*        DC    C'FUGGY'                                                         
         DC    C'FUGUE'                                                         
         DC    C'FULLY'                                                         
         DC    C'FUMED'                                                         
         DC    C'FUNGI'                                                         
         DC    C'FUNKY'                                                         
         DC    C'FUNNY'                                                         
*        DC    C'FURAN'                                                         
         DC    C'FUROR'                                                         
         DC    C'FURRY'                                                         
*        DC    C'FURZE'                                                         
*        DC    C'FURZY'                                                         
         DC    C'FUSED'                                                         
*        DC    C'FUSEE'                                                         
*?       DC    C'FUSIL'                                                         
         DC    C'FUSSY'                                                         
*        DC    C'FUSTY'                                                         
*        DC    C'FUZED'                                                         
         DC    C'FUZZY'                                                         
         DC    C'GABBY'                                                         
         DC    C'GABLE'                                                         
         DC    C'GAFFE'                                                         
         DC    C'GAGED'                                                         
         DC    C'GAILY'                                                         
*        DC    C'GALAH'                                                         
*        DC    C'GALEA'                                                         
*        DC    C'GALOP'                                                         
*        DC    C'GAMBE'                                                         
         DC    C'GAMED'                                                         
*        DC    C'GAMIC'                                                         
         DC    C'GAMIN'                                                         
         DC    C'GAMMA'                                                         
         DC    C'GAMUT'                                                         
*        DC    C'GANEF'                                                         
*        DC    C'GANJA'                                                         
         DC    C'GAPED'                                                         
         DC    C'GAPER'                                                         
*        DC    C'GARTH'                                                         
         DC    C'GASSY'                                                         
         DC    C'GATED'                                                         
         DC    C'GAUDY'                                                         
         DC    C'GAUGE'                                                         
         DC    C'GAUNT'                                                         
         DC    C'GAUSS'                                                         
         DC    C'GAUZE'                                                         
         DC    C'GAUZY'                                                         
         DC    C'GAVEL'                                                         
         DC    C'GAVOT'                                                         
         DC    C'GAWKY'                                                         
         DC    C'GAYER'                                                         
         DC    C'GAYLY'                                                         
         DC    C'GAZED'                                                         
         DC    C'GECKO'                                                         
         DC    C'GEESE'                                                         
         DC    C'GELID'                                                         
         DC    C'GEMMA'                                                         
         DC    C'GEMMY'                                                         
*        DC    C'GEMOT'                                                         
*        DC    C'GENET'                                                         
         DC    C'GENIC'                                                         
         DC    C'GENIE'                                                         
         DC    C'GENII'                                                         
         DC    C'GENRE'                                                         
*        DC    C'GENRO'                                                         
*        DC    C'GENUA'                                                         
         DC    C'GENUS'                                                         
         DC    C'GEODE'                                                         
*        DC    C'GEOID'                                                         
*        DC    C'GERAH'                                                         
*        DC    C'GESSO'                                                         
         DC    C'GETUP'                                                         
*        DC    C'GHAUT'                                                         
*        DC    C'GHAZI'                                                         
         DC    C'GHOST'                                                         
         DC    C'GHOUL'                                                         
*        DC    C'GHYLL'                                                         
         DC    C'GIANT'                                                         
         DC    C'GIBED'                                                         
         DC    C'GIBER'                                                         
         DC    C'GIDDY'                                                         
         DC    C'GIGOT'                                                         
         DC    C'GIGUE'                                                         
*        DC    C'GILLY'                                                         
*        DC    C'GIMEL'                                                         
*        DC    C'GIPON'                                                         
*        DC    C'GIPSY'                                                         
         DC    C'GIRLY'                                                         
         DC    C'GIRTH'                                                         
         DC    C'GIVEN'                                                         
         DC    C'GIVER'                                                         
         DC    C'GLACE'                                                         
         DC    C'GLADE'                                                         
*        DC    C'GLAIR'                                                         
         DC    C'GLAND'                                                         
         DC    C'GLANS'                                                         
         DC    C'GLARE'                                                         
         DC    C'GLARY'                                                         
         DC    C'GLASS'                                                         
         DC    C'GLAZE'                                                         
         DC    C'GLEAM'                                                         
         DC    C'GLEAN'                                                         
*        DC    C'GLEBE'                                                         
*        DC    C'GLEDE'                                                         
*        DC    C'GLEED'                                                         
*        DC    C'GLEET'                                                         
*        DC    C'GLIAL'                                                         
         DC    C'GLIDE'                                                         
         DC    C'GLINT'                                                         
         DC    C'GLOAT'                                                         
         DC    C'GLOBE'                                                         
*        DC    C'GLOGG'                                                         
         DC    C'GLOOM'                                                         
         DC    C'GLORY'                                                         
         DC    C'GLOSS'                                                         
         DC    C'GLOVE'                                                         
*        DC    C'GLOZE'                                                         
         DC    C'GLUED'                                                         
         DC    C'GLUER'                                                         
         DC    C'GLUEY'                                                         
*        DC    C'GLUME'                                                         
         DC    C'GLYPH'                                                         
         DC    C'GNARL'                                                         
         DC    C'GNARR'                                                         
         DC    C'GNASH'                                                         
*        DC    C'GNAWN'                                                         
         DC    C'GNOME'                                                         
         DC    C'GODLY'                                                         
         DC    C'GOING'                                                         
*        DC    C'GOLEM'                                                         
         DC    C'GOLLY'                                                         
         DC    C'GONAD'                                                         
*        DC    C'GONEF'                                                         
         DC    C'GONER'                                                         
*        DC    C'GONIF'                                                         
*        DC    C'GONOF'                                                         
         DC    C'GOODS'                                                         
         DC    C'GOODY'                                                         
         DC    C'GOOFY'                                                         
         DC    C'GOOSE'                                                         
*        DC    C'GORAL'                                                         
         DC    C'GORED'                                                         
         DC    C'GORGE'                                                         
*        DC    C'GORSE'                                                         
*        DC    C'GORSY'                                                         
         DC    C'GOUGE'                                                         
         DC    C'GOURD'                                                         
         DC    C'GOUTY'                                                         
         DC    C'GRACE'                                                         
         DC    C'GRADE'                                                         
         DC    C'GRAFT'                                                         
         DC    C'GRAIL'                                                         
         DC    C'GRAIN'                                                         
         DC    C'GRAND'                                                         
         DC    C'GRANT'                                                         
         DC    C'GRAPE'                                                         
         DC    C'GRAPH'                                                         
         DC    C'GRAPY'                                                         
         DC    C'GRASP'                                                         
         DC    C'GRASS'                                                         
         DC    C'GRATE'                                                         
         DC    C'GRAVE'                                                         
         DC    C'GRAZE'                                                         
         DC    C'GREAT'                                                         
*        DC    C'GREBE'                                                         
         DC    C'GREED'                                                         
         DC    C'GREEN'                                                         
         DC    C'GREET'                                                         
*        DC    C'GREGO'                                                         
*        DC    C'GRIDE'                                                         
         DC    C'GRIEF'                                                         
         DC    C'GRILL'                                                         
         DC    C'GRIME'                                                         
         DC    C'GRIMY'                                                         
         DC    C'GRIND'                                                         
         DC    C'GRIPE'                                                         
*        DC    C'GRIPT'                                                         
         DC    C'GRIST'                                                         
*        DC    C'GRITH'                                                         
         DC    C'GROAN'                                                         
         DC    C'GROAT'                                                         
         DC    C'GROIN'                                                         
         DC    C'GROOM'                                                         
         DC    C'GROPE'                                                         
         DC    C'GROSS'                                                         
*        DC    C'GROSZ'                                                         
         DC    C'GROUP'                                                         
         DC    C'GROUT'                                                         
         DC    C'GROVE'                                                         
         DC    C'GROWL'                                                         
         DC    C'GROWN'                                                         
         DC    C'GRUEL'                                                         
         DC    C'GRUFF'                                                         
*        DC    C'GRUME'                                                         
         DC    C'GRUMP'                                                         
         DC    C'GRUNT'                                                         
*        DC    C'GUACO'                                                         
         DC    C'GUANO'                                                         
         DC    C'GUARD'                                                         
         DC    C'GUAVA'                                                         
         DC    C'GUESS'                                                         
         DC    C'GUEST'                                                         
         DC    C'GUIDE'                                                         
         DC    C'GUILD'                                                         
         DC    C'GUILE'                                                         
         DC    C'GUILT'                                                         
         DC    C'GUISE'                                                         
*        DC    C'GULAR'                                                         
*        DC    C'GULFY'                                                         
         DC    C'GULLY'                                                         
*        DC    C'GUMMA'                                                         
         DC    C'GUMMY'                                                         
         DC    C'GUNNY'                                                         
         DC    C'GUPPY'                                                         
*        DC    C'GURGE'                                                         
         DC    C'GUSHY'                                                         
         DC    C'GUSTO'                                                         
         DC    C'GUSTY'                                                         
         DC    C'GUTSY'                                                         
*        DC    C'GUTTA'                                                         
         DC    C'GUTTY'                                                         
*        DC    C'GYBED'                                                         
         DC    C'GYPSY'                                                         
         DC    C'GYRAL'                                                         
         DC    C'GYRED'                                                         
*        DC    C'GYRUS'                                                         
*        DC    C'GYVED'                                                         
         DC    C'HABIT'                                                         
*        DC    C'HADJI'                                                         
*        DC    C'HADST'                                                         
*        DC    C'HAFIZ'                                                         
*        DC    C'HAIKU'                                                         
         DC    C'HAIRY'                                                         
*        DC    C'HAJJI'                                                         
*        DC    C'HAKIM'                                                         
         DC    C'HALED'                                                         
         DC    C'HALER'                                                         
         DC    C'HALLO'                                                         
         DC    C'HALVA'                                                         
         DC    C'HALVE'                                                         
*        DC    C'HAMAL'                                                         
         DC    C'HAMMY'                                                         
         DC    C'HANDY'                                                         
*        DC    C'HANSE'                                                         
*        DC    C'HAPLY'                                                         
         DC    C'HAPPY'                                                         
*        DC    C'HARDS'                                                         
         DC    C'HARDY'                                                         
         DC    C'HAREM'                                                         
         DC    C'HARRY'                                                         
         DC    C'HARSH'                                                         
         DC    C'HASTE'                                                         
         DC    C'HASTY'                                                         
         DC    C'HATCH'                                                         
         DC    C'HATED'                                                         
         DC    C'HATER'                                                         
*        DC    C'HAULM'                                                         
         DC    C'HAUNT'                                                         
         DC    C'HAVEN'                                                         
         DC    C'HAVER'                                                         
         DC    C'HAVOC'                                                         
         DC    C'HAWSE'                                                         
*        DC    C'HAZAN'                                                         
         DC    C'HAZED'                                                         
         DC    C'HAZEL'                                                         
         DC    C'HEADY'                                                         
         DC    C'HEARD'                                                         
         DC    C'HEART'                                                         
         DC    C'HEATH'                                                         
         DC    C'HEAVE'                                                         
         DC    C'HEAVY'                                                         
         DC    C'HEDGE'                                                         
         DC    C'HEFTY'                                                         
*        DC    C'HEIGH'                                                         
         DC    C'HELIX'                                                         
         DC    C'HELLO'                                                         
*        DC    C'HELVE'                                                         
*        DC    C'HEMAL'                                                         
*        DC    C'HEMIC'                                                         
*        DC    C'HEMIN'                                                         
         DC    C'HENNA'                                                         
         DC    C'HERBY'                                                         
         DC    C'HERON'                                                         
         DC    C'HERTZ'                                                         
         DC    C'HEWED'                                                         
         DC    C'HEWER'                                                         
         DC    C'HEXAD'                                                         
         DC    C'HEXED'                                                         
*        DC    C'HEXYL'                                                         
         DC    C'HIDED'                                                         
         DC    C'HIDER'                                                         
*        DC    C'HIGHT'                                                         
         DC    C'HIKED'                                                         
         DC    C'HIKER'                                                         
*        DC    C'HILAR'                                                         
*        DC    C'HILLO'                                                         
         DC    C'HILLY'                                                         
*        DC    C'HILUM'                                                         
*        DC    C'HILUS'                                                         
         DC    C'HINGE'                                                         
*        DC    C'HINNY'                                                         
         DC    C'HIPPO'                                                         
         DC    C'HIRED'                                                         
         DC    C'HIRER'                                                         
         DC    C'HITCH'                                                         
         DC    C'HIVED'                                                         
         DC    C'HOARD'                                                         
         DC    C'HOARY'                                                         
         DC    C'HOBBY'                                                         
*        DC    C'HOCUS'                                                         
*        DC    C'HOICK'                                                         
*        DC    C'HOISE'                                                         
         DC    C'HOIST'                                                         
*        DC    C'HOKKU'                                                         
         DC    C'HOLED'                                                         
         DC    C'HOLEY'                                                         
*        DC    C'HOLLA'                                                         
*        DC    C'HOLLO'                                                         
         DC    C'HOLLY'                                                         
         DC    C'HOMED'                                                         
         DC    C'HOMER'                                                         
         DC    C'HOMEY'                                                         
         DC    C'HONED'                                                         
         DC    C'HONER'                                                         
         DC    C'HONEY'                                                         
         DC    C'HONOR'                                                         
*        DC    C'HOOKA'                                                         
         DC    C'HOPED'                                                         
         DC    C'HOPER'                                                         
         DC    C'HORAL'                                                         
         DC    C'HORDE'                                                         
         DC    C'HORNY'                                                         
         DC    C'HORSE'                                                         
*        DC    C'HORST'                                                         
         DC    C'HORSY'                                                         
         DC    C'HOSED'                                                         
*        DC    C'HOSEN'                                                         
         DC    C'HOTEL'                                                         
         DC    C'HOTLY'                                                         
         DC    C'HOUND'                                                         
*        DC    C'HOURI'                                                         
         DC    C'HOUSE'                                                         
         DC    C'HOVEL'                                                         
         DC    C'HOVER'                                                         
         DC    C'HOWDY'                                                         
*        DC    C'HUBBY'                                                         
         DC    C'HUFFY'                                                         
         DC    C'HULKY'                                                         
*        DC    C'HULLO'                                                         
         DC    C'HUMAN'                                                         
*        DC    C'HUMIC'                                                         
         DC    C'HUMID'                                                         
         DC    C'HUMOR'                                                         
*        DC    C'HUMPH'                                                         
         DC    C'HUMPY'                                                         
         DC    C'HUMUS'                                                         
         DC    C'HUNCH'                                                         
         DC    C'HURLY'                                                         
         DC    C'HURRY'                                                         
         DC    C'HUSKY'                                                         
         DC    C'HUSSY'                                                         
         DC    C'HUTCH'                                                         
*        DC    C'HUZZA'                                                         
         DC    C'HYDRO'                                                         
         DC    C'HYENA'                                                         
         DC    C'HYING'                                                         
         DC    C'HYMEN'                                                         
*        DC    C'HYOID'                                                         
*        DC    C'HYRAX'                                                         
*        DC    C'HYSON'                                                         
*        DC    C'ICHOR'                                                         
         DC    C'ICIER'                                                         
         DC    C'ICILY'                                                         
         DC    C'ICING'                                                         
*        DC    C'ICTUS'                                                         
         DC    C'IDEAL'                                                         
         DC    C'IDIOM'                                                         
         DC    C'IDIOT'                                                         
         DC    C'IDLED'                                                         
         DC    C'IDLER'                                                         
         DC    C'IDYLL'                                                         
         DC    C'IGLOO'                                                         
*        DC    C'IHRAM'                                                         
         DC    C'ILEAC'                                                         
         DC    C'ILEUM'                                                         
         DC    C'ILEUS'                                                         
         DC    C'ILIAC'                                                         
         DC    C'ILIUM'                                                         
         DC    C'IMAGE'                                                         
         DC    C'IMAGO'                                                         
         DC    C'IMBED'                                                         
         DC    C'IMBUE'                                                         
*        DC    C'IMIDE'                                                         
*        DC    C'IMIDO'                                                         
*        DC    C'IMINE'                                                         
*        DC    C'IMINO'                                                         
*        DC    C'IMMIX'                                                         
         DC    C'IMPED'                                                         
         DC    C'IMPEL'                                                         
         DC    C'IMPLY'                                                         
         DC    C'INANE'                                                         
         DC    C'INAPT'                                                         
         DC    C'INCUR'                                                         
*        DC    C'INCUS'                                                         
         DC    C'INDEX'                                                         
*        DC    C'INDRI'                                                         
*        DC    C'INDUE'                                                         
         DC    C'INEPT'                                                         
         DC    C'INERT'                                                         
         DC    C'INFER'                                                         
*        DC    C'INFIX'                                                         
*        DC    C'INGLE'                                                         
         DC    C'INGOT'                                                         
         DC    C'INION'                                                         
         DC    C'INKED'                                                         
         DC    C'INKER'                                                         
*        DC    C'INKLE'                                                         
         DC    C'INLAY'                                                         
         DC    C'INLET'                                                         
         DC    C'INNER'                                                         
         DC    C'INPUT'                                                         
         DC    C'INSET'                                                         
         DC    C'INTER'                                                         
         DC    C'INURE'                                                         
*        DC    C'INURN'                                                         
*        DC    C'IODIC'                                                         
         DC    C'IONIC'                                                         
         DC    C'IRADE'                                                         
         DC    C'IRATE'                                                         
         DC    C'IRKED'                                                         
         DC    C'IRONY'                                                         
         DC    C'ISLED'                                                         
         DC    C'ISLET'                                                         
         DC    C'ISSUE'                                                         
*        DC    C'ISTLE'                                                         
         DC    C'ITCHY'                                                         
         DC    C'IVORY'                                                         
*        DC    C'IXTLE'                                                         
*        DC    C'JABOT'                                                         
         DC    C'JADED'                                                         
*        DC    C'JAGER'                                                         
*        DC    C'JAGGY'                                                         
*        DC    C'JAKES'                                                         
*        DC    C'JALAP'                                                         
*        DC    C'JAPAN'                                                         
*        DC    C'JAPED'                                                         
*        DC    C'JAPER'                                                         
         DC    C'JAUNT'                                                         
*        DC    C'JEBEL'                                                         
*        DC    C'JEHAD'                                                         
         DC    C'JELLY'                                                         
*        DC    C'JEMMY'                                                         
*        DC    C'JENNY'                                                         
         DC    C'JERKY'                                                         
         DC    C'JETTY'                                                         
         DC    C'JEWEL'                                                         
         DC    C'JIBED'                                                         
         DC    C'JIBER'                                                         
         DC    C'JIFFY'                                                         
*        DC    C'JIHAD'                                                         
         DC    C'JIMMY'                                                         
         DC    C'JINGO'                                                         
*        DC    C'JINNI'                                                         
*        DC    C'JOCKO'                                                         
         DC    C'JOINT'                                                         
         DC    C'JOIST'                                                         
         DC    C'JOKED'                                                         
         DC    C'JOKER'                                                         
         DC    C'JOLLY'                                                         
*        DC    C'JOLTY'                                                         
         DC    C'JORUM'                                                         
         DC    C'JOULE'                                                         
         DC    C'JOUST'                                                         
         DC    C'JOWLY'                                                         
         DC    C'JOYED'                                                         
         DC    C'JUDGE'                                                         
*        DC    C'JUGAL'                                                         
*        DC    C'JUGUM'                                                         
         DC    C'JUICE'                                                         
         DC    C'JUICY'                                                         
         DC    C'JULEP'                                                         
         DC    C'JUMBO'                                                         
         DC    C'JUMPY'                                                         
*        DC    C'JUNCO'                                                         
         DC    C'JUNKY'                                                         
         DC    C'JUNTA'                                                         
*        DC    C'JUPON'                                                         
*        DC    C'JURAL'                                                         
*        DC    C'JURAT'                                                         
*        DC    C'JUREL'                                                         
         DC    C'JUROR'                                                         
         DC    C'JUTTY'                                                         
         DC    C'KABOB'                                                         
         DC    C'KAFIR'                                                         
*        DC    C'KAIAK'                                                         
         DC    C'KALIF'                                                         
         DC    C'KAPOK'                                                         
*        DC    C'KAPPA'                                                         
         DC    C'KAPUT'                                                         
         DC    C'KARAT'                                                         
         DC    C'KARMA'                                                         
*        DC    C'KARST'                                                         
*        DC    C'KAURI'                                                         
         DC    C'KAYAK'                                                         
         DC    C'KAZOO'                                                         
         DC    C'KEBAB'                                                         
*        DC    C'KEDGE'                                                         
*        DC    C'KEFIR'                                                         
         DC    C'KELPY'                                                         
         DC    C'KEMPT'                                                         
*        DC    C'KENAF'                                                         
*        DC    C'KENCH'                                                         
*        DC    C'KENDO'                                                         
*        DC    C'KERNE'                                                         
         DC    C'KETCH'                                                         
*        DC    C'KEVEL'                                                         
         DC    C'KEYED'                                                         
*        DC    C'KHADI'                                                         
         DC    C'KHAKI'                                                         
*        DC    C'KIANG'                                                         
*        DC    C'KIDDY'                                                         
*        DC    C'KININ'                                                         
         DC    C'KINKY'                                                         
         DC    C'KIOSK'                                                         
         DC    C'KITED'                                                         
*        DC    C'KITHE'                                                         
         DC    C'KITTY'                                                         
         DC    C'KNACK'                                                         
         DC    C'KNAVE'                                                         
         DC    C'KNEAD'                                                         
         DC    C'KNEED'                                                         
         DC    C'KNEEL'                                                         
         DC    C'KNELL'                                                         
         DC    C'KNELT'                                                         
         DC    C'KNIFE'                                                         
         DC    C'KNOCK'                                                         
         DC    C'KNOLL'                                                         
*        DC    C'KNOUT'                                                         
         DC    C'KNOWN'                                                         
         DC    C'KNURL'                                                         
         DC    C'KOALA'                                                         
*        DC    C'KOINE'                                                         
         DC    C'KOPEK'                                                         
*        DC    C'KORUN'                                                         
*        DC    C'KRAAL'                                                         
         DC    C'KRAFT'                                                         
*        DC    C'KRAIT'                                                         
         DC    C'KRILL'                                                         
         DC    C'KRONA'                                                         
         DC    C'KRONE'                                                         
*        DC    C'KULAK'                                                         
*        DC    C'KVASS'                                                         
         DC    C'LABEL'                                                         
         DC    C'LABIA'                                                         
         DC    C'LABOR'                                                         
*        DC    C'LABRA'                                                         
         DC    C'LACED'                                                         
         DC    C'LADED'                                                         
         DC    C'LADEN'                                                         
         DC    C'LADLE'                                                         
*        DC    C'LAGAN'                                                         
*        DC    C'LAIGH'                                                         
         DC    C'LAIRD'                                                         
         DC    C'LAITY'                                                         
         DC    C'LAMED'                                                         
*        DC    C'LAMIA'                                                         
         DC    C'LANCE'                                                         
         DC    C'LANKY'                                                         
         DC    C'LAPEL'                                                         
*        DC    C'LAPIN'                                                         
         DC    C'LAPSE'                                                         
         DC    C'LARCH'                                                         
         DC    C'LARDY'                                                         
*        DC    C'LARES'                                                         
         DC    C'LARGE'                                                         
         DC    C'LARGO'                                                         
         DC    C'LARKY'                                                         
         DC    C'LARVA'                                                         
         DC    C'LASED'                                                         
         DC    C'LASER'                                                         
         DC    C'LASSO'                                                         
         DC    C'LATCH'                                                         
*        DC    C'LATED'                                                         
         DC    C'LATER'                                                         
         DC    C'LATEX'                                                         
         DC    C'LATHE'                                                         
         DC    C'LATHY'                                                         
         DC    C'LAUGH'                                                         
         DC    C'LAVED'                                                         
         DC    C'LAVER'                                                         
         DC    C'LAWED'                                                         
         DC    C'LAXLY'                                                         
         DC    C'LAYER'                                                         
*        DC    C'LAZAR'                                                         
         DC    C'LAZED'                                                         
         DC    C'LEACH'                                                         
         DC    C'LEADY'                                                         
         DC    C'LEAFY'                                                         
         DC    C'LEAKY'                                                         
*        DC    C'LEANT'                                                         
         DC    C'LEAPT'                                                         
         DC    C'LEARN'                                                         
         DC    C'LEARY'                                                         
         DC    C'LEASE'                                                         
         DC    C'LEASH'                                                         
         DC    C'LEAST'                                                         
         DC    C'LEAVE'                                                         
*        DC    C'LEAVY'                                                         
         DC    C'LEDGE'                                                         
         DC    C'LEDGY'                                                         
         DC    C'LEECH'                                                         
         DC    C'LEERY'                                                         
         DC    C'LEGAL'                                                         
*        DC    C'LEGER'                                                         
         DC    C'LEGGY'                                                         
         DC    C'LEGIT'                                                         
*        DC    C'LEHUA'                                                         
*        DC    C'LEMAN'                                                         
         DC    C'LEMMA'                                                         
         DC    C'LEMON'                                                         
         DC    C'LEMUR'                                                         
*        DC    C'LENIS'                                                         
*        DC    C'LEONE'                                                         
         DC    C'LEPER'                                                         
         DC    C'LETCH'                                                         
         DC    C'LEVEE'                                                         
         DC    C'LEVEL'                                                         
         DC    C'LEVER'                                                         
*        DC    C'LEVIN'                                                         
*        DC    C'LEWIS'                                                         
*        DC    C'LIANA'                                                         
*        DC    C'LIANE'                                                         
         DC    C'LIBEL'                                                         
         DC    C'LIBRA'                                                         
*        DC    C'LICHT'                                                         
         DC    C'LICIT'                                                         
*        DC    C'LIDAR'                                                         
         DC    C'LIGHT'                                                         
         DC    C'LIKED'                                                         
         DC    C'LIKEN'                                                         
         DC    C'LIKER'                                                         
         DC    C'LILAC'                                                         
         DC    C'LIMBO'                                                         
         DC    C'LIMED'                                                         
         DC    C'LIMEN'                                                         
         DC    C'LIMES'                                                         
         DC    C'LIMIT'                                                         
*        DC    C'LINAC'                                                         
         DC    C'LINED'                                                         
         DC    C'LINEN'                                                         
         DC    C'LINER'                                                         
         DC    C'LINGO'                                                         
*        DC    C'LININ'                                                         
         DC    C'LINTY'                                                         
         DC    C'LIPID'                                                         
         DC    C'LIPPY'                                                         
         DC    C'LISLE'                                                         
         DC    C'LITER'                                                         
         DC    C'LITHE'                                                         
         DC    C'LITHO'                                                         
         DC    C'LITRE'                                                         
         DC    C'LIVED'                                                         
         DC    C'LIVEN'                                                         
         DC    C'LIVER'                                                         
         DC    C'LIVES'                                                         
         DC    C'LIVID'                                                         
         DC    C'LLAMA'                                                         
*        DC    C'LLANO'                                                         
*        DC    C'LOACH'                                                         
         DC    C'LOAMY'                                                         
         DC    C'LOATH'                                                         
         DC    C'LOBAR'                                                         
         DC    C'LOBBY'                                                         
         DC    C'LOBED'                                                         
         DC    C'LOCAL'                                                         
         DC    C'LOCUS'                                                         
         DC    C'LODEN'                                                         
         DC    C'LODGE'                                                         
*        DC    C'LOESS'                                                         
         DC    C'LOFTY'                                                         
*        DC    C'LOGIA'                                                         
         DC    C'LOGIC'                                                         
         DC    C'LOLLY'                                                         
*        DC    C'LONGE'                                                         
*        DC    C'LOOBY'                                                         
*        DC    C'LOOED'                                                         
*        DC    C'LOOEY'                                                         
*        DC    C'LOOIE'                                                         
         DC    C'LOOPY'                                                         
         DC    C'LOOSE'                                                         
         DC    C'LOPED'                                                         
*        DC    C'LORAL'                                                         
*        DC    C'LORIS'                                                         
*        DC    C'LOSEL'                                                         
         DC    C'LOSER'                                                         
*        DC    C'LOTAH'                                                         
         DC    C'LOTIC'                                                         
*        DC    C'LOTTO'                                                         
         DC    C'LOTUS'                                                         
*        DC    C'LOUGH'                                                         
*        DC    C'LOUIS'                                                         
         DC    C'LOUPE'                                                         
         DC    C'LOUSE'                                                         
         DC    C'LOUSY'                                                         
         DC    C'LOVED'                                                         
         DC    C'LOVER'                                                         
         DC    C'LOWED'                                                         
         DC    C'LOWER'                                                         
         DC    C'LOWLY'                                                         
         DC    C'LOYAL'                                                         
*        DC    C'LUCES'                                                         
         DC    C'LUCID'                                                         
         DC    C'LUCKY'                                                         
         DC    C'LUCRE'                                                         
*        DC    C'LUFFA'                                                         
         DC    C'LUMEN'                                                         
         DC    C'LUMPY'                                                         
         DC    C'LUNAR'                                                         
         DC    C'LUNCH'                                                         
         DC    C'LUNES'                                                         
         DC    C'LUNGE'                                                         
*        DC    C'LUNGI'                                                         
         DC    C'LUPUS'                                                         
         DC    C'LURCH'                                                         
         DC    C'LURED'                                                         
         DC    C'LURER'                                                         
         DC    C'LURID'                                                         
         DC    C'LUSTY'                                                         
         DC    C'LUTED'                                                         
         DC    C'LYING'                                                         
         DC    C'LYMPH'                                                         
         DC    C'LYNCH'                                                         
         DC    C'LYRIC'                                                         
         DC    C'LYSED'                                                         
*        DC    C'LYSIN'                                                         
*        DC    C'LYSIS'                                                         
*        DC    C'LYTIC'                                                         
*        DC    C'LYTTA'                                                         
         DC    C'MACAW'                                                         
         DC    C'MACED'                                                         
         DC    C'MACER'                                                         
*        DC    C'MACLE'                                                         
         DC    C'MADAM'                                                         
         DC    C'MADLY'                                                         
*        DC    C'MAFIC'                                                         
         DC    C'MAGIC'                                                         
         DC    C'MAGMA'                                                         
*        DC    C'MAIST'                                                         
         DC    C'MAIZE'                                                         
         DC    C'MAJOR'                                                         
         DC    C'MAKER'                                                         
*        DC    C'MALAR'                                                         
         DC    C'MALTY'                                                         
         DC    C'MAMBA'                                                         
         DC    C'MAMMA'                                                         
         DC    C'MAMMY'                                                         
         DC    C'MANED'                                                         
         DC    C'MANGE'                                                         
         DC    C'MANGO'                                                         
         DC    C'MANGY'                                                         
         DC    C'MANIA'                                                         
         DC    C'MANIC'                                                         
         DC    C'MANLY'                                                         
         DC    C'MANNA'                                                         
         DC    C'MANOR'                                                         
         DC    C'MANSE'                                                         
*        DC    C'MANTA'                                                         
*        DC    C'MANUS'                                                         
         DC    C'MAPLE'                                                         
*        DC    C'MAQUI'                                                         
         DC    C'MARCH'                                                         
         DC    C'MARGE'                                                         
         DC    C'MARIA'                                                         
*        DC    C'MARLY'                                                         
         DC    C'MARRY'                                                         
         DC    C'MARSH'                                                         
         DC    C'MASON'                                                         
         DC    C'MASSE'                                                         
*        DC    C'MASSY'                                                         
         DC    C'MATCH'                                                         
         DC    C'MATED'                                                         
         DC    C'MATER'                                                         
         DC    C'MATEY'                                                         
         DC    C'MATIN'                                                         
         DC    C'MATTE'                                                         
         DC    C'MATZO'                                                         
*        DC    C'MAUND'                                                         
         DC    C'MAUVE'                                                         
         DC    C'MAVIS'                                                         
         DC    C'MAXIM'                                                         
         DC    C'MAYBE'                                                         
         DC    C'MAYOR'                                                         
*        DC    C'MAYST'                                                         
         DC    C'MAZED'                                                         
*        DC    C'MAZER'                                                         
         DC    C'MEALY'                                                         
         DC    C'MEANS'                                                         
         DC    C'MEANT'                                                         
         DC    C'MEATY'                                                         
         DC    C'MEDAL'                                                         
         DC    C'MEDIA'                                                         
         DC    C'MEDIC'                                                         
*        DC    C'MEINY'                                                         
         DC    C'MELEE'                                                         
         DC    C'MELON'                                                         
         DC    C'MENAD'                                                         
         DC    C'MERCY'                                                         
         DC    C'MERGE'                                                         
         DC    C'MERIT'                                                         
         DC    C'MERLE'                                                         
         DC    C'MERRY'                                                         
         DC    C'MESHY'                                                         
*        DC    C'MESIC'                                                         
*        DC    C'MESNE'                                                         
         DC    C'MESSY'                                                         
         DC    C'METAL'                                                         
         DC    C'METED'                                                         
         DC    C'METER'                                                         
         DC    C'METRE'                                                         
         DC    C'METRO'                                                         
         DC    C'MEZZO'                                                         
*        DC    C'MIAOU'                                                         
*        DC    C'MIAOW'                                                         
*        DC    C'MICRA'                                                         
*        DC    C'MIDDY'                                                         
*        DC    C'MIDGE'                                                         
*        DC    C'MIDST'                                                         
         DC    C'MIGHT'                                                         
         DC    C'MILCH'                                                         
         DC    C'MILER'                                                         
         DC    C'MILKY'                                                         
         DC    C'MIMED'                                                         
         DC    C'MIMER'                                                         
         DC    C'MIMIC'                                                         
         DC    C'MINCE'                                                         
         DC    C'MINED'                                                         
         DC    C'MINER'                                                         
*        DC    C'MINGY'                                                         
*        DC    C'MINIM'                                                         
         DC    C'MINOR'                                                         
         DC    C'MINUS'                                                         
         DC    C'MIRED'                                                         
         DC    C'MIRKY'                                                         
         DC    C'MIRTH'                                                         
*        DC    C'MIRZA'                                                         
*        DC    C'MISDO'                                                         
         DC    C'MISER'                                                         
         DC    C'MISSY'                                                         
         DC    C'MISTY'                                                         
         DC    C'MITER'                                                         
         DC    C'MITRE'                                                         
         DC    C'MIXED'                                                         
         DC    C'MIXER'                                                         
         DC    C'MIXUP'                                                         
         DC    C'MIZEN'                                                         
         DC    C'MODAL'                                                         
         DC    C'MODEL'                                                         
         DC    C'MOGUL'                                                         
*        DC    C'MOHUR'                                                         
*        DC    C'MOIRE'                                                         
         DC    C'MOIST'                                                         
*        DC    C'MOLAL'                                                         
         DC    C'MOLAR'                                                         
         DC    C'MOLDY'                                                         
*        DC    C'MOLLY'                                                         
         DC    C'MOLTO'                                                         
         DC    C'MOMMY'                                                         
         DC    C'MONAD'                                                         
         DC    C'MONEY'                                                         
*        DC    C'MONGO'                                                         
         DC    C'MONTH'                                                         
         DC    C'MOOCH'                                                         
         DC    C'MOODY'                                                         
         DC    C'MOOED'                                                         
         DC    C'MOONY'                                                         
         DC    C'MOOSE'                                                         
         DC    C'MOPED'                                                         
         DC    C'MOPER'                                                         
         DC    C'MOPEY'                                                         
         DC    C'MORAL'                                                         
         DC    C'MOREL'                                                         
         DC    C'MORON'                                                         
         DC    C'MORPH'                                                         
*        DC    C'MORRO'                                                         
         DC    C'MOSSY'                                                         
         DC    C'MOTEL'                                                         
         DC    C'MOTET'                                                         
         DC    C'MOTHY'                                                         
         DC    C'MOTIF'                                                         
         DC    C'MOTOR'                                                         
         DC    C'MOTTO'                                                         
         DC    C'MOULD'                                                         
         DC    C'MOULT'                                                         
         DC    C'MOUND'                                                         
         DC    C'MOUNT'                                                         
         DC    C'MOURN'                                                         
         DC    C'MOUSE'                                                         
         DC    C'MOUSY'                                                         
         DC    C'MOUTH'                                                         
         DC    C'MOVED'                                                         
         DC    C'MOVER'                                                         
         DC    C'MOVIE'                                                         
         DC    C'MOWED'                                                         
         DC    C'MOWER'                                                         
*        DC    C'MUCID'                                                         
*        DC    C'MUCIN'                                                         
         DC    C'MUCKY'                                                         
*        DC    C'MUCRO'                                                         
         DC    C'MUCUS'                                                         
         DC    C'MUDDY'                                                         
*        DC    C'MUDRA'                                                         
         DC    C'MUFTI'                                                         
         DC    C'MUGGY'                                                         
*        DC    C'MUJIK'                                                         
         DC    C'MULCH'                                                         
         DC    C'MULCT'                                                         
         DC    C'MULEY'                                                         
         DC    C'MULLA'                                                         
         DC    C'MUMMY'                                                         
         DC    C'MUNCH'                                                         
*        DC    C'MUNGO'                                                         
         DC    C'MURAL'                                                         
*        DC    C'MURED'                                                         
*        DC    C'MUREX'                                                         
*        DC    C'MURID'                                                         
         DC    C'MURKY'                                                         
*        DC    C'MURRE'                                                         
         DC    C'MUSED'                                                         
         DC    C'MUSHY'                                                         
         DC    C'MUSIC'                                                         
         DC    C'MUSKY'                                                         
         DC    C'MUSSY'                                                         
         DC    C'MUSTH'                                                         
         DC    C'MUSTY'                                                         
         DC    C'MUTED'                                                         
         DC    C'MYNAH'                                                         
*        DC    C'MYOMA'                                                         
*        DC    C'MYOPE'                                                         
         DC    C'MYRRH'                                                         
         DC    C'NABOB'                                                         
         DC    C'NACRE'                                                         
         DC    C'NADIR'                                                         
*        DC    C'NAIAD'                                                         
         DC    C'NAIVE'                                                         
         DC    C'NAKED'                                                         
         DC    C'NAMED'                                                         
         DC    C'NAMER'                                                         
*        DC    C'NANCE'                                                         
         DC    C'NANNY'                                                         
*        DC    C'NAPPE'                                                         
         DC    C'NAPPY'                                                         
*        DC    C'NARES'                                                         
         DC    C'NASAL'                                                         
         DC    C'NASTY'                                                         
         DC    C'NATAL'                                                         
*        DC    C'NATES'                                                         
         DC    C'NATTY'                                                         
         DC    C'NAVAL'                                                         
         DC    C'NAVEL'                                                         
*        DC    C'NAVVY'                                                         
*        DC    C'NAWAB'                                                         
         DC    C'NEATH'                                                         
         DC    C'NEEDY'                                                         
         DC    C'NEGRO'                                                         
*        DC    C'NEGUS'                                                         
         DC    C'NEIGH'                                                         
         DC    C'NERVE'                                                         
         DC    C'NERVY'                                                         
*        DC    C'NEUME'                                                         
         DC    C'NEVER'                                                         
*        DC    C'NEVUS'                                                         
*        DC    C'NEWEL'                                                         
         DC    C'NEWER'                                                         
         DC    C'NEWLY'                                                         
         DC    C'NEWSY'                                                         
         DC    C'NEXUS'                                                         
*        DC    C'NGWEE'                                                         
         DC    C'NICER'                                                         
         DC    C'NICHE'                                                         
*        DC    C'NIDUS'                                                         
         DC    C'NIECE'                                                         
*        DC    C'NIEVE'                                                         
         DC    C'NIGHT'                                                         
         DC    C'NIHIL'                                                         
         DC    C'NINNY'                                                         
*        DC    C'NINON'                                                         
         DC    C'NINTH'                                                         
         DC    C'NIPPY'                                                         
*        DC    C'NISUS'                                                         
         DC    C'NITER'                                                         
*        DC    C'NITON'                                                         
         DC    C'NITRE'                                                         
         DC    C'NITRO'                                                         
*        DC    C'NITTY'                                                         
         DC    C'NIXED'                                                         
*        DC    C'NIXIE'                                                         
*        DC    C'NOBBY'                                                         
         DC    C'NOBLE'                                                         
         DC    C'NOBLY'                                                         
         DC    C'NODAL'                                                         
*        DC    C'NODDY'                                                         
*        DC    C'NODUS'                                                         
*        DC    C'NOHOW'                                                         
         DC    C'NOISE'                                                         
         DC    C'NOISY'                                                         
         DC    C'NOMEN'                                                         
*        DC    C'NONCE'                                                         
         DC    C'NOOSE'                                                         
*        DC    C'NOPAL'                                                         
*        DC    C'NORIA'                                                         
         DC    C'NORTH'                                                         
         DC    C'NOSED'                                                         
         DC    C'NOSEY'                                                         
         DC    C'NOTCH'                                                         
         DC    C'NOTED'                                                         
*        DC    C'NOTUM'                                                         
         DC    C'NOVAE'                                                         
         DC    C'NOVEL'                                                         
*        DC    C'NOWAY'                                                         
         DC    C'NUBBY'                                                         
         DC    C'NUCHA'                                                         
         DC    C'NUDGE'                                                         
*        DC    C'NUMEN'                                                         
         DC    C'NURSE'                                                         
         DC    C'NUTTY'                                                         
*        DC    C'NYALA'                                                         
         DC    C'NYLON'                                                         
         DC    C'NYMPH'                                                         
         DC    C'OAKEN'                                                         
*        DC    C'OAKUM'                                                         
         DC    C'OARED'                                                         
         DC    C'OASIS'                                                         
         DC    C'OATEN'                                                         
         DC    C'OBESE'                                                         
         DC    C'OCCUR'                                                         
         DC    C'OCEAN'                                                         
         DC    C'OCHER'                                                         
         DC    C'OCHRE'                                                         
*        DC    C'OCREA'                                                         
         DC    C'OCTAD'                                                         
         DC    C'OCTAL'                                                         
         DC    C'OCTET'                                                         
         DC    C'ODDER'                                                         
         DC    C'ODDLY'                                                         
         DC    C'ODEUM'                                                         
         DC    C'ODIUM'                                                         
*        DC    C'ODOUR'                                                         
         DC    C'OFFAL'                                                         
         DC    C'OFFED'                                                         
         DC    C'OFFER'                                                         
         DC    C'OFTEN'                                                         
*        DC    C'OGHAM'                                                         
*        DC    C'OGIVE'                                                         
         DC    C'OGLED'                                                         
         DC    C'OGLER'                                                         
*        DC    C'OHMIC'                                                         
         DC    C'OILED'                                                         
         DC    C'OILER'                                                         
*        DC    C'OKAPI'                                                         
         DC    C'OLDEN'                                                         
         DC    C'OLDER'                                                         
         DC    C'OLEIC'                                                         
         DC    C'OLEIN'                                                         
         DC    C'OLIVE'                                                         
*        DC    C'OLOGY'                                                         
*        DC    C'OMBER'                                                         
*        DC    C'OMBRE'                                                         
         DC    C'OMEGA'                                                         
         DC    C'ONION'                                                         
         DC    C'ONSET'                                                         
*        DC    C'ONTIC'                                                         
*        DC    C'OOTID'                                                         
         DC    C'OOZED'                                                         
         DC    C'OPERA'                                                         
         DC    C'OPINE'                                                         
*        DC    C'OPING'                                                         
         DC    C'OPIUM'                                                         
         DC    C'OPTED'                                                         
         DC    C'OPTIC'                                                         
*        DC    C'ORACH'                                                         
*        DC    C'ORANG'                                                         
         DC    C'ORATE'                                                         
         DC    C'ORBED'                                                         
         DC    C'ORBIT'                                                         
         DC    C'ORDER'                                                         
         DC    C'OREAD'                                                         
         DC    C'ORGAN'                                                         
*        DC    C'ORIBI'                                                         
*        DC    C'ORIEL'                                                         
*        DC    C'ORLOP'                                                         
*        DC    C'ORMER'                                                         
*        DC    C'ORNIS'                                                         
*        DC    C'ORRIS'                                                         
*        DC    C'OSIER'                                                         
         DC    C'OTHER'                                                         
         DC    C'OTTER'                                                         
         DC    C'OUGHT'                                                         
         DC    C'OUNCE'                                                         
*        DC    C'OUPHE'                                                         
*        DC    C'OUSEL'                                                         
         DC    C'OUTDO'                                                         
         DC    C'OUTER'                                                         
         DC    C'OUTGO'                                                         
*        DC    C'OUZEL'                                                         
         DC    C'OVARY'                                                         
         DC    C'OVATE'                                                         
         DC    C'OVERT'                                                         
         DC    C'OVINE'                                                         
         DC    C'OVOID'                                                         
*        DC    C'OVOLO'                                                         
         DC    C'OVULE'                                                         
         DC    C'OWING'                                                         
         DC    C'OWLET'                                                         
         DC    C'OWNED'                                                         
         DC    C'OWNER'                                                         
         DC    C'OXBOW'                                                         
*        DC    C'OXEYE'                                                         
         DC    C'OXIDE'                                                         
         DC    C'OXIME'                                                         
*        DC    C'OXLIP'                                                         
         DC    C'OZONE'                                                         
         DC    C'PACED'                                                         
         DC    C'PACER'                                                         
*        DC    C'PACHA'                                                         
         DC    C'PADDY'                                                         
         DC    C'PADRE'                                                         
         DC    C'PADRI'                                                         
         DC    C'PAEAN'                                                         
         DC    C'PAEON'                                                         
         DC    C'PAGAN'                                                         
         DC    C'PAGED'                                                         
         DC    C'PAINT'                                                         
*        DC    C'PAISA'                                                         
*        DC    C'PAISE'                                                         
*        DC    C'PALEA'                                                         
         DC    C'PALER'                                                         
*        DC    C'PALMY'                                                         
         DC    C'PALSY'                                                         
         DC    C'PANDA'                                                         
         DC    C'PANDY'                                                         
         DC    C'PANED'                                                         
         DC    C'PANEL'                                                         
*        DC    C'PANGA'                                                         
         DC    C'PANIC'                                                         
*        DC    C'PANNE'                                                         
         DC    C'PANSY'                                                         
         DC    C'PAPAL'                                                         
         DC    C'PAPAW'                                                         
         DC    C'PAPER'                                                         
         DC    C'PAPPY'                                                         
         DC    C'PARCH'                                                         
*        DC    C'PARDI'                                                         
         DC    C'PARED'                                                         
*        DC    C'PAREU'                                                         
*        DC    C'PARGE'                                                         
         DC    C'PARKA'                                                         
         DC    C'PAROL'                                                         
         DC    C'PARRY'                                                         
         DC    C'PARSE'                                                         
         DC    C'PARTY'                                                         
         DC    C'PARVE'                                                         
*        DC    C'PASHA'                                                         
         DC    C'PASSE'                                                         
         DC    C'PASTA'                                                         
         DC    C'PASTE'                                                         
         DC    C'PASTY'                                                         
         DC    C'PATCH'                                                         
         DC    C'PATEN'                                                         
         DC    C'PATER'                                                         
         DC    C'PATIO'                                                         
         DC    C'PATSY'                                                         
         DC    C'PATTY'                                                         
         DC    C'PAUSE'                                                         
         DC    C'PAVED'                                                         
         DC    C'PAVER'                                                         
*        DC    C'PAVID'                                                         
         DC    C'PAVIN'                                                         
*        DC    C'PAVIS'                                                         
         DC    C'PAWED'                                                         
         DC    C'PAWER'                                                         
*        DC    C'PAWKY'                                                         
         DC    C'PAYED'                                                         
         DC    C'PAYEE'                                                         
         DC    C'PAYER'                                                         
         DC    C'PEACE'                                                         
         DC    C'PEACH'                                                         
         DC    C'PEARL'                                                         
*        DC    C'PEART'                                                         
         DC    C'PEASE'                                                         
         DC    C'PEATY'                                                         
         DC    C'PECAN'                                                         
         DC    C'PEDAL'                                                         
*        DC    C'PEKAN'                                                         
*        DC    C'PEKIN'                                                         
         DC    C'PEKOE'                                                         
         DC    C'PENAL'                                                         
         DC    C'PENCE'                                                         
*        DC    C'PENES'                                                         
*        DC    C'PENGO'                                                         
         DC    C'PENIS'                                                         
         DC    C'PENNA'                                                         
*        DC    C'PENNI'                                                         
         DC    C'PENNY'                                                         
         DC    C'PEONY'                                                         
         DC    C'PERCH'                                                         
*        DC    C'PERDU'                                                         
         DC    C'PERIL'                                                         
         DC    C'PERKY'                                                         
*        DC    C'PERRY'                                                         
*        DC    C'PERSE'                                                         
         DC    C'PESKY'                                                         
         DC    C'PETAL'                                                         
         DC    C'PETER'                                                         
         DC    C'PETIT'                                                         
         DC    C'PETTY'                                                         
*        DC    C'PEWIT'                                                         
         DC    C'PHAGE'                                                         
         DC    C'PHASE'                                                         
         DC    C'PHIAL'                                                         
         DC    C'PHLOX'                                                         
         DC    C'PHONE'                                                         
         DC    C'PHONY'                                                         
         DC    C'PHOTO'                                                         
         DC    C'PHYLA'                                                         
*        DC    C'PHYLE'                                                         
         DC    C'PIANO'                                                         
         DC    C'PICOT'                                                         
*        DC    C'PICUL'                                                         
         DC    C'PIECE'                                                         
         DC    C'PIETY'                                                         
         DC    C'PIGGY'                                                         
         DC    C'PIGMY'                                                         
*        DC    C'PIING'                                                         
         DC    C'PIKED'                                                         
         DC    C'PIKER'                                                         
         DC    C'PILAF'                                                         
         DC    C'PILAU'                                                         
*        DC    C'PILAW'                                                         
         DC    C'PILED'                                                         
         DC    C'PILOT'                                                         
         DC    C'PINCH'                                                         
         DC    C'PINED'                                                         
         DC    C'PINEY'                                                         
         DC    C'PINKO'                                                         
         DC    C'PINKY'                                                         
*        DC    C'PINNA'                                                         
         DC    C'PINTA'                                                         
         DC    C'PINTO'                                                         
         DC    C'PINUP'                                                         
         DC    C'PIOUS'                                                         
*        DC    C'PIPAL'                                                         
         DC    C'PIPED'                                                         
         DC    C'PIPER'                                                         
         DC    C'PIPET'                                                         
         DC    C'PIPIT'                                                         
         DC    C'PIQUE'                                                         
         DC    C'PITCH'                                                         
         DC    C'PITHY'                                                         
         DC    C'PITON'                                                         
         DC    C'PIVOT'                                                         
         DC    C'PIXIE'                                                         
         DC    C'PIZZA'                                                         
         DC    C'PLACE'                                                         
*?       DC    C'PLAGE'                                                         
         DC    C'PLAID'                                                         
         DC    C'PLAIN'                                                         
         DC    C'PLAIT'                                                         
         DC    C'PLANE'                                                         
         DC    C'PLANK'                                                         
         DC    C'PLANT'                                                         
*        DC    C'PLASH'                                                         
         DC    C'PLASM'                                                         
         DC    C'PLATE'                                                         
*        DC    C'PLATY'                                                         
         DC    C'PLAZA'                                                         
         DC    C'PLEAD'                                                         
         DC    C'PLEAT'                                                         
         DC    C'PLEBE'                                                         
*        DC    C'PLICA'                                                         
         DC    C'PLIED'                                                         
         DC    C'PLIER'                                                         
         DC    C'PLIES'                                                         
*        DC    C'PLONK'                                                         
         DC    C'PLUCK'                                                         
         DC    C'PLUMB'                                                         
         DC    C'PLUME'                                                         
         DC    C'PLUMP'                                                         
*        DC    C'PLUMY'                                                         
         DC    C'PLUNK'                                                         
         DC    C'PLUSH'                                                         
         DC    C'POACH'                                                         
*        DC    C'POCKY'                                                         
*        DC    C'PODGY'                                                         
         DC    C'PODIA'                                                         
         DC    C'POESY'                                                         
*        DC    C'POILU'                                                         
         DC    C'POINT'                                                         
         DC    C'POISE'                                                         
         DC    C'POKED'                                                         
         DC    C'POKER'                                                         
         DC    C'POLAR'                                                         
         DC    C'POLED'                                                         
         DC    C'POLER'                                                         
         DC    C'POLIO'                                                         
*        DC    C'POLIS'                                                         
         DC    C'POLKA'                                                         
         DC    C'POLYP'                                                         
*        DC    C'PONCE'                                                         
         DC    C'POPPY'                                                         
         DC    C'PORCH'                                                         
         DC    C'PORED'                                                         
         DC    C'PORKY'                                                         
         DC    C'PORNO'                                                         
         DC    C'POSED'                                                         
         DC    C'POSER'                                                         
         DC    C'POSSE'                                                         
*        DC    C'POTTO'                                                         
         DC    C'POTTY'                                                         
         DC    C'POUCH'                                                         
         DC    C'POUFF'                                                         
         DC    C'POULT'                                                         
         DC    C'POUND'                                                         
         DC    C'POWER'                                                         
*        DC    C'PRANG'                                                         
*        DC    C'PRASE'                                                         
         DC    C'PRATE'                                                         
         DC    C'PRAWN'                                                         
         DC    C'PREEN'                                                         
*        DC    C'PRESA'                                                         
         DC    C'PRESS'                                                         
*        DC    C'PREST'                                                         
         DC    C'PRICE'                                                         
         DC    C'PRICK'                                                         
         DC    C'PRIDE'                                                         
         DC    C'PRIED'                                                         
         DC    C'PRIER'                                                         
         DC    C'PRIES'                                                         
*        DC    C'PRILL'                                                         
         DC    C'PRIME'                                                         
         DC    C'PRIMP'                                                         
         DC    C'PRINK'                                                         
         DC    C'PRINT'                                                         
         DC    C'PRIOR'                                                         
*        DC    C'PRISE'                                                         
         DC    C'PRISM'                                                         
         DC    C'PRIVY'                                                         
         DC    C'PRIZE'                                                         
         DC    C'PROBE'                                                         
*        DC    C'PROEM'                                                         
*        DC    C'PROLE'                                                         
         DC    C'PRONE'                                                         
         DC    C'PRONG'                                                         
         DC    C'PROOF'                                                         
         DC    C'PROSE'                                                         
         DC    C'PROSY'                                                         
         DC    C'PROUD'                                                         
         DC    C'PROVE'                                                         
         DC    C'PROWL'                                                         
         DC    C'PROXY'                                                         
         DC    C'PRUDE'                                                         
         DC    C'PRUNE'                                                         
*        DC    C'PRUTA'                                                         
         DC    C'PRYER'                                                         
         DC    C'PSALM'                                                         
*        DC    C'PSHAW'                                                         
*        DC    C'PSOAS'                                                         
*        DC    C'PUBES'                                                         
         DC    C'PUBIC'                                                         
         DC    C'PUBIS'                                                         
*        DC    C'PUCKA'                                                         
         DC    C'PUDGY'                                                         
         DC    C'PUFFY'                                                         
         DC    C'PUKED'                                                         
         DC    C'PUKKA'                                                         
         DC    C'PULED'                                                         
*        DC    C'PULIK'                                                         
         DC    C'PULPY'                                                         
         DC    C'PULSE'                                                         
         DC    C'PUNCH'                                                         
*        DC    C'PUNKA'                                                         
*        DC    C'PUNTY'                                                         
         DC    C'PUPAE'                                                         
         DC    C'PUPIL'                                                         
         DC    C'PUPPY'                                                         
         DC    C'PUREE'                                                         
         DC    C'PURER'                                                         
         DC    C'PURGE'                                                         
         DC    C'PURSE'                                                         
         DC    C'PURSY'                                                         
         DC    C'PUSHY'                                                         
         DC    C'PUSSY'                                                         
         DC    C'PUTTY'                                                         
         DC    C'PYGMY'                                                         
         DC    C'PYLON'                                                         
*        DC    C'PYOID'                                                         
*        DC    C'PYRAN'                                                         
*        DC    C'PYXIS'                                                         
         DC    C'QUACK'                                                         
         DC    C'QUAFF'                                                         
         DC    C'QUAIL'                                                         
         DC    C'QUAKE'                                                         
         DC    C'QUAKY'                                                         
*        DC    C'QUALE'                                                         
         DC    C'QUALM'                                                         
*        DC    C'QUANT'                                                         
         DC    C'QUARK'                                                         
         DC    C'QUART'                                                         
         DC    C'QUASH'                                                         
         DC    C'QUASI'                                                         
*        DC    C'QUASS'                                                         
*        DC    C'QUEAN'                                                         
         DC    C'QUEEN'                                                         
         DC    C'QUEER'                                                         
         DC    C'QUELL'                                                         
*        DC    C'QUERN'                                                         
         DC    C'QUERY'                                                         
         DC    C'QUEST'                                                         
         DC    C'QUEUE'                                                         
         DC    C'QUICK'                                                         
         DC    C'QUIET'                                                         
*        DC    C'QUIFF'                                                         
         DC    C'QUILL'                                                         
         DC    C'QUILT'                                                         
*        DC    C'QUINT'                                                         
*        DC    C'QUIPU'                                                         
         DC    C'QUIRE'                                                         
         DC    C'QUIRK'                                                         
         DC    C'QUITE'                                                         
*        DC    C'QUOIN'                                                         
         DC    C'QUOIT'                                                         
         DC    C'QUOTA'                                                         
         DC    C'QUOTE'                                                         
         DC    C'QUOTH'                                                         
*        DC    C'QURSH'                                                         
         DC    C'RABBI'                                                         
         DC    C'RABID'                                                         
         DC    C'RACED'                                                         
         DC    C'RACER'                                                         
         DC    C'RADAR'                                                         
         DC    C'RADII'                                                         
         DC    C'RADIO'                                                         
         DC    C'RADIX'                                                         
         DC    C'RADON'                                                         
         DC    C'RAGED'                                                         
         DC    C'RAGGY'                                                         
         DC    C'RAINY'                                                         
         DC    C'RAISE'                                                         
         DC    C'RAJAH'                                                         
         DC    C'RAKED'                                                         
*        DC    C'RAKEE'                                                         
         DC    C'RALLY'                                                         
*        DC    C'RAMET'                                                         
         DC    C'RAMIE'                                                         
         DC    C'RANCH'                                                         
         DC    C'RANDY'                                                         
         DC    C'RANGE'                                                         
         DC    C'RANGY'                                                         
*        DC    C'RANID'                                                         
         DC    C'RAPED'                                                         
*        DC    C'RAPHE'                                                         
         DC    C'RAPID'                                                         
         DC    C'RARER'                                                         
*        DC    C'RASED'                                                         
         DC    C'RASPY'                                                         
         DC    C'RATAN'                                                         
         DC    C'RATED'                                                         
*        DC    C'RATEL'                                                         
*        DC    C'RATHE'                                                         
         DC    C'RATIO'                                                         
         DC    C'RATTY'                                                         
         DC    C'RAVED'                                                         
         DC    C'RAVEL'                                                         
         DC    C'RAVEN'                                                         
         DC    C'RAVER'                                                         
         DC    C'RAVIN'                                                         
*        DC    C'RAWLY'                                                         
         DC    C'RAYON'                                                         
         DC    C'RAZED'                                                         
*        DC    C'RAZEE'                                                         
         DC    C'RAZOR'                                                         
         DC    C'REACH'                                                         
         DC    C'REACT'                                                         
         DC    C'READY'                                                         
         DC    C'REALM'                                                         
         DC    C'REARM'                                                         
         DC    C'REATA'                                                         
*        DC    C'REAVE'                                                         
*        DC    C'REBEC'                                                         
         DC    C'REBEL'                                                         
         DC    C'REBID'                                                         
         DC    C'REBUS'                                                         
         DC    C'REBUT'                                                         
         DC    C'RECAP'                                                         
*        DC    C'RECON'                                                         
*        DC    C'RECTA'                                                         
         DC    C'RECTI'                                                         
         DC    C'RECTO'                                                         
         DC    C'RECUR'                                                         
*        DC    C'REDAN'                                                         
*        DC    C'REDIA'                                                         
         DC    C'REDID'                                                         
*        DC    C'REDOX'                                                         
         DC    C'REDRY'                                                         
         DC    C'REDYE'                                                         
         DC    C'REEDY'                                                         
         DC    C'REEKY'                                                         
*        DC    C'REEVE'                                                         
         DC    C'REFER'                                                         
         DC    C'REFIT'                                                         
         DC    C'REFIX'                                                         
         DC    C'REFRY'                                                         
         DC    C'REGAL'                                                         
*        DC    C'REGES'                                                         
*        DC    C'REIFY'                                                         
         DC    C'REIGN'                                                         
*        DC    C'REIVE'                                                         
         DC    C'RELAX'                                                         
         DC    C'RELAY'                                                         
         DC    C'RELET'                                                         
         DC    C'RELIC'                                                         
         DC    C'RELIT'                                                         
*        DC    C'REMAN'                                                         
         DC    C'REMAP'                                                         
         DC    C'REMIT'                                                         
         DC    C'REMIX'                                                         
         DC    C'RENAL'                                                         
         DC    C'RENEW'                                                         
         DC    C'RENIN'                                                         
         DC    C'REPAY'                                                         
         DC    C'REPEL'                                                         
         DC    C'REPLY'                                                         
         DC    C'REPRO'                                                         
         DC    C'RERAN'                                                         
         DC    C'RERUN'                                                         
         DC    C'RESET'                                                         
         DC    C'RESEW'                                                         
         DC    C'RESIN'                                                         
         DC    C'RESOW'                                                         
         DC    C'RETCH'                                                         
*        DC    C'RETEM'                                                         
         DC    C'RETIE'                                                         
         DC    C'RETRY'                                                         
         DC    C'REUSE'                                                         
         DC    C'REVEL'                                                         
         DC    C'REVET'                                                         
         DC    C'REVUE'                                                         
*        DC    C'REWIN'                                                         
*        DC    C'REWON'                                                         
         DC    C'RHEUM'                                                         
         DC    C'RHINO'                                                         
*        DC    C'RHOMB'                                                         
*        DC    C'RHUMB'                                                         
         DC    C'RHYME'                                                         
*        DC    C'RIANT'                                                         
         DC    C'RICED'                                                         
         DC    C'RICIN'                                                         
         DC    C'RIDER'                                                         
         DC    C'RIDGE'                                                         
         DC    C'RIDGY'                                                         
         DC    C'RIFLE'                                                         
         DC    C'RIGHT'                                                         
         DC    C'RIGID'                                                         
         DC    C'RIGOR'                                                         
         DC    C'RILED'                                                         
*        DC    C'RILLE'                                                         
*        DC    C'RIMED'                                                         
         DC    C'RINSE'                                                         
         DC    C'RIPEN'                                                         
         DC    C'RIPER'                                                         
         DC    C'RISEN'                                                         
         DC    C'RISER'                                                         
         DC    C'RISKY'                                                         
         DC    C'RIVAL'                                                         
         DC    C'RIVED'                                                         
         DC    C'RIVEN'                                                         
         DC    C'RIVER'                                                         
         DC    C'RIVET'                                                         
         DC    C'RIYAL'                                                         
         DC    C'ROACH'                                                         
         DC    C'ROAST'                                                         
         DC    C'ROBED'                                                         
         DC    C'ROBIN'                                                         
         DC    C'ROBOT'                                                         
         DC    C'ROCKY'                                                         
         DC    C'RODEO'                                                         
         DC    C'ROGUE'                                                         
*        DC    C'ROILY'                                                         
         DC    C'RONDO'                                                         
         DC    C'ROOKY'                                                         
         DC    C'ROOMY'                                                         
*        DC    C'ROOSE'                                                         
         DC    C'ROOST'                                                         
         DC    C'ROOTY'                                                         
         DC    C'ROPED'                                                         
         DC    C'ROPER'                                                         
         DC    C'ROSED'                                                         
*        DC    C'ROSIN'                                                         
*        DC    C'ROTCH'                                                         
         DC    C'ROTOR'                                                         
         DC    C'ROUGE'                                                         
         DC    C'ROUGH'                                                         
         DC    C'ROUND'                                                         
*        DC    C'ROUPY'                                                         
         DC    C'ROUSE'                                                         
         DC    C'ROUST'                                                         
         DC    C'ROUTE'                                                         
         DC    C'ROVED'                                                         
         DC    C'ROVEN'                                                         
         DC    C'ROVER'                                                         
         DC    C'ROWDY'                                                         
*        DC    C'ROWEL'                                                         
*        DC    C'ROWEN'                                                         
         DC    C'ROWER'                                                         
         DC    C'ROYAL'                                                         
         DC    C'RUBLE'                                                         
*        DC    C'RUCHE'                                                         
         DC    C'RUDDY'                                                         
         DC    C'RUDER'                                                         
*        DC    C'RUFFE'                                                         
         DC    C'RUGBY'                                                         
         DC    C'RUING'                                                         
         DC    C'RULED'                                                         
         DC    C'RULER'                                                         
         DC    C'RUMBA'                                                         
         DC    C'RUMEN'                                                         
         DC    C'RUMMY'                                                         
         DC    C'RUMOR'                                                         
         DC    C'RUNIC'                                                         
         DC    C'RUNNY'                                                         
         DC    C'RUNTY'                                                         
         DC    C'RUPEE'                                                         
         DC    C'RURAL'                                                         
*        DC    C'RUSHY'                                                         
         DC    C'RUSTY'                                                         
         DC    C'RUTTY'                                                         
         DC    C'SABER'                                                         
         DC    C'SABLE'                                                         
         DC    C'SABOT'                                                         
         DC    C'SABRA'                                                         
         DC    C'SABRE'                                                         
*        DC    C'SADHE'                                                         
*        DC    C'SADHU'                                                         
         DC    C'SADLY'                                                         
         DC    C'SAFER'                                                         
         DC    C'SAGER'                                                         
         DC    C'SAHIB'                                                         
*        DC    C'SAIGA'                                                         
         DC    C'SAINT'                                                         
*        DC    C'SAITH'                                                         
         DC    C'SALAD'                                                         
*        DC    C'SALEP'                                                         
         DC    C'SALLY'                                                         
*        DC    C'SALMI'                                                         
         DC    C'SALON'                                                         
*        DC    C'SALPA'                                                         
         DC    C'SALTY'                                                         
         DC    C'SALVE'                                                         
         DC    C'SALVO'                                                         
         DC    C'SAMBA'                                                         
         DC    C'SANDY'                                                         
*        DC    C'SAPID'                                                         
*?       DC    C'SAPOR'                                                         
         DC    C'SAPPY'                                                         
*        DC    C'SARIN'                                                         
*        DC    C'SAROD'                                                         
*        DC    C'SAROS'                                                         
         DC    C'SASSY'                                                         
*        DC    C'SATEM'                                                         
         DC    C'SATIN'                                                         
         DC    C'SATYR'                                                         
         DC    C'SAUCE'                                                         
         DC    C'SAUCY'                                                         
         DC    C'SAUNA'                                                         
*        DC    C'SAURY'                                                         
         DC    C'SAUTE'                                                         
         DC    C'SAVED'                                                         
         DC    C'SAVER'                                                         
         DC    C'SAVOR'                                                         
         DC    C'SAVOY'                                                         
         DC    C'SAWED'                                                         
         DC    C'SAWER'                                                         
         DC    C'SAYER'                                                         
         DC    C'SCALD'                                                         
         DC    C'SCALE'                                                         
         DC    C'SCALL'                                                         
         DC    C'SCALP'                                                         
         DC    C'SCALY'                                                         
         DC    C'SCAMP'                                                         
         DC    C'SCANT'                                                         
         DC    C'SCAPE'                                                         
         DC    C'SCARE'                                                         
         DC    C'SCARF'                                                         
         DC    C'SCARP'                                                         
         DC    C'SCARY'                                                         
*        DC    C'SCAUP'                                                         
*        DC    C'SCEND'                                                         
         DC    C'SCENE'                                                         
         DC    C'SCENT'                                                         
         DC    C'SCHUL'                                                         
*        DC    C'SCHWA'                                                         
         DC    C'SCION'                                                         
         DC    C'SCOFF'                                                         
         DC    C'SCOLD'                                                         
         DC    C'SCONE'                                                         
         DC    C'SCOOP'                                                         
         DC    C'SCOOT'                                                         
         DC    C'SCOPE'                                                         
         DC    C'SCORE'                                                         
         DC    C'SCORN'                                                         
         DC    C'SCOUR'                                                         
         DC    C'SCOUT'                                                         
         DC    C'SCOWL'                                                         
*        DC    C'SCRAG'                                                         
         DC    C'SCRAM'                                                         
         DC    C'SCRAP'                                                         
*        DC    C'SCREE'                                                         
         DC    C'SCREW'                                                         
         DC    C'SCRIM'                                                         
         DC    C'SCRIP'                                                         
         DC    C'SCRUB'                                                         
         DC    C'SCUBA'                                                         
*        DC    C'SCUDO'                                                         
         DC    C'SCUFF'                                                         
         DC    C'SCULL'                                                         
*        DC    C'SCURF'                                                         
*        DC    C'SCUTA'                                                         
*        DC    C'SCUTE'                                                         
         DC    C'SEAMY'                                                         
         DC    C'SEBUM'                                                         
         DC    C'SEDAN'                                                         
         DC    C'SEDGE'                                                         
         DC    C'SEDGY'                                                         
*        DC    C'SEDUM'                                                         
         DC    C'SEEDY'                                                         
         DC    C'SEEPY'                                                         
*        DC    C'SEGNO'                                                         
         DC    C'SEGUE'                                                         
         DC    C'SEINE'                                                         
         DC    C'SEISE'                                                         
         DC    C'SEIZE'                                                         
*        DC    C'SELAH'                                                         
         DC    C'SEMEN'                                                         
*        DC    C'SENNA'                                                         
         DC    C'SENSE'                                                         
         DC    C'SEPAL'                                                         
         DC    C'SEPIA'                                                         
*        DC    C'SEPOY'                                                         
*        DC    C'SEPTA'                                                         
         DC    C'SERAC'                                                         
         DC    C'SERAI'                                                         
         DC    C'SERAL'                                                         
         DC    C'SERGE'                                                         
         DC    C'SERIF'                                                         
*        DC    C'SERIN'                                                         
*        DC    C'SEROW'                                                         
         DC    C'SERUM'                                                         
         DC    C'SERVE'                                                         
         DC    C'SERVO'                                                         
         DC    C'SETUP'                                                         
         DC    C'SEVEN'                                                         
         DC    C'SEVER'                                                         
         DC    C'SEWED'                                                         
         DC    C'SEWER'                                                         
         DC    C'SEXED'                                                         
         DC    C'SHACK'                                                         
         DC    C'SHADE'                                                         
         DC    C'SHADY'                                                         
         DC    C'SHAFT'                                                         
         DC    C'SHAKE'                                                         
*        DC    C'SHAKO'                                                         
         DC    C'SHAKY'                                                         
         DC    C'SHALE'                                                         
         DC    C'SHALL'                                                         
         DC    C'SHALT'                                                         
         DC    C'SHALY'                                                         
         DC    C'SHAME'                                                         
         DC    C'SHANK'                                                         
         DC    C'SHAPE'                                                         
         DC    C'SHARD'                                                         
         DC    C'SHARE'                                                         
         DC    C'SHARK'                                                         
         DC    C'SHARP'                                                         
         DC    C'SHAVE'                                                         
         DC    C'SHAWL'                                                         
*        DC    C'SHAWM'                                                         
         DC    C'SHEAF'                                                         
         DC    C'SHEAR'                                                         
         DC    C'SHEEN'                                                         
         DC    C'SHEEP'                                                         
         DC    C'SHEER'                                                         
         DC    C'SHEET'                                                         
         DC    C'SHEIK'                                                         
         DC    C'SHELF'                                                         
         DC    C'SHELL'                                                         
*        DC    C'SHERD'                                                         
         DC    C'SHIED'                                                         
         DC    C'SHIER'                                                         
         DC    C'SHIES'                                                         
         DC    C'SHIFT'                                                         
         DC    C'SHILL'                                                         
         DC    C'SHINE'                                                         
         DC    C'SHINY'                                                         
         DC    C'SHIRE'                                                         
         DC    C'SHIRK'                                                         
         DC    C'SHIRT'                                                         
*        DC    C'SHIVE'                                                         
         DC    C'SHOAL'                                                         
         DC    C'SHOAT'                                                         
         DC    C'SHOCK'                                                         
         DC    C'SHOED'                                                         
         DC    C'SHOER'                                                         
*        DC    C'SHOJI'                                                         
         DC    C'SHONE'                                                         
         DC    C'SHOOK'                                                         
*        DC    C'SHOON'                                                         
         DC    C'SHOOT'                                                         
         DC    C'SHORE'                                                         
         DC    C'SHORN'                                                         
         DC    C'SHORT'                                                         
*?       DC    C'SHOTE'                                                         
*        DC    C'SHOTT'                                                         
         DC    C'SHOUT'                                                         
         DC    C'SHOVE'                                                         
         DC    C'SHOWY'                                                         
         DC    C'SHRED'                                                         
         DC    C'SHREW'                                                         
         DC    C'SHRUB'                                                         
         DC    C'SHRUG'                                                         
         DC    C'SHUCK'                                                         
         DC    C'SHUNT'                                                         
         DC    C'SHUSH'                                                         
         DC    C'SHYER'                                                         
         DC    C'SHYLY'                                                         
         DC    C'SIBYL'                                                         
         DC    C'SIDED'                                                         
         DC    C'SIDLE'                                                         
         DC    C'SIEGE'                                                         
         DC    C'SIEVE'                                                         
         DC    C'SIGHT'                                                         
*        DC    C'SIGIL'                                                         
         DC    C'SIGMA'                                                         
*        DC    C'SILEX'                                                         
         DC    C'SILKY'                                                         
         DC    C'SILLY'                                                         
         DC    C'SILTY'                                                         
*        DC    C'SILVA'                                                         
*        DC    C'SIMAR'                                                         
         DC    C'SINCE'                                                         
         DC    C'SINEW'                                                         
         DC    C'SINGE'                                                         
         DC    C'SINUS'                                                         
         DC    C'SIRED'                                                         
         DC    C'SIREN'                                                         
*        DC    C'SIRRA'                                                         
         DC    C'SIRUP'                                                         
         DC    C'SISAL'                                                         
         DC    C'SITAR'                                                         
         DC    C'SITED'                                                         
*        DC    C'SITUS'                                                         
         DC    C'SIXTH'                                                         
         DC    C'SIXTY'                                                         
*        DC    C'SIZAR'                                                         
         DC    C'SIZED'                                                         
*        DC    C'SKALD'                                                         
         DC    C'SKATE'                                                         
*        DC    C'SKEAN'                                                         
         DC    C'SKEIN'                                                         
*        DC    C'SKELP'                                                         
*        DC    C'SKENE'                                                         
         DC    C'SKIED'                                                         
         DC    C'SKIER'                                                         
         DC    C'SKIFF'                                                         
         DC    C'SKILL'                                                         
         DC    C'SKIMP'                                                         
         DC    C'SKINK'                                                         
         DC    C'SKIRL'                                                         
*        DC    C'SKIRR'                                                         
         DC    C'SKIRT'                                                         
*        DC    C'SKIVE'                                                         
         DC    C'SKOAL'                                                         
*        DC    C'SKULK'                                                         
         DC    C'SKULL'                                                         
         DC    C'SKUNK'                                                         
*        DC    C'SKYEY'                                                         
         DC    C'SLACK'                                                         
         DC    C'SLAIN'                                                         
         DC    C'SLAKE'                                                         
         DC    C'SLANG'                                                         
         DC    C'SLANK'                                                         
         DC    C'SLANT'                                                         
         DC    C'SLASH'                                                         
         DC    C'SLATE'                                                         
         DC    C'SLATY'                                                         
         DC    C'SLAVE'                                                         
         DC    C'SLEEK'                                                         
         DC    C'SLEEP'                                                         
         DC    C'SLEET'                                                         
         DC    C'SLEPT'                                                         
         DC    C'SLICE'                                                         
         DC    C'SLICK'                                                         
         DC    C'SLIDE'                                                         
         DC    C'SLIER'                                                         
         DC    C'SLILY'                                                         
         DC    C'SLIME'                                                         
         DC    C'SLIMY'                                                         
         DC    C'SLING'                                                         
         DC    C'SLINK'                                                         
*        DC    C'SLIPT'                                                         
*        DC    C'SLOID'                                                         
*        DC    C'SLOJD'                                                         
         DC    C'SLOOP'                                                         
         DC    C'SLOPE'                                                         
         DC    C'SLOSH'                                                         
         DC    C'SLOTH'                                                         
*        DC    C'SLOYD'                                                         
         DC    C'SLUMP'                                                         
         DC    C'SLUNG'                                                         
*        DC    C'SLUNK'                                                         
         DC    C'SLURP'                                                         
         DC    C'SLUSH'                                                         
         DC    C'SLYER'                                                         
         DC    C'SLYLY'                                                         
         DC    C'SMACK'                                                         
         DC    C'SMALL'                                                         
*        DC    C'SMALT'                                                         
         DC    C'SMART'                                                         
         DC    C'SMASH'                                                         
         DC    C'SMEAR'                                                         
         DC    C'SMELL'                                                         
*        DC    C'SMELT'                                                         
         DC    C'SMILE'                                                         
         DC    C'SMIRK'                                                         
         DC    C'SMITE'                                                         
         DC    C'SMITH'                                                         
         DC    C'SMOCK'                                                         
         DC    C'SMOKE'                                                         
         DC    C'SMOKY'                                                         
*        DC    C'SMOLT'                                                         
         DC    C'SMOTE'                                                         
         DC    C'SNACK'                                                         
         DC    C'SNAIL'                                                         
         DC    C'SNAKE'                                                         
         DC    C'SNAKY'                                                         
         DC    C'SNARE'                                                         
*        DC    C'SNARK'                                                         
         DC    C'SNARL'                                                         
         DC    C'SNATH'                                                         
         DC    C'SNEAK'                                                         
         DC    C'SNEER'                                                         
         DC    C'SNELL'                                                         
         DC    C'SNICK'                                                         
         DC    C'SNIDE'                                                         
         DC    C'SNIFF'                                                         
         DC    C'SNIPE'                                                         
         DC    C'SNOOD'                                                         
*        DC    C'SNOOK'                                                         
         DC    C'SNOOT'                                                         
         DC    C'SNORE'                                                         
         DC    C'SNORT'                                                         
         DC    C'SNOUT'                                                         
         DC    C'SNOWY'                                                         
         DC    C'SNUFF'                                                         
         DC    C'SOAPY'                                                         
         DC    C'SOBER'                                                         
*        DC    C'SOCLE'                                                         
         DC    C'SOGGY'                                                         
*        DC    C'SOLAN'                                                         
         DC    C'SOLAR'                                                         
*        DC    C'SOLDO'                                                         
         DC    C'SOLED'                                                         
         DC    C'SOLID'                                                         
*        DC    C'SOLUM'                                                         
         DC    C'SOLVE'                                                         
         DC    C'SONAR'                                                         
         DC    C'SONIC'                                                         
         DC    C'SONNY'                                                         
         DC    C'SONSY'                                                         
         DC    C'SOOTH'                                                         
         DC    C'SOOTY'                                                         
*?       DC    C'SOPOR'                                                         
         DC    C'SOPPY'                                                         
         DC    C'SORED'                                                         
         DC    C'SORER'                                                         
         DC    C'SORGO'                                                         
         DC    C'SORRY'                                                         
*        DC    C'SORUS'                                                         
*        DC    C'SOUGH'                                                         
         DC    C'SOUND'                                                         
         DC    C'SOUPY'                                                         
         DC    C'SOUSE'                                                         
         DC    C'SOUTH'                                                         
         DC    C'SOWED'                                                         
         DC    C'SOWER'                                                         
         DC    C'SPACE'                                                         
         DC    C'SPADE'                                                         
*        DC    C'SPAHI'                                                         
         DC    C'SPAKE'                                                         
         DC    C'SPALL'                                                         
         DC    C'SPANK'                                                         
         DC    C'SPARE'                                                         
         DC    C'SPARK'                                                         
         DC    C'SPASM'                                                         
         DC    C'SPATE'                                                         
         DC    C'SPAWN'                                                         
         DC    C'SPEAK'                                                         
         DC    C'SPEAR'                                                         
         DC    C'SPECK'                                                         
*        DC    C'SPECS'                                                         
         DC    C'SPEED'                                                         
         DC    C'SPELL'                                                         
*        DC    C'SPELT'                                                         
         DC    C'SPEND'                                                         
         DC    C'SPENT'                                                         
         DC    C'SPERM'                                                         
*        DC    C'SPICA'                                                         
         DC    C'SPICE'                                                         
         DC    C'SPICY'                                                         
         DC    C'SPIED'                                                         
         DC    C'SPIER'                                                         
         DC    C'SPIFF'                                                         
         DC    C'SPIKE'                                                         
         DC    C'SPIKY'                                                         
*        DC    C'SPILE'                                                         
         DC    C'SPILL'                                                         
         DC    C'SPILT'                                                         
         DC    C'SPINE'                                                         
         DC    C'SPINY'                                                         
         DC    C'SPIRE'                                                         
*        DC    C'SPIRT'                                                         
         DC    C'SPIRY'                                                         
         DC    C'SPITE'                                                         
*        DC    C'SPITZ'                                                         
         DC    C'SPLAT'                                                         
         DC    C'SPLAY'                                                         
         DC    C'SPLIT'                                                         
         DC    C'SPOIL'                                                         
         DC    C'SPOKE'                                                         
         DC    C'SPOOF'                                                         
         DC    C'SPOOK'                                                         
         DC    C'SPOOL'                                                         
         DC    C'SPOON'                                                         
         DC    C'SPOOR'                                                         
         DC    C'SPORE'                                                         
         DC    C'SPORT'                                                         
         DC    C'SPOUT'                                                         
*        DC    C'SPRAG'                                                         
         DC    C'SPRAT'                                                         
         DC    C'SPRAY'                                                         
         DC    C'SPREE'                                                         
         DC    C'SPRIG'                                                         
         DC    C'SPRIT'                                                         
*        DC    C'SPRUE'                                                         
*        DC    C'SPUED'                                                         
         DC    C'SPUME'                                                         
*        DC    C'SPUMY'                                                         
         DC    C'SPUNK'                                                         
         DC    C'SPURN'                                                         
         DC    C'SPURT'                                                         
*        DC    C'SPUTA'                                                         
         DC    C'SQUAB'                                                         
         DC    C'SQUAD'                                                         
         DC    C'SQUAT'                                                         
         DC    C'SQUAW'                                                         
         DC    C'SQUIB'                                                         
         DC    C'SQUID'                                                         
         DC    C'STACK'                                                         
*        DC    C'STADE'                                                         
         DC    C'STAFF'                                                         
         DC    C'STAGE'                                                         
         DC    C'STAGY'                                                         
         DC    C'STAID'                                                         
         DC    C'STAIN'                                                         
         DC    C'STAIR'                                                         
         DC    C'STAKE'                                                         
         DC    C'STALE'                                                         
         DC    C'STALK'                                                         
         DC    C'STALL'                                                         
         DC    C'STAMP'                                                         
         DC    C'STAND'                                                         
*        DC    C'STANE'                                                         
*        DC    C'STANG'                                                         
         DC    C'STANK'                                                         
*        DC    C'STAPH'                                                         
         DC    C'STARE'                                                         
         DC    C'STARK'                                                         
         DC    C'START'                                                         
         DC    C'STASH'                                                         
         DC    C'STATE'                                                         
         DC    C'STAVE'                                                         
         DC    C'STEAD'                                                         
         DC    C'STEAK'                                                         
         DC    C'STEAL'                                                         
         DC    C'STEAM'                                                         
         DC    C'STEED'                                                         
         DC    C'STEEL'                                                         
         DC    C'STEEP'                                                         
         DC    C'STEER'                                                         
         DC    C'STEIN'                                                         
*        DC    C'STELA'                                                         
*        DC    C'STELE'                                                         
         DC    C'STERE'                                                         
         DC    C'STERN'                                                         
         DC    C'STICH'                                                         
         DC    C'STICK'                                                         
         DC    C'STIED'                                                         
         DC    C'STIES'                                                         
         DC    C'STIFF'                                                         
         DC    C'STILE'                                                         
         DC    C'STILL'                                                         
         DC    C'STILT'                                                         
         DC    C'STIMY'                                                         
         DC    C'STING'                                                         
         DC    C'STINK'                                                         
         DC    C'STINT'                                                         
*        DC    C'STIPE'                                                         
*        DC    C'STIRK'                                                         
         DC    C'STOAT'                                                         
         DC    C'STOCK'                                                         
         DC    C'STOIC'                                                         
         DC    C'STOKE'                                                         
         DC    C'STOLE'                                                         
         DC    C'STOMA'                                                         
         DC    C'STOMP'                                                         
         DC    C'STONE'                                                         
         DC    C'STONY'                                                         
         DC    C'STOOD'                                                         
*        DC    C'STOOK'                                                         
         DC    C'STOOL'                                                         
         DC    C'STOOP'                                                         
*        DC    C'STOPE'                                                         
*        DC    C'STOPT'                                                         
         DC    C'STORE'                                                         
         DC    C'STORK'                                                         
         DC    C'STORM'                                                         
         DC    C'STORY'                                                         
*        DC    C'STOUP'                                                         
*        DC    C'STOUR'                                                         
         DC    C'STOUT'                                                         
         DC    C'STOVE'                                                         
         DC    C'STRAW'                                                         
         DC    C'STRAY'                                                         
         DC    C'STREW'                                                         
*        DC    C'STRIA'                                                         
         DC    C'STRIP'                                                         
         DC    C'STROP'                                                         
*        DC    C'STROW'                                                         
*        DC    C'STROY'                                                         
         DC    C'STRUM'                                                         
         DC    C'STRUT'                                                         
         DC    C'STUCK'                                                         
         DC    C'STUDY'                                                         
         DC    C'STUFF'                                                         
         DC    C'STULL'                                                         
         DC    C'STUMP'                                                         
         DC    C'STUNG'                                                         
         DC    C'STUNK'                                                         
         DC    C'STUNT'                                                         
*        DC    C'STUPA'                                                         
         DC    C'STUPE'                                                         
         DC    C'STYLE'                                                         
         DC    C'STYMY'                                                         
         DC    C'SUAVE'                                                         
         DC    C'SUCRE'                                                         
         DC    C'SUEDE'                                                         
         DC    C'SUGAR'                                                         
         DC    C'SUING'                                                         
*        DC    C'SUINT'                                                         
         DC    C'SUITE'                                                         
         DC    C'SULFA'                                                         
         DC    C'SULKY'                                                         
         DC    C'SULLY'                                                         
         DC    C'SUMAC'                                                         
         DC    C'SUNNY'                                                         
         DC    C'SUNUP'                                                         
         DC    C'SUPER'                                                         
         DC    C'SURAH'                                                         
         DC    C'SURAL'                                                         
         DC    C'SURER'                                                         
         DC    C'SURFY'                                                         
         DC    C'SURGE'                                                         
         DC    C'SURLY'                                                         
         DC    C'SUTRA'                                                         
         DC    C'SWAGE'                                                         
         DC    C'SWAIN'                                                         
         DC    C'SWALE'                                                         
         DC    C'SWAMI'                                                         
         DC    C'SWAMP'                                                         
         DC    C'SWANG'                                                         
         DC    C'SWANK'                                                         
*        DC    C'SWARD'                                                         
         DC    C'SWARE'                                                         
         DC    C'SWARM'                                                         
*        DC    C'SWART'                                                         
*        DC    C'SWASH'                                                         
         DC    C'SWATH'                                                         
         DC    C'SWEAR'                                                         
         DC    C'SWEAT'                                                         
         DC    C'SWEEP'                                                         
         DC    C'SWEET'                                                         
         DC    C'SWELL'                                                         
         DC    C'SWEPT'                                                         
         DC    C'SWIFT'                                                         
         DC    C'SWILL'                                                         
         DC    C'SWINE'                                                         
         DC    C'SWING'                                                         
*        DC    C'SWINK'                                                         
         DC    C'SWIPE'                                                         
         DC    C'SWIRL'                                                         
         DC    C'SWISH'                                                         
         DC    C'SWOON'                                                         
         DC    C'SWOOP'                                                         
         DC    C'SWORD'                                                         
         DC    C'SWORE'                                                         
         DC    C'SWORN'                                                         
         DC    C'SWUNG'                                                         
*        DC    C'SYCEE'                                                         
         DC    C'SYLPH'                                                         
*        DC    C'SYLVA'                                                         
         DC    C'SYNCH'                                                         
         DC    C'SYNOD'                                                         
         DC    C'SYRUP'                                                         
*        DC    C'TABBY'                                                         
*        DC    C'TABES'                                                         
*        DC    C'TABLA'                                                         
         DC    C'TABLE'                                                         
         DC    C'TABOO'                                                         
         DC    C'TABOR'                                                         
*        DC    C'TACET'                                                         
*        DC    C'TACHE'                                                         
         DC    C'TACIT'                                                         
         DC    C'TACKY'                                                         
         DC    C'TAFFY'                                                         
*        DC    C'TAIGA'                                                         
         DC    C'TAINT'                                                         
         DC    C'TAKEN'                                                         
         DC    C'TAKER'                                                         
         DC    C'TAKIN'                                                         
*        DC    C'TALER'                                                         
*        DC    C'TALES'                                                         
         DC    C'TALKY'                                                         
         DC    C'TALLY'                                                         
         DC    C'TALON'                                                         
*        DC    C'TALUS'                                                         
         DC    C'TAMED'                                                         
         DC    C'TAMER'                                                         
         DC    C'TANGO'                                                         
         DC    C'TANGY'                                                         
*        DC    C'TANKA'                                                         
*        DC    C'TANSY'                                                         
         DC    C'TAPED'                                                         
         DC    C'TAPER'                                                         
         DC    C'TAPIR'                                                         
*        DC    C'TAPIS'                                                         
         DC    C'TARDO'                                                         
         DC    C'TARDY'                                                         
         DC    C'TARED'                                                         
*        DC    C'TARGE'                                                         
         DC    C'TAROT'                                                         
         DC    C'TARRY'                                                         
         DC    C'TARSI'                                                         
         DC    C'TASSE'                                                         
         DC    C'TASTE'                                                         
         DC    C'TASTY'                                                         
         DC    C'TATTY'                                                         
         DC    C'TAUNT'                                                         
         DC    C'TAUPE'                                                         
         DC    C'TAWNY'                                                         
         DC    C'TAWSE'                                                         
         DC    C'TAXER'                                                         
*        DC    C'TAXON'                                                         
*        DC    C'TAXUS'                                                         
*        DC    C'TAZZA'                                                         
         DC    C'TEACH'                                                         
         DC    C'TEARY'                                                         
         DC    C'TEASE'                                                         
*        DC    C'TECHY'                                                         
         DC    C'TEENY'                                                         
         DC    C'TEETH'                                                         
         DC    C'TELEX'                                                         
*        DC    C'TELIC'                                                         
*        DC    C'TELLY'                                                         
*        DC    C'TEMPI'                                                         
         DC    C'TEMPO'                                                         
         DC    C'TEMPT'                                                         
*        DC    C'TENCH'                                                         
         DC    C'TENET'                                                         
*        DC    C'TENIA'                                                         
         DC    C'TENON'                                                         
         DC    C'TENOR'                                                         
         DC    C'TENSE'                                                         
         DC    C'TENTH'                                                         
         DC    C'TEPID'                                                         
*        DC    C'TERAI'                                                         
*        DC    C'TERCE'                                                         
         DC    C'TERRY'                                                         
         DC    C'TERSE'                                                         
*        DC    C'TESLA'                                                         
*        DC    C'TESTA'                                                         
         DC    C'TESTY'                                                         
         DC    C'TETRA'                                                         
         DC    C'THANE'                                                         
         DC    C'THANK'                                                         
*        DC    C'THECA'                                                         
         DC    C'THEFT'                                                         
*        DC    C'THEGN'                                                         
         DC    C'THEIR'                                                         
         DC    C'THEME'                                                         
         DC    C'THERE'                                                         
         DC    C'THERM'                                                         
         DC    C'THESE'                                                         
         DC    C'THETA'                                                         
*        DC    C'THEWS'                                                         
*        DC    C'THEWY'                                                         
         DC    C'THICK'                                                         
         DC    C'THIEF'                                                         
         DC    C'THIGH'                                                         
*        DC    C'THILL'                                                         
         DC    C'THINE'                                                         
         DC    C'THING'                                                         
         DC    C'THINK'                                                         
*        DC    C'THIOL'                                                         
         DC    C'THIRD'                                                         
         DC    C'THIRL'                                                         
*        DC    C'THOLE'                                                         
         DC    C'THONG'                                                         
         DC    C'THORN'                                                         
*        DC    C'THORO'                                                         
*        DC    C'THORP'                                                         
         DC    C'THOSE'                                                         
         DC    C'THREE'                                                         
         DC    C'THREW'                                                         
         DC    C'THROB'                                                         
         DC    C'THROE'                                                         
         DC    C'THROW'                                                         
*        DC    C'THRUM'                                                         
         DC    C'THUMB'                                                         
         DC    C'THUMP'                                                         
         DC    C'THYME'                                                         
         DC    C'THYMY'                                                         
         DC    C'TIARA'                                                         
         DC    C'TIBIA'                                                         
*        DC    C'TICAL'                                                         
         DC    C'TIDAL'                                                         
         DC    C'TIDED'                                                         
         DC    C'TIGER'                                                         
         DC    C'TIGHT'                                                         
         DC    C'TILDE'                                                         
         DC    C'TILED'                                                         
         DC    C'TILER'                                                         
*        DC    C'TILTH'                                                         
         DC    C'TIMED'                                                         
         DC    C'TIMER'                                                         
         DC    C'TIMID'                                                         
*        DC    C'TINCT'                                                         
*        DC    C'TINEA'                                                         
         DC    C'TINED'                                                         
         DC    C'TINGE'                                                         
         DC    C'TINNY'                                                         
         DC    C'TIPPY'                                                         
         DC    C'TIPSY'                                                         
         DC    C'TIRED'                                                         
         DC    C'TITAN'                                                         
*        DC    C'TITER'                                                         
         DC    C'TITHE'                                                         
         DC    C'TITLE'                                                         
*        DC    C'TITRE'                                                         
         DC    C'TITTY'                                                         
         DC    C'TIZZY'                                                         
         DC    C'TOADY'                                                         
         DC    C'TOAST'                                                         
         DC    C'TODAY'                                                         
         DC    C'TODDY'                                                         
*        DC    C'TOFFY'                                                         
         DC    C'TOILE'                                                         
         DC    C'TOKEN'                                                         
*        DC    C'TOLAN'                                                         
*        DC    C'TOLED'                                                         
*        DC    C'TOLYL'                                                         
         DC    C'TONAL'                                                         
*        DC    C'TONDO'                                                         
         DC    C'TONED'                                                         
         DC    C'TONER'                                                         
*        DC    C'TONGA'                                                         
         DC    C'TONGS'                                                         
         DC    C'TONIC'                                                         
*        DC    C'TONUS'                                                         
         DC    C'TOOTH'                                                         
*        DC    C'TOOTS'                                                         
         DC    C'TOPAZ'                                                         
         DC    C'TOPED'                                                         
*        DC    C'TOPEE'                                                         
*        DC    C'TOPER'                                                         
         DC    C'TOPIC'                                                         
         DC    C'TOQUE'                                                         
         DC    C'TORAH'                                                         
         DC    C'TORCH'                                                         
*        DC    C'TORIC'                                                         
*        DC    C'TORII'                                                         
*        DC    C'TORSI'                                                         
*        DC    C'TORSK'                                                         
         DC    C'TORSO'                                                         
         DC    C'TORTE'                                                         
         DC    C'TORUS'                                                         
         DC    C'TOTAL'                                                         
         DC    C'TOTED'                                                         
         DC    C'TOTEM'                                                         
         DC    C'TOTER'                                                         
         DC    C'TOUCH'                                                         
         DC    C'TOUGH'                                                         
         DC    C'TOWEL'                                                         
         DC    C'TOWER'                                                         
         DC    C'TOXIC'                                                         
         DC    C'TOXIN'                                                         
         DC    C'TOYED'                                                         
         DC    C'TOYER'                                                         
         DC    C'TRACE'                                                         
         DC    C'TRACK'                                                         
         DC    C'TRACT'                                                         
         DC    C'TRADE'                                                         
         DC    C'TRAIL'                                                         
         DC    C'TRAIN'                                                         
         DC    C'TRAIT'                                                         
         DC    C'TRAMP'                                                         
*        DC    C'TRAPT'                                                         
         DC    C'TRASH'                                                         
*        DC    C'TRASS'                                                         
*        DC    C'TRAVE'                                                         
         DC    C'TRAWL'                                                         
         DC    C'TREAD'                                                         
         DC    C'TREAT'                                                         
         DC    C'TREED'                                                         
         DC    C'TREND'                                                         
         DC    C'TRESS'                                                         
*        DC    C'TREWS'                                                         
         DC    C'TRIAD'                                                         
         DC    C'TRIAL'                                                         
         DC    C'TRIBE'                                                         
         DC    C'TRICE'                                                         
         DC    C'TRICK'                                                         
         DC    C'TRIED'                                                         
         DC    C'TRIER'                                                         
         DC    C'TRIES'                                                         
         DC    C'TRILL'                                                         
         DC    C'TRINE'                                                         
*        DC    C'TRIOL'                                                         
         DC    C'TRIPE'                                                         
         DC    C'TRITE'                                                         
*        DC    C'TRODE'                                                         
         DC    C'TROLL'                                                         
         DC    C'TROMP'                                                         
*        DC    C'TRONA'                                                         
         DC    C'TROOP'                                                         
         DC    C'TROPE'                                                         
         DC    C'TROTH'                                                         
         DC    C'TROUT'                                                         
         DC    C'TROVE'                                                         
         DC    C'TRUCE'                                                         
         DC    C'TRUCK'                                                         
         DC    C'TRUED'                                                         
         DC    C'TRUER'                                                         
*        DC    C'TRULL'                                                         
         DC    C'TRULY'                                                         
         DC    C'TRUMP'                                                         
         DC    C'TRUNK'                                                         
         DC    C'TRUSS'                                                         
         DC    C'TRUST'                                                         
         DC    C'TRUTH'                                                         
         DC    C'TRYST'                                                         
*        DC    C'TSADI'                                                         
         DC    C'TUBAL'                                                         
         DC    C'TUBBY'                                                         
         DC    C'TUBED'                                                         
         DC    C'TUBER'                                                         
         DC    C'TUFTY'                                                         
         DC    C'TULIP'                                                         
         DC    C'TULLE'                                                         
         DC    C'TUMID'                                                         
         DC    C'TUMMY'                                                         
         DC    C'TUMOR'                                                         
         DC    C'TUNED'                                                         
         DC    C'TUNER'                                                         
         DC    C'TUNIC'                                                         
*        DC    C'TUNNY'                                                         
*        DC    C'TUQUE'                                                         
         DC    C'TURBO'                                                         
*        DC    C'TURFY'                                                         
*        DC    C'TURPS'                                                         
         DC    C'TUTOR'                                                         
         DC    C'TUTTI'                                                         
*        DC    C'TUTTY'                                                         
         DC    C'TWAIN'                                                         
         DC    C'TWANG'                                                         
         DC    C'TWEAK'                                                         
         DC    C'TWEED'                                                         
         DC    C'TWEET'                                                         
         DC    C'TWERP'                                                         
         DC    C'TWICE'                                                         
         DC    C'TWILL'                                                         
         DC    C'TWINE'                                                         
         DC    C'TWIRL'                                                         
         DC    C'TWIRP'                                                         
         DC    C'TWIST'                                                         
         DC    C'TYING'                                                         
*        DC    C'TYPAL'                                                         
         DC    C'TYPED'                                                         
         DC    C'TYPIC'                                                         
         DC    C'UDDER'                                                         
*        DC    C'UHLAN'                                                         
         DC    C'UKASE'                                                         
*        DC    C'ULAMA'                                                         
         DC    C'ULCER'                                                         
*        DC    C'ULNAD'                                                         
         DC    C'ULNAR'                                                         
*        DC    C'ULPAN'                                                         
         DC    C'ULTRA'                                                         
*        DC    C'UMBEL'                                                         
         DC    C'UMBER'                                                         
         DC    C'UMBRA'                                                         
*        DC    C'UMIAK'                                                         
         DC    C'UNAPT'                                                         
         DC    C'UNARM'                                                         
         DC    C'UNARY'                                                         
         DC    C'UNBAR'                                                         
         DC    C'UNBID'                                                         
         DC    C'UNCAP'                                                         
         DC    C'UNCLE'                                                         
*        DC    C'UNCUS'                                                         
         DC    C'UNCUT'                                                         
*        DC    C'UNDEE'                                                         
         DC    C'UNDER'                                                         
         DC    C'UNDID'                                                         
         DC    C'UNDUE'                                                         
         DC    C'UNFED'                                                         
         DC    C'UNFIT'                                                         
         DC    C'UNFIX'                                                         
*        DC    C'UNGOT'                                                         
         DC    C'UNIFY'                                                         
         DC    C'UNION'                                                         
         DC    C'UNITE'                                                         
         DC    C'UNITY'                                                         
         DC    C'UNLAY'                                                         
         DC    C'UNLIT'                                                         
*        DC    C'UNMAN'                                                         
         DC    C'UNPEG'                                                         
*        DC    C'UNPEN'                                                         
         DC    C'UNPIN'                                                         
         DC    C'UNRIG'                                                         
         DC    C'UNRIP'                                                         
         DC    C'UNSET'                                                         
*        DC    C'UNSEX'                                                         
         DC    C'UNTIE'                                                         
         DC    C'UNTIL'                                                         
         DC    C'UNWED'                                                         
*        DC    C'UNWON'                                                         
         DC    C'UPEND'                                                         
         DC    C'UPPED'                                                         
         DC    C'UPPER'                                                         
         DC    C'UPSET'                                                         
*        DC    C'URAEI'                                                         
*        DC    C'URATE'                                                         
         DC    C'URBAN'                                                         
*        DC    C'UREAL'                                                         
*        DC    C'UREDO'                                                         
         DC    C'UREIC'                                                         
         DC    C'URGED'                                                         
         DC    C'URGER'                                                         
         DC    C'URINE'                                                         
         DC    C'USAGE'                                                         
         DC    C'USHER'                                                         
         DC    C'USING'                                                         
         DC    C'USUAL'                                                         
         DC    C'USURP'                                                         
         DC    C'USURY'                                                         
         DC    C'UTERI'                                                         
         DC    C'UTILE'                                                         
         DC    C'UTTER'                                                         
         DC    C'UVEAL'                                                         
*        DC    C'UVULA'                                                         
*        DC    C'VACUA'                                                         
*        DC    C'VAGAL'                                                         
         DC    C'VAGUE'                                                         
*?       DC    C'VAGUS'                                                         
         DC    C'VALET'                                                         
         DC    C'VALID'                                                         
         DC    C'VALOR'                                                         
         DC    C'VALUE'                                                         
         DC    C'VALVE'                                                         
*        DC    C'VANDA'                                                         
         DC    C'VAPID'                                                         
         DC    C'VAPOR'                                                         
*        DC    C'VARIX'                                                         
*        DC    C'VARNA'                                                         
*        DC    C'VARUS'                                                         
*        DC    C'VARVE'                                                         
         DC    C'VASTY'                                                         
*        DC    C'VATIC'                                                         
         DC    C'VAULT'                                                         
         DC    C'VAUNT'                                                         
         DC    C'VEINY'                                                         
*        DC    C'VELAR'                                                         
*        DC    C'VELDT'                                                         
         DC    C'VELUM'                                                         
         DC    C'VENAL'                                                         
*        DC    C'VENIN'                                                         
         DC    C'VENOM'                                                         
         DC    C'VENUE'                                                         
         DC    C'VERGE'                                                         
         DC    C'VERSE'                                                         
         DC    C'VERSO'                                                         
*        DC    C'VERST'                                                         
*        DC    C'VERTU'                                                         
         DC    C'VERVE'                                                         
         DC    C'VETCH'                                                         
         DC    C'VEXED'                                                         
         DC    C'VEXER'                                                         
         DC    C'VIAND'                                                         
         DC    C'VICAR'                                                         
         DC    C'VICHY'                                                         
         DC    C'VIDEO'                                                         
*        DC    C'VIEWY'                                                         
         DC    C'VIGIL'                                                         
         DC    C'VIGOR'                                                         
*        DC    C'VIMEN'                                                         
*        DC    C'VINIC'                                                         
         DC    C'VINYL'                                                         
         DC    C'VIOLA'                                                         
         DC    C'VIPER'                                                         
         DC    C'VIRAL'                                                         
*        DC    C'VIRGA'                                                         
         DC    C'VIRTU'                                                         
*        DC    C'VISED'                                                         
         DC    C'VISIT'                                                         
         DC    C'VISOR'                                                         
         DC    C'VISTA'                                                         
         DC    C'VITAL'                                                         
*        DC    C'VITTA'                                                         
         DC    C'VIVID'                                                         
         DC    C'VIXEN'                                                         
         DC    C'VIZOR'                                                         
         DC    C'VOCAL'                                                         
         DC    C'VODKA'                                                         
         DC    C'VOGUE'                                                         
         DC    C'VOICE'                                                         
         DC    C'VOILE'                                                         
         DC    C'VOLAR'                                                         
         DC    C'VOLVA'                                                         
*        DC    C'VOMER'                                                         
         DC    C'VOMIT'                                                         
         DC    C'VOTED'                                                         
         DC    C'VOTER'                                                         
         DC    C'VOUCH'                                                         
         DC    C'VOWEL'                                                         
         DC    C'VOWER'                                                         
*        DC    C'VROOM'                                                         
         DC    C'VULVA'                                                         
         DC    C'VYING'                                                         
         DC    C'WACKY'                                                         
*        DC    C'WADDY'                                                         
         DC    C'WADED'                                                         
         DC    C'WADER'                                                         
         DC    C'WAFER'                                                         
         DC    C'WAGED'                                                         
         DC    C'WAGER'                                                         
         DC    C'WAGON'                                                         
         DC    C'WAIST'                                                         
         DC    C'WAIVE'                                                         
         DC    C'WAKED'                                                         
         DC    C'WAKEN'                                                         
         DC    C'WALED'                                                         
         DC    C'WALLY'                                                         
         DC    C'WALTZ'                                                         
         DC    C'WANED'                                                         
*        DC    C'WANEY'                                                         
         DC    C'WANLY'                                                         
         DC    C'WARED'                                                         
         DC    C'WARTY'                                                         
         DC    C'WASHY'                                                         
         DC    C'WASPY'                                                         
         DC    C'WASTE'                                                         
         DC    C'WATCH'                                                         
         DC    C'WATER'                                                         
         DC    C'WAVED'                                                         
         DC    C'WAVER'                                                         
         DC    C'WAXED'                                                         
         DC    C'WAXEN'                                                         
         DC    C'WAXER'                                                         
*        DC    C'WEALD'                                                         
         DC    C'WEARY'                                                         
         DC    C'WEAVE'                                                         
         DC    C'WEBBY'                                                         
         DC    C'WEBER'                                                         
         DC    C'WEDGE'                                                         
         DC    C'WEDGY'                                                         
         DC    C'WEEDY'                                                         
         DC    C'WEENY'                                                         
         DC    C'WEEPY'                                                         
         DC    C'WEIGH'                                                         
         DC    C'WEIRD'                                                         
         DC    C'WELCH'                                                         
         DC    C'WELSH'                                                         
         DC    C'WENCH'                                                         
         DC    C'WHACK'                                                         
         DC    C'WHALE'                                                         
*        DC    C'WHANG'                                                         
         DC    C'WHARF'                                                         
*        DC    C'WHAUP'                                                         
*        DC    C'WHEAL'                                                         
         DC    C'WHEAT'                                                         
         DC    C'WHEEL'                                                         
*        DC    C'WHEEN'                                                         
         DC    C'WHELK'                                                         
         DC    C'WHELM'                                                         
         DC    C'WHELP'                                                         
         DC    C'WHERE'                                                         
         DC    C'WHICH'                                                         
         DC    C'WHIFF'                                                         
         DC    C'WHILE'                                                         
         DC    C'WHINE'                                                         
         DC    C'WHINY'                                                         
         DC    C'WHIRL'                                                         
         DC    C'WHISH'                                                         
         DC    C'WHISK'                                                         
         DC    C'WHIST'                                                         
         DC    C'WHITE'                                                         
         DC    C'WHITY'                                                         
         DC    C'WHIZZ'                                                         
         DC    C'WHOLE'                                                         
*        DC    C'WHOMP'                                                         
*        DC    C'WHOOF'                                                         
         DC    C'WHOOP'                                                         
         DC    C'WHORE'                                                         
         DC    C'WHORL'                                                         
         DC    C'WHOSE'                                                         
*        DC    C'WHOSO'                                                         
*        DC    C'WHUMP'                                                         
         DC    C'WIDEN'                                                         
         DC    C'WIDER'                                                         
         DC    C'WIDOW'                                                         
         DC    C'WIDTH'                                                         
         DC    C'WIELD'                                                         
*        DC    C'WIGAN'                                                         
*        DC    C'WIGHT'                                                         
         DC    C'WILED'                                                         
*        DC    C'WILLY'                                                         
         DC    C'WINCE'                                                         
         DC    C'WINCH'                                                         
         DC    C'WINDY'                                                         
         DC    C'WINED'                                                         
*        DC    C'WINZE'                                                         
         DC    C'WIPED'                                                         
         DC    C'WIPER'                                                         
         DC    C'WIRED'                                                         
         DC    C'WIRER'                                                         
*        DC    C'WIRRA'                                                         
         DC    C'WISED'                                                         
         DC    C'WISER'                                                         
         DC    C'WISPY'                                                         
*        DC    C'WITAN'                                                         
         DC    C'WITCH'                                                         
*        DC    C'WITED'                                                         
*        DC    C'WITHE'                                                         
*        DC    C'WITHY'                                                         
         DC    C'WITTY'                                                         
         DC    C'WIVED'                                                         
         DC    C'WIVES'                                                         
*        DC    C'WIZEN'                                                         
         DC    C'WOKEN'                                                         
         DC    C'WOMAN'                                                         
         DC    C'WOMEN'                                                         
*        DC    C'WONKY'                                                         
         DC    C'WOODY'                                                         
         DC    C'WOOED'                                                         
         DC    C'WOOER'                                                         
         DC    C'WOOLY'                                                         
         DC    C'WOOPS'                                                         
*        DC    C'WOOSH'                                                         
         DC    C'WORDY'                                                         
         DC    C'WORLD'                                                         
         DC    C'WORMY'                                                         
         DC    C'WORRY'                                                         
         DC    C'WORSE'                                                         
         DC    C'WORST'                                                         
         DC    C'WORTH'                                                         
         DC    C'WOULD'                                                         
         DC    C'WOUND'                                                         
         DC    C'WOVEN'                                                         
         DC    C'WRACK'                                                         
         DC    C'WRAPT'                                                         
         DC    C'WRATH'                                                         
         DC    C'WREAK'                                                         
         DC    C'WRECK'                                                         
         DC    C'WREST'                                                         
*        DC    C'WRICK'                                                         
*        DC    C'WRIED'                                                         
         DC    C'WRIER'                                                         
         DC    C'WRING'                                                         
         DC    C'WRIST'                                                         
         DC    C'WRITE'                                                         
         DC    C'WRONG'                                                         
         DC    C'WROTE'                                                         
*        DC    C'WROTH'                                                         
         DC    C'WRUNG'                                                         
         DC    C'WRYLY'                                                         
         DC    C'WURST'                                                         
*        DC    C'XEBEC'                                                         
*        DC    C'XENIA'                                                         
*        DC    C'XENIC'                                                         
         DC    C'XENON'                                                         
*        DC    C'XERIC'                                                         
*        DC    C'XYLAN'                                                         
*        DC    C'XYLEM'                                                         
*        DC    C'XYLOL'                                                         
         DC    C'YACHT'                                                         
*        DC    C'YAMEN'                                                         
*        DC    C'YAPOK'                                                         
*        DC    C'YAULD'                                                         
         DC    C'YAWED'                                                         
         DC    C'YEARN'                                                         
         DC    C'YEAST'                                                         
         DC    C'YENTA'                                                         
         DC    C'YENTE'                                                         
         DC    C'YIELD'                                                         
         DC    C'YODEL'                                                         
*        DC    C'YOGIC'                                                         
*        DC    C'YOGIN'                                                         
         DC    C'YOKED'                                                         
         DC    C'YOKEL'                                                         
         DC    C'YOLKY'                                                         
         DC    C'YOUNG'                                                         
         DC    C'YOURS'                                                         
         DC    C'YOUTH'                                                         
         DC    C'YUCCA'                                                         
         DC    C'YUMMY'                                                         
*        DC    C'ZAIRE'                                                         
*        DC    C'ZAMIA'                                                         
*        DC    C'ZAYIN'                                                         
*        DC    C'ZEBEC'                                                         
         DC    C'ZEBRA'                                                         
         DC    C'ZESTY'                                                         
*        DC    C'ZINCY'                                                         
         DC    C'ZINGY'                                                         
         DC    C'ZINKY'                                                         
         DC    C'ZIPPY'                                                         
         DC    C'ZLOTY'                                                         
*        DC    C'ZOEAE'                                                         
         DC    C'ZOMBI'                                                         
         DC    C'ZONAL'                                                         
         DC    C'ZONED'                                                         
*        DC    C'ZOOID'                                                         
*        DC    C'ZORIL'                                                         
GABOG01X EQU   *                                                                
**PAN#1  CSECT                                                                  
**PAN#1  DC    CL21'007GABOG01   08/22/00'                                      
         END                                                                    
