*          DATA SET GAHNG04    AT LEVEL 002 AS OF 08/22/00                      
*PHASE TB0504A                                                                  
         TITLE 'HANGMAN GAME - DICTIONARY PART 4'                               
HANGMAN4 CSECT                                                                  
         DC    C'SEWERAGE SEXTUPLET SHADOW SHAMBLE SHAMPOO SHA'                 
         DC    C'REHOLDER SHAVING SHEEPISH SHELTER SHERIFF SHI'                 
         DC    C'LLING SHIPPING SHOPLIFTER SHORTAGE SHORTSIGHT'                 
         DC    C'ED SHOULDER SHOWER SHRAPNEL SHRUBBERY SHUTTLE'                 
         DC    C' SIDEBOARD SIEVE SIGHTSEEING SIGNATURE SIMILA'                 
         DC    C'R SIMULATE SINCERE SINGULAR SINUOUS SITUATION'                 
         DC    C' SIXTY SKELETON SKIRMISH SKITTLE SLANDER SLAU'                 
         DC    C'GHTER SLEDGEHAMMER SLEUTH SLOGAN SLOVENLY SLU'                 
         DC    C'GGISH SLUMBER SMALLNESS SMOKING SMUGGLER SNIG'                 
         DC    C'GER SOBERNESS SOCIABLE SOFTNESS SOLDIER SOLIL'                 
         DC    C'OQUY SOMBRERO SONATA SOPHISTICATED SORROW SOU'                 
         DC    C'VENIR SPACIAL SPANIEL SPARKLING SPASMODIC SPE'                 
         DC    C'CIMEN SPECTRUM SPECULATE SPHEROID SPINDLE SPI'                 
         DC    C'RITUAL SPLENDOUR SPOILING SPOKESMAN SPORADIC '                 
         DC    C'SPOTLIGHT SPRIGHTLY SPRINKLE SPURIOUS SQUANDE'                 
         DC    C'R SQUARE STABILITY STACCATO STADIUM STALACTIT'                 
         DC    C'E STAMPEDE STARBOARD STARLIGHT STARVATION STA'                 
         DC    C'TISTICS STATUTE STEADFAST STEAMBOAT STENCIL S'                 
         DC    C'TEREOTYPE STEWARD STIMULATE STIPEND STOCKADE'                  
         DC    C' STOMACH STRAIGHT STRANGE STRATEGY STRATOSPH'                  
         DC    C'ERE STREAMING STRENUOUS STRIDENT STRINGENT S'                  
         DC    C'TRUCTURE STUBBLE STUDIOUS STUMBLE STUPENDOUS'                  
         DC    C' SUBCOMMITTEE SUBLIMINAL SUBMERGE SUBSTANCE '                  
         DC    C'SUBTERFUGE SUBWAY SUCCULENT SUGGESTIVE SUITC'                  
         DC    C'ASE SUMPTUOUS SUNBURN SUPERCILIOUS SUPPLEMEN'                  
         DC    C'T SURCHARGE SURGEON SURRENDER SURVEILLANCE S'                  
         DC    C'USPICION SWALLOW SWASTIKA SWELTER SWIMMING S'                  
         DC    C'WIVEL SYMPHONY SYNOPSIS TABLECLOTH TABULATIO'                  
         DC    C'N TACTICIAN TADPOLE TANGIBLE TANTAMOUNT TAPE'                  
         DC    C'STRY TARPAULIN TAUTOLOGY TAXIDRIVER TECHNICA'                  
         DC    C'L TEDIOUS TELEGRAPH TEMPERAMENT TEMPERATURE '                  
         DC    C'TENACITY TENNIS TENUOUS TERMINAL TERMINUS TH'                  
         DC    C'ANKLESS THEOREM THERMOMETER THICKNESS THOROU'                  
         DC    C'GH THOUSAND THRESHOLD THUMB THWART TIGHTEN T'                  
         DC    C'IGRESS TIMEPIECE TIRESOME TITILLATE TOBOGGAN'                  
         DC    C' TOGETHER TOLERANT TONGUE TONTINE TOOTHACHE '                  
         DC    C'TOPICAL TORPEDO TORTOISE TOURNAMENT TOXIC TR'                  
         DC    C'ACTION TRAGEDY TRAJECTION TRANQUIL TRANSACTI'                  
         DC    C'ON TRANSPARENT TRAUMATIC TREASURY TREMULOUS '                  
         DC    C'TRENCHANT TRIANGLE TRIBUNE TRILOGY TRIUMPH T'                  
         DC    C'ROPICAL TROUSSEAU TRUCULENT TRUMPET TRUSTWORT'                 
         DC    C'HY TUBULAR TUMULTUOUS TURBULENT TURPENTINE TU'                 
         DC    C'RQUOISE TWELVE TWITCH TYPICAL TYRANT ULTIMATE'                 
         DC    C' UNABLE UNBIASED UNCANNY UNCHAINED UNCLEAN UN'                 
         DC    C'COMMON UNCONDITIONAL UNCOVER UNCTUOUS UNDERBI'                 
         DC    C'D UNDERGROUND UNDERSTAND UNDISPUTED UNEATABLE'                 
         DC    C' UNEQUAL UNEXPOSED UNFOLD UNGODLY UNHAPPY UNI'                 
         DC    C'FORM UNINHABITED UNIVERSAL UNKIND UNLUCKY UNP'                 
         DC    C'OPULAR UNPRODUCTIVE UNSELFISH UNSPOILED UNTAX'                 
         DC    C'ED UNUSUAL UPHEAVAL UPHOLSTERY UPSTAIRS UTILI'                 
         DC    C'TARIAN UTOPIAN VACATION VAGRANT VALENTINE VAN'                 
         DC    C'GUARD VARIATION VAUDEVILLE VEGETABLE VELOCITY'                 
         DC    C' VENISON VENTILATE VERBATIM VERTIGO VETERAN V'                 
         DC    C'IBRATE VICINITY VIGNETTE VINDICATE VIOLINIST '                 
         DC    C'VIRTUOSO VISIONARY VITALITY VOCATION VOLCANIC'                 
         DC    C' VOLUPTUOUS VOUCHSAFE VULGARITY WAGER WAITRES'                 
         DC    C'S WALTZ WANDERING WARMTH WARRANT WASTAGE WATC'                 
         DC    C'HTOWER WATERFALL WAXWORK WAYWARD WEAPON WEATH'                 
         DC    C'ER WEDDING WEIGHTLESS WELCOME WELLKNOWN WHEEL'                 
         DC    C'BARROW WHEREAS WHIRLPOOL WHISPER WHITEWASH WH'                 
         DC    C'OLESALE WIDOW WILDERNESS WINDMILL WINEGLASS W'                 
         DC    C'ISDOM WITHDRAW WITHERED WITNESS WONDERFUL WOO'                 
         DC    C'DLANDS WORKMANSHIP WORSHIP WORSTED WRANGLE WR'                 
         DC    C'ESTLER WRITING YACHTSMAN YARDSTICK YEARLING Y'                 
         DC    C'ESTERDAY ZEALOUS ZOOLOGICAL BKEND '                            
**PAN#1  CSECT                                                                  
**PAN#1  DC    CL21'002GAHNG04   08/22/00'                                      
         END                                                                    
