*          DATA SET GAWRD02    AT LEVEL 012 AS OF 08/22/00                      
*PHASE TB1402A                                                                  
*                                                                               
*                                                                               
* THE WORD POWER DICTIONARY IS DISTRIBUTED AS FOLLOWS:                          
*                                                                               
*        PANVALET BOOK      WORDS      PHASE NAME                               
*           GAWRD01          A-D         TB1401                                 
*           GAWRD02          E-L         TB1402                                 
*           GAWRD03          M-R         TB1403                                 
*           GAWRD04          S-Z         TB1404                                 
*                                                                               
* DC STATEMENTS BELOW ARE OF THE FOLLOWING FORMAT:                              
*                                                                               
*        BYTE  +0(1):  C'E' IF EASY WORD, C'H' IF HARD WORD                     
*        BYTE  +1(5):  SORTED SPELLING OF THE WORD                              
*        BYTE  +6(5):  ACTUAL SPELLING OF THE WORD                              
*                                                                               
*                                                                               
GAWRD02  CSECT                                                                  
         DC    C'E',C'AEEGR',C'EAGER'                                           
         DC    C'E',C'AEEGL',C'EAGLE'                                           
         DC    C'H',C'AEEGR',C'EAGRE'                                           
         DC    C'H',C'ADEER',C'EARED'                                           
         DC    C'E',C'AELRY',C'EARLY'                                           
         DC    C'E',C'AEHRT',C'EARTH'                                           
         DC    C'E',C'ADEES',C'EASED'                                           
         DC    C'E',C'AEELS',C'EASEL'                                           
         DC    C'E',C'AEENT',C'EATEN'                                           
         DC    C'E',C'AEERT',C'EATER'                                           
         DC    C'E',C'BBDEE',C'EBBED'                                           
         DC    C'E',C'BENOY',C'EBONY'                                           
         DC    C'H',C'ACELT',C'ECLAT'                                           
         DC    C'E',C'ADEEM',C'EDEMA'                                           
         DC    C'E',C'DDEEG',C'EDGED'                                           
         DC    C'E',C'DEEGR',C'EDGER'                                           
         DC    C'E',C'CDEIT',C'EDICT'                                           
         DC    C'H',C'DEFIY',C'EDIFY'                                           
         DC    C'H',C'DEEIL',C'EDILE'                                           
         DC    C'H',C'CDEEU',C'EDUCE'                                           
         DC    C'H',C'CDETU',C'EDUCT'                                           
         DC    C'E',C'EEEIR',C'EERIE'                                           
         DC    C'H',C'EEGST',C'EGEST'                                           
         DC    C'E',C'DEEGG',C'EGGED'                                           
         DC    C'H',C'EEGRT',C'EGRET'                                           
         DC    C'H',C'DEEIR',C'EIDER'                                           
         DC    C'E',C'EGHIT',C'EIGHT'                                           
         DC    C'H',C'EIKNO',C'EIKON'                                           
         DC    C'E',C'CEEJT',C'EJECT'                                           
         DC    C'H',C'EGIKN',C'EKING'                                           
         DC    C'H',C'ADELN',C'ELAND'                                           
         DC    C'E',C'AEELT',C'ELATE'                                           
         DC    C'E',C'BELOW',C'ELBOW'                                           
         DC    C'E',C'DEELR',C'ELDER'                                           
         DC    C'E',C'CEELT',C'ELECT'                                           
         DC    C'H',C'EEGLY',C'ELEGY'                                           
         DC    C'H',C'EEILM',C'ELEMI'                                           
         DC    C'H',C'EFILN',C'ELFIN'                                           
         DC    C'H',C'DEEIL',C'ELIDE'                                           
         DC    C'E',C'EEILT',C'ELITE'                                           
         DC    C'H',C'EILNO',C'ELOIN'                                           
         DC    C'E',C'EELOP',C'ELOPE'                                           
         DC    C'E',C'DEELU',C'ELUDE'                                           
         DC    C'H',C'EELTU',C'ELUTE'                                           
         DC    C'H',C'EELRV',C'ELVER'                                           
         DC    C'E',C'EELSV',C'ELVES'                                           
         DC    C'H',C'ABEMY',C'EMBAY'                                           
         DC    C'E',C'BDEEM',C'EMBED'                                           
         DC    C'E',C'BEEMR',C'EMBER'                                           
         DC    C'H',C'BEMOW',C'EMBOW'                                           
         DC    C'H',C'EEEMR',C'EMEER'                                           
         DC    C'E',C'DEEMN',C'EMEND'                                           
         DC    C'H',C'EEMRY',C'EMERY'                                           
         DC    C'H',C'EEMMR',C'EMMER'                                           
         DC    C'H',C'EEMMT',C'EMMET'                                           
         DC    C'E',C'EEMOT',C'EMOTE'                                           
         DC    C'E',C'EMPTY',C'EMPTY'                                           
         DC    C'E',C'ACENT',C'ENACT'                                           
         DC    C'E',C'DDEEN',C'ENDED'                                           
         DC    C'E',C'DENOW',C'ENDOW'                                           
         DC    C'H',C'DEENU',C'ENDUE'                                           
         DC    C'E',C'AEEMN',C'ENEMA'                                           
         DC    C'E',C'EEMNY',C'ENEMY'                                           
         DC    C'E',C'EJNOY',C'ENJOY'                                           
         DC    C'H',C'EINNU',C'ENNUI'                                           
         DC    C'H',C'ELNOR',C'ENROL'                                           
         DC    C'E',C'EENSU',C'ENSUE'                                           
         DC    C'E',C'EENRT',C'ENTER'                                           
         DC    C'E',C'ENRTY',C'ENTRY'                                           
         DC    C'H',C'EENRU',C'ENURE'                                           
         DC    C'H',C'EINOV',C'ENVOI'                                           
         DC    C'H',C'EINOS',C'EOSIN'                                           
         DC    C'H',C'ACEPT',C'EPACT'                                           
         DC    C'H',C'AEHHP',C'EPHAH'                                           
         DC    C'H',C'DEHOP',C'EPHOD'                                           
         DC    C'H',C'EHOPR',C'EPHOR'                                           
         DC    C'H',C'CEHOP',C'EPOCH'                                           
         DC    C'H',C'DEEOP',C'EPODE'                                           
         DC    C'E',C'EOPXY',C'EPOXY'                                           
         DC    C'E',C'AELQU',C'EQUAL'                                           
         DC    C'E',C'EIPQU',C'EQUIP'                                           
         DC    C'E',C'AEERS',C'ERASE'                                           
         DC    C'E',C'CEERT',C'ERECT'                                           
         DC    C'H',C'EGORT',C'ERGOT'                                           
         DC    C'E',C'DEEOR',C'ERODE'                                           
         DC    C'H',C'EEORS',C'EROSE'                                           
         DC    C'H',C'DEERR',C'ERRED'                                           
         DC    C'E',C'EORRR',C'ERROR'                                           
         DC    C'H',C'CERTU',C'ERUCT'                                           
         DC    C'E',C'EPRTU',C'ERUPT'                                           
         DC    C'H',C'AEKRS',C'ESKAR'                                           
         DC    C'H',C'EEKRS',C'ESKER'                                           
         DC    C'E',C'AESSY',C'ESSAY'                                           
         DC    C'H',C'EERST',C'ESTER'                                           
         DC    C'H',C'EOPST',C'ESTOP'                                           
         DC    C'E',C'EEHRT',C'ETHER'                                           
         DC    C'H',C'CEHIT',C'ETHIC'                                           
         DC    C'H',C'EHOST',C'ETHOS'                                           
         DC    C'E',C'EHLTY',C'ETHYL'                                           
         DC    C'E',C'DEETU',C'ETUDE'                                           
         DC    C'H',C'EEETW',C'ETWEE'                                           
         DC    C'E',C'ADEEV',C'EVADE'                                           
         DC    C'E',C'EENTV',C'EVENT'                                           
         DC    C'H',C'EERTV',C'EVERT'                                           
         DC    C'E',C'EERVY',C'EVERY'                                           
         DC    C'E',C'CEITV',C'EVICT'                                           
         DC    C'E',C'EEKOV',C'EVOKE'                                           
         DC    C'E',C'ACETX',C'EXACT'                                           
         DC    C'E',C'CEELX',C'EXCEL'                                           
         DC    C'E',C'EERTX',C'EXERT'                                           
         DC    C'E',C'EEILX',C'EXILE'                                           
         DC    C'E',C'EISTX',C'EXIST'                                           
         DC    C'E',C'EELPX',C'EXPEL'                                           
         DC    C'E',C'ELOTX',C'EXTOL'                                           
         DC    C'E',C'AERTX',C'EXTRA'                                           
         DC    C'E',C'DEEUX',C'EXUDE'                                           
         DC    C'H',C'ELTUX',C'EXULT'                                           
         DC    C'H',C'EGINY',C'EYING'                                           
         DC    C'H',C'EEIRY',C'EYRIE'                                           
         DC    C'H',C'EIRRY',C'EYRIR'                                           
         DC    C'E',C'ABEFL',C'FABLE'                                           
         DC    C'E',C'ACDEF',C'FACED'                                           
         DC    C'H',C'ACEFR',C'FACER'                                           
         DC    C'E',C'ACEFT',C'FACET'                                           
         DC    C'H',C'AACFI',C'FACIA'                                           
         DC    C'E',C'ADDEF',C'FADED'                                           
         DC    C'H',C'AEFRY',C'FAERY'                                           
         DC    C'H',C'AFGOT',C'FAGOT'                                           
         DC    C'E',C'AFINT',C'FAINT'                                           
         DC    C'E',C'AFIRY',C'FAIRY'                                           
         DC    C'E',C'AFHIT',C'FAITH'                                           
         DC    C'E',C'ADEFK',C'FAKED'                                           
         DC    C'H',C'AFIKR',C'FAKIR'                                           
         DC    C'E',C'AEFLS',C'FALSE'                                           
         DC    C'E',C'ADEFM',C'FAMED'                                           
         DC    C'E',C'ACFNY',C'FANCY'                                           
         DC    C'H',C'AFNNO',C'FANON'                                           
         DC    C'H',C'AADFR',C'FARAD'                                           
         DC    C'E',C'ACEFR',C'FARCE'                                           
         DC    C'H',C'ACFRY',C'FARCY'                                           
         DC    C'E',C'ADEFR',C'FARED'                                           
         DC    C'E',C'AAFLT',C'FATAL'                                           
         DC    C'E',C'ADEFT',C'FATED'                                           
         DC    C'H',C'AFLTY',C'FATLY'                                           
         DC    C'E',C'AFTTY',C'FATTY'                                           
         DC    C'H',C'AFGHU',C'FAUGH'                                           
         DC    C'E',C'AFLTU',C'FAULT'                                           
         DC    C'E',C'AAFNU',C'FAUNA'                                           
         DC    C'H',C'AEFUV',C'FAUVE'                                           
         DC    C'E',C'AFORV',C'FAVOR'                                           
         DC    C'H',C'AFSUV',C'FAVUS'                                           
         DC    C'E',C'ADEFZ',C'FAZED'                                           
         DC    C'E',C'AEFST',C'FEAST'                                           
         DC    C'H',C'AEEFZ',C'FEAZE'                                           
         DC    C'H',C'ACEFL',C'FECAL'                                           
         DC    C'E',C'CEEFS',C'FECES'                                           
         DC    C'H',C'EEEFZ',C'FEEZE'                                           
         DC    C'E',C'EFGIN',C'FEIGN'                                           
         DC    C'E',C'EFINT',C'FEINT'                                           
         DC    C'H',C'DEFIL',C'FELID'                                           
         DC    C'H',C'EFLLY',C'FELLY'                                           
         DC    C'E',C'EFLNO',C'FELON'                                           
         DC    C'E',C'EEFMM',C'FEMME'                                           
         DC    C'H',C'EFMRU',C'FEMUR'                                           
         DC    C'E',C'CEEFN',C'FENCE'                                           
         DC    C'H',C'EFNNY',C'FENNY'                                           
         DC    C'H',C'EFFFO',C'FEOFF'                                           
         DC    C'H',C'AEFLR',C'FERAL'                                           
         DC    C'H',C'AEFIR',C'FERIA'                                           
         DC    C'H',C'EFIMR',C'FERMI'                                           
         DC    C'H',C'EFNRY',C'FERNY'                                           
         DC    C'E',C'EFRRY',C'FERRY'                                           
         DC    C'H',C'EEFSS',C'FESSE'                                           
         DC    C'E',C'AEFLT',C'FETAL'                                           
         DC    C'E',C'CEFHT',C'FETCH'                                           
         DC    C'H',C'DEEFT',C'FETED'                                           
         DC    C'H',C'DEFIT',C'FETID'                                           
         DC    C'H',C'EFORT',C'FETOR'                                           
         DC    C'H',C'EFSTU',C'FETUS'                                           
         DC    C'E',C'EEFRV',C'FEVER'                                           
         DC    C'E',C'EEFRW',C'FEWER'                                           
         DC    C'E',C'BEFIR',C'FIBER'                                           
         DC    C'E',C'BEFIR',C'FIBRE'                                           
         DC    C'H',C'CFHIU',C'FICHU'                                           
         DC    C'E',C'DEFIL',C'FIELD'                                           
         DC    C'E',C'DEFIN',C'FIEND'                                           
         DC    C'E',C'EFIRY',C'FIERY'                                           
         DC    C'H',C'DEFFI',C'FIFED'                                           
         DC    C'H',C'EFFIR',C'FIFER'                                           
         DC    C'E',C'FFHIT',C'FIFTH'                                           
         DC    C'E',C'FFITY',C'FIFTY'                                           
         DC    C'E',C'FGHIT',C'FIGHT'                                           
         DC    C'H',C'AFILR',C'FILAR'                                           
         DC    C'E',C'CFHIL',C'FILCH'                                           
         DC    C'E',C'DEFIL',C'FILED'                                           
         DC    C'E',C'EFILT',C'FILET'                                           
         DC    C'E',C'FILLY',C'FILLY'                                           
         DC    C'H',C'FILMY',C'FILMY'                                           
         DC    C'E',C'FHILT',C'FILTH'                                           
         DC    C'H',C'FILMU',C'FILUM'                                           
         DC    C'E',C'AFILN',C'FINAL'                                           
         DC    C'E',C'CFHIN',C'FINCH'                                           
         DC    C'E',C'DEFIN',C'FINED'                                           
         DC    C'E',C'EFINR',C'FINER'                                           
         DC    C'H',C'FIINS',C'FINIS'                                           
         DC    C'H',C'FINNY',C'FINNY'                                           
         DC    C'H',C'DFIOR',C'FIORD'                                           
         DC    C'E',C'DEFIR',C'FIRED'                                           
         DC    C'H',C'EFIRR',C'FIRER'                                           
         DC    C'H',C'FIRRY',C'FIRRY'                                           
         DC    C'E',C'FIRST',C'FIRST'                                           
         DC    C'H',C'FHIRT',C'FIRTH'                                           
         DC    C'E',C'FHISY',C'FISHY'                                           
         DC    C'H',C'CFHIT',C'FITCH'                                           
         DC    C'E',C'FILTY',C'FITLY'                                           
         DC    C'E',C'EFIRV',C'FIVER'                                           
         DC    C'E',C'DEFIX',C'FIXED'                                           
         DC    C'E',C'EFIRX',C'FIXER'                                           
         DC    C'E',C'EFISX',C'FIXES'                                           
         DC    C'E',C'FIYZZ',C'FIZZY'                                           
         DC    C'H',C'DEFJL',C'FJELD'                                           
         DC    C'H',C'DFJOR',C'FJORD'                                           
         DC    C'E',C'ACFKL',C'FLACK'                                           
         DC    C'H',C'AFILL',C'FLAIL'                                           
         DC    C'E',C'AFILR',C'FLAIR'                                           
         DC    C'E',C'AEFKL',C'FLAKE'                                           
         DC    C'E',C'AFKLY',C'FLAKY'                                           
         DC    C'E',C'AEFLM',C'FLAME'                                           
         DC    C'H',C'AFLMY',C'FLAMY'                                           
         DC    C'E',C'AFKLN',C'FLANK'                                           
         DC    C'E',C'AEFLR',C'FLARE'                                           
         DC    C'E',C'AFHLS',C'FLASH'                                           
         DC    C'E',C'AFKLS',C'FLASK'                                           
         DC    C'H',C'AFLXY',C'FLAXY'                                           
         DC    C'H',C'AEFLM',C'FLEAM'                                           
         DC    C'H',C'CEFKL',C'FLECK'                                           
         DC    C'H',C'EEFLR',C'FLEER'                                           
         DC    C'E',C'EEFLT',C'FLEET'                                           
         DC    C'E',C'EFHLS',C'FLESH'                                           
         DC    C'E',C'CFIKL',C'FLICK'                                           
         DC    C'H',C'DEFIL',C'FLIED'                                           
         DC    C'E',C'EFILR',C'FLIER'                                           
         DC    C'E',C'EFILS',C'FLIES'                                           
         DC    C'E',C'FGILN',C'FLING'                                           
         DC    C'E',C'FILNT',C'FLINT'                                           
         DC    C'E',C'FILRT',C'FLIRT'                                           
         DC    C'H',C'EFILT',C'FLITE'                                           
         DC    C'E',C'AFLOT',C'FLOAT'                                           
         DC    C'E',C'CFKLO',C'FLOCK'                                           
         DC    C'E',C'DFLOO',C'FLOOD'                                           
         DC    C'E',C'FLOOR',C'FLOOR'                                           
         DC    C'E',C'AFLOR',C'FLORA'                                           
         DC    C'E',C'FLOSS',C'FLOSS'                                           
         DC    C'E',C'FLORU',C'FLOUR'                                           
         DC    C'H',C'FLOTU',C'FLOUT'                                           
         DC    C'E',C'FLNOW',C'FLOWN'                                           
         DC    C'E',C'FFFLU',C'FLUFF'                                           
         DC    C'E',C'DFILU',C'FLUID'                                           
         DC    C'E',C'EFKLU',C'FLUKE'                                           
         DC    C'H',C'FKLUY',C'FLUKY'                                           
         DC    C'E',C'EFLMU',C'FLUME'                                           
         DC    C'H',C'FLMPU',C'FLUMP'                                           
         DC    C'E',C'FGLNU',C'FLUNG'                                           
         DC    C'H',C'FLORU',C'FLUOR'                                           
         DC    C'E',C'FHLSU',C'FLUSH'                                           
         DC    C'E',C'EFLTU',C'FLUTE'                                           
         DC    C'H',C'FLTUY',C'FLUTY'                                           
         DC    C'E',C'EFLRY',C'FLYER'                                           
         DC    C'H',C'EFLTY',C'FLYTE'                                           
         DC    C'E',C'AFMOY',C'FOAMY'                                           
         DC    C'E',C'ACFLO',C'FOCAL'                                           
         DC    C'E',C'CFOSU',C'FOCUS'                                           
         DC    C'H',C'EFHNO',C'FOEHN'                                           
         DC    C'E',C'EFGOY',C'FOGEY'                                           
         DC    C'E',C'FGGOY',C'FOGGY'                                           
         DC    C'H',C'FIOST',C'FOIST'                                           
         DC    C'H',C'AFILO',C'FOLIA'                                           
         DC    C'H',C'FILOO',C'FOLIO'                                           
         DC    C'E',C'FLLOY',C'FOLLY'                                           
         DC    C'H',C'DFNOU',C'FONDU'                                           
         DC    C'H',C'FOOTY',C'FOOTY'                                           
         DC    C'H',C'AFORY',C'FORAY'                                           
         DC    C'H',C'BFORY',C'FORBY'                                           
         DC    C'E',C'CEFOR',C'FORCE'                                           
         DC    C'H',C'DFOOR',C'FORDO'                                           
         DC    C'E',C'EFGOR',C'FORGE'                                           
         DC    C'E',C'FGOOR',C'FORGO'                                           
         DC    C'H',C'EFORT',C'FORTE'                                           
         DC    C'E',C'FHORT',C'FORTH'                                           
         DC    C'E',C'FORTY',C'FORTY'                                           
         DC    C'E',C'FMORU',C'FORUM'                                           
         DC    C'H',C'AFOSS',C'FOSSA'                                           
         DC    C'H',C'EFOSS',C'FOSSE'                                           
         DC    C'H',C'FNOTU',C'FOUNT'                                           
         DC    C'H',C'AEFOV',C'FOVEA'                                           
         DC    C'E',C'EFORY',C'FOYER'                                           
         DC    C'E',C'AFILR',C'FRAIL'                                           
         DC    C'E',C'AEFMR',C'FRAME'                                           
         DC    C'H',C'ACFNR',C'FRANC'                                           
         DC    C'E',C'AFKNR',C'FRANK'                                           
         DC    C'E',C'ADFRU',C'FRAUD'                                           
         DC    C'E',C'AEFKR',C'FREAK'                                           
         DC    C'E',C'DEEFR',C'FREED'                                           
         DC    C'E',C'EEFRR',C'FREER'                                           
         DC    C'E',C'EFHRS',C'FRESH'                                           
         DC    C'E',C'AFIRR',C'FRIAR'                                           
         DC    C'E',C'DEFIR',C'FRIED'                                           
         DC    C'E',C'EFIRR',C'FRIER'                                           
         DC    C'E',C'EFIRS',C'FRIES'                                           
         DC    C'E',C'FILLR',C'FRILL'                                           
         DC    C'H',C'EFIRS',C'FRISE'                                           
         DC    C'E',C'FIKRS',C'FRISK'                                           
         DC    C'H',C'FHIRT',C'FRITH'                                           
         DC    C'H',C'FIRTZ',C'FRITZ'                                           
         DC    C'E',C'CFKOR',C'FROCK'                                           
         DC    C'H',C'DFNOR',C'FROND'                                           
         DC    C'H',C'FNORS',C'FRONS'                                           
         DC    C'E',C'FNORT',C'FRONT'                                           
         DC    C'H',C'EFORR',C'FRORE'                                           
         DC    C'E',C'FORST',C'FROST'                                           
         DC    C'E',C'FHORT',C'FROTH'                                           
         DC    C'E',C'FNORW',C'FROWN'                                           
         DC    C'E',C'EFORZ',C'FROZE'                                           
         DC    C'E',C'FIRTU',C'FRUIT'                                           
         DC    C'H',C'FMPRU',C'FRUMP'                                           
         DC    C'E',C'EFRRY',C'FRYER'                                           
         DC    C'H',C'BFSUY',C'FUBSY'                                           
         DC    C'H',C'CFSUU',C'FUCUS'                                           
         DC    C'E',C'DEFGU',C'FUDGE'                                           
         DC    C'H',C'AFGLU',C'FUGAL'                                           
         DC    C'H',C'FGGUY',C'FUGGY'                                           
         DC    C'H',C'EFGUU',C'FUGUE'                                           
         DC    C'E',C'FLLUY',C'FULLY'                                           
         DC    C'E',C'DEFMU',C'FUMED'                                           
         DC    C'H',C'FGINU',C'FUNGI'                                           
         DC    C'E',C'FKNUY',C'FUNKY'                                           
         DC    C'E',C'FNNUY',C'FUNNY'                                           
         DC    C'H',C'AFNRU',C'FURAN'                                           
         DC    C'E',C'FORRU',C'FUROR'                                           
         DC    C'E',C'FRRUY',C'FURRY'                                           
         DC    C'H',C'EFRUZ',C'FURZE'                                           
         DC    C'H',C'FRUYZ',C'FURZY'                                           
         DC    C'E',C'DEFSU',C'FUSED'                                           
         DC    C'H',C'EEFSU',C'FUSEE'                                           
         DC    C'H',C'FILSU',C'FUSIL'                                           
         DC    C'E',C'FSSUY',C'FUSSY'                                           
         DC    C'H',C'FSTUY',C'FUSTY'                                           
         DC    C'H',C'DEFUZ',C'FUZED'                                           
         DC    C'E',C'FUYZZ',C'FUZZY'                                           
         DC    C'E',C'ABBGY',C'GABBY'                                           
         DC    C'H',C'ABEGL',C'GABLE'                                           
         DC    C'H',C'AEFFG',C'GAFFE'                                           
         DC    C'H',C'ADEGG',C'GAGED'                                           
         DC    C'E',C'AGILY',C'GAILY'                                           
         DC    C'H',C'AAGHL',C'GALAH'                                           
         DC    C'H',C'AAEGL',C'GALEA'                                           
         DC    C'H',C'AGLOP',C'GALOP'                                           
         DC    C'H',C'ABEGM',C'GAMBE'                                           
         DC    C'H',C'ADEMG',C'GAMED'                                           
         DC    C'H',C'ACGIM',C'GAMIC'                                           
         DC    C'H',C'AGIMN',C'GAMIN'                                           
         DC    C'H',C'AAGMM',C'GAMMA'                                           
         DC    C'H',C'AGMTU',C'GAMUT'                                           
         DC    C'H',C'AEFGN',C'GANEF'                                           
         DC    C'H',C'AAGJN',C'GANJA'                                           
         DC    C'E',C'ADEGP',C'GAPED'                                           
         DC    C'E',C'AEGPR',C'GAPER'                                           
         DC    C'H',C'AGHRT',C'GARTH'                                           
         DC    C'H',C'AGSSY',C'GASSY'                                           
         DC    C'H',C'ADEGT',C'GATED'                                           
         DC    C'E',C'ADGUY',C'GAUDY'                                           
         DC    C'E',C'AEGGU',C'GAUGE'                                           
         DC    C'E',C'AGNTU',C'GAUNT'                                           
         DC    C'H',C'AGSSU',C'GAUSS'                                           
         DC    C'E',C'AEGUZ',C'GAUZE'                                           
         DC    C'H',C'AGUYZ',C'GAUZY'                                           
         DC    C'E',C'AEGLV',C'GAVEL'                                           
         DC    C'H',C'AGOTV',C'GAVOT'                                           
         DC    C'E',C'AGKWY',C'GAWKY'                                           
         DC    C'E',C'AEGRY',C'GAYER'                                           
         DC    C'E',C'AGLYY',C'GAYLY'                                           
         DC    C'E',C'ADEGZ',C'GAZED'                                           
         DC    C'H',C'CEGKO',C'GECKO'                                           
         DC    C'E',C'EEEGS',C'GEESE'                                           
         DC    C'H',C'DEGIL',C'GELID'                                           
         DC    C'H',C'AEGMM',C'GEMMA'                                           
         DC    C'H',C'EGMMY',C'GEMMY'                                           
         DC    C'H',C'EGMOT',C'GEMOT'                                           
         DC    C'H',C'EEGNT',C'GENET'                                           
         DC    C'H',C'CEGIN',C'GENIC'                                           
         DC    C'E',C'EEGIN',C'GENIE'                                           
         DC    C'H',C'EGIIN',C'GENII'                                           
         DC    C'E',C'EEGNR',C'GENRE'                                           
         DC    C'H',C'EGNOR',C'GENRO'                                           
         DC    C'H',C'AEGNU',C'GENUA'                                           
         DC    C'H',C'EGNSU',C'GENUS'                                           
         DC    C'H',C'DEEGO',C'GEODE'                                           
         DC    C'H',C'DEGIO',C'GEOID'                                           
         DC    C'H',C'AEGHR',C'GERAH'                                           
         DC    C'H',C'EGOSS',C'GESSO'                                           
         DC    C'E',C'EGPTU',C'GETUP'                                           
         DC    C'H',C'AGHTU',C'GHAUT'                                           
         DC    C'H',C'AGHIZ',C'GHAZI'                                           
         DC    C'E',C'GHOST',C'GHOST'                                           
         DC    C'E',C'GHLOU',C'GHOUL'                                           
         DC    C'H',C'GHLLY',C'GHYLL'                                           
         DC    C'E',C'AGINT',C'GIANT'                                           
         DC    C'E',C'BDEGI',C'GIBED'                                           
         DC    C'H',C'BEGIR',C'GIBER'                                           
         DC    C'E',C'DDGIY',C'GIDDY'                                           
         DC    C'H',C'GGIOT',C'GIGOT'                                           
         DC    C'H',C'EGGIU',C'GIGUE'                                           
         DC    C'H',C'GILLY',C'GILLY'                                           
         DC    C'H',C'EGILM',C'GIMEL'                                           
         DC    C'H',C'GINOP',C'GIPON'                                           
         DC    C'H',C'GIPSY',C'GIPSY'                                           
         DC    C'E',C'GILRY',C'GIRLY'                                           
         DC    C'E',C'GHIRT',C'GIRTH'                                           
         DC    C'E',C'EGINV',C'GIVEN'                                           
         DC    C'E',C'EGIRV',C'GIVER'                                           
         DC    C'H',C'ACEGL',C'GLACE'                                           
         DC    C'E',C'ADEGL',C'GLADE'                                           
         DC    C'H',C'AGILR',C'GLAIR'                                           
         DC    C'E',C'ADGLN',C'GLAND'                                           
         DC    C'E',C'AGLNS',C'GLANS'                                           
         DC    C'E',C'AEGLR',C'GLARE'                                           
         DC    C'H',C'AGLRY',C'GLARY'                                           
         DC    C'E',C'AGLSS',C'GLASS'                                           
         DC    C'E',C'AEGLZ',C'GLAZE'                                           
         DC    C'E',C'AEGLM',C'GLEAM'                                           
         DC    C'H',C'AEGLN',C'GLEAN'                                           
         DC    C'H',C'BEEGL',C'GLEBE'                                           
         DC    C'H',C'DEEGL',C'GLEDE'                                           
         DC    C'H',C'DEEGL',C'GLEED'                                           
         DC    C'H',C'EEGLT',C'GLEET'                                           
         DC    C'H',C'AGILL',C'GLIAL'                                           
         DC    C'E',C'DEGIL',C'GLIDE'                                           
         DC    C'E',C'GILNT',C'GLINT'                                           
         DC    C'E',C'AGLOT',C'GLOAT'                                           
         DC    C'E',C'BEGLO',C'GLOBE'                                           
         DC    C'H',C'GGGLO',C'GLOGG'                                           
         DC    C'E',C'GLMOO',C'GLOOM'                                           
         DC    C'E',C'GLORY',C'GLORY'                                           
         DC    C'E',C'GLOSS',C'GLOSS'                                           
         DC    C'E',C'EGLOV',C'GLOVE'                                           
         DC    C'H',C'EGLOZ',C'GLOZE'                                           
         DC    C'E',C'DEGLU',C'GLUED'                                           
         DC    C'H',C'EGLRU',C'GLUER'                                           
         DC    C'H',C'EGLUY',C'GLUEY'                                           
         DC    C'H',C'EGLMU',C'GLUME'                                           
         DC    C'H',C'GHLPY',C'GLYPH'                                           
         DC    C'E',C'AGLNR',C'GNARL'                                           
         DC    C'H',C'AGNRR',C'GNARR'                                           
         DC    C'E',C'AGHNS',C'GNASH'                                           
         DC    C'H',C'AGNNW',C'GNAWN'                                           
         DC    C'E',C'EGMNO',C'GNOME'                                           
         DC    C'E',C'DGLOY',C'GODLY'                                           
         DC    C'E',C'GGINO',C'GOING'                                           
         DC    C'H',C'EGLMO',C'GOLEM'                                           
         DC    C'E',C'GLLOY',C'GOLLY'                                           
         DC    C'E',C'ADGNO',C'GONAD'                                           
         DC    C'H',C'EFGNO',C'GONEF'                                           
         DC    C'E',C'EGNOR',C'GONER'                                           
         DC    C'H',C'FGINO',C'GONIF'                                           
         DC    C'H',C'FGNOO',C'GONOF'                                           
         DC    C'E',C'DGOOS',C'GOODS'                                           
         DC    C'E',C'DGOOY',C'GOODY'                                           
         DC    C'E',C'FGOOY',C'GOOFY'                                           
         DC    C'E',C'EGOOS',C'GOOSE'                                           
         DC    C'H',C'AGLOR',C'GORAL'                                           
         DC    C'E',C'DEGOR',C'GORED'                                           
         DC    C'E',C'EGGOR',C'GORGE'                                           
         DC    C'H',C'EGORS',C'GORSE'                                           
         DC    C'H',C'GORSY',C'GORSY'                                           
         DC    C'E',C'EGGOU',C'GOUGE'                                           
         DC    C'E',C'DGORU',C'GOURD'                                           
         DC    C'H',C'GOTUY',C'GOUTY'                                           
         DC    C'E',C'ACEGR',C'GRACE'                                           
         DC    C'E',C'ADEGR',C'GRADE'                                           
         DC    C'E',C'AFGRT',C'GRAFT'                                           
         DC    C'E',C'AGILR',C'GRAIL'                                           
         DC    C'E',C'AGINR',C'GRAIN'                                           
         DC    C'E',C'ADGNR',C'GRAND'                                           
         DC    C'E',C'AGNRT',C'GRANT'                                           
         DC    C'E',C'AEGPR',C'GRAPE'                                           
         DC    C'E',C'AGHPR',C'GRAPH'                                           
         DC    C'H',C'AGPRY',C'GRAPY'                                           
         DC    C'E',C'AGPRS',C'GRASP'                                           
         DC    C'E',C'AGRSS',C'GRASS'                                           
         DC    C'E',C'AEGRT',C'GRATE'                                           
         DC    C'E',C'AEGRV',C'GRAVE'                                           
         DC    C'E',C'AEGRZ',C'GRAZE'                                           
         DC    C'E',C'AEGRT',C'GREAT'                                           
         DC    C'H',C'BEEGR',C'GREBE'                                           
         DC    C'E',C'DEEGR',C'GREED'                                           
         DC    C'E',C'EEGNR',C'GREEN'                                           
         DC    C'E',C'EEGRT',C'GREET'                                           
         DC    C'H',C'EGGOR',C'GREGO'                                           
         DC    C'H',C'DEGIR',C'GRIDE'                                           
         DC    C'E',C'EFGIR',C'GRIEF'                                           
         DC    C'E',C'GILLR',C'GRILL'                                           
         DC    C'E',C'EGIMR',C'GRIME'                                           
         DC    C'E',C'GIMRY',C'GRIMY'                                           
         DC    C'E',C'DGINR',C'GRIND'                                           
         DC    C'E',C'EGIPR',C'GRIPE'                                           
         DC    C'H',C'GIPRT',C'GRIPT'                                           
         DC    C'H',C'GIRST',C'GRIST'                                           
         DC    C'H',C'GHIRT',C'GRITH'                                           
         DC    C'E',C'AGNOR',C'GROAN'                                           
         DC    C'H',C'AGORT',C'GROAT'                                           
         DC    C'E',C'GINOR',C'GROIN'                                           
         DC    C'E',C'GMOOR',C'GROOM'                                           
         DC    C'E',C'EGOPR',C'GROPE'                                           
         DC    C'E',C'GORSS',C'GROSS'                                           
         DC    C'H',C'GORSZ',C'GROSZ'                                           
         DC    C'E',C'GOPRU',C'GROUP'                                           
         DC    C'E',C'GORTU',C'GROUT'                                           
         DC    C'E',C'EGORV',C'GROVE'                                           
         DC    C'E',C'GLORW',C'GROWL'                                           
         DC    C'E',C'GNORW',C'GROWN'                                           
         DC    C'E',C'EGLRU',C'GRUEL'                                           
         DC    C'E',C'FFGRU',C'GRUFF'                                           
         DC    C'H',C'EGMRU',C'GRUME'                                           
         DC    C'E',C'GMPRU',C'GRUMP'                                           
         DC    C'E',C'GNRTU',C'GRUNT'                                           
         DC    C'H',C'ACGOU',C'GUACO'                                           
         DC    C'H',C'AGNOU',C'GUANO'                                           
         DC    C'E',C'ADGRU',C'GUARD'                                           
         DC    C'H',C'AAGUV',C'GUAVA'                                           
         DC    C'E',C'EGSSU',C'GUESS'                                           
         DC    C'E',C'EGSTU',C'GUEST'                                           
         DC    C'E',C'DEGIU',C'GUIDE'                                           
         DC    C'E',C'DGILU',C'GUILD'                                           
         DC    C'E',C'EGILU',C'GUILE'                                           
         DC    C'E',C'GILTU',C'GUILT'                                           
         DC    C'E',C'EGISU',C'GUISE'                                           
         DC    C'H',C'AGLRU',C'GULAR'                                           
         DC    C'H',C'FGLUY',C'GULFY'                                           
         DC    C'E',C'GLLUY',C'GULLY'                                           
         DC    C'H',C'AGMMU',C'GUMMA'                                           
         DC    C'H',C'GMMUY',C'GUMMY'                                           
         DC    C'H',C'GNNUY',C'GUNNY'                                           
         DC    C'E',C'GPPUY',C'GUPPY'                                           
         DC    C'E',C'EGGRU',C'GURGE'                                           
         DC    C'E',C'GHSUY',C'GUSHY'                                           
         DC    C'E',C'GOSTU',C'GUSTO'                                           
         DC    C'E',C'GSTUY',C'GUSTY'                                           
         DC    C'E',C'GSTUY',C'GUTSY'                                           
         DC    C'H',C'AGTTU',C'GUTTA'                                           
         DC    C'H',C'GTTUY',C'GUTTY'                                           
         DC    C'H',C'BDEGY',C'GYBED'                                           
         DC    C'E',C'GPSYY',C'GYPSY'                                           
         DC    C'H',C'AGLRY',C'GYRAL'                                           
         DC    C'H',C'DEGRY',C'GYRED'                                           
         DC    C'H',C'GRSUY',C'GYRUS'                                           
         DC    C'H',C'DEGVY',C'GYVED'                                           
         DC    C'E',C'ABHIT',C'HABIT'                                           
         DC    C'H',C'ADHIJ',C'HADJI'                                           
         DC    C'H',C'ADHST',C'HADST'                                           
         DC    C'H',C'AFHIZ',C'HAFIZ'                                           
         DC    C'E',C'AHIKU',C'HAIKU'                                           
         DC    C'E',C'AHIRY',C'HAIRY'                                           
         DC    C'H',C'AHIJJ',C'HAJJI'                                           
         DC    C'H',C'AHIKM',C'HAKIM'                                           
         DC    C'H',C'ADEHL',C'HALED'                                           
         DC    C'H',C'AEHLR',C'HALER'                                           
         DC    C'H',C'AHLLO',C'HALLO'                                           
         DC    C'H',C'AAHLV',C'HALVA'                                           
         DC    C'H',C'AEHLV',C'HALVE'                                           
         DC    C'H',C'AAHLM',C'HAMAL'                                           
         DC    C'H',C'AHMMY',C'HAMMY'                                           
         DC    C'E',C'ADHNY',C'HANDY'                                           
         DC    C'H',C'AEHNS',C'HANSE'                                           
         DC    C'H',C'AHLPY',C'HAPLY'                                           
         DC    C'E',C'AHPPY',C'HAPPY'                                           
         DC    C'H',C'ADHRS',C'HARDS'                                           
         DC    C'E',C'ADHRY',C'HARDY'                                           
         DC    C'E',C'AEHMR',C'HAREM'                                           
         DC    C'H',C'AHRRY',C'HARRY'                                           
         DC    C'E',C'AHHRS',C'HARSH'                                           
         DC    C'E',C'AEHST',C'HASTE'                                           
         DC    C'E',C'AHSTY',C'HASTY'                                           
         DC    C'E',C'ACHHT',C'HATCH'                                           
         DC    C'E',C'ADEHT',C'HATED'                                           
         DC    C'E',C'AEHRT',C'HATER'                                           
         DC    C'H',C'AHLMU',C'HAULM'                                           
         DC    C'E',C'AHNTU',C'HAUNT'                                           
         DC    C'E',C'AEHNV',C'HAVEN'                                           
         DC    C'H',C'AEHRV',C'HAVER'                                           
         DC    C'E',C'ACHOV',C'HAVOC'                                           
         DC    C'H',C'AEHSW',C'HAWSE'                                           
         DC    C'H',C'AAHNZ',C'HAZAN'                                           
         DC    C'E',C'ADEHZ',C'HAZED'                                           
         DC    C'E',C'AEHLZ',C'HAZEL'                                           
         DC    C'E',C'ADEHY',C'HEADY'                                           
         DC    C'E',C'ADEHR',C'HEARD'                                           
         DC    C'E',C'AEHRT',C'HEART'                                           
         DC    C'H',C'AEHHT',C'HEATH'                                           
         DC    C'E',C'AEEHV',C'HEAVE'                                           
         DC    C'E',C'AEHVY',C'HEAVY'                                           
         DC    C'E',C'DEEGH',C'HEDGE'                                           
         DC    C'E',C'EFHTY',C'HEFTY'                                           
         DC    C'H',C'EGHHI',C'HEIGH'                                           
         DC    C'H',C'EHILX',C'HELIX'                                           
         DC    C'E',C'EHLLO',C'HELLO'                                           
         DC    C'H',C'EEHLV',C'HELVE'                                           
         DC    C'H',C'AEHLM',C'HEMAL'                                           
         DC    C'H',C'CEHIM',C'HEMIC'                                           
         DC    C'H',C'EHIMN',C'HEMIN'                                           
         DC    C'E',C'AEHNN',C'HENNA'                                           
         DC    C'H',C'BEHRY',C'HERBY'                                           
         DC    C'H',C'EHNOR',C'HERON'                                           
         DC    C'H',C'EHRTZ',C'HERTZ'                                           
         DC    C'H',C'DEEHW',C'HEWED'                                           
         DC    C'H',C'EEHRW',C'HEWER'                                           
         DC    C'H',C'ADEHX',C'HEXAD'                                           
         DC    C'E',C'DEEHX',C'HEXED'                                           
         DC    C'H',C'EHLXY',C'HEXYL'                                           
         DC    C'H',C'DDEHI',C'HIDED'                                           
         DC    C'E',C'DEHIR',C'HIDER'                                           
         DC    C'E',C'GHHIT',C'HIGHT'                                           
         DC    C'E',C'DEHIK',C'HIKED'                                           
         DC    C'E',C'EHIKR',C'HIKER'                                           
         DC    C'H',C'AHILR',C'HILAR'                                           
         DC    C'H',C'HILLO',C'HILLO'                                           
         DC    C'E',C'HILLY',C'HILLY'                                           
         DC    C'H',C'HILMU',C'HILUM'                                           
         DC    C'H',C'HILSU',C'HILUS'                                           
         DC    C'E',C'EGHIN',C'HINGE'                                           
         DC    C'H',C'HINNY',C'HINNY'                                           
         DC    C'E',C'HIOPP',C'HIPPO'                                           
         DC    C'E',C'DEHIR',C'HIRED'                                           
         DC    C'E',C'EHIRR',C'HIRER'                                           
         DC    C'E',C'CHHIT',C'HITCH'                                           
         DC    C'H',C'DEHIV',C'HIVED'                                           
         DC    C'E',C'EHISV',C'HIVES'                                           
         DC    C'E',C'ADHOR',C'HOARD'                                           
         DC    C'H',C'AHORY',C'HOARY'                                           
         DC    C'E',C'BBHOY',C'HOBBY'                                           
         DC    C'E',C'CHOSU',C'HOCUS'                                           
         DC    C'H',C'CHIKO',C'HOICK'                                           
         DC    C'H',C'EHIOS',C'HOISE'                                           
         DC    C'E',C'HIOST',C'HOIST'                                           
         DC    C'H',C'HKKOU',C'HOKKU'                                           
         DC    C'E',C'DEHLO',C'HOLED'                                           
         DC    C'H',C'EHLOY',C'HOLEY'                                           
         DC    C'H',C'AHLLO',C'HOLLA'                                           
         DC    C'H',C'HLLOO',C'HOLLO'                                           
         DC    C'E',C'HLLOY',C'HOLLY'                                           
         DC    C'H',C'DEHMO',C'HOMED'                                           
         DC    C'E',C'EHMOR',C'HOMER'                                           
         DC    C'E',C'EHMOY',C'HOMEY'                                           
         DC    C'E',C'DEHNO',C'HONED'                                           
         DC    C'E',C'EHNOR',C'HONER'                                           
         DC    C'E',C'EHNOY',C'HONEY'                                           
         DC    C'E',C'HNOOR',C'HONOR'                                           
         DC    C'H',C'AHKOO',C'HOOKA'                                           
         DC    C'E',C'DEHOP',C'HOPED'                                           
         DC    C'E',C'EHOPR',C'HOPER'                                           
         DC    C'H',C'AHLOR',C'HORAL'                                           
         DC    C'H',C'DEHOR',C'HORDE'                                           
         DC    C'E',C'HNORY',C'HORNY'                                           
         DC    C'E',C'EHORS',C'HORSE'                                           
         DC    C'H',C'HORST',C'HORST'                                           
         DC    C'E',C'HORSY',C'HORSY'                                           
         DC    C'E',C'DEHOS',C'HOSED'                                           
         DC    C'H',C'EHNOS',C'HOSEN'                                           
         DC    C'E',C'EHLOT',C'HOTEL'                                           
         DC    C'E',C'HLOTY',C'HOTLY'                                           
         DC    C'E',C'DHNOU',C'HOUND'                                           
         DC    C'H',C'HIORU',C'HOURI'                                           
         DC    C'E',C'EHOSU',C'HOUSE'                                           
         DC    C'H',C'EHLOV',C'HOVEL'                                           
         DC    C'E',C'EHORV',C'HOVER'                                           
         DC    C'E',C'DHOWY',C'HOWDY'                                           
         DC    C'E',C'BBHUY',C'HUBBY'                                           
         DC    C'E',C'FFHUY',C'HUFFY'                                           
         DC    C'E',C'HKLUY',C'HULKY'                                           
         DC    C'H',C'HLLOU',C'HULLO'                                           
         DC    C'E',C'AHMNU',C'HUMAN'                                           
         DC    C'H',C'CHIMU',C'HUMIC'                                           
         DC    C'E',C'DHIMU',C'HUMID'                                           
         DC    C'E',C'HMORU',C'HUMOR'                                           
         DC    C'H',C'HHMPU',C'HUMPH'                                           
         DC    C'E',C'HMPUY',C'HUMPY'                                           
         DC    C'H',C'HMSUU',C'HUMUS'                                           
         DC    C'E',C'CHHNU',C'HUNCH'                                           
         DC    C'H',C'HLRUY',C'HURLY'                                           
         DC    C'E',C'HRRUY',C'HURRY'                                           
         DC    C'E',C'HKSUY',C'HUSKY'                                           
         DC    C'E',C'HSSUY',C'HUSSY'                                           
         DC    C'E',C'CHHTU',C'HUTCH'                                           
         DC    C'H',C'AHUZZ',C'HUZZA'                                           
         DC    C'H',C'DHORY',C'HYDRO'                                           
         DC    C'E',C'AEHNY',C'HYENA'                                           
         DC    C'H',C'GHINY',C'HYING'                                           
         DC    C'E',C'EHMNY',C'HYMEN'                                           
         DC    C'H',C'DHIOY',C'HYOID'                                           
         DC    C'H',C'AHRXY',C'HYRAX'                                           
         DC    C'H',C'HNOSY',C'HYSON'                                           
         DC    C'H',C'CHIOR',C'ICHOR'                                           
         DC    C'E',C'CEIIR',C'ICIER'                                           
         DC    C'E',C'CIILY',C'ICILY'                                           
         DC    C'E',C'CGIIN',C'ICING'                                           
         DC    C'H',C'CISTU',C'ICTUS'                                           
         DC    C'E',C'ADEIL',C'IDEAL'                                           
         DC    C'H',C'DIIMO',C'IDIOM'                                           
         DC    C'E',C'DIIOT',C'IDIOT'                                           
         DC    C'E',C'DDEIL',C'IDLED'                                           
         DC    C'H',C'DEILR',C'IDLER'                                           
         DC    C'H',C'DILLY',C'IDYLL'                                           
         DC    C'E',C'GILOO',C'IGLOO'                                           
         DC    C'H',C'AHIMR',C'IHRAM'                                           
         DC    C'H',C'ACEIL',C'ILEAC'                                           
         DC    C'H',C'EILMU',C'ILEUM'                                           
         DC    C'H',C'EILSU',C'ILEUS'                                           
         DC    C'H',C'ACIIL',C'ILIAC'                                           
         DC    C'H',C'IILMU',C'ILIUM'                                           
         DC    C'E',C'AEGIM',C'IMAGE'                                           
         DC    C'H',C'AGIMO',C'IMAGO'                                           
         DC    C'H',C'BDEIM',C'IMBED'                                           
         DC    C'H',C'BEIMU',C'IMBUE'                                           
         DC    C'H',C'DEIIM',C'IMIDE'                                           
         DC    C'H',C'DIIMO',C'IMIDO'                                           
         DC    C'H',C'EIIMN',C'IMINE'                                           
         DC    C'H',C'IIMNO',C'IMINO'                                           
         DC    C'H',C'IIMMX',C'IMMIX'                                           
         DC    C'H',C'DEIMP',C'IMPED'                                           
         DC    C'E',C'EILMP',C'IMPEL'                                           
         DC    C'E',C'ILMPY',C'IMPLY'                                           
         DC    C'E',C'AEINN',C'INANE'                                           
         DC    C'E',C'AINPT',C'INAPT'                                           
         DC    C'E',C'CINRU',C'INCUR'                                           
         DC    C'H',C'CINSU',C'INCUS'                                           
         DC    C'E',C'DEINX',C'INDEX'                                           
         DC    C'H',C'DIINR',C'INDRI'                                           
         DC    C'H',C'DEINU',C'INDUE'                                           
         DC    C'E',C'EINPT',C'INEPT'                                           
         DC    C'E',C'EINRT',C'INERT'                                           
         DC    C'E',C'EFINR',C'INFER'                                           
         DC    C'H',C'FIINX',C'INFIX'                                           
         DC    C'H',C'EGILN',C'INGLE'                                           
         DC    C'E',C'GINOT',C'INGOT'                                           
         DC    C'H',C'IINNO',C'INION'                                           
         DC    C'E',C'DEIKN',C'INKED'                                           
         DC    C'E',C'EIKNR',C'INKER'                                           
         DC    C'H',C'EIKLN',C'INKLE'                                           
         DC    C'H',C'AILNY',C'INLAY'                                           
         DC    C'E',C'EILNT',C'INLET'                                           
         DC    C'E',C'EINNR',C'INNER'                                           
         DC    C'E',C'INPTU',C'INPUT'                                           
         DC    C'E',C'EINST',C'INSET'                                           
         DC    C'E',C'EINRT',C'INTER'                                           
         DC    C'H',C'EINRU',C'INURE'                                           
         DC    C'H',C'INNRU',C'INURN'                                           
         DC    C'H',C'CDIIO',C'IODIC'                                           
         DC    C'H',C'CIINO',C'IONIC'                                           
         DC    C'H',C'ADEIR',C'IRADE'                                           
         DC    C'E',C'AEIRT',C'IRATE'                                           
         DC    C'E',C'DEIKR',C'IRKED'                                           
         DC    C'E',C'INORY',C'IRONY'                                           
         DC    C'H',C'DEILS',C'ISLED'                                           
         DC    C'H',C'EILST',C'ISLET'                                           
         DC    C'E',C'EISSU',C'ISSUE'                                           
         DC    C'H',C'EILST',C'ISTLE'                                           
         DC    C'E',C'CHITY',C'ITCHY'                                           
         DC    C'E',C'IORVY',C'IVORY'                                           
         DC    C'H',C'EILTX',C'IXTLE'                                           
         DC    C'H',C'ABJOT',C'JABOT'                                           
         DC    C'E',C'ADDEJ',C'JADED'                                           
         DC    C'H',C'AEGJR',C'JAGER'                                           
         DC    C'E',C'AGGJY',C'JAGGY'                                           
         DC    C'H',C'AEJKS',C'JAKES'                                           
         DC    C'H',C'AAJLP',C'JALAP'                                           
         DC    C'H',C'AAJNP',C'JAPAN'                                           
         DC    C'H',C'ADEJP',C'JAPED'                                           
         DC    C'H',C'AEJPR',C'JAPER'                                           
         DC    C'E',C'AJNTU',C'JAUNT'                                           
         DC    C'H',C'BEEJL',C'JEBEL'                                           
         DC    C'H',C'ADEHJ',C'JEHAD'                                           
         DC    C'E',C'EJLLY',C'JELLY'                                           
         DC    C'H',C'EJMMY',C'JEMMY'                                           
         DC    C'H',C'EJNNY',C'JENNY'                                           
         DC    C'E',C'EJKRY',C'JERKY'                                           
         DC    C'H',C'EJTTY',C'JETTY'                                           
         DC    C'E',C'EEJLW',C'JEWEL'                                           
         DC    C'E',C'BDEIJ',C'JIBED'                                           
         DC    C'H',C'BEIJR',C'JIBER'                                           
         DC    C'E',C'FFIJY',C'JIFFY'                                           
         DC    C'H',C'ADHIJ',C'JIHAD'                                           
         DC    C'E',C'IJMMY',C'JIMMY'                                           
         DC    C'E',C'GIJNO',C'JINGO'                                           
         DC    C'H',C'IIJNN',C'JINNI'                                           
         DC    C'H',C'CJKOO',C'JOCKO'                                           
         DC    C'E',C'IJNOT',C'JOINT'                                           
         DC    C'H',C'IJOST',C'JOIST'                                           
         DC    C'E',C'DEJKO',C'JOKED'                                           
         DC    C'E',C'EJKOR',C'JOKER'                                           
         DC    C'E',C'JLLOY',C'JOLLY'                                           
         DC    C'H',C'JLOTY',C'JOLTY'                                           
         DC    C'H',C'JMORU',C'JORUM'                                           
         DC    C'H',C'EJLOU',C'JOULE'                                           
         DC    C'E',C'JOSTU',C'JOUST'                                           
         DC    C'H',C'JLOWY',C'JOWLY'                                           
         DC    C'E',C'DEJOY',C'JOYED'                                           
         DC    C'E',C'DEGJU',C'JUDGE'                                           
         DC    C'H',C'AGJLU',C'JUGAL'                                           
         DC    C'H',C'GJMUU',C'JUGUM'                                           
         DC    C'E',C'CEIJU',C'JUICE'                                           
         DC    C'E',C'CIJUY',C'JUICY'                                           
         DC    C'E',C'EJLPU',C'JULEP'                                           
         DC    C'E',C'BJMOU',C'JUMBO'                                           
         DC    C'E',C'JMPUY',C'JUMPY'                                           
         DC    C'H',C'CJNOU',C'JUNCO'                                           
         DC    C'E',C'JKNUY',C'JUNKY'                                           
         DC    C'H',C'AJNTU',C'JUNTA'                                           
         DC    C'H',C'JNOPU',C'JUPON'                                           
         DC    C'H',C'AJLRU',C'JURAL'                                           
         DC    C'H',C'AJRTU',C'JURAT'                                           
         DC    C'H',C'EJLRU',C'JUREL'                                           
         DC    C'E',C'JORRU',C'JUROR'                                           
         DC    C'E',C'JTTUY',C'JUTTY'                                           
         DC    C'E',C'ABBKO',C'KABOB'                                           
         DC    C'H',C'AFIKR',C'KAFIR'                                           
         DC    C'H',C'AAIKK',C'KAIAK'                                           
         DC    C'H',C'AFIKL',C'KALIF'                                           
         DC    C'H',C'AKKOP',C'KAPOK'                                           
         DC    C'H',C'AAKPP',C'KAPPA'                                           
         DC    C'E',C'AKPTU',C'KAPUT'                                           
         DC    C'E',C'AAKRT',C'KARAT'                                           
         DC    C'E',C'AAKMR',C'KARMA'                                           
         DC    C'H',C'AKRST',C'KARST'                                           
         DC    C'H',C'AIKRU',C'KAURI'                                           
         DC    C'E',C'AAKKY',C'KAYAK'                                           
         DC    C'E',C'AKOOZ',C'KAZOO'                                           
         DC    C'H',C'ABBEK',C'KEBAB'                                           
         DC    C'H',C'DEEGK',C'KEDGE'                                           
         DC    C'H',C'EFIKR',C'KEFIR'                                           
         DC    C'H',C'EKLPY',C'KELPY'                                           
         DC    C'H',C'EKMPT',C'KEMPT'                                           
         DC    C'H',C'AEFKN',C'KENAF'                                           
         DC    C'H',C'CEHKN',C'KENCH'                                           
         DC    C'H',C'DEKNO',C'KENDO'                                           
         DC    C'H',C'EEKNR',C'KERNE'                                           
         DC    C'H',C'CEHKT',C'KETCH'                                           
         DC    C'H',C'EEKLV',C'KEVEL'                                           
         DC    C'H',C'DEEKY',C'KEYED'                                           
         DC    C'H',C'ADHIK',C'KHADI'                                           
         DC    C'E',C'AHIKK',C'KHAKI'                                           
         DC    C'H',C'AGIKN',C'KIANG'                                           
         DC    C'E',C'DDIKY',C'KIDDY'                                           
         DC    C'H',C'IIKNN',C'KININ'                                           
         DC    C'E',C'IKKNY',C'KINKY'                                           
         DC    C'E',C'IKKOS',C'KIOSK'                                           
         DC    C'H',C'DEIKT',C'KITED'                                           
         DC    C'H',C'EHIKT',C'KITHE'                                           
         DC    C'E',C'IKTTY',C'KITTY'                                           
         DC    C'E',C'ACKKN',C'KNACK'                                           
         DC    C'E',C'AEKNV',C'KNAVE'                                           
         DC    C'E',C'ADEKN',C'KNEAD'                                           
         DC    C'H',C'DEEKN',C'KNEED'                                           
         DC    C'E',C'EEKLN',C'KNEEL'                                           
         DC    C'H',C'EKLLN',C'KNELL'                                           
         DC    C'E',C'EKLNT',C'KNELT'                                           
         DC    C'E',C'EFIKN',C'KNIFE'                                           
         DC    C'E',C'CKKNO',C'KNOCK'                                           
         DC    C'H',C'KLLNO',C'KNOLL'                                           
         DC    C'H',C'KNOTU',C'KNOUT'                                           
         DC    C'E',C'KNNOW',C'KNOWN'                                           
         DC    C'H',C'KLNRU',C'KNURL'                                           
         DC    C'E',C'AAKLO',C'KOALA'                                           
         DC    C'H',C'EIKNO',C'KOINE'                                           
         DC    C'H',C'EKKOP',C'KOPEK'                                           
         DC    C'H',C'KNORU',C'KORUN'                                           
         DC    C'H',C'AAKLR',C'KRAAL'                                           
         DC    C'H',C'AFKRT',C'KRAFT'                                           
         DC    C'H',C'AIKRT',C'KRAIT'                                           
         DC    C'H',C'IKLLR',C'KRILL'                                           
         DC    C'H',C'AKNOR',C'KRONA'                                           
         DC    C'H',C'EKNOR',C'KRONE'                                           
         DC    C'H',C'AKKLU',C'KULAK'                                           
         DC    C'H',C'AKSSV',C'KVASS'                                           
         DC    C'E',C'ABELL',C'LABEL'                                           
         DC    C'E',C'AABIL',C'LABIA'                                           
         DC    C'E',C'ABLOR',C'LABOR'                                           
         DC    C'H',C'AABLR',C'LABRA'                                           
         DC    C'E',C'ACDEL',C'LACED'                                           
         DC    C'H',C'ADDEL',C'LADED'                                           
         DC    C'H',C'ADELN',C'LADEN'                                           
         DC    C'E',C'ADELL',C'LADLE'                                           
         DC    C'H',C'AAGLN',C'LAGAN'                                           
         DC    C'H',C'AGHIL',C'LAIGH'                                           
         DC    C'H',C'ADILR',C'LAIRD'                                           
         DC    C'H',C'AILTY',C'LAITY'                                           
         DC    C'H',C'ADELM',C'LAMED'                                           
         DC    C'H',C'AAILM',C'LAMIA'                                           
         DC    C'E',C'ACELN',C'LANCE'                                           
         DC    C'E',C'AKLNY',C'LANKY'                                           
         DC    C'E',C'AELLP',C'LAPEL'                                           
         DC    C'H',C'AILNP',C'LAPIN'                                           
         DC    C'E',C'AELPS',C'LAPSE'                                           
         DC    C'E',C'ACHLR',C'LARCH'                                           
         DC    C'H',C'ADLRY',C'LARDY'                                           
         DC    C'H',C'AELRS',C'LARES'                                           
         DC    C'E',C'AEGLR',C'LARGE'                                           
         DC    C'H',C'AGLOR',C'LARGO'                                           
         DC    C'H',C'AKLRY',C'LARKY'                                           
         DC    C'H',C'AALRV',C'LARVA'                                           
         DC    C'H',C'ADELS',C'LASED'                                           
         DC    C'E',C'AELRS',C'LASER'                                           
         DC    C'E',C'ALOSS',C'LASSO'                                           
         DC    C'E',C'ACHLT',C'LATCH'                                           
         DC    C'H',C'ADELT',C'LATED'                                           
         DC    C'E',C'AELRT',C'LATER'                                           
         DC    C'E',C'AELTX',C'LATEX'                                           
         DC    C'E',C'AEHLT',C'LATHE'                                           
         DC    C'H',C'AHLTY',C'LATHY'                                           
         DC    C'E',C'AGHLU',C'LAUGH'                                           
         DC    C'H',C'ADELV',C'LAVED'                                           
         DC    C'H',C'AELRV',C'LAVER'                                           
         DC    C'H',C'ADELW',C'LAWED'                                           
         DC    C'E',C'ALLXY',C'LAXLY'                                           
         DC    C'E',C'AELRY',C'LAYER'                                           
         DC    C'H',C'AALRZ',C'LAZAR'                                           
         DC    C'H',C'ADELZ',C'LAZED'                                           
         DC    C'E',C'ACEHL',C'LEACH'                                           
         DC    C'H',C'ADELY',C'LEADY'                                           
         DC    C'E',C'AEFLY',C'LEAFY'                                           
         DC    C'E',C'AEKLY',C'LEAKY'                                           
         DC    C'H',C'AELNT',C'LEANT'                                           
         DC    C'E',C'AELPT',C'LEAPT'                                           
         DC    C'E',C'AELNR',C'LEARN'                                           
         DC    C'H',C'AELRY',C'LEARY'                                           
         DC    C'E',C'AEELS',C'LEASE'                                           
         DC    C'E',C'AEHLS',C'LEASH'                                           
         DC    C'E',C'AELST',C'LEAST'                                           
         DC    C'E',C'AEELV',C'LEAVE'                                           
         DC    C'H',C'AELVY',C'LEAVY'                                           
         DC    C'E',C'DEEGL',C'LEDGE'                                           
         DC    C'H',C'DEGLY',C'LEDGY'                                           
         DC    C'E',C'CEEHL',C'LEECH'                                           
         DC    C'H',C'EELRY',C'LEERY'                                           
         DC    C'E',C'AEGLL',C'LEGAL'                                           
         DC    C'E',C'EEGLR',C'LEGER'                                           
         DC    C'E',C'EGGLY',C'LEGGY'                                           
         DC    C'E',C'EGILT',C'LEGIT'                                           
         DC    C'H',C'AEHLU',C'LEHUA'                                           
         DC    C'H',C'AELMN',C'LEMAN'                                           
         DC    C'H',C'AELMM',C'LEMMA'                                           
         DC    C'E',C'ELMNO',C'LEMON'                                           
         DC    C'H',C'ELMRU',C'LEMUR'                                           
         DC    C'H',C'EILNS',C'LENIS'                                           
         DC    C'H',C'EELNO',C'LEONE'                                           
         DC    C'E',C'EELPR',C'LEPER'                                           
         DC    C'E',C'CEHLT',C'LETCH'                                           
         DC    C'E',C'EEELV',C'LEVEE'                                           
         DC    C'E',C'EELLV',C'LEVEL'                                           
         DC    C'E',C'EELRV',C'LEVER'                                           
         DC    C'H',C'EILNV',C'LEVIN'                                           
         DC    C'H',C'EILSW',C'LEWIS'                                           
         DC    C'H',C'AAILN',C'LIANA'                                           
         DC    C'H',C'AEILN',C'LIANE'                                           
         DC    C'E',C'BEILL',C'LIBEL'                                           
         DC    C'H',C'ABILR',C'LIBRA'                                           
         DC    C'H',C'CHILT',C'LICHT'                                           
         DC    C'H',C'CIILT',C'LICIT'                                           
         DC    C'H',C'ADILR',C'LIDAR'                                           
         DC    C'E',C'GHILT',C'LIGHT'                                           
         DC    C'E',C'DEIKL',C'LIKED'                                           
         DC    C'E',C'EIKLN',C'LIKEN'                                           
         DC    C'H',C'EIKLR',C'LIKER'                                           
         DC    C'E',C'ACILL',C'LILAC'                                           
         DC    C'E',C'BILMO',C'LIMBO'                                           
         DC    C'H',C'DEILM',C'LIMED'                                           
         DC    C'H',C'EILMN',C'LIMEN'                                           
         DC    C'H',C'EILMS',C'LIMES'                                           
         DC    C'E',C'IILMT',C'LIMIT'                                           
         DC    C'H',C'ACILN',C'LINAC'                                           
         DC    C'E',C'DEILN',C'LINED'                                           
         DC    C'E',C'EILNN',C'LINEN'                                           
         DC    C'E',C'EILNR',C'LINER'                                           
         DC    C'E',C'GILNO',C'LINGO'                                           
         DC    C'H',C'IILNN',C'LININ'                                           
         DC    C'H',C'ILNTY',C'LINTY'                                           
         DC    C'H',C'DIILP',C'LIPID'                                           
         DC    C'E',C'ILPPY',C'LIPPY'                                           
         DC    C'H',C'EILLS',C'LISLE'                                           
         DC    C'E',C'EILRT',C'LITER'                                           
         DC    C'E',C'EHILT',C'LITHE'                                           
         DC    C'E',C'HILOT',C'LITHO'                                           
         DC    C'E',C'EILRT',C'LITRE'                                           
         DC    C'E',C'DEILV',C'LIVED'                                           
         DC    C'E',C'EILNV',C'LIVEN'                                           
         DC    C'E',C'EILRV',C'LIVER'                                           
         DC    C'E',C'EILSV',C'LIVES'                                           
         DC    C'E',C'DIILV',C'LIVID'                                           
         DC    C'E',C'AALLM',C'LLAMA'                                           
         DC    C'H',C'ALLNO',C'LLANO'                                           
         DC    C'H',C'ACHLO',C'LOACH'                                           
         DC    C'H',C'ALMOY',C'LOAMY'                                           
         DC    C'E',C'AHLOT',C'LOATH'                                           
         DC    C'H',C'ABLOR',C'LOBAR'                                           
         DC    C'E',C'BBLOY',C'LOBBY'                                           
         DC    C'H',C'BDELO',C'LOBED'                                           
         DC    C'E',C'ACLLO',C'LOCAL'                                           
         DC    C'H',C'CLOSU',C'LOCUS'                                           
         DC    C'H',C'DELNO',C'LODEN'                                           
         DC    C'E',C'DEGLO',C'LODGE'                                           
         DC    C'H',C'ELOSS',C'LOESS'                                           
         DC    C'E',C'FLOTY',C'LOFTY'                                           
         DC    C'H',C'AGILO',C'LOGIA'                                           
         DC    C'E',C'CGILO',C'LOGIC'                                           
         DC    C'E',C'LLLOY',C'LOLLY'                                           
         DC    C'H',C'EGLNO',C'LONGE'                                           
         DC    C'H',C'BLOOY',C'LOOBY'                                           
         DC    C'H',C'DELOO',C'LOOED'                                           
         DC    C'H',C'ELOOY',C'LOOEY'                                           
         DC    C'H',C'EILOO',C'LOOIE'                                           
         DC    C'H',C'LOOPY',C'LOOPY'                                           
         DC    C'E',C'ELOOS',C'LOOSE'                                           
         DC    C'H',C'DELOP',C'LOPED'                                           
         DC    C'H',C'ALLOR',C'LORAL'                                           
         DC    C'H',C'ILORS',C'LORIS'                                           
         DC    C'H',C'ELLOS',C'LOSEL'                                           
         DC    C'E',C'ELORS',C'LOSER'                                           
         DC    C'H',C'AHLOT',C'LOTAH'                                           
         DC    C'H',C'CILOT',C'LOTIC'                                           
         DC    C'E',C'LOOTT',C'LOTTO'                                           
         DC    C'H',C'LOSTU',C'LOTUS'                                           
         DC    C'H',C'GHLOU',C'LOUGH'                                           
         DC    C'H',C'ILOSU',C'LOUIS'                                           
         DC    C'H',C'ELOPU',C'LOUPE'                                           
         DC    C'E',C'ELOSU',C'LOUSE'                                           
         DC    C'E',C'LOSUY',C'LOUSY'                                           
         DC    C'E',C'DELOV',C'LOVED'                                           
         DC    C'E',C'ELORV',C'LOVER'                                           
         DC    C'H',C'DELOW',C'LOWED'                                           
         DC    C'E',C'ELORW',C'LOWER'                                           
         DC    C'E',C'LLOWY',C'LOWLY'                                           
         DC    C'E',C'ALLOY',C'LOYAL'                                           
         DC    C'H',C'CELSU',C'LUCES'                                           
         DC    C'E',C'CDILU',C'LUCID'                                           
         DC    C'E',C'CKLUY',C'LUCKY'                                           
         DC    C'H',C'CELRU',C'LUCRE'                                           
         DC    C'H',C'AFFLU',C'LUFFA'                                           
         DC    C'H',C'ELMNU',C'LUMEN'                                           
         DC    C'E',C'LMPUY',C'LUMPY'                                           
         DC    C'E',C'ALNRU',C'LUNAR'                                           
         DC    C'E',C'CHLNU',C'LUNCH'                                           
         DC    C'H',C'ELNSU',C'LUNES'                                           
         DC    C'E',C'EGLNU',C'LUNGE'                                           
         DC    C'H',C'GILNU',C'LUNGI'                                           
         DC    C'H',C'LPSUU',C'LUPUS'                                           
         DC    C'E',C'CHLRU',C'LURCH'                                           
         DC    C'E',C'DELRU',C'LURED'                                           
         DC    C'E',C'ELRRU',C'LURER'                                           
         DC    C'E',C'DILRU',C'LURID'                                           
         DC    C'E',C'LSTUY',C'LUSTY'                                           
         DC    C'H',C'DELTU',C'LUTED'                                           
         DC    C'E',C'GILNY',C'LYING'                                           
         DC    C'E',C'HLMPY',C'LYMPH'                                           
         DC    C'E',C'CHLNY',C'LYNCH'                                           
         DC    C'E',C'CILRY',C'LYRIC'                                           
         DC    C'H',C'DELSY',C'LYSED'                                           
         DC    C'H',C'ILNSY',C'LYSIN'                                           
         DC    C'H',C'ILSSY',C'LYSIS'                                           
         DC    C'H',C'CILTY',C'LYTIC'                                           
         DC    C'H',C'ALTTY',C'LYTTA'                                           
         DC    X'FF'                                                            
**PAN#1  CSECT                                                                  
**PAN#1  DC    CL21'012GAWRD02   08/22/00'                                      
         END                                                                    
