*          DATA SET GAWRD01    AT LEVEL 011 AS OF 08/22/00                      
*PHASE TB1401A                                                                  
*                                                                               
*                                                                               
* THE WORD POWER DICTIONARY IS DISTRIBUTED AS FOLLOWS:                          
*                                                                               
*        PANVALET BOOK      WORDS      PHASE NAME                               
*           GAWRD01          A-D         TB1401                                 
*           GAWRD02          E-L         TB1402                                 
*           GAWRD03          M-R         TB1403                                 
*           GAWRD04          S-Z         TB1404                                 
*                                                                               
* DC STATEMENTS BELOW ARE OF THE FOLLOWING FORMAT:                              
*                                                                               
*        BYTE  +0(1):  C'E' IF EASY WORD, C'H' IF HARD WORD                     
*        BYTE  +1(5):  SORTED SPELLING OF THE WORD                              
*        BYTE  +6(5):  ACTUAL SPELLING OF THE WORD                              
*                                                                               
*                                                                               
GAWRD01  CSECT                                                                  
         DC    C'H',C'AAABC',C'ABACA'                                           
         DC    C'H',C'AABCI',C'ABACI'                                           
         DC    C'E',C'AABCK',C'ABACK'                                           
         DC    C'H',C'AABFT',C'ABAFT'                                           
         DC    C'E',C'AABES',C'ABASE'                                           
         DC    C'H',C'AABHS',C'ABASH'                                           
         DC    C'E',C'AABET',C'ABATE'                                           
         DC    C'E',C'ABBEY',C'ABBEY'                                           
         DC    C'E',C'ABBOT',C'ABBOT'                                           
         DC    C'H',C'AABEM',C'ABEAM'                                           
         DC    C'H',C'ABEEL',C'ABELE'                                           
         DC    C'E',C'ABHOR',C'ABHOR'                                           
         DC    C'E',C'ABDEI',C'ABIDE'                                           
         DC    C'E',C'ABELR',C'ABLER'                                           
         DC    C'E',C'ABDEO',C'ABODE'                                           
         DC    C'E',C'ABILO',C'ABOIL'                                           
         DC    C'E',C'ABORT',C'ABORT'                                           
         DC    C'E',C'ABOTU',C'ABOUT'                                           
         DC    C'E',C'ABEOV',C'ABOVE'                                           
         DC    C'E',C'ABESU',C'ABUSE'                                           
         DC    C'E',C'ABUZZ',C'ABUZZ'                                           
         DC    C'H',C'ABMSY',C'ABYSM'                                           
         DC    C'E',C'ABSSY',C'ABYSS'                                           
         DC    C'H',C'ABCER',C'ACERB'                                           
         DC    C'E',C'ACDEH',C'ACHED'                                           
         DC    C'E',C'ACGIN',C'ACING'                                           
         DC    C'H',C'ACCKO',C'ACOCK'                                           
         DC    C'E',C'ACNOR',C'ACORN'                                           
         DC    C'H',C'ACDIR',C'ACRID'                                           
         DC    C'E',C'ACDET',C'ACTED'                                           
         DC    C'H',C'ACINT',C'ACTIN'                                           
         DC    C'E',C'ACORT',C'ACTOR'                                           
         DC    C'E',C'ACETU',C'ACUTE'                                           
         DC    C'H',C'AADEG',C'ADAGE'                                           
         DC    C'E',C'AADPT',C'ADAPT'                                           
         DC    C'H',C'AADDX',C'ADDAX'                                           
         DC    C'E',C'ADDDE',C'ADDED'                                           
         DC    C'E',C'ADDER',C'ADDER'                                           
         DC    C'E',C'ADDEL',C'ADDLE'                                           
         DC    C'E',C'ADEPT',C'ADEPT'                                           
         DC    C'E',C'ADIMT',C'ADMIT'                                           
         DC    C'H',C'ADIMX',C'ADMIX'                                           
         DC    C'E',C'ADOPT',C'ADOPT'                                           
         DC    C'E',C'ADEOR',C'ADORE'                                           
         DC    C'E',C'ADNOR',C'ADORN'                                           
         DC    C'H',C'ADNOW',C'ADOWN'                                           
         DC    C'E',C'ADLTU',C'ADULT'                                           
         DC    C'H',C'ACDNU',C'ADUNC'                                           
         DC    C'E',C'ADSTU',C'ADUST'                                           
         DC    C'H',C'AACEI',C'AECIA'                                           
         DC    C'H',C'ADEES',C'AEDES'                                           
         DC    C'H',C'AEGIS',C'AEGIS'                                           
         DC    C'H',C'AEEIR',C'AERIE'                                           
         DC    C'E',C'AFFIX',C'AFFIX'                                           
         DC    C'E',C'AEFIR',C'AFIRE'                                           
         DC    C'E',C'AFOOT',C'AFOOT'                                           
         DC    C'H',C'AEFOR',C'AFORE'                                           
         DC    C'H',C'AFLOU',C'AFOUL'                                           
         DC    C'H',C'AFIRT',C'AFRIT'                                           
         DC    C'E',C'AEFRT',C'AFTER'                                           
         DC    C'E',C'AAGIN',C'AGAIN'                                           
         DC    C'H',C'AAAGM',C'AGAMA'                                           
         DC    C'E',C'AAEGP',C'AGAPE'                                           
         DC    C'H',C'AAEGT',C'AGATE'                                           
         DC    C'H',C'AAEGV',C'AGAVE'                                           
         DC    C'E',C'AAEGZ',C'AGAZE'                                           
         DC    C'E',C'AEGNT',C'AGENT'                                           
         DC    C'E',C'AEGIL',C'AGILE'                                           
         DC    C'E',C'AGGIN',C'AGING'                                           
         DC    C'H',C'AEGLT',C'AGLET'                                           
         DC    C'H',C'AEGLY',C'AGLEY'                                           
         DC    C'E',C'AGLOW',C'AGLOW'                                           
         DC    C'H',C'AEGNO',C'AGONE'                                           
         DC    C'E',C'AGNOY',C'AGONY'                                           
         DC    C'H',C'AAGOR',C'AGORA'                                           
         DC    C'E',C'AEEGR',C'AGREE'                                           
         DC    C'E',C'AADEH',C'AHEAD'                                           
         DC    C'E',C'ADDEI',C'AIDED'                                           
         DC    C'E',C'ADEIR',C'AIDER'                                           
         DC    C'E',C'ADEIL',C'AILED'                                           
         DC    C'E',C'ADEIM',C'AIMED'                                           
         DC    C'E',C'AEIMR',C'AIMER'                                           
         DC    C'E',C'ADEIR',C'AIRED'                                           
         DC    C'E',C'AEIRR',C'AIRER'                                           
         DC    C'E',C'AEILS',C'AISLE'                                           
         DC    C'H',C'ACHIT',C'AITCH'                                           
         DC    C'H',C'AACKL',C'ALACK'                                           
         DC    C'E',C'AALMO',C'ALAMO'                                           
         DC    C'E',C'AALMR',C'ALARM'                                           
         DC    C'H',C'AALRY',C'ALARY'                                           
         DC    C'H',C'AAELT',C'ALATE'                                           
         DC    C'E',C'ABLMU',C'ALBUM'                                           
         DC    C'H',C'ADELR',C'ALDER'                                           
         DC    C'H',C'ADLLO',C'ALDOL'                                           
         DC    C'H',C'AEHLP',C'ALEPH'                                           
         DC    C'E',C'AELRT',C'ALERT'                                           
         DC    C'H',C'AAGLL',C'ALGAL'                                           
         DC    C'H',C'ADGIL',C'ALGID'                                           
         DC    C'H',C'AGILN',C'ALGIN'                                           
         DC    C'H',C'AGLMU',C'ALGUM'                                           
         DC    C'E',C'AAILS',C'ALIAS'                                           
         DC    C'E',C'ABIIL',C'ALIBI'                                           
         DC    C'E',C'AEILN',C'ALIEN'                                           
         DC    C'H',C'AGILN',C'ALIGN'                                           
         DC    C'E',C'AEIKL',C'ALIKE'                                           
         DC    C'H',C'AEILN',C'ALINE'                                           
         DC    C'E',C'AEILV',C'ALIVE'                                           
         DC    C'H',C'ADKLY',C'ALKYD'                                           
         DC    C'H',C'AKLLY',C'ALKYL'                                           
         DC    C'E',C'AALLY',C'ALLAY'                                           
         DC    C'E',C'AELLY',C'ALLEY'                                           
         DC    C'H',C'ADLLO',C'ALLOD'                                           
         DC    C'E',C'ALLOT',C'ALLOT'                                           
         DC    C'E',C'ALLOW',C'ALLOW'                                           
         DC    C'E',C'ALLOY',C'ALLOY'                                           
         DC    C'H',C'ALLLY',C'ALLYL'                                           
         DC    C'H',C'ADLMU',C'ALMUD'                                           
         DC    C'H',C'AGLMU',C'ALMUG'                                           
         DC    C'E',C'AFLOT',C'ALOFT'                                           
         DC    C'E',C'AAHLO',C'ALOHA'                                           
         DC    C'H',C'AILNO',C'ALOIN'                                           
         DC    C'E',C'AELNO',C'ALONE'                                           
         DC    C'E',C'AGLNO',C'ALONG'                                           
         DC    C'E',C'AFLOO',C'ALOOF'                                           
         DC    C'E',C'ADLOU',C'ALOUD'                                           
         DC    C'H',C'AAHLP',C'ALPHA'                                           
         DC    C'E',C'AALRT',C'ALTAR'                                           
         DC    C'E',C'AELRT',C'ALTER'                                           
         DC    C'H',C'AHLOT',C'ALTHO'                                           
         DC    C'H',C'AALLU',C'ALULA'                                           
         DC    C'H',C'AALWY',C'ALWAY'                                           
         DC    C'H',C'AAIMN',C'AMAIN'                                           
         DC    C'E',C'AAMSS',C'AMASS'                                           
         DC    C'E',C'AAEMZ',C'AMAZE'                                           
         DC    C'E',C'ABEMR',C'AMBER'                                           
         DC    C'H',C'ABIMT',C'AMBIT'                                           
         DC    C'E',C'ABELM',C'AMBLE'                                           
         DC    C'H',C'ABMRY',C'AMBRY'                                           
         DC    C'H',C'AABEM',C'AMEBA'                                           
         DC    C'H',C'AEEMR',C'AMEER'                                           
         DC    C'E',C'ADEMN',C'AMEND'                                           
         DC    C'H',C'AEMNT',C'AMENT'                                           
         DC    C'H',C'ACEIM',C'AMICE'                                           
         DC    C'H',C'ADEIM',C'AMIDE'                                           
         DC    C'H',C'ADIMO',C'AMIDO'                                           
         DC    C'H',C'AEIMN',C'AMINE'                                           
         DC    C'E',C'AIMNO',C'AMINO'                                           
         DC    C'E',C'AIMSS',C'AMISS'                                           
         DC    C'E',C'AIMTY',C'AMITY'                                           
         DC    C'H',C'AELMO',C'AMOLE'                                           
         DC    C'E',C'AGMNO',C'AMONG'                                           
         DC    C'H',C'AMORT',C'AMORT'                                           
         DC    C'H',C'AMORU',C'AMOUR'                                           
         DC    C'E',C'AELMP',C'AMPLE'                                           
         DC    C'E',C'ALMPY',C'AMPLY'                                           
         DC    C'H',C'ALMPU',C'AMPUL'                                           
         DC    C'E',C'ACKMU',C'AMUCK'                                           
         DC    C'E',C'AEMSU',C'AMUSE'                                           
         DC    C'H',C'ACNNO',C'ANCON'                                           
         DC    C'H',C'AAENR',C'ANEAR'                                           
         DC    C'H',C'AEELN',C'ANELE'                                           
         DC    C'H',C'AENNT',C'ANENT'                                           
         DC    C'E',C'AEGLN',C'ANGEL'                                           
         DC    C'E',C'AEGNR',C'ANGER'                                           
         DC    C'E',C'AEGLN',C'ANGLE'                                           
         DC    C'E',C'AGNRY',C'ANGRY'                                           
         DC    C'H',C'AGNST',C'ANGST'                                           
         DC    C'H',C'AEILN',C'ANILE'                                           
         DC    C'H',C'AAIMN',C'ANIMA'                                           
         DC    C'H',C'AEIMN',C'ANIME'                                           
         DC    C'H',C'AINNO',C'ANION'                                           
         DC    C'H',C'AEINS',C'ANISE'                                           
         DC    C'E',C'AEKLN',C'ANKLE'                                           
         DC    C'H',C'AKNSU',C'ANKUS'                                           
         DC    C'E',C'AALNN',C'ANNAL'                                           
         DC    C'E',C'AENNX',C'ANNEX'                                           
         DC    C'E',C'ANNOY',C'ANNOY'                                           
         DC    C'E',C'ALNNU',C'ANNUL'                                           
         DC    C'H',C'ADENO',C'ANODE'                                           
         DC    C'H',C'AMNOY',C'ANOMY'                                           
         DC    C'H',C'AAENT',C'ANTAE'                                           
         DC    C'E',C'ACINT',C'ANTIC'                                           
         DC    C'H',C'AENRT',C'ANTRE'                                           
         DC    C'E',C'AILNV',C'ANVIL'                                           
         DC    C'E',C'AAORT',C'AORTA'                                           
         DC    C'H',C'AACEP',C'APACE'                                           
         DC    C'E',C'AAPRT',C'APART'                                           
         DC    C'H',C'AAEKP',C'APEAK'                                           
         DC    C'H',C'AEPRY',C'APERY'                                           
         DC    C'E',C'ADHIP',C'APHID'                                           
         DC    C'H',C'AHIPS',C'APHIS'                                           
         DC    C'H',C'AAINP',C'APIAN'                                           
         DC    C'H',C'AGINP',C'APING'                                           
         DC    C'H',C'AHIPS',C'APISH'                                           
         DC    C'H',C'AAENP',C'APNEA'                                           
         DC    C'H',C'AOPRT',C'APORT'                                           
         DC    C'E',C'AALPP',C'APPAL'                                           
         DC    C'E',C'AELPP',C'APPLE'                                           
         DC    C'E',C'ALPPY',C'APPLY'                                           
         DC    C'E',C'ANOPR',C'APRON'                                           
         DC    C'H',C'AIPSS',C'APSIS'                                           
         DC    C'E',C'AEPRT',C'APTER'                                           
         DC    C'E',C'ALPTY',C'APTLY'                                           
         DC    C'H',C'AAEQU',C'AQUAE'                                           
         DC    C'E',C'ABORR',C'ARBOR'                                           
         DC    C'H',C'ACDER',C'ARCED'                                           
         DC    C'H',C'ABDER',C'ARDEB'                                           
         DC    C'E',C'ADORR',C'ARDOR'                                           
         DC    C'H',C'AAELR',C'AREAL'                                           
         DC    C'H',C'AACER',C'ARECA'                                           
         DC    C'E',C'AAENR',C'ARENA'                                           
         DC    C'H',C'AEERT',C'ARETE'                                           
         DC    C'H',C'AAGLR',C'ARGAL'                                           
         DC    C'H',C'AGLOR',C'ARGOL'                                           
         DC    C'E',C'AGNOR',C'ARGON'                                           
         DC    C'H',C'AGORT',C'ARGOT'                                           
         DC    C'E',C'AEGRU',C'ARGUE'                                           
         DC    C'H',C'AEILR',C'ARIEL'                                           
         DC    C'E',C'AEIRS',C'ARISE'                                           
         DC    C'H',C'AELRS',C'ARLES'                                           
         DC    C'E',C'ADEMR',C'ARMED'                                           
         DC    C'E',C'AEMRR',C'ARMER'                                           
         DC    C'H',C'AEMRT',C'ARMET'                                           
         DC    C'E',C'AMORR',C'ARMOR'                                           
         DC    C'H',C'ADIOR',C'AROID'                                           
         DC    C'E',C'AAMOR',C'AROMA'                                           
         DC    C'E',C'AEORS',C'AROSE'                                           
         DC    C'H',C'AARRS',C'ARRAS'                                           
         DC    C'E',C'AARRY',C'ARRAY'                                           
         DC    C'H',C'AIRRS',C'ARRIS'                                           
         DC    C'E',C'AORRW',C'ARROW'                                           
         DC    C'H',C'AIRSS',C'ARSIS'                                           
         DC    C'E',C'ANORS',C'ARSON'                                           
         DC    C'H',C'AALRT',C'ARTAL'                                           
         DC    C'H',C'AELRT',C'ARTEL'                                           
         DC    C'E',C'ACOST',C'ASCOT'                                           
         DC    C'H',C'ACSSU',C'ASCUS'                                           
         DC    C'H',C'ACDIS',C'ASDIC'                                           
         DC    C'E',C'AEHNS',C'ASHEN'                                           
         DC    C'E',C'ADEIS',C'ASIDE'                                           
         DC    C'E',C'ADEKS',C'ASKED'                                           
         DC    C'E',C'AEKRS',C'ASKER'                                           
         DC    C'E',C'AEKSW',C'ASKEW'                                           
         DC    C'H',C'AENPS',C'ASPEN'                                           
         DC    C'H',C'AEPRS',C'ASPER'                                           
         DC    C'H',C'ACIPS',C'ASPIC'                                           
         DC    C'H',C'AASSY',C'ASSAY'                                           
         DC    C'E',C'AESSS',C'ASSES'                                           
         DC    C'E',C'AESST',C'ASSET'                                           
         DC    C'H',C'AERST',C'ASTER'                                           
         DC    C'H',C'AIRST',C'ASTIR'                                           
         DC    C'H',C'AILTT',C'ATILT'                                           
         DC    C'E',C'AALST',C'ATLAS'                                           
         DC    C'H',C'AAMNT',C'ATMAN'                                           
         DC    C'E',C'ALLOT',C'ATOLL'                                           
         DC    C'H',C'AMOTY',C'ATOMY'                                           
         DC    C'E',C'AENOT',C'ATONE'                                           
         DC    C'H',C'ANOTY',C'ATONY'                                           
         DC    C'H',C'AAIRT',C'ATRIA'                                           
         DC    C'H',C'AIPRT',C'ATRIP'                                           
         DC    C'H',C'AARTT',C'ATTAR'                                           
         DC    C'E',C'ACITT',C'ATTIC'                                           
         DC    C'E',C'ADIOU',C'AUDIO'                                           
         DC    C'E',C'ADITU',C'AUDIT'                                           
         DC    C'H',C'AEGRU',C'AUGER'                                           
         DC    C'H',C'AGHTU',C'AUGHT'                                           
         DC    C'H',C'AGRUU',C'AUGUR'                                           
         DC    C'H',C'ACILU',C'AULIC'                                           
         DC    C'H',C'ANTUY',C'AUNTY'                                           
         DC    C'H',C'AAERU',C'AURAE'                                           
         DC    C'E',C'AALRU',C'AURAL'                                           
         DC    C'H',C'AARRU',C'AURAR'                                           
         DC    C'H',C'ACIRU',C'AURIC'                                           
         DC    C'H',C'AMRUU',C'AURUM'                                           
         DC    C'H',C'AINUX',C'AUXIN'                                           
         DC    C'E',C'AAILV',C'AVAIL'                                           
         DC    C'E',C'AASTV',C'AVAST'                                           
         DC    C'H',C'AENSV',C'AVENS'                                           
         DC    C'E',C'AERTV',C'AVERT'                                           
         DC    C'H',C'AAINV',C'AVIAN'                                           
         DC    C'H',C'ADIOV',C'AVOID'                                           
         DC    C'E',C'AAITW',C'AWAIT'                                           
         DC    C'E',C'AAEKW',C'AWAKE'                                           
         DC    C'E',C'AADRW',C'AWARD'                                           
         DC    C'E',C'AAERW',C'AWARE'                                           
         DC    C'H',C'AAHSW',C'AWASH'                                           
         DC    C'E',C'AFLUW',C'AWFUL'                                           
         DC    C'H',C'AGINW',C'AWING'                                           
         DC    C'E',C'ADENW',C'AWNED'                                           
         DC    C'E',C'AEKOW',C'AWOKE'                                           
         DC    C'H',C'AAILX',C'AXIAL'                                           
         DC    C'H',C'AEILX',C'AXILE'                                           
         DC    C'E',C'AGINX',C'AXING'                                           
         DC    C'E',C'AIMOX',C'AXIOM'                                           
         DC    C'E',C'ADELX',C'AXLED'                                           
         DC    C'H',C'ADEIZ',C'AZIDE'                                           
         DC    C'H',C'AEINZ',C'AZINE'                                           
         DC    C'H',C'ACIOZ',C'AZOIC'                                           
         DC    C'H',C'AELOZ',C'AZOLE'                                           
         DC    C'H',C'AEOTZ',C'AZOTE'                                           
         DC    C'H',C'AHOTZ',C'AZOTH'                                           
         DC    C'H',C'AERUZ',C'AZURE'                                           
         DC    C'H',C'AABDE',C'BAAED'                                           
         DC    C'H',C'AABBK',C'BABKA'                                           
         DC    C'H',C'ABBOO',C'BABOO'                                           
         DC    C'H',C'ABBLU',C'BABUL'                                           
         DC    C'E',C'ABCNO',C'BACON'                                           
         DC    C'E',C'ABDEG',C'BADGE'                                           
         DC    C'E',C'ABDLY',C'BADLY'                                           
         DC    C'E',C'ABEGL',C'BAGEL'                                           
         DC    C'E',C'ABGGY',C'BAGGY'                                           
         DC    C'H',C'ABINR',C'BAIRN'                                           
         DC    C'H',C'AABIS',C'BAISA'                                           
         DC    C'H',C'ABEIZ',C'BAIZE'                                           
         DC    C'E',C'ABDEK',C'BAKED'                                           
         DC    C'E',C'ABEKR',C'BAKER'                                           
         DC    C'H',C'AABLS',C'BALAS'                                           
         DC    C'E',C'ABDEL',C'BALED'                                           
         DC    C'E',C'ABELR',C'BALER'                                           
         DC    C'H',C'ABKLY',C'BALKY'                                           
         DC    C'E',C'ABLMY',C'BALMY'                                           
         DC    C'E',C'AABLS',C'BALSA'                                           
         DC    C'E',C'AABLN',C'BANAL'                                           
         DC    C'H',C'ABDNY',C'BANDY'                                           
         DC    C'E',C'ABJNO',C'BANJO'                                           
         DC    C'H',C'ABNNS',C'BANNS'                                           
         DC    C'E',C'ABDER',C'BARED'                                           
         DC    C'E',C'ABERR',C'BARER'                                           
         DC    C'E',C'ABEGR',C'BARGE'                                           
         DC    C'H',C'ABCIR',C'BARIC'                                           
         DC    C'H',C'ABMRY',C'BARMY'                                           
         DC    C'E',C'ABNOR',C'BARON'                                           
         DC    C'H',C'AABLS',C'BASAL'                                           
         DC    C'E',C'ABDES',C'BASED'                                           
         DC    C'E',C'ABERS',C'BASER'                                           
         DC    C'H',C'ABESS',C'BASES'                                           
         DC    C'H',C'ABCIS',C'BASIC'                                           
         DC    C'H',C'ABILS',C'BASIL'                                           
         DC    C'E',C'ABINS',C'BASIN'                                           
         DC    C'E',C'ABISS',C'BASIS'                                           
         DC    C'E',C'ABEST',C'BASTE'                                           
         DC    C'E',C'ABCHT',C'BATCH'                                           
         DC    C'E',C'ABDET',C'BATED'                                           
         DC    C'E',C'ABEHT',C'BATHE'                                           
         DC    C'H',C'ABIKT',C'BATIK'                                           
         DC    C'E',C'ABNOT',C'BATON'                                           
         DC    C'E',C'ABTTY',C'BATTY'                                           
         DC    C'H',C'ABKLU',C'BAULK'                                           
         DC    C'E',C'ABDWY',C'BAWDY'                                           
         DC    C'H',C'ABDEY',C'BAYED'                                           
         DC    C'E',C'ABCEH',C'BEACH'                                           
         DC    C'E',C'ABDEY',C'BEADY'                                           
         DC    C'H',C'ABEMY',C'BEAMY'                                           
         DC    C'E',C'ABDER',C'BEARD'                                           
         DC    C'E',C'ABEST',C'BEAST'                                           
         DC    C'H',C'ABEUX',C'BEAUX'                                           
         DC    C'H',C'BDEEW',C'BEDEW'                                           
         DC    C'H',C'BDEIM',C'BEDIM'                                           
         DC    C'E',C'BCEEH',C'BEECH'                                           
         DC    C'E',C'BEEFY',C'BEEFY'                                           
         DC    C'E',C'BEERY',C'BEERY'                                           
         DC    C'E',C'BEFIT',C'BEFIT'                                           
         DC    C'H',C'BEFGO',C'BEFOG'                                           
         DC    C'E',C'ABEGN',C'BEGAN'                                           
         DC    C'E',C'ABEGT',C'BEGAT'                                           
         DC    C'E',C'BEEGT',C'BEGET'                                           
         DC    C'E',C'BEGIN',C'BEGIN'                                           
         DC    C'E',C'BEGOT',C'BEGOT'                                           
         DC    C'H',C'BEGMU',C'BEGUM'                                           
         DC    C'E',C'BEGNU',C'BEGUN'                                           
         DC    C'E',C'BEEGI',C'BEIGE'                                           
         DC    C'E',C'BEGIN',C'BEING'                                           
         DC    C'H',C'ABELY',C'BELAY'                                           
         DC    C'H',C'ABEGL',C'BELGA'                                           
         DC    C'E',C'BEEIL',C'BELIE'                                           
         DC    C'E',C'BEELL',C'BELLE'                                           
         DC    C'E',C'BELLY',C'BELLY'                                           
         DC    C'E',C'BELOW',C'BELOW'                                           
         DC    C'E',C'BCEHN',C'BENCH'                                           
         DC    C'E',C'BEERT',C'BERET'                                           
         DC    C'H',C'BEEMR',C'BERME'                                           
         DC    C'E',C'BERRY',C'BERRY'                                           
         DC    C'E',C'BEHRT',C'BERTH'                                           
         DC    C'H',C'BELRY',C'BERYL'                                           
         DC    C'E',C'BEEST',C'BESET'                                           
         DC    C'H',C'BEMOS',C'BESOM'                                           
         DC    C'H',C'BEOST',C'BESOT'                                           
         DC    C'H',C'BEELT',C'BETEL'                                           
         DC    C'E',C'ABETT',C'BETTA'                                           
         DC    C'H',C'BEELV',C'BEVEL'                                           
         DC    C'H',C'BEELZ',C'BEZEL'                                           
         DC    C'H',C'ABGHN',C'BHANG'                                           
         DC    C'E',C'ABILY',C'BIALY'                                           
         DC    C'E',C'BBEIL',C'BIBLE'                                           
         DC    C'H',C'BDDIY',C'BIDDY'                                           
         DC    C'E',C'BDDEI',C'BIDED'                                           
         DC    C'E',C'BDEIR',C'BIDER'                                           
         DC    C'H',C'BDEIT',C'BIDET'                                           
         DC    C'H',C'BDEIL',C'BIELD'                                           
         DC    C'H',C'BDFII',C'BIFID'                                           
         DC    C'H',C'BGHIT',C'BIGHT'                                           
         DC    C'E',C'BGIOT',C'BIGOT'                                           
         DC    C'E',C'BIJOU',C'BIJOU'                                           
         DC    C'E',C'BDEIK',C'BIKED'                                           
         DC    C'E',C'BEIKR',C'BIKER'                                           
         DC    C'H',C'BBILO',C'BILBO'                                           
         DC    C'H',C'BEGIL',C'BILGE'                                           
         DC    C'H',C'BGILY',C'BILGY'                                           
         DC    C'E',C'BILLY',C'BILLY'                                           
         DC    C'H',C'ABILN',C'BINAL'                                           
         DC    C'E',C'BEGIN',C'BINGE'                                           
         DC    C'H',C'BEIMO',C'BIOME'                                           
         DC    C'H',C'BDEIP',C'BIPED'                                           
         DC    C'H',C'BDIOP',C'BIPOD'                                           
         DC    C'E',C'BCHIR',C'BIRCH'                                           
         DC    C'H',C'BEILR',C'BIRLE'                                           
         DC    C'E',C'BHIRT',C'BIRTH'                                           
         DC    C'E',C'BINOS',C'BISON'                                           
         DC    C'E',C'BCHIT',C'BITCH'                                           
         DC    C'E',C'BEIRT',C'BITER'                                           
         DC    C'E',C'BITTY',C'BITTY'                                           
         DC    C'E',C'ABCKL',C'BLACK'                                           
         DC    C'E',C'ABDEL',C'BLADE'                                           
         DC    C'H',C'ABILN',C'BLAIN'                                           
         DC    C'E',C'ABELM',C'BLAME'                                           
         DC    C'E',C'ABDLN',C'BLAND'                                           
         DC    C'E',C'ABKLN',C'BLANK'                                           
         DC    C'H',C'ABELR',C'BLARE'                                           
         DC    C'H',C'ABELS',C'BLASE'                                           
         DC    C'E',C'ABLST',C'BLAST'                                           
         DC    C'E',C'ABELZ',C'BLAZE'                                           
         DC    C'E',C'ABEKL',C'BLEAK'                                           
         DC    C'H',C'ABELR',C'BLEAR'                                           
         DC    C'E',C'ABELT',C'BLEAT'                                           
         DC    C'E',C'BDEEL',C'BLEED'                                           
         DC    C'E',C'BDELN',C'BLEND'                                           
         DC    C'H',C'BELNT',C'BLENT'                                           
         DC    C'E',C'BELSS',C'BLESS'                                           
         DC    C'H',C'BELST',C'BLEST'                                           
         DC    C'E',C'BILMP',C'BLIMP'                                           
         DC    C'E',C'BDILN',C'BLIND'                                           
         DC    C'H',C'BIILN',C'BLINI'                                           
         DC    C'E',C'BIKLN',C'BLINK'                                           
         DC    C'E',C'BILSS',C'BLISS'                                           
         DC    C'E',C'BILTZ',C'BLITZ'                                           
         DC    C'E',C'ABLOT',C'BLOAT'                                           
         DC    C'E',C'BCKLO',C'BLOCK'                                           
         DC    C'E',C'BDLNO',C'BLOND'                                           
         DC    C'E',C'BDLOO',C'BLOOD'                                           
         DC    C'E',C'BLMOO',C'BLOOM'                                           
         DC    C'E',C'BLNOW',C'BLOWN'                                           
         DC    C'H',C'BLOWY',C'BLOWY'                                           
         DC    C'H',C'BDELU',C'BLUED'                                           
         DC    C'E',C'BELRU',C'BLUER'                                           
         DC    C'H',C'BELTU',C'BLUET'                                           
         DC    C'E',C'BFFLU',C'BLUFF'                                           
         DC    C'E',C'BLNTU',C'BLUNT'                                           
         DC    C'E',C'BLRTU',C'BLURT'                                           
         DC    C'E',C'BHLSU',C'BLUSH'                                           
         DC    C'E',C'ABDOR',C'BOARD'                                           
         DC    C'E',C'ABOST',C'BOAST'                                           
         DC    C'E',C'BBBOY',C'BOBBY'                                           
         DC    C'H',C'BCCEO',C'BOCCE'                                           
         DC    C'H',C'BCCIO',C'BOCCI'                                           
         DC    C'H',C'BDDEO',C'BODED'                                           
         DC    C'H',C'BEGOY',C'BOGEY'                                           
         DC    C'H',C'BEGIO',C'BOGIE'                                           
         DC    C'H',C'BEGLO',C'BOGLE'                                           
         DC    C'H',C'ABLOS',C'BOLAS'                                           
         DC    C'H',C'BLOSU',C'BOLUS'                                           
         DC    C'E',C'BDENO',C'BONED'                                           
         DC    C'E',C'BGNOO',C'BONGO'                                           
         DC    C'E',C'BNNOY',C'BONNY'                                           
         DC    C'E',C'BNOSU',C'BONUS'                                           
         DC    C'H',C'BENOZ',C'BONZE'                                           
         DC    C'E',C'BBOOY',C'BOOBY'                                           
         DC    C'E',C'BDEOO',C'BOOED'                                           
         DC    C'E',C'BOOST',C'BOOST'                                           
         DC    C'E',C'BHOOT',C'BOOTH'                                           
         DC    C'E',C'BOOTY',C'BOOTY'                                           
         DC    C'E',C'BEOOZ',C'BOOZE'                                           
         DC    C'E',C'BOOYZ',C'BOOZY'                                           
         DC    C'E',C'ABORX',C'BORAX'                                           
         DC    C'E',C'BDEOR',C'BORED'                                           
         DC    C'E',C'BEORR',C'BORER'                                           
         DC    C'H',C'BCIOR',C'BORIC'                                           
         DC    C'H',C'BENOR',C'BORNE'                                           
         DC    C'H',C'BNOOR',C'BORON'                                           
         DC    C'H',C'BORTZ',C'BORTZ'                                           
         DC    C'H',C'BKOSY',C'BOSKY'                                           
         DC    C'E',C'BMOOS',C'BOSOM'                                           
         DC    C'H',C'BNOOS',C'BOSON'                                           
         DC    C'E',C'BOSSY',C'BOSSY'                                           
         DC    C'H',C'BNOSU',C'BOSUN'                                           
         DC    C'E',C'BCHOT',C'BOTCH'                                           
         DC    C'E',C'BGHOU',C'BOUGH'                                           
         DC    C'H',C'BELOU',C'BOULE'                                           
         DC    C'E',C'BDNOU',C'BOUND'                                           
         DC    C'H',C'BGORU',C'BOURG'                                           
         DC    C'H',C'BNORU',C'BOURN'                                           
         DC    C'H',C'BEOSU',C'BOUSE'                                           
         DC    C'H',C'BDIOV',C'BOVID'                                           
         DC    C'E',C'BDEOW',C'BOWED'                                           
         DC    C'E',C'BELOW',C'BOWEL'                                           
         DC    C'H',C'BEORW',C'BOWER'                                           
         DC    C'H',C'BEOSW',C'BOWSE'                                           
         DC    C'E',C'BDEOX',C'BOXED'                                           
         DC    C'E',C'BEORX',C'BOXER'                                           
         DC    C'H',C'ABORY',C'BOYAR'                                           
         DC    C'E',C'ABCER',C'BRACE'                                           
         DC    C'H',C'ABCHR',C'BRACH'                                           
         DC    C'H',C'ABCRT',C'BRACT'                                           
         DC    C'E',C'ABDIR',C'BRAID'                                           
         DC    C'H',C'ABILR',C'BRAIL'                                           
         DC    C'E',C'ABINR',C'BRAIN'                                           
         DC    C'E',C'ABDNR',C'BRAND'                                           
         DC    C'H',C'ABNRT',C'BRANT'                                           
         DC    C'E',C'ABHRS',C'BRASH'                                           
         DC    C'E',C'ABRSS',C'BRASS'                                           
         DC    C'E',C'AABRV',C'BRAVA'                                           
         DC    C'E',C'ABERV',C'BRAVE'                                           
         DC    C'E',C'ABORV',C'BRAVO'                                           
         DC    C'E',C'ABLRW',C'BRAWL'                                           
         DC    C'E',C'ABNRW',C'BRAWN'                                           
         DC    C'H',C'ABRXY',C'BRAXY'                                           
         DC    C'H',C'ABERZ',C'BRAZE'                                           
         DC    C'E',C'ABDER',C'BREAD'                                           
         DC    C'E',C'ABEKR',C'BREAK'                                           
         DC    C'H',C'ABEMR',C'BREAM'                                           
         DC    C'H',C'BDEER',C'BREDE'                                           
         DC    C'E',C'BDEER',C'BREED'                                           
         DC    C'H',C'BENRT',C'BRENT'                                           
         DC    C'H',C'BEERV',C'BREVE'                                           
         DC    C'H',C'ABIRR',C'BRIAR'                                           
         DC    C'E',C'BBEIR',C'BRIBE'                                           
         DC    C'E',C'BCIKR',C'BRICK'                                           
         DC    C'E',C'BDEIR',C'BRIDE'                                           
         DC    C'E',C'BEFIR',C'BRIEF'                                           
         DC    C'H',C'BEIRR',C'BRIER'                                           
         DC    C'E',C'BILLR',C'BRILL'                                           
         DC    C'E',C'BEINR',C'BRINE'                                           
         DC    C'E',C'BGINR',C'BRING'                                           
         DC    C'E',C'BIKNR',C'BRINK'                                           
         DC    C'E',C'BINRY',C'BRINY'                                           
         DC    C'E',C'BIKRS',C'BRISK'                                           
         DC    C'E',C'ABDOR',C'BROAD'                                           
         DC    C'H',C'BCKOR',C'BROCK'                                           
         DC    C'E',C'BILOR',C'BROIL'                                           
         DC    C'E',C'BEKOR',C'BROKE'                                           
         DC    C'H',C'BEMOR',C'BROME'                                           
         DC    C'E',C'BDOOR',C'BROOD'                                           
         DC    C'E',C'BKOOR',C'BROOK'                                           
         DC    C'E',C'BMOOR',C'BROOM'                                           
         DC    C'H',C'BEORS',C'BROSE'                                           
         DC    C'E',C'BHORT',C'BROTH'                                           
         DC    C'E',C'BNORW',C'BROWN'                                           
         DC    C'H',C'BIRTU',C'BRUIT'                                           
         DC    C'H',C'BEMRU',C'BRUME'                                           
         DC    C'E',C'BNRTU',C'BRUNT'                                           
         DC    C'E',C'BHRSU',C'BRUSH'                                           
         DC    C'E',C'BKRSU',C'BRUSK'                                           
         DC    C'E',C'BERTU',C'BRUTE'                                           
         DC    C'H',C'ABBLU',C'BUBAL'                                           
         DC    C'E',C'BCKOU',C'BUCKO'                                           
         DC    C'E',C'BDDUY',C'BUDDY'                                           
         DC    C'E',C'BDEGU',C'BUDGE'                                           
         DC    C'E',C'BGGUY',C'BUGGY'                                           
         DC    C'E',C'BEGLU',C'BUGLE'                                           
         DC    C'E',C'BDILU',C'BUILD'                                           
         DC    C'E',C'BILTU',C'BUILT'                                           
         DC    C'E',C'BEGLU',C'BULGE'                                           
         DC    C'E',C'BKLUY',C'BULKY'                                           
         DC    C'H',C'ABLLU',C'BULLA'                                           
         DC    C'E',C'BLLUY',C'BULLY'                                           
         DC    C'E',C'BMPUY',C'BUMPY'                                           
         DC    C'E',C'BCHNU',C'BUNCH'                                           
         DC    C'E',C'BNNUY',C'BUNNY'                                           
         DC    C'H',C'ABNRU',C'BURAN'                                           
         DC    C'H',C'BERTU',C'BURET'                                           
         DC    C'H',C'BGHRU',C'BURGH'                                           
         DC    C'H',C'BINRU',C'BURIN'                                           
         DC    C'H',C'BEKRU',C'BURKE'                                           
         DC    C'E',C'BLRUY',C'BURLY'                                           
         DC    C'E',C'BNRTU',C'BURNT'                                           
         DC    C'E',C'BORRU',C'BURRO'                                           
         DC    C'H',C'BRRUY',C'BURRY'                                           
         DC    C'H',C'ABRSU',C'BURSA'                                           
         DC    C'H',C'BERSU',C'BURSE'                                           
         DC    C'E',C'BRSTU',C'BURST'                                           
         DC    C'H',C'BBSUY',C'BUSBY'                                           
         DC    C'H',C'BDESU',C'BUSED'                                           
         DC    C'E',C'BHSUY',C'BUSHY'                                           
         DC    C'E',C'BSTUY',C'BUSTY'                                           
         DC    C'E',C'BCHTU',C'BUTCH'                                           
         DC    C'H',C'BEOTU',C'BUTEO'                                           
         DC    C'H',C'BETTU',C'BUTTE'                                           
         DC    C'H',C'BLTUY',C'BUTYL'                                           
         DC    C'E',C'BMOUX',C'BUXOM'                                           
         DC    C'E',C'BERUY',C'BUYER'                                           
         DC    C'H',C'AABNW',C'BWANA'                                           
         DC    C'E',C'ABLWY',C'BYLAW'                                           
         DC    C'H',C'BISSY',C'BYSSI'                                           
         DC    C'H',C'AABCL',C'CABAL'                                           
         DC    C'E',C'ABBCY',C'CABBY'                                           
         DC    C'H',C'ABCER',C'CABER'                                           
         DC    C'E',C'ABCIN',C'CABIN'                                           
         DC    C'E',C'ABCEL',C'CABLE'                                           
         DC    C'H',C'ABBCO',C'CABOB'                                           
         DC    C'H',C'AACCO',C'CACAO'                                           
         DC    C'H',C'ACCEH',C'CACHE'                                           
         DC    C'E',C'ACDDY',C'CADDY'                                           
         DC    C'E',C'ACDET',C'CADET'                                           
         DC    C'H',C'ACDEG',C'CADGE'                                           
         DC    C'H',C'ACDGY',C'CADGY'                                           
         DC    C'H',C'ACDER',C'CADRE'                                           
         DC    C'E',C'ACDEG',C'CAGED'                                           
         DC    C'E',C'ACEGR',C'CAGER'                                           
         DC    C'E',C'ACEGY',C'CAGEY'                                           
         DC    C'H',C'ACDIR',C'CAIRD'                                           
         DC    C'H',C'ACINR',C'CAIRN'                                           
         DC    C'E',C'ACDEK',C'CAKED'                                           
         DC    C'H',C'ACFIL',C'CALIF'                                           
         DC    C'H',C'ACILX',C'CALIX'                                           
         DC    C'H',C'AACLL',C'CALLA'                                           
         DC    C'H',C'ACELV',C'CALVE'                                           
         DC    C'H',C'ACLXY',C'CALYX'                                           
         DC    C'H',C'AACMS',C'CAMAS'                                           
         DC    C'E',C'ACELM',C'CAMEL'                                           
         DC    C'E',C'ACEMO',C'CAMEO'                                           
         DC    C'H',C'ACIMP',C'CAMPI'                                           
         DC    C'H',C'ACMOP',C'CAMPO'                                           
         DC    C'E',C'ACMPY',C'CAMPY'                                           
         DC    C'E',C'AACLN',C'CANAL'                                           
         DC    C'E',C'ACDNY',C'CANDY'                                           
         DC    C'E',C'ACDEN',C'CANED'                                           
         DC    C'H',C'AACNN',C'CANNA'                                           
         DC    C'H',C'ACNNY',C'CANNY'                                           
         DC    C'E',C'ACENO',C'CANOE'                                           
         DC    C'H',C'ACNNO',C'CANON'                                           
         DC    C'H',C'ACNST',C'CANST'                                           
         DC    C'H',C'ACNOT',C'CANTO'                                           
         DC    C'H',C'ACNTY',C'CANTY'                                           
         DC    C'E',C'ACDEP',C'CAPED'                                           
         DC    C'E',C'ACEPR',C'CAPER'                                           
         DC    C'E',C'ACNOP',C'CAPON'                                           
         DC    C'E',C'AACRT',C'CARAT'                                           
         DC    C'E',C'ACDER',C'CARED'                                           
         DC    C'E',C'ACERR',C'CARER'                                           
         DC    C'H',C'ACERT',C'CARET'                                           
         DC    C'E',C'ACGOR',C'CARGO'                                           
         DC    C'H',C'ACELR',C'CARLE'                                           
         DC    C'E',C'ACNRY',C'CARNY'                                           
         DC    C'H',C'ABCOR',C'CAROB'                                           
         DC    C'E',C'ACLOR',C'CAROL'                                           
         DC    C'H',C'ACMOR',C'CAROM'                                           
         DC    C'H',C'ACIPR',C'CARPI'                                           
         DC    C'E',C'ACRRY',C'CARRY'                                           
         DC    C'E',C'ACERT',C'CARTE'                                           
         DC    C'E',C'ACERV',C'CARVE'                                           
         DC    C'E',C'ACDES',C'CASED'                                           
         DC    C'H',C'ACEST',C'CASTE'                                           
         DC    C'E',C'ACCHT',C'CATCH'                                           
         DC    C'E',C'ACERT',C'CATER'                                           
         DC    C'E',C'ACTTY',C'CATTY'                                           
         DC    C'E',C'ACKLU',C'CAULK'                                           
         DC    C'E',C'ACESU',C'CAUSE'                                           
         DC    C'E',C'ACDEV',C'CAVED'                                           
         DC    C'E',C'ACERV',C'CAVER'                                           
         DC    C'H',C'ACILV',C'CAVIL'                                           
         DC    C'E',C'ACEES',C'CEASE'                                           
         DC    C'H',C'CCEMU',C'CECUM'                                           
         DC    C'E',C'ACDER',C'CEDAR'                                           
         DC    C'H',C'CDDEE',C'CEDED'                                           
         DC    C'H',C'ABCEI',C'CEIBA'                                           
         DC    C'H',C'ACELL',C'CELLA'                                           
         DC    C'E',C'CELLO',C'CELLO'                                           
         DC    C'H',C'CELMO',C'CELOM'                                           
         DC    C'H',C'CEENS',C'CENSE'                                           
         DC    C'H',C'CENOT',C'CENTO'                                           
         DC    C'H',C'CELOR',C'CEORL'                                           
         DC    C'H',C'CDEER',C'CERED'                                           
         DC    C'H',C'ACEIR',C'CERIA'                                           
         DC    C'H',C'CCEIR',C'CERIC'                                           
         DC    C'H',C'ACEST',C'CESTA'                                           
         DC    C'E',C'ACEFH',C'CHAFE'                                           
         DC    C'H',C'ACFFH',C'CHAFF'                                           
         DC    C'E',C'ACHIN',C'CHAIN'                                           
         DC    C'E',C'ACHIR',C'CHAIR'                                           
         DC    C'E',C'ACHKL',C'CHALK'                                           
         DC    C'E',C'ACHMP',C'CHAMP'                                           
         DC    C'E',C'ACHNT',C'CHANT'                                           
         DC    C'E',C'ACHOS',C'CHAOS'                                           
         DC    C'H',C'ACEHP',C'CHAPE'                                           
         DC    C'H',C'ACDHR',C'CHARD'                                           
         DC    C'H',C'ACEHR',C'CHARE'                                           
         DC    C'E',C'ACHMR',C'CHARM'                                           
         DC    C'H',C'ACHRR',C'CHARR'                                           
         DC    C'E',C'ACHRT',C'CHART'                                           
         DC    C'H',C'ACHRY',C'CHARY'                                           
         DC    C'E',C'ACEHS',C'CHASE'                                           
         DC    C'E',C'ACHMS',C'CHASM'                                           
         DC    C'E',C'ACEHP',C'CHEAP'                                           
         DC    C'E',C'ACEHT',C'CHEAT'                                           
         DC    C'E',C'CCEHK',C'CHECK'                                           
         DC    C'E',C'CEEHK',C'CHEEK'                                           
         DC    C'H',C'CEEHP',C'CHEEP'                                           
         DC    C'E',C'CEEHR',C'CHEER'                                           
         DC    C'H',C'ACEHL',C'CHELA'                                           
         DC    C'H',C'CEHRT',C'CHERT'                                           
         DC    C'E',C'CEHSS',C'CHESS'                                           
         DC    C'E',C'CEHST',C'CHEST'                                           
         DC    C'H',C'CEHHT',C'CHETH'                                           
         DC    C'H',C'CEHVY',C'CHEVY'                                           
         DC    C'E',C'CEHWY',C'CHEWY'                                           
         DC    C'E',C'CCHIK',C'CHICK'                                           
         DC    C'E',C'CDEHI',C'CHIDE'                                           
         DC    C'E',C'CEFHI',C'CHIEF'                                           
         DC    C'H',C'CEHIL',C'CHIEL'                                           
         DC    C'E',C'CDHIL',C'CHILD'                                           
         DC    C'E',C'CHILL',C'CHILL'                                           
         DC    C'H',C'BCHIM',C'CHIMB'                                           
         DC    C'E',C'CEHIM',C'CHIME'                                           
         DC    C'E',C'CHIMP',C'CHIMP'                                           
         DC    C'E',C'ACHIN',C'CHINA'                                           
         DC    C'H',C'CEHIN',C'CHINE'                                           
         DC    C'H',C'CHIKN',C'CHINK'                                           
         DC    C'E',C'CHINO',C'CHINO'                                           
         DC    C'H',C'CHIKR',C'CHIRK'                                           
         DC    C'H',C'CHIMR',C'CHIRM'                                           
         DC    C'E',C'CHIPR',C'CHIRP'                                           
         DC    C'H',C'CHIRR',C'CHIRR'                                           
         DC    C'E',C'CEHIV',C'CHIVE'                                           
         DC    C'H',C'CHIVY',C'CHIVY'                                           
         DC    C'E',C'CCHKO',C'CHOCK'                                           
         DC    C'E',C'CHIOR',C'CHOIR'                                           
         DC    C'E',C'CEHKO',C'CHOKE'                                           
         DC    C'H',C'CHKOY',C'CHOKY'                                           
         DC    C'E',C'CHMOP',C'CHOMP'                                           
         DC    C'E',C'CDHOR',C'CHORD'                                           
         DC    C'E',C'CEHOR',C'CHORE'                                           
         DC    C'E',C'CEHOS',C'CHOSE'                                           
         DC    C'H',C'CHOTT',C'CHOTT'                                           
         DC    C'E',C'CCHKU',C'CHUCK'                                           
         DC    C'H',C'CFFHU',C'CHUFF'                                           
         DC    C'E',C'CHMPU',C'CHUMP'                                           
         DC    C'E',C'CHKNU',C'CHUNK'                                           
         DC    C'H',C'CHLRU',C'CHURL'                                           
         DC    C'E',C'CHNRU',C'CHURN'                                           
         DC    C'H',C'CHRRU',C'CHURR'                                           
         DC    C'E',C'CEHTU',C'CHUTE'                                           
         DC    C'H',C'CEHLY',C'CHYLE'                                           
         DC    C'H',C'CEHMY',C'CHYME'                                           
         DC    C'E',C'CDEIR',C'CIDER'                                           
         DC    C'E',C'ACGIR',C'CIGAR'                                           
         DC    C'H',C'ACIIL',C'CILIA'                                           
         DC    C'H',C'CEIMX',C'CIMEX'                                           
         DC    C'E',C'CCHIN',C'CINCH'                                           
         DC    C'H',C'ACCIR',C'CIRCA'                                           
         DC    C'H',C'CIIRR',C'CIRRI'                                           
         DC    C'E',C'CDEIT',C'CITED'                                           
         DC    C'E',C'CEIRT',C'CITER'                                           
         DC    C'H',C'CEITV',C'CIVET'                                           
         DC    C'E',C'CCIIV',C'CIVIC'                                           
         DC    C'E',C'CIILV',C'CIVIL'                                           
         DC    C'E',C'ACCKL',C'CLACK'                                           
         DC    C'E',C'ACILM',C'CLAIM'                                           
         DC    C'E',C'ACLMP',C'CLAMP'                                           
         DC    C'E',C'ACGLN',C'CLANG'                                           
         DC    C'H',C'ACKLN',C'CLANK'                                           
         DC    C'H',C'ACLOR',C'CLARO'                                           
         DC    C'H',C'ACLRY',C'CLARY'                                           
         DC    C'E',C'ACHLS',C'CLASH'                                           
         DC    C'E',C'ACLPS',C'CLASP'                                           
         DC    C'E',C'ACLSS',C'CLASS'                                           
         DC    C'H',C'ACELV',C'CLAVE'                                           
         DC    C'E',C'ACELN',C'CLEAN'                                           
         DC    C'E',C'ACELR',C'CLEAR'                                           
         DC    C'E',C'ACELT',C'CLEAT'                                           
         DC    C'H',C'CEEKL',C'CLEEK'                                           
         DC    C'E',C'CEFLT',C'CLEFT'                                           
         DC    C'H',C'CEELP',C'CLEPE'                                           
         DC    C'E',C'CEKLR',C'CLERK'                                           
         DC    C'E',C'CCIKL',C'CLICK'                                           
         DC    C'E',C'CFFIL',C'CLIFF'                                           
         DC    C'E',C'BCILM',C'CLIMB'                                           
         DC    C'H',C'CEILM',C'CLIME'                                           
         DC    C'H',C'CEILN',C'CLINE'                                           
         DC    C'E',C'CGILN',C'CLING'                                           
         DC    C'E',C'CIKLN',C'CLINK'                                           
         DC    C'E',C'ACKLO',C'CLOAK'                                           
         DC    C'E',C'CCKLO',C'CLOCK'                                           
         DC    C'H',C'BCLMO',C'CLOMB'                                           
         DC    C'E',C'CLMOP',C'CLOMP'                                           
         DC    C'E',C'CELNO',C'CLONE'                                           
         DC    C'H',C'CKLNO',C'CLONK'                                           
         DC    C'E',C'CELOS',C'CLOSE'                                           
         DC    C'E',C'CHLOT',C'CLOTH'                                           
         DC    C'E',C'CDLOU',C'CLOUD'                                           
         DC    C'E',C'CLOTU',C'CLOUT'                                           
         DC    C'E',C'CELOV',C'CLOVE'                                           
         DC    C'E',C'CLNOW',C'CLOWN'                                           
         DC    C'E',C'CCKLU',C'CLUCK'                                           
         DC    C'E',C'CDELU',C'CLUED'                                           
         DC    C'E',C'CLMPU',C'CLUMP'                                           
         DC    C'E',C'CGLNU',C'CLUNG'                                           
         DC    C'E',C'CKLNU',C'CLUNK'                                           
         DC    C'E',C'ACCHO',C'COACH'                                           
         DC    C'H',C'ACCOT',C'COACT'                                           
         DC    C'E',C'ACOST',C'COAST'                                           
         DC    C'H',C'ACIOT',C'COATI'                                           
         DC    C'H',C'BCELO',C'COBLE'                                           
         DC    C'E',C'ABCOR',C'COBRA'                                           
         DC    C'H',C'CCCIO',C'COCCI'                                           
         DC    C'E',C'CCKOY',C'COCKY'                                           
         DC    C'E',C'ACCOO',C'COCOA'                                           
         DC    C'E',C'CDDEO',C'CODED'                                           
         DC    C'E',C'CDEOR',C'CODER'                                           
         DC    C'H',C'CDEOX',C'CODEX'                                           
         DC    C'H',C'CGNOO',C'COGON'                                           
         DC    C'H',C'CDEKO',C'COKED'                                           
         DC    C'E',C'CCILO',C'COLIC'                                           
         DC    C'H',C'CLLOY',C'COLLY'                                           
         DC    C'E',C'CLNOO',C'COLON'                                           
         DC    C'E',C'CLOOR',C'COLOR'                                           
         DC    C'H',C'ACLOZ',C'COLZA'                                           
         DC    C'H',C'BCEMO',C'COMBE'                                           
         DC    C'E',C'BCMOO',C'COMBO'                                           
         DC    C'H',C'CEMOR',C'COMER'                                           
         DC    C'E',C'CEMOT',C'COMET'                                           
         DC    C'E',C'CFMOY',C'COMFY'                                           
         DC    C'E',C'CCIMO',C'COMIC'                                           
         DC    C'E',C'ACMMO',C'COMMA'                                           
         DC    C'H',C'CMOOP',C'COMPO'                                           
         DC    C'H',C'CCHNO',C'CONCH'                                           
         DC    C'E',C'CDENO',C'CONED'                                           
         DC    C'H',C'CENOY',C'CONEY'                                           
         DC    C'E',C'ACGNO',C'CONGA'                                           
         DC    C'H',C'CEGNO',C'CONGE'                                           
         DC    C'E',C'CGNOO',C'CONGO'                                           
         DC    C'E',C'CCINO',C'CONIC'                                           
         DC    C'H',C'CENOT',C'CONTE'                                           
         DC    C'H',C'CNOOT',C'CONTO'                                           
         DC    C'H',C'CDEOO',C'COOED'                                           
         DC    C'H',C'CEOOR',C'COOER'                                           
         DC    C'H',C'CKOOY',C'COOKY'                                           
         DC    C'H',C'BCMOO',C'COOMB'                                           
         DC    C'H',C'COOPT',C'COOPT'                                           
         DC    C'H',C'ACLOP',C'COPAL'                                           
         DC    C'E',C'CDEOP',C'COPED'                                           
         DC    C'E',C'CEOPR',C'COPER'                                           
         DC    C'H',C'ACOPR',C'COPRA'                                           
         DC    C'H',C'CEOPS',C'COPSE'                                           
         DC    C'E',C'ACLOR',C'CORAL'                                           
         DC    C'E',C'CDEOR',C'CORED'                                           
         DC    C'E',C'CEORR',C'CORER'                                           
         DC    C'H',C'CGIOR',C'CORGI'                                           
         DC    C'H',C'CKORY',C'CORKY'                                           
         DC    C'H',C'CNORU',C'CORNU'                                           
         DC    C'E',C'CNORY',C'CORNY'                                           
         DC    C'E',C'COPRS',C'CORPS'                                           
         DC    C'H',C'CEORS',C'CORSE'                                           
         DC    C'H',C'CCEOS',C'COSEC'                                           
         DC    C'H',C'CEOST',C'COSET'                                           
         DC    C'H',C'CEOSY',C'COSEY'                                           
         DC    C'H',C'CEIOS',C'COSIE'                                           
         DC    C'H',C'ACOST',C'COSTA'                                           
         DC    C'H',C'ACNOT',C'COTAN'                                           
         DC    C'H',C'CDEOT',C'COTED'                                           
         DC    C'H',C'ACOTT',C'COTTA'                                           
         DC    C'E',C'CCHOU',C'COUCH'                                           
         DC    C'E',C'CGHOU',C'COUGH'                                           
         DC    C'E',C'CDLOU',C'COULD'                                           
         DC    C'E',C'CNOTU',C'COUNT'                                           
         DC    C'E',C'CEOPU',C'COUPE'                                           
         DC    C'E',C'CORTU',C'COURT'                                           
         DC    C'E',C'CHOTU',C'COUTH'                                           
         DC    C'H',C'CDEOV',C'COVED'                                           
         DC    C'H',C'CENOV',C'COVEN'                                           
         DC    C'E',C'CEORV',C'COVER'                                           
         DC    C'E',C'CEOTV',C'COVET'                                           
         DC    C'H',C'CEOVY',C'COVEY'                                           
         DC    C'H',C'CINOV',C'COVIN'                                           
         DC    C'E',C'CDEOW',C'COWED'                                           
         DC    C'E',C'CEORW',C'COWER'                                           
         DC    C'H',C'CORWY',C'COWRY'                                           
         DC    C'H',C'CENOZ',C'COZEN'                                           
         DC    C'E',C'ACCKR',C'CRACK'                                           
         DC    C'E',C'ACFRT',C'CRAFT'                                           
         DC    C'H',C'ACEKR',C'CRAKE'                                           
         DC    C'E',C'ACMPR',C'CRAMP'                                           
         DC    C'E',C'ACENR',C'CRANE'                                           
         DC    C'E',C'ACKNR',C'CRANK'                                           
         DC    C'H',C'ACEPR',C'CRAPE'                                           
         DC    C'E',C'ACHRS',C'CRASH'                                           
         DC    C'E',C'ACRSS',C'CRASS'                                           
         DC    C'E',C'ACERT',C'CRATE'                                           
         DC    C'E',C'ACERV',C'CRAVE'                                           
         DC    C'E',C'ACLRW',C'CRAWL'                                           
         DC    C'E',C'ACERZ',C'CRAZE'                                           
         DC    C'E',C'ACRYZ',C'CRAZY'                                           
         DC    C'E',C'ACEKR',C'CREAK'                                           
         DC    C'E',C'ACEMR',C'CREAM'                                           
         DC    C'E',C'CDEOR',C'CREDO'                                           
         DC    C'E',C'CDEER',C'CREED'                                           
         DC    C'E',C'CEEKR',C'CREEK'                                           
         DC    C'H',C'CEELR',C'CREEL'                                           
         DC    C'E',C'CEEPR',C'CREEP'                                           
         DC    C'E',C'CEEMR',C'CREME'                                           
         DC    C'E',C'CEEPR',C'CREPE'                                           
         DC    C'E',C'CEPRT',C'CREPT'                                           
         DC    C'H',C'CERSS',C'CRESS'                                           
         DC    C'H',C'CERST',C'CREST'                                           
         DC    C'E',C'CCIKR',C'CRICK'                                           
         DC    C'E',C'CDEIR',C'CRIED'                                           
         DC    C'E',C'CEIRR',C'CRIER'                                           
         DC    C'E',C'CEIRS',C'CRIES'                                           
         DC    C'E',C'CEIMR',C'CRIME'                                           
         DC    C'E',C'CIMPR',C'CRIMP'                                           
         DC    C'E',C'CIPRS',C'CRISP'                                           
         DC    C'E',C'ACKOR',C'CROAK'                                           
         DC    C'E',C'CCKOR',C'CROCK'                                           
         DC    C'H',C'CFORT',C'CROFT'                                           
         DC    C'H',C'CENOR',C'CRONE'                                           
         DC    C'E',C'CNORY',C'CRONY'                                           
         DC    C'E',C'CKOOR',C'CROOK'                                           
         DC    C'E',C'CNOOR',C'CROON'                                           
         DC    C'H',C'CEORR',C'CRORE'                                           
         DC    C'E',C'CORSS',C'CROSS'                                           
         DC    C'E',C'COPRU',C'CROUP'                                           
         DC    C'E',C'CDORW',C'CROWD'                                           
         DC    C'E',C'CNORW',C'CROWN'                                           
         DC    C'H',C'CEORZ',C'CROZE'                                           
         DC    C'E',C'CDERU',C'CRUDE'                                           
         DC    C'E',C'CELRU',C'CRUEL'                                           
         DC    C'H',C'CERTU',C'CRUET'                                           
         DC    C'E',C'BCMRU',C'CRUMB'                                           
         DC    C'H',C'CMPRU',C'CRUMP'                                           
         DC    C'H',C'CORRU',C'CRUOR'                                           
         DC    C'H',C'CERSU',C'CRUSE'                                           
         DC    C'E',C'CHRSU',C'CRUSH'                                           
         DC    C'E',C'CRSTU',C'CRUST'                                           
         DC    C'H',C'CHRTW',C'CRWTH'                                           
         DC    C'E',C'CPRTY',C'CRYPT'                                           
         DC    C'E',C'BBCUY',C'CUBBY'                                           
         DC    C'H',C'BBCEU',C'CUBEB'                                           
         DC    C'E',C'BCDEU',C'CUBED'                                           
         DC    C'H',C'BCERU',C'CUBER'                                           
         DC    C'E',C'BCCIU',C'CUBIC'                                           
         DC    C'E',C'BCITU',C'CUBIT'                                           
         DC    C'H',C'CDDUY',C'CUDDY'                                           
         DC    C'H',C'CGINU',C'CUING'                                           
         DC    C'H',C'CCHLU',C'CULCH'                                           
         DC    C'H',C'CELTU',C'CULET'                                           
         DC    C'H',C'CELUX',C'CULEX'                                           
         DC    C'H',C'CLLUY',C'CULLY'                                           
         DC    C'E',C'CIMNU',C'CUMIN'                                           
         DC    C'H',C'CELPU',C'CUPEL'                                           
         DC    C'H',C'ACPPU',C'CUPPA'                                           
         DC    C'H',C'CCHRU',C'CURCH'                                           
         DC    C'E',C'CDRUY',C'CURDY'                                           
         DC    C'E',C'CDERU',C'CURED'                                           
         DC    C'E',C'CERRU',C'CURER'                                           
         DC    C'H',C'CERTU',C'CURET'                                           
         DC    C'H',C'ACIRU',C'CURIA'                                           
         DC    C'H',C'CEIRU',C'CURIE'                                           
         DC    C'E',C'CIORU',C'CURIO'                                           
         DC    C'E',C'CLRUY',C'CURLY'                                           
         DC    C'E',C'CRRUY',C'CURRY'                                           
         DC    C'E',C'CERSU',C'CURSE'                                           
         DC    C'H',C'CRSTU',C'CURST'                                           
         DC    C'E',C'CERUV',C'CURVE'                                           
         DC    C'E',C'CRUVY',C'CURVY'                                           
         DC    C'H',C'CCESU',C'CUSEC'                                           
         DC    C'E',C'CHSUY',C'CUSHY'                                           
         DC    C'H',C'CCHTU',C'CUTCH'                                           
         DC    C'E',C'CERTU',C'CUTER'                                           
         DC    C'H',C'CINTU',C'CUTIN'                                           
         DC    C'H',C'CISTU',C'CUTIS'                                           
         DC    C'H',C'CTTUY',C'CUTTY'                                           
         DC    C'H',C'ACCDY',C'CYCAD'                                           
         DC    C'H',C'ACCSY',C'CYCAS'                                           
         DC    C'E',C'CCELY',C'CYCLE'                                           
         DC    C'E',C'CDERY',C'CYDER'                                           
         DC    C'H',C'CILXY',C'CYLIX'                                           
         DC    C'H',C'ACMRY',C'CYMAR'                                           
         DC    C'E',C'CCINY',C'CYNIC'                                           
         DC    C'E',C'ADDDY',C'DADDY'                                           
         DC    C'E',C'ADFFY',C'DAFFY'                                           
         DC    C'E',C'ADILY',C'DAILY'                                           
         DC    C'E',C'ADIRY',C'DAIRY'                                           
         DC    C'E',C'ADISY',C'DAISY'                                           
         DC    C'E',C'ADLLY',C'DALLY'                                           
         DC    C'H',C'AADMN',C'DAMAN'                                           
         DC    C'H',C'AADMR',C'DAMAR'                                           
         DC    C'E',C'ACDEN',C'DANCE'                                           
         DC    C'E',C'ADDNY',C'DANDY'                                           
         DC    C'H',C'ADINO',C'DANIO'                                           
         DC    C'E',C'ADDER',C'DARED'                                           
         DC    C'E',C'ADERR',C'DARER'                                           
         DC    C'E',C'ADDET',C'DATED'                                           
         DC    C'E',C'ADERT',C'DATER'                                           
         DC    C'H',C'ADOTT',C'DATTO'                                           
         DC    C'H',C'ADMTU',C'DATUM'                                           
         DC    C'H',C'ADNTU',C'DAUNT'                                           
         DC    C'H',C'ADITV',C'DAVIT'                                           
         DC    C'E',C'ADDEZ',C'DAZED'                                           
         DC    C'E',C'ADELT',C'DEALT'                                           
         DC    C'H',C'ADERY',C'DEARY'                                           
         DC    C'E',C'ADEHT',C'DEATH'                                           
         DC    C'H',C'ABDER',C'DEBAR'                                           
         DC    C'E',C'BDEIT',C'DEBIT'                                           
         DC    C'E',C'BDEGU',C'DEBUG'                                           
         DC    C'E',C'BDETU',C'DEBUT'                                           
         DC    C'E',C'ACDEL',C'DECAL'                                           
         DC    C'E',C'ACDEY',C'DECAY'                                           
         DC    C'E',C'CDEOR',C'DECOR'                                           
         DC    C'E',C'CDEOY',C'DECOY'                                           
         DC    C'H',C'CDERY',C'DECRY'                                           
         DC    C'H',C'ADDEL',C'DEDAL'                                           
         DC    C'E',C'DEEFR',C'DEFER'                                           
         DC    C'H',C'ADEGS',C'DEGAS'                                           
         DC    C'E',C'CDEEI',C'DEICE'                                           
         DC    C'E',C'DEFIY',C'DEIFY'                                           
         DC    C'H',C'DEGIN',C'DEIGN'                                           
         DC    C'H',C'DEIMS',C'DEISM'                                           
         DC    C'H',C'DEIST',C'DEIST'                                           
         DC    C'H',C'DEITY',C'DEITY'                                           
         DC    C'E',C'ADELY',C'DELAY'                                           
         DC    C'H',C'DDEEL',C'DELED'                                           
         DC    C'E',C'ADELT',C'DELTA'                                           
         DC    C'H',C'DEELV',C'DELVE'                                           
         DC    C'H',C'DEIMT',C'DEMIT'                                           
         DC    C'H',C'BDEMO',C'DEMOB'                                           
         DC    C'E',C'DEMNO',C'DEMON'                                           
         DC    C'H',C'DEMOS',C'DEMOS'                                           
         DC    C'H',C'DEMRU',C'DEMUR'                                           
         DC    C'E',C'DEIMN',C'DENIM'                                           
         DC    C'E',C'DEENS',C'DENSE'                                           
         DC    C'E',C'DEOPT',C'DEPOT'                                           
         DC    C'E',C'DEHPT',C'DEPTH'                                           
         DC    C'H',C'ADERY',C'DERAY'                                           
         DC    C'E',C'BDERY',C'DERBY'                                           
         DC    C'H',C'ADEMR',C'DERMA'                                           
         DC    C'H',C'DERRY',C'DERRY'                                           
         DC    C'E',C'DEESX',C'DESEX'                                           
         DC    C'E',C'DEERT',C'DETER'                                           
         DC    C'E',C'CDEEU',C'DEUCE'                                           
         DC    C'E',C'DEILV',C'DEVIL'                                           
         DC    C'H',C'ADENW',C'DEWAN'                                           
         DC    C'H',C'DEHLO',C'DHOLE'                                           
         DC    C'H',C'DHIOT',C'DHOTI'                                           
         DC    C'E',C'ADIRY',C'DIARY'                                           
         DC    C'H',C'ADIOZ',C'DIAZO'                                           
         DC    C'E',C'CDDEI',C'DICED'                                           
         DC    C'E',C'CDEIR',C'DICER'                                           
         DC    C'H',C'CDEIY',C'DICEY'                                           
         DC    C'H',C'CDIKY',C'DICKY'                                           
         DC    C'H',C'CDIOT',C'DICOT'                                           
         DC    C'H',C'ACDIT',C'DICTA'                                           
         DC    C'H',C'DDIST',C'DIDST'                                           
         DC    C'H',C'DGHIT',C'DIGHT'                                           
         DC    C'E',C'DGIIT',C'DIGIT'                                           
         DC    C'H',C'DDEIK',C'DIKED'                                           
         DC    C'E',C'DDILO',C'DILDO'                                           
         DC    C'H',C'DEIMR',C'DIMER'                                           
         DC    C'E',C'DILMY',C'DIMLY'                                           
         DC    C'H',C'ADINR',C'DINAR'                                           
         DC    C'E',C'DDEIN',C'DINED'                                           
         DC    C'E',C'DEINR',C'DINER'                                           
         DC    C'E',C'DGINY',C'DINGY'                                           
         DC    C'E',C'DIKNY',C'DINKY'                                           
         DC    C'H',C'DDEIO',C'DIODE'                                           
         DC    C'E',C'DIPPY',C'DIPPY'                                           
         DC    C'E',C'DEIRR',C'DIRER'                                           
         DC    C'E',C'DEGIR',C'DIRGE'                                           
         DC    C'E',C'DIRTY',C'DIRTY'                                           
         DC    C'E',C'CDHIT',C'DITCH'                                           
         DC    C'E',C'DIOTT',C'DITTO'                                           
         DC    C'E',C'DITTY',C'DITTY'                                           
         DC    C'E',C'ADINV',C'DIVAN'                                           
         DC    C'H',C'DDEIV',C'DIVED'                                           
         DC    C'E',C'DEIRV',C'DIVER'                                           
         DC    C'E',C'DIOTV',C'DIVOT'                                           
         DC    C'E',C'DIVVY',C'DIVVY'                                           
         DC    C'H',C'DIITX',C'DIXIT'                                           
         DC    C'H',C'DEINZ',C'DIZEN'                                           
         DC    C'E',C'DIYZZ',C'DIZZY'                                           
         DC    C'H',C'DIJNN',C'DJINN'                                           
         DC    C'H',C'ABDLO',C'DOBLA'                                           
         DC    C'E',C'DDEGO',C'DODGE'                                           
         DC    C'E',C'DDGOY',C'DODGY'                                           
         DC    C'H',C'DEOST',C'DOEST'                                           
         DC    C'H',C'DEHOT',C'DOETH'                                           
         DC    C'H',C'DGGOO',C'DOGGO'                                           
         DC    C'H',C'DGGOY',C'DOGGY'                                           
         DC    C'E',C'ADGMO',C'DOGMA'                                           
         DC    C'E',C'DILOY',C'DOILY'                                           
         DC    C'E',C'DGINO',C'DOING'                                           
         DC    C'E',C'DDELO',C'DOLED'                                           
         DC    C'E',C'DLLOY',C'DOLLY'                                           
         DC    C'H',C'DLOOR',C'DOLOR'                                           
         DC    C'H',C'ADLMO',C'DOMAL'                                           
         DC    C'E',C'DDEMO',C'DOMED'                                           
         DC    C'H',C'DEENO',C'DONEE'                                           
         DC    C'E',C'DNOOR',C'DONOR'                                           
         DC    C'E',C'DNOTU',C'DONUT'                                           
         DC    C'H',C'DMORY',C'DORMY'                                           
         DC    C'H',C'DORTY',C'DORTY'                                           
         DC    C'H',C'DDEOS',C'DOSED'                                           
         DC    C'E',C'DDEOT',C'DOTED'                                           
         DC    C'E',C'DEORT',C'DOTER'                                           
         DC    C'E',C'DOTTY',C'DOTTY'                                           
         DC    C'E',C'BDOTU',C'DOUBT'                                           
         DC    C'H',C'CDEOU',C'DOUCE'                                           
         DC    C'E',C'DGHOU',C'DOUGH'                                           
         DC    C'E',C'DEOSU',C'DOUSE'                                           
         DC    C'E',C'DDOWY',C'DOWDY'                                           
         DC    C'E',C'DELOW',C'DOWEL'                                           
         DC    C'H',C'DEORW',C'DOWER'                                           
         DC    C'E',C'DNOWY',C'DOWNY'                                           
         DC    C'H',C'DEOSW',C'DOWSE'                                           
         DC    C'H',C'DLOYY',C'DOYLY'                                           
         DC    C'E',C'DDEOZ',C'DOZED'                                           
         DC    C'E',C'DENOZ',C'DOZEN'                                           
         DC    C'E',C'DEORZ',C'DOZER'                                           
         DC    C'H',C'ADFFR',C'DRAFF'                                           
         DC    C'E',C'ADFRT',C'DRAFT'                                           
         DC    C'E',C'ADINR',C'DRAIN'                                           
         DC    C'H',C'ADEKR',C'DRAKE'                                           
         DC    C'H',C'AADMR',C'DRAMA'                                           
         DC    C'E',C'ADKNR',C'DRANK'                                           
         DC    C'E',C'ADEPR',C'DRAPE'                                           
         DC    C'H',C'ADERV',C'DRAVE'                                           
         DC    C'E',C'ADLRW',C'DRAWL'                                           
         DC    C'E',C'ADNRW',C'DRAWN'                                           
         DC    C'E',C'ADDER',C'DREAD'                                           
         DC    C'E',C'ADEMR',C'DREAM'                                           
         DC    C'H',C'ADERR',C'DREAR'                                           
         DC    C'E',C'CDEKR',C'DRECK'                                           
         DC    C'H',C'DDEER',C'DREED'                                           
         DC    C'E',C'DERSS',C'DRESS'                                           
         DC    C'H',C'DERST',C'DREST'                                           
         DC    C'E',C'DDEIR',C'DRIED'                                           
         DC    C'E',C'DEIRR',C'DRIER'                                           
         DC    C'E',C'DEIRS',C'DRIES'                                           
         DC    C'E',C'DFIRT',C'DRIFT'                                           
         DC    C'E',C'DILLR',C'DRILL'                                           
         DC    C'E',C'DILRY',C'DRILY'                                           
         DC    C'E',C'DIKNR',C'DRINK'                                           
         DC    C'H',C'DIPRT',C'DRIPT'                                           
         DC    C'E',C'DEIRV',C'DRIVE'                                           
         DC    C'H',C'DIORT',C'DROIT'                                           
         DC    C'H',C'DLLOR',C'DROLL'                                           
         DC    C'H',C'DENOR',C'DRONE'                                           
         DC    C'E',C'DLOOR',C'DROOL'                                           
         DC    C'E',C'DOOPR',C'DROOP'                                           
         DC    C'H',C'DOPRT',C'DROPT'                                           
         DC    C'H',C'DORSS',C'DROSS'                                           
         DC    C'E',C'DEORV',C'DROVE'                                           
         DC    C'E',C'DNORW',C'DROWN'                                           
         DC    C'H',C'DDIRU',C'DRUID'                                           
         DC    C'E',C'DKNRU',C'DRUNK'                                           
         DC    C'H',C'DEPRU',C'DRUPE'                                           
         DC    C'H',C'DERSU',C'DRUSE'                                           
         DC    C'H',C'ADDRY',C'DRYAD'                                           
         DC    C'E',C'DERRY',C'DRYER'                                           
         DC    C'E',C'DLRYY',C'DRYLY'                                           
         DC    C'H',C'ACDLU',C'DUCAL'                                           
         DC    C'H',C'ACDTU',C'DUCAT'                                           
         DC    C'H',C'CDHUY',C'DUCHY'                                           
         DC    C'E',C'CDKUY',C'DUCKY'                                           
         DC    C'H',C'ADILU',C'DULIA'                                           
         DC    C'H',C'DELSU',C'DULSE'                                           
         DC    C'E',C'DMMUY',C'DUMMY'                                           
         DC    C'E',C'DMPUY',C'DUMPY'                                           
         DC    C'E',C'CDENU',C'DUNCE'                                           
         DC    C'H',C'DGNUY',C'DUNGY'                                           
         DC    C'E',C'DDEPU',C'DUPED'                                           
         DC    C'H',C'DEPRU',C'DUPER'                                           
         DC    C'H',C'DELPU',C'DUPLE'                                           
         DC    C'H',C'ADLRU',C'DURAL'                                           
         DC    C'H',C'DDERU',C'DURED'                                           
         DC    C'H',C'ADRRU',C'DURRA'                                           
         DC    C'H',C'DRSTU',C'DURST'                                           
         DC    C'H',C'DMRUU',C'DURUM'                                           
         DC    C'E',C'DKSUY',C'DUSKY'                                           
         DC    C'E',C'DSTUY',C'DUSTY'                                           
         DC    C'E',C'CDHTU',C'DUTCH'                                           
         DC    C'E',C'ADFRW',C'DWARF'                                           
         DC    C'E',C'DELLW',C'DWELL'                                           
         DC    C'H',C'DELTW',C'DWELT'                                           
         DC    C'H',C'DEINW',C'DWINE'                                           
         DC    C'E',C'DGINY',C'DYING'                                           
         DC    C'H',C'DEKYY',C'DYKEY'                                           
         DC    X'FF'                                                            
**PAN#1  CSECT                                                                  
**PAN#1  DC    CL21'011GAWRD01   08/22/00'                                      
         END                                                                    
