*          DATA SET GAWRD03    AT LEVEL 009 AS OF 08/22/00                      
*PHASE TB1403A                                                                  
*                                                                               
*                                                                               
* THE WORD POWER DICTIONARY IS DISTRIBUTED AS FOLLOWS:                          
*                                                                               
*        PANVALET BOOK      WORDS      PHASE NAME                               
*           GAWRD01          A-D         TB1401                                 
*           GAWRD02          E-L         TB1402                                 
*           GAWRD03          M-R         TB1403                                 
*           GAWRD04          S-Z         TB1404                                 
*                                                                               
* DC STATEMENTS BELOW ARE OF THE FOLLOWING FORMAT:                              
*                                                                               
*        BYTE  +0(1):  C'E' IF EASY WORD, C'H' IF HARD WORD                     
*        BYTE  +1(5):  SORTED SPELLING OF THE WORD                              
*        BYTE  +6(5):  ACTUAL SPELLING OF THE WORD                              
*                                                                               
*                                                                               
GAWRD03  CSECT                                                                  
         DC    C'H',C'AACMW',C'MACAW'                                           
         DC    C'E',C'ACDEM',C'MACED'                                           
         DC    C'H',C'ACEMR',C'MACER'                                           
         DC    C'H',C'ACELM',C'MACLE'                                           
         DC    C'E',C'AADMM',C'MADAM'                                           
         DC    C'E',C'ADLMY',C'MADLY'                                           
         DC    C'H',C'ACFIM',C'MAFIC'                                           
         DC    C'E',C'ACGIM',C'MAGIC'                                           
         DC    C'E',C'AAGMM',C'MAGMA'                                           
         DC    C'H',C'AIMST',C'MAIST'                                           
         DC    C'E',C'AEIMZ',C'MAIZE'                                           
         DC    C'E',C'AJMOR',C'MAJOR'                                           
         DC    C'E',C'AEKMR',C'MAKER'                                           
         DC    C'H',C'AALMR',C'MALAR'                                           
         DC    C'H',C'ALMTY',C'MALTY'                                           
         DC    C'H',C'AABMM',C'MAMBA'                                           
         DC    C'E',C'AAMMM',C'MAMMA'                                           
         DC    C'E',C'AMMMY',C'MAMMY'                                           
         DC    C'H',C'ADEMN',C'MANED'                                           
         DC    C'H',C'AEGMN',C'MANGE'                                           
         DC    C'E',C'AGMNO',C'MANGO'                                           
         DC    C'E',C'AGMNY',C'MANGY'                                           
         DC    C'E',C'AAIMN',C'MANIA'                                           
         DC    C'E',C'ACIMN',C'MANIC'                                           
         DC    C'E',C'ALMNY',C'MANLY'                                           
         DC    C'E',C'AAMNN',C'MANNA'                                           
         DC    C'E',C'AMNOR',C'MANOR'                                           
         DC    C'H',C'AEMNS',C'MANSE'                                           
         DC    C'H',C'AAMNT',C'MANTA'                                           
         DC    C'H',C'AMNSU',C'MANUS'                                           
         DC    C'E',C'AELMP',C'MAPLE'                                           
         DC    C'H',C'AIMQU',C'MAQUI'                                           
         DC    C'E',C'ACHMR',C'MARCH'                                           
         DC    C'H',C'AEGMR',C'MARGE'                                           
         DC    C'H',C'AAIMR',C'MARIA'                                           
         DC    C'H',C'ALMRY',C'MARLY'                                           
         DC    C'E',C'AMRRY',C'MARRY'                                           
         DC    C'E',C'AHMRS',C'MARSH'                                           
         DC    C'E',C'AMNOS',C'MASON'                                           
         DC    C'H',C'AEMSS',C'MASSE'                                           
         DC    C'H',C'AMSSY',C'MASSY'                                           
         DC    C'E',C'ACHMT',C'MATCH'                                           
         DC    C'E',C'ADEMT',C'MATED'                                           
         DC    C'H',C'AEMRT',C'MATER'                                           
         DC    C'E',C'AEMTY',C'MATEY'                                           
         DC    C'H',C'AIMNT',C'MATIN'                                           
         DC    C'H',C'AEMTT',C'MATTE'                                           
         DC    C'H',C'AMOTZ',C'MATZO'                                           
         DC    C'H',C'ADMNU',C'MAUND'                                           
         DC    C'H',C'AEMUV',C'MAUVE'                                           
         DC    C'H',C'AIMSV',C'MAVIS'                                           
         DC    C'E',C'AIMMX',C'MAXIM'                                           
         DC    C'E',C'ABEMY',C'MAYBE'                                           
         DC    C'E',C'AMORY',C'MAYOR'                                           
         DC    C'H',C'AMSTY',C'MAYST'                                           
         DC    C'H',C'ADEMZ',C'MAZED'                                           
         DC    C'H',C'AEMRZ',C'MAZER'                                           
         DC    C'H',C'AELMY',C'MEALY'                                           
         DC    C'E',C'AEMNS',C'MEANS'                                           
         DC    C'E',C'AEMNT',C'MEANT'                                           
         DC    C'E',C'AEMTY',C'MEATY'                                           
         DC    C'E',C'ADELM',C'MEDAL'                                           
         DC    C'E',C'ADEIM',C'MEDIA'                                           
         DC    C'E',C'CDEIM',C'MEDIC'                                           
         DC    C'H',C'EIMNY',C'MEINY'                                           
         DC    C'H',C'EEELM',C'MELEE'                                           
         DC    C'E',C'ELMNO',C'MELON'                                           
         DC    C'H',C'ADEMN',C'MENAD'                                           
         DC    C'E',C'CEMRY',C'MERCY'                                           
         DC    C'E',C'EEGMR',C'MERGE'                                           
         DC    C'E',C'EIMRT',C'MERIT'                                           
         DC    C'H',C'EELMR',C'MERLE'                                           
         DC    C'E',C'EMRRY',C'MERRY'                                           
         DC    C'H',C'EHMSY',C'MESHY'                                           
         DC    C'H',C'CEIMS',C'MESIC'                                           
         DC    C'H',C'EEMNS',C'MESNE'                                           
         DC    C'E',C'EMSSY',C'MESSY'                                           
         DC    C'E',C'AELMT',C'METAL'                                           
         DC    C'H',C'DEEMT',C'METED'                                           
         DC    C'E',C'EEMRT',C'METER'                                           
         DC    C'E',C'EEMRT',C'METRE'                                           
         DC    C'E',C'EMORT',C'METRO'                                           
         DC    C'H',C'EMOZZ',C'MEZZO'                                           
         DC    C'H',C'AIMOU',C'MIAOU'                                           
         DC    C'H',C'AIMOW',C'MIAOW'                                           
         DC    C'H',C'ACIMR',C'MICRA'                                           
         DC    C'H',C'DDIMY',C'MIDDY'                                           
         DC    C'H',C'DEGIM',C'MIDGE'                                           
         DC    C'H',C'DIMST',C'MIDST'                                           
         DC    C'E',C'GHIMT',C'MIGHT'                                           
         DC    C'H',C'CHILM',C'MILCH'                                           
         DC    C'E',C'EILMR',C'MILER'                                           
         DC    C'E',C'IKLMY',C'MILKY'                                           
         DC    C'E',C'DEIMM',C'MIMED'                                           
         DC    C'E',C'EIMMR',C'MIMER'                                           
         DC    C'E',C'CIIMM',C'MIMIC'                                           
         DC    C'E',C'CEIMN',C'MINCE'                                           
         DC    C'E',C'DEIMN',C'MINED'                                           
         DC    C'E',C'EIMNR',C'MINER'                                           
         DC    C'H',C'GIMNY',C'MINGY'                                           
         DC    C'H',C'IIMMN',C'MINIM'                                           
         DC    C'E',C'IMNOR',C'MINOR'                                           
         DC    C'E',C'IMNSU',C'MINUS'                                           
         DC    C'H',C'DEIMR',C'MIRED'                                           
         DC    C'H',C'IKMRY',C'MIRKY'                                           
         DC    C'E',C'HIMRT',C'MIRTH'                                           
         DC    C'H',C'AIMRZ',C'MIRZA'                                           
         DC    C'H',C'DIMOS',C'MISDO'                                           
         DC    C'E',C'EIMRS',C'MISER'                                           
         DC    C'E',C'IMSSY',C'MISSY'                                           
         DC    C'E',C'IMSTY',C'MISTY'                                           
         DC    C'H',C'EIMRT',C'MITER'                                           
         DC    C'H',C'EIMRT',C'MITRE'                                           
         DC    C'E',C'DEIMX',C'MIXED'                                           
         DC    C'E',C'EIMRX',C'MIXER'                                           
         DC    C'E',C'IMPUX',C'MIXUP'                                           
         DC    C'H',C'EIMNZ',C'MIZEN'                                           
         DC    C'H',C'ADLMO',C'MODAL'                                           
         DC    C'E',C'DELMO',C'MODEL'                                           
         DC    C'E',C'GLMOU',C'MOGUL'                                           
         DC    C'H',C'HMORU',C'MOHUR'                                           
         DC    C'H',C'EIMOR',C'MOIRE'                                           
         DC    C'E',C'IMOST',C'MOIST'                                           
         DC    C'H',C'ALLMO',C'MOLAL'                                           
         DC    C'E',C'ALMOR',C'MOLAR'                                           
         DC    C'E',C'DLMOY',C'MOLDY'                                           
         DC    C'E',C'LLMOY',C'MOLLY'                                           
         DC    C'H',C'LMOOT',C'MOLTO'                                           
         DC    C'E',C'MMMOY',C'MOMMY'                                           
         DC    C'H',C'ADMNO',C'MONAD'                                           
         DC    C'E',C'EMNOY',C'MONEY'                                           
         DC    C'H',C'GMNOO',C'MONGO'                                           
         DC    C'E',C'HMNOT',C'MONTH'                                           
         DC    C'E',C'CHMOO',C'MOOCH'                                           
         DC    C'E',C'DMOOY',C'MOODY'                                           
         DC    C'H',C'DEMOO',C'MOOED'                                           
         DC    C'H',C'MNOOY',C'MOONY'                                           
         DC    C'E',C'EMOOS',C'MOOSE'                                           
         DC    C'E',C'DEMOP',C'MOPED'                                           
         DC    C'E',C'EMOPR',C'MOPER'                                           
         DC    C'E',C'EMOPY',C'MOPEY'                                           
         DC    C'E',C'ALMOR',C'MORAL'                                           
         DC    C'H',C'ELMOR',C'MOREL'                                           
         DC    C'E',C'MNOOR',C'MORON'                                           
         DC    C'H',C'HMOPR',C'MORPH'                                           
         DC    C'H',C'MOORR',C'MORRO'                                           
         DC    C'E',C'MOSSY',C'MOSSY'                                           
         DC    C'E',C'ELMOT',C'MOTEL'                                           
         DC    C'H',C'EMOTT',C'MOTET'                                           
         DC    C'H',C'HMOTY',C'MOTHY'                                           
         DC    C'E',C'FIMOT',C'MOTIF'                                           
         DC    C'E',C'MOORT',C'MOTOR'                                           
         DC    C'E',C'MOOTT',C'MOTTO'                                           
         DC    C'H',C'DLMOU',C'MOULD'                                           
         DC    C'E',C'LMOTU',C'MOULT'                                           
         DC    C'E',C'DMNOU',C'MOUND'                                           
         DC    C'E',C'MNOTU',C'MOUNT'                                           
         DC    C'E',C'MNORU',C'MOURN'                                           
         DC    C'E',C'EMOSU',C'MOUSE'                                           
         DC    C'H',C'MOSUY',C'MOUSY'                                           
         DC    C'E',C'HMOTU',C'MOUTH'                                           
         DC    C'E',C'DEMOV',C'MOVED'                                           
         DC    C'E',C'EMORV',C'MOVER'                                           
         DC    C'E',C'EIMOV',C'MOVIE'                                           
         DC    C'E',C'DEMOW',C'MOWED'                                           
         DC    C'E',C'EMORW',C'MOWER'                                           
         DC    C'H',C'CDIMU',C'MUCID'                                           
         DC    C'H',C'CIMNU',C'MUCIN'                                           
         DC    C'E',C'CKMUY',C'MUCKY'                                           
         DC    C'H',C'CMORU',C'MUCRO'                                           
         DC    C'E',C'CMSUU',C'MUCUS'                                           
         DC    C'E',C'DDMUY',C'MUDDY'                                           
         DC    C'H',C'ADMRU',C'MUDRA'                                           
         DC    C'H',C'FIMTU',C'MUFTI'                                           
         DC    C'E',C'GGMUY',C'MUGGY'                                           
         DC    C'H',C'IJKMU',C'MUJIK'                                           
         DC    C'E',C'CHLMU',C'MULCH'                                           
         DC    C'H',C'CLMTU',C'MULCT'                                           
         DC    C'H',C'ELMUY',C'MULEY'                                           
         DC    C'H',C'ALLMU',C'MULLA'                                           
         DC    C'E',C'MMMUY',C'MUMMY'                                           
         DC    C'E',C'CHMNU',C'MUNCH'                                           
         DC    C'H',C'GMNOU',C'MUNGO'                                           
         DC    C'E',C'ALMRU',C'MURAL'                                           
         DC    C'H',C'DEMRU',C'MURED'                                           
         DC    C'H',C'EMRUX',C'MUREX'                                           
         DC    C'H',C'DIMRU',C'MURID'                                           
         DC    C'E',C'KMRUY',C'MURKY'                                           
         DC    C'H',C'EMRRU',C'MURRE'                                           
         DC    C'H',C'DEMSU',C'MUSED'                                           
         DC    C'E',C'HMSUY',C'MUSHY'                                           
         DC    C'E',C'CIMSU',C'MUSIC'                                           
         DC    C'H',C'KMSUY',C'MUSKY'                                           
         DC    C'H',C'MSSUY',C'MUSSY'                                           
         DC    C'H',C'HMSTU',C'MUSTH'                                           
         DC    C'E',C'MSTUY',C'MUSTY'                                           
         DC    C'E',C'DEMTU',C'MUTED'                                           
         DC    C'H',C'AHMNY',C'MYNAH'                                           
         DC    C'H',C'AMMOY',C'MYOMA'                                           
         DC    C'H',C'EMOPY',C'MYOPE'                                           
         DC    C'H',C'HMRRY',C'MYRRH'                                           
         DC    C'H',C'ABBNO',C'NABOB'                                           
         DC    C'H',C'ACENR',C'NACRE'                                           
         DC    C'H',C'ADINR',C'NADIR'                                           
         DC    C'H',C'AADIN',C'NAIAD'                                           
         DC    C'E',C'AEINV',C'NAIVE'                                           
         DC    C'E',C'ADEKN',C'NAKED'                                           
         DC    C'E',C'ADEMN',C'NAMED'                                           
         DC    C'H',C'AEMNR',C'NAMER'                                           
         DC    C'H',C'ACENN',C'NANCE'                                           
         DC    C'E',C'ANNNY',C'NANNY'                                           
         DC    C'H',C'AENPP',C'NAPPE'                                           
         DC    C'H',C'ANPPY',C'NAPPY'                                           
         DC    C'H',C'AENRS',C'NARES'                                           
         DC    C'E',C'AALNS',C'NASAL'                                           
         DC    C'E',C'ANSTY',C'NASTY'                                           
         DC    C'E',C'AALNT',C'NATAL'                                           
         DC    C'H',C'AENST',C'NATES'                                           
         DC    C'H',C'ANTTY',C'NATTY'                                           
         DC    C'E',C'AALNV',C'NAVAL'                                           
         DC    C'E',C'AELNV',C'NAVEL'                                           
         DC    C'H',C'ANVVY',C'NAVVY'                                           
         DC    C'H',C'AABNW',C'NAWAB'                                           
         DC    C'H',C'AEHNT',C'NEATH'                                           
         DC    C'E',C'DEENY',C'NEEDY'                                           
         DC    C'E',C'EGNOR',C'NEGRO'                                           
         DC    C'H',C'EGNSU',C'NEGUS'                                           
         DC    C'H',C'EGHIN',C'NEIGH'                                           
         DC    C'E',C'EENRV',C'NERVE'                                           
         DC    C'E',C'ENRVY',C'NERVY'                                           
         DC    C'H',C'EEMNU',C'NEUME'                                           
         DC    C'E',C'EENRV',C'NEVER'                                           
         DC    C'H',C'ENSUV',C'NEVUS'                                           
         DC    C'H',C'EELNW',C'NEWEL'                                           
         DC    C'E',C'EENRW',C'NEWER'                                           
         DC    C'E',C'ELNWY',C'NEWLY'                                           
         DC    C'H',C'ENSWY',C'NEWSY'                                           
         DC    C'H',C'ENSUX',C'NEXUS'                                           
         DC    C'H',C'EEGNW',C'NGWEE'                                           
         DC    C'E',C'CEINR',C'NICER'                                           
         DC    C'H',C'CEHIN',C'NICHE'                                           
         DC    C'H',C'DINSU',C'NIDUS'                                           
         DC    C'E',C'CEEIN',C'NIECE'                                           
         DC    C'H',C'EEINV',C'NIEVE'                                           
         DC    C'E',C'GHINT',C'NIGHT'                                           
         DC    C'H',C'HIILN',C'NIHIL'                                           
         DC    C'E',C'INNNY',C'NINNY'                                           
         DC    C'H',C'INNNO',C'NINON'                                           
         DC    C'E',C'HINNT',C'NINTH'                                           
         DC    C'E',C'INPPY',C'NIPPY'                                           
         DC    C'H',C'INSSU',C'NISUS'                                           
         DC    C'H',C'EINRT',C'NITER'                                           
         DC    C'H',C'INNOT',C'NITON'                                           
         DC    C'H',C'EINRT',C'NITRE'                                           
         DC    C'H',C'INORT',C'NITRO'                                           
         DC    C'H',C'INTTY',C'NITTY'                                           
         DC    C'E',C'DEINX',C'NIXED'                                           
         DC    C'H',C'EIINX',C'NIXIE'                                           
         DC    C'H',C'BBNOY',C'NOBBY'                                           
         DC    C'E',C'BELNO',C'NOBLE'                                           
         DC    C'E',C'BLNOY',C'NOBLY'                                           
         DC    C'H',C'ADLNO',C'NODAL'                                           
         DC    C'H',C'DDNOY',C'NODDY'                                           
         DC    C'H',C'DNOSU',C'NODUS'                                           
         DC    C'E',C'HNOOW',C'NOHOW'                                           
         DC    C'E',C'EINOS',C'NOISE'                                           
         DC    C'E',C'INOSY',C'NOISY'                                           
         DC    C'H',C'EMNNO',C'NOMEN'                                           
         DC    C'H',C'CENNO',C'NONCE'                                           
         DC    C'E',C'ENOOS',C'NOOSE'                                           
         DC    C'H',C'ALNOP',C'NOPAL'                                           
         DC    C'H',C'AINOR',C'NORIA'                                           
         DC    C'E',C'HNORT',C'NORTH'                                           
         DC    C'E',C'DENOS',C'NOSED'                                           
         DC    C'E',C'ENOSY',C'NOSEY'                                           
         DC    C'E',C'CHNOT',C'NOTCH'                                           
         DC    C'E',C'DENOT',C'NOTED'                                           
         DC    C'H',C'MNOTU',C'NOTUM'                                           
         DC    C'H',C'AENOV',C'NOVAE'                                           
         DC    C'E',C'ELNOV',C'NOVEL'                                           
         DC    C'H',C'ANOWY',C'NOWAY'                                           
         DC    C'H',C'BBNUY',C'NUBBY'                                           
         DC    C'H',C'ACHNU',C'NUCHA'                                           
         DC    C'E',C'DEGNU',C'NUDGE'                                           
         DC    C'H',C'EMNNU',C'NUMEN'                                           
         DC    C'E',C'ENRSU',C'NURSE'                                           
         DC    C'E',C'NTTUY',C'NUTTY'                                           
         DC    C'H',C'AALNY',C'NYALA'                                           
         DC    C'E',C'LNNOY',C'NYLON'                                           
         DC    C'E',C'HMNPY',C'NYMPH'                                           
         DC    C'E',C'AEKNO',C'OAKEN'                                           
         DC    C'H',C'AKMOU',C'OAKUM'                                           
         DC    C'E',C'ADEOR',C'OARED'                                           
         DC    C'E',C'AIOSS',C'OASIS'                                           
         DC    C'H',C'AENOT',C'OATEN'                                           
         DC    C'E',C'BEEOS',C'OBESE'                                           
         DC    C'E',C'CCORU',C'OCCUR'                                           
         DC    C'E',C'ACENO',C'OCEAN'                                           
         DC    C'H',C'CEHOR',C'OCHER'                                           
         DC    C'H',C'CEHOR',C'OCHRE'                                           
         DC    C'H',C'ACEOR',C'OCREA'                                           
         DC    C'H',C'ACDOT',C'OCTAD'                                           
         DC    C'E',C'ACLOT',C'OCTAL'                                           
         DC    C'E',C'CEOTT',C'OCTET'                                           
         DC    C'E',C'DDEOR',C'ODDER'                                           
         DC    C'E',C'DDLOY',C'ODDLY'                                           
         DC    C'H',C'DEMOU',C'ODEUM'                                           
         DC    C'H',C'DIMOU',C'ODIUM'                                           
         DC    C'E',C'DOORU',C'ODOUR'                                           
         DC    C'H',C'AFFLO',C'OFFAL'                                           
         DC    C'H',C'DEFFO',C'OFFED'                                           
         DC    C'E',C'EFFOR',C'OFFER'                                           
         DC    C'E',C'EFNOT',C'OFTEN'                                           
         DC    C'H',C'AGHMO',C'OGHAM'                                           
         DC    C'H',C'EGIOV',C'OGIVE'                                           
         DC    C'E',C'DEGLO',C'OGLED'                                           
         DC    C'H',C'EGLOR',C'OGLER'                                           
         DC    C'H',C'CHIMO',C'OHMIC'                                           
         DC    C'E',C'DEILO',C'OILED'                                           
         DC    C'E',C'EILOR',C'OILER'                                           
         DC    C'H',C'AIKOP',C'OKAPI'                                           
         DC    C'E',C'DELNO',C'OLDEN'                                           
         DC    C'E',C'DELOR',C'OLDER'                                           
         DC    C'H',C'CEILO',C'OLEIC'                                           
         DC    C'H',C'EILNO',C'OLEIN'                                           
         DC    C'E',C'EILOV',C'OLIVE'                                           
         DC    C'H',C'GLOOY',C'OLOGY'                                           
         DC    C'H',C'BEMOR',C'OMBER'                                           
         DC    C'H',C'BEMOR',C'OMBRE'                                           
         DC    C'E',C'AEGMO',C'OMEGA'                                           
         DC    C'E',C'INNOO',C'ONION'                                           
         DC    C'E',C'ENOST',C'ONSET'                                           
         DC    C'H',C'CINOT',C'ONTIC'                                           
         DC    C'H',C'DIOOT',C'OOTID'                                           
         DC    C'E',C'DEOOZ',C'OOZED'                                           
         DC    C'E',C'AEOPR',C'OPERA'                                           
         DC    C'H',C'EINOP',C'OPINE'                                           
         DC    C'H',C'GINOP',C'OPING'                                           
         DC    C'E',C'IMOPU',C'OPIUM'                                           
         DC    C'E',C'DEOPT',C'OPTED'                                           
         DC    C'E',C'CIOPT',C'OPTIC'                                           
         DC    C'H',C'ACHOR',C'ORACH'                                           
         DC    C'H',C'AGNOR',C'ORANG'                                           
         DC    C'E',C'AEORT',C'ORATE'                                           
         DC    C'H',C'BDEOR',C'ORBED'                                           
         DC    C'E',C'BIORT',C'ORBIT'                                           
         DC    C'E',C'DEORR',C'ORDER'                                           
         DC    C'H',C'ADEOR',C'OREAD'                                           
         DC    C'E',C'AGNOR',C'ORGAN'                                           
         DC    C'H',C'BIIOR',C'ORIBI'                                           
         DC    C'H',C'EILOR',C'ORIEL'                                           
         DC    C'H',C'LOOPR',C'ORLOP'                                           
         DC    C'H',C'EMORR',C'ORMER'                                           
         DC    C'H',C'INORS',C'ORNIS'                                           
         DC    C'H',C'IORRS',C'ORRIS'                                           
         DC    C'H',C'EIORS',C'OSIER'                                           
         DC    C'E',C'EHORT',C'OTHER'                                           
         DC    C'E',C'EORTT',C'OTTER'                                           
         DC    C'E',C'GHOTU',C'OUGHT'                                           
         DC    C'E',C'CENOU',C'OUNCE'                                           
         DC    C'H',C'EHOPU',C'OUPHE'                                           
         DC    C'H',C'ELOSU',C'OUSEL'                                           
         DC    C'E',C'DOOTU',C'OUTDO'                                           
         DC    C'E',C'EORTU',C'OUTER'                                           
         DC    C'E',C'GOOTU',C'OUTGO'                                           
         DC    C'H',C'ELOUZ',C'OUZEL'                                           
         DC    C'E',C'AORVY',C'OVARY'                                           
         DC    C'H',C'AEOTV',C'OVATE'                                           
         DC    C'E',C'EORTV',C'OVERT'                                           
         DC    C'H',C'EINOV',C'OVINE'                                           
         DC    C'H',C'DIOOV',C'OVOID'                                           
         DC    C'H',C'LOOOV',C'OVOLO'                                           
         DC    C'H',C'ELOUV',C'OVULE'                                           
         DC    C'E',C'GINOW',C'OWING'                                           
         DC    C'H',C'ELOTW',C'OWLET'                                           
         DC    C'E',C'DENOW',C'OWNED'                                           
         DC    C'E',C'ENORW',C'OWNER'                                           
         DC    C'H',C'BOOWX',C'OXBOW'                                           
         DC    C'H',C'EEOXY',C'OXEYE'                                           
         DC    C'E',C'DEIOX',C'OXIDE'                                           
         DC    C'H',C'EIMOX',C'OXIME'                                           
         DC    C'H',C'ILOPX',C'OXLIP'                                           
         DC    C'E',C'ENOOZ',C'OZONE'                                           
         DC    C'E',C'ACDEP',C'PACED'                                           
         DC    C'H',C'ACEPR',C'PACER'                                           
         DC    C'H',C'AACHP',C'PACHA'                                           
         DC    C'E',C'ADDPY',C'PADDY'                                           
         DC    C'E',C'ADEPR',C'PADRE'                                           
         DC    C'H',C'ADIPR',C'PADRI'                                           
         DC    C'H',C'AAENP',C'PAEAN'                                           
         DC    C'H',C'AENOP',C'PAEON'                                           
         DC    C'E',C'AAGNP',C'PAGAN'                                           
         DC    C'E',C'ADEGP',C'PAGED'                                           
         DC    C'E',C'AINPT',C'PAINT'                                           
         DC    C'H',C'AAIPS',C'PAISA'                                           
         DC    C'H',C'AEIPS',C'PAISE'                                           
         DC    C'H',C'AAELP',C'PALEA'                                           
         DC    C'E',C'AELPR',C'PALER'                                           
         DC    C'H',C'ALMPY',C'PALMY'                                           
         DC    C'E',C'ALPSY',C'PALSY'                                           
         DC    C'E',C'AADNP',C'PANDA'                                           
         DC    C'H',C'ADNPY',C'PANDY'                                           
         DC    C'H',C'ADENP',C'PANED'                                           
         DC    C'E',C'AELNP',C'PANEL'                                           
         DC    C'H',C'AAGNP',C'PANGA'                                           
         DC    C'E',C'ACINP',C'PANIC'                                           
         DC    C'H',C'AENNP',C'PANNE'                                           
         DC    C'E',C'ANPSY',C'PANSY'                                           
         DC    C'H',C'AALPP',C'PAPAL'                                           
         DC    C'H',C'AAPPW',C'PAPAW'                                           
         DC    C'E',C'AEPPR',C'PAPER'                                           
         DC    C'E',C'APPPY',C'PAPPY'                                           
         DC    C'E',C'ACHPR',C'PARCH'                                           
         DC    C'H',C'ADIPR',C'PARDI'                                           
         DC    C'H',C'ADEPR',C'PARED'                                           
         DC    C'H',C'AEPRU',C'PAREU'                                           
         DC    C'H',C'AEGPR',C'PARGE'                                           
         DC    C'E',C'AAKPR',C'PARKA'                                           
         DC    C'H',C'ALOPR',C'PAROL'                                           
         DC    C'E',C'APRRY',C'PARRY'                                           
         DC    C'H',C'AEPRS',C'PARSE'                                           
         DC    C'E',C'APRTY',C'PARTY'                                           
         DC    C'H',C'AEPRV',C'PARVE'                                           
         DC    C'H',C'AAHPS',C'PASHA'                                           
         DC    C'H',C'AEPSS',C'PASSE'                                           
         DC    C'E',C'AAPST',C'PASTA'                                           
         DC    C'E',C'AEPST',C'PASTE'                                           
         DC    C'E',C'APSTY',C'PASTY'                                           
         DC    C'E',C'ACHPT',C'PATCH'                                           
         DC    C'H',C'AENPT',C'PATEN'                                           
         DC    C'H',C'AEPRT',C'PATER'                                           
         DC    C'E',C'AIOPT',C'PATIO'                                           
         DC    C'E',C'APSTY',C'PATSY'                                           
         DC    C'E',C'APTTY',C'PATTY'                                           
         DC    C'E',C'AEPSU',C'PAUSE'                                           
         DC    C'E',C'ADEPV',C'PAVED'                                           
         DC    C'H',C'AEPRV',C'PAVER'                                           
         DC    C'H',C'ADIPV',C'PAVID'                                           
         DC    C'H',C'AINPV',C'PAVIN'                                           
         DC    C'H',C'AIPSV',C'PAVIS'                                           
         DC    C'E',C'ADEPW',C'PAWED'                                           
         DC    C'H',C'AEPRW',C'PAWER'                                           
         DC    C'H',C'AKPWY',C'PAWKY'                                           
         DC    C'H',C'ADEPY',C'PAYED'                                           
         DC    C'E',C'AEEPY',C'PAYEE'                                           
         DC    C'E',C'AEPRY',C'PAYER'                                           
         DC    C'E',C'ACEEP',C'PEACE'                                           
         DC    C'E',C'ACEHP',C'PEACH'                                           
         DC    C'E',C'AELPR',C'PEARL'                                           
         DC    C'H',C'AEPRT',C'PEART'                                           
         DC    C'H',C'AEEPS',C'PEASE'                                           
         DC    C'H',C'AEPTY',C'PEATY'                                           
         DC    C'E',C'ACENP',C'PECAN'                                           
         DC    C'E',C'ADELP',C'PEDAL'                                           
         DC    C'H',C'AEKNP',C'PEKAN'                                           
         DC    C'H',C'EIKNP',C'PEKIN'                                           
         DC    C'E',C'EEKOP',C'PEKOE'                                           
         DC    C'E',C'AELNP',C'PENAL'                                           
         DC    C'H',C'CEENP',C'PENCE'                                           
         DC    C'H',C'EENPS',C'PENES'                                           
         DC    C'H',C'EGNOP',C'PENGO'                                           
         DC    C'E',C'EINPS',C'PENIS'                                           
         DC    C'H',C'AENNP',C'PENNA'                                           
         DC    C'H',C'EINNP',C'PENNI'                                           
         DC    C'E',C'ENNPY',C'PENNY'                                           
         DC    C'H',C'ENOPY',C'PEONY'                                           
         DC    C'E',C'CEHPR',C'PERCH'                                           
         DC    C'H',C'DEPRU',C'PERDU'                                           
         DC    C'E',C'EILPR',C'PERIL'                                           
         DC    C'E',C'EKPRY',C'PERKY'                                           
         DC    C'H',C'EPRRY',C'PERRY'                                           
         DC    C'H',C'EEPRS',C'PERSE'                                           
         DC    C'E',C'EKPSY',C'PESKY'                                           
         DC    C'E',C'AELPT',C'PETAL'                                           
         DC    C'E',C'EEPRT',C'PETER'                                           
         DC    C'H',C'EIPTT',C'PETIT'                                           
         DC    C'E',C'EPTTY',C'PETTY'                                           
         DC    C'H',C'EIPTW',C'PEWIT'                                           
         DC    C'H',C'AEGHP',C'PHAGE'                                           
         DC    C'E',C'AEHPS',C'PHASE'                                           
         DC    C'H',C'AHILP',C'PHIAL'                                           
         DC    C'H',C'HLOPX',C'PHLOX'                                           
         DC    C'E',C'EHNOP',C'PHONE'                                           
         DC    C'E',C'HNOPY',C'PHONY'                                           
         DC    C'E',C'HOOPT',C'PHOTO'                                           
         DC    C'H',C'AHLPY',C'PHYLA'                                           
         DC    C'H',C'EHLPY',C'PHYLE'                                           
         DC    C'E',C'AINOP',C'PIANO'                                           
         DC    C'H',C'CIOPT',C'PICOT'                                           
         DC    C'H',C'CILPU',C'PICUL'                                           
         DC    C'E',C'CEEIP',C'PIECE'                                           
         DC    C'E',C'EIPTY',C'PIETY'                                           
         DC    C'E',C'GGIPY',C'PIGGY'                                           
         DC    C'H',C'GIMPY',C'PIGMY'                                           
         DC    C'H',C'GIINP',C'PIING'                                           
         DC    C'E',C'DEIKP',C'PIKED'                                           
         DC    C'E',C'EIKPR',C'PIKER'                                           
         DC    C'H',C'AFILP',C'PILAF'                                           
         DC    C'H',C'AILPU',C'PILAU'                                           
         DC    C'H',C'AILPW',C'PILAW'                                           
         DC    C'E',C'DEILP',C'PILED'                                           
         DC    C'E',C'ILOPT',C'PILOT'                                           
         DC    C'E',C'CHINP',C'PINCH'                                           
         DC    C'H',C'DEINP',C'PINED'                                           
         DC    C'H',C'EINPY',C'PINEY'                                           
         DC    C'E',C'IKNOP',C'PINKO'                                           
         DC    C'E',C'IKNPY',C'PINKY'                                           
         DC    C'H',C'AINNP',C'PINNA'                                           
         DC    C'H',C'AINPT',C'PINTA'                                           
         DC    C'E',C'INOPT',C'PINTO'                                           
         DC    C'E',C'INPPU',C'PINUP'                                           
         DC    C'E',C'IOPSU',C'PIOUS'                                           
         DC    C'H',C'AILPP',C'PIPAL'                                           
         DC    C'E',C'DEIPP',C'PIPED'                                           
         DC    C'E',C'EIPPR',C'PIPER'                                           
         DC    C'H',C'EIPPT',C'PIPET'                                           
         DC    C'H',C'IIPPT',C'PIPIT'                                           
         DC    C'H',C'EIPQU',C'PIQUE'                                           
         DC    C'E',C'CHIPT',C'PITCH'                                           
         DC    C'E',C'HIPTY',C'PITHY'                                           
         DC    C'H',C'INOPT',C'PITON'                                           
         DC    C'E',C'IOPTV',C'PIVOT'                                           
         DC    C'E',C'EIIPX',C'PIXIE'                                           
         DC    C'E',C'AIPZZ',C'PIZZA'                                           
         DC    C'E',C'ACELP',C'PLACE'                                           
         DC    C'H',C'AEGLP',C'PLAGE'                                           
         DC    C'E',C'ADILP',C'PLAID'                                           
         DC    C'E',C'AILNP',C'PLAIN'                                           
         DC    C'H',C'AILPT',C'PLAIT'                                           
         DC    C'E',C'AELNP',C'PLANE'                                           
         DC    C'E',C'AKLNP',C'PLANK'                                           
         DC    C'E',C'ALNPT',C'PLANT'                                           
         DC    C'H',C'AHLPS',C'PLASH'                                           
         DC    C'H',C'ALMPS',C'PLASM'                                           
         DC    C'E',C'AELPT',C'PLATE'                                           
         DC    C'H',C'ALPTY',C'PLATY'                                           
         DC    C'E',C'AALPZ',C'PLAZA'                                           
         DC    C'E',C'ADELP',C'PLEAD'                                           
         DC    C'E',C'AELPT',C'PLEAT'                                           
         DC    C'H',C'BEELP',C'PLEBE'                                           
         DC    C'H',C'ACILP',C'PLICA'                                           
         DC    C'H',C'DEILP',C'PLIED'                                           
         DC    C'H',C'EILPR',C'PLIER'                                           
         DC    C'H',C'EILPS',C'PLIES'                                           
         DC    C'H',C'KLNOP',C'PLONK'                                           
         DC    C'E',C'CKLPU',C'PLUCK'                                           
         DC    C'E',C'BLMPU',C'PLUMB'                                           
         DC    C'E',C'ELMPU',C'PLUME'                                           
         DC    C'E',C'LMPPU',C'PLUMP'                                           
         DC    C'H',C'LMPUY',C'PLUMY'                                           
         DC    C'E',C'KLNPU',C'PLUNK'                                           
         DC    C'E',C'HLPSU',C'PLUSH'                                           
         DC    C'E',C'ACHOP',C'POACH'                                           
         DC    C'H',C'CKOPY',C'POCKY'                                           
         DC    C'H',C'DGOPY',C'PODGY'                                           
         DC    C'H',C'ADIOP',C'PODIA'                                           
         DC    C'H',C'EOPSY',C'POESY'                                           
         DC    C'H',C'ILOPU',C'POILU'                                           
         DC    C'E',C'INOPT',C'POINT'                                           
         DC    C'E',C'EIOPS',C'POISE'                                           
         DC    C'E',C'DEKOP',C'POKED'                                           
         DC    C'E',C'EKOPR',C'POKER'                                           
         DC    C'E',C'ALOPR',C'POLAR'                                           
         DC    C'E',C'DELOP',C'POLED'                                           
         DC    C'H',C'ELOPR',C'POLER'                                           
         DC    C'E',C'ILOOP',C'POLIO'                                           
         DC    C'H',C'ILOPS',C'POLIS'                                           
         DC    C'E',C'AKLOP',C'POLKA'                                           
         DC    C'H',C'LOPPY',C'POLYP'                                           
         DC    C'H',C'CENOP',C'PONCE'                                           
         DC    C'E',C'OPPPY',C'POPPY'                                           
         DC    C'E',C'CHOPR',C'PORCH'                                           
         DC    C'H',C'DEOPR',C'PORED'                                           
         DC    C'E',C'KOPRY',C'PORKY'                                           
         DC    C'E',C'NOOPR',C'PORNO'                                           
         DC    C'E',C'DEOPS',C'POSED'                                           
         DC    C'H',C'EOPRS',C'POSER'                                           
         DC    C'E',C'EOPSS',C'POSSE'                                           
         DC    C'H',C'OOPTT',C'POTTO'                                           
         DC    C'E',C'OPTTY',C'POTTY'                                           
         DC    C'E',C'CHOPU',C'POUCH'                                           
         DC    C'H',C'FFOPU',C'POUFF'                                           
         DC    C'H',C'LOPTU',C'POULT'                                           
         DC    C'E',C'DNOPU',C'POUND'                                           
         DC    C'E',C'EOPRW',C'POWER'                                           
         DC    C'H',C'AGNPR',C'PRANG'                                           
         DC    C'H',C'AEPRS',C'PRASE'                                           
         DC    C'H',C'AEPRT',C'PRATE'                                           
         DC    C'E',C'ANPRW',C'PRAWN'                                           
         DC    C'H',C'EENPR',C'PREEN'                                           
         DC    C'H',C'AEPRS',C'PRESA'                                           
         DC    C'E',C'EPRSS',C'PRESS'                                           
         DC    C'H',C'EPRST',C'PREST'                                           
         DC    C'E',C'CEIPR',C'PRICE'                                           
         DC    C'E',C'CIKPR',C'PRICK'                                           
         DC    C'E',C'DEIPR',C'PRIDE'                                           
         DC    C'E',C'DEIPR',C'PRIED'                                           
         DC    C'H',C'EIPRR',C'PRIER'                                           
         DC    C'H',C'EIPRS',C'PRIES'                                           
         DC    C'H',C'ILLPR',C'PRILL'                                           
         DC    C'E',C'EIMPR',C'PRIME'                                           
         DC    C'E',C'IMPPR',C'PRIMP'                                           
         DC    C'H',C'IKNPR',C'PRINK'                                           
         DC    C'E',C'INPRT',C'PRINT'                                           
         DC    C'E',C'IOPRR',C'PRIOR'                                           
         DC    C'H',C'EIPRS',C'PRISE'                                           
         DC    C'E',C'IMPRS',C'PRISM'                                           
         DC    C'H',C'IPRVY',C'PRIVY'                                           
         DC    C'E',C'EIPRZ',C'PRIZE'                                           
         DC    C'E',C'BEOPR',C'PROBE'                                           
         DC    C'H',C'EMOPR',C'PROEM'                                           
         DC    C'H',C'ELOPR',C'PROLE'                                           
         DC    C'E',C'ENOPR',C'PRONE'                                           
         DC    C'E',C'GNOPR',C'PRONG'                                           
         DC    C'E',C'FOOPR',C'PROOF'                                           
         DC    C'E',C'EOPRS',C'PROSE'                                           
         DC    C'H',C'OPRSY',C'PROSY'                                           
         DC    C'E',C'DOPRU',C'PROUD'                                           
         DC    C'E',C'EOPRV',C'PROVE'                                           
         DC    C'E',C'LOPRW',C'PROWL'                                           
         DC    C'E',C'OPRXY',C'PROXY'                                           
         DC    C'E',C'DEPRU',C'PRUDE'                                           
         DC    C'E',C'ENPRU',C'PRUNE'                                           
         DC    C'H',C'APRTU',C'PRUTA'                                           
         DC    C'H',C'EPRRY',C'PRYER'                                           
         DC    C'E',C'ALMPS',C'PSALM'                                           
         DC    C'H',C'AHPSW',C'PSHAW'                                           
         DC    C'H',C'AOPSS',C'PSOAS'                                           
         DC    C'H',C'BEPSU',C'PUBES'                                           
         DC    C'E',C'BCIPU',C'PUBIC'                                           
         DC    C'H',C'BIPSU',C'PUBIS'                                           
         DC    C'H',C'ACKPU',C'PUCKA'                                           
         DC    C'E',C'DGPUY',C'PUDGY'                                           
         DC    C'E',C'FFPUY',C'PUFFY'                                           
         DC    C'E',C'DEKPU',C'PUKED'                                           
         DC    C'H',C'AKKPU',C'PUKKA'                                           
         DC    C'H',C'DELPU',C'PULED'                                           
         DC    C'H',C'IKLPU',C'PULIK'                                           
         DC    C'H',C'LPPUY',C'PULPY'                                           
         DC    C'E',C'ELPSU',C'PULSE'                                           
         DC    C'E',C'CHNPU',C'PUNCH'                                           
         DC    C'H',C'AKNPU',C'PUNKA'                                           
         DC    C'H',C'NPTUY',C'PUNTY'                                           
         DC    C'H',C'AEPPU',C'PUPAE'                                           
         DC    C'E',C'ILPPU',C'PUPIL'                                           
         DC    C'E',C'PPPUY',C'PUPPY'                                           
         DC    C'H',C'EEPRU',C'PUREE'                                           
         DC    C'E',C'EPRRU',C'PURER'                                           
         DC    C'E',C'EGPRU',C'PURGE'                                           
         DC    C'E',C'EPRSU',C'PURSE'                                           
         DC    C'H',C'PRSUY',C'PURSY'                                           
         DC    C'E',C'HPSUY',C'PUSHY'                                           
         DC    C'E',C'PSSUY',C'PUSSY'                                           
         DC    C'E',C'PTTUY',C'PUTTY'                                           
         DC    C'H',C'GMPYY',C'PYGMY'                                           
         DC    C'H',C'LNOPY',C'PYLON'                                           
         DC    C'H',C'DIOPY',C'PYOID'                                           
         DC    C'H',C'ANPRY',C'PYRAN'                                           
         DC    C'H',C'IPSXY',C'PYXIS'                                           
         DC    C'E',C'ACKQU',C'QUACK'                                           
         DC    C'H',C'AFFQU',C'QUAFF'                                           
         DC    C'E',C'AILQU',C'QUAIL'                                           
         DC    C'E',C'AEKQU',C'QUAKE'                                           
         DC    C'H',C'AKQUY',C'QUAKY'                                           
         DC    C'H',C'AELQU',C'QUALE'                                           
         DC    C'E',C'ALMQU',C'QUALM'                                           
         DC    C'H',C'ANQTU',C'QUANT'                                           
         DC    C'E',C'AKQRU',C'QUARK'                                           
         DC    C'E',C'AQRTU',C'QUART'                                           
         DC    C'E',C'AHQSU',C'QUASH'                                           
         DC    C'E',C'AIQSU',C'QUASI'                                           
         DC    C'H',C'AQSSU',C'QUASS'                                           
         DC    C'H',C'AENQU',C'QUEAN'                                           
         DC    C'E',C'EENQU',C'QUEEN'                                           
         DC    C'E',C'EEQRU',C'QUEER'                                           
         DC    C'E',C'ELLQU',C'QUELL'                                           
         DC    C'H',C'ENQRU',C'QUERN'                                           
         DC    C'E',C'EQRUY',C'QUERY'                                           
         DC    C'E',C'EQSTU',C'QUEST'                                           
         DC    C'E',C'EEQUU',C'QUEUE'                                           
         DC    C'E',C'CIKQU',C'QUICK'                                           
         DC    C'E',C'EIQTU',C'QUIET'                                           
         DC    C'H',C'FFIQU',C'QUIFF'                                           
         DC    C'E',C'ILLQU',C'QUILL'                                           
         DC    C'E',C'ILQTU',C'QUILT'                                           
         DC    C'H',C'INQTU',C'QUINT'                                           
         DC    C'H',C'IPQUU',C'QUIPU'                                           
         DC    C'H',C'EIQRU',C'QUIRE'                                           
         DC    C'E',C'IKQRU',C'QUIRK'                                           
         DC    C'E',C'EIQTU',C'QUITE'                                           
         DC    C'H',C'INOQU',C'QUOIN'                                           
         DC    C'H',C'IOQTU',C'QUOIT'                                           
         DC    C'E',C'AOQTU',C'QUOTA'                                           
         DC    C'E',C'EOQTU',C'QUOTE'                                           
         DC    C'H',C'HOQTU',C'QUOTH'                                           
         DC    C'H',C'HQRSU',C'QURSH'                                           
         DC    C'E',C'ABBIR',C'RABBI'                                           
         DC    C'E',C'ABDIR',C'RABID'                                           
         DC    C'E',C'ACDER',C'RACED'                                           
         DC    C'E',C'ACERR',C'RACER'                                           
         DC    C'E',C'AADRR',C'RADAR'                                           
         DC    C'H',C'ADIIR',C'RADII'                                           
         DC    C'E',C'ADIOR',C'RADIO'                                           
         DC    C'H',C'ADIRX',C'RADIX'                                           
         DC    C'H',C'ADNOR',C'RADON'                                           
         DC    C'E',C'ADEGR',C'RAGED'                                           
         DC    C'H',C'AGGRY',C'RAGGY'                                           
         DC    C'E',C'AINRY',C'RAINY'                                           
         DC    C'E',C'AEIRS',C'RAISE'                                           
         DC    C'H',C'AAHJR',C'RAJAH'                                           
         DC    C'E',C'ADEKR',C'RAKED'                                           
         DC    C'H',C'AEEKR',C'RAKEE'                                           
         DC    C'E',C'ALLRY',C'RALLY'                                           
         DC    C'H',C'AEMRT',C'RAMET'                                           
         DC    C'H',C'AEIMR',C'RAMIE'                                           
         DC    C'E',C'ACHNR',C'RANCH'                                           
         DC    C'E',C'ADNRY',C'RANDY'                                           
         DC    C'E',C'AEGNR',C'RANGE'                                           
         DC    C'H',C'AGNRY',C'RANGY'                                           
         DC    C'H',C'ADINR',C'RANID'                                           
         DC    C'E',C'ADEPR',C'RAPED'                                           
         DC    C'H',C'AEHPR',C'RAPHE'                                           
         DC    C'E',C'ADIPR',C'RAPID'                                           
         DC    C'E',C'AERRR',C'RARER'                                           
         DC    C'H',C'ADERS',C'RASED'                                           
         DC    C'E',C'APRSY',C'RASPY'                                           
         DC    C'H',C'AANRT',C'RATAN'                                           
         DC    C'E',C'ADERT',C'RATED'                                           
         DC    C'H',C'AELRT',C'RATEL'                                           
         DC    C'H',C'AEHRT',C'RATHE'                                           
         DC    C'E',C'AIORT',C'RATIO'                                           
         DC    C'H',C'ARTTY',C'RATTY'                                           
         DC    C'E',C'ADERV',C'RAVED'                                           
         DC    C'H',C'AELRV',C'RAVEL'                                           
         DC    C'E',C'AENRV',C'RAVEN'                                           
         DC    C'H',C'AERRV',C'RAVER'                                           
         DC    C'H',C'AINRV',C'RAVIN'                                           
         DC    C'H',C'ALRWY',C'RAWLY'                                           
         DC    C'E',C'ANORY',C'RAYON'                                           
         DC    C'E',C'ADERZ',C'RAZED'                                           
         DC    C'H',C'AEERZ',C'RAZEE'                                           
         DC    C'E',C'AORRZ',C'RAZOR'                                           
         DC    C'E',C'ACEHR',C'REACH'                                           
         DC    C'E',C'ACERT',C'REACT'                                           
         DC    C'E',C'ADERY',C'READY'                                           
         DC    C'H',C'AELMR',C'REALM'                                           
         DC    C'E',C'AEMRR',C'REARM'                                           
         DC    C'H',C'AAERT',C'REATA'                                           
         DC    C'H',C'AEERV',C'REAVE'                                           
         DC    C'H',C'BCEER',C'REBEC'                                           
         DC    C'E',C'BEELR',C'REBEL'                                           
         DC    C'E',C'BDEIR',C'REBID'                                           
         DC    C'E',C'BERSU',C'REBUS'                                           
         DC    C'H',C'BERTU',C'REBUT'                                           
         DC    C'E',C'ACEPR',C'RECAP'                                           
         DC    C'E',C'CENOR',C'RECON'                                           
         DC    C'H',C'ACERT',C'RECTA'                                           
         DC    C'H',C'CEIRT',C'RECTI'                                           
         DC    C'H',C'CEORT',C'RECTO'                                           
         DC    C'E',C'CERRU',C'RECUR'                                           
         DC    C'H',C'ADENR',C'REDAN'                                           
         DC    C'H',C'ADEIR',C'REDIA'                                           
         DC    C'E',C'DDEIR',C'REDID'                                           
         DC    C'H',C'DEORX',C'REDOX'                                           
         DC    C'E',C'DERRY',C'REDRY'                                           
         DC    C'E',C'DEERY',C'REDYE'                                           
         DC    C'E',C'DEERY',C'REEDY'                                           
         DC    C'E',C'EEKRY',C'REEKY'                                           
         DC    C'H',C'EEERV',C'REEVE'                                           
         DC    C'E',C'EEFRR',C'REFER'                                           
         DC    C'E',C'EFIRT',C'REFIT'                                           
         DC    C'E',C'EFIRX',C'REFIX'                                           
         DC    C'E',C'EFRRY',C'REFRY'                                           
         DC    C'E',C'AEGLR',C'REGAL'                                           
         DC    C'H',C'EEGRS',C'REGES'                                           
         DC    C'H',C'EFIRY',C'REIFY'                                           
         DC    C'E',C'EGINR',C'REIGN'                                           
         DC    C'H',C'EEIRV',C'REIVE'                                           
         DC    C'E',C'AELRX',C'RELAX'                                           
         DC    C'E',C'AELRY',C'RELAY'                                           
         DC    C'E',C'EELRT',C'RELET'                                           
         DC    C'E',C'CEILR',C'RELIC'                                           
         DC    C'E',C'EILRT',C'RELIT'                                           
         DC    C'H',C'AEMNR',C'REMAN'                                           
         DC    C'E',C'AEMPR',C'REMAP'                                           
         DC    C'E',C'EIMRT',C'REMIT'                                           
         DC    C'E',C'EIMRX',C'REMIX'                                           
         DC    C'E',C'AELNR',C'RENAL'                                           
         DC    C'E',C'EENRW',C'RENEW'                                           
         DC    C'H',C'EINNR',C'RENIN'                                           
         DC    C'E',C'AEPRY',C'REPAY'                                           
         DC    C'E',C'EELPR',C'REPEL'                                           
         DC    C'E',C'ELPRY',C'REPLY'                                           
         DC    C'H',C'EOPRR',C'REPRO'                                           
         DC    C'H',C'AENRR',C'RERAN'                                           
         DC    C'E',C'ENRRU',C'RERUN'                                           
         DC    C'E',C'EERST',C'RESET'                                           
         DC    C'E',C'EERSW',C'RESEW'                                           
         DC    C'H',C'EINRS',C'RESIN'                                           
         DC    C'H',C'EORSW',C'RESOW'                                           
         DC    C'E',C'CEHRT',C'RETCH'                                           
         DC    C'H',C'EEMRT',C'RETEM'                                           
         DC    C'E',C'EEIRT',C'RETIE'                                           
         DC    C'E',C'ERRTY',C'RETRY'                                           
         DC    C'E',C'EERSU',C'REUSE'                                           
         DC    C'E',C'EELRV',C'REVEL'                                           
         DC    C'H',C'EERTV',C'REVET'                                           
         DC    C'E',C'EERUV',C'REVUE'                                           
         DC    C'H',C'EINRW',C'REWIN'                                           
         DC    C'H',C'ENORW',C'REWON'                                           
         DC    C'H',C'EHMRU',C'RHEUM'                                           
         DC    C'E',C'HINOR',C'RHINO'                                           
         DC    C'H',C'BHMOR',C'RHOMB'                                           
         DC    C'H',C'BHMRU',C'RHUMB'                                           
         DC    C'E',C'EHMRY',C'RHYME'                                           
         DC    C'H',C'AINRT',C'RIANT'                                           
         DC    C'H',C'CDEIR',C'RICED'                                           
         DC    C'H',C'CIINR',C'RICIN'                                           
         DC    C'E',C'DEIRR',C'RIDER'                                           
         DC    C'E',C'DEGIR',C'RIDGE'                                           
         DC    C'H',C'DGIRY',C'RIDGY'                                           
         DC    C'E',C'EFILR',C'RIFLE'                                           
         DC    C'E',C'GHIRT',C'RIGHT'                                           
         DC    C'E',C'DGIIR',C'RIGID'                                           
         DC    C'E',C'GIORR',C'RIGOR'                                           
         DC    C'E',C'DEILR',C'RILED'                                           
         DC    C'H',C'EILLR',C'RILLE'                                           
         DC    C'H',C'DEIMR',C'RIMED'                                           
         DC    C'E',C'EINRS',C'RINSE'                                           
         DC    C'E',C'EINPR',C'RIPEN'                                           
         DC    C'H',C'EIPRR',C'RIPER'                                           
         DC    C'E',C'EINRS',C'RISEN'                                           
         DC    C'E',C'EIRRS',C'RISER'                                           
         DC    C'E',C'IKRSY',C'RISKY'                                           
         DC    C'E',C'AILRV',C'RIVAL'                                           
         DC    C'H',C'DEIRV',C'RIVED'                                           
         DC    C'H',C'EINRV',C'RIVEN'                                           
         DC    C'E',C'EIRRV',C'RIVER'                                           
         DC    C'E',C'EIRTV',C'RIVET'                                           
         DC    C'H',C'AILRY',C'RIYAL'                                           
         DC    C'E',C'ACHOR',C'ROACH'                                           
         DC    C'E',C'AORST',C'ROAST'                                           
         DC    C'E',C'BDEOR',C'ROBED'                                           
         DC    C'E',C'BINOR',C'ROBIN'                                           
         DC    C'E',C'BOORT',C'ROBOT'                                           
         DC    C'E',C'CKORY',C'ROCKY'                                           
         DC    C'E',C'DEOOR',C'RODEO'                                           
         DC    C'E',C'EGORU',C'ROGUE'                                           
         DC    C'H',C'ILORY',C'ROILY'                                           
         DC    C'H',C'DNOOR',C'RONDO'                                           
         DC    C'H',C'KOORY',C'ROOKY'                                           
         DC    C'E',C'MOORY',C'ROOMY'                                           
         DC    C'H',C'EOORS',C'ROOSE'                                           
         DC    C'E',C'OORST',C'ROOST'                                           
         DC    C'H',C'OORTY',C'ROOTY'                                           
         DC    C'E',C'DEOPR',C'ROPED'                                           
         DC    C'E',C'EOPRR',C'ROPER'                                           
         DC    C'H',C'DEORS',C'ROSED'                                           
         DC    C'H',C'INORS',C'ROSIN'                                           
         DC    C'H',C'CHORT',C'ROTCH'                                           
         DC    C'H',C'OORRT',C'ROTOR'                                           
         DC    C'E',C'EGORU',C'ROUGE'                                           
         DC    C'E',C'GHORU',C'ROUGH'                                           
         DC    C'E',C'DNORU',C'ROUND'                                           
         DC    C'H',C'OPRUY',C'ROUPY'                                           
         DC    C'E',C'EORSU',C'ROUSE'                                           
         DC    C'E',C'ORSTU',C'ROUST'                                           
         DC    C'E',C'EORTU',C'ROUTE'                                           
         DC    C'E',C'DEORV',C'ROVED'                                           
         DC    C'H',C'ENORV',C'ROVEN'                                           
         DC    C'E',C'EORRV',C'ROVER'                                           
         DC    C'E',C'DORWY',C'ROWDY'                                           
         DC    C'H',C'ELORW',C'ROWEL'                                           
         DC    C'H',C'ENORW',C'ROWEN'                                           
         DC    C'E',C'EORRW',C'ROWER'                                           
         DC    C'E',C'ALORY',C'ROYAL'                                           
         DC    C'H',C'BELRU',C'RUBLE'                                           
         DC    C'H',C'CEHRU',C'RUCHE'                                           
         DC    C'H',C'DDRUY',C'RUDDY'                                           
         DC    C'E',C'DERRU',C'RUDER'                                           
         DC    C'H',C'EFFRU',C'RUFFE'                                           
         DC    C'E',C'BGRUY',C'RUGBY'                                           
         DC    C'H',C'GINRU',C'RUING'                                           
         DC    C'E',C'DELRU',C'RULED'                                           
         DC    C'E',C'ELRRU',C'RULER'                                           
         DC    C'H',C'ABMRU',C'RUMBA'                                           
         DC    C'H',C'EMNRU',C'RUMEN'                                           
         DC    C'E',C'MMRUY',C'RUMMY'                                           
         DC    C'E',C'MORRU',C'RUMOR'                                           
         DC    C'H',C'CINRU',C'RUNIC'                                           
         DC    C'E',C'NNRUY',C'RUNNY'                                           
         DC    C'H',C'NRTUY',C'RUNTY'                                           
         DC    C'H',C'EEPRU',C'RUPEE'                                           
         DC    C'E',C'ALRRU',C'RURAL'                                           
         DC    C'H',C'HRSUY',C'RUSHY'                                           
         DC    C'E',C'RSTUY',C'RUSTY'                                           
         DC    C'H',C'RTTUY',C'RUTTY'                                           
         DC    X'FF'                                                            
**PAN#1  CSECT                                                                  
**PAN#1  DC    CL21'009GAWRD03   08/22/00'                                      
         END                                                                    
