*          DATA SET SPEZF26    AT LEVEL 128 AS OF 12/01/17                      
*PHASE T23026A                                                                  
*                                                                               
* EASI - CLT/UID REDIRECT TABLE                                                 
* CL3 - CLIENT CODE                                                             
* CL8 - USER ID                                                                 
* FORMERLY PART OF EZLOAD                                                       
*                                                                               
T23026   CSECT                                                                  
*                                                                               
IDCLTTAB DS    0X                                                               
*                CLT    2011->ID                                                
*        DC    C'---',C'--------'                                               
         DC    C'1ZZ',C'MSNYA   '                                               
         DC    C'AAD',C'MSCORE  '                                               
         DC    C'AB2',C'MSNYA   '                                               
         DC    C'ABD',C'MSCORE  '                                               
         DC    C'ABT',C'MSNYA   '                                               
         DC    C'ACC',C'MSNYA   '                                               
         DC    C'ACD',C'MSCORE  '                                               
         DC    C'ADK',C'MSNYA   '                                               
         DC    C'ADS',C'MSNYA   '                                               
         DC    C'AED',C'MSCORE  '                                               
         DC    C'AEH',C'MSNYA   '                                               
         DC    C'AEM',C'MSNYA   '                                               
         DC    C'AEO',C'MSNYA   '                                               
         DC    C'AFD',C'MSCORE  '                                               
         DC    C'AFY',C'MSNYA   '                                               
         DC    C'AG1',C'MSNYA   '                                               
         DC    C'AGD',C'MSCORE  '                                               
         DC    C'AHD',C'MSCORE  '                                               
         DC    C'AIC',C'MSNYA   '                                               
         DC    C'AID',C'MSCORE  '                                               
         DC    C'AJD',C'MSCORE  '                                               
         DC    C'AKD',C'MSCORE  '                                               
         DC    C'AL4',C'MSNYA   '                                               
         DC    C'ALD',C'MSCORE  '                                               
         DC    C'ALT',C'MSNYA   '                                               
         DC    C'ALZ',C'MSNYA   '                                               
         DC    C'AM3',C'MSNYA   '                                               
         DC    C'AMD',C'MSCORE  '                                               
         DC    C'AMX',C'MSNYA   '                                               
         DC    C'ANL',C'MSNYA   '                                               
         DC    C'AOD',C'MSCORE  '                                               
         DC    C'AOM',C'MSNYA   '                                               
         DC    C'APD',C'MSCORE  '                                               
         DC    C'AQD',C'MSCORE  '                                               
         DC    C'AR3',C'MSNYA   '                                               
         DC    C'ARD',C'MSCORE  '                                               
         DC    C'ARS',C'MSNYA   '                                               
         DC    C'ASD',C'MSCORE  '                                               
         DC    C'ATA',C'MSNYA   '                                               
         DC    C'ATD',C'MSCORE  '                                               
         DC    C'ATH',C'MSNYA   '                                               
         DC    C'ATM',C'MSNYA   '                                               
         DC    C'ATM',C'MSNYA   '                                               
         DC    C'ATN',C'MSNYA   '                                               
         DC    C'ATS',C'MSNYA   '                                               
         DC    C'ATW',C'MSNYA   '                                               
         DC    C'ATX',C'MSNYA   '                                               
         DC    C'AU1',C'MSNYA   '                                               
         DC    C'AUD',C'MSCORE  '                                               
         DC    C'AUE',C'MSNYA   '                                               
         DC    C'AW1',C'MSNYA   '                                               
         DC    C'AWY',C'MSNYA   '                                               
         DC    C'AXP',C'MSNYA   '                                               
         DC    C'AYD',C'MSCORE  '                                               
         DC    C'AZD',C'MSCORE  '                                               
         DC    C'AZN',C'MSNYA   '                                               
         DC    C'A2D',C'MSCORE  '                                               
         DC    C'A3D',C'MSCORE  '                                               
         DC    C'A5D',C'MSCORE  '                                               
         DC    C'B1D',C'MSCORE  '                                               
         DC    C'B2D',C'MSCORE  '                                               
         DC    C'BAD',C'MSCORE  '                                               
         DC    C'BAN',C'MSNYA   '                                               
         DC    C'BBD',C'MSCORE  '                                               
         DC    C'BCA',C'MSNYA   '                                               
         DC    C'BCD',C'MSCORE  '                                               
         DC    C'BCL',C'MSNYA   '                                               
         DC    C'BDD',C'MSCORE  '                                               
         DC    C'BED',C'MSCORE  '                                               
         DC    C'BEL',C'MSNYA   '                                               
         DC    C'BFD',C'MSCORE  '                                               
         DC    C'BF1',C'MSNYA   '                                               
         DC    C'BG0',C'MSNYA   '                                               
         DC    C'BG1',C'MSNYA   '                                               
         DC    C'BG2',C'MSNYA   '                                               
         DC    C'BGD',C'MSCORE  '                                               
         DC    C'BHD',C'MSCORE  '                                               
         DC    C'BI1',C'MSNYA   '                                               
         DC    C'BI2',C'MSNYA   '                                               
         DC    C'BI3',C'MSNYA   '                                               
         DC    C'BJD',C'MSCORE  '                                               
         DC    C'BJ1',C'MSNYA   '                                               
         DC    C'BJ2',C'MSNYA   '                                               
         DC    C'BK ',C'MSNYA   '                                               
         DC    C'BKD',C'MSCORE  '                                               
         DC    C'BLD',C'MSCORE  '                                               
         DC    C'BLN',C'MSNYA   '                                               
         DC    C'BLR',C'MSNYA   '                                               
         DC    C'BLT',C'MSNYA   '                                               
         DC    C'BLZ',C'MSNYA   '                                               
         DC    C'BMB',C'MSNYA   '                                               
         DC    C'BMS',C'MSNYA   '                                               
         DC    C'BND',C'MSCORE  '                                               
         DC    C'BNG',C'MSNYA   '                                               
         DC    C'BNL',C'MSNYA   '                                               
         DC    C'BNP',C'MSNYA   '                                               
         DC    C'BNS',C'MSNYA   '                                               
         DC    C'BOD',C'MSCORE  '                                               
         DC    C'BP1',C'MSNYA   '                                               
         DC    C'BP2',C'MSNYA   '                                               
         DC    C'BP3',C'MSNYA   '                                               
         DC    C'BPX',C'MSNYA   '                                               
         DC    C'BQD',C'MSCORE  '                                               
         DC    C'BRD',C'MSCORE  '                                               
         DC    C'BST',C'MSNYA   '                                               
         DC    C'BTD',C'MSCORE  '                                               
         DC    C'BTL',C'MSNYA   '                                               
         DC    C'BUD',C'MSCORE  '                                               
         DC    C'BUL',C'MSNYA   '                                               
         DC    C'BV0',C'MSNYA   '                                               
         DC    C'BV4',C'MSNYA   '                                               
         DC    C'BV5',C'MSNYA   '                                               
         DC    C'BV6',C'MSNYA   '                                               
         DC    C'BV8',C'MSNYA   '                                               
         DC    C'BV9',C'MSNYA   '                                               
         DC    C'BWD',C'MSCORE  '                                               
         DC    C'BYD',C'MSCORE  '                                               
         DC    C'BYR',C'MSNYA   '                                               
         DC    C'CA4',C'MSNYA   '                                               
         DC    C'CAD',C'MSCORE  '                                               
         DC    C'CAS',C'MSNYA   '                                               
         DC    C'CBD',C'MSCORE  '                                               
         DC    C'CBE',C'MSNYA   '                                               
         DC    C'CBG',C'MSNYA   '                                               
         DC    C'CBL',C'MSNYA   '                                               
         DC    C'CBP',C'MSNYA   '                                               
         DC    C'CCS',C'FDMJW   '                                               
         DC    C'CCT',C'MSNYA   '                                               
         DC    C'CCV',C'FDMJW   '                                               
         DC    C'CD ',C'MSNYA   '                                               
         DC    C'CDC',C'MSNYA   '                                               
         DC    C'CDD',C'MSCORE  '                                               
         DC    C'CDW',C'MSNYA   '                                               
         DC    C'CEW',C'MSNYA   '                                               
         DC    C'CFD',C'MSCORE  '                                               
         DC    C'CFI',C'MSNYA   '                                               
         DC    C'CFM',C'FDMJW   '                                               
         DC    C'CHD',C'MSCORE  '                                               
         DC    C'CHI',C'MSNYA   '                                               
         DC    C'CHT',C'MSNYA   '                                               
         DC    C'CID',C'MSCORE  '                                               
         DC    C'CIH',C'MSNYA   '                                               
         DC    C'CIL',C'MSNYA   '                                               
         DC    C'CIP',C'MSNYA   '                                               
         DC    C'CIR',C'MSNYA   '                                               
         DC    C'CJR',C'MSNYA   '                                               
         DC    C'CKD',C'MSCORE  '                                               
         DC    C'CLD',C'MSCORE  '                                               
         DC    C'CNG',C'MSNYA   '                                               
         DC    C'CNL',C'MSNYA   '                                               
         DC    C'COH',C'MSNYA   '                                               
         DC    C'CPW',C'FDMJW   '                                               
         DC    C'CRD',C'MSCORE  '                                               
         DC    C'CRH',C'FDMJW   '                                               
         DC    C'CRX',C'MSNYA   '                                               
         DC    C'CSI',C'MSNYA   '                                               
         DC    C'CUB',C'MSNYA   '                                               
         DC    C'CVD',C'MSCORE  '                                               
         DC    C'CVS',C'MSNYA   '                                               
         DC    C'CWD',C'MSCORE  '                                               
         DC    C'CZD',C'MSCORE  '                                               
         DC    C'DAB',C'MSNYA   '                                               
         DC    C'DED',C'MSCORE  '                                               
         DC    C'DET',C'MSNYA   '                                               
         DC    C'DEV',C'MSNYA   '                                               
         DC    C'DFD',C'MSCORE  '                                               
         DC    C'DFI',C'MSNYA   '                                               
         DC    C'DG ',C'MSNYA   '                                               
         DC    C'DGD',C'MSCORE  '                                               
         DC    C'DHA',C'MSNYA   '                                               
         DC    C'DHD',C'MSCORE  '                                               
         DC    C'DHJ',C'MSNYA   '                                               
         DC    C'DJX',C'MSNYA   '                                               
         DC    C'DLM',C'FDMJW   '                                               
         DC    C'DND',C'MSCORE  '                                               
         DC    C'DNP',C'MSNYA   '                                               
         DC    C'DOL',C'MSNYA   '                                               
         DC    C'DPI',C'MSNYA   '                                               
         DC    C'DPN',C'MSNYA   '                                               
         DC    C'DPZ',C'MSNYA   '                                               
         DC    C'DSO',C'FDMJW   '                                               
         DC    C'DTD',C'MSCORE  '                                               
         DC    C'DUP',C'MSNYA   '                                               
         DC    C'DVL',C'FDMJW   '                                               
         DC    C'DXD',C'MSCORE  '                                               
         DC    C'EAF',C'MSNYA   '                                               
         DC    C'EAM',C'MSNYA   '                                               
         DC    C'EDB',C'MSNYA   '                                               
         DC    C'EGD',C'MSCORE  '                                               
         DC    C'EHD',C'MSCORE  '                                               
         DC    C'EL ',C'MSNYA   '                                               
         DC    C'ELD',C'MSCORE  '                                               
         DC    C'ELP',C'MSNYA   '                                               
         DC    C'EMD',C'MSCORE  '                                               
         DC    C'ESD',C'MSCORE  '                                               
         DC    C'EST',C'MSNYA   '                                               
         DC    C'ETD',C'MSCORE  '                                               
         DC    C'EYD',C'MSCORE  '                                               
         DC    C'EYX',C'MSNYA   '                                               
         DC    C'F1D',C'MSCORE  '                                               
         DC    C'FAD',C'MSCORE  '                                               
         DC    C'FAM',C'MSNYA   '                                               
         DC    C'FCB',C'FDMJW   '                                               
         DC    C'FD ',C'FDMJW   '                                               
         DC    C'FDM',C'FDMJW   '                                               
         DC    C'FDN',C'FDMJW   '                                               
         DC    C'FDO',C'FDMJW   '                                               
         DC    C'FDX',C'FDMJW   '                                               
         DC    C'FDY',C'FDMJW   '                                               
         DC    C'FFR',C'FDMJW   '                                               
         DC    C'FFT',C'MSNYA   '                                               
         DC    C'FFV',C'FDMJW   '                                               
         DC    C'FH5',C'MSNYA   '                                               
         DC    C'FIC',C'MSNYA   '                                               
         DC    C'FMD',C'MSCORE  '                                               
         DC    C'FMI',C'MSNYA   '                                               
         DC    C'FMP',C'FDMJW   '                                               
         DC    C'FND',C'MSCORE  '                                               
         DC    C'FOB',C'MSNYA   '                                               
         DC    C'FOH',C'MSNYA   '                                               
         DC    C'FPV',C'FDMJW   '                                               
         DC    C'FRD',C'MSCORE  '                                               
         DC    C'FRS',C'MSNYA   '                                               
         DC    C'FS5',C'MSNYA   '                                               
         DC    C'FSP',C'MSNYA   '                                               
         DC    C'FUG',C'MSNYA   '                                               
         DC    C'FXD',C'MSCORE  '                                               
         DC    C'GA ',C'MSNYA   '                                               
         DC    C'GDM',C'MSNYA   '                                               
         DC    C'GGD',C'MSCORE  '                                               
         DC    C'GID',C'MSCORE  '                                               
         DC    C'GLC',C'MSNYA   '                                               
         DC    C'GLD',C'MSCORE  '                                               
         DC    C'GMF',C'MSNYA   '                                               
         DC    C'GNT',C'MSNYA   '                                               
         DC    C'GRV',C'MSNYA   '                                               
         DC    C'GRV',C'MSNYA   '                                               
         DC    C'GSD',C'MSCORE  '                                               
         DC    C'GSK',C'MSNYA   '                                               
         DC    C'GSX',C'MSNYA   '                                               
         DC    C'GUD',C'MSCORE  '                                               
         DC    C'GVA',C'MSNYA   '                                               
         DC    C'G1M',C'MSNYA   '                                               
         DC    C'HA1',C'MSNYA   '                                               
         DC    C'HAD',C'MSNYA   '                                               
         DC    C'HAS',C'MSNYA   '                                               
         DC    C'HBD',C'MSCORE  '                                               
         DC    C'HCG',C'MSNYA   '                                               
         DC    C'HDA',C'MSNYA   '                                               
         DC    C'HDO',C'MSNYA   '                                               
         DC    C'HDO',C'MSNYA   '                                               
         DC    C'HFD',C'MSNYA   '                                               
         DC    C'HGK',C'MSNYA   '                                               
         DC    C'HHM',C'MSNYA   '                                               
         DC    C'HKD',C'MSCORE  '                                               
         DC    C'HLC',C'MSNYA   '                                               
         DC    C'HLI',C'MSNYA   '                                               
         DC    C'HMH',C'MSNYA   '                                               
         DC    C'HND',C'MSCORE  '                                               
         DC    C'HOD',C'MSCORE  '                                               
         DC    C'HOK',C'MSNYA   '                                               
         DC    C'HPO',C'MSNYA   '                                               
         DC    C'HRD',C'MSCORE  '                                               
         DC    C'HRS',C'MSNYA   '                                               
         DC    C'HS ',C'MSNYA   '                                               
         DC    C'HSD',C'MSCORE  '                                               
         DC    C'HSK',C'MSNYA   '                                               
         DC    C'HSL',C'MSNYA   '                                               
         DC    C'HSS',C'MSNYA   '                                               
         DC    C'HSW',C'MSNYA   '                                               
         DC    C'HUO',C'MSNYA   '                                               
         DC    C'HVW',C'MSNYA   '                                               
         DC    C'HW8',C'MSNYA   '                                               
         DC    C'HWD',C'MSCORE  '                                               
         DC    C'HXD',C'MSCORE  '                                               
         DC    C'IB2',C'MSNYA   '                                               
         DC    C'IBL',C'MSNYA   '                                               
         DC    C'IDD',C'MSCORE  '                                               
         DC    C'IED',C'MSCORE  '                                               
         DC    C'IHD',C'MSCORE  '                                               
         DC    C'IKE',C'MSNYA   '                                               
         DC    C'IM7',C'MSNYA   '                                               
         DC    C'IM8',C'MSNYA   '                                               
         DC    C'IMC',C'MSNYA   '                                               
         DC    C'IND',C'MSCORE  '                                               
         DC    C'IQD',C'MSCORE  '                                               
         DC    C'IRD',C'MSCORE  '                                               
         DC    C'IRL',C'MSNYA   '                                               
         DC    C'ITD',C'MSCORE  '                                               
         DC    C'ITW',C'MSNYA   '                                               
         DC    C'IXC',C'MSNYA   '                                               
         DC    C'IXD',C'MSCORE  '                                               
         DC    C'JCB',C'MSNYA   '                                               
         DC    C'JCD',C'MSCORE  '                                               
         DC    C'JCM',C'MSNYA   '                                               
         DC    C'JCX',C'FDMJW   '                                               
         DC    C'JDD',C'MSCORE  '                                               
         DC    C'JDR',C'MSNYA   '                                               
         DC    C'JEA',C'MSNYA   '                                               
         DC    C'JED',C'MSCORE  '                                               
         DC    C'JFD',C'MSCORE  '                                               
         DC    C'JGD',C'MSCORE  '                                               
         DC    C'JID',C'MSCORE  '                                               
         DC    C'JMD',C'MSCORE  '                                               
         DC    C'JMS',C'MSNYA   '                                               
         DC    C'JNM',C'MSNYA   '                                               
         DC    C'JNR',C'MSNYA   '                                               
         DC    C'JSL',C'MSNYA   '                                               
         DC    C'JSN',C'MSNYA   '                                               
         DC    C'JWM',C'MSNYA   '                                               
         DC    C'KAF',C'MSNYA   '                                               
         DC    C'KAP',C'MSNYA   '                                               
         DC    C'KCL',C'MSNYA   '                                               
         DC    C'KCS',C'MSNYA   '                                               
         DC    C'KID',C'MSCORE  '                                               
         DC    C'KK ',C'MSNYA   '                                               
         DC    C'KKD',C'MSCORE  '                                               
         DC    C'KLD',C'MSCORE  '                                               
         DC    C'KUD',C'MSCORE  '                                               
         DC    C'KUK',C'MSNYA   '                                               
         DC    C'KUN',C'MSNYA   '                                               
         DC    C'LB1',C'MSNYA   '                                               
         DC    C'LCH',C'MSNYA   '                                               
         DC    C'LCM',C'MSNYA   '                                               
         DC    C'LFD',C'MSCORE  '                                               
         DC    C'LGA',C'MSNYA   '                                               
         DC    C'LGD',C'MSCORE  '                                               
         DC    C'LGM',C'MSNYA   '                                               
         DC    C'LID',C'MSCORE  '                                               
         DC    C'LLD',C'MSCORE  '                                               
         DC    C'LM	',C'FDMJW   '                                               
         DC    C'LM7',C'MSNYA   '                                               
         DC    C'LM8',C'MSNYA   '                                               
         DC    C'LM9',C'MSNYA   '                                               
         DC    C'LNC',C'FDMJW   '                                               
         DC    C'LND',C'MSCORE  '                                               
         DC    C'LOG',C'MSNYA   '                                               
         DC    C'LR1',C'MSNYA   '                                               
         DC    C'LSD',C'MSCORE  '                                               
         DC    C'LSM',C'MSNYA   '                                               
         DC    C'LVH',C'MSNYA   '                                               
         DC    C'LVS',C'MSNYA   '                                               
         DC    C'LVT',C'MSNYA   '                                               
         DC    C'LWM',C'MSNYA   '                                               
         DC    C'LWR',C'MSNYA   '                                               
         DC    C'LXN',C'MSNYA   '                                               
         DC    C'LZD',C'MSCORE  '                                               
         DC    C'M3D',C'MSCORE  '                                               
         DC    C'M3M',C'MSNYA   '                                               
         DC    C'MAD',C'MSCORE  '                                               
         DC    C'MC ',C'MSNYA   '                                               
         DC    C'MCD',C'MSCORE  '                                               
         DC    C'MCY',C'MSNYA   '                                               
         DC    C'MD ',C'MSCORE  '                                               
         DC    C'MDD',C'MSNYA   '                                               
         DC    C'ME9',C'MSNYA   '                                               
         DC    C'MED',C'MSCORE  '                                               
         DC    C'MFC',C'MSNYA   '                                               
         DC    C'MFI',C'MSNYA   '                                               
         DC    C'MFL',C'MSNYA   '                                               
         DC    C'MFX',C'MSNYA   '                                               
         DC    C'MGD',C'MSCORE  '                                               
         DC    C'MHC',C'MSNYA   '                                               
         DC    C'MHD',C'MSCORE  '                                               
         DC    C'MHM',C'MSNYA   '                                               
         DC    C'MHN',C'MSNYA   '                                               
         DC    C'MHR',C'MSNYA   '                                               
         DC    C'MI ',C'MSNYA   '                                               
         DC    C'MID',C'MSCORE  '                                               
         DC    C'MIO',C'MSNYA   '                                               
         DC    C'MLA',C'MSNYA   '                                               
         DC    C'MLY',C'MSNYA   '                                               
         DC    C'MO1',C'MSNYA   '                                               
         DC    C'MPC',C'MSNYA   '                                               
         DC    C'MPD',C'MSCORE  '                                               
         DC    C'MRL',C'MSNYA   '                                               
         DC    C'MRS',C'MSNYA   '                                               
         DC    C'MRX',C'MSNYA   '                                               
         DC    C'MTD',C'MSCORE  '                                               
         DC    C'MTR',C'MSNYA   '                                               
         DC    C'MUD',C'MSCORE  '                                               
         DC    C'MWA',C'MSNYA   '                                               
         DC    C'MWT',C'MSNYA   '                                               
         DC    C'MXF',C'MSNYA   '                                               
         DC    C'MYC',C'MSNYA   '                                               
         DC    C'MYE',C'MSNYA   '                                               
         DC    C'MYH',C'MSNYA   '                                               
         DC    C'MYN',C'MSNYA   '                                               
         DC    C'MYW',C'MSNYA   '                                               
         DC    C'MZ1',C'FDMJW   '                                               
         DC    C'MZ2',C'FDMJW   '                                               
         DC    C'MZ3',C'FDMJW   '                                               
         DC    C'MZ4',C'FDMJW   '                                               
         DC    C'MZ5',C'FDMJW   '                                               
         DC    C'NBA',C'MSNYA   '                                               
         DC    C'NDD',C'MSCORE  '                                               
         DC    C'NED',C'MSCORE  '                                               
         DC    C'NEF',C'MSNYA   '                                               
         DC    C'NEX',C'MSNYA   '                                               
         DC    C'NFD',C'MSCORE  '                                               
         DC    C'NFP',C'MSNYA   '                                               
         DC    C'NGD',C'MSCORE  '                                               
         DC    C'NHD',C'MSCORE  '                                               
         DC    C'NHS',C'MSNYA   '                                               
         DC    C'NID',C'MSCORE  '                                               
         DC    C'NJB',C'MSNYA   '                                               
         DC    C'NLD',C'MSCORE  '                                               
         DC    C'NLM',C'MSNYA   '                                               
         DC    C'NMD',C'MSCORE  '                                               
         DC    C'NMP',C'MSNYA   '                                               
         DC    C'NNP',C'MSNYA   '                                               
         DC    C'NOK',C'MSNYA   '                                               
         DC    C'NSC',C'MSNYA   '                                               
         DC    C'NSD',C'MSCORE  '                                               
         DC    C'NTX',C'MSNYA   '                                               
         DC    C'NV ',C'MSNYA   '                                               
         DC    C'NVD',C'MSCORE  '                                               
         DC    C'NVM',C'MSNYA   '                                               
         DC    C'NWE',C'MSNYA   '                                               
         DC    C'NWM',C'MSNYA   '                                               
         DC    C'NXC',C'MSNYA   '                                               
         DC    C'NXD',C'MSCORE  '                                               
         DC    C'NXI',C'MSNYA   '                                               
         DC    C'OAK',C'FDMJW   '                                               
         DC    C'OBD',C'MSCORE  '                                               
         DC    C'ODD',C'MSCORE  '                                               
         DC    C'OG ',C'MSNYA   '                                               
         DC    C'OGA',C'MSNYA   '                                               
         DC    C'OKN',C'MSNYA   '                                               
         DC    C'OMD',C'MSCORE  '                                               
         DC    C'OOD',C'MSCORE  '                                               
         DC    C'OR ',C'MSNYA   '                                               
         DC    C'OR3',C'MSNYA   '                                               
         DC    C'ORD',C'MSCORE  '                                               
         DC    C'OSD',C'MSCORE  '                                               
         DC    C'OTD',C'MSCORE  '                                               
         DC    C'PAH',C'MSNYA   '                                               
         DC    C'PBO',C'MSNYA   '                                               
         DC    C'PBY',C'MSNYA   '                                               
         DC    C'PCF',C'MSNYA   '                                               
         DC    C'PDL',C'MSNYA   '                                               
         DC    C'PDX',C'MSNYA   '                                               
         DC    C'PEH',C'MSNYA   '                                               
         DC    C'PGC',C'MSNYA   '                                               
         DC    C'PHL',C'MSNYA   '                                               
         DC    C'PIA',C'MSNYA   '                                               
         DC    C'PID',C'MSCORE  '                                               
         DC    C'PLM',C'FDMJW   '                                               
         DC    C'PLN',C'MSNYA   '                                               
         DC    C'PLX',C'MSNYA   '                                               
         DC    C'PM0',C'MSNYA   '                                               
         DC    C'PM1',C'MSNYA   '                                               
         DC    C'PM2',C'MSNYA   '                                               
         DC    C'PM7',C'MSNYA   '                                               
         DC    C'PM8',C'MSNYA   '                                               
         DC    C'PMD',C'MSCORE  '                                               
         DC    C'PME',C'MSNYA   '                                               
         DC    C'PMP',C'MSNYA   '                                               
         DC    C'PNB',C'MSNYA   '                                               
         DC    C'PPE',C'MSNYA   '                                               
         DC    C'PRD',C'MSNYA   '                                               
         DC    C'PSP',C'MSNYA   '                                               
         DC    C'PV7',C'MSNYA   '                                               
         DC    C'PV8',C'MSNYA   '                                               
         DC    C'PWC',C'MSNYA   '                                               
         DC    C'PWD',C'MSCORE  '                                               
         DC    C'PWR',C'MSNYA   '                                               
         DC    C'PWV',C'MSNYA   '                                               
         DC    C'PXD',C'MSCORE  '                                               
         DC    C'PZD',C'MSCORE  '                                               
         DC    C'QBD',C'MSCORE  '                                               
         DC    C'QC4',C'MSNYA   '                                               
         DC    C'QCB',C'MSNYA   '                                               
         DC    C'QCD',C'MSCORE  '                                               
         DC    C'QCE',C'MSNYA   '                                               
         DC    C'QCG',C'MSNYA   '                                               
         DC    C'QCM',C'MSNYA   '                                               
         DC    C'QCM',C'MSNYA   '                                               
         DC    C'QCO',C'MSNYA   '                                               
         DC    C'QCS',C'MSNYA   '                                               
         DC    C'QCU',C'MSNYA   '                                               
         DC    C'QCY',C'MSNYA   '                                               
         DC    C'QFF',C'MSNYA   '                                               
         DC    C'QFF',C'MSNYA   '                                               
         DC    C'QFX',C'MSNYA   '                                               
         DC    C'QL0',C'MSNYA   '                                               
         DC    C'QL1',C'MSNYA   '                                               
         DC    C'QL2',C'MSNYA   '                                               
         DC    C'QL4',C'MSNYA   '                                               
         DC    C'QL6',C'MSNYA   '                                               
         DC    C'QL7',C'MSNYA   '                                               
         DC    C'QL8',C'MSNYA   '                                               
         DC    C'QNE',C'MSNYA   '                                               
         DC    C'QNE',C'MSNYA   '                                               
         DC    C'QNV',C'MSNYA   '                                               
         DC    C'QNW',C'MSNYA   '                                               
         DC    C'QNY',C'MSNYA   '                                               
         DC    C'QUE',C'MSNYA   '                                               
         DC    C'QUE',C'MSNYA   '                                               
         DC    C'QUP',C'MSNYA   '                                               
         DC    C'QUP',C'MSNYA   '                                               
         DC    C'QUV',C'MSNYA   '                                               
         DC    C'QUV',C'MSNYA   '                                               
         DC    C'Q4D',C'MSCORE  '                                               
         DC    C'Q5D',C'MSCORE  '                                               
         DC    C'RAD',C'MSCORE  '                                               
         DC    C'RAN',C'MSNYA   '                                               
         DC    C'RBC',C'FDMJW   '                                               
         DC    C'RBD',C'MSCORE  '                                               
         DC    C'RCA',C'MSNYA   '                                               
         DC    C'RCD',C'MSCORE  '                                               
         DC    C'RDS',C'MSNYA   '                                               
         DC    C'RED',C'MSCORE  '                                               
         DC    C'REG',C'MSNYA   '                                               
         DC    C'RFI',C'MSNYA   '                                               
         DC    C'RGM',C'MSNYA   '                                               
         DC    C'RLG',C'MSNYA   '                                               
         DC    C'RMR',C'MSNYA   '                                               
         DC    C'RNR',C'MSNYA   '                                               
         DC    C'ROD',C'MSCORE  '                                               
         DC    C'RRC',C'MSNYA   '                                               
         DC    C'RSR',C'MSNYA   '                                               
         DC    C'RTU',C'MSNYA   '                                               
         DC    C'RTV',C'MSNYA   '                                               
         DC    C'RWR',C'MSNYA   '                                               
         DC    C'RYA',C'MSNYA   '                                               
         DC    C'RYD',C'MSCORE  '                                               
         DC    C'RYS',C'MSNYA   '                                               
         DC    C'SAD',C'MSCORE  '                                               
         DC    C'SAM',C'MSNYA   '                                               
         DC    C'SAP',C'MSNYA   '                                               
         DC    C'SBA',C'MSNYA   '                                               
         DC    C'SBC',C'MSNYA   '                                               
         DC    C'SBH',C'MSNYA   '                                               
         DC    C'SBJ',C'MSNYA   '                                               
         DC    C'SBL',C'MSNYA   '                                               
         DC    C'SBW',C'MSNYA   '                                               
         DC    C'SCC',C'MSNYA   '                                               
         DC    C'SCD',C'MSCORE  '                                               
         DC    C'SCG',C'MSNYA   '                                               
         DC    C'SCJ',C'MSNYA   '                                               
         DC    C'SCN',C'MSNYA   '                                               
         DC    C'SCS',C'MSNYA   '                                               
         DC    C'SDD',C'MSCORE  '                                               
         DC    C'SDK',C'MSNYA   '                                               
         DC    C'SEB',C'MSNYA   '                                               
         DC    C'SEM',C'MSNYA   '                                               
         DC    C'SEN',C'MSNYA   '                                               
         DC    C'SGR',C'MSNYA   '                                               
         DC    C'SH ',C'MSNYA   '                                               
         DC    C'SHD',C'MSCORE  '                                               
         DC    C'SHI',C'MSNYA   '                                               
         DC    C'SID',C'MSCORE  '                                               
         DC    C'SJD',C'MSCORE  '                                               
         DC    C'SJR',C'MSNYA   '                                               
         DC    C'SKS',C'MSNYA   '                                               
         DC    C'SLD',C'MSCORE  '                                               
         DC    C'SLL',C'MSNYA   '                                               
         DC    C'SMB',C'FDMJW   '                                               
         DC    C'SMD',C'MSCORE  '                                               
         DC    C'SMO',C'FDMJW   '                                               
         DC    C'SMT',C'MSNYA   '                                               
         DC    C'SMY',C'MSNYA   '                                               
         DC    C'SND',C'MSCORE  '                                               
         DC    C'SNG',C'MSNYA   '                                               
         DC    C'SNO',C'MSNYA   '                                               
         DC    C'SOD',C'MSCORE  '                                               
         DC    C'SOI',C'MSNYA   '                                               
         DC    C'SOL',C'MSNYA   '                                               
         DC    C'SPD',C'MSCORE  '                                               
         DC    C'SPG',C'MSNYA   '                                               
         DC    C'SPL',C'MSNYA   '                                               
         DC    C'SPR',C'MSNYA   '                                               
         DC    C'SPV',C'MSNYA   '                                               
         DC    C'SPX',C'MSNYA   '                                               
         DC    C'SR3',C'MSNYA   '                                               
         DC    C'SRD',C'MSCORE  '                                               
         DC    C'SRS',C'MSNYA   '                                               
         DC    C'SRU',C'MSNYA   '                                               
         DC    C'SRX',C'MSNYA   '                                               
         DC    C'SRX',C'MSNYA   '                                               
         DC    C'SSM',C'MSNYA   '                                               
         DC    C'STD',C'MSCORE  '                                               
         DC    C'STR',C'MSNYA   '                                               
         DC    C'STT',C'MSNYA   '                                               
         DC    C'SUD',C'MSCORE  '                                               
         DC    C'SVD',C'MSCORE  '                                               
         DC    C'SVR',C'MSNYA   '                                               
         DC    C'TA3',C'MSNYA   '                                               
         DC    C'TAD',C'MSCORE  '                                               
         DC    C'TB2',C'MSNYA   '                                               
         DC    C'TBL',C'MSNYA   '                                               
         DC    C'TCH',C'MSNYA   '                                               
         DC    C'TED',C'MSCORE  '                                               
         DC    C'TFC',C'MSNYA   '                                               
         DC    C'TGD',C'MSCORE  '                                               
         DC    C'THQ',C'MSNYA   '                                               
         DC    C'TID',C'MSCORE  '                                               
         DC    C'TJD',C'MSCORE  '                                               
         DC    C'TIM',C'MSNYA   '                                               
         DC    C'TLA',C'MSNYA   '                                               
         DC    C'TLD',C'MSCORE  '                                               
         DC    C'TNZ',C'MSNYA   '                                               
         DC    C'TOL',C'MSNYA   '                                               
         DC    C'TOM',C'MSNYA   '                                               
         DC    C'TPD',C'MSCORE  '                                               
         DC    C'TPR',C'MSNYA   '                                               
         DC    C'TR	',C'MSNYA   '                                               
         DC    C'TRD',C'MSCORE  '                                               
         DC    C'TRP',C'MSNYA   '                                               
         DC    C'TSC',C'MSNYA   '                                               
         DC    C'TSD',C'MSCORE  '                                               
         DC    C'TSI',C'MSNYA   '                                               
         DC    C'TSP',C'FDMJW   '                                               
         DC    C'TTD',C'MSCORE  '                                               
         DC    C'TVA',C'MSNYA   '                                               
         DC    C'TVD',C'MSCORE  '                                               
         DC    C'TVD',C'MSCORE  '                                               
         DC    C'TVG',C'MSNYA   '                                               
         DC    C'TVI',C'MSNYA   '                                               
         DC    C'TYR',C'MSNYA   '                                               
         DC    C'T1D',C'MSCORE  '                                               
         DC    C'UAW',C'MSNYA   '                                               
         DC    C'UCD',C'MSCORE  '                                               
         DC    C'UMC',C'MSNYA   '                                               
         DC    C'UMD',C'MSCORE  '                                               
         DC    C'UMG',C'MSNYA   '                                               
         DC    C'UND',C'MSCORE  '                                               
         DC    C'UNG',C'MSNYA   '                                               
         DC    C'UNN',C'MSNYA   '                                               
         DC    C'UPC',C'MSNYA   '                                               
         DC    C'UPH',C'MSNYA   '                                               
         DC    C'UUD',C'MSCORE  '                                               
         DC    C'UUS',C'MSNYA   '                                               
         DC    C'VAA',C'MSNYA   '                                               
         DC    C'VAB',C'MSNYA   '                                               
         DC    C'VAD',C'MSCORE  '                                               
         DC    C'VDK',C'MSNYA   '                                               
         DC    C'VF	',C'MSNYA   '                                               
         DC    C'VFC',C'MSNYA   '                                               
         DC    C'VFT',C'MSNYA   '                                               
         DC    C'VGA',C'MSNYA   '                                               
         DC    C'VGC',C'MSNYA   '                                               
         DC    C'VGL',C'MSNYA   '                                               
         DC    C'VGS',C'MSNYA   '                                               
         DC    C'VHA',C'MSNYA   '                                               
         DC    C'VHJ',C'MSNYA   '                                               
         DC    C'VHL',C'MSNYA   '                                               
         DC    C'VKK',C'MSNYA   '                                               
         DC    C'VLT',C'FDMJW   '                                               
         DC    C'VLV',C'MSNYA   '                                               
         DC    C'VMM',C'MSNYA   '                                               
         DC    C'VMW',C'MSNYA   '                                               
         DC    C'VNA',C'FDMJW   '                                               
         DC    C'VOA',C'MSNYA   '                                               
         DC    C'VOG',C'MSNYA   '                                               
         DC    C'VOT',C'MSNYA   '                                               
         DC    C'VSD',C'MSCORE  '                                               
         DC    C'VSL',C'MSNYA   '                                               
         DC    C'VTB',C'MSNYA   '                                               
         DC    C'VWA',C'MSNYA   '                                               
         DC    C'WAH',C'MSNYA   '                                               
         DC    C'WB8',C'MSNYA   '                                               
         DC    C'WB9',C'MSNYA   '                                               
         DC    C'WB9',C'MSNYA   '                                               
         DC    C'WCD',C'MSCORE  '                                               
         DC    C'WCS',C'MSNYA   '                                               
         DC    C'WDB',C'MSNYA   '                                               
         DC    C'WEU',C'MSNYA   '                                               
         DC    C'WFD',C'MSCORE  '                                               
         DC    C'WGD',C'MSCORE  '                                               
         DC    C'WGH',C'MSNYA   '                                               
         DC    C'WHD',C'MSCORE  '                                               
         DC    C'WJR',C'MSNYA   '                                               
         DC    C'WJR',C'MSNYA   '                                               
         DC    C'WLC',C'MSNYA   '                                               
         DC    C'WLD',C'MSCORE  '                                               
         DC    C'WLP',C'MSNYA   '                                               
         DC    C'WNW',C'MSNYA   '                                               
         DC    C'WP8',C'MSNYA   '                                               
         DC    C'WRD',C'MSCORE  '                                               
         DC    C'WRI',C'MSNYA   '                                               
         DC    C'WRS',C'FDMJW   '                                               
         DC    C'WSD',C'MSCORE  '                                               
         DC    C'WUO',C'MSNYA   '                                               
         DC    C'WWD',C'MSCORE  '                                               
         DC    C'WWV',C'MSNYA   '                                               
         DC    C'WXD',C'MSCORE  '                                               
         DC    C'X20',C'FDMJW   '                                               
         DC    C'X2A',C'FDMJW   '                                               
         DC    C'X2B',C'FDMJW   '                                               
         DC    C'X2C',C'FDMJW   '                                               
         DC    C'X2D',C'FDMJW   '                                               
         DC    C'X2E',C'FDMJW   '                                               
         DC    C'X2F',C'FDMJW   '                                               
         DC    C'X2I',C'FDMJW   '                                               
         DC    C'X2K',C'FDMJW   '                                               
         DC    C'X2L',C'FDMJW   '                                               
         DC    C'X2M',C'FDMJW   '                                               
         DC    C'X2N',C'FDMJW   '                                               
         DC    C'X2O',C'FDMJW   '                                               
         DC    C'X2P',C'FDMJW   '                                               
         DC    C'X2Q',C'FDMJW   '                                               
         DC    C'X2R',C'FDMJW   '                                               
         DC    C'X2S',C'FDMJW   '                                               
         DC    C'X2T',C'FDMJW   '                                               
         DC    C'X2U',C'FDMJW   '                                               
         DC    C'X2V',C'FDMJW   '                                               
         DC    C'X2W',C'FDMJW   '                                               
         DC    C'X2X',C'FDMJW   '                                               
         DC    C'XAT',C'FDMJW   '                                               
         DC    C'XAZ',C'FDMJW   '                                               
         DC    C'XCA',C'FDMJW   '                                               
         DC    C'XCH',C'FDMJW   '                                               
         DC    C'XCI',C'FDMJW   '                                               
         DC    C'XCL',C'FDMJW   '                                               
         DC    C'XDN',C'FDMJW   '                                               
         DC    C'XJA',C'FDMJW   '                                               
         DC    C'XLA',C'FDMJW   '                                               
         DC    C'XLI',C'FDMJW   '                                               
         DC    C'XMD',C'FDMJW   '                                               
         DC    C'XMP',C'FDMJW   '                                               
         DC    C'XMW',C'FDMJW   '                                               
         DC    C'XNE',C'FDMJW   '                                               
         DC    C'XNW',C'FDMJW   '                                               
         DC    C'XOA',C'FDMJW   '                                               
         DC    C'XOD',C'FDMJW   '                                               
         DC    C'XOK',C'FDMJW   '                                               
         DC    C'XPH',C'FDMJW   '                                               
         DC    C'XPI',C'FDMJW   '                                               
         DC    C'XSE',C'FDMJW   '                                               
         DC    C'XSL',C'FDMJW   '                                               
         DC    C'XST',C'FDMJW   '                                               
         DC    C'XSY',C'FDMJW   '                                               
         DC    C'XTR',C'FDMJW   '                                               
         DC    C'XTX',C'FDMJW   '                                               
         DC    C'XWA',C'FDMJW   '                                               
         DC    C'XWI',C'FDMJW   '                                               
         DC    C'Y1A',C'FDMJW   '                                               
         DC    C'Y1B',C'FDMJW   '                                               
         DC    C'Y1C',C'FDMJW   '                                               
         DC    C'Y1D',C'FDMJW   '                                               
         DC    C'Y1E',C'FDMJW   '                                               
         DC    C'Y1F',C'FDMJW   '                                               
         DC    C'Y1G',C'FDMJW   '                                               
         DC    C'Y1H',C'FDMJW   '                                               
         DC    C'Y1I',C'FDMJW   '                                               
         DC    C'Y1J',C'FDMJW   '                                               
         DC    C'Y1K',C'FDMJW   '                                               
         DC    C'Y1L',C'FDMJW   '                                               
         DC    C'Y1M',C'FDMJW   '                                               
         DC    C'Y1N',C'FDMJW   '                                               
         DC    C'Y1O',C'FDMJW   '                                               
         DC    C'Y1P',C'FDMJW   '                                               
         DC    C'Y1Q',C'FDMJW   '                                               
         DC    C'Y1R',C'FDMJW   '                                               
         DC    C'Y1S',C'FDMJW   '                                               
         DC    C'Y1T',C'FDMJW   '                                               
         DC    C'Y1U',C'FDMJW   '                                               
         DC    C'Y1V',C'FDMJW   '                                               
         DC    C'Y1W',C'FDMJW   '                                               
         DC    C'Y1X',C'FDMJW   '                                               
         DC    C'Y1Y',C'FDMJW   '                                               
         DC    C'Y1Z',C'FDMJW   '                                               
         DC    C'YA ',C'FDMJW   '                                               
         DC    C'YB ',C'FDMJW   '                                               
         DC    C'YBF',C'FDMJW   '                                               
         DC    C'YC ',C'FDMJW   '                                               
         DC    C'YCA',C'FDMJW   '                                               
         DC    C'YCD',C'FDMJW   '                                               
         DC    C'YCL',C'FDMJW   '                                               
         DC    C'YCM',C'FDMJW   '                                               
         DC    C'YDF',C'FDMJW   '                                               
         DC    C'YE ',C'FDMJW   '                                               
         DC    C'YEP',C'FDMJW   '                                               
         DC    C'YER',C'FDMJW   '                                               
         DC    C'YFV',C'FDMJW   '                                               
         DC    C'YG ',C'FDMJW   '                                               
         DC    C'YH ',C'FDMJW   '                                               
         DC    C'YHI',C'FDMJW   '                                               
         DC    C'YHO',C'MSNYA   '                                               
         DC    C'YHU',C'FDMJW   '                                               
         DC    C'YI ',C'FDMJW   '                                               
         DC    C'YJ ',C'FDMJW   '                                               
         DC    C'YK ',C'FDMJW   '                                               
         DC    C'YKC',C'FDMJW   '                                               
         DC    C'YL ',C'FDMJW   '                                               
         DC    C'YLD',C'FDMJW   '                                               
         DC    C'YM ',C'FDMJW   '                                               
         DC    C'YMD',C'FDMJW   '                                               
         DC    C'YMO',C'FDMJW   '                                               
         DC    C'YNA',C'FDMJW   '                                               
         DC    C'YNE',C'FDMJW   '                                               
         DC    C'YNM',C'FDMJW   '                                               
         DC    C'YNT',C'FDMJW   '                                               
         DC    C'YNW',C'FDMJW   '                                               
         DC    C'YR ',C'FDMJW   '                                               
         DC    C'YSD',C'FDMJW   '                                               
         DC    C'YSL',C'FDMJW   '                                               
         DC    C'YTC',C'FDMJW   '                                               
         DC    C'YTM',C'FDMJW   '                                               
         DC    C'YTO',C'FDMJW   '                                               
         DC    C'YTR',C'FDMJW   '                                               
         DC    C'YTX',C'FDMJW   '                                               
         DC    C'YWA',C'FDMJW   '                                               
         DC    C'YZ ',C'FDMJW   '                                               
         DC    C'Z1A',C'FDMJW   '                                               
         DC    C'Z1B',C'FDMJW   '                                               
         DC    C'Z1C',C'FDMJW   '                                               
         DC    C'Z1D',C'FDMJW   '                                               
         DC    C'Z1F',C'FDMJW   '                                               
         DC    C'Z1G',C'FDMJW   '                                               
         DC    C'Z1H',C'FDMJW   '                                               
         DC    C'Z1I',C'FDMJW   '                                               
         DC    C'Z1P',C'FDMJW   '                                               
         DC    C'Z1S',C'FDMJW   '                                               
         DC    C'Z1U',C'FDMJW   '                                               
         DC    C'ZA ',C'FDMJW   '                                               
         DC    C'ZAZ',C'FDMJW   '                                               
         DC    C'ZB ',C'FDMJW   '                                               
         DC    C'ZC ',C'FDMJW   '                                               
         DC    C'ZCD',C'FDMJW   '                                               
         DC    C'ZCM',C'FDMJW   '                                               
         DC    C'ZFD',C'FDMJW   '                                               
         DC    C'ZGR',C'FDMJW   '                                               
         DC    C'ZH ',C'FDMJW   '                                               
         DC    C'ZID',C'FDMJW   '                                               
         DC    C'ZIM',C'FDMJW   '                                               
         DC    C'ZJ ',C'FDMJW   '                                               
         DC    C'ZLD',C'FDMJW   '                                               
         DC    C'ZLM',C'FDMJW   '                                               
         DC    C'ZLV',C'FDMJW   '                                               
         DC    C'ZNE',C'FDMJW   '                                               
         DC    C'ZR ',C'FDMJW   '                                               
         DC    C'ZRC',C'FDMJW   '                                               
         DC    C'ZRH',C'MSNYA   '                                               
         DC    C'ZSD',C'FDMJW   '                                               
         DC    C'ZSF',C'FDMJW   '                                               
         DC    C'ZSL',C'FDMJW   '                                               
         DC    C'ZT ',C'FDMJW   '                                               
         DC    C'ZTR',C'FDMJW   '                                               
*                                                                               
         DC    X'FF'                                                            
*                                                                               
**PAN#1  CSECT                                                                  
**PAN#1  DC    CL21'128SPEZF26   12/01/17'                                      
         END                                                                    
