*          DATA SET SRFAD03    AT LEVEL 002 AS OF 08/22/00                      
*          DATA SET SRFAD01    AT LEVEL 009 AS OF 09/21/90                      
*PHASE T15EA3A                                                                  
T15E01C  CSECT                                                                  
         DC    X'0000',C'ATCTJESSE',X'01',C'1',X'11'                            
         DC    C'JES JOB SUBMITTER'                                             
         DC    X'0001',C'ATCNAME S',X'03',C'CL8',X'12'                          
         DC    C'ATTACHED TASK NAME'                                            
         DC    X'0009',C'ATCSTAT1S',X'01',C'X',X'0B',C'TASK STATUS'             
         DC    X'0000',C'ATCSATCHE',X'05',C'X''80''',X'10'                      
         DC    C'TASK IS ATTACHED'                                              
         DC    X'0000',C'ATCSERRSE',X'05',C'X''40''',X'20'                      
         DC    C'ERROR HAS OCCURED (SEE ATCSTAT2)'                              
         DC    X'0000',C'ATCSAACTE',X'05',C'X''20''',X'1E'                      
         DC    C'ASYNCHRONOUS ROUTINE IS ACTIVE'                                
         DC    X'0000',C'ATCSSACTE',X'05',C'X''10''',X'1D'                      
         DC    C'SYNCHRONOUS ROUTINE IS ACTIVE'                                 
         DC    X'0000',C'ATCSBUSYE',X'11',C'ATCSAACT+ATCSSACT',X'0C'            
         DC    C'TASK IS BUSY'                                                  
         DC    X'0000',C'ATCSTESTE',X'19',C'1234567890123456789012345'          
         DC    X'0C',C'TASK IS BUSY'                                            
         DC    X'000A',C'ATCSTAT2S',X'01',C'X',X'0C'                            
         DC    C'ERROR STATUS'                                                  
         DC    X'0000',C'ATCSIOERE',X'05',C'X''80''',X'09'                      
         DC    C'I/O ERROR'                                                     
         DC    X'0000',C'ATCSGMERE',X'05',C'X''40''',X'0D'                      
         DC    C'GETMAIN ERROR'                                                 
         DC    X'0000',C'ATCSLDERE',X'05',C'X''20''',X'0A'                      
         DC    C'LOAD ERROR'                                                    
         DC    X'0000',C'ATCSUDERE',X'05',C'X''10''',X'0F'                      
         DC    C'UNDEFINED ERROR'                                               
         DC    X'000B',C'ATCSTATIS',X'01',C'X',X'1F'                            
         DC    C'TASK STATUS (BITS VARY BY TYPE)'                               
         DC    X'FFFFFF',C'TESTMEMBER'                                          
         DC    X'0000',C'TSTDSECTD',X'00',X'0C',C'JUST TESTING'                 
         DC    X'0000',C'NOTHING S',X'04',C'CL80',X'0F'                         
         DC    C'NOTHING IN HERE'                                               
         DC    X'FFFF00'                                                        
**PAN#1  CSECT                                                                  
**PAN#1  DC    CL21'002SRFAD03   08/22/00'                                      
         END                                                                    
