*          DATA SET SRTWX01    AT LEVEL 002 AS OF 08/22/00                      
*PHASE T14701A                                                                  
         TITLE '$TWX - HELP=YES MESSAGE'                                        
T14701   CSECT                                                                  
HELPMESS DS    0CL78                                                            
         DC    CL39'AUTHORIZATION - INPUT A CODE THAT IS VA'                    
         DC    CL39'LID FOR THIS TERMINAL AND USER.        '                    
         DC    CL39'SEND TO       - INPUT ONE OR MORE ADDRE'                    
         DC    CL39'SSEE CODES AND/OR ADDRESSEE LIST CODES,'                    
         DC    CL39'                SEPARATED BY ''+'' OR ''-'''                
         DC    CL39', EG. ''LISTA+LISTB-NAMX-NAMY+LISTC''. '                    
         DC    CL39'THE MESSAGE   - INPUT UP TO 21 MESSAGE '                    
         DC    CL39'LINES AND POSITION THE CURSOR PAST THE '                    
         DC    CL39'                END OF THE MESSAGE BEFO'                    
         DC    CL39'RE PRESSING ''ENTER''.'                                     
         DC    CL39'THE KEYWORDS BELOW CAUSE SPECIAL ACTION'                    
         DC    CL39'S IF INPUT IN COL.1 OF ANY MESSAGE LINE'                    
         DC    CL39'1 REPORT=RRR,9999(,START=99,END=99,PAGE'                    
         DC    CL39'=99,FORCE)                             '                    
         DC    CL39'     RRR,9999   IS THE ID OF A REPORT O'                    
         DC    CL39'N THE USER''S PRINT QUEUE              '                    
         DC    CL39'     START=99   IS THE START PAGE NUMBE'                    
         DC    CL39'R, END=99 IS THE END PAGE NUMBER.      '                    
         DC    CL39'     PAGE=99    IS THE SINGLE PAGE NUMB'                    
         DC    CL39'ER REQUIRED.                           '                    
         DC    CL39'     FORCE      WILL FORCE PRINTING REG'                    
         DC    CL39'ARDLESS OF REPORT SIZE.                '                    
         DC    CL39'2 STATUS=OK     WILL CAUSE THE PRECEDIN'                    
         DC    CL39'G MESSAGE, CONTAINING ''TEXT='', TO BE '                    
         DC    CL39'                SENT WITHOUT FIRST BEIN'                    
         DC    CL39'G DISPLAYED IN EXPANDED FORM.          '                    
         DC    CL39'3 TEXT=TTTTTTTTTT(,A=B,C=D ETC.)       '                    
         DC    CL39'                                       '                    
         DC    CL39'     TTTTTTTTTT IS THE ID OF SOME LIBRA'                    
         DC    CL39'RY TEXT BELONGING TO THE USER.         '                    
         DC    CL39'     A=B,C=D    ARE SUBSTITUTION REQUES'                    
         DC    CL39'TS (REPLACE ALL INSTANCES OF A WITH B).'                    
         DC    CL39'4 TWX=TTT,9999                         '                    
         DC    CL39'                                       '                    
         DC    CL39'     TTT,9999   IS THE ID OF A SENDER''S'                   
         DC    CL39' COPY OF A TWX ON THE USER''S PRINT    '                    
         DC    CL39'                QUEUE. THE EFFECT IS TO'                    
         DC    CL39' RE-DISPLAY THE TWX SO THAT IT CAN BE  '                    
         DC    CL39'                SENT AGAIN, AFTER MODIF'                    
         DC    CL39'ICATION IF DESIRED'                    '                    
**PAN#1  CSECT                                                                  
**PAN#1  DC    CL21'002SRTWX01   08/22/00'                                      
         END                                                                    
