*          DATA SET STEXTCCA   AT LEVEL 005 AS OF 08/10/93                      
*          DATA SET STEXTCC    AT LEVEL 038 AS OF 07/12/93                      
*PHASE STEXTCCA,*                                                               
*INCLUDE PRINT                                                                  
*INCLUDE PRINTER                                                                
*INCLUDE PRNTBL                                                                 
         TITLE 'DMLDEXT - LOAD/DUMP MODEL EXTERNAL ROUTINE'                     
* SPOT4 MARKET FIX FOR CCUSA RADIO STATIONS AND MARKET RECS                     
* JUN11/93                                                                      
*                                                                               
* SPOT4 MARKET FIX FOR CCUSA RADIO STATIONS AND MARKET RECS                     
* APR22/92                                                                      
         SPACE                                                                  
*                                                                               
* PARAMETER LIST                                                                
*                                                                               
* P1=A(RECORD)  PASS FIRST BYTE X'00'= INITIALISE                               
*                               X'01'= RECORD IN CORE                           
*                               X'FF'= END OF FILE                              
*               RETURN VALUE    X'00'= KEEP RECORD                              
*                               X'FF'= PURGE RECORD                             
*                               X'FF'/C'EOJ'=PURGE & CAUSE EOJ                  
* P2=A(FILEOUT) PASS FIRST BYTE X'80'= TAPE INPUT                               
*                               X'40'= TAPE OUTPUT                              
*                               X'20'= RECORD IS I/S FILE RECORD                
* P3=A(PARAM CARD)                                                              
* P4=A(FILE DEFN)                                                               
* P5=A(PRINTER)                                                                 
* P6=A(CPRINT)                                                                  
*                                                                               
         PRINT NOGEN                                                            
DMLDEXT  CSECT                                                                  
         NMOD1 20,DMLDEXT                                                       
         USING WORKD,RC                                                         
         EJECT                                                                  
*                                                                               
* CONTROL FLOW LOGIC                                                            
*                                                                               
DMXCTL   ST    R1,APARM            SAVE PARAMETERS                              
         MVC   PLIST,0(R1)                                                      
         L     RA,VCPRINT          SET UP FOR PRINTING                          
         USING DPRINT,RA                                                        
         SPACE 2                                                                
         CLI   PLIST,X'00'                                                      
         BE    DMXINIT             INITIALISE                                   
         CLI   PLIST,X'01'                                                      
         BE    DMXREC              PROCESS                                      
         CLI   PLIST,X'FF'                                                      
         BE    DMXEOF              END-OF-FILE                                  
         B     DMXIT                                                            
         SPACE 2                                                                
DMXKEEP  L     R1,APARM            KEEP RECORD EXIT                             
         MVI   0(R1),0                                                          
         B     DMXIT                                                            
                                                                                
*&&UK                                                                           
         L     R3,AREC                                                          
         SR    R0,R0                                                            
         ICM   R0,3,15(R3)         GET LENGTH                                   
         AH    R0,=H'4'                                                         
         SLL   R0,16                                                            
         SH    R3,=H'4'                                                         
         ST    R0,0(R3)            SET LENGTH IN FRONT OF RECORD                
         PUT   FILEOUT,(3)                                                      
         B     DMXPURGE                                                         
*&&                                                                             
         SPACE 2                                                                
DMXPURGE L     R1,APARM            PURGE RECORD EXIT                            
         MVI   0(R1),X'FF'                                                      
         B     DMXIT                                                            
         SPACE 2                                                                
DMXPGEOF L     R1,APARM            PURGE AND CAUSE INPUT EOF EXIT               
         MVI   0(R1),X'FF'                                                      
         MVC   1(3,R1),=C'EOF'                                                  
         B     DMXIT                                                            
         SPACE 2                                                                
DMXIT    XMOD1 1                                                                
         EJECT                                                                  
*                                                                               
* INITIALISE LOGIC                                                              
*                                                                               
DMXINIT  DS    0H                                                               
**NO-OP* OPEN  (FILEOUT,(OUTPUT))                                               
*                                                                               
         LA    R2,MTABLEN                                                       
         LA    R3,MTABLE                                                        
*                                                                               
INIT10   LA    R4,MTABLEN                                                       
         LA    R5,MTABLE                                                        
*                                                                               
INIT20   CR    R3,R5               SAME ENTRY                                   
         BE    INIT24                                                           
         CLC   8(5,R3),SPACES    SPECIAL FOR A SINGLE STATION                   
         BH    INIT24                                                           
         CLC   4(4,R3),4(R5)     DUPE MKT                                       
         BNE   INIT22                                                           
         MVC   P(7),=C'OLD MKT'                                                 
         MVC   P+8(4),4(R3)                                                     
         MVC   P+20(10),=C'OLD MARKET'                                          
         MVC   P+31(4),4(R5)                                                    
         GOTO1 VPRINTER                                                         
         SPACE                                                                  
INIT22   CLC   0(4,R3),0(R5) SAME NEW MARKET                                    
         BNE   INIT24                                                           
         CLC   8(5,R5),SPACES    SPECIAL FOR A SINGLE STATION                   
         BH    INIT24                                                           
         MVC   P+10(12),=C'SAME NEW MKT'                                        
         MVC   P+25(4),0(R3)                                                    
         MVC   P+33(3),=C'FOR'                                                  
         MVC   P+38(4),4(R3)                                                    
         MVC   P+45(4),4(R5)                                                    
         GOTO1 VPRINTER                                                         
         SPACE                                                                  
INIT24   LA    R5,L'MTABENT(,R5)                                                
         BCT   R4,INIT20                                                        
         LA    R3,L'MTABENT(,R3)                                                
         BCT   R2,INIT10                                                        
         SPACE                                                                  
         B     DMXIT                                                            
         EJECT                                                                  
*                                                                               
* PROCESS RECORD LOGIC                                                          
*                                                                               
DMXREC   DS    0H                                                               
         L     R3,AREC             POINT TO RECORD                              
         AP    TOTRD,=P'1'                                                      
*                                                                               
         USING STARECD,R3                                                       
         CLI   STAKTYPE,C'M'       MARKET REC?                                  
         BE    STMKT                                                            
         CLI   STAKTYPE,C'S'       STATION REC?                                 
         BNE   DMXKEEP                                                          
         CLI   STAKMED,C'R'        MEDIA RADIO                                  
         BNE   DMXKEEP                                                          
         CLC   STAKAGY,=C'CC'      CCUSA                                        
         BNE   DMXKEEP                                                          
         AP    TSTACT,=P'1'                                                     
*                                                                               
         LA    R4,MTABLEN                                                       
         LA    R5,MTABLE                                                        
         USING MTABLED,R5                                                       
*                                                                               
STSTA10  CLC   SMKT,MOLDMKT        IS THIS THE OLD MKT                          
         BNE   STSTA14                                                          
         CLC   MSTA,=C'     '        CHANGE ENTIRE MARKET                       
         BE    STSTA12                                                          
         CLC   STAKCALL,MSTA       CHANGE ONLY THIS STATION                     
         BNE   STSTA14                                                          
*                                                                               
STSTA12  MVC   SMKT,MNEWMKT                                                     
         MVI   MSTACHG,C'Y'                                                     
         MVC   P(7),=C'STA REC'                                                 
         MVC   P+10(7),=C'STATION'                                              
         MVC   P+18(5),STAKCALL                                                 
*                                                                               
         MVC   P+25(7),=C'OLD MKT'                                              
         MVC   P+35(4),MOLDMKT                                                  
*                                                                               
         MVC   P+45(7),=C'NEW MKT'                                              
         MVC   P+55(4),MNEWMKT                                                  
         GOTO1 VPRINTER                                                         
         AP    TSTANEW,=P'1'                                                    
         B     DMXKEEP                                                          
*                                                                               
         BC    0,DMXKEEP                                                        
         MVI   *-3,X'F0'                                                        
         LA    R4,=CL20'STA NEW MKT'                                            
         B     PRT                                                              
         SPACE                                                                  
STSTA14  LA    R5,MTABNXT                                                       
         BCT   R4,STSTA10                                                       
*                                                                               
         MVC   P(7),=C'STA REC'                                                 
         MVC   P+10(7),=C'STATION'                                              
         MVC   P+18(5),STAKCALL                                                 
         MVC   P+25(7),=C'OLD MKT'                                              
         MVC   P+35(4),SMKT                                                     
*                                                                               
         MVC   P+45(11),=C'NOT CHANGED'                                         
         GOTO1 VPRINTER                                                         
         B     DMXKEEP                                                          
         DROP  R3                                                               
         SPACE                                                                  
* FIX THE MARKET RECS HERE                                                      
*                                                                               
         USING MKTRECD,R3                                                       
STMKT    CLI   MKTKMED,C'R'        MEDIA RADIO                                  
         BNE   DMXKEEP                                                          
         CLC   MKTKAGY,=C'CC'      CCUSA                                        
         BNE   DMXKEEP                                                          
         AP    TMKTCT,=P'1'                                                     
*                                                                               
         LA    R4,MTABLEN                                                       
         LA    R5,MTABLE                                                        
         USING MTABLED,R5                                                       
*                                                                               
STMKT10  CLC   MKTKMKT,MOLDMKT                                                  
         BNE   STMKT14                                                          
         CLC   MSTA,=C'     '        IS THIS CHANGE FOR ENTIRE MKT              
         BNE   STMKT14                                                          
         MVC   MKTKMKT,MNEWMKT                                                  
         MVI   MMKTCHG,C'Y'                                                     
         AP    TMKTNEW,=P'1'                                                    
         MVC   P(7),=C'MKT REC'                                                 
         MVC   P+10(7),=C'OLD MKT'                                              
         MVC   P+18(4),MOLDMKT                                                  
         MVC   P+25(3),=C'NEW'                                                  
         MVC   P+30(4),MNEWMKT                                                  
         GOTO1 VPRINTER                                                         
***      B     DMXKEEP                                                          
*                                                                               
         BC    0,DMXKEEP                                                        
         MVI   *-3,X'F0'                                                        
         LA    R4,=CL20'MKT RECORD'                                             
         B     PRT                                                              
*                                                                               
STMKT14  LA    R5,MTABNXT                                                       
         BCT   R4,STMKT10                                                       
*                                                                               
         MVC   P(7),=C'MKT REC'                                                 
         MVC   P+10(4),MKTKMKT                                                  
         MVC   P+15(11),=C'NOT CHANGED'                                         
         GOTO1 VPRINTER                                                         
         LA    R4,=CL20'MKT RECORD'                                             
         B     DMXKEEP                                                          
         DROP  R3                                                               
         EJECT                                                                  
PRT      DS    0H                                                               
         LA    R5,144                                                           
         SPACE                                                                  
         GOTO1 =V(PRNTBL),DMCB,(20,(R4)),(R3),C'DUMP',(R5),=C'0D'               
         B     DMXKEEP                                                          
         SPACE                                                                  
*                                                                               
* END-OF-FILE LOGIC                                                             
*                                                                               
DMXEOF   DS    0H                                                               
*NO-OP   CLOSE FILEOUT                                                          
*                                                                               
         GOTO1 VPRINTER                                                         
         LA    R4,MTABLEN                                                       
         LA    R5,MTABLE                                                        
         USING MTABLED,R5                                                       
*                                                                               
DMXE10   CLC   MSTA,=C'     '                                                   
         BH    DMXE20                                                           
         CLI   MMKTCHG,C'Y'                                                     
         BE    DMXE20                                                           
         MVC   P(6),=C'MARKET'                                                  
         B     DMXE30                                                           
*                                                                               
DMXE20   CLI   MSTACHG,C'Y'                                                     
         BE    DMXE40                                                           
         MVC   P(7),=C'STATION'                                                 
         MVC   P+40(7),=C'STATION'                                              
         MVC   P+49(5),MSTA                                                     
*                                                                               
DMXE30   MVC   P+8(14),=C'DID NOT CHANGE'                                       
         MVC   P+25(7),=C'OLD MKT'                                              
         MVC   P+34(4),MOLDMKT                                                  
*                                                                               
DMXE40   LA    R5,MTABNXT                                                       
         BCT   R4,DMXE10                                                        
*                                                                               
         MVC   P(100),RTITLE                                                    
         GOTO1 VPRINTER                                                         
         LA    R2,TOTCTRS                                                       
         LA    R3,TOTRD                                                         
DMXEOF10 MVC   P+5(28),5(R3)                                                    
         EDIT  (P5,0(R3)),(8,P+33)                                              
         GOTO1 VPRINTER                                                         
         LA    R3,33(,R3)                                                       
         BCT   R2,DMXEOF10                                                      
         SPACE                                                                  
         GOTO1 VPRINTER                                                         
         GOTO1 VPRINTER                                                         
         SPACE                                                                  
         B     DMXIT                                                            
         EJECT                                                                  
TOTRD    DC    PL5'0',CL28'TOT RECS READ'                                       
TSTACT   DC    PL5'0',CL28'TOT STA RECS'                                        
TSTANEW  DC    PL5'0',CL28'TOT STAS NEW'                                        
TMKTCT   DC    PL5'0',CL28'TOT MKT RECS'                                        
TMKTNEW  DC    PL5'0',CL28'TOT MKTS NEW'                                        
TOTCTRS  EQU   (*-TOTRD)/33                                                     
          SPACE                                                                 
WORK     DS    CL64                                                             
         SPACE                                                                  
RTITLE   DC    CL100'RADIO STATION REC MARKET FIX FOR CCUSA'                    
         LTORG                                                                  
          SPACE                                                                 
**LEOUT  DCB   DDNAME=FILEOUT,DSORG=PS,MACRF=(PM),                    X         
**             RECFM=VB,LRECL=4004,BUFNO=2,BLKSIZE=32760                        
          SPACE                                                                 
         DS    0D                                                               
MTABLE   DC    C'3001',C'0051',C'WAEZF',X'000000'                               
         DC    C'3001',C'0086',C'WQMSA',X'000000'                               
         DC    C'3006',C'0328',C'WBETA',X'000000'                               
         DC    C'3006',C'0341',C'WETBA',X'000000'                               
         DC    C'3006',C'0364',C'WBTXA',X'000000'                               
         DC    C'3006',C'2559',C'KGHMA',X'000000'                               
         DC    C'3013',C'1080',C'WEMBA',X'000000'                               
         DC    C'3014',C'1199',C'KCCOA',X'000000'                               
         DC    C'3014',C'1218',C'KBRRA',X'000000'                               
         DC    C'3014',C'1243',C'WNONF',X'000000'                               
         DC    C'3014',C'1255',C'WLBNA',X'000000'                               
         DC    C'3014',C'3170',C'KCLOA',X'000000'                               
         DC    C'3016',C'1288',C'WLCCF',X'000000'                               
         DC    C'3016',C'1290',C'KAFXF',X'000000'                               
         DC    C'3016',C'1292',C'WAGRA',X'000000'                               
         DC    C'3018',C'1635',C'WAJBA',X'000000'                               
         DC    C'3024',C'0755',C'WFAIA',X'000000'                               
         DC    C'3024',C'0775',C'KYTMF',X'000000'                               
         DC    C'3024',C'2823',C'WCTDF',X'000000'                               
         DC    C'3127',C'0679',C'WCEIA',X'000000'                               
         DC    C'3127',C'0680',C'WXPQA',X'000000'                               
         DC    C'3127',C'0682',C'WHTGA',X'000000'                               
         DC    C'3127',C'0692',C'WUFFA',X'000000'                               
         DC    C'3127',C'0710',C'KRADA',X'000000'                               
         DC    C'3127',C'0714',C'KERCA',X'000000'                               
         DC    C'3127',C'0724',C'AGRIA',X'000000'                               
         DC    C'3127',C'0726',C'WIXYA',X'000000'                               
         DC    C'3127',C'0738',C'WESLA',X'000000'                               
         DC    C'3127',C'2682',C'WFXCF',X'000000'                               
         DC    C'3127',C'2684',C'WTROA',X'000000'                               
         DC    C'3127',C'0674',C'     ',X'000000'                               
         DC    C'3127',C'0708',C'     ',X'000000'                               
         DC    C'3127',C'2745',C'     ',X'000000'                               
         DC    C'3127',C'2747',C'     ',X'000000'                               
         DC    C'3158',C'0288',C'WBCOA',X'000000'                               
         DC    C'3158',C'0335',C'WBHNA',X'000000'                               
         DC    C'3158',C'0345',C'WBUCA',X'000000'                               
         DC    C'3158',C'0347',C'KAGCA',X'000000'                               
         DC    C'3158',C'0350',C'WGCOF',X'000000'                               
         DC    C'3158',C'0351',C'WADVF',X'000000'                               
         DC    C'3158',C'0352',C'KRWCA',X'000000'                               
         DC    C'3158',C'0353',C'KBBSA',X'000000'                               
         DC    C'3158',C'0357',C'KBARA',X'000000'                               
         DC    C'3158',C'0358',C'WKYRA',X'000000'                               
         DC    C'3158',C'2556',C'KBASA',X'000000'                               
         DC    C'3158',C'2502',C'     ',X'000000'                               
         DC    C'3158',C'2555',C'     ',X'000000'                               
         DC    C'3163',C'1488',C'KBHCA',X'000000'                               
         DC    C'3163',C'1502',C'WHOBF',X'000000'                               
         DC    C'3163',C'1525',C'KVONA',X'000000'                               
         DC    C'3163',C'1526',C'WNDHF',X'000000'                               
         DC    C'3163',C'1531',C'KDETA',X'000000'                               
         DC    C'3163',C'1569',C'KBNYF',X'000000'                               
         DC    C'3163',C'3302',C'WMJWF',X'000000'                               
         DC    C'3171',C'2017',C'KFMRF',X'000000'                               
         DC    C'3181',C'1422',C'KBTOF',X'000000'                               
         DC    C'3181',C'1430',C'KIRTA',X'000000'                               
         DC    C'3225',C'2084',C'KALMA',X'000000'                               
         DC    C'3225',C'2103',C'KADOA',X'000000'                               
         DC    C'3251',C'0266',C'KUETA',X'000000'                               
         DC    C'3251',C'0269',C'KXOFF',X'000000'                               
         DC    C'3251',C'0289',C'WBMSA',X'000000'                               
         DC    C'3251',C'0291',C'KBMRA',X'000000'                               
         DC    C'3251',C'0292',C'KLTRA',X'000000'                               
         DC    C'3251',C'0297',C'KARIA',X'000000'                               
         DC    C'3251',C'0298',C'WBBKA',X'000000'                               
         DC    C'3251',C'0299',C'KBLIA',X'000000'                               
         DC    C'3251',C'0300',C'WKEXA',X'000000'                               
         DC    C'3251',C'0307',C'KUTAA',X'000000'                               
         DC    C'3251',C'0267',C'     ',X'000000'                               
         DC    C'3251',C'0304',C'     ',X'000000'                               
         DC    C'3251',C'2573',C'     ',X'000000'                               
         DC    C'3252',C'0845',C'KDWZF',X'000000'                               
         DC    C'3269',C'0768',C'KEZAF',X'000000'                               
         DC    C'3291',C'1712',C'KAPIA',X'000000'                               
         DC    C'3291',C'1714',C'GRCTA',X'000000'                               
         DC    C'3291',C'3417',C'WSCPA',X'000000'                               
         DC    C'3294',C'1018',C'WAMXA',X'000000'                               
         DC    C'3500',C'1681',C'WASYF',X'000000'                               
         DC    C'3501',C'1521',C'GNYRA',X'000000'                               
         DC    C'3501',C'1524',C'WHLDA',X'000000'                               
         DC    C'3501',C'1527',C'WAORF',X'000000'                               
         DC    C'3501',C'3335',C'KAYNF',X'000000'                               
         DC    C'3501',C'1563',C'     ',X'000000'                               
         DC    C'3501',C'3111',C'     ',X'000000'                               
         DC    C'3502',C'0271',C'WAALF',X'000000'                               
         DC    C'3503',C'1311',C'WAYSF',X'000000'                               
         DC    C'3504',C'1651',C'KYW A',X'000000'                               
         DC    C'3504',C'1652',C'WPHBA',X'000000'                               
         DC    C'3504',C'1653',C'KKANA',X'000000'                               
         DC    C'3505',C'0636',C'WIXNA',X'000000'                               
         DC    C'3505',C'0642',C'WBDXA',X'000000'                               
         DC    C'3505',C'0644',C'KDHNA',X'000000'                               
         DC    C'3505',C'0649',C'KDLRA',X'000000'                               
         DC    C'3505',C'0650',C'KSPLA',X'000000'                               
         DC    C'3505',C'0651',C'CKJIF',X'000000'                               
         DC    C'3505',C'0652',C'WDSCA',X'000000'                               
         DC    C'3505',C'0653',C'KDEWA',X'000000'                               
         DC    C'3505',C'0654',C'KDBIA',X'000000'                               
         DC    C'3505',C'0656',C'KDIXA',X'000000'                               
         DC    C'3505',C'2632',C'KDEXA',X'000000'                               
         DC    C'3506',C'0321',C'WACQF',X'000000'                               
         DC    C'3506',C'0322',C'KADEA',X'000000'                               
         DC    C'3507',C'1930',C'WKWXF',X'000000'                               
         DC    C'3507',C'1931',C'WAEVF',X'000000'                               
         DC    C'3507',C'1932',C'WWWDA',X'000000'                               
         DC    C'3507',C'1935',C'WYALA',X'000000'                               
         DC    C'3507',C'1983',C'WATSA',X'000000'                               
         DC    C'3507',C'3495',C'KCGMF',X'000000'                               
         DC    C'3508',C'1671',C'KDKAA',X'000000'                               
         DC    C'3509',C'0788',C'KSAXA',X'000000'                               
         DC    C'3509',C'0803',C'COOLF',X'000000'                               
         DC    C'3509',C'0820',C'WOSCA',X'000000'                               
         DC    C'3509',C'0824',C'WAKSA',X'000000'                               
         DC    C'3509',C'0825',C'WFULA',X'000000'                               
         DC    C'3509',C'0828',C'WAGIF',X'000000'                               
         DC    C'3509',C'0829',C'WAAXA',X'000000'                               
         DC    C'3509',C'2815',C'WFTOA',X'000000'                               
         DC    C'3509',C'2816',C'KFALA',X'000000'                               
         DC    C'3511',C'2211',C'WASHF',X'000000'                               
         DC    C'3511',C'2212',C'WLOVA',X'000000'                               
         DC    C'3511',C'3842',C'WAMWA',X'000000'                               
         DC    C'3512',C'0191',C'BORNA',X'000000'                               
         DC    C'3512',C'0192',C'WWBDA',X'000000'                               
         DC    C'3513',C'0761',C'CGERA',X'000000'                               
         DC    C'3513',C'0770',C'WTCBA',X'000000'                               
         DC    C'3513',C'2821',C'     ',X'000000'                               
         DC    C'3515',C'0487',C'WWCHA',X'000000'                               
         DC    C'3515',C'0491',C'WARMF',X'000000'                               
         DC    C'3515',C'0495',C'WFCBA',X'000000'                               
         DC    C'3515',C'0500',C'WEZZF',X'000000'                               
         DC    C'3515',C'0504',C'WIAFA',X'000000'                               
         DC    C'3515',C'2617',C'KQISF',X'000000'                               
         DC    C'3516',C'0711',C'WCCKF',X'000000'                               
         DC    C'3516',C'2749',C'     ',X'000000'                               
         DC    C'3517',C'0431',C'WAMEA',X'000000'                               
         DC    C'3517',C'0435',C'VANNA',X'000000'                               
         DC    C'3517',C'0436',C'WMEKA',X'000000'                               
         DC    C'3517',C'0440',C'WKBYA',X'000000'                               
         DC    C'3518',C'0890',C'WMJDF',X'000000'                               
         DC    C'3518',C'0891',C'WAAAA',X'000000'                               
         DC    C'3518',C'2218',C'KCNBF',X'000000'                               
         DC    C'3518',C'0892',C'     ',X'000000'                               
         DC    C'3519',C'0421',C'WAVFF',X'000000'                               
         DC    C'3519',C'0422',C'WXVAA',X'000000'                               
         DC    C'3519',C'0430',C'WVOYA',X'000000'                               
         DC    C'3520',C'0008',C'WAURF',X'000000'                               
         DC    C'3520',C'0009',C'KSWMA',X'000000'                               
         DC    C'3520',C'0161',C'WAUGA',X'000000'                               
         DC    C'3520',C'0162',C'WFAUA',X'000000'                               
         DC    C'3520',C'0167',C'WACXA',X'000000'                               
         DC    C'3520',C'2508',C'     ',X'000000'                               
         DC    C'3520',C'4026',C'     ',X'000000'                               
         DC    C'3521',C'1703',C'KARBF',X'000000'                               
         DC    C'3521',C'1713',C'KAYKA',X'000000'                               
         DC    C'3522',C'0551',C'WAGHF',X'000000'                               
         DC    C'3523',C'0354',C'KNABA',X'000000'                               
         DC    C'3523',C'0369',C'WCVRA',X'000000'                               
         DC    C'3524',C'0151',C'GANNA',X'000000'                               
         DC    C'3524',C'0152',C'WAYVA',X'000000'                               
         DC    C'3524',C'0154',C'KALTA',X'000000'                               
         DC    C'3525',C'0054',C'KATEA',X'000000'                               
         DC    C'3525',C'0056',C'WAVUA',X'000000'                               
         DC    C'3525',C'0069',C'WANYA',X'000000'                               
         DC    C'3525',C'0070',C'WALGA',X'000000'                               
         DC    C'3525',C'0072',C'KHPEF',X'000000'                               
         DC    C'3525',C'0073',C'WABZF',X'000000'                               
         DC    C'3528',C'1396',C'WPFBA',X'000000'                               
         DC    C'3528',C'1397',C'KCHXF',X'000000'                               
         DC    C'3528',C'1400',C'WMPOA',X'000000'                               
         DC    C'3528',C'1401',C'WAIAF',X'000000'                               
         DC    C'3528',C'1402',C'WEFMF',X'000000'                               
         DC    C'3528',C'1403',C'WAFIA',X'000000'                               
         DC    C'3528',C'1404',C'WCVMF',X'000000'                               
         DC    C'3528',C'1405',C'WALLA',X'000000'                               
         DC    C'3528',C'1406',C'WMPXA',X'000000'                               
         DC    C'3528',C'1413',C'WCNXA',X'000000'                               
         DC    C'3528',C'1417',C'KGLCA',X'000000'                               
         DC    C'3528',C'1429',C'KMSDA',X'000000'                               
         DC    C'3528',C'1489',C'MFRNA',X'000000'                               
         DC    C'3528',C'3198',C'WXKYA',X'000000'                               
         DC    C'3529',C'0941',C'KBFMF',X'000000'                               
         DC    C'3529',C'1281',C'FKYNA',X'000000'                               
         DC    C'3529',C'1282',C'WLFMA',X'000000'                               
         DC    C'3529',C'1284',C'KLOVA',X'000000'                               
         DC    C'3529',C'1285',C'WCAPA',X'000000'                               
         DC    C'3530',C'2081',C'WANMA',X'000000'                               
         DC    C'3530',C'2082',C'KTLDA',X'000000'                               
         DC    C'3530',C'2083',C'WTLSA',X'000000'                               
         DC    C'3530',C'2085',C'WCRNF',X'000000'                               
         DC    C'3532',C'0071',C'WABYA',X'000000'                               
         DC    C'3533',C'0924',C'WBLWF',X'000000'                               
         DC    C'3533',C'0946',C'WWHCF',X'000000'                               
         DC    C'3533',C'0949',C'WLLSA',X'000000'                               
         DC    C'3533',C'0951',C'KDWAA',X'000000'                               
         DC    C'3533',C'0952',C'WHSCA',X'000000'                               
         DC    C'3533',C'0953',C'WCCCA',X'000000'                               
         DC    C'3533',C'0954',C'KCNTF',X'000000'                               
         DC    C'3534',C'1567',C'KBOEA',X'000000'                               
         DC    C'3534',C'1577',C'KEWEF',X'000000'                               
         DC    C'3534',C'1581',C'SELEF',X'000000'                               
         DC    C'3534',C'1582',C'WKZEA',X'000000'                               
         DC    C'3534',C'1583',C'KLERA',X'000000'                               
         DC    C'3534',C'1584',C'KHFOF',X'000000'                               
         DC    C'3534',C'1586',C'KRMSA',X'000000'                               
         DC    C'3534',C'1587',C'WAGOA',X'000000'                               
         DC    C'3534',C'3362',C'WAOMA',X'000000'                               
         DC    C'3534',C'3363',C'KZOCF',X'000000'                               
         DC    C'3534',C'3364',C'WOAMA',X'000000'                               
         DC    C'3534',C'3369',C'KOFOA',X'000000'                               
         DC    C'3534',C'3373',C'KJJCA',X'000000'                               
         DC    C'3534',C'3365',C'     ',X'000000'                               
         DC    C'3535',C'0007',C'CRN A',X'000000'                               
         DC    C'3535',C'0483',C'KMUZA',X'000000'                               
         DC    C'3535',C'0490',C'WCGAA',X'000000'                               
         DC    C'3535',C'0528',C'KWUNA',X'000000'                               
         DC    C'3535',C'0535',C'KCONA',X'000000'                               
         DC    C'3535',C'0552',C'WCNBA',X'000000'                               
         DC    C'3535',C'0560',C'WJYYF',X'000000'                               
         DC    C'3535',C'0562',C'WJJCA',X'000000'                               
         DC    C'3535',C'0563',C'KCOMA',X'000000'                               
         DC    C'3535',C'0565',C'KNCKA',X'000000'                               
         DC    C'3535',C'0570',C'WEGOA',X'000000'                               
         DC    C'3535',C'0571',C'OABNA',X'000000'                               
         DC    C'3535',C'0572',C'WFIZF',X'000000'                               
         DC    C'3535',C'0573',C'WBNCA',X'000000'                               
         DC    C'3535',C'0574',C'WJXYA',X'000000'                               
         DC    C'3535',C'0575',C'WCVIA',X'000000'                               
         DC    C'3535',C'2624',C'KCRKF',X'000000'                               
         DC    C'3536',C'2311',C'WBBGF',X'000000'                               
         DC    C'3536',C'2313',C'WSDSA',X'000000'                               
         DC    C'3536',C'2314',C'KSYCA',X'000000'                               
         DC    C'3536',C'2320',C'KHEXF',X'000000'                               
         DC    C'3536',C'2321',C'KALJF',X'000000'                               
         DC    C'3536',C'2322',C'KJCOA',X'000000'                               
         DC    C'3537',C'0186',C'KRTYF',X'000000'                               
         DC    C'3537',C'0195',C'WBAFA',X'000000'                               
         DC    C'3537',C'0198',C'WBLRA',X'000000'                               
         DC    C'3537',C'0199',C'KIOTA',X'000000'                               
         DC    C'3537',C'0201',C'WABIA',X'000000'                               
         DC    C'3537',C'0203',C'WRPQA',X'000000'                               
         DC    C'3537',C'0205',C'WYWYA',X'000000'                               
         DC    C'3537',C'0206',C'KGCGA',X'000000'                               
         DC    C'3537',C'0207',C'WNCCA',X'000000'                               
         DC    C'3537',C'0208',C'WCFRF',X'000000'                               
         DC    C'3537',C'0209',C'WBARA',X'000000'                               
         DC    C'3537',C'0212',C'WBRTA',X'000000'                               
         DC    C'3537',C'0231',C'WBTAA',X'000000'                               
         DC    C'3537',C'2513',C'     ',X'000000'                               
         DC    C'3538',C'1801',C'WAXCA',X'000000'                               
         DC    C'3539',C'2089',C'WRARA',X'000000'                               
         DC    C'3539',C'2090',C'KKITA',X'000000'                               
         DC    C'3539',C'2091',C'KQDYA',X'000000'                               
         DC    C'3540',C'0372',C'WATTA',X'000000'                               
         DC    C'3540',C'0375',C'KICOA',X'000000'                               
         DC    C'3540',C'0376',C'KBXLF',X'000000'                               
         DC    C'3540',C'0379',C'WEBSA',X'000000'                               
         DC    C'3540',C'0381',C'WCCWA',X'000000'                               
         DC    C'3540',C'0384',C'WQDYA',X'000000'                               
         DC    C'3540',C'0397',C'WGRAA',X'000000'                               
         DC    C'3540',C'0425',C'WKDZA',X'000000'                               
         DC    C'3541',C'1231',C'KILUA',X'000000'                               
         DC    C'3541',C'3178',C'KBEKF',X'000000'                               
         DC    C'3542',C'0611',C'WAVIA',X'000000'                               
         DC    C'3542',C'0612',C'WDNTA',X'000000'                               
         DC    C'3542',C'0617',C'WAJFA',X'000000'                               
         DC    C'3542',C'0619',C'KDSJA',X'000000'                               
         DC    C'3543',C'2029',C'WACEA',X'000000'                               
         DC    C'3544',C'1541',C'WAFXF',X'000000'                               
         DC    C'3546',C'0534',C'WAXOA',X'000000'                               
         DC    C'3546',C'0541',C'SCN A',X'000000'                               
         DC    C'3547',C'2111',C'WCWAA',X'000000'                               
         DC    C'3547',C'2112',C'WOBMF',X'000000'                               
         DC    C'3547',C'2117',C'KTDOA',X'000000'                               
         DC    C'3547',C'2139',C'WTMBF',X'000000'                               
         DC    C'3547',C'3509',C'     ',X'000000'                               
         DC    C'3548',C'2245',C'SAIAF',X'000000'                               
         DC    C'3548',C'2246',C'WOCBA',X'000000'                               
         DC    C'3548',C'2247',C'WCJMF',X'000000'                               
         DC    C'3548',C'2248',C'KYCNA',X'000000'                               
         DC    C'3548',C'2249',C'KANIA',X'000000'                               
         DC    C'3548',C'2250',C'WDONA',X'000000'                               
         DC    C'3548',C'2265',C'KAMSF',X'000000'                               
         DC    C'3548',C'2327',C'WETUA',X'000000'                               
         DC    C'3548',C'3859',C'WRACA',X'000000'                               
         DC    C'3548',C'4003',C'WROBA',X'000000'                               
         DC    C'3550',C'2274',C'WIMOA',X'000000'                               
         DC    C'3550',C'2288',C'KUADA',X'000000'                               
         DC    C'3550',C'2291',C'WAAVF',X'000000'                               
         DC    C'3550',C'2292',C'WGTMA',X'000000'                               
         DC    C'3550',C'2294',C'WFMIA',X'000000'                               
         DC    C'3550',C'2295',C'WEFGF',X'000000'                               
         DC    C'3550',C'2296',C'WWBRA',X'000000'                               
         DC    C'3550',C'2309',C'KDOMA',X'000000'                               
         DC    C'3550',C'2318',C'WBTEA',X'000000'                               
         DC    C'3550',C'3872',C'WCDTA',X'000000'                               
         DC    C'3550',C'3873',C'WIUCF',X'000000'                               
         DC    C'3550',C'3874',C'WEZQA',X'000000'                               
         DC    C'3550',C'2298',C'     ',X'000000'                               
         DC    C'3550',C'3865',C'     ',X'000000'                               
         DC    C'3551',C'1173',C'WSMDA',X'000000'                               
         DC    C'3551',C'1201',C'WFMKF',X'000000'                               
         DC    C'3551',C'1209',C'WCOEF',X'000000'                               
         DC    C'3551',C'1210',C'KOJOA',X'000000'                               
         DC    C'3551',C'2929',C'WDEYF',X'000000'                               
         DC    C'3554',C'2231',C'WDEZF',X'000000'                               
         DC    C'3554',C'2251',C'WANJA',X'000000'                               
         DC    C'3554',C'2255',C'WTCWA',X'000000'                               
         DC    C'3554',C'2256',C'WFASA',X'000000'                               
         DC    C'3554',C'3862',C'WSLWA',X'000000'                               
         DC    C'3554',C'3863',C'WHTLF',X'000000'                               
         DC    C'3554',C'3884',C'WENCA',X'000000'                               
         DC    C'3555',C'2071',C'WADRA',X'000000'                               
         DC    C'3555',C'2076',C'WKSMF',X'000000'                               
         DC    C'3555',C'2077',C'KMO A',X'000000'                               
         DC    C'3555',C'2078',C'KTKRA',X'000000'                               
         DC    C'3555',C'2096',C'WEYYA',X'000000'                               
         DC    C'3556',C'0005',C'RKONA',X'000000'                               
         DC    C'3556',C'1771',C'WANTA',X'000000'                               
         DC    C'3556',C'1773',C'KWSRA',X'000000'                               
         DC    C'3556',C'1775',C'KLOAA',X'000000'                               
         DC    C'3556',C'1778',C'WVARA',X'000000'                               
         DC    C'3556',C'1779',C'WCSAA',X'000000'                               
         DC    C'3556',C'1780',C'WRCNA',X'000000'                               
         DC    C'3556',C'1781',C'KTAKF',X'000000'                               
         DC    C'3556',C'3404',C'WEVRA',X'000000'                               
         DC    C'3556',C'1767',C'     ',X'000000'                               
         DC    C'3556',C'1783',C'     ',X'000000'                               
         DC    C'3556',C'3393',C'     ',X'000000'                               
         DC    C'3557',C'1141',C'CNC A',X'000000'                               
         DC    C'3557',C'1148',C'CAN A',X'000000'                               
         DC    C'3559',C'0290',C'KJMBA',X'000000'                               
         DC    C'3559',C'0306',C'KHLSF',X'000000'                               
         DC    C'3559',C'0308',C'WBDYA',X'000000'                               
         DC    C'3560',C'1731',C'NCNNA',X'000000'                               
         DC    C'3560',C'1766',C'WRTLA',X'000000'                               
         DC    C'3560',C'1736',C'     ',X'000000'                               
         DC    C'3561',C'1058',C'WJKYA',X'000000'                               
         DC    C'3561',C'1060',C'KMTNF',X'000000'                               
         DC    C'3561',C'1061',C'WAIVF',X'000000'                               
         DC    C'3561',C'1062',C'WEAIF',X'000000'                               
         DC    C'3561',C'1063',C'WBBSA',X'000000'                               
         DC    C'3561',C'1064',C'KEBEA',X'000000'                               
         DC    C'3563',C'0855',C'KORTA',X'000000'                               
         DC    C'3563',C'0861',C'WCUZA',X'000000'                               
         DC    C'3563',C'0862',C'KMINA',X'000000'                               
         DC    C'3563',C'0863',C'KAGIA',X'000000'                               
         DC    C'3563',C'0865',C'WGRYA',X'000000'                               
         DC    C'3563',C'0866',C'KNNSF',X'000000'                               
         DC    C'3563',C'0870',C'KBJCF',X'000000'                               
         DC    C'3563',C'0875',C'KNCOA',X'000000'                               
         DC    C'3563',C'0876',C'WKJKA',X'000000'                               
         DC    C'3563',C'0886',C'WSBSA',X'000000'                               
         DC    C'3563',C'2939',C'KSKEF',X'000000'                               
         DC    C'3564',C'0411',C'WAMXF',X'000000'                               
         DC    C'3564',C'0438',C'WEICA',X'000000'                               
         DC    C'3566',C'1185',C'KDLYF',X'000000'                               
         DC    C'3566',C'1190',C'WAGLA',X'000000'                               
         DC    C'3566',C'1191',C'WDACF',X'000000'                               
         DC    C'3566',C'1192',C'WRLDA',X'000000'                               
         DC    C'3566',C'1193',C'KNDKA',X'000000'                               
         DC    C'3566',C'1196',C'WAXLF',X'000000'                               
         DC    C'3566',C'1200',C'WLSHA',X'000000'                               
         DC    C'3567',C'0883',C'WGCHA',X'000000'                               
         DC    C'3567',C'0887',C'WPLBA',X'000000'                               
         DC    C'3567',C'0893',C'WDRKF',X'000000'                               
         DC    C'3567',C'0895',C'WASCA',X'000000'                               
         DC    C'3567',C'0897',C'WAZZF',X'000000'                               
         DC    C'3567',C'0898',C'WGYVA',X'000000'                               
         DC    C'3567',C'0899',C'WGRVA',X'000000'                               
         DC    C'3567',C'0902',C'KUUZF',X'000000'                               
         DC    C'3567',C'2901',C'WGVLA',X'000000'                               
         DC    C'3567',C'4009',C'KEMMF',X'000000'                               
         DC    C'3567',C'1136',C'     ',X'000000'                               
         DC    C'3567',C'2892',C'     ',X'000000'                               
         DC    C'3570',C'0780',C'KBJTA',X'000000'                               
         DC    C'3570',C'0781',C'WJMXA',X'000000'                               
         DC    C'3570',C'0785',C'KVACA',X'000000'                               
         DC    C'3570',C'0790',C'WHEPA',X'000000'                               
         DC    C'3570',C'0791',C'KFIZA',X'000000'                               
         DC    C'3570',C'0795',C'WAGYA',X'000000'                               
         DC    C'3570',C'0796',C'WMAGA',X'000000'                               
         DC    C'3571',C'0807',C'WAYKA',X'000000'                               
         DC    C'3571',C'0808',C'WAVWA',X'000000'                               
         DC    C'3571',C'0818',C'WFPMA',X'000000'                               
         DC    C'3573',C'1789',C'WELRA',X'000000'                               
         DC    C'3573',C'1790',C'WCBTA',X'000000'                               
         DC    C'3573',C'1791',C'WBLUA',X'000000'                               
         DC    C'3573',C'1792',C'WKMCA',X'000000'                               
         DC    C'3573',C'1796',C'WRHLA',X'000000'                               
         DC    C'3573',C'1799',C'WROIA',X'000000'                               
         DC    C'3573',C'1800',C'KNCVF',X'000000'                               
         DC    C'3573',C'1802',C'WWNHA',X'000000'                               
         DC    C'3573',C'1782',C'     ',X'000000'                               
         DC    C'3573',C'1805',C'     ',X'000000'                               
         DC    C'3574',C'1085',C'WJOLA',X'000000'                               
         DC    C'3574',C'3574',C'     ',X'000000'                               
         DC    C'3575',C'0441',C'WADXA',X'000000'                               
         DC    C'3575',C'0444',C'WCBYA',X'000000'                               
         DC    C'3575',C'0445',C'WNIAA',X'000000'                               
         DC    C'3575',C'0446',C'KOZIA',X'000000'                               
         DC    C'3575',C'0447',C'WCREA',X'000000'                               
         DC    C'3575',C'0448',C'WGCDA',X'000000'                               
         DC    C'3575',C'0449',C'WEEZA',X'000000'                               
         DC    C'3575',C'0450',C'WCTRA',X'000000'                               
         DC    C'3576',C'1841',C'WASAA',X'000000'                               
         DC    C'3576',C'1842',C'WRDXF',X'000000'                               
         DC    C'3576',C'1845',C'KSRAA',X'000000'                               
         DC    C'3577',C'2264',C'KUKUA',X'000000'                               
         DC    C'3577',C'2275',C'KDJSA',X'000000'                               
         DC    C'3577',C'2277',C'WBTHA',X'000000'                               
         DC    C'3577',C'2281',C'WARMA',X'000000'                               
         DC    C'3577',C'2282',C'WILIA',X'000000'                               
         DC    C'3577',C'2283',C'WFXXA',X'000000'                               
         DC    C'3577',C'2284',C'WIAMA',X'000000'                               
         DC    C'3577',C'2285',C'WEZJA',X'000000'                               
         DC    C'3577',C'2286',C'KIQSA',X'000000'                               
         DC    C'3577',C'2287',C'WMBGA',X'000000'                               
         DC    C'3577',C'2308',C'KEYZA',X'000000'                               
         DC    C'3581',C'2101',C'IMSNA',X'000000'                               
         DC    C'3581',C'2102',C'KTERA',X'000000'                               
         DC    C'3588',C'1988',C'WKDYA',X'000000'                               
         DC    C'3588',C'2009',C'WSMIA',X'000000'                               
         DC    C'3588',C'2010',C'KICDA',X'000000'                               
         DC    C'3588',C'2011',C'WCMRA',X'000000'                               
         DC    C'3588',C'2012',C'WHLFA',X'000000'                               
         DC    C'3588',C'2013',C'WJWSA',X'000000'                               
         DC    C'3588',C'2014',C'KCTEA',X'000000'                               
         DC    C'3588',C'2016',C'WCELA',X'000000'                               
         DC    C'3588',C'2018',C'KONIA',X'000000'                               
         DC    C'3588',C'2019',C'WCOWA',X'000000'                               
         DC    C'3588',C'2020',C'WEPGA',X'000000'                               
         DC    C'3588',C'2022',C'WCOKA',X'000000'                               
         DC    C'3588',C'2048',C'WCSYA',X'000000'                               
         DC    C'3588',C'3409',C'WQVRF',X'000000'                               
         DC    C'3588',C'3410',C'WGAQF',X'000000'                               
         DC    C'3588',C'3510',C'WHCOA',X'000000'                               
         DC    C'3588',C'1982',C'     ',X'000000'                               
         DC    C'3588',C'3428',C'     ',X'000000'                               
         DC    C'3588',C'3496',C'     ',X'000000'                               
         DC    C'3588',C'3505',C'     ',X'000000'                               
         DC    C'3592',C'0822',C'WBOBA',X'000000'                               
         DC    C'3592',C'0827',C'WAKAA',X'000000'                               
         DC    C'3592',C'0830',C'WDUNA',X'000000'                               
         DC    C'3592',C'0831',C'WAAGF',X'000000'                               
         DC    C'3592',C'0832',C'WAMGA',X'000000'                               
         DC    C'3592',C'0854',C'KGAFA',X'000000'                               
         DC    C'3592',C'0860',C'WJEHA',X'000000'                               
         DC    C'3597',C'1608',C'KVWGA',X'000000'                               
         DC    C'3597',C'1609',C'KDDBF',X'000000'                               
         DC    C'3597',C'1611',C'WADCA',X'000000'                               
         DC    C'3597',C'1612',C'KPRMA',X'000000'                               
         DC    C'3597',C'1620',C'WGUDA',X'000000'                               
         DC    C'3597',C'1621',C'WTBPA',X'000000'                               
         DC    C'3597',C'1624',C'KOKNA',X'000000'                               
         DC    C'3597',C'1625',C'KALEA',X'000000'                               
         DC    C'3597',C'1626',C'WALKA',X'000000'                               
         DC    C'3597',C'1628',C'KIUNA',X'000000'                               
         DC    C'3597',C'1629',C'WHUDF',X'000000'                               
         DC    C'3597',C'1634',C'WFHKA',X'000000'                               
         DC    C'3597',C'3397',C'WRVHF',X'000000'                               
         DC    C'3597',C'3421',C'KPLLA',X'000000'                               
         DC    C'3597',C'3435',C'WGLOF',X'000000'                               
         DC    C'3597',C'3436',C'KLKCA',X'000000'                               
         DC    C'3597',C'3437',C'KMOGA',X'000000'                               
         DC    C'3597',C'4008',C'WEBIF',X'000000'                               
         DC    C'3597',C'1627',C'     ',X'000000'                               
         DC    C'3597',C'3353',C'     ',X'000000'                               
         DC    C'3597',C'3401',C'     ',X'000000'                               
         DC    C'3597',C'3432',C'     ',X'000000'                               
         DC    C'3598',C'0501',C'WBOYA',X'000000'                               
         DC    C'3600',C'2565',C'KAMIA',X'000000'                               
         DC    C'3600',C'0488',C'WIDWA',X'000000'                               
         DC    C'3600',C'0538',C'WKBLA',X'000000'                               
         DC    C'3600',C'0545',C'KANDA',X'000000'                               
         DC    C'3600',C'0546',C'WSVSA',X'000000'                               
         DC    C'3600',C'0547',C'WKRTA',X'000000'                               
         DC    C'3600',C'0548',C'KNNDA',X'000000'                               
         DC    C'3600',C'0550',C'KPLYA',X'000000'                               
         DC    C'3600',C'0553',C'WTNSA',X'000000'                               
         DC    C'3600',C'0568',C'KRCBA',X'000000'                               
         DC    C'3600',C'0569',C'KVIOA',X'000000'                               
         DC    C'3600',C'0579',C'KVFCA',X'000000'                               
         DC    C'3600',C'0580',C'KBVRF',X'000000'                               
         DC    C'3600',C'0581',C'KCCTA',X'000000'                               
         DC    C'3600',C'0582',C'WWCBA',X'000000'                               
         DC    C'3600',C'0584',C'WGFSA',X'000000'                               
         DC    C'3600',C'0586',C'WARBA',X'000000'                               
         DC    C'3600',C'0587',C'KSIBA',X'000000'                               
         DC    C'3600',C'0588',C'KQZRF',X'000000'                               
         DC    C'3600',C'0589',C'WCVLA',X'000000'                               
         DC    C'3600',C'0590',C'WAAZF',X'000000'                               
         DC    C'3600',C'0593',C'WIQOF',X'000000'                               
         DC    C'3600',C'2619',C'     ',X'000000'                               
         DC    C'3600',C'2622',C'     ',X'000000'                               
         DC    C'3602',C'0461',C'PIA A',X'000000'                               
         DC    C'3603',C'1101',C'KFSBA',X'000000'                               
         DC    C'3603',C'1102',C'KCLYA',X'000000'                               
         DC    C'3605',C'2120',C'KGOSA',X'000000'                               
         DC    C'3605',C'2121',C'KDVVF',X'000000'                               
         DC    C'3605',C'2122',C'WSNGA',X'000000'                               
         DC    C'3605',C'2123',C'WTTCA',X'000000'                               
         DC    C'3605',C'2125',C'WBJHF',X'000000'                               
         DC    C'3605',C'2130',C'WLOTF',X'000000'                               
         DC    C'3605',C'2133',C'KENEA',X'000000'                               
         DC    C'3605',C'3508',C'KTTNA',X'000000'                               
         DC    C'3605',C'2137',C'     ',X'000000'                               
         DC    C'3606',C'0643',C'KAPRA',X'000000'                               
         DC    C'3606',C'0648',C'WDRUF',X'000000'                               
         DC    C'3606',C'0659',C'WJERA',X'000000'                               
         DC    C'3606',C'0661',C'WAGFA',X'000000'                               
         DC    C'3606',C'0662',C'WBUXA',X'000000'                               
         DC    C'3606',C'0663',C'WDOVA',X'000000'                               
         DC    C'3606',C'0664',C'WBBXF',X'000000'                               
         DC    C'3606',C'0666',C'WDHAF',X'000000'                               
         DC    C'3606',C'0667',C'KWIVA',X'000000'                               
         DC    C'3606',C'0670',C'WDMGA',X'000000'                               
         DC    C'3606',C'2628',C'WDOWF',X'000000'                               
         DC    C'3609',C'1997',C'KOFEA',X'000000'                               
         DC    C'3609',C'2051',C'KADIA',X'000000'                               
         DC    C'3609',C'2052',C'WKBIA',X'000000'                               
         DC    C'3610',C'1811',C'WKKNA',X'000000'                               
         DC    C'3612',C'1956',C'KGCHF',X'000000'                               
         DC    C'3612',C'1958',C'KTANA',X'000000'                               
         DC    C'3612',C'1959',C'KSIDA',X'000000'                               
         DC    C'3612',C'1961',C'KCOZA',X'000000'                               
         DC    C'3612',C'1987',C'WCDOA',X'000000'                               
         DC    C'3613',C'1421',C'KDHLA',X'000000'                               
         DC    C'3616',C'0006',C'KATNA',X'000000'                               
         DC    C'3616',C'1110',C'KAMLA',X'000000'                               
         DC    C'3616',C'1121',C'KBEQA',X'000000'                               
         DC    C'3616',C'1087',C'     ',X'000000'                               
         DC    C'3616',C'2931',C'     ',X'000000'                               
         DC    C'3617',C'1411',C'MBBCA',X'000000'                               
         DC    C'3617',C'1415',C'KASOA',X'000000'                               
         DC    C'3617',C'1420',C'KMOOA',X'000000'                               
         DC    C'3617',C'1426',C'KJSAA',X'000000'                               
         DC    C'3618',C'1001',C'HOURA',X'000000'                               
         DC    C'3618',C'1015',C'WHUCA',X'000000'                               
         DC    C'3618',C'1016',C'KHBTA',X'000000'                               
         DC    C'3618',C'1017',C'WIRJA',X'000000'                               
         DC    C'3618',C'1020',C'WHUNA',X'000000'                               
         DC    C'3618',C'1022',C'WGSMA',X'000000'                               
         DC    C'3618',C'1028',C'WJPJA',X'000000'                               
         DC    C'3618',C'2923',C'WRPXA',X'000000'                               
         DC    C'3618',C'3110',C'WCERA',X'000000'                               
         DC    C'3619',C'2023',C'WCFRA',X'000000'                               
         DC    C'3619',C'2024',C'WDBLA',X'000000'                               
         DC    C'3619',C'2025',C'WAZUF',X'000000'                               
         DC    C'3619',C'2028',C'KBSFA',X'000000'                               
         DC    C'3619',C'2030',C'WTOEA',X'000000'                               
         DC    C'3619',C'2031',C'KELEF',X'000000'                               
         DC    C'3619',C'2032',C'WDBMA',X'000000'                               
         DC    C'3619',C'2034',C'WAOCA',X'000000'                               
         DC    C'3619',C'2036',C'WAFMF',X'000000'                               
         DC    C'3619',C'2037',C'WSTCA',X'000000'                               
         DC    C'3619',C'2038',C'WANVA',X'000000'                               
         DC    C'3619',C'2043',C'KIGOA',X'000000'                               
         DC    C'3619',C'2050',C'WPXEA',X'000000'                               
         DC    C'3619',C'2054',C'WMCDF',X'000000'                               
         DC    C'3619',C'2061',C'WMAJA',X'000000'                               
         DC    C'3619',C'3501',C'KQYBF',X'000000'                               
         DC    C'3619',C'1915',C'     ',X'000000'                               
         DC    C'3619',C'2046',C'     ',X'000000'                               
         DC    C'3619',C'3406',C'     ',X'000000'                               
         DC    C'3619',C'3497',C'     ',X'000000'                               
         DC    C'3620',C'2155',C'WACTA',X'000000'                               
         DC    C'3620',C'2156',C'WBILA',X'000000'                               
         DC    C'3620',C'2154',C'     ',X'000000'                               
         DC    C'3620',C'2163',C'     ',X'000000'                               
         DC    C'3622',C'1511',C'KQLDF',X'000000'                               
         DC    C'3622',C'1512',C'WADKA',X'000000'                               
         DC    C'3622',C'1513',C'WBKNA',X'000000'                               
         DC    C'3622',C'1514',C'WIXLF',X'000000'                               
         DC    C'3622',C'1517',C'WGULA',X'000000'                               
         DC    C'3622',C'1522',C'WOGOA',X'000000'                               
         DC    C'3622',C'1528',C'WIXKA',X'000000'                               
         DC    C'3622',C'1529',C'KCOBA',X'000000'                               
         DC    C'3622',C'1530',C'WRTNF',X'000000'                               
         DC    C'3622',C'1533',C'KNUJA',X'000000'                               
         DC    C'3622',C'1568',C'KNPTA',X'000000'                               
         DC    C'3622',C'3301',C'KJRGA',X'000000'                               
         DC    C'3622',C'3304',C'WLIKA',X'000000'                               
         DC    C'3622',C'3307',C'KNBYA',X'000000'                               
         DC    C'3622',C'3308',C'WNNCA',X'000000'                               
         DC    C'3622',C'3309',C'WNTNA',X'000000'                               
         DC    C'3622',C'4902',C'     ',X'000000'                               
         DC    C'3623',C'0591',C'KAAMA',X'000000'                               
         DC    C'3623',C'0592',C'WDAQF',X'000000'                               
         DC    C'3623',C'0594',C'WHIRA',X'000000'                               
         DC    C'3623',C'0595',C'WAGKF',X'000000'                               
         DC    C'3623',C'0596',C'WDARA',X'000000'                               
         DC    C'3623',C'0599',C'WDANA',X'000000'                               
         DC    C'3623',C'0600',C'WAAKA',X'000000'                               
         DC    C'3623',C'0602',C'WBLJA',X'000000'                               
         DC    C'3623',C'0603',C'KWIPA',X'000000'                               
         DC    C'3623',C'0606',C'WDNYA',X'000000'                               
         DC    C'3623',C'0607',C'KCABA',X'000000'                               
         DC    C'3625',C'2199',C'KKWSF',X'000000'                               
         DC    C'3625',C'2201',C'KBBWA',X'000000'                               
         DC    C'3625',C'2202',C'WADEA',X'000000'                               
         DC    C'3625',C'3823',C'     ',X'000000'                               
         DC    C'3627',C'2261',C'KBIDF',X'000000'                               
         DC    C'3627',C'2262',C'WKFDA',X'000000'                               
         DC    C'3627',C'2280',C'WCMCA',X'000000'                               
         DC    C'3627',C'3824',C'KUUKA',X'000000'                               
         DC    C'3627',C'3876',C'KHILA',X'000000'                               
         DC    C'3628',C'1459',C'WKUNA',X'000000'                               
         DC    C'3628',C'1460',C'THN A',X'000000'                               
         DC    C'3628',C'1461',C'KDMSA',X'000000'                               
         DC    C'3628',C'1462',C'KYNIA',X'000000'                               
         DC    C'3628',C'3217',C'     ',X'000000'                               
         DC    C'3630',C'0281',C'WAGGA',X'000000'                               
         DC    C'3630',C'0282',C'KBAZF',X'000000'                               
         DC    C'3630',C'0283',C'KIBSA',X'000000'                               
         DC    C'3630',C'2562',C'WJRMA',X'000000'                               
         DC    C'3633',C'1556',C'KBATA',X'000000'                               
         DC    C'3633',C'1557',C'WPACF',X'000000'                               
         DC    C'3633',C'1558',C'KIBCF',X'000000'                               
         DC    C'3633',C'3368',C'KOELA',X'000000'                               
         DC    C'3634',C'0110',C'WMBAA',X'000000'                               
         DC    C'3634',C'0111',C'KATPF',X'000000'                               
         DC    C'3634',C'0116',C'WADZF',X'000000'                               
         DC    C'3634',C'2509',C'WXCEA',X'000000'                               
         DC    C'3635',C'0171',C'KASEA',X'000000'                               
         DC    C'3635',C'0172',C'WWOCF',X'000000'                               
         DC    C'3635',C'0175',C'WBABF',X'000000'                               
         DC    C'3635',C'0179',C'WAZAA',X'000000'                               
         DC    C'3635',C'0180',C'KBKRA',X'000000'                               
         DC    C'3635',C'0182',C'KFLNA',X'000000'                               
         DC    C'3635',C'2505',C'KKOZA',X'000000'                               
         DC    C'3635',C'2572',C'WLEWF',X'000000'                               
         DC    C'3636',C'1364',C'KRIOF',X'000000'                               
         DC    C'3636',C'1424',C'KMCLA',X'000000'                               
         DC    C'3637',C'0401',C'KCDRA',X'000000'                               
         DC    C'3637',C'0402',C'WGAAA',X'000000'                               
         DC    C'3637',C'0404',C'WHONA',X'000000'                               
         DC    C'3637',C'0405',C'KELAA',X'000000'                               
         DC    C'3637',C'0406',C'WCBGA',X'000000'                               
         DC    C'3637',C'0409',C'KCSRA',X'000000'                               
         DC    C'3637',C'0423',C'WKYAF',X'000000'                               
         DC    C'3637',C'0429',C'WBIBA',X'000000'                               
         DC    C'3637',C'0439',C'KCOGA',X'000000'                               
         DC    C'3637',C'0442',C'WVOEA',X'000000'                               
         DC    C'3637',C'2611',C'WCSMA',X'000000'                               
         DC    C'3637',C'2630',C'WILYA',X'000000'                               
         DC    C'3639',C'1045',C'WDXIA',X'000000'                               
         DC    C'3640',C'1381',C'KJMSF',X'000000'                               
         DC    C'3641',C'1871',C'KAJAF',X'000000'                               
         DC    C'3641',C'1877',C'KBONA',X'000000'                               
         DC    C'3641',C'1883',C'WSNTA',X'000000'                               
         DC    C'3641',C'1914',C'     ',X'000000'                               
         DC    C'3642',C'1162',C'WLAFA',X'000000'                               
         DC    C'3642',C'1171',C'KASCF',X'000000'                               
         DC    C'3643',C'1178',C'KVLIA',X'000000'                               
         DC    C'3643',C'1179',C'KFWJA',X'000000'                               
         DC    C'3643',C'1180',C'WDSRA',X'000000'                               
         DC    C'3643',C'1181',C'KAOKA',X'000000'                               
         DC    C'3643',C'1182',C'WJOTA',X'000000'                               
         DC    C'3643',C'1183',C'SBJWF',X'000000'                               
         DC    C'3643',C'1186',C'KBLCA',X'000000'                               
         DC    C'3643',C'1195',C'WLPWF',X'000000'                               
         DC    C'3643',C'3171',C'WMIRA',X'000000'                               
         DC    C'3644',C'0091',C'KALBA',X'000000'                               
         DC    C'3644',C'0095',C'WULFA',X'000000'                               
         DC    C'3644',C'0096',C'KBICF',X'000000'                               
         DC    C'3644',C'0097',C'WFYCA',X'000000'                               
         DC    C'3644',C'0098',C'WBAWA',X'000000'                               
         DC    C'3644',C'0101',C'KCMTF',X'000000'                               
         DC    C'3644',C'0103',C'WAEBA',X'000000'                               
         DC    C'3644',C'0107',C'KCOWA',X'000000'                               
         DC    C'3644',C'2501',C'WAQTA',X'000000'                               
         DC    C'3644',C'0102',C'     ',X'000000'                               
         DC    C'3649',C'0733',C'KRKOA',X'000000'                               
         DC    C'3649',C'0740',C'WBLOA',X'000000'                               
         DC    C'3649',C'0741',C'WGBFA',X'000000'                               
         DC    C'3649',C'0742',C'WBXMA',X'000000'                               
         DC    C'3649',C'0743',C'KEXSA',X'000000'                               
         DC    C'3649',C'0736',C'     ',X'000000'                               
         DC    C'3650',C'1561',C'KAEZF',X'000000'                               
         DC    C'3650',C'1564',C'WLISA',X'000000'                               
         DC    C'3650',C'1565',C'WEBFF',X'000000'                               
         DC    C'3650',C'1566',C'KGY A',X'000000'                               
         DC    C'3650',C'1600',C'KOKLA',X'000000'                               
         DC    C'3650',C'3354',C'WLVNA',X'000000'                               
         DC    C'3651',C'1289',C'WKLAA',X'000000'                               
         DC    C'3651',C'1291',C'KAKSF',X'000000'                               
         DC    C'3652',C'1571',C'KESYA',X'000000'                               
         DC    C'3652',C'1603',C'KOMWA',X'000000'                               
         DC    C'3652',C'3356',C'WBNTA',X'000000'                               
         DC    C'3652',C'3367',C'WKLDF',X'000000'                               
         DC    C'3652',C'3395',C'WMCRA',X'000000'                               
         DC    C'3656',C'1601',C'WDLPA',X'000000'                               
         DC    C'3656',C'1605',C'KDRSA',X'000000'                               
         DC    C'3656',C'1606',C'KEWQA',X'000000'                               
         DC    C'3656',C'1613',C'KCCLA',X'000000'                               
         DC    C'3656',C'3414',C'WBGRA',X'000000'                               
         DC    C'3656',C'3418',C'WUMEA',X'000000'                               
         DC    C'3656',C'3427',C'WLUFA',X'000000'                               
         DC    C'3656',C'3430',C'     ',X'000000'                               
         DC    C'3658',C'0881',C'WBAYA',X'000000'                               
         DC    C'3658',C'0882',C'WHAIA',X'000000'                               
         DC    C'3658',C'0884',C'WXTAF',X'000000'                               
         DC    C'3658',C'0889',C'WGRKA',X'000000'                               
         DC    C'3658',C'0894',C'BCW A',X'000000'                               
         DC    C'3658',C'2893',C'KEZGF',X'000000'                               
         DC    C'3658',C'2902',C'WTREA',X'000000'                               
         DC    C'3658',C'2904',C'KRFGA',X'000000'                               
         DC    C'3658',C'2914',C'WLGCF',X'000000'                               
         DC    C'3659',C'1501',C'WAMBA',X'000000'                               
         DC    C'3659',C'4056',C'NBNNA',X'000000'                               
         DC    C'3661',C'1861',C'KBILF',X'000000'                               
         DC    C'3662',C'0011',C'KBCYA',X'000000'                               
         DC    C'3662',C'0021',C'KABIA',X'000000'                               
         DC    C'3662',C'0022',C'WABNF',X'000000'                               
         DC    C'3669',C'1306',C'KMALF',X'000000'                               
         DC    C'3669',C'1319',C'WSJCA',X'000000'                               
         DC    C'3669',C'1321',C'WIBAA',X'000000'                               
         DC    C'3669',C'1322',C'KVMAA',X'000000'                               
         DC    C'3669',C'1326',C'KBOKA',X'000000'                               
         DC    C'3669',C'1327',C'WICYA',X'000000'                               
         DC    C'3670',C'0778',C'WFKNA',X'000000'                               
         DC    C'3670',C'0784',C'WILOA',X'000000'                               
         DC    C'3670',C'0793',C'KFSTA',X'000000'                               
         DC    C'3670',C'0794',C'KEHGA',X'000000'                               
         DC    C'3670',C'0797',C'KAYRA',X'000000'                               
         DC    C'3670',C'0798',C'WYSRA',X'000000'                               
         DC    C'3670',C'0799',C'WFSCA',X'000000'                               
         DC    C'3670',C'0800',C'WKOXA',X'000000'                               
         DC    C'3670',C'0801',C'KFRAA',X'000000'                               
         DC    C'3670',C'0804',C'WFRAA',X'000000'                               
         DC    C'3670',C'0814',C'WFTNA',X'000000'                               
         DC    C'3670',C'0816',C'WSUSF',X'000000'                               
         DC    C'3670',C'0817',C'WFKYA',X'000000'                               
         DC    C'3670',C'2808',C'WFISA',X'000000'                               
         DC    C'3670',C'2811',C'WBNZF',X'000000'                               
         DC    C'3670',C'2812',C'     ',X'000000'                               
         DC    C'3670',C'3927',C'     ',X'000000'                               
         DC    C'3671',C'2141',C'KAKCA',X'000000'                               
         DC    C'3676',C'0646',C'KDDAA',X'000000'                               
         DC    C'3676',C'0671',C'KAOHA',X'000000'                               
         DC    C'3676',C'0645',C'     ',X'000000'                               
         DC    C'3678',C'2260',C'KAKEA',X'000000'                               
         DC    C'3679',C'0641',C'KCBCA',X'000000'                               
         DC    C'3679',C'2633',C'     ',X'000000'                               
         DC    C'3679',C'2634',C'     ',X'000000'                               
         DC    C'3686',C'1451',C'WABBA',X'000000'                               
         DC    C'3686',C'1453',C'KWESA',X'000000'                               
         DC    C'3686',C'1455',C'KBEEA',X'000000'                               
         DC    C'3686',C'1457',C'KBIBA',X'000000'                               
         DC    C'3686',C'1458',C'WBERA',X'000000'                               
         DC    C'3686',C'1484',C'KDOLA',X'000000'                               
         DC    C'3686',C'1535',C'DNETA',X'000000'                               
         DC    C'3686',C'3209',C'KKBLF',X'000000'                               
         DC    C'3686',C'3912',C'WRAMA',X'000000'                               
         DC    C'3686',C'4017',C'BNETA',X'000000'                               
         DC    C'3692',C'0193',C'KLSYF',X'000000'                               
         DC    C'3692',C'0214',C'WBEVA',X'000000'                               
         DC    C'3692',C'0218',C'WBVPA',X'000000'                               
         DC    C'3692',C'0221',C'KALOA',X'000000'                               
         DC    C'3692',C'0222',C'KBFSA',X'000000'                               
         DC    C'3692',C'0227',C'WBLFA',X'000000'                               
         DC    C'3692',C'0228',C'KARSA',X'000000'                               
         DC    C'3692',C'0229',C'WPKOF',X'000000'                               
         DC    C'3692',C'0230',C'KGVWA',X'000000'                               
         DC    C'3692',C'0233',C'WCCAA',X'000000'                               
         DC    C'3692',C'0237',C'WBIFF',X'000000'                               
         DC    C'3692',C'0239',C'WVOBA',X'000000'                               
         DC    C'3692',C'0240',C'WAYCA',X'000000'                               
         DC    C'3692',C'0253',C'WBLTA',X'000000'                               
         DC    C'3692',C'0255',C'KIBLA',X'000000'                               
         DC    C'3692',C'0303',C'WBKWF',X'000000'                               
         DC    C'3692',C'0338',C'KKCWF',X'000000'                               
         DC    C'3692',C'2514',C'     ',X'000000'                               
         DC    C'3692',C'2574',C'     ',X'000000'                               
         DC    C'3693',C'1254',C'KCVRA',X'000000'                               
         DC    C'3693',C'1258',C'WLIVA',X'000000'                               
         DC    C'3693',C'1260',C'KPRKA',X'000000'                               
         DC    C'3693',C'1261',C'ARN A',X'000000'                               
         DC    C'3693',C'1262',C'WLTNA',X'000000'                               
         DC    C'3693',C'1263',C'KETXA',X'000000'                               
         DC    C'3693',C'1265',C'WBPZA',X'000000'                               
         DC    C'3693',C'1266',C'WHZRF',X'000000'                               
         DC    C'3693',C'1278',C'WLGNA',X'000000'                               
         DC    C'3693',C'3174',C'WLVLA',X'000000'                               
         DC    C'3693',C'1277',C'     ',X'000000'                               
         DC    C'3693',C'1299',C'     ',X'000000'                               
         DC    C'3698',C'1471',C'AIN A',X'000000'                               
         DC    C'3698',C'3219',C'     ',X'000000'                               
         DC    C'3709',C'2171',C'KDOKA',X'000000'                               
         DC    C'3709',C'2172',C'WGMRF',X'000000'                               
         DC    C'3710',C'0927',C'WHAVA',X'000000'                               
         DC    C'3710',C'0955',C'WBKHA',X'000000'                               
         DC    C'3710',C'0956',C'WCPQA',X'000000'                               
         DC    C'3710',C'0960',C'     ',X'000000'                               
         DC    C'3716',C'0211',C'KQXLA',X'000000'                               
         DC    C'3718',C'1044',C'ABG A',X'000000'                               
         DC    C'3718',C'1086',C'WCJOF',X'000000'                               
         DC    C'3722',C'1204',C'WLKNA',X'000000'                               
         DC    C'3722',C'1248',C'WANLA',X'000000'                               
         DC    C'3722',C'1251',C'KECKA',X'000000'                               
         DC    C'3722',C'1252',C'WLONA',X'000000'                               
         DC    C'3722',C'1253',C'KBCHA',X'000000'                               
         DC    C'3722',C'1259',C'WSMIF',X'000000'                               
         DC    C'3722',C'1300',C'WPRCA',X'000000'                               
         DC    C'3722',C'3169',C'KLTFF',X'000000'                               
         DC    C'3722',C'3181',C'     ',X'000000'                               
         DC    C'3724',C'0753',C'KFGOA',X'000000'                               
         DC    C'3724',C'0769',C'KTDLA',X'000000'                               
         DC    C'3724',C'0773',C'     ',X'000000'                               
         DC    C'3743',C'0121',C'KANCA',X'000000'                               
         DC    C'3744',C'0932',C'WHPOF',X'000000'                               
         DC    C'3744',C'0981',C'WHAPA',X'000000'                               
         DC    C'3744',C'0991',C'KAHUA',X'000000'                               
         DC    C'3744',C'0993',C'KXARA',X'000000'                               
         DC    C'3744',C'0994',C'KIHRA',X'000000'                               
         DC    C'3744',C'0995',C'WABDA',X'000000'                               
         DC    C'3744',C'0996',C'WHHOA',X'000000'                               
         DC    C'3744',C'0997',C'KGHOA',X'000000'                               
         DC    C'3745',C'0745',C'KGMTA',X'000000'                               
         DC    C'3745',C'0746',C'WFGMF',X'000000'                               
         DC    C'3745',C'0747',C'WWKOA',X'000000'                               
         DC    C'3745',C'0748',C'WFAXA',X'000000'                               
         DC    C'3745',C'0749',C'WEELA',X'000000'                               
         DC    C'3745',C'0750',C'WALEA',X'000000'                               
         DC    C'3745',C'0751',C'KAKQF',X'000000'                               
         DC    C'3745',C'0752',C'WCIBF',X'000000'                               
         DC    C'3745',C'0757',C'WFMBA',X'000000'                               
         DC    C'3745',C'0765',C'KSUMA',X'000000'                               
         DC    C'3745',C'0776',C'WFIWA',X'000000'                               
         DC    C'3745',C'2802',C'WIOKF',X'000000'                               
         DC    C'3745',C'2804',C'KTNCA',X'000000'                               
         DC    C'3745',C'2810',C'WCNWA',X'000000'                               
         DC    C'3746',C'0900',C'KGUCA',X'000000'                               
         DC    C'3746',C'0903',C'KGYNA',X'000000'                               
         DC    C'3746',C'0904',C'WGSVA',X'000000'                               
         DC    C'3746',C'0905',C'WARKA',X'000000'                               
         DC    C'3746',C'0906',C'WBHCA',X'000000'                               
         DC    C'3746',C'0907',C'KOKCA',X'000000'                               
         DC    C'3746',C'0908',C'WKDXA',X'000000'                               
         DC    C'3746',C'0909',C'WFPRA',X'000000'                               
         DC    C'3746',C'0910',C'WRDIA',X'000000'                               
         DC    C'3746',C'0913',C'KSKIA',X'000000'                               
         DC    C'3746',C'0916',C'WJBBA',X'000000'                               
         DC    C'3746',C'0918',C'WERHA',X'000000'                               
         DC    C'3746',C'0923',C'KLYQA',X'000000'                               
         DC    C'3746',C'0928',C'WJOBA',X'000000'                               
         DC    C'3746',C'1011',C'WLWSF',X'000000'                               
         DC    C'3746',C'1014',C'WRNJA',X'000000'                               
         DC    C'3746',C'2906',C'WGCMF',X'000000'                               
         DC    C'3746',C'2915',C'WWHBF',X'000000'                               
         DC    C'3746',C'0914',C'     ',X'000000'                               
         DC    C'3749',C'1211',C'KLARA',X'000000'                               
         DC    C'3749',C'1213',C'KANSA',X'000000'                               
         DC    C'3751',C'0631',C'KADXF',X'000000'                               
         DC    C'3751',C'0634',C'KDQNA',X'000000'                               
         DC    C'3751',C'0640',C'KDLAA',X'000000'                               
         DC    C'3751',C'0632',C'     ',X'000000'                               
         DC    C'3752',C'0494',C'WAINA',X'000000'                               
         DC    C'3752',C'0521',C'KBZZA',X'000000'                               
         DC    C'3752',C'0543',C'WCBWF',X'000000'                               
         DC    C'3752',C'0555',C'KCTOA',X'000000'                               
         DC    C'3753',C'1649',C'WUATA',X'000000'                               
         DC    C'3753',C'1660',C'KCCRA',X'000000'                               
         DC    C'3753',C'1661',C'KARZA',X'000000'                               
         DC    C'3753',C'1662',C'WDHRF',X'000000'                               
         DC    C'3753',C'3399',C'     ',X'000000'                               
         DC    C'3755',C'0871',C'KAAKF',X'000000'                               
         DC    C'3755',C'0880',C'KFKAA',X'000000'                               
         DC    C'3755',C'4140',C'     ',X'000000'                               
         DC    C'3756',C'0251',C'KBITF',X'000000'                               
         DC    C'3756',C'0261',C'WCISA',X'000000'                               
         DC    C'3757',C'0311',C'EVANA',X'000000'                               
         DC    C'3758',C'1031',C'KFTZF',X'000000'                               
         DC    C'3758',C'1035',C'WNLAA',X'000000'                               
         DC    C'3758',C'1039',C'WDADA',X'000000'                               
         DC    C'3758',C'1041',C'WATIA',X'000000'                               
         DC    C'3758',C'1051',C'KEZNF',X'000000'                               
         DC    C'3758',C'1052',C'WFJTA',X'000000'                               
         DC    C'3758',C'1053',C'IFN A',X'000000'                               
         DC    C'3758',C'1534',C'IRN A',X'000000'                               
         DC    C'3758',C'1054',C'     ',X'000000'                               
         DC    C'3758',C'2916',C'     ',X'000000'                               
         DC    C'3758',C'2922',C'     ',X'000000'                               
         DC    C'3759',C'0455',C'IMRSA',X'000000'                               
         DC    C'3764',C'1734',C'KAPAA',X'000000'                               
         DC    C'3764',C'1739',C'KRIHA',X'000000'                               
         DC    C'3764',C'1740',C'KRTNA',X'000000'                               
         DC    C'3764',C'1741',C'KBHBA',X'000000'                               
         DC    C'3764',C'1742',C'WKNTA',X'000000'                               
         DC    C'3764',C'1743',C'KIQZF',X'000000'                               
         DC    C'3764',C'1744',C'WMOVA',X'000000'                               
         DC    C'3764',C'1745',C'KALFF',X'000000'                               
         DC    C'3764',C'1746',C'WEEUA',X'000000'                               
         DC    C'3765',C'0691',C'KAMAA',X'000000'                               
         DC    C'3765',C'0699',C'KMFEF',X'000000'                               
         DC    C'3765',C'0701',C'WJTBA',X'000000'                               
         DC    C'3765',C'0704',C'WSTLA',X'000000'                               
         DC    C'3765',C'0706',C'KELYA',X'000000'                               
         DC    C'3765',C'0712',C'WBMPF',X'000000'                               
         DC    C'3765',C'0734',C'WELYA',X'000000'                               
         DC    C'3765',C'2742',C'WZZCF',X'000000'                               
         DC    C'3770',C'1851',C'KALLA',X'000000'                               
         DC    C'3771',C'0001',C'ABCNA',X'000000'                               
         DC    C'3771',C'0010',C'WHAYF',X'000000'                               
         DC    C'3771',C'0012',C'WAMDA',X'000000'                               
         DC    C'3771',C'0015',C'WABVA',X'000000'                               
         DC    C'3771',C'0016',C'WANCA',X'000000'                               
         DC    C'3771',C'2510',C'     ',X'000000'                               
         DC    C'3773',C'0851',C'KEXOA',X'000000'                               
         DC    C'3789',C'2131',C'KAIRA',X'000000'                               
         DC    C'3789',C'2140',C'WBGYA',X'000000'                               
         DC    C'3789',C'2145',C'KBOSF',X'000000'                               
         DC    C'3790',C'0081',C'KABQA',X'000000'                               
         DC    C'3790',C'0089',C'WRMJF',X'000000'                               
         DC    C'3790',C'0090',C'WACDA',X'000000'                               
         DC    C'3790',C'0085',C'     ',X'000000'                               
         DC    C'3800',C'0181',C'KAFYA',X'000000'                               
         DC    C'3800',C'0183',C'KAPZA',X'000000'                               
         DC    C'3800',C'0187',C'KRUNA',X'000000'                               
         DC    C'3800',C'0184',C'     ',X'000000'                               
         DC    C'3800',C'0185',C'     ',X'000000'                               
         DC    C'3801',C'0721',C'CRE A',X'000000'                               
         DC    C'3801',C'0730',C'WEPAA',X'000000'                               
         DC    C'3803',C'1271',C'KABCA',X'000000'                               
         DC    C'3803',C'1275',C'KLBSA',X'000000'                               
         DC    C'3803',C'1279',C'WVKYA',X'000000'                               
         DC    C'3803',C'1280',C'WYRNA',X'000000'                               
         DC    C'3803',C'1287',C'WLSAF',X'000000'                               
         DC    C'3804',C'1594',C'KCHVA',X'000000'                               
         DC    C'3804',C'1604',C'KBYPA',X'000000'                               
         DC    C'3804',C'3374',C'WKXKF',X'000000'                               
         DC    C'3804',C'3413',C'KIDSF',X'000000'                               
         DC    C'3807',C'1891',C'GGP A',X'000000'                               
         DC    C'3810',C'2304',C'KATSF',X'000000'                               
         DC    C'3811',C'1751',C'KCBNA',X'000000'                               
         DC    C'3811',C'1753',C'WJCKF',X'000000'                               
         DC    C'3811',C'1755',C'KADQF',X'000000'                               
         DC    C'3813',C'1371',C'KAGOF',X'000000'                               
         DC    C'3813',C'1372',C'WWELA',X'000000'                               
         DC    C'3813',C'1373',C'WIGMA',X'000000'                               
         DC    C'3813',C'1380',C'TDBOF',X'000000'                               
         DC    C'3813',C'3202',C'KMEMF',X'000000'                               
         DC    C'3813',C'1374',C'     ',X'000000'                               
         DC    C'3819',C'1941',C'KBRDF',X'000000'                               
         DC    C'3819',C'0940',C'WJCMA',X'000000'                               
         DC    C'3820',C'1630',C'KINBF',X'000000'                               
         DC    C'3820',C'1689',C'WJOEA',X'000000'                               
         DC    C'3820',C'1690',C'WBBXA',X'000000'                               
         DC    C'3820',C'1691',C'KCGBF',X'000000'                               
         DC    C'3820',C'1692',C'WPAZA',X'000000'                               
         DC    C'3820',C'1693',C'WPDMA',X'000000'                               
         DC    C'3820',C'1696',C'WIOIA',X'000000'                               
         DC    C'3820',C'3415',C'WGLBF',X'000000'                               
         DC    C'3820',C'3420',C'KYROA',X'000000'                               
         DC    C'3820',C'3438',C'WVTYF',X'000000'                               
         DC    C'3825',C'1881',C'KBZTF',X'000000'                               
         DC    C'3825',C'1882',C'WCPZF',X'000000'                               
         DC    C'3825',C'1884',C'WMICA',X'000000'                               
         DC    C'3825',C'1888',C'WSMEA',X'000000'                               
         DC    C'3825',C'1889',C'KGILA',X'000000'                               
         DC    C'3825',C'1919',C'KPNDF',X'000000'                               
         DC    C'3828',C'1464',C'KESEA',X'000000'                               
         DC    C'3828',C'1465',C'KDMAA',X'000000'                               
         DC    C'3828',C'1839',C'KBOQF',X'000000'                               
         DC    C'3839',C'1221',C'KBMIA',X'000000'                               
         DC    C'3839',C'1223',C'WCNSA',X'000000'                               
         DC    C'3855',C'1911',C'KBLSA',X'000000'                               
         DC    C'3855',C'1998',C'WBRWA',X'000000'                               
         DC    C'3855',C'2000',C'KSRCA',X'000000'                               
         DC    C'3855',C'2001',C'WADJA',X'000000'                               
         DC    C'3855',C'2003',C'KBRVA',X'000000'                               
         DC    C'3855',C'2004',C'KQOKF',X'000000'                               
         DC    C'3855',C'2005',C'WSEKF',X'000000'                               
         DC    C'3855',C'2006',C'KROGF',X'000000'                               
         DC    C'3855',C'2015',C'WSBHF',X'000000'                               
         DC    C'3855',C'3407',C'WMPZF',X'000000'                               
         DC    C'3866',C'0811',C'KARMA',X'000000'                               
         DC    C'3866',C'0815',C'WFFVF',X'000000'                               
         DC    C'3866',C'0821',C'WFRBA',X'000000'                               
         DC    C'3866',C'2822',C'     ',X'000000'                               
         DC    C'3868',C'0471',C'KCHHF',X'000000'                               
         DC    C'3868',C'0472',C'WLQHA',X'000000'                               
         DC    C'3881',C'2002',C'WGECA',X'000000'                               
         DC    C'3881',C'2021',C'KDRKF',X'000000'                               
         DC    C'3881',C'2026',C'KBRSA',X'000000'                               
         DC    C'3881',C'3411',C'WXQKA',X'000000'                               
         DC    C'3883',C'1833',C'WESXA',X'000000'                               
         DC    C'3883',C'1840',C'WJBDA',X'000000'                               
         DC    C'3883',C'1843',C'WIOGF',X'000000'                               
         DC    C'3883',C'1849',C'WSLMA',X'000000'                               
         DC    C'3884',C'1117',C'WBUKA',X'000000'                               
         DC    C'3918',C'1901',C'KARAF',X'000000'                               
         DC    C'3920',C'2301',C'WAAFF',X'000000'                               
         DC    C'3920',C'2302',C'KWORA',X'000000'                               
         DC    C'3920',C'2312',C'KWYNA',X'000000'                               
         DC    C'3920',C'2324',C'KWYSA',X'000000'                               
         DC    C'3920',C'2325',C'WGICA',X'000000'                               
         DC    C'3920',C'2631',C'KRRBF',X'000000'                               
         DC    C'3920',C'2936',C'KTUFF',X'000000'                               
         DC    C'3920',C'3172',C'KEA F',X'000000'                               
         DC    C'3920',C'3883',C'KRDZA',X'000000'                               
         DC    C'3920',C'4025',C'WRQIF',X'000000'                               
         DC    C'3920',C'0018',C'     ',X'000000'                               
         DC    C'3920',C'2561',C'     ',X'000000'                               
         DC    C'3920',C'2683',C'     ',X'000000'                               
         DC    C'3920',C'2744',C'     ',X'000000'                               
         DC    C'3920',C'4007',C'     ',X'000000'                               
         DC    C'3920',C'0933',C'     ',X'000000'                               
         DC    C'3925',C'0925',C'KHOZA',X'000000'                               
         DC    C'3925',C'0930',C'KIEEF',X'000000'                               
         DC    C'3925',C'0943',C'WCMBA',X'000000'                               
         DC    C'3925',C'0944',C'WHBGA',X'000000'                               
         DC    C'3925',C'0945',C'WHBNA',X'000000'                               
         DC    C'3925',C'2927',C'     ',X'000000'                               
         DC    C'3930',C'1797',C'KIFXA',X'000000'                               
         DC    C'3930',C'1815',C'WGTAA',X'000000'                               
         DC    C'3930',C'1817',C'KRWBA',X'000000'                               
         DC    C'3930',C'1819',C'WRONA',X'000000'                               
         DC    C'3930',C'1797',C'     ',X'000000'                               
         DC    C'3930',C'1765',C'     ',X'000000'                               
         DC    C'3932',C'0819',C'WDISA',X'000000'                               
         DC    C'3938',C'1747',C'KAVAA',X'000000'                               
         DC    C'3938',C'1748',C'WGCBA',X'000000'                               
         DC    C'3938',C'1749',C'KOAKA',X'000000'                               
         DC    C'3938',C'1756',C'KRBNA',X'000000'                               
         DC    C'3938',C'1758',C'KPRBA',X'000000'                               
         DC    C'3938',C'3498',C'     ',X'000000'                               
         DC    C'3944',C'1498',C'WBPRF',X'000000'                               
         DC    C'3944',C'3215',C'     ',X'000000'                               
         DC    C'4001',C'1539',C'KRLXA',X'000000'                               
         DC    C'4001',C'4001',C'     ',X'000000'                               
         DC    C'4002',C'0082',C'WADSA',X'000000'                               
         DC    C'4002',C'0083',C'WAHCF',X'000000'                               
         DC    C'4002',C'0084',C'WRABA',X'000000'                               
         DC    C'4002',C'0126',C'KAPVF',X'000000'                               
         DC    C'4002',C'0128',C'WTTXA',X'000000'                               
         DC    C'4002',C'0132',C'WANAA',X'000000'                               
         DC    C'4002',C'0133',C'WATKA',X'000000'                               
         DC    C'4002',C'0135',C'WAPGA',X'000000'                               
         DC    C'4002',C'0136',C'KXGOF',X'000000'                               
         DC    C'4002',C'2500',C'WHFDF',X'000000'                               
         DC    C'4002',C'2515',C'KGBBF',X'000000'                               
         DC    C'4003',C'0170',C'KAUSA',X'000000'                               
         DC    C'4004',C'0127',C'WCSEF',X'000000'                               
         DC    C'4004',C'0129',C'KFYVA',X'000000'                               
         DC    C'4004',C'0134',C'KSVPA',X'000000'                               
         DC    C'4004',C'0137',C'KVRCA',X'000000'                               
         DC    C'4004',C'0138',C'KELSF',X'000000'                               
         DC    C'4004',C'0139',C'WAVAA',X'000000'                               
         DC    C'4004',C'0140',C'WJLKA',X'000000'                               
         DC    C'4004',C'0141',C'WATWA',X'000000'                               
         DC    C'4004',C'0142',C'KCMXA',X'000000'                               
         DC    C'4004',C'0144',C'WCMIA',X'000000'                               
         DC    C'4004',C'0145',C'WAQIA',X'000000'                               
         DC    C'4004',C'0146',C'KSNOA',X'000000'                               
         DC    C'4004',C'0149',C'WJMWA',X'000000'                               
         DC    C'4004',C'0155',C'KASTA',X'000000'                               
         DC    C'4004',C'0156',C'KSOKA',X'000000'                               
         DC    C'4004',C'0158',C'KMLAF',X'000000'                               
         DC    C'4004',C'0169',C'WISEA',X'000000'                               
         DC    C'4004',C'0174',C'KWJSF',X'000000'                               
         DC    C'4004',C'2499',C'KAREA',X'000000'                               
         DC    C'4004',C'2511',C'WGECF',X'000000'                               
         DC    C'4004',C'0093',C'     ',X'000000'                               
         DC    C'4004',C'0143',C'     ',X'000000'                               
         DC    C'4004',C'0173',C'     ',X'000000'                               
         DC    C'4004',C'2504',C'     ',X'000000'                               
         DC    C'4004',C'2507',C'     ',X'000000'                               
         DC    C'4008',C'0665',C'CDUBA',X'000000'                               
         DC    C'4009',C'0762',C'KAFFA',X'000000'                               
         DC    C'4015',C'1228',C'WKVAA',X'000000'                               
         DC    C'4015',C'1237',C'KLCMF',X'000000'                               
         DC    C'4015',C'1240',C'KOZEA',X'000000'                               
         DC    C'4015',C'1250',C'WCOUF',X'000000'                               
         DC    C'4017',C'0393',C'KCGQF',X'000000'                               
         DC    C'4017',C'2612',C'     ',X'000000'                               
         DC    C'4020',C'1809',C'KQENA',X'000000'                               
         DC    C'4022',C'1920',C'KSMMA',X'000000'                               
         DC    C'4022',C'1928',C'WJCDA',X'000000'                               
         DC    C'4022',C'1943',C'KCBIA',X'000000'                               
         DC    C'4022',C'1945',C'WAJOA',X'000000'                               
         DC    C'4022',C'1946',C'WBFMF',X'000000'                               
         DC    C'4022',C'1949',C'KSRDA',X'000000'                               
         DC    C'4022',C'1950',C'WFARA',X'000000'                               
         DC    C'4022',C'1966',C'WISLA',X'000000'                               
         DC    C'4022',C'1970',C'WDTMA',X'000000'                               
         DC    C'4022',C'1972',C'WSAOA',X'000000'                               
         DC    C'4022',C'1975',C'WSEVA',X'000000'                               
         DC    C'4022',C'1977',C'KIKZA',X'000000'                               
         DC    C'4022',C'1980',C'WTCHA',X'000000'                               
         DC    C'4022',C'3494',C'     ',X'000000'                               
         DC    C'4100',C'2062',C'WAZXA',X'000000'                               
         DC    C'4101',C'1576',C'WCATA',X'000000'                               
         DC    C'4101',C'1578',C'KIOFF',X'000000'                               
         DC    C'4101',C'1579',C'WJMAA',X'000000'                               
         DC    C'4101',C'1580',C'WAYRA',X'000000'                               
         DC    C'4101',C'3394',C'WDIXA',X'000000'                               
         DC    C'4104',C'1890',C'WEYEA',X'000000'                               
         DC    C'4105',C'2092',C'WCPSA',X'000000'                               
         DC    C'4106',C'2213',C'WEEWA',X'000000'                               
         DC    C'4106',C'2214',C'WANJF',X'000000'                               
         DC    C'4106',C'2217',C'WDEVA',X'000000'                               
         DC    C'4106',C'2220',C'WATRA',X'000000'                               
         DC    C'4106',C'3841',C'WCRVA',X'000000'                               
         DC    C'4106',C'2267',C'     ',X'000000'                               
         DC    C'4113',C'1409',C'WKGQA',X'000000'                               
         DC    C'4113',C'1410',C'WMLPA',X'000000'                               
         DC    C'4113',C'1414',C'     ',X'000000'                               
         DC    C'4115',C'0092',C'WAXTF',X'000000'                               
         DC    C'4115',C'0123',C'WAAOA',X'000000'                               
         DC    C'4115',C'0124',C'KACTA',X'000000'                               
         DC    C'4115',C'0125',C'WAIMA',X'000000'                               
         DC    C'4115',C'0130',C'WANNA',X'000000'                               
         DC    C'4115',C'2516',C'     ',X'000000'                               
         DC    C'4115',C'2554',C'     ',X'000000'                               
         DC    C'4116',C'1573',C'WBILF',X'000000'                               
         DC    C'4120',C'2105',C'WIPSA',X'000000'                               
         DC    C'4120',C'2106',C'WTTFA',X'000000'                               
         DC    C'4120',C'2107',C'WTHOA',X'000000'                               
         DC    C'4120',C'2109',C'WEYEF',X'000000'                               
         DC    C'4120',C'2114',C'WCUPF',X'000000'                               
         DC    C'4120',C'2115',C'WLKMA',X'000000'                               
         DC    C'4120',C'2116',C'WTIVA',X'000000'                               
         DC    C'4120',C'2143',C'KMDYA',X'000000'                               
         DC    C'4120',C'4023',C'TNETA',X'000000'                               
         DC    C'4120',C'2134',C'     ',X'000000'                               
         DC    C'4121',C'1794',C'WRHIA',X'000000'                               
         DC    C'4121',C'1795',C'WAYNA',X'000000'                               
         DC    C'4125',C'1656',C'WINJF',X'000000'                               
         DC    C'4125',C'1715',C'WPMEA',X'000000'                               
         DC    C'4125',C'1717',C'KNOIA',X'000000'                               
         DC    C'4125',C'1718',C'WCCFA',X'000000'                               
         DC    C'4125',C'1719',C'WBLBA',X'000000'                               
         DC    C'4125',C'3422',C'KLAYA',X'000000'                               
         DC    C'4125',C'1723',C'     ',X'000000'                               
         DC    C'4129',C'1293',C'WBBTA',X'000000'                               
         DC    C'4129',C'1294',C'KLFQF',X'000000'                               
         DC    C'4129',C'1295',C'WBRGA',X'000000'                               
         DC    C'4129',C'1296',C'KLYNF',X'000000'                               
         DC    C'4129',C'1297',C'WLYNF',X'000000'                               
         DC    C'4129',C'1302',C'WMCSA',X'000000'                               
         DC    C'4134',C'1508',C'WERIA',X'000000'                               
         DC    C'4134',C'1510',C'WETZA',X'000000'                               
         DC    C'4134',C'1523',C'WCOHA',X'000000'                               
         DC    C'4134',C'3315',C'WNBKF',X'000000'                               
         DC    C'4137',C'2289',C'WAMSA',X'000000'                               
         DC    C'4138',C'1637',C'KTPAA',X'000000'                               
         DC    C'4138',C'1694',C'WAVTF',X'000000'                               
         DC    C'4138',C'1695',C'WEOKA',X'000000'                               
         DC    C'4138',C'1700',C'KNOTA',X'000000'                               
         DC    C'4138',C'1709',C'KPOWA',X'000000'                               
         DC    C'4138',C'3425',C'WIBUA',X'000000'                               
         DC    C'4138',C'3426',C'WIQRA',X'000000'                               
         DC    C'4138',C'3429',C'WPREA',X'000000'                               
         DC    C'4139',C'0387',C'WHBCA',X'000000'                               
         DC    C'4139',C'0486',C'WKADA',X'000000'                               
         DC    C'4141',C'0516',C'WAMTA',X'000000'                               
         DC    C'4141',C'0515',C'WCOJA',X'000000'                               
         DC    C'4141',C'2629',C'     ',X'000000'                               
         DC    C'4143',C'1832',C'WLNGA',X'000000'                               
         DC    C'4143',C'4010',C'WKPEF',X'000000'                               
         DC    C'4144',C'0744',C'WFLOA',X'000000'                               
         DC    C'4144',C'0754',C'WKTJA',X'000000'                               
         DC    C'4144',C'0756',C'WFAGA',X'000000'                               
         DC    C'4144',C'0758',C'KENNA',X'000000'                               
         DC    C'4144',C'2805',C'KREIA',X'000000'                               
         DC    C'4144',C'2807',C'WHKWA',X'000000'                               
         DC    C'4144',C'0774',C'     ',X'000000'                               
         DC    C'4145',C'2165',C'KIAHF',X'000000'                               
         DC    C'4145',C'2173',C'KULYA',X'000000'                               
         DC    C'4146',C'1544',C'WHMPA',X'000000'                               
         DC    C'4146',C'1574',C'KBBRA',X'000000'                               
         DC    C'4148',C'1145',C'WIOUA',X'000000'                               
         DC    C'4149',C'0544',C'WCSIA',X'000000'                               
         DC    C'4149',C'2215',C'KCIIA',X'000000'                               
         DC    C'4149',C'2627',C'KJSKA',X'000000'                               
         DC    C'4153',C'1187',C'WHOKA',X'000000'                               
         DC    C'4153',C'1188',C'WXRLA',X'000000'                               
         DC    C'4153',C'1189',C'KAVLA',X'000000'                               
         DC    C'4155',C'2080',C'KTAEA',X'000000'                               
         DC    C'4155',C'2086',C'WDBIF',X'000000'                               
         DC    C'4155',C'2087',C'WTLKA',X'000000'                               
         DC    C'4155',C'2088',C'WNTTA',X'000000'                               
         DC    C'4155',C'2093',C'WESRA',X'000000'                               
         DC    C'4155',C'2094',C'WPEPA',X'000000'                               
         DC    C'4155',C'2095',C'WEEEF',X'000000'                               
         DC    C'4155',C'2100',C'WTZEA',X'000000'                               
         DC    C'4155',C'3423',C'WTCJA',X'000000'                               
         DC    C'4155',C'2138',C'     ',X'000000'                               
         DC    C'4155',C'4028',C'     ',X'000000'                               
         DC    C'4156',C'2169',C'WQSIF',X'000000'                               
         DC    C'4156',C'2170',C'WALRF',X'000000'                               
         DC    C'4156',C'2174',C'WBCUA',X'000000'                               
         DC    C'4156',C'2175',C'WMBSA',X'000000'                               
         DC    C'4156',C'3600',C'WJNRA',X'000000'                               
         DC    C'4159',C'0484',C'WFLMF',X'000000'                               
         DC    C'4159',C'0531',C'KEWSA',X'000000'                               
         DC    C'4159',C'0533',C'WFMHA',X'000000'                               
         DC    C'4159',C'0537',C'WAEWA',X'000000'                               
         DC    C'4159',C'0554',C'KBHTF',X'000000'                               
         DC    C'4159',C'0556',C'KAGHA',X'000000'                               
         DC    C'4159',C'0558',C'WCUGA',X'000000'                               
         DC    C'4159',C'0566',C'KSIGA',X'000000'                               
         DC    C'4159',C'0567',C'WCYNA',X'000000'                               
         DC    C'4159',C'0583',C'WCPMA',X'000000'                               
         DC    C'4159',C'0585',C'WALIA',X'000000'                               
         DC    C'4159',C'0597',C'DWZ F',X'000000'                               
         DC    C'4159',C'0598',C'WCULF',X'000000'                               
         DC    C'4159',C'0604',C'KUSHA',X'000000'                               
         DC    C'4159',C'0605',C'KDDDA',X'000000'                               
         DC    C'4159',C'2607',C'WRYOF',X'000000'                               
         DC    C'4159',C'2625',C'KBCCA',X'000000'                               
         DC    C'4159',C'2614',C'     ',X'000000'                               
         DC    C'4161',C'1269',C'KEESA',X'000000'                               
         DC    C'4161',C'1270',C'WBEAF',X'000000'                               
         DC    C'4161',C'1272',C'WLSCA',X'000000'                               
         DC    C'4161',C'1276',C'KRSNA',X'000000'                               
         DC    C'4161',C'1298',C'WAMQA',X'000000'                               
         DC    C'4165',C'2049',C'DWQ F',X'000000'                               
         DC    C'4165',C'2074',C'KDXEF',X'000000'                               
         DC    C'4165',C'2068',C'     ',X'000000'                               
         DC    C'4168',C'2626',C'KZZRA',X'000000'                               
         DC    C'4170',C'1924',C'WSPIF',X'000000'                               
         DC    C'4170',C'2057',C'WKOKA',X'000000'                               
         DC    C'4170',C'2067',C'KREWA',X'000000'                               
         DC    C'4170',C'2079',C'WAKXA',X'000000'                               
         DC    C'4170',C'3507',C'KRFSA',X'000000'                               
         DC    C'4170',C'3502',C'     ',X'000000'                               
         DC    C'4174',C'0373',C'WCOXA',X'000000'                               
         DC    C'4174',C'0382',C'WCEMA',X'000000'                               
         DC    C'4174',C'0394',C'WCMJF',X'000000'                               
         DC    C'4174',C'0414',C'KABGF',X'000000'                               
         DC    C'4175',C'0223',C'WCGCA',X'000000'                               
         DC    C'4175',C'0226',C'WBELA',X'000000'                               
         DC    C'4175',C'0234',C'WYBRA',X'000000'                               
         DC    C'4175',C'0241',C'KBFWA',X'000000'                               
         DC    C'4175',C'2557',C'KTQNF',X'000000'                               
         DC    C'4176',C'2200',C'WGOGA',X'000000'                               
         DC    C'4176',C'2204',C'KCLTF',X'000000'                               
         DC    C'4176',C'2259',C'KAOIF',X'000000'                               
         DC    C'4176',C'2272',C'KWALA',X'000000'                               
         DC    C'4176',C'3822',C'KRWAF',X'000000'                               
         DC    C'4176',C'1109',C'     ',X'000000'                               
         DC    C'4176',C'2319',C'     ',X'000000'                               
         DC    C'4176',C'3840',C'     ',X'000000'                               
         DC    C'4176',C'3856',C'     ',X'000000'                               
         DC    C'4177',C'1111',C'KINYA',X'000000'                               
         DC    C'4177',C'1112',C'WRYZA',X'000000'                               
         DC    C'4178',C'1115',C'KGTWF',X'000000'                               
         DC    C'4178',C'1123',C'WJREF',X'000000'                               
         DC    C'4178',C'1133',C'WKLPA',X'000000'                               
         DC    C'4179',C'1991',C'KIFWA',X'000000'                               
         DC    C'4179',C'1992',C'WSDLA',X'000000'                               
         DC    C'4179',C'1993',C'WQMRA',X'000000'                               
         DC    C'4179',C'1994',C'WMPMA',X'000000'                               
         DC    C'4179',C'1995',C'WCTOF',X'000000'                               
         DC    C'4179',C'1996',C'WEOOA',X'000000'                               
         DC    C'4180',C'0540',C'WCJUA',X'000000'                               
         DC    C'4180',C'0542',C'KAROF',X'000000'                               
         DC    C'4182',C'1151',C'WIZMA',X'000000'                               
         DC    C'4182',C'1152',C'WLDYA',X'000000'                               
         DC    C'4182',C'1160',C'WLFAA',X'000000'                               
         DC    C'4185',C'0489',C'WLSBA',X'000000'                               
         DC    C'4185',C'0492',C'KCKYA',X'000000'                               
         DC    C'4185',C'0530',C'KSHRA',X'000000'                               
         DC    C'4185',C'0549',C'KHSNA',X'000000'                               
         DC    C'4185',C'0557',C'WFAVF',X'000000'                               
         DC    C'4185',C'0564',C'WGSQF',X'000000'                               
         DC    C'4185',C'0578',C'WCTTA',X'000000'                               
         DC    C'4185',C'2623',C'KOOVF',X'000000'                               
         DC    C'4185',C'2610',C'     ',X'000000'                               
         DC    C'4190',C'1114',C'KNIAA',X'000000'                               
         DC    C'4190',C'1140',C'WKVIA',X'000000'                               
         DC    C'4190',C'4055',C'     ',X'000000'                               
         DC    C'4193',C'0715',C'WBDNA',X'000000'                               
         DC    C'4193',C'0717',C'KDCEA',X'000000'                               
         DC    C'4193',C'0718',C'KSIRF',X'000000'                               
         DC    C'4193',C'0719',C'KILRA',X'000000'                               
         DC    C'4193',C'0720',C'WULAA',X'000000'                               
         DC    C'4193',C'0722',C'WCPHA',X'000000'                               
         DC    C'4194',C'0911',C'KGRCF',X'000000'                               
         DC    C'4194',C'0912',C'WHVRA',X'000000'                               
         DC    C'4194',C'0915',C'KNGSA',X'000000'                               
         DC    C'4194',C'0919',C'KHDNA',X'000000'                               
         DC    C'4194',C'0920',C'KFCMF',X'000000'                               
         DC    C'4194',C'0921',C'WFSRA',X'000000'                               
         DC    C'4194',C'0929',C'KNODA',X'000000'                               
         DC    C'4194',C'0942',C'WEBQA',X'000000'                               
         DC    C'4194',C'1013',C'WDHBA',X'000000'                               
         DC    C'4194',C'2907',C'WHICA',X'000000'                               
         DC    C'4194',C'2917',C'WDCRA',X'000000'                               
         DC    C'4194',C'4005',C'WCCYA',X'000000'                               
         DC    C'4194',C'0922',C'     ',X'000000'                               
         DC    C'4195',C'1029',C'WKIQA',X'000000'                               
         DC    C'4195',C'1032',C'WIROA',X'000000'                               
         DC    C'4195',C'1033',C'CFOBA',X'000000'                               
         DC    C'4195',C'1034',C'KPIAA',X'000000'                               
         DC    C'4195',C'1036',C'WFXOF',X'000000'                               
         DC    C'4195',C'1037',C'WIONA',X'000000'                               
         DC    C'4195',C'1038',C'WLIXA',X'000000'                               
         DC    C'4195',C'1040',C'WCYOF',X'000000'                               
         DC    C'4195',C'1042',C'WJPDA',X'000000'                               
         DC    C'4195',C'1043',C'WEIVF',X'000000'                               
         DC    C'4195',C'1046',C'WJGAA',X'000000'                               
         DC    C'4195',C'1047',C'WACMA',X'000000'                               
         DC    C'4195',C'1048',C'WEKGA',X'000000'                               
         DC    C'4195',C'1049',C'KBOAA',X'000000'                               
         DC    C'4195',C'1050',C'KCJJA',X'000000'                               
         DC    C'4195',C'1055',C'KPBCA',X'000000'                               
         DC    C'4195',C'2912',C'WIKBF',X'000000'                               
         DC    C'4195',C'2913',C'WIMIF',X'000000'                               
         DC    C'4195',C'2918',C'KIKSA',X'000000'                               
         DC    C'4195',C'2919',C'     ',X'000000'                               
         DC    C'4195',C'2925',C'     ',X'000000'                               
         DC    C'4198',C'1735',C'KCUEA',X'000000'                               
         DC    C'4198',C'1750',C'WGMDF',X'000000'                               
         DC    C'4198',C'1752',C'KLGRA',X'000000'                               
         DC    C'4198',C'1754',C'WKXQA',X'000000'                               
         DC    C'4198',C'1757',C'KDUNA',X'000000'                               
         DC    C'4198',C'1759',C'WRDBA',X'000000'                               
         DC    C'4198',C'1764',C'WRVKA',X'000000'                               
         DC    C'4198',C'4006',C'     ',X'000000'                               
         DC    C'4198',C'4029',C'     ',X'000000'                               
         DC    C'4199',C'2195',C'WHLBA',X'000000'                               
         DC    C'4199',C'3814',C'KNCBA',X'000000'                               
         DC    C'4199',C'3815',C'KONGA',X'000000'                               
         DC    C'4199',C'3820',C'WGBMF',X'000000'                               
         DC    C'4200',C'1760',C'WAQEA',X'000000'                               
         DC    C'4201',C'0153',C'KJANA',X'000000'                               
         DC    C'4201',C'0157',C'KEORA',X'000000'                               
         DC    C'4201',C'0160',C'WAOAA',X'000000'                               
         DC    C'4201',C'0163',C'KMCWA',X'000000'                               
         DC    C'4201',C'0164',C'KAHIA',X'000000'                               
         DC    C'4201',C'0165',C'WIFFA',X'000000'                               
         DC    C'4201',C'0166',C'WASGA',X'000000'                               
         DC    C'4201',C'0168',C'KASYA',X'000000'                               
         DC    C'4201',C'2503',C'WMBOA',X'000000'                               
         DC    C'4201',C'4050',C'KEZTF',X'000000'                               
         DC    C'4201',C'0159',C'     ',X'000000'                               
         DC    C'4201',C'2506',C'     ',X'000000'                               
         DC    C'4202',C'0224',C'KBHPF',X'000000'                               
         DC    C'4203',C'0759',C'KBRFA',X'000000'                               
         DC    C'4203',C'0760',C'WELDA',X'000000'                               
         DC    C'4203',C'0763',C'WYHIA',X'000000'                               
         DC    C'4203',C'0764',C'WEIMA',X'000000'                               
         DC    C'4203',C'0766',C'WFINA',X'000000'                               
         DC    C'4203',C'0767',C'WBHBA',X'000000'                               
         DC    C'4203',C'0772',C'     ',X'000000'                               
         DC    C'4204',C'1323',C'WMMHA',X'000000'                               
         DC    C'4204',C'1346',C'KDAOF',X'000000'                               
         DC    C'4204',C'1352',C'KKCKF',X'000000'                               
         DC    C'4204',C'1353',C'WEPMA',X'000000'                               
         DC    C'4204',C'1354',C'WEAGA',X'000000'                               
         DC    C'4204',C'1361',C'KCULA',X'000000'                               
         DC    C'4204',C'1363',C'WHEEA',X'000000'                               
         DC    C'4204',C'1375',C'KMYCA',X'000000'                               
         DC    C'4204',C'1377',C'WCBKA',X'000000'                               
         DC    C'4204',C'1390',C'WCMTA',X'000000'                               
         DC    C'4204',C'1418',C'KNDYA',X'000000'                               
         DC    C'4204',C'3220',C'KOSCA',X'000000'                               
         DC    C'4204',C'1303',C'     ',X'000000'                               
         DC    C'4205',C'2276',C'KAGEA',X'000000'                               
         DC    C'4207',C'1057',C'WCLOA',X'000000'                               
         DC    C'4207',C'1065',C'WHUGF',X'000000'                               
         DC    C'4207',C'1066',C'KQDJA',X'000000'                               
         DC    C'4207',C'1067',C'WCLCA',X'000000'                               
         DC    C'4207',C'1068',C'WARFA',X'000000'                               
         DC    C'4207',C'1069',C'WLEJA',X'000000'                               
         DC    C'4209',C'0013',C'KABRA',X'000000'                               
         DC    C'4210',C'1439',C'KMITF',X'000000'                               
         DC    C'4210',C'1440',C'KURAA',X'000000'                               
         DC    C'4210',C'3205',C'KRESF',X'000000'                               
         DC    C'4211',C'2042',C'KCLDA',X'000000'                               
         DC    C'4211',C'2053',C'KSTVA',X'000000'                               
         DC    C'4211',C'4014',C'KBCRA',X'000000'                               
         DC    C'4216',C'1313',C'KMADA',X'000000'                               
         DC    C'4216',C'1314',C'WSJRA',X'000000'                               
         DC    C'4216',C'1315',C'KHOTA',X'000000'                               
         DC    C'4216',C'1316',C'WORXA',X'000000'                               
         DC    C'4216',C'1317',C'WFMWA',X'000000'                               
         DC    C'4216',C'1320',C'WMAFA',X'000000'                               
         DC    C'4216',C'1324',C'WYTHA',X'000000'                               
         DC    C'4216',C'1328',C'WKYZA',X'000000'                               
         DC    C'4216',C'3196',C'     ',X'000000'                               
         DC    C'4216',C'3216',C'     ',X'000000'                               
         DC    C'4218',C'0493',C'KCUZA',X'000000'                               
         DC    C'4218',C'0508',C'WXCFA',X'000000'                               
         DC    C'4218',C'0509',C'WALVA',X'000000'                               
         DC    C'4218',C'2621',C'KLNTA',X'000000'                               
         DC    C'4218',C'2608',C'     ',X'000000'                               
         DC    C'4222',C'1301',C'WJEQF',X'000000'                               
         DC    C'4227',C'1761',C'WCBRA',X'000000'                               
         DC    C'4227',C'1762',C'WKBVA',X'000000'                               
         DC    C'4227',C'1763',C'KMTIA',X'000000'                               
         DC    C'4227',C'1772',C'WRICA',X'000000'                               
         DC    C'4227',C'4027',C'WAZEF',X'000000'                               
         DC    C'4227',C'3403',C'     ',X'000000'                               
         DC    C'4227',C'4820',C'     ',X'000000'                               
         DC    C'4230',C'0668',C'KDGOA',X'000000'                               
         DC    C'4230',C'0673',C'KSEOA',X'000000'                               
         DC    C'4231',C'0629',C'KDEMF',X'000000'                               
         DC    C'4231',C'0630',C'KRVEF',X'000000'                               
         DC    C'4231',C'0633',C'KDSNA',X'000000'                               
         DC    C'4231',C'0639',C'WXALA',X'000000'                               
         DC    C'4231',C'4035',C'     ',X'000000'                               
         DC    C'4232',C'1572',C'KNEKA',X'000000'                               
         DC    C'4232',C'1575',C'WAMIA',X'000000'                               
         DC    C'4232',C'3372',C'     ',X'000000'                               
         DC    C'4233',C'1203',C'KLWNA',X'000000'                               
         DC    C'4233',C'1205',C'WLESA',X'000000'                               
         DC    C'4233',C'1207',C'WDXEA',X'000000'                               
         DC    C'4233',C'1208',C'WAMLA',X'000000'                               
         DC    C'4233',C'1212',C'WGXLF',X'000000'                               
         DC    C'4233',C'1220',C'WEWOA',X'000000'                               
         DC    C'4233',C'1222',C'WCCMA',X'000000'                               
         DC    C'4233',C'1224',C'WLMDA',X'000000'                               
         DC    C'4233',C'1242',C'WLAWA',X'000000'                               
         DC    C'4234',C'1358',C'WAKHF',X'000000'                               
         DC    C'4234',C'1359',C'KNEXA',X'000000'                               
         DC    C'4234',C'1360',C'KBRLA',X'000000'                               
         DC    C'4234',C'1365',C'WBYZF',X'000000'                               
         DC    C'4234',C'1367',C'KVSAA',X'000000'                               
         DC    C'4234',C'1370',C'WEOZF',X'000000'                               
         DC    C'4234',C'1379',C'WMCLA',X'000000'                               
         DC    C'4234',C'1384',C'WHDMA',X'000000'                               
         DC    C'4234',C'1387',C'WAKIA',X'000000'                               
         DC    C'4234',C'1394',C'KXEMA',X'000000'                               
         DC    C'4234',C'1419',C'KCYXA',X'000000'                               
         DC    C'4234',C'1427',C'KMMKF',X'000000'                               
         DC    C'4237',C'1793',C'WINXA',X'000000'                               
         DC    C'4237',C'1803',C'WHBTF',X'000000'                               
         DC    C'4237',C'1810',C'KTLBF',X'000000'                               
         DC    C'4237',C'1812',C'WCECA',X'000000'                               
         DC    C'4237',C'1813',C'KMERA',X'000000'                               
         DC    C'4237',C'1814',C'KAVIA',X'000000'                               
         DC    C'4238',C'0400',C'KCFIA',X'000000'                               
         DC    C'4238',C'0413',C'KBREA',X'000000'                               
         DC    C'4239',C'2197',C'KNEUA',X'000000'                               
         DC    C'4239',C'3816',C'WVSAA',X'000000'                               
         DC    C'4241',C'0838',C'KCMKA',X'000000'                               
         DC    C'4241',C'0842',C'WENTA',X'000000'                               
         DC    C'4241',C'0843',C'WIGSA',X'000000'                               
         DC    C'4241',C'0844',C'WCZIF',X'000000'                               
         DC    C'4241',C'0846',C'WSLGA',X'000000'                               
         DC    C'4241',C'0847',C'KLOEA',X'000000'                               
         DC    C'4241',C'0849',C'KIKOF',X'000000'                               
         DC    C'4241',C'0852',C'WDDYA',X'000000'                               
         DC    C'4241',C'0859',C'KCTIA',X'000000'                               
         DC    C'4241',C'0864',C'WKAMA',X'000000'                               
         DC    C'4241',C'2911',C'KMGQA',X'000000'                               
         DC    C'4242',C'1837',C'KVHRA',X'000000'                               
         DC    C'4243',C'0792',C'KFTMA',X'000000'                               
         DC    C'4243',C'0809',C'WGLOA',X'000000'                               
         DC    C'4243',C'0810',C'KKEZF',X'000000'                               
         DC    C'4243',C'2813',C'KCOLA',X'000000'                               
         DC    C'4243',C'2818',C'WFAWA',X'000000'                               
         DC    C'4243',C'4004',C'KWBJF',X'000000'                               
         DC    C'4244',C'1927',C'WMPIF',X'000000'                               
         DC    C'4244',C'1933',C'WAZYF',X'000000'                               
         DC    C'4244',C'1936',C'KCMIF',X'000000'                               
         DC    C'4244',C'1937',C'WCNAF',X'000000'                               
         DC    C'4244',C'1940',C'WSFDA',X'000000'                               
         DC    C'4245',C'1555',C'KANNA',X'000000'                               
         DC    C'4245',C'1559',C'WDJRF',X'000000'                               
         DC    C'4245',C'3370',C'KMYXF',X'000000'                               
         DC    C'4245',C'4018',C'AGOHA',X'000000'                               
         DC    C'4246',C'2198',C'KFLJA',X'000000'                               
         DC    C'4246',C'2203',C'WALDA',X'000000'                               
         DC    C'4246',C'2205',C'WDLAA',X'000000'                               
         DC    C'4246',C'2206',C'WNAEA',X'000000'                               
         DC    C'4246',C'2207',C'KOKOA',X'000000'                               
         DC    C'4246',C'2208',C'WARRA',X'000000'                               
         DC    C'4246',C'2209',C'WTBQA',X'000000'                               
         DC    C'4246',C'2216',C'WEERA',X'000000'                               
         DC    C'4246',C'2223',C'KAFRF',X'000000'                               
         DC    C'4246',C'2227',C'KWRFA',X'000000'                               
         DC    C'4246',C'2228',C'WNRBF',X'000000'                               
         DC    C'4246',C'2229',C'WCHOA',X'000000'                               
         DC    C'4246',C'2258',C'KOWOA',X'000000'                               
         DC    C'4246',C'2328',C'WTRQA',X'000000'                               
         DC    C'4246',C'2330',C'KAYQA',X'000000'                               
         DC    C'4246',C'3826',C'WAXCF',X'000000'                               
         DC    C'4246',C'3844',C'KDFMF',X'000000'                               
         DC    C'4246',C'3848',C'KRLWA',X'000000'                               
         DC    C'4246',C'3849',C'WAREA',X'000000'                               
         DC    C'4246',C'3850',C'WNNTA',X'000000'                               
         DC    C'4246',C'3854',C'KWREA',X'000000'                               
         DC    C'4246',C'3855',C'WCOPA',X'000000'                               
         DC    C'4246',C'3867',C'WBWAF',X'000000'                               
         DC    C'4246',C'3885',C'WECOA',X'000000'                               
         DC    C'4246',C'2210',C'     ',X'000000'                               
         DC    C'4247',C'0417',C'KGGFA',X'000000'                               
         DC    C'4247',C'0518',C'WANGF',X'000000'                               
         DC    C'4247',C'0520',C'KCDAF',X'000000'                               
         DC    C'4247',C'0523',C'KLZYF',X'000000'                               
         DC    C'4247',C'0529',C'KXXXA',X'000000'                               
         DC    C'4247',C'0539',C'KIXVF',X'000000'                               
         DC    C'4248',C'0840',C'WISZA',X'000000'                               
         DC    C'4248',C'0856',C'KLANF',X'000000'                               
         DC    C'4249',C'2571',C'KBROA',X'000000'                               
         DC    C'4249',C'0272',C'WJJYF',X'000000'                               
         DC    C'4249',C'0280',C'KBHMA',X'000000'                               
         DC    C'4249',C'0285',C'KTTXA',X'000000'                               
         DC    C'4249',C'0286',C'WBTSA',X'000000'                               
         DC    C'4249',C'0293',C'KBRIA',X'000000'                               
         DC    C'4249',C'0312',C'KROPA',X'000000'                               
         DC    C'4249',C'0317',C'KBMNA',X'000000'                               
         DC    C'4249',C'0324',C'WESBA',X'000000'                               
         DC    C'4249',C'0325',C'WPNFA',X'000000'                               
         DC    C'4249',C'0326',C'WBISA',X'000000'                               
         DC    C'4249',C'0327',C'CTRNA',X'000000'                               
         DC    C'4249',C'0332',C'WSNJA',X'000000'                               
         DC    C'4249',C'0334',C'GKNUF',X'000000'                               
         DC    C'4249',C'0336',C'SCKXF',X'000000'                               
         DC    C'4249',C'0339',C'KBMWA',X'000000'                               
         DC    C'4249',C'0340',C'WPUTA',X'000000'                               
         DC    C'4249',C'0342',C'WMMGF',X'000000'                               
         DC    C'4249',C'0343',C'KBUHA',X'000000'                               
         DC    C'4249',C'0344',C'WKVTA',X'000000'                               
         DC    C'4249',C'0346',C'WBDJF',X'000000'                               
         DC    C'4249',C'0359',C'KLGTF',X'000000'                               
         DC    C'4249',C'0363',C'WRNWF',X'000000'                               
         DC    C'4249',C'0365',C'KNELA',X'000000'                               
         DC    C'4249',C'0284',C'     ',X'000000'                               
         DC    C'4257',C'1648',C'KEYEA',X'000000'                               
         DC    C'4259',C'1206',C'KFUNA',X'000000'                               
         DC    C'4259',C'1214',C'KASKA',X'000000'                               
         DC    C'4260',C'1912',C'KAFEA',X'000000'                               
         DC    C'4261',C'1942',C'KGFFA',X'000000'                               
         DC    C'4261',C'1947',C'KMA A',X'000000'                               
         DC    C'4261',C'1951',C'WMBTA',X'000000'                               
         DC    C'4261',C'1953',C'WADAA',X'000000'                               
         DC    C'4261',C'1963',C'WHBLA',X'000000'                               
         DC    C'4261',C'1964',C'WCNDA',X'000000'                               
         DC    C'4261',C'1967',C'WSVLA',X'000000'                               
         DC    C'4261',C'1968',C'WKCFF',X'000000'                               
         DC    C'4261',C'1973',C'WHALA',X'000000'                               
         DC    C'4261',C'1979',C'KCTBF',X'000000'                               
         DC    C'4261',C'3500',C'KMASA',X'000000'                               
         DC    C'4262',C'0100',C'KALVA',X'000000'                               
         DC    C'4263',C'1030',C'KBELA',X'000000'                               
         DC    C'4264',C'1378',C'KMCOF',X'000000'                               
         DC    C'4266',C'2310',C'KSIWA',X'000000'                               
         DC    C'4266',C'3882',C'WNRIA',X'000000'                               
         DC    C'4267',C'0003',C'NBCNA',X'000000'                               
         DC    C'4267',C'1497',C'KDBHF',X'000000'                               
         DC    C'4267',C'1503',C'WNKYA',X'000000'                               
         DC    C'4267',C'1532',C'KNCYA',X'000000'                               
         DC    C'4267',C'3300',C'KSFEA',X'000000'                               
         DC    C'4267',C'3314',C'WCCNA',X'000000'                               
         DC    C'4267',C'3338',C'KNEMA',X'000000'                               
         DC    C'4267',C'3312',C'     ',X'000000'                               
         DC    C'4270',C'0998',C'KACQF',X'000000'                               
         DC    C'4270',C'0999',C'KOBHA',X'000000'                               
         DC    C'4273',C'1784',C'WHAKA',X'000000'                               
         DC    C'4273',C'1804',C'WRGSA',X'000000'                               
         DC    C'4273',C'1818',C'KAMOA',X'000000'                               
         DC    C'4274',C'1499',C'KFNVA',X'000000'                               
         DC    C'4275',C'1623',C'KPGAF',X'000000'                               
         DC    C'4275',C'1654',C'WCMPA',X'000000'                               
         DC    C'4275',C'1663',C'KADLA',X'000000'                               
         DC    C'4275',C'1664',C'KPALA',X'000000'                               
         DC    C'4275',C'1665',C'WANOA',X'000000'                               
         DC    C'4275',C'1666',C'WWYOA',X'000000'                               
         DC    C'4275',C'1667',C'KLOHA',X'000000'                               
         DC    C'4275',C'1668',C'WPTWA',X'000000'                               
         DC    C'4275',C'1670',C'KKISA',X'000000'                               
         DC    C'4275',C'3431',C'     ',X'000000'                               
         DC    C'4275',C'3433',C'     ',X'000000'                               
         DC    C'4276',C'1826',C'WHWBA',X'000000'                               
         DC    C'4276',C'1827',C'WCABA',X'000000'                               
         DC    C'4276',C'1828',C'KRUSA',X'000000'                               
         DC    C'4276',C'1831',C'KAERF',X'000000'                               
         DC    C'4277',C'0482',C'WSCGF',X'000000'                               
         DC    C'4277',C'0527',C'WADIF',X'000000'                               
         DC    C'4277',C'0559',C'WCONA',X'000000'                               
         DC    C'4277',C'0576',C'WCBAA',X'000000'                               
         DC    C'4277',C'0577',C'WWLEA',X'000000'                               
         DC    C'4278',C'1500',C'WNRKA',X'000000'                               
         DC    C'4278',C'1504',C'WNBYA',X'000000'                               
         DC    C'4278',C'1505',C'WBNRA',X'000000'                               
         DC    C'4278',C'1506',C'WBSMA',X'000000'                               
         DC    C'4278',C'1507',C'WAVZA',X'000000'                               
         DC    C'4278',C'1515',C'WACKA',X'000000'                               
         DC    C'4278',C'1516',C'WCTCA',X'000000'                               
         DC    C'4278',C'1519',C'WKDKA',X'000000'                               
         DC    C'4278',C'1520',C'WRKLA',X'000000'                               
         DC    C'4278',C'1536',C'KGNBA',X'000000'                               
         DC    C'4278',C'1537',C'WCLTA',X'000000'                               
         DC    C'4278',C'1562',C'WBZYA',X'000000'                               
         DC    C'4278',C'3303',C'WNAUA',X'000000'                               
         DC    C'4278',C'3305',C'WCEAA',X'000000'                               
         DC    C'4278',C'3337',C'WCTWA',X'000000'                               
         DC    C'4278',C'3311',C'     ',X'000000'                               
         DC    C'4278',C'3313',C'     ',X'000000'                               
         DC    C'4279',C'2151',C'WCFBA',X'000000'                               
         DC    C'4280',C'2187',C'WJFLA',X'000000'                               
         DC    C'4280',C'4016',C'KVSVA',X'000000'                               
         DC    C'4281',C'1238',C'WRELA',X'000000'                               
         DC    C'4281',C'1245',C'RJB A',X'000000'                               
         DC    C'4281',C'3179',C'     ',X'000000'                               
         DC    C'4283',C'0694',C'KFFXF',X'000000'                               
         DC    C'4283',C'0696',C'WENGA',X'000000'                               
         DC    C'4283',C'0697',C'WEVAA',X'000000'                               
         DC    C'4283',C'0709',C'     ',X'000000'                               
         DC    C'4284',C'2266',C'KBUZF',X'000000'                               
         DC    C'4284',C'2270',C'KMARA',X'000000'                               
         DC    C'4284',C'2279',C'KWYRA',X'000000'                               
         DC    C'4284',C'2299',C'WCKMA',X'000000'                               
         DC    C'4284',C'2297',C'     ',X'000000'                               
         DC    C'4284',C'3825',C'     ',X'000000'                               
         DC    C'4285',C'0850',C'KMMJA',X'000000'                               
         DC    C'4288',C'0112',C'WAMYA',X'000000'                               
         DC    C'4288',C'0113',C'KASIA',X'000000'                               
         DC    C'4288',C'0114',C'WCSSA',X'000000'                               
         DC    C'4288',C'0115',C'WAMVA',X'000000'                               
         DC    C'4288',C'0118',C'KANAA',X'000000'                               
         DC    C'4288',C'0119',C'KAGTA',X'000000'                               
         DC    C'4288',C'0120',C'KRPTA',X'000000'                               
         DC    C'4288',C'0122',C'WTTTA',X'000000'                               
         DC    C'4288',C'0017',C'     ',X'000000'                               
         DC    C'4288',C'0117',C'     ',X'000000'                               
         DC    C'4289',C'1399',C'KATLA',X'000000'                               
         DC    C'4289',C'1407',C'WMRCA',X'000000'                               
         DC    C'4289',C'1408',C'WAFLF',X'000000'                               
         DC    C'4289',C'1412',C'WFIFA',X'000000'                               
         DC    C'4290',C'1954',C'KROEA',X'000000'                               
         DC    C'4292',C'1848',C'KATOA',X'000000'                               
         DC    C'4293',C'0917',C'WMDCA',X'000000'                               
         DC    C'4293',C'0926',C'KAWWA',X'000000'                               
         DC    C'4293',C'0948',C'WKCMA',X'000000'                               
         DC    C'4293',C'0957',C'WHSMA',X'000000'                               
         DC    C'4293',C'0958',C'KAYSA',X'000000'                               
         DC    C'4293',C'0959',C'WCEHA',X'000000'                               
         DC    C'4293',C'0961',C'WKICA',X'000000'                               
         DC    C'4293',C'0963',C'WVOHA',X'000000'                               
         DC    C'4293',C'0964',C'WAZLA',X'000000'                               
         DC    C'4293',C'0985',C'KOJMA',X'000000'                               
         DC    C'4293',C'2940',C'KKMXA',X'000000'                               
         DC    C'4293',C'0976',C'     ',X'000000'                               
         DC    C'4293',C'2934',C'     ',X'000000'                               
         DC    C'4302',C'0236',C'WELZA',X'000000'                               
         DC    C'4306',C'0294',C'WBHTA',X'000000'                               
         DC    C'4306',C'0314',C'KMRQF',X'000000'                               
         DC    C'4306',C'0316',C'WODIA',X'000000'                               
         DC    C'4306',C'0329',C'WASPA',X'000000'                               
         DC    C'4306',C'0337',C'KBORF',X'000000'                               
         DC    C'4306',C'0360',C'WWJBA',X'000000'                               
         DC    C'4306',C'2567',C'WMKXF',X'000000'                               
         DC    C'4306',C'2568',C'KGKGF',X'000000'                               
         DC    C'4306',C'2558',C'     ',X'000000'                               
         DC    C'4308',C'0879',C'WNAGA',X'000000'                               
         DC    C'4308',C'0885',C'WHIEA',X'000000'                               
         DC    C'4308',C'2903',C'KGRNA',X'000000'                               
         DC    C'4310',C'2269',C'WONAA',X'000000'                               
         DC    C'4311',C'1230',C'WBUYA',X'000000'                               
         DC    C'4311',C'1239',C'KRVNA',X'000000'                               
         DC    C'4311',C'1249',C'WXTNA',X'000000'                               
         DC    C'4312',C'2306',C'WNOWA',X'000000'                               
         DC    C'4312',C'2307',C'KAWLA',X'000000'                               
         DC    C'4312',C'2315',C'WYLSA',X'000000'                               
         DC    C'4312',C'2316',C'WAZFA',X'000000'                               
         DC    C'4312',C'2333',C'KYOCF',X'000000'                               
         DC    C'4312',C'3887',C'     ',X'000000'                               
         DC    C'4313',C'1146',C'WBKJF',X'000000'                               
         DC    C'4313',C'1150',C'WEMJA',X'000000'                               
         DC    C'4313',C'1153',C'KTOLA',X'000000'                               
         DC    C'4313',C'4022',C'FKENA',X'000000'                               
         DC    C'4315',C'1545',C'WNARA',X'000000'                               
         DC    C'4315',C'1546',C'WMNBA',X'000000'                               
         DC    C'4315',C'3333',C'KEXLF',X'000000'                               
         DC    C'4318',C'0196',C'WRBIF',X'000000'                               
         DC    C'4318',C'0202',C'KBTAA',X'000000'                               
         DC    C'4318',C'0204',C'WBLEA',X'000000'                               
         DC    C'4318',C'0210',C'WIGYF',X'000000'                               
         DC    C'4320',C'1938',C'KOKQF',X'000000'                               
         DC    C'4320',C'1939',C'KSWBA',X'000000'                               
         DC    C'4320',C'1976',C'KKSYF',X'000000'                               
         DC    C'4321',C'0310',C'WBOXA',X'000000'                               
         DC    C'4323',C'1990',C'WKMBA',X'000000'                               
         DC    C'4323',C'2007',C'KSPIA',X'000000'                               
         DC    C'4323',C'2035',C'WSTJA',X'000000'                               
         DC    C'4324',C'0695',C'WIRBA',X'000000'                               
         DC    C'4324',C'0713',C'KCRCA',X'000000'                               
         DC    C'4324',C'0716',C'KWVRA',X'000000'                               
         DC    C'4324',C'0737',C'KTRQA',X'000000'                               
         DC    C'4325',C'0099',C'KWHWA',X'000000'                               
         DC    C'4325',C'0108',C'KCNOA',X'000000'                               
         DC    C'4326',C'2065',C'WJATA',X'000000'                               
         DC    C'4326',C'2066',C'WFEBA',X'000000'                               
         DC    C'4326',C'2070',C'WMSJA',X'000000'                               
         DC    C'4326',C'2072',C'WSYLA',X'000000'                               
         DC    C'4326',C'2073',C'WSGBA',X'000000'                               
         DC    C'4326',C'3408',C'KSUEF',X'000000'                               
         DC    C'4326',C'3503',C'WDEHA',X'000000'                               
         DC    C'4326',C'3504',C'KFIRA',X'000000'                               
         DC    C'4326',C'4369',C'     ',X'000000'                               
         DC    C'4328',C'0686',C'WSERA',X'000000'                               
         DC    C'4328',C'0693',C'WELVA',X'000000'                               
         DC    C'4328',C'0705',C'KELKA',X'000000'                               
         DC    C'4328',C'0707',C'KXLEA',X'000000'                               
         DC    C'4328',C'2743',C'WSOLA',X'000000'                               
         DC    C'4329',C'1184',C'KLMRA',X'000000'                               
         DC    C'4329',C'1194',C'KCYLA',X'000000'                               
         DC    C'4329',C'2008',C'KOWLA',X'000000'                               
         DC    C'4329',C'3173',C'KQIKA',X'000000'                               
         DC    C'4332',C'1257',C'KNYOA',X'000000'                               
         DC    C'4332',C'1264',C'WLOGA',X'000000'                               
         DC    C'4332',C'1268',C'WMJYF',X'000000'                               
         DC    C'4332',C'1273',C'KCDCF',X'000000'                               
         DC    C'4332',C'1274',C'WFTGA',X'000000'                               
         DC    C'4332',C'1283',C'KBLQA',X'000000'                               
         DC    C'4332',C'1286',C'KLLBA',X'000000'                               
         DC    C'4332',C'3177',C'KNACF',X'000000'                               
         DC    C'4334',C'2305',C'KQHUF',X'000000'                               
         DC    C'4335',C'1219',C'WJRIA',X'000000'                               
         DC    C'4335',C'1227',C'WBCBA',X'000000'                               
         DC    C'4335',C'1232',C'WKIKA',X'000000'                               
         DC    C'4335',C'1236',C'KLEMA',X'000000'                               
         DC    C'4335',C'1246',C'WJJMA',X'000000'                               
         DC    C'4335',C'1256',C'WCMXA',X'000000'                               
         DC    C'4335',C'3176',C'WKCJF',X'000000'                               
         DC    C'4336',C'1989',C'KRBIA',X'000000'                               
         DC    C'4336',C'2040',C'WMCFF',X'000000'                               
         DC    C'4336',C'2056',C'KAYLA',X'000000'                               
         DC    C'4336',C'2058',C'WVPOF',X'000000'                               
         DC    C'4336',C'2059',C'WDORA',X'000000'                               
         DC    C'4336',C'2063',C'WFWAF',X'000000'                               
         DC    C'4336',C'2064',C'KTUIA',X'000000'                               
         DC    C'4336',C'2069',C'KWAKA',X'000000'                               
         DC    C'4336',C'4040',C'WSPCA',X'000000'                               
         DC    C'4336',C'2055',C'     ',X'000000'                               
         DC    C'4336',C'2075',C'     ',X'000000'                               
         DC    C'4336',C'3400',C'     ',X'000000'                               
         DC    C'4336',C'3506',C'     ',X'000000'                               
         DC    C'4337',C'0386',C'WHYLA',X'000000'                               
         DC    C'4337',C'0437',C'WDHPF',X'000000'                               
         DC    C'4337',C'0460',C'WCDLA',X'000000'                               
         DC    C'4337',C'2616',C'WCILF',X'000000'                               
         DC    C'4337',C'0396',C'     ',X'000000'                               
         DC    C'4338',C'1957',C'KNFTA',X'000000'                               
         DC    C'4338',C'1962',C'KKASA',X'000000'                               
         DC    C'4338',C'1974',C'CIL A',X'000000'                               
         DC    C'4338',C'1965',C'     ',X'000000'                               
         DC    C'4339',C'0295',C'KBEWA',X'000000'                               
         DC    C'4339',C'0296',C'WBWBF',X'000000'                               
         DC    C'4339',C'0301',C'WAKCA',X'000000'                               
         DC    C'4339',C'0302',C'WCNRA',X'000000'                               
         DC    C'4339',C'0309',C'WKMKA',X'000000'                               
         DC    C'4340',C'0618',C'WDZQF',X'000000'                               
         DC    C'4340',C'0620',C'WDFMF',X'000000'                               
         DC    C'4340',C'0621',C'KDECA',X'000000'                               
         DC    C'4340',C'0626',C'WDOHA',X'000000'                               
         DC    C'4340',C'0627',C'WDEKF',X'000000'                               
         DC    C'4340',C'0635',C'KDLTA',X'000000'                               
         DC    C'4340',C'2635',C'KWDEA',X'000000'                               
         DC    C'4340',C'4019',C'DEMDA',X'000000'                               
         DC    C'4341',C'0355',C'KRNSA',X'000000'                               
         DC    C'4341',C'0356',C'WKYKA',X'000000'                               
         DC    C'4341',C'0361',C'KHLBA',X'000000'                               
         DC    C'4341',C'0366',C'WPRNA',X'000000'                               
         DC    C'4341',C'0367',C'KBURA',X'000000'                               
         DC    C'4341',C'0368',C'WBAGA',X'000000'                               
         DC    C'4341',C'0370',C'WBUTA',X'000000'                               
         DC    C'4342',C'1643',C'KTOBA',X'000000'                               
         DC    C'4342',C'1644',C'WJMLA',X'000000'                               
         DC    C'4342',C'1645',C'WRPTA',X'000000'                               
         DC    C'4342',C'1646',C'WPLZF',X'000000'                               
         DC    C'4342',C'1647',C'KAJKF',X'000000'                               
         DC    C'4342',C'1650',C'WHOCA',X'000000'                               
         DC    C'4342',C'3412',C'WIVQF',X'000000'                               
         DC    C'4345',C'1215',C'KGALA',X'000000'                               
         DC    C'4345',C'1216',C'WMTLA',X'000000'                               
         DC    C'4345',C'1217',C'KJAEF',X'000000'                               
         DC    C'4345',C'1225',C'WAHTA',X'000000'                               
         DC    C'4345',C'1226',C'WYNSA',X'000000'                               
         DC    C'4345',C'1229',C'WAGEA',X'000000'                               
         DC    C'4345',C'1234',C'WDGMF',X'000000'                               
         DC    C'4345',C'1244',C'KJELA',X'000000'                               
         DC    C'4345',C'1247',C'WCORA',X'000000'                               
         DC    C'4345',C'3180',C'     ',X'000000'                               
         DC    C'4346',C'1816',C'KCLUA',X'000000'                               
         DC    C'4347',C'2563',C'WTBBF',X'000000'                               
         DC    C'4347',C'2564',C'KBFIA',X'000000'                               
         DC    C'4347',C'0313',C'KFYNA',X'000000'                               
         DC    C'4347',C'0315',C'WATAA',X'000000'                               
         DC    C'4347',C'0318',C'WBNLA',X'000000'                               
         DC    C'4347',C'0319',C'WBRVA',X'000000'                               
         DC    C'4347',C'0348',C'WBIPA',X'000000'                               
         DC    C'4347',C'0349',C'WBOLA',X'000000'                               
         DC    C'4347',C'0362',C'KQTYA',X'000000'                               
         DC    C'4347',C'4030',C'     ',X'000000'                               
         DC    C'4349',C'0470',C'KDKDA',X'000000'                               
         DC    C'4349',C'0526',C'WHJTF',X'000000'                               
         DC    C'4355',C'2178',C'KGVEF',X'000000'                               
         DC    C'4355',C'3808',C'WRVIF',X'000000'                               
         DC    C'4356',C'2177',C'KVWCA',X'000000'                               
         DC    C'4356',C'2192',C'WJMMF',X'000000'                               
         DC    C'4356',C'3819',C'     ',X'000000'                               
         DC    C'4357',C'0456',C'WRNAA',X'000000'                               
         DC    C'4357',C'0473',C'KCTXA',X'000000'                               
         DC    C'4357',C'0474',C'WBEXA',X'000000'                               
         DC    C'4357',C'0475',C'KCHIA',X'000000'                               
         DC    C'4357',C'0476',C'WAYYA',X'000000'                               
         DC    C'4357',C'0478',C'WTXRF',X'000000'                               
         DC    C'4357',C'0479',C'WMBEA',X'000000'                               
         DC    C'4357',C'0485',C'     ',X'000000'                               
         DC    C'4358',C'1383',C'KLOQA',X'000000'                               
         DC    C'4358',C'1385',C'WGLCA',X'000000'                               
         DC    C'4358',C'1386',C'WMMWA',X'000000'                               
         DC    C'4358',C'1416',C'KENAA',X'000000'                               
         DC    C'4358',C'3195',C'WWIZF',X'000000'                               
         DC    C'4358',C'3203',C'KLSRA',X'000000'                               
         DC    C'4358',C'3204',C'WMEQF',X'000000'                               
         DC    C'4371',C'2124',C'WATCA',X'000000'                               
         DC    C'4371',C'2126',C'WTYNA',X'000000'                               
         DC    C'4371',C'2127',C'KCRTA',X'000000'                               
         DC    C'4371',C'2128',C'KCHSA',X'000000'                               
         DC    C'4371',C'2132',C'KXRQA',X'000000'                               
         DC    C'4371',C'2135',C'WTBFA',X'000000'                               
         DC    C'4371',C'2119',C'     ',X'000000'                               
         DC    C'4371',C'2129',C'     ',X'000000'                               
         DC    C'4371',C'2136',C'     ',X'000000'                               
         DC    C'4371',C'3601',C'     ',X'000000'                               
         DC    C'4373',C'0507',C'KCLIF',X'000000'                               
         DC    C'4373',C'0512',C'WCFAF',X'000000'                               
         DC    C'4373',C'0513',C'WPCCA',X'000000'                               
         DC    C'4373',C'0517',C'WKLKA',X'000000'                               
         DC    C'4373',C'0536',C'WDICA',X'000000'                               
         DC    C'4374',C'1009',C'KTJSA',X'000000'                               
         DC    C'4375',C'0259',C'WLSDA',X'000000'                               
         DC    C'4375',C'0260',C'KBSTA',X'000000'                               
         DC    C'4377',C'0514',C'KCLVA',X'000000'                               
         DC    C'4378',C'0977',C'KHOBA',X'000000'                               
         DC    C'4378',C'0979',C'KDJIA',X'000000'                               
         DC    C'4378',C'0980',C'WKHJA',X'000000'                               
         DC    C'4378',C'0982',C'WQDIA',X'000000'                               
         DC    C'4378',C'0983',C'KVYLA',X'000000'                               
         DC    C'4378',C'0984',C'WHTCA',X'000000'                               
         DC    C'4378',C'0988',C'KUVRA',X'000000'                               
         DC    C'4378',C'0990',C'WAENA',X'000000'                               
         DC    C'4378',C'1002',C'WCBHA',X'000000'                               
         DC    C'4378',C'1006',C'KHIPA',X'000000'                               
         DC    C'4378',C'1008',C'KHOKA',X'000000'                               
         DC    C'4378',C'1010',C'WKMOF',X'000000'                               
         DC    C'4378',C'2323',C'KGTLA',X'000000'                               
         DC    C'4378',C'2908',C'WRIXF',X'000000'                               
         DC    C'4378',C'2938',C'     ',X'000000'                               
         DC    C'4379',C'0002',C'CBSNA',X'000000'                               
         DC    C'4379',C'0388',C'WBTRF',X'000000'                               
         DC    C'4379',C'0389',C'WBHFA',X'000000'                               
         DC    C'4379',C'0391',C'KATIA',X'000000'                               
         DC    C'4379',C'0392',C'WCKLA',X'000000'                               
         DC    C'4379',C'0412',C'KLRBF',X'000000'                               
         DC    C'4379',C'0415',C'KAMQA',X'000000'                               
         DC    C'4379',C'0424',C'WKVEA',X'000000'                               
         DC    C'4379',C'0426',C'KPINA',X'000000'                               
         DC    C'4379',C'0427',C'WROYA',X'000000'                               
         DC    C'4379',C'0428',C'WAQTF',X'000000'                               
         DC    C'4379',C'0432',C'WECPA',X'000000'                               
         DC    C'4379',C'0451',C'KEEOF',X'000000'                               
         DC    C'4379',C'0453',C'KNZUF',X'000000'                               
         DC    C'4379',C'0454',C'WIKIF',X'000000'                               
         DC    C'4379',C'0457',C'KIVRA',X'000000'                               
         DC    C'4379',C'0458',C'KRGKF',X'000000'                               
         DC    C'4379',C'0459',C'KDAKA',X'000000'                               
         DC    C'4379',C'0462',C'WRKMF',X'000000'                               
         DC    C'4379',C'2620',C'KCIMA',X'000000'                               
         DC    C'4379',C'0399',C'     ',X'000000'                               
         DC    C'4379',C'2609',C'     ',X'000000'                               
         DC    C'4379',C'2613',C'     ',X'000000'                               
         DC    C'4379',C'2615',C'     ',X'000000'                               
         DC    C'4383',C'1934',C'WQBQA',X'000000'                               
         DC    C'4383',C'1944',C'KAZMA',X'000000'                               
         DC    C'4383',C'1948',C'KCBWF',X'000000'                               
         DC    C'4383',C'1969',C'KWEDA',X'000000'                               
         DC    C'4384',C'1113',C'KOKXA',X'000000'                               
         DC    C'4384',C'1118',C'KGFWA',X'000000'                               
         DC    C'4384',C'1122',C'WJZQF',X'000000'                               
         DC    C'4384',C'1124',C'WKBKA',X'000000'                               
         DC    C'4384',C'1139',C'WAWKA',X'000000'                               
         DC    C'4384',C'1142',C'KERVA',X'000000'                               
         DC    C'4384',C'1143',C'KERBA',X'000000'                               
         DC    C'4384',C'2920',C'KTMOF',X'000000'                               
         DC    C'4384',C'4024',C'FKNIA',X'000000'                               
         DC    C'4384',C'2921',C'     ',X'000000'                               
         DC    C'4384',C'2928',C'     ',X'000000'                               
         DC    C'4384',C'2935',C'     ',X'000000'                               
         DC    C'4384',C'4037',C'     ',X'000000'                               
         DC    C'4385',C'1616',C'WPLMA',X'000000'                               
         DC    C'4385',C'1617',C'WKERA',X'000000'                               
         DC    C'4385',C'1618',C'KLORF',X'000000'                               
         DC    C'4385',C'1619',C'WPNHA',X'000000'                               
         DC    C'4385',C'1622',C'WPLAA',X'000000'                               
         DC    C'4385',C'1631',C'WPOKA',X'000000'                               
         DC    C'4385',C'1638',C'WPONA',X'000000'                               
         DC    C'4385',C'1640',C'WKPGA',X'000000'                               
         DC    C'4385',C'1658',C'WZFMF',X'000000'                               
         DC    C'4385',C'1659',C'WNZEF',X'000000'                               
         DC    C'4385',C'1673',C'WEAUA',X'000000'                               
         DC    C'4385',C'1675',C'WDMVA',X'000000'                               
         DC    C'4385',C'1676',C'WPNCA',X'000000'                               
         DC    C'4385',C'1677',C'KJEZF',X'000000'                               
         DC    C'4385',C'1678',C'WDLCA',X'000000'                               
         DC    C'4385',C'1679',C'WHLSA',X'000000'                               
         DC    C'4385',C'1680',C'KISUA',X'000000'                               
         DC    C'4385',C'1682',C'KAPYA',X'000000'                               
         DC    C'4385',C'1683',C'KOTDA',X'000000'                               
         DC    C'4385',C'1684',C'KATXF',X'000000'                               
         DC    C'4385',C'1685',C'KPOCA',X'000000'                               
         DC    C'4385',C'1687',C'KENMA',X'000000'                               
         DC    C'4385',C'1688',C'WWMLA',X'000000'                               
         DC    C'4385',C'1697',C'WEEJA',X'000000'                               
         DC    C'4385',C'1698',C'KISSA',X'000000'                               
         DC    C'4385',C'1716',C'WADBF',X'000000'                               
         DC    C'4385',C'1724',C'WSELA',X'000000'                               
         DC    C'4385',C'3352',C'WOSEF',X'000000'                               
         DC    C'4385',C'3419',C'KERRA',X'000000'                               
         DC    C'4385',C'3424',C'WDDCF',X'000000'                               
         DC    C'4385',C'3434',C'KATQA',X'000000'                               
         DC    C'4385',C'1669',C'     ',X'000000'                               
         DC    C'4385',C'1686',C'     ',X'000000'                               
         DC    C'4390',C'1059',C'KTXJA',X'000000'                               
         DC    C'4390',C'1070',C'     ',X'000000'                               
         DC    C'4390',C'1076',C'WBDCF',X'000000'                               
         DC    C'4390',C'2926',C'     ',X'000000'                               
         DC    C'4391',C'1834',C'WJICA',X'000000'                               
         DC    C'4391',C'1835',C'KBZYA',X'000000'                               
         DC    C'4391',C'1836',C'WSOMA',X'000000'                               
         DC    C'4391',C'1847',C'WDERA',X'000000'                               
         DC    C'4391',C'1846',C'     ',X'000000'                               
         DC    C'4503',C'0658',C'WBJZA',X'000000'                               
         DC    C'4503',C'0669',C'WKKZF',X'000000'                               
         DC    C'4505',C'0131',C'WAAMA',X'000000'                               
         DC    C'4511',C'1233',C'WMDMF',X'000000'                               
         DC    C'4526',C'2180',C'KBENA',X'000000'                               
         DC    C'4526',C'2181',C'WBVMA',X'000000'                               
         DC    C'4526',C'2182',C'KGMJF',X'000000'                               
         DC    C'4526',C'2184',C'WSVMA',X'000000'                               
         DC    C'4526',C'0628',C'KDLKA',X'000000'                               
         DC    C'4527',C'1161',C'WASKA',X'000000'                               
         DC    C'4528',C'1135',C'KIMBA',X'000000'                               
         DC    C'4528',C'1137',C'KOCAA',X'000000'                               
         DC    C'4528',C'1138',C'WKIZA',X'000000'                               
         DC    C'4528',C'1144',C'KLFAF',X'000000'                               
         DC    C'4528',C'1147',C'WKWIF',X'000000'                               
         DC    C'4528',C'2932',C'     ',X'000000'                               
         DC    C'4549',C'2219',C'WTTNA',X'000000'                               
         DC    C'4549',C'2221',C'WATNA',X'000000'                               
         DC    C'4549',C'2222',C'WTVLA',X'000000'                               
         DC    C'4549',C'2224',C'WKRSA',X'000000'                               
         DC    C'4549',C'2225',C'KDLOF',X'000000'                               
         DC    C'4549',C'2226',C'KOMYA',X'000000'                               
         DC    C'4549',C'2268',C'WVLYA',X'000000'                               
         DC    C'4549',C'3845',C'KNEIA',X'000000'                               
         DC    C'4549',C'3846',C'WAUKA',X'000000'                               
         DC    C'4549',C'3858',C'WGFAA',X'000000'                               
         DC    C'4549',C'4020',C'     ',X'000000'                               
         DC    C'4552',C'1655',C'WRAYA',X'000000'                               
         DC    C'4552',C'1657',C'WPKYA',X'000000'                               
         DC    C'4552',C'1699',C'WDOCA',X'000000'                               
         DC    C'4552',C'1701',C'WAGMA',X'000000'                               
         DC    C'4552',C'1702',C'KFILA',X'000000'                               
         DC    C'4552',C'1704',C'WMJSF',X'000000'                               
         DC    C'4552',C'1705',C'WZOEA',X'000000'                               
         DC    C'4552',C'1706',C'WHWHA',X'000000'                               
         DC    C'4552',C'1707',C'WAEYA',X'000000'                               
         DC    C'4552',C'1708',C'KACHA',X'000000'                               
         DC    C'4552',C'1710',C'WQPMF',X'000000'                               
         DC    C'4552',C'1711',C'WARVA',X'000000'                               
         DC    C'4552',C'1728',C'KRCOA',X'000000'                               
         DC    C'4552',C'4021',C'PNF A',X'000000'                               
         DC    C'4552',C'9998',C'KHOUA',X'000000'                               
         DC    C'4553',C'1312',C'KCGSA',X'000000'                               
         DC    C'4553',C'1351',C'WDMJA',X'000000'                               
         DC    C'4561',C'2176',C'WFSHA',X'000000'                               
         DC    C'4561',C'2179',C'WAKEA',X'000000'                               
         DC    C'4561',C'2183',C'KVSHA',X'000000'                               
         DC    C'4561',C'2185',C'CJORA',X'000000'                               
         DC    C'4561',C'2189',C'KVRAA',X'000000'                               
         DC    C'4561',C'2190',C'WKRVF',X'000000'                               
         DC    C'4561',C'2191',C'WAACF',X'000000'                               
         DC    C'4561',C'2196',C'WKKSA',X'000000'                               
         DC    C'4561',C'3809',C'WIZNF',X'000000'                               
         DC    C'4561',C'3810',C'WPMBF',X'000000'                               
         DC    C'4561',C'3812',C'KAARA',X'000000'                               
         DC    C'4561',C'3813',C'KKVCF',X'000000'                               
         DC    C'4561',C'3821',C'KKBZF',X'000000'                               
         DC    C'4561',C'2193',C'     ',X'000000'                               
         DC    C'4563',C'0004',C'MUTNA',X'000000'                               
         DC    C'4563',C'1487',C'WKBZA',X'000000'                               
         DC    C'4563',C'1496',C'KBIXA',X'000000'                               
         DC    C'4565',C'0685',C'WEHHA',X'000000'                               
         DC    C'4574',C'1081',C'WCROA',X'000000'                               
         DC    C'4574',C'1082',C'WIZRA',X'000000'                               
         DC    C'4583',C'0104',C'KVLFA',X'000000'                               
         DC    C'4583',C'0105',C'WATZA',X'000000'                               
         DC    C'4583',C'0106',C'WOKZA',X'000000'                               
         DC    C'4583',C'0109',C'WFBGA',X'000000'                               
         DC    C'4596',C'2326',C'WPASA',X'000000'                               
         DC    C'4596',C'2331',C'WHIZA',X'000000'                               
         DC    C'4596',C'2332',C'WZNDF',X'000000'                               
         DC    C'4596',C'2400',C'WZBNA',X'000000'                               
         DC    C'4602',C'1585',C'WOAPA',X'000000'                               
         DC    C'4602',C'1588',C'WBKRF',X'000000'                               
         DC    C'4602',C'3360',C'KRFOA',X'000000'                               
         DC    C'4602',C'3602',C'     ',X'000000'                               
         DC    C'4604',C'1071',C'KJFFA',X'000000'                               
         DC    C'4604',C'1072',C'KARTA',X'000000'                               
         DC    C'4604',C'1073',C'WJFCA',X'000000'                               
         DC    C'4604',C'1074',C'WJJTA',X'000000'                               
         DC    C'4604',C'1075',C'KJEFA',X'000000'                               
         DC    C'4604',C'1077',C'KCKWF',X'000000'                               
         DC    C'4604',C'1078',C'WIFOF',X'000000'                               
         DC    C'4604',C'1079',C'KJDYA',X'000000'                               
         DC    C'4604',C'1083',C'WIFXA',X'000000'                               
         DC    C'4604',C'1084',C'WSQFF',X'000000'                               
         DC    C'4604',C'1088',C'     ',X'000000'                               
         DC    C'4611',C'1355',C'KGLOA',X'000000'                               
         DC    C'4611',C'1356',C'WMYNA',X'000000'                               
         DC    C'4611',C'1357',C'WMSAA',X'000000'                               
         DC    C'4611',C'1368',C'WHJCA',X'000000'                               
         DC    C'4611',C'1382',C'WLBHA',X'000000'                               
         DC    C'4611',C'1389',C'WNGOA',X'000000'                               
         DC    C'4611',C'3200',C'WFTMA',X'000000'                               
         DC    C'4611',C'1304',C'     ',X'000000'                               
         DC    C'4611',C'1309',C'     ',X'000000'                               
         DC    C'4615',C'0771',C'WBCFA',X'000000'                               
         DC    C'4615',C'2803',C'     ',X'000000'                               
         DC    C'4623',C'1610',C'KACWF',X'000000'                               
         DC    C'4623',C'1615',C'KZULA',X'000000'                               
         DC    C'4624',C'1971',C'KBCMF',X'000000'                               
         DC    C'4624',C'1981',C'KELOA',X'000000'                               
         DC    C'4626',C'2186',C'KVPIA',X'000000'                               
         DC    C'4626',C'2188',C'WTCQA',X'000000'                               
         DC    C'4626',C'2194',C'WKQVF',X'000000'                               
         DC    C'4626',C'3811',C'WAOVA',X'000000'                               
         DC    C'4626',C'3817',C'KCWMA',X'000000'                               
         DC    C'4626',C'3818',C'KCINA',X'000000'                               
         DC    C'4626',C'4032',C'     ',X'000000'                               
         DC    C'4631',C'1591',C'KBIZA',X'000000'                               
         DC    C'4632',C'1593',C'WAAWA',X'000000'                               
         DC    C'4638',C'2041',C'KFEQA',X'000000'                               
         DC    C'4640',C'0931',C'WMGZA',X'000000'                               
         DC    C'4640',C'0939',C'KAWSA',X'000000'                               
         DC    C'4640',C'0947',C'KOHUA',X'000000'                               
         DC    C'4640',C'0962',C'KGRIA',X'000000'                               
         DC    C'4640',C'0965',C'WHNCA',X'000000'                               
         DC    C'4640',C'0966',C'WHKPA',X'000000'                               
         DC    C'4640',C'0967',C'WHLIA',X'000000'                               
         DC    C'4640',C'0968',C'KBLLA',X'000000'                               
         DC    C'4640',C'0969',C'WHHMA',X'000000'                               
         DC    C'4640',C'0971',C'WHKYA',X'000000'                               
         DC    C'4640',C'0973',C'WCSRA',X'000000'                               
         DC    C'4640',C'0974',C'WMTDA',X'000000'                               
         DC    C'4640',C'0975',C'WBLUF',X'000000'                               
         DC    C'4640',C'0978',C'KHBRA',X'000000'                               
         DC    C'4640',C'0987',C'CIL F',X'000000'                               
         DC    C'4640',C'0989',C'KFFAA',X'000000'                               
         DC    C'4640',C'0992',C'WKCBA',X'000000'                               
         DC    C'4640',C'1012',C'WOHNA',X'000000'                               
         DC    C'4640',C'1019',C'WKKQA',X'000000'                               
         DC    C'4640',C'2924',C'WHHRF',X'000000'                               
         DC    C'4640',C'2937',C'KHJSA',X'000000'                               
         DC    C'4640',C'0938',C'     ',X'000000'                               
         DC    C'4640',C'0950',C'     ',X'000000'                               
         DC    C'4640',C'0970',C'     ',X'000000'                               
         DC    C'4640',C'0972',C'     ',X'000000'                               
         DC    C'4640',C'0986',C'     ',X'000000'                               
         DC    C'4640',C'2930',C'     ',X'000000'                               
         DC    C'4647',C'0896',C'WCRSA',X'000000'                               
         DC    C'4647',C'0901',C'WABGA',X'000000'                               
         DC    C'4647',C'2898',C'KKSDF',X'000000'                               
         DC    C'4647',C'2905',C'KACJA',X'000000'                               
         DC    C'4648',C'2027',C'KMGOA',X'000000'                               
         DC    C'4657',C'0023',C'KADAA',X'000000'                               
         DC    C'4657',C'0024',C'WBITA',X'000000'                               
         DC    C'4657',C'0026',C'WABJA',X'000000'                               
         DC    C'4657',C'0049',C'WQDKF',X'000000'                               
         DC    C'4657',C'0050',C'WAKNA',X'000000'                               
         DC    C'4657',C'0052',C'KEZZF',X'000000'                               
         DC    C'4673',C'0561',C'WACRA',X'000000'                               
         DC    C'4675',C'1632',C'KDLSA',X'000000'                               
         DC    C'4675',C'1639',C'WPGAA',X'000000'                               
         DC    C'4675',C'1641',C'KMGOF',X'000000'                               
         DC    C'4675',C'1642',C'WGKRA',X'000000'                               
         DC    C'4682',C'0601',C'KIIKF',X'000000'                               
         DC    C'4682',C'0610',C'WDWDA',X'000000'                               
         DC    C'4682',C'0615',C'SDIZF',X'000000'                               
         DC    C'4691',C'1021',C'SRSAF',X'000000'                               
         DC    C'4691',C'1024',C'KBRKF',X'000000'                               
         DC    C'4702',C'0676',C'WCRAA',X'000000'                               
         DC    C'4702',C'0677',C'WCBXA',X'000000'                               
         DC    C'4702',C'0678',C'KESIF',X'000000'                               
         DC    C'4702',C'0681',C'WAXXA',X'000000'                               
         DC    C'4702',C'0688',C'WBXBA',X'000000'                               
         DC    C'4702',C'0723',C'WSGCA',X'000000'                               
         DC    C'4702',C'0728',C'KULPA',X'000000'                               
         DC    C'4702',C'0735',C'KKLRA',X'000000'                               
         DC    C'4702',C'0675',C'     ',X'000000'                               
         DC    C'4705',C'1774',C'WAGNA',X'000000'                               
         DC    C'4705',C'2230',C'WXEEA',X'000000'                               
         DC    C'4705',C'2232',C'WAYZA',X'000000'                               
         DC    C'4705',C'2233',C'KFBDA',X'000000'                               
         DC    C'4705',C'2234',C'WANBA',X'000000'                               
         DC    C'4705',C'2235',C'WGCRF',X'000000'                               
         DC    C'4705',C'2236',C'WKOVA',X'000000'                               
         DC    C'4705',C'2237',C'WLKSA',X'000000'                               
         DC    C'4705',C'2239',C'KGOEA',X'000000'                               
         DC    C'4705',C'2240',C'WDEWA',X'000000'                               
         DC    C'4705',C'2241',C'WWRXF',X'000000'                               
         DC    C'4705',C'2242',C'WKSKA',X'000000'                               
         DC    C'4705',C'2243',C'WFRXA',X'000000'                               
         DC    C'4705',C'2244',C'WTTRA',X'000000'                               
         DC    C'4705',C'2252',C'KPQ A',X'000000'                               
         DC    C'4705',C'2253',C'KWEIA',X'000000'                               
         DC    C'4705',C'2257',C'WCHEA',X'000000'                               
         DC    C'4705',C'2263',C'KZEEA',X'000000'                               
         DC    C'4705',C'2271',C'WABOA',X'000000'                               
         DC    C'4705',C'2329',C'KLSCA',X'000000'                               
         DC    C'4705',C'3827',C'WHCCA',X'000000'                               
         DC    C'4705',C'3843',C'WACLA',X'000000'                               
         DC    C'4705',C'3847',C'WAANA',X'000000'                               
         DC    C'4705',C'3851',C'WBKVA',X'000000'                               
         DC    C'4705',C'3853',C'KQWCA',X'000000'                               
         DC    C'4705',C'3857',C'KTCHA',X'000000'                               
         DC    C'4705',C'3861',C'WBMBA',X'000000'                               
         DC    C'4705',C'2238',C'     ',X'000000'                               
         DC    C'4705',C'2254',C'     ',X'000000'                               
         DC    C'4705',C'3852',C'     ',X'000000'                               
         DC    C'4705',C'3860',C'     ',X'000000'                               
         DC    C'4705',C'3864',C'     ',X'000000'                               
         DC    C'4705',C'3866',C'     ',X'000000'                               
         DC    C'4711',C'1391',C'RAG A',X'000000'                               
         DC    C'4711',C'1392',C'WMOKA',X'000000'                               
         DC    C'4711',C'1393',C'WHCGF',X'000000'                               
         DC    C'4711',C'1395',C'KIKOA',X'000000'                               
         DC    C'4711',C'1425',C'KBGGA',X'000000'                               
         DC    C'4711',C'1428',C'WJMTA',X'000000'                               
         DC    C'4711',C'3201',C'KWWRF',X'000000'                               
         DC    C'4711',C'3223',C'KYCXF',X'000000'                               
         DC    C'4717',C'1720',C'WCNHA',X'000000'                               
         DC    C'4717',C'1721',C'KIMIF',X'000000'                               
         DC    C'4717',C'1722',C'WJDAA',X'000000'                               
         DC    C'4717',C'1725',C'WFNYF',X'000000'                               
         DC    C'4717',C'1726',C'WRADA',X'000000'                               
         DC    C'4717',C'1727',C'WBFNA',X'000000'                               
         DC    C'4717',C'1729',C'WRRLA',X'000000'                               
         DC    C'4717',C'1730',C'     ',X'000000'                               
         DC    C'4717',C'3398',C'     ',X'000000'                               
         DC    C'4734',C'1090',C'KBTMA',X'000000'                               
         DC    C'4734',C'1091',C'     ',X'000000'                               
         DC    C'4736',C'0287',C'WFALA',X'000000'                               
         DC    C'4736',C'0320',C'WBGNA',X'000000'                               
         DC    C'4736',C'0323',C'WKAOA',X'000000'                               
         DC    C'4736',C'2570',C'KPCRA',X'000000'                               
         DC    C'4737',C'1307',C'KMAQA',X'000000'                               
         DC    C'4737',C'1310',C'KQKKF',X'000000'                               
         DC    C'4737',C'1330',C'WMEVA',X'000000'                               
         DC    C'4737',C'1338',C'WQMAA',X'000000'                               
         DC    C'4737',C'1339',C'KCRIA',X'000000'                               
         DC    C'4737',C'1340',C'WJAQF',X'000000'                               
         DC    C'4737',C'1341',C'KDOGF',X'000000'                               
         DC    C'4737',C'1342',C'WYMBA',X'000000'                               
         DC    C'4737',C'1343',C'WCLWA',X'000000'                               
         DC    C'4737',C'1344',C'WMUMA',X'000000'                               
         DC    C'4737',C'1345',C'KAPBA',X'000000'                               
         DC    C'4737',C'1348',C'WBRMA',X'000000'                               
         DC    C'4737',C'1349',C'WEYQF',X'000000'                               
         DC    C'4737',C'1350',C'WATPA',X'000000'                               
         DC    C'4737',C'1366',C'WJAMA',X'000000'                               
         DC    C'4737',C'1369',C'WDIFF',X'000000'                               
         DC    C'4737',C'1376',C'WBATA',X'000000'                               
         DC    C'4737',C'1388',C'WMJLA',X'000000'                               
         DC    C'4737',C'1398',C'KPCAA',X'000000'                               
         DC    C'4737',C'1423',C'KDXIA',X'000000'                               
         DC    C'4737',C'3175',C'WCJLA',X'000000'                               
         DC    C'4737',C'3207',C'WDDDF',X'000000'                               
         DC    C'4737',C'1347',C'     ',X'000000'                               
         DC    C'4740',C'1538',C'WDJFF',X'000000'                               
         DC    C'4740',C'1540',C'KNBIA',X'000000'                               
         DC    C'4740',C'1542',C'KAHLA',X'000000'                               
         DC    C'4740',C'1543',C'WKBCA',X'000000'                               
         DC    C'4740',C'1547',C'WCTYA',X'000000'                               
         DC    C'4740',C'1548',C'WCHNA',X'000000'                               
         DC    C'4740',C'1549',C'WLKRA',X'000000'                               
         DC    C'4740',C'1550',C'WATOA',X'000000'                               
         DC    C'4740',C'1551',C'WETTA',X'000000'                               
         DC    C'4740',C'1552',C'WFUZF',X'000000'                               
         DC    C'4740',C'1553',C'WOSMF',X'000000'                               
         DC    C'4740',C'1554',C'WIBGA',X'000000'                               
         DC    C'4740',C'1560',C'WOBLA',X'000000'                               
         DC    C'4740',C'3310',C'KJNPA',X'000000'                               
         DC    C'4740',C'3334',C'WNVAA',X'000000'                               
         DC    C'4740',C'3336',C'WOCHA',X'000000'                               
         DC    C'4740',C'3355',C'KJFMF',X'000000'                               
         DC    C'4740',C'3357',C'KREHA',X'000000'                               
         DC    C'4740',C'3358',C'KBRXA',X'000000'                               
         DC    C'4740',C'3361',C'KWCLA',X'000000'                               
         DC    C'4740',C'3371',C'WOCOA',X'000000'                               
         DC    C'4751',C'1999',C'WJVMA',X'000000'                               
         DC    C'4751',C'2033',C'WIDGA',X'000000'                               
         DC    C'4751',C'2039',C'WSPTA',X'000000'                               
         DC    C'4751',C'2044',C'WRKYF',X'000000'                               
         DC    C'4751',C'2045',C'WQIZA',X'000000'                               
         DC    C'4751',C'2047',C'KDXUA',X'000000'                               
         DC    C'4751',C'2060',C'KGEKA',X'000000'                               
         DC    C'4751',C'3402',C'     ',X'000000'                               
         DC    C'4754',C'0371',C'KBOWA',X'000000'                               
         DC    C'4760',C'2161',C'KEEPA',X'000000'                               
         DC    C'4760',C'2162',C'WTYLA',X'000000'                               
         DC    C'4761',C'1806',C'KARVA',X'000000'                               
         DC    C'4761',C'1807',C'WAKQF',X'000000'                               
         DC    C'4761',C'1808',C'WRCRF',X'000000'                               
         DC    C'4761',C'1820',C'KTLUA',X'000000'                               
         DC    C'4761',C'1821',C'KBCQA',X'000000'                               
         DC    C'4761',C'1822',C'WKRXF',X'000000'                               
         DC    C'4761',C'1823',C'KAYTA',X'000000'                               
         DC    C'4761',C'1824',C'KRRRA',X'000000'                               
         DC    C'4761',C'1825',C'WRUMA',X'000000'                               
         DC    C'4761',C'1829',C'KRSLA',X'000000'                               
         DC    C'4761',C'1830',C'WKAXA',X'000000'                               
         DC    C'4762',C'1431',C'KBMGF',X'000000'                               
         DC    C'4762',C'3218',C'     ',X'000000'                               
         DC    C'4771',C'0690',C'KAMPA',X'000000'                               
         DC    C'4771',C'2741',C'KLDNA',X'000000'                               
         DC    C'4790',C'0823',C'KGBCA',X'000000'                               
         DC    C'4790',C'0837',C'KGAKA',X'000000'                               
         DC    C'4798',C'0839',C'KDZNF',X'000000'                               
         DC    C'4798',C'0841',C'WBZAA',X'000000'                               
         DC    C'4798',C'0853',C'WKIGA',X'000000'                               
         DC    C'4802',C'0731',C'KATAA',X'000000'                               
         DC    C'4802',C'0732',C'WLCOA',X'000000'                               
         DC    C'4802',C'2746',C'KEVAA',X'000000'                               
         DC    C'4802',C'2748',C'     ',X'000000'                               
         DC    C'4819',C'0014',C'KAYOA',X'000000'                               
         DC    C'4821',C'0194',C'WISSA',X'000000'                               
         DC    C'4821',C'0225',C'KBNDA',X'000000'                               
         DC    C'4821',C'0235',C'WPYBA',X'000000'                               
         DC    C'4821',C'0238',C'WHFBF',X'000000'                               
         DC    C'4821',C'0242',C'WCSTA',X'000000'                               
         DC    C'4821',C'0243',C'WBRXA',X'000000'                               
         DC    C'4821',C'0244',C'WBRLA',X'000000'                               
         DC    C'4821',C'0245',C'WMLOA',X'000000'                               
         DC    C'4821',C'0246',C'WWTRF',X'000000'                               
         DC    C'4821',C'0247',C'WGMSA',X'000000'                               
         DC    C'4821',C'0248',C'WBSCA',X'000000'                               
         DC    C'4821',C'0249',C'WETTF',X'000000'                               
         DC    C'4821',C'0250',C'WIDEA',X'000000'                               
         DC    C'4821',C'0254',C'WJRHF',X'000000'                               
         DC    C'4821',C'0256',C'KBBVA',X'000000'                               
         DC    C'4821',C'0257',C'WAAQF',X'000000'                               
         DC    C'4821',C'0258',C'WCBLA',X'000000'                               
         DC    C'4821',C'0262',C'WWOOF',X'000000'                               
         DC    C'4821',C'0265',C'KHOLA',X'000000'                               
         DC    C'4821',C'0268',C'KAVVF',X'000000'                               
         DC    C'4821',C'0305',C'WBTNA',X'000000'                               
         DC    C'4821',C'2560',C'WBINA',X'000000'                               
         DC    C'4821',C'0252',C'     ',X'000000'                               
         DC    C'4821',C'2512',C'     ',X'000000'                               
         DC    C'4855',C'1917',C'KSBQA',X'000000'                               
         DC    C'4855',C'1918',C'XEXXA',X'000000'                               
         DC    C'4855',C'1921',C'KPLSA',X'000000'                               
         DC    C'4855',C'1922',C'WNBZA',X'000000'                               
         DC    C'4855',C'1923',C'SQXMF',X'000000'                               
         DC    C'4855',C'1925',C'WKAJA',X'000000'                               
         DC    C'4855',C'1929',C'WLXXA',X'000000'                               
         DC    C'4855',C'1926',C'     ',X'000000'                               
         DC    C'4881',C'1485',C'KBSNA',X'000000'                               
         DC    C'4881',C'1486',C'WMGAA',X'000000'                               
         DC    C'4881',C'3221',C'KLRSA',X'000000'                               
         DC    C'4884',C'0188',C'KBLTF',X'000000'                               
         DC    C'4884',C'0197',C'WUFEA',X'000000'                               
         DC    C'4884',C'0200',C'KIOXA',X'000000'                               
         DC    C'4884',C'0213',C'WBMIF',X'000000'                               
         DC    C'4884',C'0215',C'WBCKA',X'000000'                               
         DC    C'4884',C'0216',C'WPUPA',X'000000'                               
         DC    C'4884',C'0217',C'KBUKA',X'000000'                               
         DC    C'4884',C'0219',C'WBMAA',X'000000'                               
         DC    C'4884',C'0220',C'WBEUA',X'000000'                               
         DC    C'4884',C'0263',C'WRMSF',X'000000'                               
         DC    C'4884',C'0232',C'     ',X'000000'                               
         DC    C'4884',C'3515',C'     ',X'000000'                               
         DC    C'4885',C'0407',C'WCCRA',X'000000'                               
         DC    C'4885',C'0408',C'WCHLA',X'000000'                               
         DC    C'4885',C'0410',C'WBKCA',X'000000'                               
         DC    C'4885',C'0419',C'KKOYA',X'000000'                               
         DC    C'4885',C'0420',C'WESAA',X'000000'                               
         DC    C'4886',C'1116',C'KALSF',X'000000'                               
         DC    C'4886',C'1119',C'WGTLA',X'000000'                               
         DC    C'4886',C'1120',C'WKZAA',X'000000'                               
         DC    C'4886',C'2933',C'WKANA',X'000000'                               
         DC    C'4886',C'1108',C'     ',X'000000'                               
         DC    C'4888',C'1435',C'KVSIA',X'000000'                               
         DC    C'4888',C'1436',C'KMRCA',X'000000'                               
         DC    C'4888',C'1441',C'WSSAA',X'000000'                               
         DC    C'4888',C'1442',C'KRPLA',X'000000'                               
         DC    C'4888',C'1443',C'KMRSA',X'000000'                               
         DC    C'4888',C'1444',C'WHDQF',X'000000'                               
         DC    C'4888',C'1448',C'KVOMA',X'000000'                               
         DC    C'4888',C'1450',C'WLBQA',X'000000'                               
         DC    C'4888',C'1452',C'WAZIF',X'000000'                               
         DC    C'4888',C'1456',C'KIDAF',X'000000'                               
         DC    C'4888',C'1463',C'KHBMA',X'000000'                               
         DC    C'4888',C'1469',C'WLZRF',X'000000'                               
         DC    C'4888',C'1470',C'KKXKF',X'000000'                               
         DC    C'4888',C'1472',C'WTBJA',X'000000'                               
         DC    C'4888',C'1473',C'CFCFA',X'000000'                               
         DC    C'4888',C'1474',C'WHIPA',X'000000'                               
         DC    C'4888',C'1475',C'WAJRA',X'000000'                               
         DC    C'4888',C'1476',C'WMTRA',X'000000'                               
         DC    C'4888',C'1477',C'WMNCA',X'000000'                               
         DC    C'4888',C'1478',C'WMBLA',X'000000'                               
         DC    C'4888',C'1493',C'WMSKA',X'000000'                               
         DC    C'4888',C'3199',C'WSULF',X'000000'                               
         DC    C'4888',C'3222',C'WMORF',X'000000'                               
         DC    C'4888',C'3210',C'     ',X'000000'                               
         DC    C'4888',C'3212',C'     ',X'000000'                               
         DC    C'4888',C'4303',C'     ',X'000000'                               
         DC    C'4889',C'0374',C'WCLBA',X'000000'                               
         DC    C'4889',C'0377',C'KRLMA',X'000000'                               
         DC    C'4889',C'0378',C'KMRNA',X'000000'                               
         DC    C'4889',C'0380',C'WACAA',X'000000'                               
         DC    C'4889',C'0383',C'WSSJA',X'000000'                               
         DC    C'4889',C'0385',C'WBYSA',X'000000'                               
         DC    C'4889',C'0390',C'WPTLA',X'000000'                               
         DC    C'4889',C'0395',C'WCHKA',X'000000'                               
         DC    C'4889',C'0398',C'KAMDA',X'000000'                               
         DC    C'4889',C'0403',C'WCKQA',X'000000'                               
         DC    C'4889',C'0416',C'KMILA',X'000000'                               
         DC    C'4889',C'0418',C'WFWLA',X'000000'                               
         DC    C'4889',C'0433',C'WMGOA',X'000000'                               
         DC    C'4889',C'0434',C'WAROA',X'000000'                               
         DC    C'4889',C'0452',C'KQCAF',X'000000'                               
         DC    C'4890',C'0683',C'WJDMA',X'000000'                               
         DC    C'4890',C'0684',C'WDNEA',X'000000'                               
         DC    C'4890',C'0687',C'WBLAA',X'000000'                               
         DC    C'4890',C'0689',C'WCNCA',X'000000'                               
         DC    C'4890',C'0698',C'WBEJA',X'000000'                               
         DC    C'4890',C'0700',C'KAYZF',X'000000'                               
         DC    C'4890',C'0702',C'WBPAA',X'000000'                               
         DC    C'4890',C'0703',C'WIELA',X'000000'                               
         DC    C'4890',C'0725',C'WIFMA',X'000000'                               
         DC    C'4890',C'0727',C'KADSA',X'000000'                               
         DC    C'4890',C'0729',C'KESMA',X'000000'                               
         DC    C'4890',C'0739',C'KADRA',X'000000'                               
         DC    C'4891',C'1595',C'WPVLA',X'000000'                               
         DC    C'4891',C'1596',C'KPGEA',X'000000'                               
         DC    C'4891',C'1597',C'WCPLF',X'000000'                               
         DC    C'4891',C'1598',C'KLISF',X'000000'                               
         DC    C'4891',C'1599',C'KPAGA',X'000000'                               
         DC    C'4891',C'1602',C'WSIPA',X'000000'                               
         DC    C'4891',C'1614',C'KGUYA',X'000000'                               
         DC    C'4891',C'3416',C'WIYDA',X'000000'                               
         DC    C'4891',C'4043',C'WSBGF',X'000000'                               
         DC    C'4893',C'2097',C'KIIZA',X'000000'                               
         DC    C'4894',C'1838',C'KFRMA',X'000000'                               
         DC    C'4894',C'1844',C'WNRSA',X'000000'                               
         DC    C'4894',C'3499',C'KAZZF',X'000000'                               
         DC    C'4896',C'0826',C'KBUFA',X'000000'                               
         DC    C'4896',C'0833',C'WGMBF',X'000000'                               
         DC    C'4896',C'0834',C'WJWLA',X'000000'                               
         DC    C'4896',C'0835',C'WGASA',X'000000'                               
         DC    C'4896',C'0836',C'WGETA',X'000000'                               
         DC    C'4896',C'0848',C'WLIRF',X'000000'                               
         DC    C'4896',C'0857',C'WGAWA',X'000000'                               
         DC    C'4896',C'0858',C'KFATF',X'000000'                               
         DC    C'4896',C'0867',C'WGATA',X'000000'                               
         DC    C'4896',C'0868',C'WCDSA',X'000000'                               
         DC    C'4896',C'0869',C'WABKA',X'000000'                               
         DC    C'4896',C'0873',C'WWRMF',X'000000'                               
         DC    C'4896',C'0874',C'WGEAA',X'000000'                               
         DC    C'4896',C'0878',C'WLTHA',X'000000'                               
         DC    C'4896',C'0888',C'KGTNA',X'000000'                               
         DC    C'4896',C'2888',C'KGWYF',X'000000'                               
         DC    C'4896',C'2889',C'WGMMF',X'000000'                               
         DC    C'4896',C'2890',C'WURDF',X'000000'                               
         DC    C'4896',C'2899',C'WECQF',X'000000'                               
         DC    C'4896',C'2900',C'KHYMA',X'000000'                               
         DC    C'4896',C'2909',C'WAXUF',X'000000'                               
         DC    C'4896',C'2910',C'WCKWF',X'000000'                               
         DC    C'4896',C'3889',C'WGENA',X'000000'                               
         DC    C'4896',C'0872',C'     ',X'000000'                               
         DC    C'4896',C'2891',C'     ',X'000000'                               
         DC    C'4897',C'0647',C'KDFNA',X'000000'                               
         DC    C'4897',C'0655',C'KDCKF',X'000000'                               
         DC    C'4897',C'0660',C'WSEMA',X'000000'                               
         DC    C'4897',C'2681',C'WDMPA',X'000000'                               
         DC    C'4897',C'0025',C'     ',X'000000'                               
         DC    C'4898',C'1125',C'WBAZA',X'000000'                               
         DC    C'4898',C'1126',C'WFSPA',X'000000'                               
         DC    C'4898',C'1127',C'WDKDA',X'000000'                               
         DC    C'4898',C'1128',C'WGOCA',X'000000'                               
         DC    C'4898',C'1129',C'WKMTA',X'000000'                               
         DC    C'4898',C'1130',C'WACYA',X'000000'                               
         DC    C'4898',C'1131',C'KAGMF',X'000000'                               
         DC    C'4898',C'1132',C'WGHBA',X'000000'                               
         DC    C'4898',C'1134',C'KAAAA',X'000000'                               
         DC    C'4898',C'1149',C'WACBA',X'000000'                               
         DC    C'4898',C'1733',C'KBMHA',X'000000'                               
         DC    C'4899',C'1202',C'KSCBA',X'000000'                               
         DC    C'4899',C'1235',C'WVOSA',X'000000'                               
         DC    C'4899',C'1241',C'WCITA',X'000000'                               
         DC    C'4901',C'0053',C'KALQF',X'000000'                               
         DC    C'4903',C'1570',C'KSRVA',X'000000'                               
         DC    C'4903',C'3359',C'KMTFF',X'000000'                               
         DC    C'4903',C'3366',C'WZOZF',X'000000'                               
         DC    C'4904',C'1672',C'WBECA',X'000000'                               
         DC    C'4904',C'1674',C'WERAA',X'000000'                               
         DC    C'4904',C'1732',C'KDBQF',X'000000'                               
         DC    C'4904',C'3392',C'KHTNF',X'000000'                               
         DC    C'4904',C'4045',C'WQKXF',X'000000'                               
         DC    C'4908',C'0330',C'WTRIA',X'000000'                               
         DC    C'4908',C'0331',C'WKXAA',X'000000'                               
         DC    C'4908',C'0333',C'WBGAA',X'000000'                               
         DC    C'4908',C'0443',C'WBNOA',X'000000'                               
         DC    C'4908',C'2566',C'KBWDA',X'000000'                               
         DC    C'4908',C'2569',C'KCMPA',X'000000'                               
         DC    C'4914',C'0055',C'KALGA',X'000000'                               
         DC    C'4915',C'1023',C'KHCCF',X'000000'                               
         DC    C'4915',C'1025',C'WHPNA',X'000000'                               
         DC    C'4915',C'1026',C'KDUZA',X'000000'                               
         DC    C'4915',C'1027',C'WCODF',X'000000'                               
         DC    C'4916',C'2098',C'KACIA',X'000000'                               
         DC    C'4916',C'2099',C'KRTRA',X'000000'                               
         DC    C'4917',C'1318',C'KMMTF',X'000000'                               
         DC    C'4917',C'1325',C'WEZRF',X'000000'                               
         DC    C'4917',C'1329',C'WMSRA',X'000000'                               
         DC    C'4917',C'1331',C'WFEAA',X'000000'                               
         DC    C'4917',C'1332',C'WINFA',X'000000'                               
         DC    C'4917',C'1333',C'WWXLA',X'000000'                               
         DC    C'4917',C'1334',C'WFDRA',X'000000'                               
         DC    C'4917',C'1335',C'WTIQA',X'000000'                               
         DC    C'4917',C'1336',C'WMTEA',X'000000'                               
         DC    C'4917',C'1337',C'WCUBA',X'000000'                               
         DC    C'4917',C'3194',C'WEQXF',X'000000'                               
         DC    C'4917',C'3197',C'KMANA',X'000000'                               
         DC    C'4919',C'1850',C'KBALA',X'000000'                               
         DC    C'4919',C'1905',C'KATYA',X'000000'                               
         DC    C'4919',C'1910',C'KCLTA',X'000000'                               
         DC    C'4919',C'1913',C'KNTAA',X'000000'                               
         DC    C'4923',C'1000',C'KHOMF',X'000000'                               
         DC    C'4923',C'1003',C'WCPCA',X'000000'                               
         DC    C'4923',C'1004',C'KBTCA',X'000000'                               
         DC    C'4923',C'1005',C'WHOUA',X'000000'                               
         DC    C'4923',C'1007',C'WHGRA',X'000000'                               
         DC    C'4926',C'3405',C'WHFBA',X'000000'                               
         DC    C'4927',C'0777',C'KFTWA',X'000000'                               
         DC    C'4927',C'0783',C'KNAFA',X'000000'                               
         DC    C'4927',C'0802',C'WFMDA',X'000000'                               
         DC    C'4927',C'0805',C'FLS A',X'000000'                               
         DC    C'4927',C'0806',C'WFROA',X'000000'                               
         DC    C'4927',C'0812',C'WGBBA',X'000000'                               
         DC    C'4927',C'0813',C'KHUBA',X'000000'                               
         DC    C'4927',C'2809',C'KBRZA',X'000000'                               
         DC    C'4927',C'2814',C'WACIF',X'000000'                               
         DC    C'4928',C'1952',C'WSHPA',X'000000'                               
         DC    C'4928',C'1955',C'KVSLA',X'000000'                               
         DC    C'4928',C'1960',C'KALKF',X'000000'                               
         DC    C'4928',C'1978',C'WJRZF',X'000000'                               
         DC    C'4928',C'4015',C'WPDCA',X'000000'                               
         DC    C'4929',C'0877',C'KSWAA',X'000000'                               
         DC    C'4929',C'2820',C'KNCWA',X'000000'                               
         DC    C'4930',C'2110',C'WLETA',X'000000'                               
         DC    C'4931',C'1267',C'KBAMA',X'000000'                               
         DC    C'4934',C'1305',C'KJCYA',X'000000'                               
         DC    C'4934',C'1432',C'WERKA',X'000000'                               
         DC    C'4934',C'1433',C'KILJF',X'000000'                               
         DC    C'4934',C'1434',C'WPAQA',X'000000'                               
         DC    C'4934',C'1437',C'WWDRA',X'000000'                               
         DC    C'4934',C'1438',C'WDJSA',X'000000'                               
         DC    C'4934',C'1445',C'WSHKF',X'000000'                               
         DC    C'4934',C'1446',C'WVMCA',X'000000'                               
         DC    C'4934',C'1447',C'WPCOA',X'000000'                               
         DC    C'4934',C'1449',C'WLOCA',X'000000'                               
         DC    C'4934',C'1454',C'KIMPA',X'000000'                               
         DC    C'4934',C'1466',C'KKTZF',X'000000'                               
         DC    C'4934',C'1467',C'WMVOA',X'000000'                               
         DC    C'4934',C'1468',C'WMSTA',X'000000'                               
         DC    C'4934',C'1479',C'WCENA',X'000000'                               
         DC    C'4934',C'1480',C'WMIMA',X'000000'                               
         DC    C'4934',C'1481',C'KAPSA',X'000000'                               
         DC    C'4934',C'1482',C'WVIPA',X'000000'                               
         DC    C'4934',C'1483',C'WSIGA',X'000000'                               
         DC    C'4934',C'1490',C'WCIGA',X'000000'                               
         DC    C'4934',C'1491',C'WBCGF',X'000000'                               
         DC    C'4934',C'1492',C'WCUPA',X'000000'                               
         DC    C'4934',C'1494',C'WMIXA',X'000000'                               
         DC    C'4934',C'1495',C'WINIA',X'000000'                               
         DC    C'4934',C'3206',C'WQXOA',X'000000'                               
         DC    C'4934',C'3208',C'WBLNF',X'000000'                               
         DC    C'4934',C'3211',C'KWSDF',X'000000'                               
         DC    C'4934',C'3213',C'KFMHF',X'000000'                               
         DC    C'4934',C'3214',C'WHOMF',X'000000'                               
         DC    C'4934',C'1362',C'     ',X'000000'                               
         DC    C'4937',C'0525',C'WCLDA',X'000000'                               
         DC    C'4937',C'2618',C'WCLDF',X'000000'                               
         DC    C'4940',C'2273',C'WPWCA',X'000000'                               
         DC    C'4940',C'2290',C'WPCVF',X'000000'                               
         DC    C'4940',C'2293',C'KINOA',X'000000'                               
         DC    C'4940',C'2300',C'WASRA',X'000000'                               
         DC    C'4940',C'2317',C'WNNOA',X'000000'                               
         DC    C'4940',C'3875',C'WFHRA',X'000000'                               
         DC    C'4940',C'3886',C'KVLLA',X'000000'                               
         DC    C'4940',C'4011',C'FBN A',X'000000'                               
         DC    C'4940',C'2278',C'     ',X'000000'                               
         DC    C'4940',C'2303',C'     ',X'000000'                               
         DC    C'4940',C'3881',C'     ',X'000000'                               
         DC    C'4941',C'0519',C'WFICA',X'000000'                               
         DC    C'4941',C'0522',C'KCLXA',X'000000'                               
         DC    C'4941',C'0524',C'WMUCA',X'000000'                               
         DC    C'4942',C'1170',C'KMUZF',X'000000'                               
         DC    C'4942',C'1172',C'WLAGA',X'000000'                               
         DC    C'4942',C'1174',C'KCMBF',X'000000'                               
         DC    C'4942',C'1175',C'KBLJF',X'000000'                               
         DC    C'4943',C'1633',C'KSXMF',X'000000'                               
         DC    C'4943',C'1636',C'WSWVA',X'000000'                               
         DC    C'4943',C'3306',C'AGPAA',X'000000'                               
         DC    C'4951',C'0477',C'KZEVF',X'000000'                               
         DC    C'4951',C'0496',C'KLYRA',X'000000'                               
         DC    C'4951',C'0497',C'WDXNA',X'000000'                               
         DC    C'4951',C'0498',C'WBADF',X'000000'                               
         DC    C'4951',C'0499',C'KCARA',X'000000'                               
         DC    C'4951',C'0502',C'KCLKA',X'000000'                               
         DC    C'4951',C'0503',C'WCLAA',X'000000'                               
         DC    C'4951',C'0505',C'WCPAA',X'000000'                               
         DC    C'4951',C'0506',C'KCLEA',X'000000'                               
         DC    C'4951',C'0510',C'WCCPA',X'000000'                               
         DC    C'4951',C'0511',C'WABQA',X'000000'                               
         DC    C'4951',C'0532',C'WGHCA',X'000000'                               
         DC    C'4952',C'0779',C'KBFCF',X'000000'                               
         DC    C'4952',C'0782',C'KMDOA',X'000000'                               
         DC    C'4952',C'0786',C'WSACA',X'000000'                               
         DC    C'4952',C'0787',C'WFNEF',X'000000'                               
         DC    C'4952',C'0789',C'WFPAA',X'000000'                               
         DC    C'4952',C'2801',C'WSJYF',X'000000'                               
         DC    C'4952',C'2806',C'KDACA',X'000000'                               
         DC    C'4952',C'2817',C'KBKBA',X'000000'                               
         DC    C'4952',C'2819',C'KIKCA',X'000000'                               
         DC    C'4953',C'1589',C'WAYDA',X'000000'                               
         DC    C'4953',C'1590',C'WCBQA',X'000000'                               
         DC    C'4953',C'1592',C'KAAPA',X'000000'                               
         DC    C'4953',C'1607',C'WOORF',X'000000'                               
         DC    C'4953',C'3396',C'KZRKA',X'000000'                               
         DC    C'4953',C'8887',C'     ',X'000000'                               
         DC    C'4954',C'1509',C'WKPAA',X'000000'                               
         DC    C'4954',C'1518',C'KANEA',X'000000'                               
         DC    C'4954',C'3316',C'WJTPA',X'000000'                               
         DC    C'4955',C'2104',C'KCILF',X'000000'                               
         DC    C'4955',C'2108',C'WLORA',X'000000'                               
         DC    C'4955',C'2113',C'WSFTA',X'000000'                               
         DC    C'4955',C'2118',C'KSNRF',X'000000'                               
         DC    C'4956',C'0147',C'ACRNF',X'000000'                               
         DC    C'4956',C'0148',C'WJSQA',X'000000'                               
         DC    C'4956',C'0150',C'WAGOF',X'000000'                               
         DC    C'4956',C'0176',C'KBUDA',X'000000'                               
         DC    C'4956',C'4956',C'     ',X'000000'                               
         DC    C'4957',C'0613',C'WRDNF',X'000000'                               
         DC    C'4957',C'0638',C'WFLRA',X'000000'                               
         DC    C'4957',C'0657',C'KRHDA',X'000000'                               
         DC    C'4957',C'0672',C'WCKBA',X'000000'                               
         DC    C'4957',C'0637',C'     ',X'000000'                               
MTABLEN  EQU   (*-MTABLE)/L'MTABENT                                             
         SPACE 2                                                                
MISMKTAB DC    400F'0'                                                          
         SPACE 2                                                                
WORKD    DSECT                                                                  
DUB      DS    D                                                                
DMCB     DS    6F                                                               
APARM    DS    A                                                                
PLIST    DS    0CL24                                                            
AREC     DS    A                                                                
VFILEOUT DS    A                                                                
APARAMC  DS    A                                                                
VLDDEFN  DS    A                                                                
VPRINTER DS    A                                                                
VCPRINT  DS    A                                                                
*                                                                               
MTABLED  DSECT                                                                  
MTABENT  DS   0XL16                                                             
MOLDMKT  DS    CL4                                                              
MNEWMKT  DS    CL4                                                              
MSTA     DS    CL5                                                              
MMKTCHG  DS    CL1                                                              
MSTACHG  DS    CL1                                                              
         DS    XL1                                                              
MTABNXT  EQU   *                                                                
         EJECT                                                                  
*DMLDDEFN                                                                       
       ++INCLUDE DMLDDEFN                                                       
         EJECT                                                                  
*DDDPRINT                                                                       
       ++INCLUDE DDDPRINT                                                       
         SPACE 2                                                                
STARECD   DSECT                                                                 
       ++INCLUDE SPGENSTA                                                       
MKTRECD   DSECT                                                                 
       ++INCLUDE SPGENMKT                                                       
**PAN#1  CSECT                                                                  
**PAN#1  DC    CL21'005STEXTCCA  08/10/93'                                      
         END                                                                    
