*          DATA SET TAGEN6B    AT LEVEL 083 AS OF 05/16/11                      
*PHASE T7026BB,*                                                                
         TITLE 'T7026B - TABLES FOR SOAP RESIDUALS'                             
T7026B   CSECT                                                                  
         DC    AL4(USETBLS-T7026B)                                              
         DC    AL4(USELUT-T7026B)                                               
         DC    AL4(AIRDLUT-T7026B)                                              
         DC    AL4(DAIRDLUT-T7026B)                                             
         DC    AL4(WAIRDLUT-T7026B)                                             
         DC    AL4(CATCOLS-T7026B)                                              
         DC    AL4(PNHTAB-T7026B)                                               
         DC    AL4(DPNHTAB-T7026B)                                              
         DC    AL4(WPNHTAB-T7026B)                                              
         EJECT                                                                  
*              USE TYPE RATE TABLES                                             
         SPACE 3                                                                
USETBLS  DS    0F                                                               
*                                                                               
*                                  SOAP RESIDUALS AREA 1                        
*                                                                               
SORA1TBL DS    0H                  SOR AREA 1:                                  
         DC    AL2(0,24,0,0,0,0)   11/16/82-11/15/83                            
         DC    F'11175'            FULL PART                                    
         DC    F'4900'             UNDER 5                                      
         DC    F'4440'             ANNOUNCER                                    
         SPACE 1                                                                
         DC    AL2(1,24,0,0,0,0)   11/16/83-11/15/86                            
         DC    F'11900'                                                         
         DC    F'5200'                                                          
         DC    F'4725'                                                          
         SPACE 1                                                                
         DC    AL2(2,24,0,0,0,0)   11/16/86-11/15/87                            
         DC    F'12250'                                                         
         DC    F'5350'                                                          
         DC    F'4725'                                                          
         SPACE 1                                                                
         DC    AL2(3,24,0,0,0,0)   11/16/87-11/15/89                            
         DC    F'12625'                                                         
         DC    F'5500'                                                          
         DC    F'4725'                                                          
         SPACE 1                                                                
         DC    AL2(4,24,0,0,0,0)   11/16/89-11/15/90                            
         DC    F'13000'                                                         
         DC    F'5675'                                                          
         DC    F'4860'                                                          
         SPACE 1                                                                
         DC    AL2(5,24,0,0,0,0)   11/16/90-12/31/91                            
         DC    F'13400'                                                         
         DC    F'5850'                                                          
         DC    F'5010'                                                          
         SPACE 1                                                                
         DC    AL2(6,24,0,0,0,0)   01/01/92-11/15/92                            
         DC    F'5520'                                                          
         DC    F'2410'                                                          
         DC    F'2064'                                                          
         SPACE 1                                                                
         DC    AL2(7,24,0,0,0,0)   11/16/92-03/11/93                            
         DC    F'5630'                                                          
         DC    F'2460'                                                          
         DC    F'2106'                                                          
         SPACE 1                                                                
         DC    AL2(8,24,0,0,0,0)   03/12/93-11/15/93                            
         DC    F'5630'                                                          
         DC    F'2460'                                                          
         DC    F'2106'                                                          
         SPACE 1                                                                
         DC    AL2(9,24,0,0,0,0)   11/16/93-01/14/95                            
         DC    F'5800'                                                          
         DC    F'2530'                                                          
         DC    F'2172'                                                          
         SPACE 1                                                                
         DC    AL2(10,24,0,0,0,0)  01/15/95-11/15/95                            
         DC    F'6000'                                                          
         DC    F'2620'                                                          
         DC    F'2250'                                                          
         SPACE 1                                                                
         DC    AL2(11,24,0,0,0,0)  11/16/95-11/15/96                            
         DC    F'6210'                                                          
         DC    F'2710'                                                          
         DC    F'2328'                                                          
         SPACE 1                                                                
         DC    AL2(12,24,0,0,0,0)  11/16/96-11/15/97                            
         DC    F'6430'                                                          
         DC    F'2800'                                                          
         DC    F'2412'                                                          
         SPACE 1                                                                
         DC    AL2(13,24,0,0,0,0)  11/16/97-11/15/98                            
         DC    F'6620'                                                          
         DC    F'2880'                                                          
         DC    F'2484'                                                          
         SPACE 1                                                                
         DC    AL2(14,24,0,0,0,0)  11/16/98-11/15/99                            
         DC    F'6820'                                                          
         DC    F'2970'                                                          
         DC    F'2556'                                                          
         SPACE 1                                                                
         DC    AL2(15,24,0,0,0,0)  11/16/99-11/15/00                            
         DC    F'7060'                                                          
         DC    F'3070'                                                          
         DC    F'2646'                                                          
         SPACE 1                                                                
         DC    AL2(16,24,0,0,0,0)  11/16/00-11/15/01                            
         DC    F'7310'                                                          
         DC    F'3180'                                                          
         DC    F'2736'                                                          
         SPACE 1                                                                
         DC    AL2(17,24,0,0,0,0)  11/16/01-11/15/02                            
         DC    F'7530'                                                          
         DC    F'3280'                                                          
         DC    F'2820'                                                          
         SPACE 1                                                                
         DC    AL2(18,24,0,0,0,0)  11/16/02-11/15/03                            
         DC    F'7760'                                                          
         DC    F'3380'                                                          
         DC    F'2904'                                                          
         SPACE 1                                                                
         DC    AL2(19,24,0,0,0,0)  11/16/03-11/15/04                            
         DC    F'7990'                                                          
         DC    F'3480'                                                          
         DC    F'2994'                                                          
         SPACE 1                                                                
         DC    AL2(20,24,0,0,0,0)  11/16/04-11/15/05                            
         DC    F'8150'                                                          
         DC    F'3550'                                                          
         DC    F'3084'                                                          
         SPACE 1                                                                
         DC    AL2(21,24,0,0,0,0)  11/16/05-11/15/06                            
         DC    F'8270'                                                          
         DC    F'3600'                                                          
         DC    F'3162'                                                          
         SPACE 1                                                                
         DC    AL2(22,24,0,0,0,0)  11/16/06-11/15/07                            
         DC    F'8440'                                                          
         DC    F'3670'                                                          
         DC    F'3258'                                                          
         SPACE 1                                                                
         DC    AL2(23,24,0,0,0,0)  11/16/07-11/15/08                            
         DC    F'8690'                                                          
         DC    F'3780'                                                          
         DC    F'3372'                                                          
         SPACE 1                                                                
         DC    AL2(24,24,0,0,0,0)  11/16/08-11/15/09                            
         DC    F'8910'                                                          
         DC    F'3870'                                                          
         DC    F'3474'                                                          
         SPACE 1                                                                
         DC    AL2(25,24,0,0,0,0)  11/16/09-11/15/10                            
         DC    F'9130'                                                          
         DC    F'3970'                                                          
         DC    F'3576'                                                          
         SPACE 1                                                                
         DC    AL2(26,24,0,0,0,0)  11/16/10-11/15/11                            
         DC    F'9310'                                                          
         DC    F'4050'                                                          
         DC    F'3648'                                                          
         SPACE 1                                                                
*                                                                               
*                                  SOAP RESIDUALS AREA 2                        
*                                                                               
SORA2TBL DS    0H                  SOR AREA 2:                                  
         DC    AL2(50,24,0,0,0,0)  11/16/82-11/15/83                            
         DC    F'4470'             FULL PART                                    
         DC    F'1960'             UNDER 5                                      
         DC    F'1776'             ANNOUNCER                                    
         SPACE 1                                                                
         DC    AL2(51,24,0,0,0,0)  11/16/83-11/15/86                            
         DC    F'4760'                                                          
         DC    F'2080'                                                          
         DC    F'1890'                                                          
         SPACE 1                                                                
         DC    AL2(52,24,0,0,0,0)  11/16/86-11/15/87                            
         DC    F'4900'                                                          
         DC    F'2140'                                                          
         DC    F'1890'                                                          
         SPACE 1                                                                
         DC    AL2(53,24,0,0,0,0)  11/16/87-11/15/89                            
         DC    F'5050'                                                          
         DC    F'2200'                                                          
         DC    F'1890'                                                          
         SPACE 1                                                                
         DC    AL2(54,24,0,0,0,0)  11/16/89-11/15/90                            
         DC    F'5200'                                                          
         DC    F'2270'                                                          
         DC    F'1944'                                                          
         SPACE 1                                                                
         DC    AL2(55,24,0,0,0,0)  11/16/90-12/31/91                            
         DC    F'5360'                                                          
         DC    F'2340'                                                          
         DC    F'2004'                                                          
         SPACE 1                                                                
         DC    AL2(56,24,0,0,0,0)  01/01/92-11/15/92                            
         DC    F'5520'                                                          
         DC    F'2410'                                                          
         DC    F'2064'                                                          
         SPACE 1                                                                
         DC    AL2(57,24,0,0,0,0)  11/16/92-03/11/93                            
         DC    F'5630'                                                          
         DC    F'2460'                                                          
         DC    F'2106'                                                          
         SPACE 1                                                                
         DC    AL2(58,24,0,0,0,0)  03/12/93-11/15/93                            
         DC    F'5630'                                                          
         DC    F'2460'                                                          
         DC    F'2106'                                                          
         SPACE 1                                                                
         DC    AL2(59,24,0,0,0,0)  11/16/93-01/14/95                            
         DC    F'5800'                                                          
         DC    F'2530'                                                          
         DC    F'2172'                                                          
         SPACE 1                                                                
         DC    AL2(60,24,0,0,0,0)  01/15/95-11/15/95                            
         DC    F'6000'                                                          
         DC    F'2620'                                                          
         DC    F'2250'                                                          
         SPACE 1                                                                
         DC    AL2(61,24,0,0,0,0)  11/16/95-11/15/96                            
         DC    F'6210'                                                          
         DC    F'2710'                                                          
         DC    F'2328'                                                          
         SPACE 1                                                                
         DC    AL2(62,24,0,0,0,0)  11/16/96-11/15/97                            
         DC    F'6430'                                                          
         DC    F'2800'                                                          
         DC    F'2412'                                                          
         SPACE 1                                                                
         DC    AL2(63,24,0,0,0,0)  11/16/97-11/15/98                            
         DC    F'6620'                                                          
         DC    F'2880'                                                          
         DC    F'2484'                                                          
         SPACE 1                                                                
         DC    AL2(64,24,0,0,0,0)  11/16/98-11/15/99                            
         DC    F'6820'                                                          
         DC    F'2970'                                                          
         DC    F'2556'                                                          
         SPACE 1                                                                
         DC    AL2(65,24,0,0,0,0)  11/16/99-11/15/00                            
         DC    F'7060'                                                          
         DC    F'3070'                                                          
         DC    F'2646'                                                          
         SPACE 1                                                                
         DC    AL2(66,24,0,0,0,0)  11/16/00-11/15/01                            
         DC    F'7310'                                                          
         DC    F'3180'                                                          
         DC    F'2736'                                                          
         SPACE 1                                                                
         DC    AL2(67,24,0,0,0,0)  11/16/01-11/15/02                            
         DC    F'7530'                                                          
         DC    F'3280'                                                          
         DC    F'2820'                                                          
         SPACE 1                                                                
         DC    AL2(68,24,0,0,0,0)  11/16/02-11/15/03                            
         DC    F'7760'                                                          
         DC    F'3380'                                                          
         DC    F'2904'                                                          
         SPACE 1                                                                
         DC    AL2(69,24,0,0,0,0)  11/16/03-11/15/04                            
         DC    F'7990'                                                          
         DC    F'3480'                                                          
         DC    F'2994'                                                          
         SPACE 1                                                                
         DC    AL2(70,24,0,0,0,0)  11/16/04-11/15/05                            
         DC    F'8150'                                                          
         DC    F'3550'                                                          
         DC    F'3084'                                                          
         SPACE 1                                                                
         DC    AL2(71,24,0,0,0,0)  11/16/05-11/15/06                            
         DC    F'8270'                                                          
         DC    F'3600'                                                          
         DC    F'3162'                                                          
         SPACE 1                                                                
         DC    AL2(72,24,0,0,0,0)  11/16/06-11/15/07                            
         DC    F'8440'                                                          
         DC    F'3670'                                                          
         DC    F'3258'                                                          
         SPACE 1                                                                
         DC    AL2(73,24,0,0,0,0)  11/16/07-11/15/08                            
         DC    F'8690'                                                          
         DC    F'3780'                                                          
         DC    F'3372'                                                          
         SPACE 1                                                                
         DC    AL2(74,24,0,0,0,0)  11/16/08-11/15/09                            
         DC    F'8910'                                                          
         DC    F'3870'                                                          
         DC    F'3474'                                                          
         SPACE 1                                                                
         DC    AL2(75,24,0,0,0,0)  11/16/09-11/15/10                            
         DC    F'9130'                                                          
         DC    F'3970'                                                          
         DC    F'3576'                                                          
         SPACE 1                                                                
         DC    AL2(76,24,0,0,0,0)  11/16/10-11/15/11                            
         DC    F'9310'                                                          
         DC    F'4050'                                                          
         DC    F'3648'                                                          
         SPACE 1                                                                
*                                                                               
*                                  SOAP RESIDUALS AREAS 3,4,5                   
*                                                                               
SORA3TBL DS    0H                  SOR AREAS 3,4,5:                             
         DC    AL2(100,24,0,0,0,0) 11/16/82-11/15/83                            
         DC    F'2235'             FULL PART                                    
         DC    F'980'              UNDER 5                                      
         DC    F'888'              ANNOUNCER                                    
         SPACE 1                                                                
         DC    AL2(101,24,0,0,0,0) 11/16/83-11/15/86                            
         DC    F'2380'                                                          
         DC    F'1040'                                                          
         DC    F'945'                                                           
         SPACE 1                                                                
         DC    AL2(102,24,0,0,0,0) 11/16/86-11/15/87                            
         DC    F'2450'                                                          
         DC    F'1070'                                                          
         DC    F'945'                                                           
         SPACE 1                                                                
         DC    AL2(103,24,0,0,0,0) 11/16/87-11/15/89                            
         DC    F'2525'                                                          
         DC    F'1100'                                                          
         DC    F'945'                                                           
         SPACE 1                                                                
         DC    AL2(104,24,0,0,0,0) 11/16/89-11/15/90                            
         DC    F'2600'                                                          
         DC    F'1135'                                                          
         DC    F'972'                                                           
         SPACE 1                                                                
         DC    AL2(105,24,0,0,0,0) 11/16/90-12/31/91                            
         DC    F'2680'                                                          
         DC    F'1170'                                                          
         DC    F'1002'                                                          
         SPACE 1                                                                
         DC    AL2(106,24,0,0,0,0) 01/01/92-11/15/92                            
         DC    F'2760'                                                          
         DC    F'1205'                                                          
         DC    F'1032'                                                          
         SPACE 1                                                                
         DC    AL2(107,24,0,0,0,0) 11/16/92-03/11/93                            
         DC    F'2815'                                                          
         DC    F'1230'                                                          
         DC    F'1053'                                                          
         SPACE 1                                                                
         DC    AL2(108,24,0,0,0,0) 03/12/93-11/15/93                            
         DC    F'2815'                                                          
         DC    F'1230'                                                          
         DC    F'1053'                                                          
         SPACE 1                                                                
         DC    AL2(109,24,0,0,0,0) 11/16/93-01/14/95                            
         DC    F'2900'                                                          
         DC    F'1265'                                                          
         DC    F'1086'                                                          
         SPACE 1                                                                
         DC    AL2(110,24,0,0,0,0) 01/15/95-11/15/95                            
         DC    F'3000'                                                          
         DC    F'1310'                                                          
         DC    F'1125'                                                          
         SPACE 1                                                                
         DC    AL2(111,24,0,0,0,0) 11/16/95-11/15/96                            
         DC    F'3105'                                                          
         DC    F'1355'                                                          
         DC    F'1164'                                                          
         SPACE 1                                                                
         DC    AL2(112,24,0,0,0,0) 11/16/96-11/15/97                            
         DC    F'3215'                                                          
         DC    F'1400'                                                          
         DC    F'1206'                                                          
         SPACE 1                                                                
         DC    AL2(113,24,0,0,0,0) 11/16/97-11/15/98                            
         DC    F'3310'                                                          
         DC    F'1440'                                                          
         DC    F'1242'                                                          
         SPACE 1                                                                
         DC    AL2(114,24,0,0,0,0) 11/16/98-11/15/99                            
         DC    F'3410'                                                          
         DC    F'1485'                                                          
         DC    F'1278'                                                          
         SPACE 1                                                                
         DC    AL2(115,24,0,0,0,0) 11/16/99-11/15/00                            
         DC    F'3530'                                                          
         DC    F'1535'                                                          
         DC    F'1323'                                                          
         SPACE 1                                                                
         DC    AL2(116,24,0,0,0,0) 11/16/00-11/15/01                            
         DC    F'3655'                                                          
         DC    F'1590'                                                          
         DC    F'1368'                                                          
         SPACE 1                                                                
         DC    AL2(117,24,0,0,0,0) 11/16/01-11/15/02                            
         DC    F'3765'                                                          
         DC    F'1640'                                                          
         DC    F'1410'                                                          
         SPACE 1                                                                
         DC    AL2(118,24,0,0,0,0) 11/16/02-11/15/03                            
         DC    F'3880'                                                          
         DC    F'1690'                                                          
         DC    F'1452'                                                          
         SPACE 1                                                                
         DC    AL2(119,24,0,0,0,0) 11/16/03-11/15/04                            
         DC    F'3995'                                                          
         DC    F'1740'                                                          
         DC    F'1497'                                                          
         SPACE 1                                                                
         DC    AL2(120,24,0,0,0,0) 11/16/04-11/15/05                            
         DC    F'4075'                                                          
         DC    F'1775'                                                          
         DC    F'1542'                                                          
         SPACE 1                                                                
         DC    AL2(121,24,0,0,0,0) 11/16/05-11/15/06                            
         DC    F'4135'                                                          
         DC    F'1800'                                                          
         DC    F'1581'                                                          
         SPACE 1                                                                
         DC    AL2(122,24,0,0,0,0) 11/16/06-11/15/07                            
         DC    F'4220'                                                          
         DC    F'1835'                                                          
         DC    F'1629'                                                          
         SPACE 1                                                                
         DC    AL2(123,24,0,0,0,0) 11/16/07-11/15/08                            
         DC    F'4345'                                                          
         DC    F'1890'                                                          
         DC    F'1686'                                                          
         SPACE 1                                                                
         DC    AL2(124,24,0,0,0,0) 11/16/08-11/15/09                            
         DC    F'4455'                                                          
         DC    F'1935'                                                          
         DC    F'1737'                                                          
         SPACE 1                                                                
         DC    AL2(125,24,0,0,0,0) 11/16/09-11/15/10                            
         DC    F'4565'                                                          
         DC    F'1985'                                                          
         DC    F'1788'                                                          
         SPACE 1                                                                
         DC    AL2(126,24,0,0,0,0) 11/16/10-11/15/11                            
         DC    F'4655'                                                          
         DC    F'2025'                                                          
         DC    F'1824'                                                          
         EJECT                                                                  
*                                                                               
*                                  SOAP RESIDUALS (1/2 HOUR) AREA 1             
*                                                                               
SRHA1TBL DS    0H                  SRH AREA 1:                                  
         DC    AL2(150,24,0,0,0,0) 11/16/82-11/15/83                            
         DC    F'8375'             FULL PART                                    
         DC    F'3950'             UNDER 5                                      
         DC    F'3165'             ANNOUNCER                                    
         SPACE 1                                                                
         DC    AL2(151,24,0,0,0,0) 11/16/83-11/15/86                            
         DC    F'8925'                                                          
         DC    F'4225'                                                          
         DC    F'3375'                                                          
         SPACE 1                                                                
         DC    AL2(152,24,0,0,0,0) 11/16/86-11/15/87                            
         DC    F'9200'                                                          
         DC    F'4350'                                                          
         DC    F'3375'                                                          
         SPACE 1                                                                
         DC    AL2(153,24,0,0,0,0) 11/16/87-11/15/89                            
         DC    F'9475'                                                          
         DC    F'4475'                                                          
         DC    F'3375'                                                          
         SPACE 1                                                                
         DC    AL2(154,24,0,0,0,0) 11/16/89-11/15/90                            
         DC    F'9750'                                                          
         DC    F'4600'                                                          
         DC    F'3480'                                                          
         SPACE 1                                                                
         DC    AL2(155,24,0,0,0,0) 11/16/90-12/31/91                            
         DC    F'10050'                                                         
         DC    F'4750'                                                          
         DC    F'3585'                                                          
         SPACE 1                                                                
         DC    AL2(156,24,0,0,0,0) 01/01/92-11/15/92                            
         DC    F'4140'                                                          
         DC    F'1960'                                                          
         DC    F'1476'                                                          
         SPACE 1                                                                
         DC    AL2(157,24,0,0,0,0) 11/16/92-03/11/93                            
         DC    F'4220'                                                          
         DC    F'2000'                                                          
         DC    F'1506'                                                          
         SPACE 1                                                                
         DC    AL2(158,24,0,0,0,0) 03/12/93-11/15/93                            
         DC    F'4220'                                                          
         DC    F'2000'                                                          
         DC    F'1506'                                                          
         SPACE 1                                                                
         DC    AL2(159,24,0,0,0,0) 11/16/93-01/14/95                            
         DC    F'4350'                                                          
         DC    F'2060'                                                          
         DC    F'1554'                                                          
         SPACE 1                                                                
         DC    AL2(160,24,0,0,0,0) 01/15/95-11/15/95                            
         DC    F'4500'                                                          
         DC    F'2130'                                                          
         DC    F'1608'                                                          
         SPACE 1                                                                
         DC    AL2(161,24,0,0,0,0) 11/16/95-11/15/96                            
         DC    F'4660'                                                          
         DC    F'2200'                                                          
         DC    F'1664'                                                          
         SPACE 1                                                                
         DC    AL2(162,24,0,0,0,0) 11/16/96-11/15/97                            
         DC    F'4820'                                                          
         DC    F'2280'                                                          
         DC    F'1722'                                                          
         SPACE 1                                                                
         DC    AL2(163,24,0,0,0,0) 11/16/97-11/15/98                            
         DC    F'4960'                                                          
         DC    F'2350'                                                          
         DC    F'1776'                                                          
         SPACE 1                                                                
         DC    AL2(164,24,0,0,0,0) 11/16/98-11/15/99                            
         DC    F'5110'                                                          
         DC    F'2420'                                                          
         DC    F'1830'                                                          
         SPACE 1                                                                
         DC    AL2(165,24,0,0,0,0) 11/16/99-11/15/00                            
         DC    F'5290'                                                          
         DC    F'2500'                                                          
         DC    F'1896'                                                          
         SPACE 1                                                                
         DC    AL2(166,24,0,0,0,0) 11/16/00-11/15/01                            
         DC    F'5480'                                                          
         DC    F'2590'                                                          
         DC    F'1962'                                                          
         SPACE 1                                                                
         DC    AL2(167,24,0,0,0,0) 11/16/01-11/15/02                            
         DC    F'5640'                                                          
         DC    F'2670'                                                          
         DC    F'2022'                                                          
         SPACE 1                                                                
         DC    AL2(168,24,0,0,0,0) 11/16/02-11/15/03                            
         DC    F'5810'                                                          
         DC    F'2750'                                                          
         DC    F'2082'                                                          
         SPACE 1                                                                
         DC    AL2(169,24,0,0,0,0) 11/16/03-11/15/04                            
         DC    F'5980'                                                          
         DC    F'2830'                                                          
         DC    F'2142'                                                          
         SPACE 1                                                                
         DC    AL2(170,24,0,0,0,0) 11/16/04-11/15/05                            
         DC    F'6100'                                                          
         DC    F'2890'                                                          
         DC    F'2208'                                                          
         SPACE 1                                                                
         DC    AL2(171,24,0,0,0,0) 11/16/05-11/15/06                            
         DC    F'6190'                                                          
         DC    F'2930'                                                          
         DC    F'2262'                                                          
         SPACE 1                                                                
         DC    AL2(172,24,0,0,0,0) 11/16/06-11/15/07                            
         DC    F'6310'                                                          
         DC    F'2990'                                                          
         DC    F'2328'                                                          
         SPACE 1                                                                
         DC    AL2(173,24,0,0,0,0) 11/16/07-11/15/08                            
         DC    F'6500'                                                          
         DC    F'3080'                                                          
         DC    F'2412'                                                          
         SPACE 1                                                                
         DC    AL2(174,24,0,0,0,0) 11/16/08-11/15/09                            
         DC    F'6660'                                                          
         DC    F'3160'                                                          
         DC    F'2484'                                                          
         SPACE 1                                                                
         DC    AL2(175,24,0,0,0,0) 11/16/09-11/15/10                            
         DC    F'6830'                                                          
         DC    F'3240'                                                          
         DC    F'2556'                                                          
         SPACE 1                                                                
         DC    AL2(176,24,0,0,0,0) 11/16/10-11/15/11                            
         DC    F'6970'                                                          
         DC    F'3300'                                                          
         DC    F'2608'                                                          
         SPACE 1                                                                
*                                                                               
*                                  SOAP RESIDUALS (1/2 HOUR) AREA 2             
*                                                                               
SRHA2TBL DS    0H                  SRH AREA 2:                                  
         DC    AL2(200,24,0,0,0,0) 11/16/82-11/15/83                            
         DC    F'3350'             FULL PART                                    
         DC    F'1580'             UNDER 5                                      
         DC    F'1266'             ANNOUNCER                                    
         SPACE 1                                                                
         DC    AL2(201,24,0,0,0,0) 11/16/83-11/15/86                            
         DC    F'3570'                                                          
         DC    F'1690'                                                          
         DC    F'1350'                                                          
         SPACE 1                                                                
         DC    AL2(202,24,0,0,0,0) 11/16/86-11/15/87                            
         DC    F'3680'                                                          
         DC    F'1740'                                                          
         DC    F'1350'                                                          
         SPACE 1                                                                
         DC    AL2(203,24,0,0,0,0) 11/16/87-11/15/89                            
         DC    F'3790'                                                          
         DC    F'1790'                                                          
         DC    F'1350'                                                          
         SPACE 1                                                                
         DC    AL2(204,24,0,0,0,0) 11/16/89-11/15/90                            
         DC    F'3900'                                                          
         DC    F'1840'                                                          
         DC    F'1392'                                                          
         SPACE 1                                                                
         DC    AL2(205,24,0,0,0,0) 11/16/90-12/31/91                            
         DC    F'4020'                                                          
         DC    F'1900'                                                          
         DC    F'1434'                                                          
         SPACE 1                                                                
         DC    AL2(206,24,0,0,0,0) 01/01/92-11/15/92                            
         DC    F'4140'                                                          
         DC    F'1960'                                                          
         DC    F'1476'                                                          
         SPACE 1                                                                
         DC    AL2(207,24,0,0,0,0) 11/16/92-03/11/93                            
         DC    F'4220'                                                          
         DC    F'2000'                                                          
         DC    F'1506'                                                          
         SPACE 1                                                                
         DC    AL2(208,24,0,0,0,0) 03/12/93-11/15/93                            
         DC    F'4220'                                                          
         DC    F'2000'                                                          
         DC    F'1506'                                                          
         SPACE 1                                                                
         DC    AL2(209,24,0,0,0,0) 11/16/93-01/14/95                            
         DC    F'4350'                                                          
         DC    F'2060'                                                          
         DC    F'1554'                                                          
         SPACE 1                                                                
         DC    AL2(210,24,0,0,0,0) 01/15/95-11/15/95                            
         DC    F'4500'                                                          
         DC    F'2130'                                                          
         DC    F'1608'                                                          
         SPACE 1                                                                
         DC    AL2(211,24,0,0,0,0) 11/16/95-11/15/96                            
         DC    F'4660'                                                          
         DC    F'2200'                                                          
         DC    F'1664'                                                          
         SPACE 1                                                                
         DC    AL2(212,24,0,0,0,0) 11/16/96-11/15/97                            
         DC    F'4820'                                                          
         DC    F'2280'                                                          
         DC    F'1722'                                                          
         SPACE 1                                                                
         DC    AL2(213,24,0,0,0,0) 11/16/97-11/15/98                            
         DC    F'4960'                                                          
         DC    F'2350'                                                          
         DC    F'1776'                                                          
         SPACE 1                                                                
         DC    AL2(214,24,0,0,0,0) 11/16/98-11/15/99                            
         DC    F'5110'                                                          
         DC    F'2420'                                                          
         DC    F'1830'                                                          
         SPACE 1                                                                
         DC    AL2(215,24,0,0,0,0) 11/16/99-11/15/00                            
         DC    F'5290'                                                          
         DC    F'2500'                                                          
         DC    F'1896'                                                          
         SPACE 1                                                                
         DC    AL2(216,24,0,0,0,0) 11/16/00-11/15/01                            
         DC    F'5480'                                                          
         DC    F'2590'                                                          
         DC    F'1962'                                                          
         SPACE 1                                                                
         DC    AL2(217,24,0,0,0,0) 11/16/01-11/15/02                            
         DC    F'5640'                                                          
         DC    F'2670'                                                          
         DC    F'2022'                                                          
         SPACE 1                                                                
         DC    AL2(218,24,0,0,0,0) 11/16/02-11/15/03                            
         DC    F'5810'                                                          
         DC    F'2750'                                                          
         DC    F'2082'                                                          
         SPACE 1                                                                
         DC    AL2(219,24,0,0,0,0) 11/16/03-11/15/04                            
         DC    F'5980'                                                          
         DC    F'2830'                                                          
         DC    F'2142'                                                          
         SPACE 1                                                                
         DC    AL2(220,24,0,0,0,0) 11/16/04-11/15/05                            
         DC    F'6100'                                                          
         DC    F'2890'                                                          
         DC    F'2208'                                                          
         SPACE 1                                                                
         DC    AL2(221,24,0,0,0,0) 11/16/05-11/15/06                            
         DC    F'6190'                                                          
         DC    F'2930'                                                          
         DC    F'2262'                                                          
         SPACE 1                                                                
         DC    AL2(222,24,0,0,0,0) 11/16/06-11/15/07                            
         DC    F'6310'                                                          
         DC    F'2990'                                                          
         DC    F'2328'                                                          
         SPACE 1                                                                
         DC    AL2(223,24,0,0,0,0) 11/16/07-11/15/08                            
         DC    F'6500'                                                          
         DC    F'3080'                                                          
         DC    F'2412'                                                          
         SPACE 1                                                                
         DC    AL2(224,24,0,0,0,0) 11/16/08-11/15/09                            
         DC    F'6660'                                                          
         DC    F'3160'                                                          
         DC    F'2484'                                                          
         SPACE 1                                                                
         DC    AL2(225,24,0,0,0,0) 11/16/09-11/15/10                            
         DC    F'6830'                                                          
         DC    F'3240'                                                          
         DC    F'2556'                                                          
         SPACE 1                                                                
         DC    AL2(226,24,0,0,0,0) 11/16/10-11/15/11                            
         DC    F'6970'                                                          
         DC    F'3300'                                                          
         DC    F'2608'                                                          
         SPACE 1                                                                
*                                                                               
*                                 SOAP RESIDUALS (1/2 HOUR) AREAS 3,4,5         
*                                                                               
SRHA3TBL DS    0H                  SRH AREAS 3,4,5:                             
         DC    AL2(250,24,0,0,0,0) 11/16/82-11/15/83                            
         DC    F'1675'             FULL PART                                    
         DC    F'790'              UNDER 5                                      
         DC    F'633'              ANNOUNCER                                    
         SPACE 1                                                                
         DC    AL2(251,24,0,0,0,0) 11/16/83-11/15/86                            
         DC    F'1785'                                                          
         DC    F'845'                                                           
         DC    F'675'                                                           
         SPACE 1                                                                
         DC    AL2(252,24,0,0,0,0) 11/16/86-11/15/87                            
         DC    F'1840'                                                          
         DC    F'870'                                                           
         DC    F'675'                                                           
         SPACE 1                                                                
         DC    AL2(253,24,0,0,0,0) 11/16/87-11/15/89                            
         DC    F'1895'                                                          
         DC    F'895'                                                           
         DC    F'675'                                                           
         SPACE 1                                                                
         DC    AL2(254,24,0,0,0,0) 11/16/89-11/15/90                            
         DC    F'1950'                                                          
         DC    F'920'                                                           
         DC    F'696'                                                           
         SPACE 1                                                                
         DC    AL2(255,24,0,0,0,0) 11/16/90-12/31/91                            
         DC    F'2010'                                                          
         DC    F'950'                                                           
         DC    F'717'                                                           
         SPACE 1                                                                
         DC    AL2(256,24,0,0,0,0) 01/01/92-11/15/92                            
         DC    F'2070'                                                          
         DC    F'980'                                                           
         DC    F'738'                                                           
         SPACE 1                                                                
         DC    AL2(257,24,0,0,0,0) 11/16/92-03/11/93                            
         DC    F'2010'                                                          
         DC    F'1000'                                                          
         DC    F'753'                                                           
         SPACE 1                                                                
         DC    AL2(258,24,0,0,0,0) 03/12/93-11/15/93                            
         DC    F'2010'                                                          
         DC    F'1000'                                                          
         DC    F'753'                                                           
         SPACE 1                                                                
         DC    AL2(259,24,0,0,0,0) 11/16/93-01/14/95                            
         DC    F'2175'                                                          
         DC    F'1030'                                                          
         DC    F'777'                                                           
         SPACE 1                                                                
         DC    AL2(260,24,0,0,0,0) 01/15/95-11/15/95                            
         DC    F'2250'                                                          
         DC    F'1065'                                                          
         DC    F'804'                                                           
         SPACE 1                                                                
         DC    AL2(261,24,0,0,0,0) 11/16/95-11/15/96                            
         DC    F'2330'                                                          
         DC    F'1100'                                                          
         DC    F'832'                                                           
         SPACE 1                                                                
         DC    AL2(262,24,0,0,0,0) 11/16/96-11/15/97                            
         DC    F'2410'                                                          
         DC    F'1140'                                                          
         DC    F'861'                                                           
         SPACE 1                                                                
         DC    AL2(263,24,0,0,0,0) 11/16/97-11/15/98                            
         DC    F'2480'                                                          
         DC    F'1175'                                                          
         DC    F'888'                                                           
         SPACE 1                                                                
         DC    AL2(264,24,0,0,0,0) 11/16/98-11/15/99                            
         DC    F'2555'                                                          
         DC    F'1210'                                                          
         DC    F'915'                                                           
         SPACE 1                                                                
         DC    AL2(265,24,0,0,0,0) 11/16/99-11/15/00                            
         DC    F'2645'                                                          
         DC    F'1250'                                                          
         DC    F'948'                                                           
         SPACE 1                                                                
         DC    AL2(266,24,0,0,0,0) 11/16/00-11/15/01                            
         DC    F'2740'                                                          
         DC    F'1295'                                                          
         DC    F'981'                                                           
         SPACE 1                                                                
         DC    AL2(267,24,0,0,0,0) 11/16/01-11/15/02                            
         DC    F'2820'                                                          
         DC    F'1335'                                                          
         DC    F'1011'                                                          
         SPACE 1                                                                
         DC    AL2(268,24,0,0,0,0) 11/16/02-11/15/03                            
         DC    F'2905'                                                          
         DC    F'1375'                                                          
         DC    F'1041'                                                          
         SPACE 1                                                                
         DC    AL2(269,24,0,0,0,0) 11/16/03-11/15/04                            
         DC    F'2990'                                                          
         DC    F'1415'                                                          
         DC    F'1071'                                                          
         SPACE 1                                                                
         DC    AL2(270,24,0,0,0,0) 11/16/04-11/15/05                            
         DC    F'3050'                                                          
         DC    F'1445'                                                          
         DC    F'1104'                                                          
         SPACE 1                                                                
         DC    AL2(271,24,0,0,0,0) 11/16/05-11/15/06                            
         DC    F'3095'                                                          
         DC    F'1465'                                                          
         DC    F'1131'                                                          
         SPACE 1                                                                
         DC    AL2(272,24,0,0,0,0) 11/16/06-11/15/07                            
         DC    F'3155'                                                          
         DC    F'1495'                                                          
         DC    F'1164'                                                          
         SPACE 1                                                                
         DC    AL2(273,24,0,0,0,0) 11/16/07-11/15/08                            
         DC    F'3250'                                                          
         DC    F'1540'                                                          
         DC    F'1206'                                                          
         SPACE 1                                                                
         DC    AL2(274,24,0,0,0,0) 11/16/08-11/15/09                            
         DC    F'3330'                                                          
         DC    F'1580'                                                          
         DC    F'1242'                                                          
         SPACE 1                                                                
         DC    AL2(275,24,0,0,0,0) 11/16/09-11/15/10                            
         DC    F'3415'                                                          
         DC    F'1620'                                                          
         DC    F'1278'                                                          
         SPACE 1                                                                
         DC    AL2(276,24,0,0,0,0) 11/16/10-11/15/11                            
         DC    F'3485'                                                          
         DC    F'1650'                                                          
         DC    F'1304'                                                          
         SPACE 1                                                                
         EJECT                                                                  
*                                                                               
*                                  DIRECTORS RESIDUALS INITIAL PAY              
*                                                                               
SDRINTBL DS    0H                  SDR INI PYMNT:                               
         DC    AL2(300,32,0,0,0,0) 08/01/79-07/31/80                            
         DC    4A(0)                                                            
         DC    F'15000'                                                         
         SPACE 1                                                                
         DC    AL2(301,32,0,0,0,0) 08/01/80-06/30/81                            
         DC    4A(0)                                                            
         DC    F'16125'                                                         
         SPACE 1                                                                
         DC    AL2(302,32,0,0,0,0) 07/01/81-06/30/82                            
         DC    4A(0)                                                            
         DC    F'18060'                                                         
         SPACE 1                                                                
         DC    AL2(303,32,0,0,0,0) 07/01/82-06/30/83                            
         DC    4A(0)                                                            
         DC    F'20220'                                                         
         SPACE 1                                                                
         DC    AL2(304,32,0,0,0,0) 07/01/83-06/30/84                            
         DC    4A(0)                                                            
         DC    F'22440'                                                         
         SPACE 1                                                                
         DC    AL2(305,32,0,0,0,0) 07/01/84-06/30/85                            
         DC    4A(0)                                                            
         DC    F'24000'                                                         
         SPACE 1                                                                
         DC    AL2(306,32,0,0,0,0) 07/01/85-06/30/86                            
         DC    4A(0)                                                            
         DC    F'25500'                                                         
         SPACE 1                                                                
         DC    AL2(307,32,0,0,0,0) 07/01/86-06/30/87                            
         DC    4A(0)                                                            
         DC    F'27375'                                                         
         SPACE 1                                                                
         DC    AL2(308,32,0,0,0,0) 07/01/87-12/31/88                            
         DC    4A(0)                                                            
         DC    F'28740'                                                         
         SPACE 1                                                                
         DC    AL2(309,32,0,0,0,0) 01/01/89-06/30/90                            
         DC    4A(0)                                                            
         DC    F'30180'                                                         
         SPACE 1                                                                
         DC    AL2(310,32,0,0,0,0) 07/01/90-06/30/91                            
         DC    4A(0)                                                            
         DC    F'31470'                                                         
         SPACE 1                                                                
         DC    AL2(311,32,0,0,0,0) 07/01/91-06/30/92                            
         DC    4A(0)                                                            
         DC    F'32880'                                                         
         SPACE 1                                                                
         DC    AL2(312,32,0,0,0,0) 07/01/92-06/30/93                            
         DC    4A(0)                                                            
         DC    F'34365'                                                         
         SPACE 1                                                                
         DC    AL2(313,32,0,0,0,0) 07/01/93-06/30/94                            
         DC    4A(0)                                                            
         DC    F'35745'                                                         
         SPACE 1                                                                
         DC    AL2(314,32,0,0,0,0) 07/01/94-06/30/95                            
         DC    4A(0)                                                            
         DC    F'37170'                                                         
         SPACE 1                                                                
         DC    AL2(315,32,0,0,0,0) 07/01/95-06/30/96                            
         DC    4A(0)                                                            
         DC    F'38655'                                                         
         SPACE 1                                                                
         DC    AL2(316,32,0,0,0,0) 07/01/96-06/30/97                            
         DC    4A(0)                                                            
         DC    F'40005'                                                         
         SPACE 1                                                                
         DC    AL2(317,32,0,0,0,0) 07/01/97-06/30/98                            
         DC    4A(0)                                                            
         DC    F'41415'                                                         
         SPACE 1                                                                
         DC    AL2(318,32,0,0,0,0) 07/01/98-06/30/99                            
         DC    4A(0)                                                            
         DC    F'42855'                                                         
         SPACE 1                                                                
         DC    AL2(319,32,0,0,0,0) 07/01/99-06/30/00                            
         DC    4A(0)                                                            
         DC    F'44565'                                                         
         SPACE 1                                                                
         DC    AL2(320,32,0,0,0,0) 07/01/00-06/30/01                            
         DC    4A(0)                                                            
         DC    F'46350'                                                         
         SPACE 1                                                                
         DC    AL2(321,32,0,0,0,0) 07/01/01-06/30/02                            
         DC    4A(0)                                                            
         DC    F'48210'                                                         
         SPACE 1                                                                
         DC    AL2(322,32,0,0,0,0) 07/01/02-06/30/03                            
         DC    4A(0)                                                            
         DC    F'49650'                                                         
         SPACE 1                                                                
         DC    AL2(323,32,0,0,0,0) 07/01/03-06/30/04                            
         DC    4A(0)                                                            
         DC    F'51135'                                                         
         SPACE 1                                                                
         DC    AL2(324,32,0,0,0,0) 07/01/04-06/30/05                            
         DC    4A(0)                                                            
         DC    F'52410'                                                         
         SPACE 1                                                                
         DC    AL2(325,32,0,0,0,0) 07/01/05-06/30/06                            
         DC    4A(0)                                                            
         DC    F'53460'                                                         
         SPACE 1                                                                
         DC    AL2(326,32,0,0,0,0) 07/01/06-06/30/07                            
         DC    4A(0)                                                            
         DC    F'54525'                                                         
         SPACE 1                                                                
         DC    AL2(327,32,0,0,0,0) 07/01/07-06/30/08                            
         DC    4A(0)                                                            
         DC    F'55620'                                                         
         SPACE 1                                                                
         DC    AL2(328,32,0,0,0,0) 07/01/08-06/30/09                            
         DC    4A(0)                                                            
         DC    F'57285'                                                         
         SPACE 1                                                                
         DC    AL2(329,32,0,0,0,0) 07/01/09-06/30/11                            
         DC    4A(0)                                                            
         DC    F'59010'                                                         
         SPACE 1                                                                
*                                                                               
*                                  DIRECTORS RESIDUALS GROSS >13K               
*                                                                               
SDR13TBL DS    0H                  SDR GROSS>13K:                               
         DC    AL2(350,32,0,0,0,0) 08/01/79-07/31/80                            
         DC    4A(0)                                                            
         DC    F'10000'                                                         
         SPACE 1                                                                
         DC    AL2(351,32,0,0,0,0) 08/01/80-06/30/81                            
         DC    4A(0)                                                            
         DC    F'10750'                                                         
         SPACE 1                                                                
         DC    AL2(352,32,0,0,0,0) 07/01/81-06/30/82                            
         DC    4A(0)                                                            
         DC    F'12040'                                                         
         SPACE 1                                                                
         DC    AL2(353,32,0,0,0,0) 07/01/82-06/30/83                            
         DC    4A(0)                                                            
         DC    F'13480'                                                         
         SPACE 1                                                                
         DC    AL2(354,32,0,0,0,0) 07/01/83-06/30/84                            
         DC    4A(0)                                                            
         DC    F'14960'                                                         
         SPACE 1                                                                
         DC    AL2(355,32,0,0,0,0) 07/01/84-06/30/85                            
         DC    4A(0)                                                            
         DC    F'16000'                                                         
         SPACE 1                                                                
         DC    AL2(356,32,0,0,0,0) 07/01/85-06/30/86                            
         DC    4A(0)                                                            
         DC    F'17000'                                                         
         SPACE 1                                                                
         DC    AL2(357,32,0,0,0,0) 07/01/86-06/30/87                            
         DC    4A(0)                                                            
         DC    F'18250'                                                         
         SPACE 1                                                                
         DC    AL2(358,32,0,0,0,0) 07/01/87-12/31/88                            
         DC    4A(0)                                                            
         DC    F'19160'                                                         
         SPACE 1                                                                
         DC    AL2(359,32,0,0,0,0) 01/01/89-06/30/90                            
         DC    4A(0)                                                            
         DC    F'20120'                                                         
         SPACE 1                                                                
         DC    AL2(360,32,0,0,0,0) 07/01/90-06/30/91                            
         DC    4A(0)                                                            
         DC    F'20980'                                                         
         SPACE 1                                                                
         DC    AL2(361,32,0,0,0,0) 07/01/91-06/30/92                            
         DC    4A(0)                                                            
         DC    F'21920'                                                         
         SPACE 1                                                                
         DC    AL2(362,32,0,0,0,0) 07/01/92-06/30/93                            
         DC    4A(0)                                                            
         DC    F'22910'                                                         
         SPACE 1                                                                
         DC    AL2(363,32,0,0,0,0) 07/01/93-06/30/94                            
         DC    4A(0)                                                            
         DC    F'23830'                                                         
         SPACE 1                                                                
         DC    AL2(364,32,0,0,0,0) 07/01/94-06/30/95                            
         DC    4A(0)                                                            
         DC    F'24780'                                                         
         SPACE 1                                                                
         DC    AL2(365,32,0,0,0,0) 07/01/95-06/30/96                            
         DC    4A(0)                                                            
         DC    F'25770'                                                         
         SPACE 1                                                                
         DC    AL2(366,32,0,0,0,0) 07/01/96-06/30/97                            
         DC    4A(0)                                                            
         DC    F'26670'                                                         
         SPACE 1                                                                
         DC    AL2(367,32,0,0,0,0) 07/01/97-06/30/98                            
         DC    4A(0)                                                            
         DC    F'27610'                                                         
         SPACE 1                                                                
         DC    AL2(368,32,0,0,0,0) 07/01/98-06/30/99                            
         DC    4A(0)                                                            
         DC    F'28570'                                                         
         SPACE 1                                                                
         DC    AL2(369,32,0,0,0,0) 07/01/99-06/30/00                            
         DC    4A(0)                                                            
         DC    F'29710'                                                         
         SPACE 1                                                                
         DC    AL2(370,32,0,0,0,0) 07/01/00-06/30/01                            
         DC    4A(0)                                                            
         DC    F'30900'                                                         
         SPACE 1                                                                
         DC    AL2(371,32,0,0,0,0) 07/01/01-06/30/02                            
         DC    4A(0)                                                            
         DC    F'32140'                                                         
         SPACE 1                                                                
         DC    AL2(372,32,0,0,0,0) 07/01/02-06/30/03                            
         DC    4A(0)                                                            
         DC    F'33100'                                                         
         SPACE 1                                                                
         DC    AL2(373,32,0,0,0,0) 07/01/03-06/30/04                            
         DC    4A(0)                                                            
         DC    F'34090'                                                         
         SPACE 1                                                                
         DC    AL2(374,32,0,0,0,0) 07/01/04-06/30/05                            
         DC    4A(0)                                                            
         DC    F'34940'                                                         
         SPACE 1                                                                
         DC    AL2(375,32,0,0,0,0) 07/01/05-06/30/06                            
         DC    4A(0)                                                            
         DC    F'35640'                                                         
         SPACE 1                                                                
         DC    AL2(376,32,0,0,0,0) 07/01/06-06/30/07                            
         DC    4A(0)                                                            
         DC    F'36350'                                                         
         SPACE 1                                                                
         DC    AL2(377,32,0,0,0,0) 07/01/07-06/30/08                            
         DC    4A(0)                                                            
         DC    F'37080'                                                         
         SPACE 1                                                                
         DC    AL2(378,32,0,0,0,0) 07/01/08-06/30/09                            
         DC    4A(0)                                                            
         DC    F'38190'                                                         
         SPACE 1                                                                
         DC    AL2(379,32,0,0,0,0) 07/01/09-06/30/11                            
         DC    4A(0)                                                            
         DC    F'39340'                                                         
         EJECT                                                                  
*                                                                               
*                                  DIRECTORS RESIDUALS (1/2/HOUR)               
*                                                                               
SDHINTBL DS    0H                  SDH INI PYMNT:                               
         DC    AL2(400,32,0,0,0,0) 08/01/79-08/01/80                            
         DC    4A(0)                                                            
         DC    F'8550'                                                          
         SPACE 1                                                                
         DC    AL2(401,32,0,0,0,0) 08/01/80-06/30/81                            
         DC    4A(0)                                                            
         DC    F'9225'                                                          
         SPACE 1                                                                
         DC    AL2(402,32,0,0,0,0) 07/01/81-06/30/82                            
         DC    4A(0)                                                            
         DC    F'10335'                                                         
         SPACE 1                                                                
         DC    AL2(403,32,0,0,0,0) 07/01/82-06/30/83                            
         DC    4A(0)                                                            
         DC    F'11580'                                                         
         SPACE 1                                                                
         DC    AL2(404,32,0,0,0,0) 07/01/83-06/30/84                            
         DC    4A(0)                                                            
         DC    F'12855'                                                         
         SPACE 1                                                                
         DC    AL2(405,32,0,0,0,0) 07/01/84-06/30/85                            
         DC    4A(0)                                                            
         DC    F'13755'                                                         
         SPACE 1                                                                
         DC    AL2(406,32,0,0,0,0) 07/01/85-06/30/86                            
         DC    4A(0)                                                            
         DC    F'14610'                                                         
         SPACE 1                                                                
         DC    AL2(407,32,0,0,0,0) 07/01/86-06/30/87                            
         DC    4A(0)                                                            
         DC    F'15690'                                                         
         SPACE 1                                                                
         DC    AL2(408,32,0,0,0,0) 07/01/87-12/31/88                            
         DC    4A(0)                                                            
         DC    F'16470'                                                         
         SPACE 1                                                                
         DC    AL2(409,32,0,0,0,0) 01/01/89-06/30/90                            
         DC    4A(0)                                                            
         DC    F'17295'                                                         
         SPACE 1                                                                
         DC    AL2(410,32,0,0,0,0) 07/01/90-06/30/91                            
         DC    4A(0)                                                            
         DC    F'18030'                                                         
         SPACE 1                                                                
         DC    AL2(411,32,0,0,0,0) 07/01/91-06/30/92                            
         DC    4A(0)                                                            
         DC    F'18840'                                                         
         SPACE 1                                                                
         DC    AL2(412,32,0,0,0,0) 07/01/92-06/30/93                            
         DC    4A(0)                                                            
         DC    F'19695'                                                         
         SPACE 1                                                                
         DC    AL2(413,32,0,0,0,0) 07/01/93-06/30/94                            
         DC    4A(0)                                                            
         DC    F'20490'                                                         
         SPACE 1                                                                
         DC    AL2(414,32,0,0,0,0) 07/01/94-06/30/95                            
         DC    4A(0)                                                            
         DC    F'21300'                                                         
         SPACE 1                                                                
         DC    AL2(415,32,0,0,0,0) 07/01/95-06/30/96                            
         DC    4A(0)                                                            
         DC    F'22155'                                                         
         SPACE 1                                                                
         DC    AL2(416,32,0,0,0,0) 07/01/96-06/30/97                            
         DC    4A(0)                                                            
         DC    F'22935'                                                         
         SPACE 1                                                                
         DC    AL2(417,32,0,0,0,0) 07/01/97-06/30/98                            
         DC    4A(0)                                                            
         DC    F'23745'                                                         
         SPACE 1                                                                
         DC    AL2(418,32,0,0,0,0) 07/01/98-06/30/99                            
         DC    4A(0)                                                            
         DC    F'24570'                                                         
         SPACE 1                                                                
         DC    AL2(419,32,0,0,0,0) 07/01/99-06/30/00                            
         DC    4A(0)                                                            
         DC    F'25560'                                                         
         SPACE 1                                                                
         DC    AL2(420,32,0,0,0,0) 07/01/00-06/30/01                            
         DC    4A(0)                                                            
         DC    F'26580'                                                         
         SPACE 1                                                                
         DC    AL2(421,32,0,0,0,0) 07/01/01-06/30/02                            
         DC    4A(0)                                                            
         DC    F'27645'                                                         
         SPACE 1                                                                
         DC    AL2(422,32,0,0,0,0) 07/01/02-06/30/03                            
         DC    4A(0)                                                            
         DC    F'28470'                                                         
         SPACE 1                                                                
         DC    AL2(423,32,0,0,0,0) 07/01/03-06/30/04                            
         DC    4A(0)                                                            
         DC    F'29325'                                                         
         SPACE 1                                                                
         DC    AL2(424,32,0,0,0,0) 07/01/04-06/30/05                            
         DC    4A(0)                                                            
         DC    F'30045'                                                         
         SPACE 1                                                                
         DC    AL2(425,32,0,0,0,0) 07/01/05-06/30/06                            
         DC    4A(0)                                                            
         DC    F'30645'                                                         
         SPACE 1                                                                
         DC    AL2(426,32,0,0,0,0) 07/01/06-06/30/07                            
         DC    4A(0)                                                            
         DC    F'31260'                                                         
         SPACE 1                                                                
         DC    AL2(427,32,0,0,0,0) 07/01/07-06/30/08                            
         DC    4A(0)                                                            
         DC    F'31890'                                                         
         SPACE 1                                                                
*                                                                               
*                                  DIRECTORS RESIDUALS (1/2 HOUR)               
*                                                                               
SDH7TBL  DS    0H                  SDH GROSS>7K:                                
         DC    AL2(450,32,0,0,0,0) 08/01/79-07/31/80                            
         DC    4A(0)                                                            
         DC    F'5700'                                                          
         SPACE 1                                                                
         DC    AL2(451,32,0,0,0,0) 08/01/80-06/30/81                            
         DC    4A(0)                                                            
         DC    F'6150'                                                          
         SPACE 1                                                                
         DC    AL2(452,32,0,0,0,0) 07/01/81-06/30/82                            
         DC    4A(0)                                                            
         DC    F'6890'                                                          
         SPACE 1                                                                
         DC    AL2(453,32,0,0,0,0) 07/01/82-06/30/83                            
         DC    4A(0)                                                            
         DC    F'7720'                                                          
         SPACE 1                                                                
         DC    AL2(454,32,0,0,0,0) 07/01/83-06/30/84                            
         DC    4A(0)                                                            
         DC    F'8570'                                                          
         SPACE 1                                                                
         DC    AL2(455,32,0,0,0,0) 07/01/84-06/30/85                            
         DC    4A(0)                                                            
         DC    F'9170'                                                          
         SPACE 1                                                                
         DC    AL2(456,32,0,0,0,0) 07/01/85-06/30/86                            
         DC    4A(0)                                                            
         DC    F'9740'                                                          
         SPACE 1                                                                
         DC    AL2(457,32,0,0,0,0) 07/01/86-06/30/87                            
         DC    4A(0)                                                            
         DC    F'10460'                                                         
         SPACE 1                                                                
         DC    AL2(458,32,0,0,0,0) 07/01/87-12/31/88                            
         DC    4A(0)                                                            
         DC    F'10980'                                                         
         SPACE 1                                                                
         DC    AL2(459,32,0,0,0,0) 01/01/89-06/30/90                            
         DC    4A(0)                                                            
         DC    F'11530'                                                         
         SPACE 1                                                                
         DC    AL2(460,32,0,0,0,0) 07/01/90-06/30/91                            
         DC    4A(0)                                                            
         DC    F'12020'                                                         
         SPACE 1                                                                
         DC    AL2(461,32,0,0,0,0) 07/01/91-06/30/92                            
         DC    4A(0)                                                            
         DC    F'12560'                                                         
         SPACE 1                                                                
         DC    AL2(462,32,0,0,0,0) 07/01/92-06/30/93                            
         DC    4A(0)                                                            
         DC    F'13130'                                                         
         SPACE 1                                                                
         DC    AL2(463,32,0,0,0,0) 07/01/93-06/30/94                            
         DC    4A(0)                                                            
         DC    F'13660'                                                         
         SPACE 1                                                                
         DC    AL2(464,32,0,0,0,0) 07/01/94-06/30/95                            
         DC    4A(0)                                                            
         DC    F'14200'                                                         
         SPACE 1                                                                
         DC    AL2(465,32,0,0,0,0) 07/01/95-06/30/96                            
         DC    4A(0)                                                            
         DC    F'14770'                                                         
         SPACE 1                                                                
         DC    AL2(466,32,0,0,0,0) 07/01/96-06/30/97                            
         DC    4A(0)                                                            
         DC    F'15290'                                                         
         SPACE 1                                                                
         DC    AL2(467,32,0,0,0,0) 07/01/97-06/30/98                            
         DC    4A(0)                                                            
         DC    F'15830'                                                         
         SPACE 1                                                                
         DC    AL2(468,32,0,0,0,0) 07/01/98-06/30/99                            
         DC    4A(0)                                                            
         DC    F'16380'                                                         
         SPACE 1                                                                
         DC    AL2(469,32,0,0,0,0) 07/01/99-06/30/00                            
         DC    4A(0)                                                            
         DC    F'17040'                                                         
         SPACE 1                                                                
         DC    AL2(470,32,0,0,0,0) 07/01/00-06/30/01                            
         DC    4A(0)                                                            
         DC    F'17720'                                                         
         SPACE 1                                                                
         DC    AL2(471,32,0,0,0,0) 07/01/01-06/30/02                            
         DC    4A(0)                                                            
         DC    F'18430'                                                         
         SPACE 1                                                                
         DC    AL2(472,32,0,0,0,0) 07/01/02-06/30/03                            
         DC    4A(0)                                                            
         DC    F'18980'                                                         
         SPACE 1                                                                
         DC    AL2(473,32,0,0,0,0) 07/01/03-06/30/04                            
         DC    4A(0)                                                            
         DC    F'19550'                                                         
         SPACE 1                                                                
         DC    AL2(474,32,0,0,0,0) 07/01/04-06/30/05                            
         DC    4A(0)                                                            
         DC    F'20030'                                                         
         SPACE 1                                                                
         DC    AL2(475,32,0,0,0,0) 07/01/05-06/30/06                            
         DC    4A(0)                                                            
         DC    F'20430'                                                         
         SPACE 1                                                                
         DC    AL2(476,32,0,0,0,0) 07/01/06-06/30/07                            
         DC    4A(0)                                                            
         DC    F'20840'                                                         
         SPACE 1                                                                
         DC    AL2(477,32,0,0,0,0) 07/01/07-06/30/08                            
         DC    4A(0)                                                            
         DC    F'21260'                                                         
         EJECT                                                                  
*                                                                               
*                                  WRITERS RESIDUALS                            
*                                                                               
SWRINTBL DS    0H                  SWR INI PYMNT:                               
         DC    AL2(500,28,0,0,0,0) 03/02/79-03/01/80                            
         DC    3A(0)                                                            
         DC    F'25152'                                                         
         SPACE 1                                                                
         DC    AL2(501,28,0,0,0,0) 03/02/80-03/01/81                            
         DC    3A(0)                                                            
         DC    F'27417'                                                         
         SPACE 1                                                                
         DC    AL2(502,28,0,0,0,0) 03/02/81-06/30/82                            
         DC    3A(0)                                                            
         DC    F'30708'                                                         
         SPACE 1                                                                
         DC    AL2(503,28,0,0,0,0) 07/01/82-06/30/83                            
         DC    3A(0)                                                            
         DC    F'34392'                                                         
         SPACE 1                                                                
         DC    AL2(504,28,0,0,0,0) 07/01/83-06/30/84                            
         DC    3A(0)                                                            
         DC    F'38175'                                                         
         SPACE 1                                                                
         DC    AL2(505,28,0,0,0,0) 07/01/84-02/28/85                            
         DC    3A(0)                                                            
         DC    F'41610'                                                         
         SPACE 1                                                                
         DC    AL2(506,28,0,0,0,0) 03/01/85-02/28/86                            
         DC    3A(0)                                                            
         DC    F'44106'                                                         
         SPACE 1                                                                
         DC    AL2(507,28,0,0,0,0) 03/01/86-02/28/87                            
         DC    3A(0)                                                            
         DC    F'46752'                                                         
         SPACE 1                                                                
         DC    AL2(508,28,0,0,0,0) 03/01/87-03/04/88                            
         DC    3A(0)                                                            
         DC    F'49557'                                                         
         SPACE 1                                                                
         DC    AL2(509,28,0,0,0,0) 08/08/88-08/31/89                            
         DC    3A(0)                                                            
         DC    F'52035'                                                         
         SPACE 1                                                                
         DC    AL2(510,28,0,0,0,0) 09/01/89-02/28/91                            
         DC    3A(0)                                                            
         DC    F'54378'                                                         
         SPACE 1                                                                
         DC    AL2(511,28,0,0,0,0) 03/01/91-05/01/92                            
         DC    3A(0)                                                            
         DC    F'56823'                                                         
         SPACE 1                                                                
         DC    AL2(512,28,0,0,0,0) 05/02/92-05/01/93                            
         DC    3A(0)                                                            
         DC    F'59379'                                                         
         SPACE 1                                                                
         DC    AL2(513,28,0,0,0,0) 05/02/93-05/01/94                            
         DC    3A(0)                                                            
         DC    F'62052'                                                         
         SPACE 1                                                                
         DC    AL2(514,28,0,0,0,0) 05/02/94-05/01/95                            
         DC    3A(0)                                                            
         DC    F'64845'                                                         
         SPACE 1                                                                
         DC    AL2(515,28,0,0,0,0) 05/02/95-05/01/96                            
         DC    3A(0)                                                            
         DC    F'66789'                                                         
         SPACE 1                                                                
         DC    AL2(516,28,0,0,0,0) 05/02/96-05/01/97                            
         DC    3A(0)                                                            
         DC    F'69126'                                                         
         SPACE 1                                                                
         DC    AL2(517,28,0,0,0,0) 05/02/97-05/01/98                            
         DC    3A(0)                                                            
         DC    F'71892'                                                         
         SPACE 1                                                                
         DC    AL2(518,28,0,0,0,0) 05/02/98-05/01/99                            
         DC    3A(0)                                                            
         DC    F'74409'                                                         
         SPACE 1                                                                
         DC    AL2(519,28,0,0,0,0) 05/02/99-05/01/00                            
         DC    3A(0)                                                            
         DC    F'77013'                                                         
         SPACE 1                                                                
         DC    AL2(520,28,0,0,0,0) 05/02/00-05/01/01                            
         DC    3A(0)                                                            
         DC    F'79707'                                                         
         SPACE 1                                                                
         DC    AL2(521,28,0,0,0,0) 05/02/01-05/01/02                            
         DC    3A(0)                                                            
         DC    F'82497'                                                         
         SPACE 1                                                                
         DC    AL2(522,28,0,0,0,0) 05/02/02-05/01/03                            
         DC    3A(0)                                                            
         DC    F'84972'                                                         
         SPACE 1                                                                
         DC    AL2(523,28,0,0,0,0) 05/02/03-05/01/04                            
         DC    3A(0)                                                            
         DC    F'87521'                                                         
         SPACE 1                                                                
         DC    AL2(524,28,0,0,0,0) 05/02/04-10/31/04                            
         DC    3A(0)                                                            
         DC    F'87521'                                                         
         SPACE 1                                                                
         DC    AL2(525,28,0,0,0,0) 11/01/04-10/31/05                            
         DC    3A(0)                                                            
         DC    F'90147'                                                         
         SPACE 1                                                                
         DC    AL2(526,28,0,0,0,0) 11/01/05-10/31/06                            
         DC    3A(0)                                                            
         DC    F'92850'                                                         
         SPACE 1                                                                
         DC    AL2(527,28,0,0,0,0) 11/01/06-10/31/07                            
         DC    3A(0)                                                            
         DC    F'95637'                                                         
         SPACE 1                                                                
         DC    AL2(528,28,0,0,0,0) 02/13/08-05/01/09                            
         DC    3A(0)                                                            
         DC    F'98985'                                                         
         SPACE 1                                                                
         DC    AL2(529,28,0,0,0,0) 05/02/09-05/01/10                            
         DC    3A(0)                                                            
         DC    F'102450'                                                        
         SPACE 1                                                                
         DC    AL2(530,28,0,0,0,0) 05/02/10-05/01/11                            
         DC    3A(0)                                                            
         DC    F'106035'                                                        
         SPACE 1                                                                
         DC    AL2(531,28,0,0,0,0) 05/02/11-05/01/12                            
         DC    3A(0)                                                            
         DC    F'108155'                                                        
         SPACE 1                                                                
*                                  WRITERS RESIDUALS                            
*                                                                               
SWR13TBL DS    0H                  SWR GROSS>13K:                               
         DC    AL2(550,28,0,0,0,0) 03/02/79-03/01/80                            
         DC    3A(0)                                                            
         DC    F'16768'                                                         
         SPACE 1                                                                
         DC    AL2(551,28,0,0,0,0) 03/02/80-03/01/81                            
         DC    3A(0)                                                            
         DC    F'18278'                                                         
         SPACE 1                                                                
         DC    AL2(552,28,0,0,0,0) 03/02/81-06/30/82                            
         DC    3A(0)                                                            
         DC    F'20472'                                                         
         SPACE 1                                                                
         DC    AL2(553,28,0,0,0,0) 07/01/82-06/30/83                            
         DC    3A(0)                                                            
         DC    F'22928'                                                         
         SPACE 1                                                                
         DC    AL2(554,28,0,0,0,0) 07/01/83-06/30/84                            
         DC    3A(0)                                                            
         DC    F'25450'                                                         
         SPACE 1                                                                
         DC    AL2(555,28,0,0,0,0) 07/01/84-02/28/85                            
         DC    3A(0)                                                            
         DC    F'27740'                                                         
         SPACE 1                                                                
         DC    AL2(556,28,0,0,0,0) 03/01/85-02/28/86                            
         DC    3A(0)                                                            
         DC    F'29404'                                                         
         SPACE 1                                                                
         DC    AL2(557,28,0,0,0,0) 03/01/86-02/28/87                            
         DC    3A(0)                                                            
         DC    F'31168'                                                         
         SPACE 1                                                                
         DC    AL2(558,28,0,0,0,0) 03/01/87-03/04/88                            
         DC    3A(0)                                                            
         DC    F'33038'                                                         
         SPACE 1                                                                
         DC    AL2(559,28,0,0,0,0) 08/08/88-08/31/89                            
         DC    3A(0)                                                            
         DC    F'34690'                                                         
         SPACE 1                                                                
         DC    AL2(560,28,0,0,0,0) 09/01/89-02/28/91                            
         DC    3A(0)                                                            
         DC    F'36252'                                                         
         SPACE 1                                                                
         DC    AL2(561,28,0,0,0,0) 03/01/91-05/01/92                            
         DC    3A(0)                                                            
         DC    F'37882'                                                         
         SPACE 1                                                                
         DC    AL2(562,28,0,0,0,0) 05/02/92-05/01/93                            
         DC    3A(0)                                                            
         DC    F'39586'                                                         
         SPACE 1                                                                
         DC    AL2(563,28,0,0,0,0) 05/02/93-05/01/94                            
         DC    3A(0)                                                            
         DC    F'41368'                                                         
         SPACE 1                                                                
         DC    AL2(564,28,0,0,0,0) 05/02/94-05/01/95                            
         DC    3A(0)                                                            
         DC    F'43230'                                                         
         SPACE 1                                                                
         DC    AL2(565,28,0,0,0,0) 05/02/95-05/01/96                            
         DC    3A(0)                                                            
         DC    F'44526'                                                         
         SPACE 1                                                                
         DC    AL2(566,28,0,0,0,0) 05/02/96-05/01/97                            
         DC    3A(0)                                                            
         DC    F'46086'                                                         
         SPACE 1                                                                
         DC    AL2(567,28,0,0,0,0) 05/02/97-05/01/98                            
         DC    3A(0)                                                            
         DC    F'47928'                                                         
         SPACE 1                                                                
         DC    AL2(568,28,0,0,0,0) 05/02/98-05/01/99                            
         DC    3A(0)                                                            
         DC    F'49606'                                                         
         SPACE 1                                                                
         DC    AL2(569,28,0,0,0,0) 05/02/99-05/01/00                            
         DC    3A(0)                                                            
         DC    F'51342'                                                         
         SPACE 1                                                                
         DC    AL2(570,28,0,0,0,0) 05/02/00-05/01/01                            
         DC    3A(0)                                                            
         DC    F'53138'                                                         
         SPACE 1                                                                
         DC    AL2(571,28,0,0,0,0) 05/02/01-05/01/02                            
         DC    3A(0)                                                            
         DC    F'54998'                                                         
         SPACE 1                                                                
         DC    AL2(572,28,0,0,0,0) 05/02/02-05/01/03                            
         DC    3A(0)                                                            
         DC    F'56648'                                                         
         SPACE 1                                                                
         DC    AL2(573,28,0,0,0,0) 05/02/03-05/01/04                            
         DC    3A(0)                                                            
         DC    F'58348'                                                         
         SPACE 1                                                                
         DC    AL2(574,28,0,0,0,0) 05/02/04-10/31/04                            
         DC    3A(0)                                                            
         DC    F'58348'                                                         
         SPACE 1                                                                
         DC    AL2(575,28,0,0,0,0) 11/01/04-10/31/05                            
         DC    3A(0)                                                            
         DC    F'60098'                                                         
         SPACE 1                                                                
         DC    AL2(576,28,0,0,0,0) 11/01/05-10/31/06                            
         DC    3A(0)                                                            
         DC    F'61900'                                                         
         SPACE 1                                                                
         DC    AL2(577,28,0,0,0,0) 11/01/06-10/31/07                            
         DC    3A(0)                                                            
         DC    F'63758'                                                         
         SPACE 1                                                                
         DC    AL2(578,28,0,0,0,0) 02/13/08-05/01/09                            
         DC    3A(0)                                                            
         DC    F'65990'                                                         
         SPACE 1                                                                
         DC    AL2(579,28,0,0,0,0) 05/02/09-05/01/10                            
         DC    3A(0)                                                            
         DC    F'68300'                                                         
         SPACE 1                                                                
         DC    AL2(580,28,0,0,0,0) 05/02/10-05/01/11                            
         DC    3A(0)                                                            
         DC    F'70690'                                                         
         SPACE 1                                                                
         DC    AL2(581,28,0,0,0,0) 05/02/11-05/01/12                            
         DC    3A(0)                                                            
         DC    F'72103'                                                         
*                                                                               
*                                  WRITERS RESIDUALS (1/2 HOUR)                 
*                                                                               
SWHINTBL DS    0H                  SWH INI PYMNT:                               
         DC    AL2(600,28,0,0,0,0) 03/02/79-03/01/80                            
         DC    3A(0)                                                            
         DC    F'13596'                                                         
         SPACE 1                                                                
         DC    AL2(601,28,0,0,0,0) 03/02/80-03/01/81                            
         DC    3A(0)                                                            
         DC    F'14820'                                                         
         SPACE 1                                                                
         DC    AL2(602,28,0,0,0,0) 03/02/81-06/30/82                            
         DC    3A(0)                                                            
         DC    F'16599'                                                         
         SPACE 1                                                                
         DC    AL2(603,28,0,0,0,0) 07/01/82-06/30/83                            
         DC    3A(0)                                                            
         DC    F'18591'                                                         
         SPACE 1                                                                
         DC    AL2(604,28,0,0,0,0) 07/01/83-06/30/84                            
         DC    3A(0)                                                            
         DC    F'20634'                                                         
         SPACE 1                                                                
         DC    AL2(605,28,0,0,0,0) 07/01/84-02/28/85                            
         DC    3A(0)                                                            
         DC    F'22491'                                                         
         SPACE 1                                                                
         DC    AL2(606,28,0,0,0,0) 03/01/85-02/28/86                            
         DC    3A(0)                                                            
         DC    F'23844'                                                         
         SPACE 1                                                                
         DC    AL2(607,28,0,0,0,0) 03/01/86-02/28/87                            
         DC    3A(0)                                                            
         DC    F'25275'                                                         
         SPACE 1                                                                
         DC    AL2(608,28,0,0,0,0) 03/01/87-03/04/88                            
         DC    3A(0)                                                            
         DC    F'26790'                                                         
         SPACE 1                                                                
         DC    AL2(609,28,0,0,0,0) 08/08/88-08/31/89                            
         DC    3A(0)                                                            
         DC    F'28131'                                                         
         SPACE 1                                                                
         DC    AL2(610,28,0,0,0,0) 09/01/89-02/28/91                            
         DC    3A(0)                                                            
         DC    F'29397'                                                         
         SPACE 1                                                                
         DC    AL2(611,28,0,0,0,0) 03/01/91-05/01/92                            
         DC    3A(0)                                                            
         DC    F'30720'                                                         
         SPACE 1                                                                
         DC    AL2(612,28,0,0,0,0) 05/02/92-05/01/93                            
         DC    3A(0)                                                            
         DC    F'32100'                                                         
         SPACE 1                                                                
         DC    AL2(613,28,0,0,0,0) 05/02/93-05/01/94                            
         DC    3A(0)                                                            
         DC    F'33546'                                                         
         SPACE 1                                                                
         DC    AL2(614,28,0,0,0,0) 05/02/94-05/01/95                            
         DC    3A(0)                                                            
         DC    F'35055'                                                         
         SPACE 1                                                                
         DC    AL2(615,28,0,0,0,0) 05/02/95-05/01/96                            
         DC    3A(0)                                                            
         DC    F'36108'                                                         
         SPACE 1                                                                
         DC    AL2(616,28,0,0,0,0) 05/02/96-05/01/97                            
         DC    3A(0)                                                            
         DC    F'37371'                                                         
         SPACE 1                                                                
         DC    AL2(617,28,0,0,0,0) 05/02/97-05/01/98                            
         DC    3A(0)                                                            
         DC    F'38865'                                                         
         SPACE 1                                                                
         DC    AL2(618,28,0,0,0,0) 05/02/98-05/01/99                            
         DC    3A(0)                                                            
         DC    F'40224'                                                         
         SPACE 1                                                                
         DC    AL2(619,28,0,0,0,0) 05/02/99-05/01/00                            
         DC    3A(0)                                                            
         DC    F'41631'                                                         
         SPACE 1                                                                
         DC    AL2(620,28,0,0,0,0) 05/02/00-05/01/01                            
         DC    3A(0)                                                            
         DC    F'43089'                                                         
         SPACE 1                                                                
         DC    AL2(621,28,0,0,0,0) 05/02/01-05/01/02                            
         DC    3A(0)                                                            
         DC    F'44598'                                                         
         SPACE 1                                                                
         DC    AL2(622,28,0,0,0,0) 05/02/02-05/01/03                            
         DC    3A(0)                                                            
         DC    F'45936'                                                         
         SPACE 1                                                                
         DC    AL2(623,28,0,0,0,0) 05/02/03-05/01/04                            
         DC    3A(0)                                                            
         DC    F'47313'                                                         
         SPACE 1                                                                
         DC    AL2(624,28,0,0,0,0) 05/02/04-10/31/04                            
         DC    3A(0)                                                            
         DC    F'47313'                                                         
         SPACE 1                                                                
         DC    AL2(625,28,0,0,0,0) 11/01/04-10/31/05                            
         DC    3A(0)                                                            
         DC    F'48732'                                                         
         SPACE 1                                                                
         DC    AL2(626,28,0,0,0,0) 11/01/05-10/31/06                            
         DC    3A(0)                                                            
         DC    F'50194'                                                         
         SPACE 1                                                                
         DC    AL2(627,28,0,0,0,0) 11/01/06-10/31/07                            
         DC    3A(0)                                                            
         DC    F'51700'                                                         
         SPACE 1                                                                
*                                                                               
*                                  WRITERS RESIDUALS (1/2 HOUR)                 
*                                                                               
SWH7TBL  DS    0H                  SWH GROSS>7K:                                
         DC    AL2(650,28,0,0,0,0) 03/02/79-03/01/80                            
         DC    3A(0)                                                            
         DC    F'9064'                                                          
         SPACE 1                                                                
         DC    AL2(651,28,0,0,0,0) 03/02/80-03/01/81                            
         DC    3A(0)                                                            
         DC    F'9880'                                                          
         SPACE 1                                                                
         DC    AL2(652,28,0,0,0,0) 03/02/81-06/30/82                            
         DC    3A(0)                                                            
         DC    F'11066'                                                         
         SPACE 1                                                                
         DC    AL2(653,28,0,0,0,0) 07/01/82-06/30/83                            
         DC    3A(0)                                                            
         DC    F'12394'                                                         
         SPACE 1                                                                
         DC    AL2(654,28,0,0,0,0) 07/01/83-06/30/84                            
         DC    3A(0)                                                            
         DC    F'13756'                                                         
         SPACE 1                                                                
         DC    AL2(655,28,0,0,0,0) 07/01/84-02/28/85                            
         DC    3A(0)                                                            
         DC    F'14994'                                                         
         SPACE 1                                                                
         DC    AL2(656,28,0,0,0,0) 03/01/85-02/28/86                            
         DC    3A(0)                                                            
         DC    F'15896'                                                         
         SPACE 1                                                                
         DC    AL2(657,28,0,0,0,0) 03/01/86-02/28/87                            
         DC    3A(0)                                                            
         DC    F'16850'                                                         
         SPACE 1                                                                
         DC    AL2(658,28,0,0,0,0) 03/01/87-03/04/88                            
         DC    3A(0)                                                            
         DC    F'17860'                                                         
         SPACE 1                                                                
         DC    AL2(659,28,0,0,0,0) 08/08/88-08/31/89                            
         DC    3A(0)                                                            
         DC    F'18754'                                                         
         SPACE 1                                                                
         DC    AL2(660,28,0,0,0,0) 09/01/89-02/28/91                            
         DC    3A(0)                                                            
         DC    F'19598'                                                         
         SPACE 1                                                                
         DC    AL2(661,28,0,0,0,0) 03/01/91-05/01/92                            
         DC    3A(0)                                                            
         DC    F'20480'                                                         
         SPACE 1                                                                
         DC    AL2(662,28,0,0,0,0) 05/02/92-05/01/93                            
         DC    3A(0)                                                            
         DC    F'21400'                                                         
         SPACE 1                                                                
         DC    AL2(663,28,0,0,0,0) 05/02/93-05/01/94                            
         DC    3A(0)                                                            
         DC    F'22364'                                                         
         SPACE 1                                                                
         DC    AL2(664,28,0,0,0,0) 05/02/94-05/01/95                            
         DC    3A(0)                                                            
         DC    F'23370'                                                         
         SPACE 1                                                                
         DC    AL2(665,28,0,0,0,0) 05/02/95-05/01/96                            
         DC    3A(0)                                                            
         DC    F'24072'                                                         
         SPACE 1                                                                
         DC    AL2(666,28,0,0,0,0) 05/02/96-05/01/97                            
         DC    3A(0)                                                            
         DC    F'24914'                                                         
         SPACE 1                                                                
         DC    AL2(667,28,0,0,0,0) 05/02/97-05/01/98                            
         DC    3A(0)                                                            
         DC    F'25910'                                                         
         SPACE 1                                                                
         DC    AL2(668,28,0,0,0,0) 05/02/98-05/01/99                            
         DC    3A(0)                                                            
         DC    F'26816'                                                         
         SPACE 1                                                                
         DC    AL2(669,28,0,0,0,0) 05/02/99-05/01/00                            
         DC    3A(0)                                                            
         DC    F'27754'                                                         
         SPACE 1                                                                
         DC    AL2(670,28,0,0,0,0) 05/02/00-05/01/01                            
         DC    3A(0)                                                            
         DC    F'28726'                                                         
         SPACE 1                                                                
         DC    AL2(671,28,0,0,0,0) 05/02/01-05/01/02                            
         DC    3A(0)                                                            
         DC    F'29732'                                                         
         SPACE 1                                                                
         DC    AL2(672,28,0,0,0,0) 05/02/02-05/01/03                            
         DC    3A(0)                                                            
         DC    F'30624'                                                         
         SPACE 1                                                                
         DC    AL2(673,28,0,0,0,0) 05/02/03-05/01/04                            
         DC    3A(0)                                                            
         DC    F'31542'                                                         
         SPACE 1                                                                
         DC    AL2(674,28,0,0,0,0) 05/02/04-10/31/04                            
         DC    3A(0)                                                            
         DC    F'31542'                                                         
         SPACE 1                                                                
         DC    AL2(675,28,0,0,0,0) 11/01/04-10/31/05                            
         DC    3A(0)                                                            
         DC    F'32488'                                                         
         SPACE 1                                                                
         DC    AL2(676,28,0,0,0,0) 11/01/05-10/31/06                            
         DC    3A(0)                                                            
         DC    F'33463'                                                         
         SPACE 1                                                                
         DC    AL2(677,28,0,0,0,0) 11/01/06-10/31/07                            
         DC    3A(0)                                                            
         DC    F'34467'                                                         
         SPACE 1                                                                
         DC    X'FF'               *** END OF USE RATE TABLES ***               
         EJECT                                                                  
*              USE LOOK UP TABLES                                               
         SPACE 2                                                                
USELUT   DS    0CL5                SOAP RESIDUALS                               
         DC    AL2(00),AL1(USOR,USOR1,ALL,0,0,0,TV)  SOR AREA 1                 
         DC    AL2(50),AL1(USOR,USOR2,ALL,0,0,0,TV)      AREA 2                 
         DC    AL2(100),AL1(USOR,USOR3,ALL,0,0,0,TV)     AREA 3                 
         DC    AL2(100),AL1(USOR,USOR4,ALL,0,0,0,TV)     AREA 4                 
         DC    AL2(100),AL1(USOR,USOR5,ALL,0,0,0,TV)     AREA 5                 
*                                  SOAP RESIDUALS (1/2 HOUR)                    
         DC    AL2(150),AL1(USRH,USRH1,ALL,0,0,0,TV) SRH AREA 1                 
         DC    AL2(200),AL1(USRH,USRH2,ALL,0,0,0,TV)     AREA 2                 
         DC    AL2(250),AL1(USRH,USRH3,ALL,0,0,0,TV)     AREA 3                 
         DC    AL2(250),AL1(USRH,USRH4,ALL,0,0,0,TV)     AREA 4                 
         DC    AL2(250),AL1(USRH,USRH5,ALL,0,0,0,TV)     AREA 5                 
*                                                                               
*                                  DIRECTORS RESIDUALS                          
         DC    AL2(300),AL1(USDR,USDRINIT,ALL,0,0,0,TV) SDR INIT PYMT           
         DC    AL2(350),AL1(USDR,USDR13K,ALL,0,0,0,TV)   GROSS > 13K            
         DC    AL2(350),AL1(USDR,USDR18K,ALL,0,0,0,TV)   GROSS > 18K            
*                                                                               
*                                  DIRECTORS RESIDUALS (1/2/ HOUR)              
         DC    AL2(400),AL1(USDH,USDHINIT,ALL,0,0,0,TV) SDH INIT PYMT           
         DC    AL2(450),AL1(USDH,USDH7K,ALL,0,0,0,TV)    GROSS > 7K             
         DC    AL2(450),AL1(USDH,USDH10K,ALL,0,0,0,TV)   GROSS > 10K            
*                                                                               
*                                  WRITERS RESIDUALS                            
         DC    AL2(500),AL1(USWR,USWRINIT,ALL,0,0,0,TV) SWR INIT PYMT           
         DC    AL2(550),AL1(USWR,USWR13K,ALL,0,0,0,TV)   GROSS > 13K            
         DC    AL2(550),AL1(USWR,USWR18K,ALL,0,0,0,TV)   GROSS > 18K            
*                                                                               
*                                  WRITERS RESIDUALS (1/2/ HOUR)                
         DC    AL2(600),AL1(USWH,USWHINIT,ALL,0,0,0,TV) SWH INIT PYMT           
         DC    AL2(650),AL1(USWH,USWH7K,ALL,0,0,0,TV)    GROSS > 7K             
         DC    AL2(650),AL1(USWH,USWH10K,ALL,0,0,0,TV)   GROSS > 10K            
*                                                                               
         DC    X'FF'                                                            
         EJECT                                                                  
*              AIR DATE LOOK UP TABLE                                           
         SPACE 1                                                                
AIRDLUT  DS    0CL7                                                             
         DC    X'821116831115',AL1(0)                                           
         DC    X'831116861115',AL1(1)                                           
         DC    X'861116871115',AL1(2)                                           
         DC    X'871116891115',AL1(3)                                           
         DC    X'891116901115',AL1(4)                                           
         DC    X'901116911231',AL1(5)                                           
         DC    X'920101921115',AL1(6)                                           
         DC    X'921116930311',AL1(7)                                           
         DC    X'930312931115',AL1(8)                                           
         DC    X'931116950114',AL1(9)                                           
         DC    X'950115951115',AL1(10)                                          
         DC    X'951116961115',AL1(11)                                          
         DC    X'961116971115',AL1(12)                                          
         DC    X'971116981115',AL1(13)                                          
         DC    X'981116991115',AL1(14)                                          
         DC    X'991116A01115',AL1(15)                                          
         DC    X'A01116A11115',AL1(16)                                          
         DC    X'A11116A21115',AL1(17)                                          
         DC    X'A21116A31115',AL1(18)                                          
         DC    X'A31116A41115',AL1(19)                                          
         DC    X'A41116A51115',AL1(20)                                          
         DC    X'A51116A61115',AL1(21)                                          
         DC    X'A61116A71115',AL1(22)                                          
         DC    X'A71116A81115',AL1(23)                                          
         DC    X'A81116A91115',AL1(24)                                          
         DC    X'A91116B01115',AL1(25)  LATEST CONTRACT                         
         DC    X'B01116B11115',AL1(26)  LATEST CONTRACT                         
         DC    X'FF'                                                            
         SPACE 3                                                                
*              AIR DATE LOOK UP TABLE FOR DIRECTORS                             
         SPACE 1                                                                
DAIRDLUT DS    0CL7                                                             
         DC    X'790801800731',AL1(0)                                           
         DC    X'800801810630',AL1(1)                                           
         DC    X'810701820630',AL1(2)                                           
         DC    X'820701830630',AL1(3)                                           
         DC    X'830701840630',AL1(4)                                           
         DC    X'840701850630',AL1(5)                                           
         DC    X'850701860630',AL1(6)                                           
         DC    X'860701870630',AL1(7)                                           
         DC    X'870701881231',AL1(8)                                           
         DC    X'890101900630',AL1(9)                                           
         DC    X'900701910630',AL1(10)                                          
         DC    X'910701920630',AL1(11)                                          
         DC    X'920701930630',AL1(12)                                          
         DC    X'930701940630',AL1(13)                                          
         DC    X'940701950630',AL1(14)                                          
         DC    X'950701960630',AL1(15)                                          
         DC    X'960701970630',AL1(16)                                          
         DC    X'970701980630',AL1(17)                                          
         DC    X'980701990630',AL1(18)                                          
         DC    X'990701A00630',AL1(19)                                          
         DC    X'A00701A10630',AL1(20)                                          
         DC    X'A10701A20630',AL1(21)                                          
         DC    X'A20701A30630',AL1(22)                                          
         DC    X'A30701A40630',AL1(23)                                          
         DC    X'A40701A50630',AL1(24)                                          
         DC    X'A50701A60630',AL1(25)                                          
         DC    X'A60701A70630',AL1(26)                                          
         DC    X'A70701A80630',AL1(27)                                          
         DC    X'A80701A90630',AL1(28)                                          
         DC    X'A90701FFFFFF',AL1(29)  LATEST CONTRACT                         
         DC    X'FF'                                                            
         SPACE 3                                                                
*              AIR DATE LOOK UP TABLE FOR WRITERS                               
         SPACE 1                                                                
WAIRDLUT DS    0CL7                                                             
         DC    X'790302800301',AL1(0)                                           
         DC    X'800302810301',AL1(1)                                           
         DC    X'810302820630',AL1(2)                                           
         DC    X'820701830630',AL1(3)                                           
         DC    X'830701840630',AL1(4)                                           
         DC    X'840701850228',AL1(5)                                           
         DC    X'850301850304',AL1(6)   WGA STRIKE 3/5/85-3/18/85               
         DC    X'850319860228',AL1(6)                                           
         DC    X'860301870228',AL1(7)                                           
         DC    X'870301880306',AL1(8)                                           
*                                       WGA STRIKE 3/7/88-8/7/88                
         DC    X'880808890831',AL1(9)                                           
         DC    X'890901910228',AL1(10)                                          
         DC    X'910301920501',AL1(11)                                          
         DC    X'920502930501',AL1(12)                                          
         DC    X'930502940501',AL1(13)                                          
         DC    X'940502950501',AL1(14)                                          
         DC    X'950502960501',AL1(15)                                          
         DC    X'960502970501',AL1(16)                                          
         DC    X'970502980501',AL1(17)                                          
         DC    X'980502990501',AL1(18)                                          
         DC    X'990502A00501',AL1(19)                                          
         DC    X'A00502A10501',AL1(20)                                          
         DC    X'A10502A20501',AL1(21)                                          
         DC    X'A20502A30501',AL1(22)                                          
         DC    X'A30502A40501',AL1(23)                                          
         DC    X'A40502A41031',AL1(24)                                          
         DC    X'A41101A51031',AL1(25)                                          
         DC    X'A51101A61031',AL1(26)                                          
         DC    X'A61101A71031',AL1(27)                                          
*                                       WGA STRIKE 11/5/07-2/12/08              
         DC    X'A80213A90501',AL1(28)                                          
         DC    X'A90502B00501',AL1(29)                                          
         DC    X'B00502B10501',AL1(30)                                          
         DC    X'B10502B20501',AL1(31)  LATEST CONTRACT                         
*        DC    X'SSSSSSEEEEEE',AL1(23)                                          
         DC    X'FF'                                                            
         EJECT                                                                  
*              CATEGORY COLUMN TABLES                                           
         SPACE 1                                                                
CATCOLS  DS    0CL2                                                             
         DC    AL1(1,CTP)                                                       
         DC    AL1(1,CTP2)                                                      
         DC    AL1(2,CTU5)                                                      
         DC    AL1(2,CTU52)                                                     
         DC    AL1(3,CTANN)                                                     
         DC    AL1(4,CTW)                                                       
         DC    AL1(4,CTWB)                                                      
         DC    AL1(4,CTWH)                                                      
         DC    AL1(4,CTWS)                                                      
         DC    AL1(4,CTW2)                                                      
         DC    AL1(4,CTW2B)                                                     
         DC    AL1(4,CTW2H)                                                     
         DC    AL1(4,CTW2S)                                                     
         DC    AL1(4,CTW3)                                                      
         DC    AL1(4,CTW3B)                                                     
         DC    AL1(4,CTW3H)                                                     
         DC    AL1(4,CTW3S)                                                     
         DC    AL1(5,CTAD)                                                      
         DC    AL1(5,CTDIR)                                                     
         DC    AL1(5,CTDI2)                                                     
*                                                                               
         DC    AL1(60,CTZZZ)       OTHER CATEGORY - ROW SHOULDN'T EXIST         
         DC    X'FF'                                                            
         EJECT                                                                  
*              P&H TABLE BY AIR DATES                                           
*              USING WORK DATES INSTEAD OF AIR DATES AS OF JAN/05               
         SPACE                                                                  
PNHTAB   DS    0CL8                                                             
         DC    X'B10101FFFFFF',AL2(1560)  LATEST RATE                           
         DC    X'791116801230',AL2(0775)                                        
         DC    X'800101821115',AL2(0850)                                        
         DC    X'821116860514',AL2(0900)                                        
         DC    X'860515871115',AL2(0925)                                        
         DC    X'871116881115',AL2(0950)                                        
         DC    X'881116930515',AL2(1050)                                        
         DC    X'930516941115',AL2(1100)                                        
         DC    X'941116981231',AL2(1200)                                        
         DC    X'990101A40831',AL2(1210)                                        
         DC    X'A40901A41131',AL2(1260)                                        
         DC    X'A41201A51115',AL2(1360)                                        
         DC    X'A51116A81115',AL2(1410)                                        
         DC    X'A81116A91115',AL2(1460)                                        
         DC    X'A91116B01231',AL2(1510)                                        
         DC    X'FF'                                                            
         SPACE 3                                                                
*              DIRECTORS' P&H TABLE BY AIR DATES                                
*              USING WORK DATES INSTEAD OF AIR DATES AS OF JAN/05               
         SPACE                                                                  
DPNHTAB  DS    0CL8                                                             
         DC    X'A50101FFFFFF',AL2(1400)  LATEST RATE                           
         DC    X'790801810630',AL2(0950)                                        
         DC    X'810701840630',AL2(1000)                                        
         DC    X'840701860630',AL2(1200)                                        
         DC    X'860701A40630',AL2(1250)                                        
         DC    X'A40701A41231',AL2(1300)                                        
         DC    X'FF'                                                            
         SPACE 3                                                                
*              WRITERS' P&H TABLE BY AIR DATES                                  
*              USING WORK DATES INSTEAD OF AIR DATES AS OF JAN/05               
         SPACE                                                                  
WPNHTAB  DS    0CL8                                                             
         DC    X'790302820301',AL2(450),AL2(450)                                
         DC    X'820302850228',AL2(500),AL2(500)                                
         DC    X'850301870228',AL2(550),AL2(600)                                
         DC    X'870301890831',AL2(600),AL2(600)                                
         DC    X'890901A00430',AL2(600),AL2(650)                                
         DC    X'A00501A10501',AL2(600),AL2(625)                                
         DC    X'A10502A20501',AL2(600),AL2(650)                                
         DC    X'A20502A30501',AL2(600),AL2(700)                                
         DC    X'A30502A41031',AL2(600),AL2(750)                                
         DC    X'A41101A71031',AL2(600),AL2(850)                                
         DC    X'A80213A80930',AL2(600),AL2(850)                                
         DC    X'A81001A90331',AL2(600),AL2(800)                                
         DC    X'A90401B10501',AL2(600),AL2(850)                                
         DC    X'B10502FFFFFF',AL2(750),AL2(850)  LATEST RATE                   
         DC    X'FF'                                                            
         EJECT                                                                  
       ++INCLUDE TASYSEQUS                                                      
         EJECT                                                                  
* TASYSDSECT                                                                    
* TAGENFILE                                                                     
         SPACE 1                                                                
         PRINT OFF                                                              
       ++INCLUDE TASYSDSECT                                                     
       ++INCLUDE TAGENFILE                                                      
         PRINT ON                                                               
         SPACE 1                                                                
**PAN#1  CSECT                                                                  
**PAN#1  DC    CL21'083TAGEN6B   05/16/11'                                      
         END                                                                    
