*          DATA SET ACAPGMANC  AT LEVEL 019 AS OF 12/07/99                      
*                                                                               
PHSENTRY DS    A                   CONTROL SECTION ALIGNMENT                    
*                                                                               
*                         EXTERNS                                               
ACSLRY   DC    V(ACSLRY)                                                        
CENTER   DC    V(CENTER)                                                        
CONVMOS  DC    V(CONVMOS)                                                       
DATVAL   DC    V(DATVAL)                                                        
DLFLD    DC    V(DLFLD)                                                         
PRNTBL   DC    V(PRNTBL)                                                        
QSORTR   DC    V(QSORT)                                                         
UNDERLIN DC    V(UNDERLIN)                                                      
PERCALL  DC    V(PERCALL)                                                       
PERVERT  DC    V(PERVERT)                                                       
         DC    3F'0'                                                            
*                         ENTRY POINTS                                          
APUT     DC    A(0)       PUT RECORDS TO SORT                                   
         ORG   APUT                                                             
MERGER   DS    A          HOOK ENTRY TO PUT ROUTINE                             
ABUFFWK  DC    A(0)       DCB FOR BUFFWK                                        
*                                                                               
AINIT    DC    A(0)       A(INITIALIZATION ROUTINE)                             
         DC    2A(0)      SPARE                                                 
*                                                                               
AREPS    DC    A(0)       A(REPORT CONTROL)                                     
AEDIT    DC    A(0)       A(EDIT ROUTINE)                                       
AHEAD    DC    A(0)       A(HEAD HOOK)                                          
ADMGR    DC    A(0)       A(DATAMGR ROUTINES)                                   
RSEQ     EQU   1                                                                
READ     EQU   2                                                                
HIGH     EQU   3                                                                
GETR     EQU   4                                                                
ATOTH    DC    A(0)       A(TOTAL HOURS)                                        
*                                                                               
ACNL     DC    A(0)       A(SUPERLEDGER INITIALIZATION ROUTINE)                 
ASRCH    DC    A(0)       A(SUPERLEDGER SEARCH ROUTINE)                         
ABUFC    DC    A(0)       A(TSAR BUFFER CONTROL ROUTINE)                        
ADWNL    DC    A(0)       A(DOWNLOAD ROUTINE)                                   
*                                                                               
TSAROFF  DC    A(0)       A(TSAROFF)                                            
APSD     DC    A(0)       A(POST SALARY DETAILS ROUTINE)                        
         DC    A(0)       SPARE                                                 
*                                                                               
*                         PROGRAM TABLES - PHASE 06                             
ATABLOW  DC    A(0)       A(LOW STORAGE ALLOACTION TABLE)                       
ATABHI   DC    A(0)       A(HIGH STORAGE ALLOCATION TABLE)                      
ABUCKLST DC    A(0)       A(BUCK TYPE LIST)                                     
AFROMLST DC    A(0)       A("FROM" DATA TABLE)                                  
ATYPELST DC    A(0)       A(TYPE (KEYWORD) LIST TABLE)                          
ATYPEBL0 DC    A(0)       A(TYPE BAL0 ENTRY)                                    
ATYPCTT  DC    A(0)       A(TYPE (CLIENT TOTAL TIME) ENTRY)                     
ATYPEDIT DC    A(0)       A(EDIT TABLE)                                         
ACOLNTAB DC    A(0)       A(STANDARD COLUMN NAME TABLE)                         
ALNSTL   DC    A(0)       A(LINE STATUS TABLE)                                  
AMEDN    DC    A(0)       A(MEDIA NAME TABLE)                                   
AAGYDTE  DC    A(0)       A(AGENCY ALLOCATION RUN DATES)                        
AOFFDTE  DC    A(0)       A(OFFICE ALLOCATION RUN DATES)                        
AHRSTAB  DC    A(0)       A(HOURS LINE NUMBER LIST)                             
ASPBTAB  DC    A(0)       A(SALARY, PENSION, BENEFIT LINE NUMBERS)              
         DC    4A(0)      SPARE                                                 
*                                                                               
*                         STORAGE BUFFERS - BELOW THE LINE                      
AUSER    DC    A(0)       A(USER SPEC CODE)                                     
AHOOKCDE DC    A(0)       A(USER HOOK CODE)                                     
ACONADS  DC    A(0)       A(ADDRESSES OF CONDITIONAL STATEMENTS)                
ACONEXE  DC    A(0)       A(EXECUTABLE CONDITIONAL STATEMENTS)                  
ANAMES   DC    A(0)       A(NAMES LIST)                                         
AACCUM   DC    A(0)       A(LINE ACCUMULATORS)                                  
         ORG   AACCUM                                                           
AZRO     DS    A          A(THE FIRST LINE IS ZEROS)                            
ARSTACK  DC    A(0)       A(REPORT STACK)                                       
APGIO    DC    A(0)       A(IO AREA)                                            
         ORG   APGIO                                                            
AIO1     DC    A(0)                                                             
APGSORT  DC    A(0)       A(SORT RECORD WORK AREA)                              
ANAMEOPT DC    A(0)       A(NAME OPTIMIZATION TABLE)                            
ALEVPOOL DC    A(0)       A(LEDGER LEVEL POOL)                                  
ARLPOOL  DC    A(0)       A(ROW LIST POOL)                                      
ACPOOL   DC    A(0)       A(CONDITIONAL REPORT HEADLINE POOL)                   
AFRMPOOL DC    A(0)       A(FORMULA POOL)                                       
AMANWK   DC    A(0)       A(MANWEEK LIST)                                       
AWCTAB   DC    A(0)       A(WORKCODE TABLE)                                     
ABUDGTIT DC    A(0)       A(BUDGET TYPE LIST)                                   
ANARBK   DC    A(0)       A(NARRATIVE BLOCK)                                    
AXPLN    DC    A(0)       A(SAVED XP LINES)                                     
APELVT   DC    A(0)       A(PESONAL AND LEAVE ACCOUNTS)                         
ASLPWRK  DC    A(0)       A(SUPERLEDGER WORK ENTRY)                             
AREPCOPY DC    A(0)       A(NUMBER OF COPIES LIST)                              
ADWNBUF  DC    A(0)       A(DOWNLOAD BUFFER)                                    
ACONSR   DC    A(0)       A(CONTRA ACCOUNT SUMMARY RECORD)                      
ACONLTL  DC    A(0)       A(CONDITIONAL LITERAL POOL)                           
APERBLK  DC    A(0)       A(PERSON CONTROL BLOCK)                               
         DC    3A(0)      SPARE                                                 
*                                                                               
*                         STORAGE BUFFERS - ABOVE THE LINE                      
ASLP     DC    A(0)       A(SUPERLEDGER TABLE)                                  
ALNK     DC    A(0)       A(SUPERLEDGER LINK LIST)                              
ASRTBF   DC    A(0)       A(TSAR SORT RECORD BUFFER)                            
ACONBF   DC    A(0)       A(TSAR CONTRA ACCOUNT BUFFER)                         
         DC    4A(0)      SPARE                                                 
*                                                                               
MAINLEN  DC    F'0'       LENGTH OF GETMAIN                                     
MAINBGN  DC    F'0'       START OF GETMAIN                                      
*                                                                               
SVRE     DC    F'0'       REGISTER TEMPORARY SAVE                               
SVRF     DC    F'0'                                                             
SVR0     DC    F'0'                                                             
SVR1     DC    F'0'                                                             
SVR2     DC    F'0'                                                             
SVR3     DC    F'0'                                                             
SVR4     DC    F'0'                                                             
SVR5     DC    F'0'                                                             
SVR6     DC    F'0'                                                             
*                                                                               
PARM     DC    6F'0'                                                            
         DC    12F'0'     SPARE                                                 
*                                                                               
UPSI     DC    X'00'      UPSI SWITCH                                           
RULES    EQU   X'80'      PRINT THE SUPERLEDGER RULES                           
TRCPUTS  EQU   X'40'      TRACE RECORDS TO PUTSORT                              
TRCMRGE  EQU   X'20'      TRACE RECORDS TO MERGER                               
TRCGETS  EQU   X'10'      TRACE RECORDS FROM SORT/MERGE                         
TIME     EQU   X'08'      PRINT THE TIMETABLE                                   
*                                                                               
SRTSW    DC    X'00'      SORT CONTROL SWITCH                                   
SRTAC    EQU   X'40'      SORT ACTIVITY                                         
SRTNO    EQU   X'20'      LAST RECORD NOT PUT TO SORT                           
SRTFR    EQU   X'10'      FIRST SORT RECORD                                     
SRTEO    EQU   X'08'      EOF                                                   
SRTLP    EQU   X'04'      LAST RECORD HAS BEEN PROCESSED                        
*                                                                               
RDSW     DC    X'00'      READ CONTROL SWITCH                                   
RDDTL    EQU   X'80'      PROCESS DETAILS (TRANSACTIONS)                        
RDBKT    EQU   X'40'      PROCESS BUCKETS (CONTRA RECORDS)                      
RDBUD    EQU   X'20'      READ BUDGETS                                          
RDMWR    EQU   X'10'      READ TRANSACTION TO GET MWR ETC.                      
RDGEN    EQU   X'08'      SET FCGENBUK=Y                                        
*                                                                               
ACTSW    DC    X'00'      ACTIVITY SWITCH                                       
ACTLA    EQU   X'80'      LEVEL A ACTIVE                                        
ACTLB    EQU   X'40'      LEVEL B ACTIVE                                        
ACTLC    EQU   X'20'      LEVEL C ACTIVE                                        
ACTLD    EQU   X'10'      LEVEL D ACTIVE                                        
*                                                                               
OPT1     DC    X'00'      OPTION SWITCHES                                       
MWR      EQU   X'80'      MAN-WEEK-RATIO CALCULATIONS ARE IN USE.               
FTD      EQU   X'40'      FORCE TRANSACTION DATE TO QEND DATE                   
PCT      EQU   X'20'      PERCENTAGES                                           
SZD      EQU   X'10'      INCLUDE ZERO DATA LINES (SHOWALL)                     
FOH      EQU   X'08'      FIXED OVERHEAD RATE                                   
ROLL     EQU   X'04'      SPEC'S CONTAIN ROLLING COLUMNS                        
*                                                                               
RPSW     DC    X'00'      REPORT PRINTING CONTROL                               
RPLUP    EQU   X'80'      FIRST LINE HAS PRINTED                                
RPNRR    EQU   X'40'      FORCE PRINT OF NARRATIVE FOR LAST PAGE                
RPBLK    EQU   X'20'      LAST LINE WAS A BLANK                                 
*                                                                               
RNSW     DC    X'00'      RUN LEVEL SWITCHES                                    
RNNC     EQU   X'80'      NEW COST ALLOCATION SYSTEM                            
RN31B    EQU   X'40'      31 BIT MODE                                           
RNTMS    EQU   X'20'      TMS IN USE                                            
RNTT     EQU   X'08'      TOTAL TIME RECORDS                                    
*                                                                               
RQSW     DC    X'00'      REQUEST LEVEL SWITCHES                                
RQBGN    EQU   X'80'      BEGIN FIRST REQUEST                                   
RQFLG    EQU   X'40'      FIRST LEDGER FOR THIS REQUEST                         
RQERR    EQU   X'20'      INVALID DATA ON REQUEST CARD                          
RQSTK    EQU   X'10'      DON'T ALTER REPORT STACK                              
RQFLT    EQU   X'08'      FILTERING BY CONTRA FOR 1R                            
RQBUD    EQU   X'04'      BUDGETS IN QAPPL HAVE BEEN ADJUSTED                   
*                                                                               
LGSW     DC    X'00'      LEDGER LEVEL SWITCHES                                 
LGNC     EQU   X'80'      NEW COSTING                                           
LGPE     EQU   X'40'      PERSONNEL LEDGER                                      
LGPJ     EQU   X'20'      PROJECT CONTROL LEDGER                                
LGCL     EQU   X'10'      CLIENT COST LEDGER                                    
LGPR     EQU   X'04'      PERSON RECORDS IN USE                                 
LGTE     EQU   X'02'      T&E LEDGER                                            
*                                                                               
ACSW     DC    X'00'      ACCOUNT LEVEL SWITCHES                                
ACBR     EQU   X'80'      ACCOUNT HAS BILLING RATES                             
ACHR     EQU   X'40'      ACCOUNT HAS STANDARD RATES                            
ACPH     EQU   X'20'      ACCOUNT HAS PERSONAL HOURLY RATES                     
*                                                                               
SBSW     DC    X'00'      SUB-ACCOUNT SWITCHES                                  
SBDC     EQU   X'80'      DIRECT COSTS (NEW COST METHOD)                        
SBIC     EQU   X'40'      INDIRECT COSTS (NEW COST METHOD)                      
SBOH     EQU   X'20'      OVERHEAD (NEW COST METHOD)                            
SBBA     EQU   X'10'      BUCKET ACTIVITY                                       
*                                                                               
TNSW     DC    X'00'      TRANSACTION SWITCHES                                  
*                                                                               
PCSW     DC    X'00'      POSTING CONTROL SWITCH                                
PCBD     EQU   X'80'      OPTION TO POST BY BUCKET DATE                         
PCPT     EQU   X'40'      POSTING THIS TIME BY DATE                             
PCMWR    EQU   X'20'      POST THE MAN-WEEK-RATIO                               
PCGPR    EQU   X'10'      POSTING PROFORMA REPORT                               
PCACT    EQU   X'08'      POSTING ACTIVITY FOR THIS TRANSACTION                 
PCDPT    EQU   X'04'      POST 14 BY DEPARTMENT                                 
PCFOH    EQU   X'02'      POSTING FIXED OVERHEAD                                
PCTSK    EQU   X'01'      POST TASK DETAIL                                      
*                                                                               
GEXSW    DC    X'00'      GENERATED CODE SWITCHES                               
GEXT2    EQU   X'80'      NEED TO FIX T2 LENGTH                                 
GEXC1    EQU   X'40'      C1, C2, C3 OR C4 NEEDED                               
*                                                                               
PSTLV    DC    X'00'      POSTING LEVEL CONTROL                                 
CLRLV    DC    X'00'      LINE CLEAR INDICATOR                                  
TODAY    DC    CL6' '     YYMMDD                                                
SYSEQU   DC    X'00'      ACMSUSA OR ACMSEUR (US OR UK)                         
CLIPOS   DC    X'00'      POSITION OF CLIENT CODE IN 1C                         
         DC    XL2'00'    SPARE                                                 
*                                                                               
SLOPTN   DC    X'00'      SUPERLEDGER CONTROL SWITCH                            
SLINIT   EQU   X'01'      INITIALIZED                                           
SLFLT    EQU   X'20'      FILTERING ONE AT A TIME                               
SLFND    EQU   X'80'      ENTRY FOUND                                           
*                                                                               
HPSW     DC    X'00'      HORIZONTAL PERCENT                                    
HPPCT    EQU   X'80'      PERCENT                                               
*        EQU   X'40'      DO NOT USE FOR NOW                                    
HPOFF    EQU   X'20'      TURN OFF FOR NOW                                      
HPDID    EQU   X'01'      DIVIDEND                                              
HPDIV    EQU   X'02'      DIVISOR                                               
*                                                                               
LPLSW    DC    X'00'      LITERAL POOL CONTROL SWITCH                           
LPLPL    EQU   X'80'      PROCESS THE LITERAL POOL DATA                         
LPLRS    EQU   X'40'      RIGHT SIDE DATA PRESENT                               
LPLLS    EQU   X'20'      LEFT SIDE DATA PRESENT                                
LPLFL    EQU   X'10'      FOOTLINE PRESENT                                      
*                                                                               
         DC    XL15'00'   SPARE                                                 
*                                                                               
*                         HOOK INFO                                             
HOOKAWRK DC    A(0)       A(ACWORKD)                                            
         ORG   HOOKAWRK                                                         
BASERC   DS    A          RC                                                    
HOOKACOL DC    A(0)       A(COLUMN INFO)                                        
HOOKAREC DC    A(0)       A(SORT RECORD)                                        
HOOKTYPE DC    X'00'      1=PROCESSING COL                                      
HOOKNUM  DC    X'00'      HOOK NUMBER IN APG CODE                               
HOOKSTAT DC    X'00'      HOOK CONTROL                                          
HOOKSSND EQU   X'80'      SECOND TIME THRU POST                                 
HOOKSPRC EQU   X'40'      HOOK IS IN PROCESS                                    
HOOKMODE DC    C' '       HOOK NUMBER FOR MONACC MODES                          
STOPHOOK DC    C'N'                                                             
*                                                                               
*                         USED TO GENERATE PROFORMA REPORT                      
GPRLDG   DC    CL2' '     LEDGER CODE TO CONTROL PROFORMA REPORT                
GPRLV    DC    X'00'      CURRENT ACCOUNT LEVEL FOR GPR TEST                    
GPRSW    DC    X'00'      LEVEL CONTROL                                         
GPRLVA   EQU   ACTLA      GENERATE REPORT AT LEVEL A                            
GPRLVB   EQU   ACTLB      GENERATE REPORT AT LEVEL B                            
GPRLVC   EQU   ACTLC      GENERATE REPORT AT LEVEL C                            
GPRLVD   EQU   ACTLD      GENERATE REPORT AT LEVEL D                            
         EJECT                                                                  
ACTACC   DC    CL15' '    ACTUAL ACCOUNT CODE                                   
*                                                                               
FROM     DC    CL15' '    'FROM' DATA                                           
FROMACC  DC    CL15' '    'FROM' ACCOUNT NUMBER                                 
FROMNME  DC    CL36' '    'FROM' ACCOUNT NAME                                   
*                                                                               
CURRACC  DC    CL15' '    CURRENT ACCOUNT NUMBER                                
CURRNAME DC    CL36' '    CURRENT ACCOUNT NAME                                  
CURRFLT  DC    CL5' '     FILTERS                                               
         ORG   CURRFLT                                                          
CURRFLT1 DC    C' '       FILTER 1                                              
CURRFLT2 DC    C' '       FILTER 2                                              
CURRFLT3 DC    C' '       FILTER 3                                              
CURRFLT4 DC    C' '       FILTER 4                                              
CURRFLT5 DC    C' '       FILTER 5                                              
         DC    CL2' '     SPARE                                                 
CURRTIME DC    C' '       B, N OR R TIME FILTERING                              
CURRCG1  DC    C' '       CURRENT COST GROUP LEVEL 1                            
CURRCG2  DC    C' '                          LEVEL 2                            
CURRCG3  DC    C' '                          LEVEL 3                            
CURRCG   DC    C' '                          ACCOUNT                            
*                                                                               
CURRBBFD DC    CL24' '    BALANCE BROUGHT FORWARD                               
CURRHIRE DC    CL24' '    HIRE DATE                                             
         ORG   *-L'HIRE                                                         
HIRE     DC    XL3'00'    PWOS                                                  
CURRTERM DC    CL24' '    TERMINATION DATE?                                     
         ORG   *-L'TERM                                                         
TERM     DC    XL3'00'    PWOS                                                  
*                                                                               
CONLEDG  DC    CL2' '     CONTRA UNIT AND LEDGER                                
CURRCON  DC    CL15' '    CURRENT CONTRA ACCOUNT NUMBER                         
CURRCNAM DC    CL36' '    CONTRA NAME                                           
*                                                                               
CURRMBK  DS    0CL2       METHOD / BUCKET TYPE                                  
CURRMTHD DC    CL1' '     ALLOCATION METHOD                                     
CURRBKT  DC    CL1' '     BUCKET TYPE                                           
*                                                                               
CURRTDTE DC    XL3'00'    CURRENT TRANSACTION DATE                              
CURRDATE DC    CL24' '    CURRENT DATE(ALL FORMATS)                             
CURRSTAT DC    X'00'      CURRENT TRANSACTION STATUS                            
CURRTSK  DC    CL2' '     TASK                                                  
CURRWC   DC    CL2' '     PRODUCTION WORKCODE                                   
         ORG   CURRWC                                                           
CURROFC  DC    CL2' '     OFFICE                                                
CURRNUM  DC    CL12' '    CURRENT (ELEMENT?) NUMBER                             
CURROTH  DC    CL21' '    OTHERS ELEMENT DATA                                   
         ORG   CURROTH                                                          
CURROSBR DS    0CL13                                                            
CURRONUM DC    CL9' '     SUBREF - FREE FORM NUMBER                             
CURROPRF DC    XL4'00'    FREE FORM PROFILE                                     
         ORG   CURROPRF+2                                                       
CURROMOS DC    XL2'00'    MEDIA MONTH OF SERVICE (PWOS)                         
CURROMMY DC    CL6' '     MEDIA MONTH OF SERVICE MMM/YY                         
CURROMM  DC    CL2' '     MEDIA MONTH OF SERVICE MM                             
*                                                                               
CURRREF  DC    CL6' '     CURRENT TRNREF                                        
CURRBTCH DC    CL6' '     CURRENT TRNBTCH                                       
CURRBYM  DC    CL4' '       "       "    YYMM                                   
CURRBMY  DC    CL6' '       "       "    MMM/YY                                 
CURRANAL DC    CL2' '     ANALYSIS CODE                                         
CURRJOB  DC    CL12' '    CURRENT JOB                                           
*                                                                               
CURRDUE  DC    CL24' '    DUE DATE                                              
CURRDU   DC    CL24' '    DATE USED                                             
CURRAD   DC    CL24' '    DATE ADDED                                            
CURRMD   DC    CL24' '    MARKED BY G/L UPDATE                                  
CURREP   DC    CL85' '    EXTRA PAY ELEMENT                                     
*                                                                               
CURRMOS  DC    XL2'00'    MONTH OF ACTIVITY (YYMM)                              
CURRNET  DC    PL6'0'     CURRENT TRANSACTION AMOUNT                            
CURRGRS  DC    PL6'0'     CURRENT GROSS                                         
CURRCOM  DC    PL6'0'     CURRENT COMMISSION                                    
CURRCSD  DC    PL6'0'     CURRENT CASH DISCOUNT                                 
CURRHRS  DC    PL6'0'     CURRENT HOURS                                         
*                                                                               
CURRNT   DC    C' '       TYPE OF 1N TIME (P OR L)                              
CURRTE2  DC    CL12' '    SECOND HALF OF T&E CODE                               
CURRNARR DC    CL200' '   CURRENT TRNSNAR                                       
*                                                                               
CURRSIGN DC    C' '       SIGN: + OR -. USED IN MULTIPLE POSTING.               
CURRCOL  DC    X'00'      CURRENT COLUMN NUMBER                                 
CURRPER  DC    XL2'00'    CURRENT PERIOD.                                       
CURRTYPE DC    X'00'      CURRENT COLUMN DATA TYPE                              
*                                                                               
CURRLEVS DS    0CL13                                                            
NUMLEVS  DC    X'00'      NUMBER OF LEVELS                                      
LEVA     DC    CL3' '     CODE/DSP/LEN                                          
LEVB     DC    CL3' '                                                           
LEVC     DC    CL3' '                                                           
LEVD     DC    CL3' '                                                           
*                                                                               
CURRCNTR DS    4CL18      4 LEVELS OF CONTRA                                    
         ORG   CURRCNTR                                                         
CURRCTY1 DC    X'00'      TYPE FRC1 (FROM CONTRA LEVEL 1)                       
CURRCDP1 DC    X'00'      DISP. TO LEVEL                                        
CURRCLN1 DC    X'00'      LENGTH OF LEVEL                                       
CURRCAC1 DC    CL15' '    CONTRA LEVEL 1                                        
CURRCTY2 DC    X'00'      TYPE FRC2 (FROM CONTRA LEVEL 2)                       
CURRCDP2 DC    X'00'      DISP. TO LEVEL                                        
CURRCLN2 DC    X'00'      LENGTH OF LEVEL                                       
CURRCAC2 DC    CL15' '    CONTRA LEVEL 2                                        
CURRCTY3 DC    X'00'      TYPE FRC3 (FROM CONTRA LEVEL 3)                       
CURRCDP3 DC    X'00'      DISP. TO LEVEL                                        
CURRCLN3 DC    X'00'      LENGTH OF LEVEL                                       
CURRCAC3 DC    CL15' '    CONTRA LEVEL 3                                        
CURRCTY4 DC    X'00'      TYPE FRC4 (FROM CONTRA LEVEL 4)                       
CURRCDP4 DC    X'00'      DISP. TO LEVEL                                        
CURRCLN4 DC    X'00'      LENGTH OF LEVEL                                       
CURRCAC4 DC    CL15' '    CONTRA LEVEL 4                                        
*                                                                               
         DC    XL151'00'   SPARE                                                
*                                                                               
SYSWIDTH DC    AL1(164)   WIDTH OF REPORT                                       
SYSNAME  DC    CL40' '    REPORT TITLE (CENTERED ON FIRST LINE)                 
PEREXP   DC    CL26' '    REPORT PERIOD                                         
REPCODE  DC    X'00'      REPORT CODE                                           
COPYNO   DC    X'00'      REPORT COPY NUMBER                                    
MODULE   DC    CL8' '     REPORT MODULE                                         
REPTLEV  DC    X'00'      REPORT LEVEL COUNTER USED IN APGREPS                  
*                                                                               
WLINE    DC    Y(WLN)     WIDTH OF A LINE OF ACCUMULATORS                       
WRSTACK  DC    F'0'       THE WIDTH OF A RSTACK ITEM                            
NRSTACK  DC    F'0'       THE NUMBER OF RSTACK ITEMS                            
HIGHCOL  DC    F'0'       HIGHEST COLUMN                                        
HIGHROW  DC    F'0'       HIGHEST ROW                                           
DSPREP   DC    H'0'       DISPLACEMENT TO REPORT CODE                           
DSPNME   DC    H'0'       DISPLACEMENT TO NAME FIELDS                           
DSPCOL   DC    H'0'       DISPLACEMENT TO COLUMNS                               
RECLNGTH DC    H'0'       SORT RECORD LENGTH                                    
SRTLNGTH DC    H'0'       SORT FIELDS LENGTH                                    
SRTFLN   DC    XL10'00'   LENGTH OF EACH SORT LEVEL - UP TO 10                  
MNWKS    DC    H'0'       NUMBER OF WEEKS IN MANWK TABLE                        
*                                                                               
MYEDTE   DC    CL6' '     REQUEST END DATE IN MMM/YY FORMAT                     
         DC    XL13'00'   SPARE                                                 
*                                                                               
RELMON   DC    X'00'      RELATIVE MONTH NUMBER FOR THIS PERIOD                 
RELEND   DC    X'00'      RELATIVE MONTH NUMBER FOR END DATE                    
BASMNTH  DC    PL3'0'     RELATIVE NUMBER FOR FIRST (BASE) MONTH.               
*                                                                               
READLEDG DC    CL2' '     LEDGER CODE                                           
OPTIONS  DS    0C                                                               
ADJHOURS DC    C'N'       ADJUST STANDARD HOURS                                 
AHOURS   DC    C'N'       ADJUSTED HOURS                                        
PRTMOD   DC    C'N'                                                             
FCTR     DC    C'N'       CONVERSION FACTOR                                     
POSTMOS  DC    C'N'       POST BY MONTH OF SERVICE                              
BUCKD    DC    C'N'       ROUND BUCKETS TO NEAREST DOLLAR                       
NOBINARY DC    C'N'                                                             
BOXOPT   DC    C'N'       BOXES                                                 
FORMBASE DC    C'N'       FORMULA BASIS B=BROADCAST, C=CALENDAR                 
T1DISP   DC    X'00'      DISPLACEMENT TO EXPENSE TYPE                          
T2LEN    DC    X'00'      LENGTH OF T2 CODE                                     
CURRED   DC    CL2'  '    CURRENT EDIT TYPE                                     
*                                                                               
ULCDES   DS    0CL30      UNIT LEDGER CODES                                     
PRODUL   DC    C'SJ'      PRODUCTION                                            
COSTUL   DC    C'1C'      COSTING                                               
PROJUL   DC    C'1J'      PROJECT CONTROL                                       
NONCUL   DC    C'1N'      NON-CLIENT                                            
DIRLUL   DC    C'14'      DIRECT LABOR                                          
INDLUL   DC    C'15'      INDIRECT LABOR                                        
OVRHUL   DC    C'16'      OVERHEAD                                              
*&&US                                                                           
PERSUL   DC    C'1R'      PERSON                                                
*&&                                                                             
*&&UK                                                                           
PERSUL   DC    C'1P'      PERSON                                                
*&&                                                                             
CLIAUL   DC    C'29'      CLIENT ANALYSIS                                       
PERAUL   DC    C'2P'      PERSON ANALYSIS                                       
         DC    5CL2' '    RESEVRED FOR LEDGER CODES                             
*                                                                               
         DC    XL8'00'    SPARE                                                 
*                                                                               
NEXTROLL DC    XL40'00'   NEXT YEAR ROLLING                                     
NEXTFISC DC    XL40'00'   NEXT FISCAL                                           
*                                                                               
SRCHLEN  DC    X'00'      LENGTH OF SUPERLEDGER SEARCH                          
SLPNUM   DC    F'0'       NUMBER OF ENTRIES IN SUPERLEDGER                      
SRCHARG  DC    CL(ARGLNQ)' ' USED TO BUILD SEARCH ARGUMENT                      
LASTARG  DC    CL(ARGLNQ)' ' SAVE LAST SUCCESSFUL SEARCH                        
         DS    XL20'00'   SPARE                                                 
ASLNTRY  DC    A(0)       A(CURRENT SUPERLEDGER ENTRY)                          
SRCREGS  DC    5F'0'      SEARCH REGISTERS 0,1,2,3,4                            
*                                                                               
CNSLTT   DC    CL20' '    CONSULTANT CODES                                      
CONCODE  DC    X'00'      CONDITION CODE                                        
*                                                                               
METHOD   DC    C' '       METHOD                                                
MTHDNME  DC    CL36' '    METHOD NAME                                           
FOHR     DC    PL3'0'     FIXED OVERHEAD RATE                                   
WRK      DC    PL15'0'    WORK FIELD FOR PACKED                                 
DUB2     DC    D'0'                                                             
*                                                                               
RLLEDG   DC    CL4' '                                                           
BBFSW    DC    C'N'       BALANCE FORWARD SWITCH                                
APGNNARL DC    X'00'      NUMBER OF NARRATIVE LINES                             
CMONLYR  DC    XL1'0C'    CURRENT MONTH LAST YEAR                               
         DC    XL1'00'    SPARE                                                 
*                                                                               
CFSDTE   DC    CL6' '     FISCAL START DATE (CHARACTER)                         
CFEDTE   DC    CL6' '     FISCA END DATE (CHARACTER)                            
PFSDTE   DC    XL3'00'    FISCAL START DATE (PWOS)                              
PFEDTE   DC    XL3'00'    FISCAL END DATE (PWOS)                                
*                                                                               
CSDTE    DC    CL6' '     REQUEST START DATE (CHARACTER)                        
CEDTE    DC    CL6' '     REQUEST END DATE (CHARACTER)                          
PSDTE    DC    XL3'00'    REQUEST START DATE (PWOS)                             
PEDTE    DC    XL3'00'    REQUEST END DATE (PWOS)                               
*                                                                               
LASTYRQ  DC    CL2' '     LAST YEAR                                             
CURRYRQ  DC    CL2' '     CURRENT YEAR                                          
NEXTYRQ  DC    CL2' '     NEXT YEAR                                             
         DS    0D                                                               
MONLIST  DC    36CL6' '   YYMM(EBCDIC) YYMM(PACKED)                             
         ORG   *-L'MONLIST                                                      
MONLAST  DS    XL6                                                              
MONALIST DC    36CL6' '   MMM/YY                                                
         ORG   *-L'MONALIST                                                     
MONALAST DS    CL6                                                              
*                                                                               
PERIOD   DC    XL40'00'   20 START/END MONTH NUMBER PAIRS                       
YTD      DC    XL40'00'   YEAR TO DATE INDEX.                                   
ROLLING  DC    XL40'00'   ROLLING                                               
FISCAL   DC    XL40'00'   FISCAL                                                
LASTPER  DC    XL40'00'   LAST YEAR PERIOD                                      
LASTYTD  DC    XL40'00'   LAST YEAR YTD                                         
LASTROLL DC    XL40'00'   LAST YEAR ROLLING                                     
LASTFISC DC    XL40'00'   LAST YEAR FISCAL                                      
NEXTPER  DC    XL40'00'   NEXT YEAR PERIOD                                      
LASTAHED DS    0XL40                                                            
NEXTYTD  DC    XL40'00'   NEXT YEAR TO DATE                                     
*                                                                               
AMNKEY   DC    A(0)       A(LAST MONACC KEY)                                    
ADDCB    DC    A(0)       ACCDIR OR ACCFIL DCB                                  
ACCOUNT  DC    CL8' '     ACCOUNT                                               
APGM2KEY DC    CL42' '    KEY FOR M2 READS                                      
BUDGLIST DC    XL30'00'   BUDGET LIST. UP TO 15?                                
         DC    XL20'00'   SPARE                                                 
*                                                                               
TSRMODE  DC    X'00'      TSAR ACTION CONTROL                                   
TSRMPUT  EQU   X'40'      PUT A RECORD TO TSAR                                  
TSRMGET  EQU   X'20'      GET A RECORD FROM TSAR                                
TSRMNXT  EQU   X'10'      NEXT RECORD FROM TSAR                                 
*                                                                               
TSRSTAT  DC    X'00'      TSAR STATUS CONTROL                                   
TSRSBUFF EQU   X'80'      BUFFWK OPENED                                         
TSRSFRST EQU   X'40'      FIRST GET FROM BUFFWK                                 
TSRSEOF  EQU   X'20'      EOF ON BUFFWK                                         
TSRSINIT EQU   X'04'      TSAR INITIALIZED                                      
*                                                                               
SORTBLK  DC    XL34'00'   TSAR CONTROL BLOCK FOR SORT RECORDS                   
CONTBLK  DC    XL34'00'   TSAR CONTROL BLOCK FOR CONTRA ACCOUNTS                
*                                                                               
DWNSTAT  DC    X'00'      DOWNLOAD CONTROL STATUS                               
DWNLOAD  EQU   X'80'      DOWNLOAD RUNNING                                      
DWNINIT  EQU   X'40'      BLOCK HAS BEEN INITIALIZED                            
DWNHEAD  EQU   X'20'      HEADLINES HAVE BEEN PROCESSED                         
DWNMICRO EQU   X'10'      DOWNLOAD MICRO FORMAT (MUST SET DWNLOAD BIT)          
DWNNOPRT EQU   X'01'      DON'T PRINT THIS DOWNLOAD ENTRY                       
*                                                                               
DWNMODE  DC    X'00'      DOWNLOAD MODE                                         
DWNTEXT  EQU   1          PUT TEXT                                              
DWNNUMB  EQU   2          PUT NUMBER                                            
DWNEOL   EQU   3          END OF LINE                                           
DWNEOR   EQU   4          END OF REPORT                                         
DWNROWS  EQU   5          PUT ROW CODE/NAMES                                    
*                                                                               
DICO     DS    0C         WORDS FROM DICTIONARY                                 
LTOTFOR  DC    CL12' '    "TOTALS FOR"                                          
LREPORT  DC    CL8' '     "REPORT"                                              
LHEAD1   DC    CL35' '    "REPORT ACPP-CC COPY N  PAGE N"                       
*                                                                               
DWNOPTN1 DC    X'00'      DOWNLOAD OPTIONS 1                                    
DWNOMICR EQU   X'80'      MICRO DOWNLOAD                                        
DWNOXHED EQU   X'40'      EXCLUDE COLUMN HEADS                                  
DWNOXNME EQU   X'20'      EXCLUDE ROW NAMES                                     
DWNONOMD EQU   X'10'      DON'T DOWNLOAD MODULE CODE                            
DWNOPTN2 DC    X'00'      DOWNLOAD OPTIONS 2                                    
*                                                                               
DKEY     DS    CL42       KEY ARGUMENT                                          
DIR      DS    CL42       DIRECTORY KEY                                         
DSTAT    DS    XL8        DIRECTORY STATUS                                      
DA       DS    XL4        DISK ADDRESS                                          
*                                                                               
         DC    XL51'00'   SPARE                                                 
         EJECT                                                                  
*              SORT RECORD                                                      
         SPACE 1                                                                
         DS    0D                                                               
*                                                                               
SORTREP  DS    XL1                                                              
SORTCOPY DS    CL1                                                              
SORTTYPE DS    CL1                 0=REGULAR DATA                               
*                                  N=VERTICAL PERCENT LEVEL N                   
         DS    XL1                 SPARE                                        
SORTDUM  DS    CL14                START OF LEVEL 0 KEY                         
*                                                                               
SORTLV   DS    0C                                                               
SORTRPT  DS    XL1                 REPORT NUMBER                                
SORTCPY  DS    XL1                 COPY                                         
SORTKEY  DS    CL14                REPORT KEY                                   
SORTKLQ  EQU   *-SORTLV                                                         
         ORG   SORTLV                                                           
SORTLEVS DS    CL(10*SORTKLQ)      10 LEVELS CL16                               
*                                  CL1  REPORT OR RECAP REPORT                  
*                                  CL1  COPY                                    
*                                  CL14 KEY DATA                                
*                                                                               
SORTCOLS DS    CL256               UP TO 32 PL8 COLUMNS                         
SORTNAMS DS    CL360               UP TO 10 ROW NAMES                           
SORTLNQ  EQU   *-SORTREP                                                        
