*          DATA SET ACAURTAB   AT LEVEL 109 AS OF 10/27/14                      
*                                                                               
* AURURL - AURA URL TABLE                                                       
*                                                                               
*----------------------------------------------------------------------         
* TABLE OF AURA HOME PAGE URLS                                                  
*   XL1  - SE Number - zero is live system                                      
*   CL2  - AGENCY ALPHA                                                         
*   CL2  - OFFICE (OR SPACES IN NOT OFFICE SPECIFIC, SPACES IS DEFAULT)         
*   XL1  - SPARE                                                                
*   CL50 - http://aura.mediaocean.com                                           
*----------------------------------------------------------------------         
*                                                                               
AURURL   DC    XL1'2F',CL2'  ',CL2'  ',XL1'00'        csc systems               
         DC    CL50'https://csc1-aura.mediaocean.com'                           
         DC    XL1'3F',CL2'  ',CL2'  ',XL1'00'        tst systems               
         DC    CL50'http://test1-aura.mediaocean.com'                           
         DC    XL1'66',CL2'  ',CL2'  ',XL1'00'        tst systems               
         DC    CL50'http://test1-aura.mediaocean.com'                           
         DC    XL1'67',CL2'  ',CL2'  ',XL1'00'        tst systems               
         DC    CL50'http://test1-aura.mediaocean.com'                           
         DC    XL1'71',CL2'00',CL2'  ',XL1'00'        tst systems               
         DC    CL50'http://test1-aura.mediaocean.com'                           
         DC    XL1'73',CL2'  ',CL2'  ',XL1'00'        QA system - ACCQA         
         DC    CL50'https://qa1-aura.mediaocean.com'                            
         DC    XL1'78',CL2'  ',CL2'  ',XL1'00'        QA system - ACCQB         
         DC    CL50'https://qa1-aura.mediaocean.com'                            
         DC    XL1'00',XL2'00',XL2'00',XL1'00'        Live                      
         DC    CL50'https://aura.mediaocean.com'                                
         EJECT                                                                  
