*          DATA SET ACBATC3D   AT LEVEL 002 AS OF 09/19/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BC3D      DATE 09/19/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      6    3    8  A   P    N         T        Y              
BICBILLH DS    CL8                                                              
BICBILL  DS    CL6      6   20    6  A   U    N         T    I   Y   11         
BICBILLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7    3    4  A   P    N         T        Y              
BICDATH  DS    CL8                                                              
BICDAT   DS    CL9      7   20    9  A   U    N         T        Y   12         
BICDATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      8    3    8  A   P    N         T        Y              
BICDUEH  DS    CL8                                                              
BICDUE   DS    CL9      8   20    9  A   U    N         T        Y   13         
BICDUEX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9    3    6  A   P    N         T        Y              
BICCLIH  DS    CL8                                                              
BICCLI   DS    CL6      9   20    6  A   U    N         T        Y   14         
BICCLIX  DS    CL8                                                              
BICCLINH DS    CL8                                                              
BICCLIN  DS    CL36     9   36   36  A   P    N         T        Y   15         
BICCLINX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    3    7  A   P    N         T        Y              
BICPROH  DS    CL8                                                              
BICPRO   DS    CL6     10   20    6  A   U    N         T        Y   16         
BICPROX  DS    CL8                                                              
BICPRONH DS    CL8                                                              
BICPRON  DS    CL36    10   36   36  A   P    N         T        Y   17         
BICPRONX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     11    3    3  A   P    N         T        Y              
BICJOBH  DS    CL8                                                              
BICJOB   DS    CL6     11   20    6  A   U    N         T        Y   18         
BICJOBX  DS    CL8                                                              
BICJOBNH DS    CL8                                                              
BICJOBN  DS    CL36    11   36   36  A   P    N         T        Y   19         
BICJOBNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    12    3   14  A   P    N         T        Y              
BICCOMH  DS    CL8                                                              
BICCOM   DS    CL12    12   20   12  A   U    N         T        Y   20         
BICCOMX  DS    CL8                                                              
BICCOMNH DS    CL8                                                              
BICCOMN  DS    CL36    12   36   36  A   P    N         T        Y   21         
BICCOMNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    13    3   14  A   P    N         T        Y              
BICDUMH  DS    CL8                                                              
BICDUM   DS    CL12    13   20   12  A   U    N         T        Y   22         
BICDUMX  DS    CL8                                                              
BICDUMNH DS    CL8                                                              
BICDUMN  DS    CL36    13   36   36  A   P    N         T        Y   23         
BICDUMNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    14    3   11  A   P    N         T        Y              
BICAMTH  DS    CL8                                                              
BICAMT   DS    CL11    14   20   11  A   U    N         T        Y   24         
BICAMTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    15    3   11  A   P    N         T        Y              
BICNETH  DS    CL8                                                              
BICNET   DS    CL11    15   20   11  A   U    N         T        Y   25         
BICNETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    16    3   10  A   P    N         T        Y              
BICCAMH  DS    CL8                                                              
BICCAM   DS    CL11    16   20   11  A   U    N         T        Y   26         
BICCAMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     17    3    8  A   P    N         T        Y              
BICTYPEH DS    CL8                                                              
BICTYPE  DS    CL1     17   20    1  A   U    N         T        Y   27         
BICTYPEX DS    CL8                                                              
BICTYPNH DS    CL8                                                              
BICTYPN  DS    CL21    17   36   21  A   P    N         T        Y   28         
BICTYPNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    18    3   10  A   P    N         T        Y              
BICGAMTH DS    CL8                                                              
BICGAMT  DS    CL12    18   20   12  A   U    N         T        Y   29         
BICGAMTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     19    3    9  A   P    N         T        Y              
BICBASEH DS    CL8                                                              
BICBASE  DS    CL12    19   20   12  A   U    N         T        Y   30         
BICBASEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    20    3   13  A   P    N         T        Y              
BICCDH   DS    CL8                                                              
BICCD    DS    CL11    20   20   11  A   U    N         T        Y   31         
BICCDX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21   20    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A   P    N         T        Y  255         
         DS    CL8                                                              
BICLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
BICWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1040 BYTES                            
