*          DATA SET ACBATC5D   AT LEVEL 002 AS OF 03/15/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BC5D      DATE 03/15/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL11     6    2   11  A  P N             T        Y              
ATCDOCH  DS    XL8                                                              
ATCDOC   DS    CL6      6   14    6  A  U N             T    I   Y   11         
ATCDOCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   31    4  A  P N             T        Y              
ATCDAT1H DS    XL8                                                              
ATCDAT1  DS    CL8      6   37    8  A  U N             T        Y   12         
ATCDAT1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   65    6  A  P N             T        Y              
ATCURGH  DS    XL8                                                              
ATCURG   DS    CL1      6   72    1  A  U N             T        Y   13         
ATCURGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
ATCCSHH  DS    XL8                                                              
ATCCSH   DS    CL15     7   14   15  A  U N             T        Y   14         
ATCCSHX  DS    XL8                                                              
ATCCSDH  DS    XL8                                                              
ATCCSD   DS    CL36     7   31   36  A  P N             T        Y   15         
ATCCSDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
ATCACCH  DS    XL8                                                              
ATCACC   DS    CL15     8   14   15  A  U N             T        Y   16         
ATCACCX  DS    XL8                                                              
ATCACDH  DS    XL8                                                              
ATCACD   DS    CL36     8   31   36  A  P N             T        Y   17         
ATCACDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      8   68    3  A  P N             T        Y              
ATCCDH   DS    XL8                                                              
ATCCD    DS    CL1      8   72    1  A  U N             T        Y   18         
ATCCDX   DS    XL8                                                              
ATCCDDH  DS    XL8                                                              
ATCCDD   DS    CL6      8   75    6  A  P N             T        Y   19         
ATCCDDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     9    2   11  A  P N             T        Y              
ATCACC2H DS    XL8                                                              
ATCACC2  DS    CL15     9   14   15  A  U N             T        Y   20         
ATCACC2X DS    XL8                                                              
ATCAC2DH DS    XL8                                                              
ATCAC2D  DS    CL36     9   31   36  A  P N             T        Y   21         
ATCAC2DX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      9   68    3  A  P N             T        Y              
ATCCD2H  DS    XL8                                                              
ATCCD2   DS    CL1      9   72    1  A  U N             T        Y   22         
ATCCD2X  DS    XL8                                                              
ATCCDD2H DS    XL8                                                              
ATCCDD2  DS    CL6      9   75    6  A  P N             T        Y   23         
ATCCDD2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     10    2    8  A  P N             T        Y              
ATCTYPEH DS    XL8                                                              
ATCTYPE  DS    CL1     10   14    1  A  U N             T        Y   24         
ATCTYPEX DS    XL8                                                              
ATCTYPNH DS    XL8                                                              
ATCTYPN  DS    CL21    10   18   21  A  P N             T        Y   25         
ATCTYPNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    10   42   13  A  P N             T        Y              
ATCGORNH DS    XL8                                                              
ATCGORN  DS    CL1     10   57    1  A  U N             T        Y   26         
ATCGORNX DS    XL8                                                              
ATCGSTXH DS    XL8                                                              
ATCGSTX  DS    CL18    10   60   18  A  P N             T        Y   27         
ATCGSTXX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     11    2    9  A  P N             T        Y              
ATCNARH  DS    XL8                                                              
ATCNAR   DS    CL55    11   14   55  A  U N             T        Y   28         
ATCNARX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL55    12   14   55  A  U N             T        Y   29         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     12   70    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     12   71    4  A  P N             T        Y              
ATCPROVH DS    XL8                                                              
ATCPROV  DS    CL2     12   76    2  A  U N             T        Y   61         
ATCPROVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     13    3    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    13   17   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     14    3    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    14   17   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    14   41   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     14   58    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     14   69    6  A  P N             T        Y              
ATCWCH   DS    XL8                                                              
ATCWC    DS    CL2     15    4    2  A  U N             T        Y   30         
ATCWCX   DS    XL8                                                              
ATCWC2H  DS    XL8                                                              
ATCWC2   DS    CL2     15    9    2  A  U N             T        Y   31         
ATCWC2X  DS    XL8                                                              
ATCEXH   DS    XL8                                                              
ATCEX    DS    CL15    15   17   15  A  U N             T        Y   32         
ATCEXX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    15   41   14  A  U N             T        Y   33         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     15   58    7  A  U N             T        Y   34         
         DS    XL8                                                              
ATCAMH   DS    XL8                                                              
ATCAM    DS    CL11    15   69   11  A  U N             T        Y   35         
ATCAMX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    16    3   75  A  P N             T        Y   36         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     17    4    2  A  U N             T        Y   37         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     17    9    2  A  U N             T        Y   38         
         DS    XL8                                                              
ATCEX2H  DS    XL8                                                              
ATCEX2   DS    CL15    17   17   15  A  U N             T        Y   39         
ATCEX2X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    17   41   14  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     17   58    7  A  U N             T        Y   41         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    17   69   11  A  U N             T        Y   42         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    18    3   75  A  P N             T        Y   43         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     19    4    2  A  U N             T        Y   44         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     19    9    2  A  U N             T        Y   45         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    19   17   15  A  U N             T        Y   46         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    19   41   14  A  U N             T        Y   47         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     19   58    7  A  U N             T        Y   48         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    19   69   11  A  U N             T        Y   49         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    20    3   75  A  P N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     21    4    2  A  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     21    9    2  A  U N             T        Y   52         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    21   17   15  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    21   41   14  A  U N             T        Y   54         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     21   58    7  A  U N             T        Y   55         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    21   69   11  A  U N             T        Y   56         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    22    3   75  A  P N             T        Y   57         
         DS    XL8                                                              
ATCTABH  DS    XL8                                                              
ATCTAB   DS    CL1     22   79    1  A  U N             T        Y   58         
ATCTABX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    23    2   10  A  P N             T        Y              
ATCGAMTH DS    XL8                                                              
ATCGAMT  DS    CL40    23   14   40  A  U N             T        Y   59         
ATCGAMTX DS    XL8                                                              
ATCTOTH  DS    XL8                                                              
ATCTOT   DS    CL25    23   55   25  A  P N             T        Y   60         
ATCTOTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  255         
         DS    XL8                                                              
ATCLAST  DS    XL1                                                              
         DS    XL2    INDICS=I                                                  
ATCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2168 BYTES                            
