*          DATA SET ACBATCBD   AT LEVEL 003 AS OF 09/16/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BCBD      DATE 09/16/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      6    2    9  L   P    H         T        Y              
CMBDATH  DS    CL8                                                              
CMBDAT   DS    CL8      6   18    8  A   U    N         T    I   Y   11         
CMBDATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      6   36    8  L   P    H         T        Y              
CMBDUEH  DS    CL8                                                              
CMBDUE   DS    CL9      6   53    9  A   U    N         T        Y   12         
CMBDUEX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12     7    2   12  L   P    H         T        Y              
CMBSYMH  DS    CL8                                                              
CMBSYM   DS    CL13     7   18   13  A   U    N         T        Y   13         
CMBSYMX  DS    CL8                                                              
CMBSYMNH DS    CL8                                                              
CMBSYMN  DS    CL43     7   36   43  A   P    N         T        Y   14         
CMBSYMNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      8    2    6  L   P    H         T        Y              
CMBCLIH  DS    CL8                                                              
CMBCLI   DS    CL3      8   18    3  A   U    N         T        Y   15         
CMBCLIX  DS    CL8                                                              
CMBCLINH DS    CL8                                                              
CMBCLIN  DS    CL36     8   36   36  A   P    N         T        Y   16         
CMBCLINX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9    2    7  L   P    H         T        Y              
CMBPROH  DS    CL8                                                              
CMBPRO   DS    CL3      9   18    3  A   U    N         T        Y   17         
CMBPROX  DS    CL8                                                              
CMBPRONH DS    CL8                                                              
CMBPRON  DS    CL36     9   36   36  A   P    N         T        Y   18         
CMBPRONX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     10    2    6  L   P    H         T        Y              
CMBOFFH  DS    CL8                                                              
CMBOFF   DS    CL2     10   18    2  A   U    N         T        Y   19         
CMBOFFX  DS    CL8                                                              
CMBOFFNH DS    CL8                                                              
CMBOFFN  DS    CL36    10   36   36  A   P    N         T        Y   20         
CMBOFFNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    11    2   11  L   P    H         T        Y              
CMBBILH  DS    CL8                                                              
CMBBIL   DS    CL6     11   18    6  A   U    N         T        Y   21         
CMBBILX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    11   36   11  L   P    H         T        Y              
CMBAMTH  DS    CL8                                                              
CMBAMT   DS    CL11    11   53   11  A   U    N         T        Y   22         
CMBAMTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    12    2   11  L   P    H         T        Y              
CMBNETH  DS    CL8                                                              
CMBNET   DS    CL11    12   18   11  A   U    N         T        Y   23         
CMBNETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    12   36   10  L   P    H         T        Y              
CMBCOMH  DS    CL8                                                              
CMBCOM   DS    CL20    12   53   20  A   U    N         T        Y   24         
CMBCOMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    13    2   13  L   P    H         T        Y              
CMBCDH   DS    CL8                                                              
CMBCD    DS    CL11    13   18   11  A   U    N         T        Y   25         
CMBCDX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    13   36   14  L   P    H         T        Y              
CMBSPLH  DS    CL8                                                              
CMBSPL   DS    CL11    13   53   11  A   U    N         T        Y   26         
CMBSPLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    14    2   14  L   P    H         T        Y              
CMBBLSRH DS    CL8                                                              
CMBBLSR  DS    CL12    14   18   12  A   U    N         T        Y   27         
CMBBLSRX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    14   36   13  L   P    H         T        Y              
CMBESTH  DS    CL8                                                              
CMBEST   DS    CL6     14   53    6  A   U    N         T        Y   28         
CMBESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     14   63    3  L   P    H         T        Y              
CMBMOSH  DS    CL8                                                              
CMBMOS   DS    CL8     14   68    8  A   U    N         T        Y   29         
CMBMOSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    15    2   11  A   P    H         T        Y              
CMBARH   DS    CL8                                                              
CMBAR    DS    CL14    15   18   14  A   U    N         T        Y   30         
CMBARX   DS    CL8                                                              
CMBARNH  DS    CL8                                                              
CMBARN   DS    CL36    15   36   36  A   P    N         T        Y   31         
CMBARNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    16    2   11  A   P    H         T        Y              
CMBAPH   DS    CL8                                                              
CMBAP    DS    CL14    16   18   14  A   U    N         T        Y   32         
CMBAPX   DS    CL8                                                              
CMBAPNH  DS    CL8                                                              
CMBAPN   DS    CL36    16   36   36  A   P    N         T        Y   33         
CMBAPNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    17    2   14  L   P    H         T        Y              
CMBNUMH  DS    CL8                                                              
CMBNUM   DS    CL60    17   18   60  A   U    N         T        Y   34         
CMBNUMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    18   30   15  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL12    19    2   12  L   P    H         T        Y              
CMBAGYH  DS    CL8                                                              
CMBAGY   DS    CL13    19   18   13  A   U    N         T        Y   35         
CMBAGYX  DS    CL8                                                              
CMBAGYNH DS    CL8                                                              
CMBAGYN  DS    CL36    19   36   36  A   P    N         T        Y   36         
CMBAGYNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    20    2   15  A   P    H         T        Y              
CMBPAYAH DS    CL8                                                              
CMBPAYA  DS    CL14    20   18   14  A   U    N         T        Y   37         
CMBPAYAX DS    CL8                                                              
CMBPAYNH DS    CL8                                                              
CMBPAYN  DS    CL36    20   36   36  A   P    N         T        Y   38         
CMBPAYNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    21    2   14  A   P    H         T        Y              
CMBORDH  DS    CL8                                                              
CMBORD   DS    CL11    21   18   11  A   U    N         T        Y   39         
CMBORDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    21   36   14  L   P    H         T        Y              
CMBPAYH  DS    CL8                                                              
CMBPAY   DS    CL11    21   53   11  A   U    N         T        Y   40         
CMBPAYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     22    2    9  L   P    H         T        Y              
CMBNARH  DS    CL8                                                              
CMBNAR   DS    CL50    22   18   50  A   U    N         T        Y   41         
CMBNARX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50    23   18   50  A   U    N         T        Y   42         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     23   71    1  A   U    N         T        Y              
CMBPFKH  DS    CL8                                                              
CMBPFK   DS    CL78    24    2   78  A   P    N         T        Y  255         
CMBPFKX  DS    CL8                                                              
         DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1744 BYTES                            
