*          DATA SET ACBATCFD   AT LEVEL 020 AS OF 02/08/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BCFD      DATE 02/08/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL11     6    3   11  A  P N             T        Y              
ATRDOCH  DS    XL8                                                              
ATRDOC   DS    CL6      6   16    6  A  U N             T    I   Y   11         
ATRDOCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
ATRDATH  DS    XL8                                                              
ATRDAT   DS    CL8      6   44    8  A  U N             T        Y   12         
ATRDATX  DS    XL8                                                              
ATRINTTH DS    XL8                                                              
ATRINTT  DS    CL6      6   58    6  A  P Z             T        Y              
ATRINTH  DS    XL8                                                              
ATRINT   DS    CL2      6   66    2  A  P N             T        Y   50         
ATRINTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      7    3    9  A  P N             T        Y              
ATRNARH  DS    XL8                                                              
ATRNAR   DS    CL55     7   16   55  A  U N             T        Y   13         
ATRNARX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL55     8   16   55  A  U N             T        Y   14         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      8   75    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    3    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10    7    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    10   23   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL19    10   40   19  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   60    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     10   69    6  A  P N             T        Y              
ATRDCH   DS    XL8                                                              
ATRDC    DS    CL2     11    3    2  A  U N             T        Y   15         
ATRDCX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    11    7   14  A  U N             T        Y   16         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    11   23   15  A  U N             T        Y   17         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    11   40   17  A  U N             T        Y   18         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     11   60    7  A  U N             T        Y   19         
         DS    XL8                                                              
ATRAMH   DS    XL8                                                              
ATRAM    DS    CL11    11   69   11  A  U N             T        Y   20         
ATRAMX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL67    12    3   67  A  P N             T        Y   21         
         DS    XL8                                                              
ATRDC2H  DS    XL8                                                              
ATRDC2   DS    CL2     13    3    2  A  U N             T        Y   22         
ATRDC2X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    13    7   14  A  U N             T        Y   23         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    13   23   15  A  U N             T        Y   24         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    13   40   17  A  U N             T        Y   25         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     13   60    7  A  U N             T        Y   26         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    13   69   11  A  U N             T        Y   27         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL67    14    3   67  A  P N             T        Y   28         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     15    3    2  A  U N             T        Y   29         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    15    7   14  A  U N             T        Y   30         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    15   23   15  A  U N             T        Y   31         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    15   40   17  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     15   60    7  A  U N             T        Y   33         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    15   69   11  A  U N             T        Y   34         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL67    16    3   67  A  P N             T        Y   35         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     17    3    2  A  U N             T        Y   36         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    17    7   14  A  U N             T        Y   37         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    17   23   15  A  U N             T        Y   38         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    17   40   17  A  U N             T        Y   39         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     17   60    7  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    17   69   11  A  U N             T        Y   41         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL67    18    3   67  A  P N             T        Y   42         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     19    3    2  A  U N             T        Y   43         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    19    7   14  A  U N             T        Y   44         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    19   23   15  A  U N             T        Y   45         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    19   40   17  A  U N             T        Y   46         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     19   60    7  A  U N             T        Y   47         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    19   69   11  A  U N             T        Y   48         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL67    20    3   67  A  P N             T        Y   49         
         DS    XL8                                                              
ATRTABH  DS    XL8                                                              
ATRTAB   DS    CL1     20   75    1  A  U N             T        Y              
ATRTOTH  DS    XL8                                                              
ATRTOT   DS    CL61    22   10   61  A  P N             T        Y   50         
ATRTOTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  255         
         DS    XL8                                                              
ATRLAST  DS    XL1                                                              
         DS    XL2    INDICS=I                                                  
ATRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1792 BYTES                            
