*          DATA SET ACBATF3D   AT LEVEL 007 AS OF 01/06/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BF3D      DATE 01/06/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
CSIORDH  DS    XL8                                                              
CSIORD   DS    CL8      6   15    8  A  U N             T    I   Y    8         
CSIORDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     6   25   12  A  P H             T        Y              
CSIORDAH DS    XL8                                                              
CSIORDA  DS    CL12     6   38   12  A  P H             T        Y   10         
CSIORDAX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15     6   51   15  A  P H             T        Y              
CSIORDNH DS    XL8                                                              
CSIORDN  DS    CL12     6   67   12  A  P H             T        Y   12         
CSIORDNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      7    2    9  A  P H             T        Y              
CSIDOCH  DS    XL8                                                              
CSIDOC   DS    CL27     7   15   27  A  U N             T        Y   14         
CSIDOCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      7   43    8  A  P H             T        Y              
CSIDATH  DS    XL8                                                              
CSIDAT   DS    CL8      7   53    8  A  U N             T        Y   16         
CSIDATX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      7   63    8  A  P H             T        Y              
CSIDUEH  DS    XL8                                                              
CSIDUE   DS    CL8      7   72    8  A  U N             T        Y   18         
CSIDUEX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     8    2   10  A  P H             T        Y              
CSIGONH  DS    XL8                                                              
CSIGON   DS    CL1      8   13    1  A  U N             T        Y   21         
CSIGONX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      8   17    8  A  P H             T        Y              
CSIGTYH  DS    XL8                                                              
CSIGTY   DS    CL1      8   26    1  A  U N             T        Y   23         
CSIGTYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     8   30   10  A  P H             T        Y              
CSIGAMH  DS    XL8                                                              
CSIGAM   DS    CL12     8   43   12  A  U N             T        Y   25         
CSIGAMX  DS    XL8                                                              
CSIGSTH  DS    XL8                                                              
CSIGST   DS    CL15     8   57   15  A  P H             T        Y   26         
CSIGSTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      9    2    8  A  P H             T        Y              
CSIPRVH  DS    XL8                                                              
CSIPRV   DS    CL2      9   13    2  A  U N             T        Y   27         
CSIPRVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      9   17    8  A  P H             T        Y              
CSIPTYH  DS    XL8                                                              
CSIPTY   DS    CL1      9   26    1  A  U N             T        Y   29         
CSIPTYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     9   30   10  A  P H             T        Y              
CSIPAMH  DS    XL8                                                              
CSIPAM   DS    CL12     9   43   12  A  U N             T        Y   31         
CSIPAMX  DS    XL8                                                              
CSIPSTH  DS    XL8                                                              
CSIPST   DS    CL15     9   57   15  A  P H             T        Y   32         
CSIPSTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    10    2   11  A  P H             T        Y              
CSIVENH  DS    XL8                                                              
CSIVEN   DS    CL50    10   15   50  A  U N             T        Y   33         
CSIVENX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     10   68    3  A  P H             T        Y              
CSIVCDH  DS    XL8                                                              
CSIVCD   DS    CL1     10   72    1  A  U N             T        Y   35         
CSIVCDX  DS    XL8                                                              
CSIVCDDH DS    XL8                                                              
CSIVCDD  DS    CL6     10   74    6  A  P H             T        Y   37         
CSIVCDDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    11    2   10  A  P H             T        Y              
CSIXVNH  DS    XL8                                                              
CSIXVN   DS    CL50    11   15   50  A  U N             T        Y   39         
CSIXVNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     11   68    3  A  P H             T        Y              
CSIXCDH  DS    XL8                                                              
CSIXCD   DS    CL1     11   72    1  A  U N             T        Y   41         
CSIXCDX  DS    XL8                                                              
CSIXCDDH DS    XL8                                                              
CSIXCDD  DS    CL6     11   74    6  A  P H             T        Y   43         
CSIXCDDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    12    2   12  A  P H             T        Y              
CSICSHH  DS    XL8                                                              
CSICSH   DS    CL15    12   15   15  A  U N             T        Y   45         
CSICSHX  DS    XL8                                                              
CSICSHNH DS    XL8                                                              
CSICSHN  DS    CL26    12   31   26  A  P H             T        Y   47         
CSICSHNX DS    XL8                                                              
CSIOVRTH DS    XL8                                                              
CSIOVRT  DS    CL8     12   57    8  A  P Z             T        Y              
CSIOVRH  DS    XL8                                                              
CSIOVR   DS    CL1     12   66    1  A  P N             T        Y   49         
CSIOVRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     12   68    6  A  P H             T        Y              
CSIURGH  DS    XL8                                                              
CSIURG   DS    CL1     12   75    1  A  U N             T        Y   51         
CSIURGX  DS    XL8                                                              
CSIFSTH  DS    XL8                                                              
CSIFST   DS    CL6     13    2    6  A  P H             T        Y              
CSIAMTH  DS    XL8                                                              
CSIAMT   DS    CL12    13   15   12  A  U N             T        Y   53         
CSIAMTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     13   30    8  A  P H             T        Y              
CSIWKCH  DS    XL8                                                              
CSIWKC   DS    CL5     13   40    5  A  U N             T        Y   55         
CSIWKCX  DS    XL8                                                              
CSIWKNH  DS    XL8                                                              
CSIWKN   DS    CL15    13   50   15  A  P H             T        Y   57         
CSIWKNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     14    2    6  A  P H             T        Y              
CSICLIH  DS    XL8                                                              
CSICLI   DS    CL3     14   15    3  A  U N             T        Y   59         
CSICLIX  DS    XL8                                                              
CSICLNH  DS    XL8                                                              
CSICLN   DS    CL36    14   23   36  A  P H             T        Y   61         
CSICLNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     15    2    7  A  P H             T        Y              
CSIPROH  DS    XL8                                                              
CSIPRO   DS    CL3     15   15    3  A  U N             T        Y   63         
CSIPROX  DS    XL8                                                              
CSIPRNH  DS    XL8                                                              
CSIPRN   DS    CL36    15   23   36  A  P H             T        Y   65         
CSIPRNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  P H             T        Y              
CSIJOBH  DS    XL8                                                              
CSIJOB   DS    CL6     16   15    6  A  U N             T        Y   67         
CSIJOBX  DS    XL8                                                              
CSIJONH  DS    XL8                                                              
CSIJON   DS    CL36    16   23   36  A  P H             T        Y   69         
CSIJONX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    17    2   11  A  P H             T        Y              
CSIEXAH  DS    XL8                                                              
CSIEXA   DS    CL15    17   15   15  A  U N             T        Y   71         
CSIEXAX  DS    XL8                                                              
CSIEXNH  DS    XL8                                                              
CSIEXN   DS    CL36    17   31   36  A  P H             T        Y   73         
CSIEXNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     18    2    6  A  P H             T        Y              
CSIDOFH  DS    XL8                                                              
CSIDOF   DS    CL2     18    9    2  A  U N             T        Y   75         
CSIDOFX  DS    XL8                                                              
CSIDONH  DS    XL8                                                              
CSIDON   DS    CL12    18   15   12  A  P H             T        Y   77         
CSIDONX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     18   30    6  A  P H             T        Y              
CSICOFH  DS    XL8                                                              
CSICOF   DS    CL2     18   38    2  A  U N             T        Y   79         
CSICOFX  DS    XL8                                                              
CSICONH  DS    XL8                                                              
CSICON   DS    CL12    18   41   12  A  P H             T        Y   81         
CSICONX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     18   57    6  A  P H             T        Y              
CSIAOFH  DS    XL8                                                              
CSIAOF   DS    CL2     18   64    2  A  U N             T        Y   83         
CSIAOFX  DS    XL8                                                              
CSIAONH  DS    XL8                                                              
CSIAON   DS    CL12    18   67   12  A  P H             T        Y   85         
CSIAONX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     19    2    4  A  P H             T        Y              
CSIDPTH  DS    XL8                                                              
CSIDPT   DS    CL3     19    7    3  A  U N             T        Y   87         
CSIDPTX  DS    XL8                                                              
CSIDPTNH DS    XL8                                                              
CSIDPTN  DS    CL22    19   15   22  A  P H             T        Y   89         
CSIDPTNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     19   40    6  A  P H             T        Y              
CSIPERH  DS    XL8                                                              
CSIPER   DS    CL7     19   47    7  A  U N             T        Y   91         
CSIPERX  DS    XL8                                                              
CSIPERNH DS    XL8                                                              
CSIPERN  DS    CL22    19   56   22  A  P H             T        Y   92         
CSIPERNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     20    2    9  A  P H             T        Y              
CSINARH  DS    XL8                                                              
CSINAR   DS    CL60    20   14   60  A  U N             T        Y   95         
CSINARX  DS    XL8                                                              
CSINAR2H DS    XL8                                                              
CSINAR2  DS    CL60    21   14   60  A  U N             T        Y   97         
CSINAR2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    22    2   13  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL5     22   16    5  A  P H             T        Y              
CSIBASH  DS    XL8                                                              
CSIBAS   DS    CL12    22   23   12  A  U N             T        Y   99         
CSIBASX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     22   37    6  A  P H             T        Y              
CSIGTOH  DS    XL8                                                              
CSIGTO   DS    CL1     22   45    1  A  U N             T        Y   93         
CSIGTOX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     22   48    6  A  P H             T        Y              
CSIPTOH  DS    XL8                                                              
CSIPTO   DS    CL1     22   56    1  A  U N             T        Y   94         
CSIPTOX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    22   60   11  A  P H             T        Y              
CSIPVOH  DS    XL8                                                              
CSIPVO   DS    CL2     22   74    2  A  U N             T        Y   96         
CSIPVOX  DS    XL8                                                              
CSITOTH  DS    XL8                                                              
CSITOT   DS    CL78    23    2   78  A  P H             T        Y   98         
CSITOTX  DS    XL8                                                              
CSIPFKH  DS    XL8                                                              
CSIPFK   DS    CL78    24    2   78  A  P H             T        Y  255         
CSIPFKX  DS    XL8                                                              
CSILAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
CSIWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2312 BYTES                            
