*          DATA SET ACBATE7D   AT LEVEL 014 AS OF 03/03/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BE7D      DATE 03/03/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      6    3    8  A   P    N         T        Y              
PICORDH  DS    CL8                                                              
PICORD   DS    CL8      6   16    8  A   U    N         T    I   Y   11         
PICORDX  DS    CL8                                                              
PICOHSTH DS    CL8                                                              
PICOHST  DS    CL40     6   32   40  A   P    N         T        Y   12         
PICOHSTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     7    3   11  A   P    N         T        Y              
PICDOCH  DS    CL8                                                              
PICDOC   DS    CL6      7   16    6  A   U    N         T        Y   13         
PICDOCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      8    3    4  A   P    N         T        Y              
PICDATH  DS    CL8                                                              
PICDAT   DS    CL8      8   16    8  A   U    N         T        Y   14         
PICDATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     9    3   11  A   P    N         T        Y              
PICDBTH  DS    CL8                                                              
PICDBT   DS    CL15     9   16   15  A   U    N         T        Y   15         
PICDBTX  DS    CL8                                                              
PICDBTNH DS    CL8                                                              
PICDBTN  DS    CL36     9   32   36  A   P    N         T        Y   16         
PICDBTNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    10    3   12  A   P    N         T        Y              
PICCRTH  DS    CL8                                                              
PICCRT   DS    CL15    10   16   15  A   U    N         T        Y   17         
PICCRTX  DS    CL8                                                              
PICCRTNH DS    CL8                                                              
PICCRTN  DS    CL36    10   32   36  A   P    N         T        Y   18         
PICCRTNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     10   69    6  A   P    Z         T        Y              
PICURGH  DS    CL8                                                              
PICURG   DS    CL1     10   76    1  A   P    Z         T        Y   20         
PICURGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     10   78    3  A   P    Z         T        Y              
PICCDH   DS    CL8                                                              
PICCD    DS    CL1     11    1    1  A   P    N         T        Y   22         
PICCDX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     11    3    6  A   P    N         T        Y              
PICAMTH  DS    CL8                                                              
PICAMT   DS    CL12    11   16   12  A   U    N         T        Y   23         
PICAMTX  DS    CL8                                                              
PICCDCDH DS    CL8                                                              
PICCDCD  DS    CL13    11   36   13  A   P    Z         T        Y   24         
PICCDCDX DS    CL8                                                              
PICDAMTH DS    CL8                                                              
PICDAMT  DS    CL10    11   51   10  A   P    Z         T        Y   25         
PICDAMTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12    3    7  A   P    N         T        Y              
PICFOFFH DS    CL8                                                              
PICFOFF  DS    CL2     12   16    2  A   U    N         T        Y   27         
PICFOFFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     12   32    6  A   P    N         T        Y              
PICCOFFH DS    CL8                                                              
PICCOFF  DS    CL2     12   40    2  A   U    N         T        Y   28         
PICCOFFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     12   53    6  A   P    N         T        Y              
PICPOFFH DS    CL8                                                              
PICPOFF  DS    CL2     12   61    2  A   U    N         T        Y   29         
PICPOFFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    13    3   10  A   P    N         T        Y              
PICFDPTH DS    CL8                                                              
PICFDPT  DS    CL3     13   16    3  A   U    N         T        Y   36         
PICFDPTX DS    CL8                                                              
PICFDPNH DS    CL8                                                              
PICFDPN  DS    CL36    13   32   36  A   P    N         T        Y   38         
PICFDPNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     14    3    8  A   P    N         T        Y              
PICSTFH  DS    CL8                                                              
PICSTF   DS    CL6     14   16    6  A   U    N         T        Y   39         
PICSTFX  DS    CL8                                                              
PICSTFNH DS    CL8                                                              
PICSTFN  DS    CL36    14   32   36  A   P    N         T        Y   40         
PICSTFNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     15    3    6  A   P    N         T        Y              
PICCLIH  DS    CL8                                                              
PICCLI   DS    CL6     15   16    6  A   U    N         T        Y   41         
PICCLIX  DS    CL8                                                              
PICCLINH DS    CL8                                                              
PICCLIN  DS    CL36    15   32   36  A   P    N         T        Y   42         
PICCLINX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     16    3    7  A   P    N         T        Y              
PICPROH  DS    CL8                                                              
PICPRO   DS    CL6     16   16    6  A   U    N         T        Y   43         
PICPROX  DS    CL8                                                              
PICPRONH DS    CL8                                                              
PICPRON  DS    CL36    16   32   36  A   P    N         T        Y   44         
PICPRONX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     17    3    6  A   P    N         T        Y              
PICVNDH  DS    CL8                                                              
PICVND   DS    CL14    17   16   14  A   U    N         T        Y   45         
PICVNDX  DS    CL8                                                              
PICVNDNH DS    CL8                                                              
PICVNDN  DS    CL36    17   32   36  A   P    N         T        Y   46         
PICVNDNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     18    3    6  A   P    N         T        Y              
PICSRCH  DS    CL8                                                              
PICSRC   DS    CL12    18   16   12  A   U    N         T        Y   47         
PICSRCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    19    3   13  A   P    N         T        Y              
PICPDPTH DS    CL8                                                              
PICPDPT  DS    CL3     19   18    3  A   U    N         T        Y   58         
PICPDPTX DS    CL8                                                              
PICPDPNH DS    CL8                                                              
PICPDPN  DS    CL36    19   32   36  A   P    N         T        Y   59         
PICPDPNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     20    3    9  A   P    N         T        Y              
PICNARH  DS    CL8                                                              
PICNAR   DS    CL49    20   16   49  A   U    N         T        Y   60         
PICNARX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL49    21   16   49  A   U    N         T        Y   61         
         DS    CL8                                                              
PICTABH  DS    CL8                                                              
PICTAB   DS    CL1     21   76    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A   P    N         T        Y  255         
         DS    CL8                                                              
PICLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
PICWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1472 BYTES                            
