*          DATA SET ACBATC2D   AT LEVEL 013 AS OF 03/04/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BC2D      DATE 03/04/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      6    3    8  A  P N             T        Y              
CHCORDH  DS    CL8                                                              
CHCORD   DS    CL11     6   16   11  A  U N             T    I   Y   11         
CHCORDX  DS    CL8                                                              
CHCOHSTH DS    CL8                                                              
CHCOHST  DS    CL40     6   32   40  A  P N             T        Y   12         
CHCOHSTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     7    3   11  A  P N             T        Y              
CHCDOCH  DS    CL8                                                              
CHCDOC   DS    CL13     7   16   13  A  U N             T        Y   13         
CHCDOCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7   32    4  A  P N             T        Y              
CHCDATH  DS    CL8                                                              
CHCDAT   DS    CL8      7   42    8  A  U N             T        Y   14         
CHCDATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      8    3    6  A  P N             T        Y              
CHCCLIH  DS    CL8                                                              
CHCCLI   DS    CL6      8   16    6  A  U N             T        Y   15         
CHCCLIX  DS    CL8                                                              
CHCCLINH DS    CL8                                                              
CHCCLIN  DS    CL36     8   32   36  A  P N             T        Y   16         
CHCCLINX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9    3    7  A  P N             T        Y              
CHCPROH  DS    CL8                                                              
CHCPRO   DS    CL6      9   16    6  A  U N             T        Y   17         
CHCPROX  DS    CL8                                                              
CHCPRONH DS    CL8                                                              
CHCPRON  DS    CL36     9   32   36  A  P N             T        Y   18         
CHCPRONX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     10    3    3  A  P N             T        Y              
CHCJOBH  DS    CL8                                                              
CHCJOB   DS    CL6     10   16    6  A  U N             T        Y   19         
CHCJOBX  DS    CL8                                                              
CHCJOBNH DS    CL8                                                              
CHCJOBN  DS    CL36    10   32   36  A  P N             T        Y   20         
CHCJOBNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    11    3   12  A  P N             T        Y              
CHCCRDH  DS    CL8                                                              
CHCCRD   DS    CL15    11   16   15  A  U N             T        Y   21         
CHCCRDX  DS    CL8                                                              
CHCCRDNH DS    CL8                                                              
CHCCRDN  DS    CL24    11   32   24  A  P N             T        Y   22         
CHCCRDNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     11   58    6  A  P N             T        Y              
CHCSRCH  DS    CL8                                                              
CHCSRC   DS    CL12    11   66   12  A  U N             T        Y   42         
CHCSRCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     12    3    6  A  P N             T        Y              
CHCSUPH  DS    CL8                                                              
CHCSUP   DS    CL15    12   16   15  A  U N             T        Y   40         
CHCSUPX  DS    CL8                                                              
CHCSUPNH DS    CL8                                                              
CHCSUPN  DS    CL36    12   32   36  A  P N             T        Y   41         
CHCSUPNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    13    3   12  A  P N             T        Y              
CHCWRKH  DS    CL8                                                              
CHCWRK   DS    CL11    13   16   11  A  U N             T        Y   23         
CHCWRKX  DS    CL8                                                              
CHCWCNMH DS    CL8                                                              
CHCWCNM  DS    CL49    13   32   49  A  P N             T        Y   24         
CHCWCNMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     14    3    9  A  P N             T        Y              
CHCAMTH  DS    CL8                                                              
CHCAMT   DS    CL40    14   16   40  A  U N             T        Y   25         
CHCAMTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14   57    6  A  P N             T        Y              
CHCCOFH  DS    CL8                                                              
CHCCOF   DS    CL2     14   64    2  A  U N             T        Y   50         
CHCCOFX  DS    CL8                                                              
CHCCOFNH DS    CL8                                                              
CHCCOFN  DS    CL11    14   67   11  A  P N             T        Y   51         
CHCCOFNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    15    3   12  A  P N             T        Y              
CHCNCWKH DS    CL8                                                              
CHCNCWK  DS    CL11    15   16   11  A  U N             T        Y   27         
CHCNCWKX DS    CL8                                                              
CHCWNNMH DS    CL8                                                              
CHCWNNM  DS    CL49    15   32   49  A  P N             T        Y   28         
CHCWNNMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     16    3    9  A  P N             T        Y              
CHCNCAH  DS    CL8                                                              
CHCNCA   DS    CL40    16   16   40  A  U N             T        Y   29         
CHCNCAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     17    3    8  A  P N             T        Y              
CHCGTYPH DS    CL8                                                              
CHCGTYP  DS    CL1     17   16    1  A  U N             T        Y   31         
CHCGTYPX DS    CL8                                                              
CHCGTYNH DS    CL8                                                              
CHCGTYN  DS    CL21    17   18   21  A  P N             T        Y   32         
CHCGTYNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    17   40   13  A  P N             T        Y              
CHCGORNH DS    CL8                                                              
CHCGORN  DS    CL1     17   56    1  A  U N             T        Y   33         
CHCGORNX DS    CL8                                                              
CHCGSTXH DS    CL8                                                              
CHCGSTX  DS    CL18    17   58   18  A  P N             T        Y   34         
CHCGSTXX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    18    3   10  A  P N             T        Y              
CHCGAMTH DS    CL8                                                              
CHCGAMT  DS    CL40    18   16   40  A  U N             T        Y   35         
CHCGAMTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     18   58    8  A  P N             T        Y              
CHCPROVH DS    CL8                                                              
CHCPROV  DS    CL2     18   67    2  A  U N             T        Y   52         
CHCPROVX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    19    3   11  A  P N             T        Y              
CHCEXPH  DS    CL8                                                              
CHCEXP   DS    CL15    19   16   15  A  U N             T        Y   38         
CHCEXPX  DS    CL8                                                              
CHCEXPNH DS    CL8                                                              
CHCEXPN  DS    CL24    19   32   24  A  P N             T        Y   39         
CHCEXPNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     19   57    9  A  P N             T        Y              
CHCFOFH  DS    CL8                                                              
CHCFOF   DS    CL2     19   67    2  A  U N             T        Y   48         
CHCFOFX  DS    CL8                                                              
CHCFOFNH DS    CL8                                                              
CHCFOFN  DS    CL11    19   70   11  A  P N             T        Y   49         
CHCFOFNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    20    3   12  A  P N             T        Y              
CHCAOFH  DS    CL8                                                              
CHCAOF   DS    CL2     20   16    2  A  U N             T        Y   46         
CHCAOFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     20   20    4  A  P N             T        Y              
CHCDEPH  DS    CL8                                                              
CHCDEP   DS    CL3     20   25    3  A  U N             T        Y   47         
CHCDEPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     20   30    6  A  P N             T        Y              
CHCSTFH  DS    CL8                                                              
CHCSTF   DS    CL6     20   37    6  A  U N             T        Y   36         
CHCSTFX  DS    CL8                                                              
CHCSTFNH DS    CL8                                                              
CHCSTFN  DS    CL36    20   44   36  A  P N             T        Y   37         
CHCSTFNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     21    3    9  A  P N             T        Y              
CHCNARH  DS    CL8                                                              
CHCNAR   DS    CL49    21   16   49  A  U N             T        Y   43         
CHCNARX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL49    22   16   49  A  U N             T        Y   44         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     22   70    1  A  U N             T        Y              
CHCTOTH  DS    CL8                                                              
CHCTOT   DS    CL25    23   16   25  A  P N             T        Y   45         
CHCTOTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  255         
         DS    CL8                                                              
CHCLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
CHCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1960 BYTES                            
