*          DATA SET ACBATA3D   AT LEVEL 001 AS OF 05/03/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BA3D      DATE 05/03/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL15     6    2   15  L  P N             T        Y              
PICDRAH  DS    CL8                                                              
PICDRA   DS    CL3      6   18    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      6   22    7  L  P N             T        Y              
PICDRDH  DS    CL8                                                              
PICDRD   DS    CL3      6   30    3  A  P N             T        Y              
PICDISH  DS    CL8                                                              
PICDIS   DS    CL40     6   34   40  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL14     8    6   14  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8   21    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL12     8   24   12  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8   37    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     8   40   10  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      8   53    5  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL14     8   59   14  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   74    6  L  P N             T        Y              
PICSUB1H DS    CL8                                                              
PICSUB1  DS    CL1      9    3    1  A  U N        M    T        Y  129         
PICSUB1X DS    CL8                                                              
PICDEB1H DS    CL8                                                              
PICDEB1  DS    CL14     9    6   14  A  U N             T    I   Y  130         
PICDEB1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2      9   21    2  A  U N             T        Y  131         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12     9   24   12  A  U N             T        Y  132         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      9   38    1  A  U N             T        Y  133         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12     9   40   12  A  U N             T        Y  134         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      9   53    5  A  U N             T        Y  135         
         DS    CL8                                                              
PICDAMTH DS    CL8                                                              
PICDAMT  DS    CL14     9   59   14  A  U N             T        Y  136         
PICDAMTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9   74    6  A  U N             T        Y  137         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL22    10    6   22  A  P N             T        Y  138         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50    10   29   50  A  U N             T        Y  139         
         DS    CL8                                                              
PICSUB2H DS    CL8                                                              
PICSUB2  DS    CL1     11    3    1  A  U N             T        Y  129         
PICSUB2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    11    6   14  A  U N             T        Y  130         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     11   21    2  A  U N             T        Y  131         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    11   24   12  A  U N             T        Y  132         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     11   38    1  A  U N             T        Y  133         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    11   40   12  A  U N             T        Y  134         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     11   53    5  A  U N             T        Y  135         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    11   59   14  A  U N             T        Y  136         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     11   74    6  A  U N             T        Y  137         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL22    12    6   22  A  P N             T        Y  138         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50    12   29   50  A  U N             T        Y  139         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13    3    1  A  U N             T        Y  129         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    13    6   14  A  U N             T        Y  130         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     13   21    2  A  U N             T        Y  131         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    13   24   12  A  U N             T        Y  132         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13   38    1  A  U N             T        Y  133         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    13   40   12  A  U N             T        Y  134         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     13   53    5  A  U N             T        Y  135         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    13   59   14  A  U N             T        Y  136         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     13   74    6  A  U N             T        Y  137         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL22    14    6   22  A  P N             T        Y  138         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50    14   29   50  A  U N             T        Y  139         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15    3    1  A  U N             T        Y  129         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    15    6   14  A  U N             T        Y  130         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     15   21    2  A  U N             T        Y  131         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    15   24   12  A  U N             T        Y  132         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15   38    1  A  U N             T        Y  133         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    15   40   12  A  U N             T        Y  134         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     15   53    5  A  U N             T        Y  135         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    15   59   14  A  U N             T        Y  136         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     15   74    6  A  U N             T        Y  137         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL22    16    6   22  A  P N             T        Y  138         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50    16   29   50  A  U N             T        Y  139         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17    3    1  A  U N             T        Y  129         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    17    6   14  A  U N             T        Y  130         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     17   21    2  A  U N             T        Y  131         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    17   24   12  A  U N             T        Y  132         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   38    1  A  U N             T        Y  133         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    17   40   12  A  U N             T        Y  134         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     17   53    5  A  U N             T        Y  135         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    17   59   14  A  U N             T        Y  136         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     17   74    6  A  U N             T        Y  137         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL22    18    6   22  A  P N             T        Y  138         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50    18   29   50  A  U N             T        Y  139         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19    3    1  A  U N             T        Y  129         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    19    6   14  A  U N             T        Y  130         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     19   21    2  A  U N             T        Y  131         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    19   24   12  A  U N             T        Y  132         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   38    1  A  U N             T        Y  133         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    19   40   12  A  U N             T        Y  134         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     19   53    5  A  U N             T        Y  135         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    19   59   14  A  U N             T        Y  136         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     19   74    6  A  U N             T        Y  137         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL22    20    6   22  A  P N             T        Y  138         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50    20   29   50  A  U N             T        Y  139         
         DS    CL8                                                              
PICTABH  DS    CL8                                                              
PICTAB   DS    CL1     21    3    1  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL13    23    2   13  L  P N             T        Y              
PICIVTH  DS    CL8                                                              
PICIVT   DS    CL13    23   16   13  A  P N             T        Y  140         
PICIVTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     23   31    9  L  P N             T        Y              
PICIPAH  DS    CL8                                                              
PICIPA   DS    CL13    23   41   13  A  P N             T        Y  141         
PICIPAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    23   56   10  L  P N             T        Y              
PICDIFH  DS    CL8                                                              
PICDIF   DS    CL13    23   67   13  A  P N             T        Y  142         
PICDIFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  255         
         DS    CL8                                                              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2392 BYTES                            
