*          DATA SET ACBATECD   AT LEVEL 003 AS OF 09/24/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BECD      DATE 09/24/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL12     6    3   12  A   P    N         T        Y              
TRADOCH  DS    CL8                                                              
TRADOC   DS    CL6      6   21    6  A   U    N         T    I   Y   11         
TRADOCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7    3    4  A   P    N         T        Y              
TRADATH  DS    CL8                                                              
TRADAT   DS    CL8      7   21    8  A   U    N         T        Y   12         
TRADATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      8    3    9  A   P    N         T        Y              
TRADACH  DS    CL8                                                              
TRADAC   DS    CL14     8   21   14  A   U    N         T        Y   13         
TRADACX  DS    CL8                                                              
TRADACNH DS    CL8                                                              
TRADACN  DS    CL36     8   37   36  A   P    N         T        Y   14         
TRADACNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15     9    3   15  A   P    N         T        Y              
TRAWRKDH DS    CL8                                                              
TRAWRKD  DS    CL2      9   21    2  A   U    N         T        Y   15         
TRAWRKDX DS    CL8                                                              
TRADWCNH DS    CL8                                                              
TRADWCN  DS    CL15     9   37   15  A   P    N         T        Y   16         
TRADWCNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    10    3   16  A   P    N         T        Y              
TRADCAH  DS    CL8                                                              
TRADCA   DS    CL15    10   21   15  A   U    N         T        Y   17         
TRADCAX  DS    CL8                                                              
TRADCANH DS    CL8                                                              
TRADCAN  DS    CL36    10   37   36  A   P    N         T        Y   18         
TRADCANX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    11    3   10  A   P    N         T        Y              
TRACACH  DS    CL8                                                              
TRACAC   DS    CL14    11   21   14  A   U    N         T        Y   19         
TRACACX  DS    CL8                                                              
TRACACNH DS    CL8                                                              
TRACACN  DS    CL36    11   37   36  A   P    N         T        Y   20         
TRACACNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    12    3   16  A   P    N         T        Y              
TRAWRKCH DS    CL8                                                              
TRAWRKC  DS    CL2     12   21    2  A   U    N         T        Y   21         
TRAWRKCX DS    CL8                                                              
TRACWCNH DS    CL8                                                              
TRACWCN  DS    CL15    12   37   15  A   P    N         T        Y   22         
TRACWCNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    13    3   17  A   P    N         T        Y              
TRACCAH  DS    CL8                                                              
TRACCA   DS    CL15    13   21   15  A   U    N         T        Y   23         
TRACCAX  DS    CL8                                                              
TRACCANH DS    CL8                                                              
TRACCAN  DS    CL36    13   37   36  A   P    N         T        Y   24         
TRACCANX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14    3    6  A   P    N         T        Y              
TRAAMTH  DS    CL8                                                              
TRAAMT   DS    CL10    14   21   10  A   U    N         T        Y    1         
TRAAMTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    15    3   14  A   P    N         T        Y   26         
         DS    CL8                                                              
TRANUMH  DS    CL8                                                              
TRANUM   DS    CL11    15   21   11  A   U    N         T        Y   27         
TRANUMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    16    3   12  A   P    N         T        Y              
TRASDTH  DS    CL8                                                              
TRASDT   DS    CL6     16   21    6  A   U    N         T        Y   28         
TRASDTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    17    3   17  A   P    N         T        Y              
TRANARH  DS    CL8                                                              
TRANAR   DS    CL49    17   21   49  A   U    N         T        Y   29         
TRANARX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     18   12    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL49    18   21   49  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     19   12    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL49    19   21   49  A   U    N         T        Y   31         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     20   12    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL49    20   21   49  A   U    N         T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21   21    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A   P    N         T        Y  255         
         DS    CL8                                                              
         DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1216 BYTES                            
