*          DATA SET ACBATFED   AT LEVEL 024 AS OF 02/14/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BFED      DATE 02/14/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      6    3    8  A  P N             T        Y              
INUORDH  DS    CL8                                                              
INUORD   DS    CL11     6   16   11  A  U N             T    I   Y   11         
INUORDX  DS    CL8                                                              
INUOHSTH DS    CL8                                                              
INUOHST  DS    CL40     6   32   40  A  P N             T        Y   12         
INUOHSTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     7    3   11  A  P N             T        Y              
INUDOCH  DS    CL8                                                              
INUDOC   DS    CL13     7   16   13  A  U N             T        Y   13         
INUDOCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7   32    4  A  P N             T        Y              
INUDATH  DS    CL8                                                              
INUDAT   DS    CL8      7   42    8  A  U N             T        Y   14         
INUDATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      8    3    6  A  P N             T        Y              
INUCLIH  DS    CL8                                                              
INUCLI   DS    CL6      8   16    6  A  U N             T        Y   15         
INUCLIX  DS    CL8                                                              
INUCLINH DS    CL8                                                              
INUCLIN  DS    CL36     8   32   36  A  P N             T        Y   16         
INUCLINX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9    3    7  A  P N             T        Y              
INUPROH  DS    CL8                                                              
INUPRO   DS    CL6      9   16    6  A  U N             T        Y   17         
INUPROX  DS    CL8                                                              
INUPRONH DS    CL8                                                              
INUPRON  DS    CL36     9   32   36  A  P N             T        Y   18         
INUPRONX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     10    3    3  A  P N             T        Y              
INUJOBH  DS    CL8                                                              
INUJOB   DS    CL6     10   16    6  A  U N             T        Y   19         
INUJOBX  DS    CL8                                                              
INUJOBNH DS    CL8                                                              
INUJOBN  DS    CL36    10   32   36  A  P N             T        Y   20         
INUJOBNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     11    3    6  A  P N             T        Y              
INUSUPH  DS    CL8                                                              
INUSUP   DS    CL15    11   16   15  A  U N             T        Y   21         
INUSUPX  DS    CL8                                                              
INUSUPNH DS    CL8                                                              
INUSUPN  DS    CL46    11   32   46  A  P N             T        Y   22         
INUSUPNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12    3    7  A  P N             T        Y              
INUURGH  DS    CL8                                                              
INUURG   DS    CL1     12   16    1  A  U N             T        Y   23         
INUURGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     12   32    3  A  P N             T        Y              
INUCDH   DS    CL8                                                              
INUCD    DS    CL1     12   37    1  A  U N             T        Y   24         
INUCDX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    13    3   12  A  P N             T        Y              
INUWRKH  DS    CL8                                                              
INUWRK   DS    CL11    13   16   11  A  U N             T        Y   25         
INUWRKX  DS    CL8                                                              
INUWCNMH DS    CL8                                                              
INUWCNM  DS    CL49    13   32   49  A  P N             T        Y   26         
INUWCNMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     14    3    9  A  P N             T        Y              
INUAMTH  DS    CL8                                                              
INUAMT   DS    CL40    14   16   40  A  U N             T        Y   27         
INUAMTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14   57    6  A  P N             T        Y              
INUCOFH  DS    CL8                                                              
INUCOF   DS    CL2     14   64    2  A  U N             T        Y   49         
INUCOFX  DS    CL8                                                              
INUCOFNH DS    CL8                                                              
INUCOFN  DS    CL11    14   67   11  A  P N             T        Y   50         
INUCOFNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    15    3   12  A  P N             T        Y              
INUNCWKH DS    CL8                                                              
INUNCWK  DS    CL11    15   16   11  A  U N             T        Y   29         
INUNCWKX DS    CL8                                                              
INUWNNMH DS    CL8                                                              
INUWNNM  DS    CL49    15   32   49  A  P N             T        Y   30         
INUWNNMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     16    3    9  A  P N             T        Y              
INUNCAH  DS    CL8                                                              
INUNCA   DS    CL40    16   16   40  A  U N             T        Y   31         
INUNCAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    17    3   11  A  P N             T        Y              
INUEXPH  DS    CL8                                                              
INUEXP   DS    CL15    17   16   15  A  U N             T        Y   40         
INUEXPX  DS    CL8                                                              
INUEXPNH DS    CL8                                                              
INUEXPN  DS    CL24    17   32   24  A  P N             T        Y   41         
INUEXPNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     17   57    9  A  P N             T        Y              
INUFOFH  DS    CL8                                                              
INUFOF   DS    CL2     17   67    2  A  U N             T        Y   47         
INUFOFX  DS    CL8                                                              
INUFOFNH DS    CL8                                                              
INUFOFN  DS    CL11    17   70   11  A  P N             T        Y   48         
INUFOFNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    18    3   12  A  P N             T        Y              
INUAOFH  DS    CL8                                                              
INUAOF   DS    CL2     18   16    2  A  U N             T        Y   45         
INUAOFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     18   20    4  A  P N             T        Y              
INUDEPH  DS    CL8                                                              
INUDEP   DS    CL3     18   25    3  A  U N             T        Y   46         
INUDEPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     18   30    6  A  P N             T        Y              
INUSTFH  DS    CL8                                                              
INUSTF   DS    CL6     18   37    6  A  U N             T        Y   38         
INUSTFX  DS    CL8                                                              
INUSTFNH DS    CL8                                                              
INUSTFN  DS    CL36    18   44   36  A  P N             T        Y   39         
INUSTFNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     19    3    9  A  P N             T        Y              
INUNARH  DS    CL8                                                              
INUNAR   DS    CL49    19   16   49  A  U N             T        Y   42         
INUNARX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL49    20   16   49  A  U N             T        Y   43         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20   70    1  A  U N             T        Y              
INUTOTH  DS    CL8                                                              
INUTOT   DS    CL25    23   16   25  A  P N             T        Y   44         
INUTOTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  255         
         DS    CL8                                                              
INULAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
INUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1648 BYTES                            
