*          DATA SET ACBATAAD   AT LEVEL 010 AS OF 09/10/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BAAD      DATE 09/10/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
BASDET1H DS    CL8                                                              
BASDET1  DS    CL79     4    2   79  L   P    H         T        Y  254         
BASDET1X DS    CL8                                                              
BASDET2H DS    CL8                                                              
BASDET2  DS    CL79     5    2   79  L   P    H         T        Y              
BASOLY2H DS    CL8                                                              
BASOLY2  DS    CL1      6    2    1  A   U    N         T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 200  BYTES                            
