*          DATA SET ACBATEBD   AT LEVEL 002 AS OF 06/12/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BEBD      DATE 06/12/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      6    3    9  A   P    N         T        Y              
ONEDOCH  DS    CL8                                                              
ONEDOC   DS    CL6      6   18    6  A   U    N         T    I   Y   11         
ONEDOCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7    3    4  A   P    N         T        Y              
ONEDATH  DS    CL8                                                              
ONEDAT   DS    CL9      7   18    9  A   U    N         T        Y   12         
ONEDATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    3    7  A   P    N         T        Y              
ONEACCH  DS    CL8                                                              
ONEACC   DS    CL14     8   18   14  A   U    N         T        Y   13         
ONEACCX  DS    CL8                                                              
ONEACCNH DS    CL8                                                              
ONEACCN  DS    CL36     8   34   36  A   P    N         T        Y   14         
ONEACCNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     9    3   14  A   P    N         T        Y              
ONECACH  DS    CL8                                                              
ONECAC   DS    CL15     9   18   15  A   U    N         T        Y   15         
ONECACX  DS    CL8                                                              
ONECACNH DS    CL8                                                              
ONECACN  DS    CL36     9   34   36  A   P    N         T        Y   16         
ONECACNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     10    3    9  A   P    N         T        Y              
ONEWRKH  DS    CL8                                                              
ONEWRK   DS    CL2     10   18    2  A   U    N         T        Y   17         
ONEWRKX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    11    3   12  A   P    N         T        Y              
ONEDRCRH DS    CL8                                                              
ONEDRCR  DS    CL2     11   18    2  A   U    N         T        Y   18         
ONEDRCRX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     12    3    6  A   P    N         T        Y              
ONEAMTH  DS    CL8                                                              
ONEAMT   DS    CL10    12   18   10  A   U    N         T        Y   19         
ONEAMTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     13    3    9  A   P    N         T        Y              
ONENARH  DS    CL8                                                              
ONENAR   DS    CL49    13   18   49  A   U    N         T        Y   20         
ONENARX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL49    14   18   49  A   U    N         T        Y   21         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL49    15   18   49  A   U    N         T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL49    16   18   49  A   U    N         T        Y   23         
         DS    CL8                                                              
ONETABH  DS    CL8                                                              
ONETAB   DS    CL1     17   18    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A   P    N         T        Y  255         
         DS    CL8                                                              
         DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 776  BYTES                            
