*          DATA SET ACBATDDD   AT LEVEL 002 AS OF 10/11/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BDDD      DATE 10/11/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL12     6    3   12  A  P N             T        Y              
BITDOCH  DS    XL8                                                              
BITDOC   DS    CL6      6   20    6  A  U N             T    I   Y   11         
BITDOCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      7    3    4  A  P N             T        Y              
BITDATH  DS    XL8                                                              
BITDAT   DS    CL8      7   20    8  A  U N             T        Y   12         
BITDATX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      8    3    6  A  P N             T        Y              
BITCLIH  DS    XL8                                                              
BITCLI   DS    CL6      8   20    6  A  U N             T        Y   13         
BITCLIX  DS    XL8                                                              
BITCLINH DS    XL8                                                              
BITCLIN  DS    CL36     8   36   36  A  P N             T        Y   14         
BITCLINX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    3    7  A  P N             T        Y              
BITPROH  DS    XL8                                                              
BITPRO   DS    CL6      9   20    6  A  U N             T        Y   15         
BITPROX  DS    XL8                                                              
BITPRONH DS    XL8                                                              
BITPRON  DS    CL36     9   36   36  A  P N             T        Y   16         
BITPRONX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     10    3    3  A  P N             T        Y              
BITJOBH  DS    XL8                                                              
BITJOB   DS    CL6     10   20    6  A  U N             T        Y   17         
BITJOBX  DS    XL8                                                              
BITJOBNH DS    XL8                                                              
BITJOBN  DS    CL36    10   36   36  A  P N             T        Y   18         
BITJOBNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     11    3    9  A  P N             T        Y              
BITWRKH  DS    XL8                                                              
BITWRK   DS    CL2     11   20    2  A  U N             T        Y   19         
BITWRKX  DS    XL8                                                              
BITWRKNH DS    XL8                                                              
BITWRKN  DS    CL15    11   36   15  A  P N             T        Y   20         
BITWRKNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12    3   10  A  P N             T        Y              
BITJAMTH DS    XL8                                                              
BITJAMT  DS    CL12    12   20   12  A  U N             T        Y   21         
BITJAMTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     12   36    3  A  P N             T        Y              
BITCDH   DS    XL8                                                              
BITCD    DS    CL1     12   40    1  A  U N             T        Y   22         
BITCDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     13    3    8  A  P N             T        Y              
BITSUPH  DS    XL8                                                              
BITSUP   DS    CL15    13   20   15  A  U N             T        Y   23         
BITSUPX  DS    XL8                                                              
BITSUPNH DS    XL8                                                              
BITSUPN  DS    CL36    13   36   36  A  P N             T        Y   24         
BITSUPNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    14    3   15  A  P N             T        Y              
BITSAMTH DS    XL8                                                              
BITSAMT  DS    CL12    14   20   12  A  U N             T        Y   25         
BITSAMTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    15    3   14  A  P N             T        Y              
BITINCH  DS    XL8                                                              
BITINC   DS    CL15    15   20   15  A  U N             T        Y   26         
BITINCX  DS    XL8                                                              
BITINCNH DS    XL8                                                              
BITINCN  DS    CL36    15   36   36  A  P N             T        Y   27         
BITINCNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    16    3   13  A  P N             T        Y              
BITIAMTH DS    XL8                                                              
BITIAMT  DS    CL12    16   20   12  A  U N             T        Y   28         
BITIAMTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    17    3   11  A  P N             T        Y              
BITNARH  DS    XL8                                                              
BITNAR   DS    CL49    17   20   49  A  U N             T        Y   29         
BITNARX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     18   12    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL49    18   20   49  A  U N             T        Y   30         
         DS    XL8                                                              
BITTABH  DS    XL8                                                              
BITTAB   DS    CL1     19   20    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  255         
         DS    XL8                                                              
BITLAST  DS    XL1                                                              
         DS    XL2    INDICS=I                                                  
BITWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1056 BYTES                            
