*          DATA SET ACBATD8D   AT LEVEL 004 AS OF 06/17/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BD8D      DATE 06/17/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  L   P    N         T        Y              
RETADVH  DS    CL8                                                              
RETADV   DS    CL2      6   12    2  A   U    N         T    I   Y   11         
RETADVX  DS    CL8                                                              
RETADVNH DS    CL8                                                              
RETADVN  DS    CL36     6   24   36  A   P    N         T        Y   12         
RETADVNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7    2    5  L   P    N         T        Y              
RETMEDH  DS    CL8                                                              
RETMED   DS    CL2      7   12    2  A   U    N         T        Y   13         
RETMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7   24    5  L   P    N         T        Y              
RETPROH  DS    CL8                                                              
RETPRO   DS    CL2      7   30    2  A   U    N         T        Y   14         
RETPROX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   34    6  L   P    N         T        Y              
RETSCH   DS    CL8                                                              
RETSC    DS    CL2      7   41    2  A   U    N         T        Y   15         
RETSCX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16     7   46   16  L   P    N         T        Y              
RETMOSH  DS    CL8                                                              
RETMOS   DS    CL6      7   63    6  A   U    N         T        Y   16         
RETMOSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      8    2    9  L   P    N         T        Y              
RETNARRH DS    CL8                                                              
RETNARR  DS    CL30     8   12   30  A   U    N         T        Y   17         
RETNARRX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    10    2   16  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL19    10   30   19  L   P    N         T        Y              
RETFMKTH DS    CL8                                                              
RETFMKT  DS    CL8     12    2    8  A   U    N         T        Y   18         
RETFMKTX DS    CL8                                                              
RETFCSHH DS    CL8                                                              
RETFCSH  DS    CL16    12   12   16  A   U    N         T        Y   19         
RETFCSHX DS    CL8                                                              
RETFOVRH DS    CL8                                                              
RETFOVR  DS    CL8     12   30    8  A   U    N         T        Y   20         
RETFOVRX DS    CL8                                                              
RETFNARH DS    CL8                                                              
RETFNAR  DS    CL30    12   40   30  A   U    N         T        Y   21         
RETFNARX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     13    2    8  A   U    N         T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    13   12   16  A   U    N         T        Y   23         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     13   30    8  A   U    N         T        Y   24         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL30    13   40   30  A   U    N         T        Y   25         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     14    2    8  A   U    N         T        Y   26         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    14   12   16  A   U    N         T        Y   27         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     14   30    8  A   U    N         T        Y   28         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL30    14   40   30  A   U    N         T        Y   29         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     15    2    8  A   U    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    15   12   16  A   U    N         T        Y   31         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     15   30    8  A   U    N         T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL30    15   40   30  A   U    N         T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     16    2    8  A   U    N         T        Y   34         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    16   12   16  A   U    N         T        Y   35         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     16   30    8  A   U    N         T        Y   36         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL30    16   40   30  A   U    N         T        Y   37         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     17    2    8  A   U    N         T        Y   38         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    17   12   16  A   U    N         T        Y   39         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     17   30    8  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL30    17   40   30  A   U    N         T        Y   41         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     18    2    8  A   U    N         T        Y   42         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    18   12   16  A   U    N         T        Y   43         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     18   30    8  A   U    N         T        Y   44         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL30    18   40   30  A   U    N         T        Y   45         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     19    2    8  A   U    N         T        Y   46         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    19   12   16  A   U    N         T        Y   47         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     19   30    8  A   U    N         T        Y   48         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL30    19   40   30  A   U    N         T        Y   49         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     20    2    8  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    20   12   16  A   U    N         T        Y   51         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     20   30    8  A   U    N         T        Y   52         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL30    20   40   30  A   U    N         T        Y   53         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     21    2    8  A   U    N         T        Y   54         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    21   12   16  A   U    N         T        Y   55         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     21   30    8  A   U    N         T        Y   56         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL30    21   40   30  A   U    N         T        Y   57         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     22    2    8  A   U    N         T        Y   58         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    22   12   16  A   U    N         T        Y   59         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     22   30    8  A   U    N         T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL30    22   40   30  A   U    N         T        Y   61         
         DS    CL8                                                              
RETTABH  DS    CL8                                                              
RETTAB   DS    CL1     22   77    1  A   U    N         T        Y              
RETPFKH  DS    CL8                                                              
RETPFK   DS    CL78    24    2   78  A   P    N         T        Y  255         
RETPFKX  DS    CL8                                                              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1832 BYTES                            
