*          DATA SET ACBATC1D   AT LEVEL 008 AS OF 02/14/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BC1D      DATE 02/14/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      6    3    8  A  P N             T        Y              
INCORDH  DS    CL8                                                              
INCORD   DS    CL11     6   16   11  A  U N             T    I   Y   11         
INCORDX  DS    CL8                                                              
INCOHSTH DS    CL8                                                              
INCOHST  DS    CL40     6   32   40  A  P N             T        Y   12         
INCOHSTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     7    3   11  A  P N             T        Y              
INCDOCH  DS    CL8                                                              
INCDOC   DS    CL13     7   16   13  A  U N             T        Y   13         
INCDOCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7   32    4  A  P N             T        Y              
INCDATH  DS    CL8                                                              
INCDAT   DS    CL8      7   42    8  A  U N             T        Y   14         
INCDATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      8    3    6  A  P N             T        Y              
INCCLIH  DS    CL8                                                              
INCCLI   DS    CL6      8   16    6  A  U N             T        Y   15         
INCCLIX  DS    CL8                                                              
INCCLINH DS    CL8                                                              
INCCLIN  DS    CL36     8   32   36  A  P N             T        Y   16         
INCCLINX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9    3    7  A  P N             T        Y              
INCPROH  DS    CL8                                                              
INCPRO   DS    CL6      9   16    6  A  U N             T        Y   17         
INCPROX  DS    CL8                                                              
INCPRONH DS    CL8                                                              
INCPRON  DS    CL36     9   32   36  A  P N             T        Y   18         
INCPRONX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     10    3    3  A  P N             T        Y              
INCJOBH  DS    CL8                                                              
INCJOB   DS    CL6     10   16    6  A  U N             T        Y   19         
INCJOBX  DS    CL8                                                              
INCJOBNH DS    CL8                                                              
INCJOBN  DS    CL36    10   32   36  A  P N             T        Y   20         
INCJOBNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     11    3    6  A  P N             T        Y              
INCSUPH  DS    CL8                                                              
INCSUP   DS    CL15    11   16   15  A  U N             T        Y   21         
INCSUPX  DS    CL8                                                              
INCSUPNH DS    CL8                                                              
INCSUPN  DS    CL46    11   32   46  A  P N             T        Y   22         
INCSUPNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12    3    7  A  P N             T        Y              
INCURGH  DS    CL8                                                              
INCURG   DS    CL1     12   16    1  A  U N             T        Y   23         
INCURGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     12   32    3  A  P N             T        Y              
INCCDH   DS    CL8                                                              
INCCD    DS    CL1     12   37    1  A  U N             T        Y   24         
INCCDX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    13    3   12  A  P N             T        Y              
INCWRKH  DS    CL8                                                              
INCWRK   DS    CL11    13   16   11  A  U N             T        Y   25         
INCWRKX  DS    CL8                                                              
INCWCNMH DS    CL8                                                              
INCWCNM  DS    CL49    13   32   49  A  P N             T        Y   26         
INCWCNMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     14    3    9  A  P N             T        Y              
INCAMTH  DS    CL8                                                              
INCAMT   DS    CL40    14   16   40  A  U N             T        Y   27         
INCAMTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14   57    6  A  P N             T        Y              
INCCOFH  DS    CL8                                                              
INCCOF   DS    CL2     14   64    2  A  U N             T        Y   49         
INCCOFX  DS    CL8                                                              
INCCOFNH DS    CL8                                                              
INCCOFN  DS    CL11    14   67   11  A  P N             T        Y   50         
INCCOFNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    15    3   12  A  P N             T        Y              
INCNCWKH DS    CL8                                                              
INCNCWK  DS    CL11    15   16   11  A  U N             T        Y   29         
INCNCWKX DS    CL8                                                              
INCWNNMH DS    CL8                                                              
INCWNNM  DS    CL49    15   32   49  A  P N             T        Y   30         
INCWNNMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     16    3    9  A  P N             T        Y              
INCNCAH  DS    CL8                                                              
INCNCA   DS    CL40    16   16   40  A  U N             T        Y   31         
INCNCAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     17    3    8  A  P N             T        Y              
INCGTYPH DS    CL8                                                              
INCGTYP  DS    CL1     17   16    1  A  U N             T        Y   33         
INCGTYPX DS    CL8                                                              
INCGTYNH DS    CL8                                                              
INCGTYN  DS    CL21    17   18   21  A  P N             T        Y   34         
INCGTYNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    17   40   13  A  P N             T        Y              
INCGORNH DS    CL8                                                              
INCGORN  DS    CL1     17   56    1  A  U N             T        Y   35         
INCGORNX DS    CL8                                                              
INCGSTXH DS    CL8                                                              
INCGSTX  DS    CL18    17   58   18  A  P N             T        Y   36         
INCGSTXX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    18    3   10  A  P N             T        Y              
INCGAMTH DS    CL8                                                              
INCGAMT  DS    CL40    18   16   40  A  U N             T        Y   37         
INCGAMTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     18   58    8  A  P N             T        Y              
INCPROVH DS    CL8                                                              
INCPROV  DS    CL2     18   67    2  A  U N             T        Y   51         
INCPROVX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    19    3   11  A  P N             T        Y              
INCEXPH  DS    CL8                                                              
INCEXP   DS    CL15    19   16   15  A  U N             T        Y   40         
INCEXPX  DS    CL8                                                              
INCEXPNH DS    CL8                                                              
INCEXPN  DS    CL24    19   32   24  A  P N             T        Y   41         
INCEXPNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     19   57    9  A  P N             T        Y              
INCFOFH  DS    CL8                                                              
INCFOF   DS    CL2     19   67    2  A  U N             T        Y   47         
INCFOFX  DS    CL8                                                              
INCFOFNH DS    CL8                                                              
INCFOFN  DS    CL11    19   70   11  A  P N             T        Y   48         
INCFOFNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    20    3   12  A  P N             T        Y              
INCAOFH  DS    CL8                                                              
INCAOF   DS    CL2     20   16    2  A  U N             T        Y   45         
INCAOFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     20   20    4  A  P N             T        Y              
INCDEPH  DS    CL8                                                              
INCDEP   DS    CL3     20   25    3  A  U N             T        Y   46         
INCDEPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     20   30    6  A  P N             T        Y              
INCSTFH  DS    CL8                                                              
INCSTF   DS    CL6     20   37    6  A  U N             T        Y   38         
INCSTFX  DS    CL8                                                              
INCSTFNH DS    CL8                                                              
INCSTFN  DS    CL36    20   44   36  A  P N             T        Y   39         
INCSTFNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     21    3    9  A  P N             T        Y              
INCNARH  DS    CL8                                                              
INCNAR   DS    CL49    21   16   49  A  U N             T        Y   42         
INCNARX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL49    22   16   49  A  U N             T        Y   43         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     22   70    1  A  U N             T        Y              
INCTOTH  DS    CL8                                                              
INCTOT   DS    CL25    23   16   25  A  P N             T        Y   44         
INCTOTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  255         
         DS    CL8                                                              
INCLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
INCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1896 BYTES                            
