*          DATA SET ACBATFDD   AT LEVEL 002 AS OF 06/12/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BFDD      DATE 06/12/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL12     6    3   12  A   P    N         T        Y              
TRADOCH  DS    CL8                                                              
TRADOC   DS    CL6      6   21    6  A   U    N         T    I   Y   11         
TRADOCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7    3    4  A   P    N         T        Y              
TRADATH  DS    CL8                                                              
TRADAT   DS    CL8      7   21    8  A   U    N         T        Y   12         
TRADATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      8    3    9  A   P    N         T        Y              
TRADACH  DS    CL8                                                              
TRADAC   DS    CL14     8   21   14  A   U    N         T        Y   13         
TRADACX  DS    CL8                                                              
TRADACNH DS    CL8                                                              
TRADACN  DS    CL36     8   37   36  A   P    N         T        Y   14         
TRADACNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15     9    3   15  A   P    N         T        Y              
TRAWRKDH DS    CL8                                                              
TRAWRKD  DS    CL2      9   21    2  A   U    N         T        Y   15         
TRAWRKDX DS    CL8                                                              
TRADWCNH DS    CL8                                                              
TRADWCN  DS    CL15     9   37   15  A   P    N         T        Y   16         
TRADWCNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    10    3   10  A   P    N         T        Y              
TRACACH  DS    CL8                                                              
TRACAC   DS    CL14    10   21   14  A   U    N         T        Y   17         
TRACACX  DS    CL8                                                              
TRACACNH DS    CL8                                                              
TRACACN  DS    CL36    10   37   36  A   P    N         T        Y   18         
TRACACNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    11    3   16  A   P    N         T        Y              
TRAWRKCH DS    CL8                                                              
TRAWRKC  DS    CL2     11   21    2  A   U    N         T        Y   19         
TRAWRKCX DS    CL8                                                              
TRACWCNH DS    CL8                                                              
TRACWCN  DS    CL15    11   37   15  A   P    N         T        Y   20         
TRACWCNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     12    3    6  A   P    N         T        Y              
TRAAMTH  DS    CL8                                                              
TRAAMT   DS    CL10    12   21   10  A   U    N         T        Y   21         
TRAAMTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    13    3   17  A   P    N         T        Y              
TRANARH  DS    CL8                                                              
TRANAR   DS    CL49    13   21   49  A   U    N         T        Y   22         
TRANARX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     14   12    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL49    14   21   49  A   U    N         T        Y   23         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     15   12    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL49    15   21   49  A   U    N         T        Y   24         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     16   12    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL49    16   21   49  A   U    N         T        Y   25         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   21    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A   P    N         T        Y  255         
         DS    CL8                                                              
         DS    CL1                                                              
         DS    CL2    INDICS=II                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 904  BYTES                            
