*          DATA SET ACBATACD   AT LEVEL 002 AS OF 09/10/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BACD      DATE 09/10/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      4    2    4  L   P    H         T        Y              
PLIITEH  DS    CL8                                                              
PLIITE   DS    CL4      4    7    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      4   13    4  L   P    H         T        Y              
PLIREFH  DS    CL8                                                              
PLIREF   DS    CL6      4   18    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      4   26    4  L   P    H         T        Y              
PLIDATH  DS    CL8                                                              
PLIDAT   DS    CL8      4   31    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL14     6    6   14  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL14     6   21   14  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3      6   36    3  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL13     6   40   13  L   P    H         T        Y              
PLIOTHTH DS    CL8                                                              
PLIOTHT  DS    CL23     6   57   23  A   P    H         T        Y              
PLIACTTH DS    CL8                                                              
PLIACTT  DS    CL3      7    2    3  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL14     7    6   14  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL14     7   21   14  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3      7   36    3  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL13     7   40   13  L   P    H         T        Y              
PLIOTHUH DS    CL8                                                              
PLIOTHU  DS    CL23     7   57   23  A   P    H         T        Y              
PLIACT1H DS    CL8                                                              
PLIACT1  DS    CL3      8    2    3  A   U    N         T        Y    1         
PLIACT1X DS    CL8                                                              
PLILIN1H DS    CL8                                                              
PLILIN1  DS    CL74     8    6   74  A   P    N         T        Y              
PLIACT2H DS    CL8                                                              
PLIACT2  DS    CL3      9    2    3  A   U    N         T        Y    1         
PLIACT2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74     9    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    10    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    11    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    12    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    13    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    14    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    15    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    16    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    17    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    18    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    19    6   74  A   P    N         T        Y              
PLINARH  DS    CL8                                                              
PLINAR   DS    CL14    20    6   14  L   P    H         T        Y              
PLINAR1H DS    CL8                                                              
PLINAR1  DS    CL50    20   21   50  A   U    N         T        Y              
PLINAR2H DS    CL8                                                              
PLINAR2  DS    CL50    21   21   50  A   U    N         T        Y              
PLINAR3H DS    CL8                                                              
PLINAR3  DS    CL50    22   21   50  A   U    N         T        Y              
PLINAR4H DS    CL8                                                              
PLINAR4  DS    CL50    23   21   50  A   U    N         T        Y              
PLIPFKH  DS    CL8                                                              
PLIPFK   DS    CL78    24    2   78  A   P    N         T        Y  255         
PLIPFKX  DS    CL8                                                              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1872 BYTES                            
