*          DATA SET ACBATWORK  AT LEVEL 093 AS OF 11/30/11                      
       ++INCLUDE ACGENWORK                                                      
         EJECT                                                                  
***********************************************************************         
* GLOBAL EQUATES                                                      *         
***********************************************************************         
         SPACE 1                                                                
HELPSCRN EQU   X'AB'               HELP SCREEN OVERLAY NUMBER                   
HEADSCRN EQU   X'AF'               BATCH HEADER SCREEN                          
DETLSCRN EQU   X'AA'               BATCH DETAIL SCREEN                          
PTXNSCRN EQU   X'A9'               POSTING TRANSACTION SCREEN                   
BLSTSCRN EQU   X'AE'               BATCH LIST SCREEN                            
ILSTSCRN EQU   X'AD'               ITEM LIST SCREEN                             
PLSTSCRN EQU   X'AC'               POSTING LIST SCREEN                          
CTRLSCRN EQU   X'A8'               CONTROLS SCREEN                              
TYPESCRN EQU   X'A7'               BATCH TYPE DEFINITION SCREEN                 
RPRTSCRN EQU   X'A2'               REPORT FORMAT SCREEN                         
BATROVER EQU   X'60'               BATCH RECORD OVERLAY                         
ITEMOVER EQU   X'61'               ITEM RECORD OVERLAY                          
POSTOVER EQU   X'62'               POSTING RECORD OVERLAY                       
CTRLOVER EQU   X'63'               CONTROLS OVERLAY                             
TYPEOVER EQU   X'64'               BATCH TYPE DEFINITION OVERLAY                
RPRTOVER EQU   X'65'               REPORT PRINTING OVERLAY                      
DETFLDNO EQU   254                 1ST BATCH DETAIL LINE FIELD NUMBER           
PFKFLDNO EQU   255                 PFKEY DISPLAY LINE FIELD NUMBER              
PFKDISPQ EQU   PFK01               PFKEY FOR DISPLAY                            
PFKBLISQ EQU   PFKDISPQ                   OR BATCH/LIST                         
PFKSAVEQ EQU   PFK02               PFKEY FOR SAVE                               
PFKOPENQ EQU   PFKSAVEQ                   OR BATCH/OPEN                         
PFKINPTQ EQU   PFKSAVEQ                   OR ITEM/INPUT                         
PFKRECLQ EQU   PFK03               PFKEY FOR RECALL                             
PFKPANAQ EQU   PFKRECLQ                   OR POSTING/ANALYSE                    
PFKPDISQ EQU   PFKRECLQ                   OR POSTING/DISPLAY                    
PFKCDISQ EQU   PFKRECLQ                   OR CONTROL/DISPLAY                    
PFKDRFTQ EQU   PFK04               PFKEY FOR DRAFT REPORT                       
PFKCCHAQ EQU   PFKDRFTQ                   OR CONTROL/CHANGE                     
PFKCLOSQ EQU   PFK05               PFKEY FOR CLOSE                              
PFKTMNTQ EQU   PFKCLOSQ                   OR TYPE/MAINTAIN                      
PFKRPRTQ EQU   PFKCLOSQ                   OR BATCH/REPORT                       
PFKUPDTQ EQU   PFK06               PFKEY FOR UPDATE                             
PFKBKWDQ EQU   PFK07               PFKEY FOR SCROLL BACKWARD                    
PFKTAX1Q EQU   PFKBKWDQ                   OR TAX (OVERLAY USE)                  
PFKCHNGQ EQU   PFKBKWDQ                   OR BATCH/CHANGE                       
PFKFRWDQ EQU   PFK08               PFKEY FOR SCROLL FORWARD                     
PFKILISQ EQU   PFKFRWDQ                   OR ITEM/LIST                          
PFKLEFTQ EQU   PFK09               PFKEY FOR SCROLL LEFT                        
PFKAUTOQ EQU   PFKLEFTQ                   OR AUTOMATIC FUNCTION                 
PFKRVRSQ EQU   PFKLEFTQ                   OR BATCH/REVERSE                      
PFKRGHTQ EQU   PFK10               PFKEY FOR SCROLL RIGHT                       
PFKTAX2Q EQU   PFKRGHTQ                   OR TAX (OVERLAY USE)                  
PFKNEXTQ EQU   PFK11               PFKEY FOR NEXT                               
PFKQUITQ EQU   PFK12               PFKEY FOR QUIT (RETURN)                      
PFKALTPQ EQU   PFK13               PFKEY FOR ALTERNATE PFKEY DISPLAY            
PFKRFSHQ EQU   PFK14               PFKEY FOR LIST REFRESH                       
*                                                                               
CSCURTAM EQU   CSCURT1             CURTAB ENTRY FOR BATCH AMOUNT                
CSCURTDR EQU   CSCURT2             CURTAB ENTRY FOR BATCH DEBITS                
CSCURTCR EQU   CSCURT3             CURTAB ENTRY FOR BATCH CREDITS               
*                                                                               
CSOIPLII EQU   X'80'               PROCESS LIST FOR ITEM/INPUT                  
CSOIFRST EQU   X'40'               FIRST TIME FOR CSOIPLII                      
CSOIOVRS EQU   X'20'               OVERLAY CALLED SUBSIDIARY SCREEN             
         SPACE 1                                                                
***********************************************************************         
* RECORD/ACTION EQUATES                                               *         
***********************************************************************         
         SPACE 1                                                                
RECBAT   EQU   1                   BATCH                                        
RECITE   EQU   2                   ITEM                                         
RECPST   EQU   3                   POSTING                                      
RECCON   EQU   4                   CONTROL                                      
RECTYP   EQU   5                   TYPE                                         
RECSCR   EQU   6                   SCREEN                                       
RECSIT   EQU   7                   SUBITEM                                      
*                                                                               
ACTOPN   EQU   1                   OPEN                                         
ACTDSP   EQU   2                   DISPLAY                                      
ACTLST   EQU   3                   LIST                                         
ACTUPD   EQU   4                   UPDATE                                       
ACTINP   EQU   5                   INPUT                                        
ACTCHA   EQU   6                   CHANGE                                       
ACTCLO   EQU   7                   CLOSE                                        
ACTREC   EQU   8                   RECALL                                       
ACTQUI   EQU   9                   QUIT                                         
ACTAPF   EQU   10                  ALTPF                                        
ACTFST   EQU   11                  FIRST                                        
ACTSAV   EQU   12                  SAVE                                         
ACTCOP   EQU   13                  COPY                                         
ACTREV   EQU   14                  REVERSE                                      
ACTSEL   EQU   15                  SELECT                                       
ACTANL   EQU   16                  ANALYSIS                                     
ACTNXT   EQU   17                  NEXT                                         
ACTDEL   EQU   18                  DELETE                                       
ACTAPR   EQU   19                  APPROVE                                      
ACTUAP   EQU   20                  UNAPPROVE                                    
ACTAUT   EQU   21                  AUTO                                         
ACTMNT   EQU   22                  MAINTAIN                                     
ACTGEN   EQU   23                  GENERATE                                     
ACTRFS   EQU   24                  REFRESH                                      
ACTRPT   EQU   25                  REPORT                                       
ACTPRT   EQU   26                  PRINT                                        
ACTGLU   EQU   27                  GENERAL LEDGER UPDATE                        
ACTACL   EQU   246                 AUTOCLOS (SPECIAL)                           
ACTIPR   EQU   247                 INPUT EXCHANGE RATE (SPECIAL)                
ACTDFR   EQU   248                 DEFAULT EXCHANGE RATE (SPECIAL)              
ACTFTR   EQU   249                 FT EXCHANGE RATE (SPECIAL)                   
ACTIUP   EQU   250                 INSTANT UPDATE (SPECIAL)                     
ACTACR   EQU   251                 ACCRUAL OPTION (SPECIAL)                     
ACTSCD   EQU   252                 SUNDRY CREDITOR OPTION (SPECIAL)             
ACTBNK   EQU   253                 SUBSIDIARY BANK OPTION (SPECIAL)             
         SPACE 2                                                                
***********************************************************************         
* BATCH PROGRAM LIST LEVELS                                           *         
***********************************************************************         
         SPACE 1                                                                
BCBATCUR EQU   BCLSTLV1                                                         
BCITECUR EQU   BCLSTLV2                                                         
BCPSTCUR EQU   BCLSTLV3                                                         
         SPACE 2                                                                
***********************************************************************         
* BRANCH CONDITION EQUATES                                            *         
***********************************************************************         
         SPACE 1                                                                
BEQ      EQU   X'80'               EQUAL                                        
BLQ      EQU   X'40'               LOW                                          
BHQ      EQU   X'20'               HIGH                                         
BPQ      EQU   X'20'               PLUS                                         
BOQ      EQU   X'10'               ONES       /  OVERFLOW                       
BMQ      EQU   X'40'               MIXED      /  MINUS                          
BZQ      EQU   X'80'               ZEROES     /  ZERO                           
BNEQ     EQU   X'70'               NOT EQUAL                                    
BNLQ     EQU   X'B0'               NOT LOW                                      
BNHQ     EQU   X'D0'               NOT HIGH                                     
BNPQ     EQU   X'D0'               NOT PLUS                                     
BNOQ     EQU   X'E0'               NOT ONES   /  NOT OVERFLOW                   
BNMQ     EQU   X'B0'               NOT MIXED  /  NOT MINUS                      
BNZQ     EQU   X'70'               NOT ZEROES /  NOT ZERO                       
         EJECT                                                                  
***********************************************************************         
* BATCH OVERLAY TABLE                                                 *         
***********************************************************************         
         SPACE 1                                                                
OVRTABD  DSECT                                                                  
OVRTYPE  DS    XL1                 BATCH TYPE                                   
OVRNAME  DS    XL4                 BATCH TYPE NAME                              
OVRSCRN  DS    XL1                 SCREEN NUMBER                                
OVROVER  DS    XL1                 OVERLAY NUMBER                               
OVRAUTH1 DS    XL1                 AUTHORISATION INDICATORS - 1                 
OVRAUTH2 DS    XL1                 AUTHORISATION INDICATORS - 2                 
OVRCTRY  DS    XL1                 COUNTRY FILTER                               
OVRINDS1 DS    XL1                 OVERLAY INDICATORS - 1                       
OVRINDS2 DS    XL1                 OVERLAY INDICATORS - 2                       
OVRINDS3 DS    XL1                 OVERLAY INDICATORS - 2                       
         DS    XL8                 N/D                                          
OVRTABL  EQU   *-OVRTABD                                                        
         EJECT                                                                  
***********************************************************************         
* BATCH TYPE TABLE                                                    *         
***********************************************************************         
         SPACE 1                                                                
TYPTABD  DSECT                                                                  
TYPNUM   DS    XL1                 BATCH TYPE NUMBER (SEE BELOW)                
TYPOLAY  DS    XL1                 BATCH TYPE OVERLAY (SEE BELOW)               
TYPSCRN  DS    XL1                 BATCH OVERLAY SCREEN (SEE BELOW)             
TYPGRUP  DS    XL1                 GROUP CODE (SEE TBAKGRUP EQUATES)            
TYPINDS  DS    0XL8                BATCH TYPE INDICATORS                        
TYPIND1  DS    XL1                 INDICATORS - ONE                             
TYPIACRL EQU   X'80'               ACCRUAL BATCH TYPE                           
TYPICSHR EQU   X'40'               CASH RECEIPT BATCH TYPE                      
TYPIADVP EQU   X'20'               ADVANCE PAYMENT BATCH TYPE                   
TYPIXLOK EQU   X'10'               IGNORE MONTH OF SERVICE LOCK                 
TYPIORDS EQU   X'08'               BATCH TYPE PROCESSES ORDER RECORDS           
TYPIOMEM EQU   X'04'               BATCH TYPE CAN HAVE ORDER MEMOS              
TYPICUMU EQU   X'02'               BATCH TYPE ACCUMULATES TOTAL DRS/CRS         
TYPIACRV EQU   X'01'               ACCRUAL REVERSAL BATCH TYPE                  
TYPIND2  DS    XL1                 INDICATORS - TWO                             
TYPIDDS  EQU   X'80'               DDS ONLY BATCH TYPE                          
TYPINOD  EQU   X'40'               DON'T DISPLAY AT ALL                         
TYPIOSC  EQU   X'20'               BATCH OVERLAY SETS SCREEN                    
TYPIOPF  EQU   X'10'               OVERLAY CHECKS PFKEY                         
TYPIBIL  EQU   X'08'               SET CSBMAXAM TO 1 BILLION                    
TYPINOU  EQU   X'04'               CAN'T UPDATE BATCH ONLINE                    
TYPICBG  EQU   X'02'               TYPE CREATED BY ACBG                         
TYPIMLT  EQU   X'01'               MULTIPLE ITEM/CHANGE SUPPORTED               
TYPIND3  DS    XL1                 INDICATORS - THREE                           
TYPIMSCR EQU   X'80'               MULTIPLE ITEM/INPUT SCREENS                  
TYPIMITE EQU   X'40'               MULTIPLE ITEM RECORDS PER ITEM/INPUT         
TYPIANAR EQU   X'20'               TYPE GENERATES AUTOMATIC NARRATIVE           
TYPIMANB EQU   X'10'               CHECK FOR MANUAL BILLING NARRATIVE           
TYPIMSIC EQU   X'08'               TYPIMSCR - ITEM/CHANGE SUPPORTED             
TYPIMAXI EQU   X'07'               ITEM LIMITS FOR CLOSE (0-7 IN 50'S)          
TYPIT050 EQU   0                   50 ITEMS                                     
TYPIT100 EQU   1                   100 ITEMS                                    
TYPIT150 EQU   2                   150 ITEMS                                    
TYPIT200 EQU   3                   200 ITEMS                                    
TYPIT250 EQU   4                   250 ITEMS                                    
TYPIT300 EQU   5                   300 ITEMS                                    
TYPIT350 EQU   6                   350 ITEMS                                    
TYPIT400 EQU   7                   400 ITEMS                                    
TYPIND4  DS    XL1                 INDICATORS - FOUR                            
TYPIPAUT EQU   X'80'               PRESERVE AUTHORISED STATUS ON COPY           
TYPIBGIC EQU   X'40'               BATCH/GENERATE, ITEM/CHANGE N/A              
TYPIBACO EQU   X'20'               BATCH/COPY N/A                               
TYPIBARV EQU   X'10'               BATCH/REVERSE N/A                            
TYPIMAXU EQU   X'07'               ITEM LIMITS FOR UPDATE (0-7 IN 50'S)         
TYPIND5  DS    XL1                 INDICATORS - FIVE                            
TYPIDORU EQU   X'80'               DON'T UPDATE ORDER RECORDS                   
TYPIHRTX EQU   X'40'               BATCH TYPE ACCUMULATES HOURS/TAX             
TYPIOVTY EQU   X'20'               OVERLAY PROVIDES TRANSACTION TYPE            
TYPIFCUR EQU   X'10'               BATCH TYPE MAY BE FOREIGN CURRENCY           
TYPICURO EQU   X'08'               BATCH TYPE IS CURRENCY ONLY                  
TYPIASIR EQU   X'04'               AUTO SELECT ALL ITEMS FOR REVERSE            
TYPIOVSS EQU   X'02'               OVERLAY CALLS SUB-SCREEN                     
TYPINODC EQU   X'01'               NO DATA REQUIRED FOR ITEM/CHANGE             
TYPIND6  DS    XL1                 INDICATORS - SIX                             
TYPDRUL  EQU   TYPIND6             'DEBIT' RULES                                
TYPIHOUR EQU   X'80'               AMOUNT IS HOURS                              
TYPIUNIT EQU   X'40'               AMOUNT IS UNITS                              
TYPIINTG EQU   X'20'               AMOUNT IS INTEGER VALUE                      
TYPIDP03 EQU   X'03'               EDIT VALUE TO 3 DP                           
TYPIDP02 EQU   X'02'               EDIT VALUE TO 2 DP                           
TYPIDP01 EQU   X'01'               EDIT VALUE TO 1 DP                           
TYPIND7  DS    XL1                 INDICATORS - SEVEN                           
TYPCRUL  EQU   TYPIND7             'CREDIT' RULES (SEE TYPDRUL EQUATES)         
TYPIND8  DS    XL1                 INDICATORS - EIGHT                           
TYPITIME EQU   X'80'               TIME BATCH (BT17/49)                         
TYPIDCSA EQU   X'40'               DR/CR SUBSIDIARILY ACCUMULATED               
TYPIXOVL EQU   X'20'               USE OSVALS FOR SCREEN AREA                   
TYPIDETL EQU   X'10'               DETAIL ENTRY                                 
TYPIDISP EQU   X'08'               SPECIAL DISPLAY ONLY TYPE                    
TYPNUM2  DS    XL1                 SECOND BATCH TYPE                            
TYPCTRY  DS    XL1                 COUNTRY (ZERO MEANS ALL COUNTRIES)           
TYPPFMSK DS    XL2                 PFKEY MASK                                   
         DS    XL2                 N/D                                          
TYPNAME  DS    XL4                 DICTIONARY DCDDL                             
TYPTABL  EQU   *-TYPTABD           LENGTH OF ONE ENTRY                          
*                                                                               
BT01     EQU   1                   BATCH TYPE EQUATES                           
BT02     EQU   2                                                                
BT03     EQU   3                                                                
BT04     EQU   4                                                                
BT05     EQU   5                                                                
BT06     EQU   6                                                                
BT07     EQU   7                   ** =BIL **                                   
BT08     EQU   8                                                                
BT09     EQU   9                                                                
BT10     EQU   10                                                               
BT11     EQU   11                                                               
BT13     EQU   13                                                               
BT14     EQU   14                                                               
BT15     EQU   15                                                               
BT16     EQU   16                                                               
BT17     EQU   17                                                               
BT18     EQU   18                                                               
BT19     EQU   19                                                               
BT20     EQU   20                                                               
BT21     EQU   21                                                               
BT22     EQU   22                                                               
BT23     EQU   23                                                               
BT24     EQU   24                                                               
BT25     EQU   25                                                               
BT26     EQU   26                                                               
BT27     EQU   27                                                               
BT30     EQU   30                                                               
BT31     EQU   31                                                               
BT33     EQU   33                                                               
BT34     EQU   34                                                               
BT35     EQU   35                                                               
BT36     EQU   36                  ** =INP OR =MAR CREDITOR/MANUAL **           
BT37     EQU   37                  ** =MAR BANK/VOID **                         
BT38     EQU   38                                                               
BT39     EQU   39                                                               
BT40     EQU   40                  ** ACCRUAL REVERSAL FROM BT39 **             
BT41     EQU   41                                                               
BT42     EQU   42                                                               
BT43     EQU   43                                                               
BT44     EQU   44                  ** ACCRUAL REVERSAL FROM BT43 **             
BT45     EQU   45                                                               
BT46     EQU   46                                                               
BT47     EQU   47                                                               
BT48     EQU   48                  ** =BIL BT47 REVERSAL **                     
BT49     EQU   49                                                               
BT51     EQU   51                                                               
BT52     EQU   52                                                               
BT53     EQU   53                                                               
BT54     EQU   54                  ** ACCRUAL REVERSAL FROM BT53 **             
BT55     EQU   55                                                               
BT56     EQU   56                  ** ACCRUAL REVERSAL FROM BT55 **             
BT57     EQU   57                  ** =BIL WRITE-OFF **                         
BT58     EQU   58                  ** =INT **                                   
BT59     EQU   59                                                               
BT60     EQU   60                                                               
BT61     EQU   61                                                               
BT62     EQU   62                                                               
BT63     EQU   63                  ** INTERCOMPANY POSTINGS (A21) **            
BT70     EQU   70                                                               
BT71     EQU   71                                                               
BT72     EQU   72                                                               
BT75     EQU   75                                                               
BT79     EQU   79                  ** EXCHANGE DIFFS. (BILLING) **              
BT81     EQU   81                                                               
BT97     EQU   97                  ** CA COST ALLOCATION (MOS LOCK) **          
BT98     EQU   98                  ** MEDIA BILLING TRANSFER **                 
BT99     EQU   99                  ** =WFM **                                   
*                                                                               
BTO01    EQU   X'01'               OVERLAY EQUATES                              
BTO01G   EQU   X'35'                                                            
BTO02    EQU   X'02'                                                            
BTO03    EQU   X'01'               ** BTO01 **                                  
BTO03G   EQU   X'35'                                                            
BTO03U   EQU   X'03'                                                            
BTO04    EQU   X'01'               ** BTO01 **                                  
BTO05    EQU   X'05'                                                            
BTO06    EQU   X'06'                                                            
BTO08    EQU   X'08'                                                            
BTO10    EQU   X'0A'                                                            
BTO11    EQU   X'0B'                                                            
BTO13    EQU   X'0D'                                                            
BTO14    EQU   X'0E'                                                            
BTO15    EQU   X'0E'               ** BTO14 **                                  
BTO16    EQU   X'10'                                                            
BTO17    EQU   X'11'                                                            
BTO18    EQU   X'12'                                                            
BTO19    EQU   X'13'                                                            
BTO20    EQU   X'12'                                                            
BTO21    EQU   X'15'                                                            
BTO21G   EQU   X'38'                                                            
**O21H   EQU   X'3C'                                                            
BTO22    EQU   X'15'                                                            
BTO22G   EQU   X'38'                                                            
BTO23    EQU   X'15'                                                            
BTO24    EQU   X'15'                                                            
BTO25    EQU   X'19'                                                            
BTO26    EQU   X'1A'                                                            
BTO26G   EQU   X'0C'                                                            
BTO27    EQU   X'1B'                                                            
BTO30    EQU   X'1E'                                                            
BTO31    EQU   X'1F'                                                            
BTO33    EQU   X'21'                                                            
BTO34    EQU   X'22'                                                            
BTO35    EQU   X'23'                                                            
BTO36    EQU   X'24'                                                            
BTO36G   EQU   X'3A'                                                            
BTO37    EQU   X'25'                                                            
BTO38    EQU   X'26'                                                            
BTO39    EQU   X'05'               ** BTO05 **                                  
BTO41    EQU   X'1B'               ** BTO27 **                                  
BTO42    EQU   X'1A'               ** BTO26 **                                  
BTO43    EQU   X'0B'               ** BTO11 **                                  
BTO45    EQU   X'2D'                                                            
BTO46    EQU   X'2E'                                                            
BTO47    EQU   X'2F'                                                            
BTO49    EQU   X'39'                                                            
BTO49U   EQU   X'31'                                                            
BTO51    EQU   X'33'                                                            
BTO52    EQU   X'34'                                                            
BTO53    EQU   X'2D'               ** BTO45 **                                  
BTO55    EQU   X'1A'               ** BTO26 **                                  
BTO59    EQU   X'3B'                                                            
BTO60    EQU   X'3C'                                                            
BTO61    EQU   X'3D'                                                            
BTO62    EQU   X'3E'                                                            
BTO70    EQU   X'0A'                                                            
BTO70G   EQU   X'0D'                                                            
BTO71    EQU   X'0A'                                                            
BTO71G   EQU   X'0D'                                                            
BTO72    EQU   X'48'                                                            
BTO75    EQU   X'4B'                                                            
BTO81    EQU   X'51'                                                            
*                                                                               
BTS01    EQU   X'FE'               OVERLAY SCREEN EQUATES                       
BTS01C   EQU   X'C1'                                                            
BTS01G   EQU   X'CA'                                                            
BTS201U  EQU   X'C9'               SECONDARY SCREEN US/CANADA                   
BTS02    EQU   X'FD'                                                            
BTS03    EQU   X'FC'                                                            
BTS03G   EQU   X'C9'                                                            
BTS03C   EQU   X'C2'                                                            
BTS05    EQU   X'FA'                                                            
BTS06    EQU   X'F9'                                                            
BTS06C   EQU   X'E2'                                                            
BTS08    EQU   X'F7'                                                            
BTS08G   EQU   X'F6'                                                            
BTS10    EQU   X'F8'               MULTIPLE INPUT                               
BTS10D   EQU   X'F5'               DETAIL INPUT                                 
BTS10C   EQU   X'FB'               CANADIAN MULTIPLE                            
BTS10CD  EQU   X'F3'               CANADIAN DETAIL SINGLE                       
BTS11    EQU   X'F4'                                                            
BTS13    EQU   X'A1'                                                            
BTS14    EQU   X'F1'                                                            
BTS15    EQU   X'F0'                                                            
BTS16    EQU   X'EF'                                                            
BTS17    EQU   X'ED'                                                            
BTS18    EQU   X'EC'                                                            
BTS18G   EQU   X'EA'                                                            
BTS19    EQU   X'EB'                                                            
BTS20    EQU   X'EC'                                                            
BTS21    EQU   X'E9'                                                            
BTS21C   EQU   X'C8'                                                            
BTS21G   EQU   X'C7'                                                            
**S21H   EQU   X'BF'                                                            
BTS22    EQU   X'E8'                                                            
BTS22C   EQU   X'C7'               ** REUSED SCREEN# (SEE BTS21G) **            
BTS22G   EQU   X'C6'                                                            
BTS23    EQU   X'E7'                                                            
BTS23C   EQU   X'C6'               ** REUSED SCREEN# (SEE BTS22G) **            
BTS24    EQU   X'E6'                                                            
BTS25    EQU   X'E5'                                                            
BTS26    EQU   X'E4'                                                            
BTS26G   EQU   X'C4'                                                            
BTS26C   EQU   X'C0'                                                            
BTS27    EQU   X'E3'                                                            
BTS30    EQU   X'E0'                                                            
BTS31    EQU   X'DE'                                                            
BTS33    EQU   X'DD'                                                            
BTS33C   EQU   X'C4'               ** REUSED SCREEN# (SEE BTS26G) **            
BTS34    EQU   X'DB'                                                            
BTS35    EQU   X'D8'                                                            
BTS36    EQU   X'D7'                                                            
BTS36G   EQU   X'C5'                                                            
BTS37    EQU   X'D6'                                                            
BTS38    EQU   X'D5'                                                            
BTS39    EQU   X'D3'                                                            
BTS41    EQU   X'D2'                                                            
BTS42    EQU   X'D1'                                                            
BTS43    EQU   X'D0'                                                            
BTS45    EQU   X'CF'                                                            
BTS46    EQU   X'CE'                                                            
BTS46C   EQU   X'C5'               ** REUSED SCREEN# (SEE BTS36G) **            
BTS47    EQU   X'CD'                                                            
BTS49    EQU   X'CC'                                                            
BTS49U   EQU   X'ED'               ** SECONDARY SCREEN                          
BTS51    EQU   X'CB'                                                            
BTS52    EQU   X'CA'               ** REUSED SCREEN# (SEE BTS01G) **            
BTS53    EQU   X'CF'               ** BTS45 **                                  
BTS55    EQU   X'E4'               ** BTS26 **                                  
BTS55C   EQU   X'C0'               ** BTS26C **                                 
BTS59    EQU   X'C3'                                                            
BTS60    EQU   X'BD'               ALSO USES X'BC'                              
BTS61    EQU   X'E1'               ALSO USES X'EA'                              
BTS62    EQU   X'F2'                                                            
BTS62U   EQU   X'EE'               TAX SCREEN                                   
BTS70    EQU   X'A6'                                                            
BTS70G   EQU   X'A4'                                                            
BTS71    EQU   X'A6'                                                            
BTS71G   EQU   X'A4'                                                            
BTS72    EQU   X'BB'                                                            
BTS72C   EQU   X'BA'               CANADIAN                                     
BTS75    EQU   X'B4'                                                            
BTS81    EQU   X'B5'                                                            
         EJECT                                                                  
***********************************************************************         
* BATCH OVERLAY PFKEY MASKS                                           *         
***********************************************************************         
BPFKTAX  EQU   X'8000'             TAX                                          
BPFKINV  EQU   X'4000'             INVOICE                                      
BPFKMUL  EQU   X'2000'             MULTIPLE                                     
BPFKDTL  EQU   X'1000'             DETAIL                                       
BPFKFIS  EQU   X'0800'             FIS                                          
         SPACE 1                                                                
         EJECT                                                                  
***********************************************************************         
* LIST/SELECT TABLE DEFINITIONS FOR BATCH PROGRAM                     *         
***********************************************************************         
         SPACE 1                                                                
LSTTABD  DSECT                                                                  
         ORG   LSTTKEY             ** BATCH RECORD **                           
LSTBBTYP DS    XL1                 BATCH TYPE                                   
LSTBUSER DS    XL2                 USER-ID NUMBER                               
LSTBADDT DS    XL2                 BATCH ADDED DATE                             
LSTBGRUP DS    CL1                 BATCH TYPE GROUP                             
LSTBEFDT DS    XL2                 EFFECTIVE DATE (COMPRESSED)                  
LSTBMOSP DS    PL2                 BATCH MONTH OF SERVICE - PWOS                
LSTBREFN DS    0CL6                BATCH REFERENCE                              
LSTBMOSC DS    CL2                 BATCH MONTH OF SERVICE - CHARACTER           
LSTBBREF DS    CL4                 BATCH REFERENCE                              
LSTBOFFC DS    CL2                 LIMIT ACCESS OFFICE CODE                     
LSTBBCHR DS    XL2                 BATCHER NUMBER                               
LSTBIBNO DS    XL2                 INPUT BATCHER NUMBER                         
LSTBAPNO DS    XL2                 BATCH APPROVER NUMBER                        
LSTBHDS1 DS    XL1                 BATCH HEADER ELEMENT STATUS - 1              
LSTBIND2 DS    XL1                 INDICATORS - 2                               
LSTBIMLT EQU   X'80'               MULTIPLE ITEM/CHANGE SUPPORTED               
LSTBIMSI EQU   X'40'               TYPIMSCR - ITEM/CHANGE SUPPORTED             
LSTBICUM EQU   X'20'               BATCH ACCUMULATES TOTAL DRS/CRS              
LSTBIHTX EQU   X'10'               BATCH ACCUMULATES HOURS/TAX                  
LSTBISIN EQU   X'08'               BATCH CONTAINS SPLIT INVOICE ITEMS           
LSTBDISP EQU   X'04'               BATCH IS DISPLAY ONLY                        
LSTBADPP EQU   X'01'               ADDED DATE IN BATCH PASSIVE POINTER          
LSTBNAME DS    CL15                BATCH NAME                                   
LSTBITMC DS    XL2                 ITEM CONTROL                                 
LSTBITMA DS    XL2                 ITEMS ADDED SO FAR                           
LSTBCSHC DS    PL6                 CASH CONTROL                                 
LSTBCSHA DS    PL6                 CASH ADDED SO FAR                            
LSTBINDS DS    XL1                 INDICATORS                                   
LSTBIPPD EQU   X'80'               DELETED PASSIVE POINTER EXISTS               
LSTBIAPD EQU   X'40'               DELETED ACTIVE POINTER EXISTS                
LSTBINFY EQU   X'20'               USER NOTIFIED CONTROLS EXCEEDED              
LSTBIAUT EQU   X'10'               AUTO ACTION INVOKED                          
LSTBIIUP EQU   X'08'               INSTANT UPDATE BATCH                         
LSTBINPT EQU   X'04'               BATCH INPUT IN PROGRESS                      
LSTBBCBG EQU   X'02'               BATCH CREATED BY ACBG                        
LSTBACRV EQU   X'01'               BATCH IS AN ACCRUAL REVERSAL                 
LSTBTDRS DS    PL8                 TOTAL DEBITS IN BATCH                        
LSTBTCRS DS    PL8                 TOTAL CREDITS IN BATCH                       
LSTBPID  DS    CL8                 BATCHER NAME                                 
LSTBDELI DS    XL2                 NUMBER OF DELETED ITEMS IN BATCH             
LSTBHISN DS    XL2                 HIGHEST SCREEN NUMBER                        
LSTBSEQN DS    XL1                 DUPLICATE BATCH SEQUENCE NUMBER              
LSTBHDS2 DS    XL1                 BATCH HEADER ELEMENT STATUS - 2              
*                                                                               
         ORG   LSTTKEY             ** BATCH ITEM RECORDS **                     
LSTISEQ  DS    XL2                 SEQUENCE NUMBER                              
LSTIREF  DS    XL(L'BIAREF)        REFERENCE                                    
LSTIAMT  DS    PL6                 AMOUNT                                       
LSTIACC1 DS    XL(L'ACTKCULA)      ACCOUNT#1                                    
LSTIACC2 DS    XL(L'ACTKCULA)      ACCOUNT#2                                    
LSTIDATE DS    XL(L'TRNKDATE)      DATE                                         
LSTIREF2 DS    XL(L'BIAREF)        REFERENCE FOR COPY/REVERSE ITEM              
LSTIDAT2 DS    XL(L'TRNKDATE)      DATE FOR COPY/REVERSE ITEM                   
LSTIIND1 DS    XL1                 ITEM RECORD INDICATOR - 1                    
LSTI1SEL EQU   X'80'               SELECTED FOR COPY/REVERSE/GENERATE           
LSTI1DSP EQU   X'40'               DISPLAY ONLY (DON'T ALLOW SELECT)            
LSTI1AUT EQU   X'20'               ITEM 'AUTO GENERATED' BY UPDATE              
LSTI1SIN EQU   X'10'               ITEM CONTAINS GINELS                         
LSTI1SPI EQU   X'08'               ITEM IS A SPLIT INVOICE                      
LSTISNO  DS    XL2                 SCREEN NUMBER                                
LSTISIS  DS    XL1                 SCREEN ITEM SEQUENCE                         
LSTIFCUR DS    XL(L'AFCCURR)       FOREIGN CURRENCY CODE (OR ZEROES)            
LSTIFAMT DS    PL6                 FOREIGN CURRENCY AMOUNT                      
LSTINASK DS    XL1                 NUMBER OF ASKELS ON ITEM RECORD              
*                                                                               
         ORG   LSTTKEY             ** POSTING RECORDS **                        
LSTPSEQ  DS    XL1                 SEQUENCE NUMBER                              
LSTPACT  DS    XL(L'TRNKCULA)      ACCOUNT                                      
LSTPKOF  DS    CL(L'TRNKOFF)       OFFICE/ANALYSIS CODE IN KEY                  
LSTPCAC  DS    XL(L'TRNKCULC)      CONTRA-ACCOUNT                               
LSTPOFF  DS    XL(L'TRNOFFC)       OFFICE                                       
LSTPSTAT DS    XL(L'TRNSTAT)       STATUS                                       
LSTPAMT  DS    PL6                 AMOUNT                                       
LSTPOTHR DS    CL25                OTHER INFORMATION                            
LSTPTRS1 DS    XL(L'TRSSTAT)       STATUS 1                                     
LSTPTRS2 DS    XL(L'TRSSTAT2)      STATUS 2                                     
LSTPTRS3 DS    XL(L'TRSSTAT3)      STATUS 3                                     
LSTPIND1 DS    XL1                 POSTING RECORD INDICATOR - 1                 
LSTP1JEX EQU   X'80'               MAIN JOB/EXP POSTING (SPLIT INVOICE)         
*                                                                               
LMBATOPN EQU   X'8000'                                                          
LMBATDSP EQU   X'4000'                                                          
LMBATUPD EQU   X'2000'                                                          
LMBATCHA EQU   X'1000'                                                          
LMBATCLO EQU   X'0800'                                                          
LMBATRCL EQU   X'0400'                                                          
LMBATSAV EQU   X'0200'                                                          
LMBATDEL EQU   X'0100'                                                          
LMBATAPR EQU   X'0080'                                                          
LMBATUAP EQU   X'0040'                                                          
LMITELST EQU   X'0020'                                                          
LMITECOP EQU   X'0010'                                                          
LMITEREV EQU   X'0008'                                                          
LMITEGEN EQU   X'0004'                                                          
LMBATPRT EQU   X'0002'                                                          
LMBATGLU EQU   X'0001'                                                          
*                                                                               
LMITEDSP EQU   X'8000'                                                          
LMITEDEL EQU   X'4000'                                                          
LMITEINP EQU   X'2000'                                                          
LMITECHA EQU   X'1000'                                                          
LMISESEL EQU   X'0800'             ITEM/SELECT SELECT                           
LMISEDES EQU   X'0400'             ITEM/SELECT DESELECT                         
LMISECHA EQU   X'0200'             ITEM/SELECT CHANGE (REF/DATE)                
LMPSTLST EQU   X'0100'                                                          
*                                                                               
LMPSTDSP EQU   X'0080'                                                          
LMPSTANL EQU   X'0040'                                                          
LMPSTCHA EQU   X'0020'                                                          
         EJECT                                                                  
***********************************************************************         
* HEADER DISPLAY TABLE                                                *         
***********************************************************************         
         SPACE 1                                                                
HDRTABD  DSECT                                                                  
HDRNHIGH EQU   X'80'               INTENSITY OF NAME FIELD                      
HDR1PROT EQU   X'40'               PROTECTED (ON=PROT, OFF=UNPROT)              
HDR1HIGH EQU   X'20'               INTENSITY (ON=HIGH, OFF=LOW)                 
HDR1DISP EQU   X'10'               DISPLAY   (ON=DISP, OFF=BLANK)               
HDR2PROT EQU   X'04'               PROTECTED (ON=PROT, OFF=UNPROT)              
HDR2HIGH EQU   X'02'               INTENSITY (ON=HIGH, OFF=LOW)                 
HDR2DISP EQU   X'01'               DISPLAY   (ON=DISP, OFF=BLANK)               
HDRH1DH  EQU   HDRNHIGH+HDR1DISP+HDR1HIGH                                       
HDRH1DP  EQU   HDRNHIGH+HDR1DISP+HDR1PROT                                       
HDRH1DHP EQU   HDRNHIGH+HDR1DISP+HDR1HIGH+HDR1PROT                              
HDR1DH   EQU   HDR1DISP+HDR1HIGH                                                
HDR1DP   EQU   HDR1DISP+HDR1PROT                                                
HDR1DHP  EQU   HDR1DISP+HDR1HIGH+HDR1PROT                                       
HDR2DH   EQU   HDR2DISP+HDR2HIGH                                                
HDR2DP   EQU   HDR2DISP+HDR2PROT                                                
HDR2DHP  EQU   HDR2DISP+HDR2HIGH+HDR2PROT                                       
*                                                                               
HDRHED1  DS    AL2                 COLUMN 1 HEADING                             
HDRHED2  DS    AL2                 COMUMN 2 HEADING                             
*                                                                               
HDRNAME  DS    AL2                 FIELD NAME DISPLACEMENT                      
HDRINDS  DS    XL1                 FIELD DISPLAY INDICATORS                     
         ORG   HDRNAME                                                          
HDRUIDN  DS    AL2                 USER-ID                                      
HDRUIDI  DS    XL1                 FIELD INDICATORS                             
HDRREFN  DS    AL2                 REFERENCE                                    
HDRREFI  DS    XL1                 FIELD INDICATORS                             
HDRNAMN  DS    AL2                 NAME                                         
HDRNAMI  DS    XL1                 FIELD INDICATORS                             
HDRITYN  DS    AL2                 INPUT TYPE                                   
HDRITYI  DS    XL1                 FIELD INDICATORS                             
HDRMOAN  DS    AL2                 MONTH OF ACTIVITY                            
HDRMOAI  DS    XL1                 FIELD INDICATORS                             
HDRCRDN  DS    AL2                 CREATED DATE                                 
HDRCRDI  DS    XL1                 FIELD INDICATORS                             
HDREFDN  DS    AL2                 EFFECTIVE DATE                               
HDREFDI  DS    XL1                 FIELD INDICATORS                             
HDRIUPN  DS    AL2                 INSTANT UPDATE                               
HDRIUPI  DS    XL1                 FIELD INDICATORS                             
HDRPERN  DS    AL2                 PERSON                                       
HDRPERI  DS    XL1                 FIELD INDICATORS                             
HDRSTAN  DS    AL2                 STATUS                                       
HDRSTAI  DS    XL1                 FIELD INDICATORS                             
HDRITCN  DS    AL2                 ITEM COUNT                                   
HDRITCI  DS    XL1                 FIELD INDICATORS                             
HDRITAN  DS    AL2                 ITEMS INPUT                                  
HDRITAI  DS    XL1                 FIELD INDICATORS                             
HDRAMCN  DS    AL2                 AMOUNT CONTROL                               
HDRAMCI  DS    XL1                 FIELD INDICATORS                             
HDRAMAN  DS    AL2                 AMOUNT INPUT                                 
HDRAMAI  DS    XL1                 FIELD INDICATORS                             
HDRACRN  DS    AL2                 ACCRUAL                                      
HDRACRI  DS    XL1                 FIELD INDICATORS                             
HDRAPRN  DS    AL2                 APPROVER                                     
HDRAPRI  DS    XL1                 FIELD INDICATORS                             
HDRCOMI  DS    XL1                 COMMENT FIELD INDICATORS                     
HDRTABL  EQU   *-HDRTABD                                                        
         EJECT                                                                  
***********************************************************************         
* TERMINAL WORK AREA DSECT                                            *         
***********************************************************************         
         SPACE 1                                                                
TWAD     DSECT                                                                  
         ORG   TWASCR                                                           
       ++INCLUDE ACBATFFD                                                       
         ORG   BASOLY1H                                                         
       ++INCLUDE ACBATAAD                                                       
         ORG   BASOLY1H                                                         
       ++INCLUDE ACBATAFD                                                       
*                                                                               
         ORG   OSSAVE                                                           
PSVALS   DS    0XL256              ** SAVED PRODUCTION VALUES **                
*                                                                               
PSCLIVLS DS    0X                  CLIENT VALUES                                
PSCLICOD DS    CL6                 CLIENT CODE                                  
PSCLIPPR DS    XL55                CLIENT PROFILE ELEMENT                       
PSCLIDA  DS    XL4                 CLIENT RECORD DISK ADDRESS                   
         DS    XL2                 N/D                                          
PSCLIVLL EQU   *-PSCLIVLS                                                       
*                                                                               
PSPROVLS DS    0X                  PRODUCT VALUES                               
PSPROCOD DS    CL6                 PRODUCT CODE                                 
PSPROPPR DS    XL55                PRODUCT PROFILE ELEMENT                      
PSPRODA  DS    XL4                 PRODUCT RECORD DISK ADDRESS                  
         DS    XL2                 N/D                                          
PSPROVLL EQU   *-PSPROVLS                                                       
*                                                                               
PSJOBVLS DS    0X                  JOB VALUES                                   
PSJOBCOD DS    CL6                 JOB CODE                                     
PSJOBPPR DS    XL55                JOB PROFILE ELEMENT                          
PSJOBDA  DS    XL4                 JOB RECORD DISK ADDRESS                      
         DS    XL2                 N/D                                          
PSJOBVLL EQU   *-PSJOBVLS                                                       
*                                                                               
PSCOMPPR DS    XL55                COMPOSITE C/P/J PROFILE                      
*                                                                               
         ORG   BSDICT                                                           
BSDICTU  DS    0CL768              ** UPPER CASE EXPRESSIONS **                 
UC@PFKEY DS    CL2,C               PF                                           
UC@ALTPF DS    CL8                 ALTPFS                                       
UC@HELP  DS    CL4                 HELP                                         
UC@BAT   DS    CL(RECNAMLQ)        BATCH                                        
UC@ITEM  DS    CL(RECNAMLQ)        ITEM                                         
UC@PSTG  DS    CL(RECNAMLQ)        POSTING                                      
UC@CLOSE DS    CL(ACTNAMLQ)        CLOSE                                        
UC@DSP   DS    CL(ACTNAMLQ)        DISPLAY                                      
UC@LIST  DS    CL(ACTNAMLQ)        LIST                                         
UC@UPD   DS    CL(ACTNAMLQ)        UPDATE                                       
UC@OPEN  DS    CL(ACTNAMLQ)        OPEN (VERB)                                  
UC@CHG   DS    CL(ACTNAMLQ)        CHANGE                                       
UC@INP   DS    CL(ACTNAMLQ)        INPUT                                        
UC@RECAL DS    CL(ACTNAMLQ)        RECALL                                       
UC@QUIT  DS    CL(ACTNAMLQ)        QUIT                                         
UC@FIRST DS    CL(ACTNAMLQ)        FIRST                                        
UC@APRV  DS    CL(ACTNAMLQ)        APPROVE                                      
UC@SAVE  DS    CL(ACTNAMLQ)        SAVE                                         
UC@MANBL DS    CL15                MANUAL BILLING                               
UC@DELD  DS    CL8                 DELETED                                      
UC@CLSD  DS    CL8                 CLOSED                                       
UC@UPDTD DS    CL8                 UPDATED                                      
UC@INSUP DS    CL8                 INSTANT (UPDATE)                             
UC@APRVD DS    CL8                 APPROVED                                     
UC@SAVED DS    CL8                 SAVED                                        
UC4OPEN  DS    CL4                 OPEN (VERB)                                  
UC3DELD  DS    CL3                 DELETED                                      
UC3CLSD  DS    CL3                 CLOSED                                       
UC3UPDTD DS    CL3                 UPDATED                                      
UC3INSUP DS    CL3                 INSTANT UPDATE                               
UC3APRVD DS    CL3                 APPROVED                                     
UC3SAVED DS    CL3                 SAVED                                        
UC@CRTD  DS    CL10                CREATED                                      
UC@EFF   DS    CL10                EFFECTIVE                                    
UC8USRID DS    CL(OPTNAMLQ)        USER-ID                                      
UC3USRID DS    CL(OPTSHTLQ)                                                     
UC8PRSN  DS    CL(OPTNAMLQ)        PERSON                                       
UC3PRSN  DS    CL(OPTSHTLQ)                                                     
UC8GROUP DS    CL(OPTNAMLQ)        GROUP                                        
UC3GROUP DS    CL(OPTSHTLQ)                                                     
UC8REF   DS    CL(OPTNAMLQ)        REFERENCE                                    
UC3REF   DS    CL(OPTSHTLQ)                                                     
UC8OFF   DS    CL(OPTNAMLQ)        OFFICE                                       
UC3OFF   DS    CL(OPTSHTLQ)                                                     
UC8DSP   DS    CL(OPTNAMLQ)        DISPLAY                                      
UC3DSP   DS    CL(OPTSHTLQ)                                                     
UC8APRVR DS    CL(OPTNAMLQ)        APPROVER                                     
UC3APRVR DS    CL(OPTSHTLQ)                                                     
UC8DATE  DS    CL(OPTNAMLQ)        DATE                                         
UC3DATE  DS    CL(OPTSHTLQ)                                                     
UC8AMT   DS    CL(OPTNAMLQ)        AMOUNT                                       
UC3AMT   DS    CL(OPTSHTLQ)                                                     
UC8ACC   DS    CL(OPTNAMLQ)        ACCOUNT                                      
UC3ACC   DS    CL(OPTSHTLQ)                                                     
UC@COPY  DS    CL(ACTNAMLQ)        COPY (VERB)                                  
UC@RVRS  DS    CL(ACTNAMLQ)        REVERSE                                      
UC@SEL   DS    CL(ACTNAMLQ)        SELECT                                       
UC@ANL1  DS    CL(ACTNAMLQ)        ANALYSIS                                     
UC@NXT   DS    CL(ACTNAMLQ)        NEXT                                         
UC@YES   DS    CL4                 YES                                          
UC@NO    DS    CL4                 NO                                           
UC@DEL   DS    CL(ACTNAMLQ)        DELETE                                       
UC@UAPRV DS    CL(ACTNAMLQ)        UNAPPROVE                                    
UC8GRPID DS    CL(OPTNAMLQ)        GROUPID                                      
UC3GRPID DS    CL(OPTSHTLQ)                                                     
UC8ALLID DS    CL(OPTNAMLQ)        ALLIDS                                       
UC3ALLID DS    CL(OPTSHTLQ)                                                     
UC8ACRL  DS    CL(OPTNAMLQ)        ACCRUAL                                      
UC@RVRSL DS    CL10                REVERSAL                                     
UC@ONLY  DS    CL10                ONLY                                         
UC@MAX   DS    CL(ACTNAMLQ)        MAXIMUM                                      
UC@PAGE  DS    CL(ACTNAMLQ)        PAGE                                         
UC@HALF  DS    CL(ACTNAMLQ)        HALF                                         
UC8ACT   DS    CL(OPTNAMLQ)        ACTION                                       
UC3ACT   DS    CL(OPTSHTLQ)                                                     
UC@AUTO  DS    CL(ACTNAMLQ)        AUTO                                         
UC@CNTRL DS    CL(RECNAMLQ)        CONTROL                                      
UC@NONE  DS    CL5                 NONE                                         
UC2OFF   DS    CL2                 OFFICE                                       
UC2LGR   DS    CL2                 LEDGER                                       
UC8NAME  DS    CL(OPTNAMLQ)        NAME                                         
UC3NAME  DS    CL(OPTSHTLQ)                                                     
UC@TYPE  DS    CL(RECNAMLQ)        TYPE                                         
UC@MAINT DS    CL(ACTNAMLQ)        MAINTAIN                                     
UC@GENER DS    CL(ACTNAMLQ)        GENERATE                                     
UC@SCRN  DS    CL(RECNAMLQ)        SCREEN                                       
UC@RFRSH DS    CL(ACTNAMLQ)        REFRESH                                      
UC8RVRSL DS    CL(ACTNAMLQ)        REVERSAL                                     
UC$NCMSN DS    CL3                 N/C                                          
UC@GENED DS    CL(OPTNAMLQ)        GENERATED                                    
UC@STT   DS    CL(OPTNAMLQ)        STATUS                                       
UC@OK    DS    CL4                 OK                                           
UC@EXPAN DS    CL8                 EXPAND                                       
UC@ANY   DS    CL4                 ANY                                          
UC@ORDC  DS    CL2                 (ORDER)#                                     
UC@COPY2 DS    CL8                 COPY (NOUN)                                  
UC@OPEN2 DS    CL(ACTNAMLQ)        OPEN (ADJECTIVE)                             
UC4OPEN2 DS    CL4                 OPEN (ADJECTIVE)                             
UC@NOORD DS    CL6                 DUMMY                                        
UC8ORGL  DS    CL(OPTNAMLQ)        ORIGINAL (LONG)                              
UC3ORGL  DS    CL(OPTSHTLQ)        ORIGINAL (SHORT)                             
UC@SUBIT DS    CL(RECNAMLQ)        SUBITEM                                      
UC@RPT   DS    CL(ACTNAMLQ)        REPORT                                       
UC@PRINT DS    CL(ACTNAMLQ)        PRINT                                        
UC@GLU   DS    CL(ACTNAMLQ)        GLUPDATE                                     
UC@GLUED DS    CL(OPTNAMLQ)        GLUPDATED                                    
         ORG   BSDICTU+L'BSDICTU                                                
*                                                                               
BSDICTL  DS    0CL2816             ** MIXED CASE EXPRESSIONS **                 
LC@CLI   DS    CL10                CLIENT                                       
LC@PRO   DS    CL10                PRODUCT                                      
LC@JOB   DS    CL10                JOB                                          
LC@BAT   DS    CL(RECNAMLQ)        BATCH                                        
LC@ITEM  DS    CL(RECNAMLQ)        ITEM                                         
LC@PSTG  DS    CL(RECNAMLQ)        POSTING                                      
LC@CLOSE DS    CL(ACTNAMLQ)        CLOSE                                        
LC@DSP   DS    CL(ACTNAMLQ)        DISPLAY                                      
LC@LIST  DS    CL(ACTNAMLQ)        LIST                                         
LC@UPD   DS    CL(ACTNAMLQ)        UPDATE                                       
LC@OPEN  DS    CL(ACTNAMLQ)        OPEN (VERB)                                  
LC@CHG   DS    CL(ACTNAMLQ)        CHANGE                                       
LC@INP   DS    CL(ACTNAMLQ)        INPUT                                        
LC@RECAL DS    CL(ACTNAMLQ)        RECALL                                       
LC@QUIT  DS    CL(ACTNAMLQ)        QUIT                                         
LC@FIRST DS    CL(ACTNAMLQ)        FIRST                                        
LC@SAVE  DS    CL(ACTNAMLQ)        SAVE                                         
LC@REF   DS    CL(L'BATRHD1)       REFERENCE                                    
LC@NAME  DS    CL(L'BATRHD1)       NAME                                         
LC@INPTY DS    CL(L'BATRHD1)       INPUT TYPE                                   
LC@MOA   DS    CL(L'BATRHD1)       MONTH OF SERVICE                             
LC@EFFDT DS    CL(L'BATRHD1)       EFFECTIVE DATE                               
LC@INSUP DS    CL(L'BATRHD1)       INSTANT UPDATE                               
LC@PRSN  DS    CL(L'BATRHD1)       PERSON                                       
LC@CRTDT DS    CL(L'BATRHD1)       CREATED DATE                                 
LC@STT   DS    CL(L'BATRHD1)       STATUS                                       
LC@ITMCT DS    CL(L'BATRHD1)       ITEM COUNT                                   
LC@ITMSA DS    CL(L'BATRHD1)       ITEMS ADDED                                  
LC@BATTO DS    CL(L'BATRHD1)       BATCH TOTAL                                  
LC@AMTIN DS    CL(L'BATRHD1)       AMOUNT INPUT                                 
LC@DELD  DS    CL8                 DELETED                                      
LC@CLSD  DS    CL8                 CLOSED                                       
LC@UPDTD DS    CL8                 UPDATED                                      
LC8INSUP DS    CL8                 INSTANT UPDATE                               
LC@SAVED DS    CL8                 SAVED                                        
LC4OPEN  DS    CL4                 OPEN (VERB)                                  
LC3DELD  DS    CL3                 DELETED                                      
LC3CLSD  DS    CL3                 CLOSED                                       
LC3UPDTD DS    CL3                 UPDATED                                      
LC3INSUP DS    CL3                 INSTANT UPDATE                               
LC3SAVED DS    CL3                 SAVED                                        
LC$USRID DS    CL10                USER-ID                                      
LC$REF   DS    CL4                 REFERENCE                                    
LC$BATN  DS    CL15                BATCH NAME                                   
LC$NAME  DS    CL15                NAME                                         
LC$INPTY DS    0CL6                INPUT TYPE                                   
LC$INPT1 DS    CL3                                                              
LC$INPT2 DS    CL3                                                              
LC$MOA   DS    CL6                 MONTH OF SERVICE                             
LC$EFFDT DS    CL8                 EFFECTIVE DATE                               
LC$INSUP DS    0CL8                INSTANT UPDATE                               
LC$INSU1 DS    CL4                                                              
LC$INSU2 DS    CL4                                                              
LC$PRSN  DS    CL8                 PERSON                                       
LC$CRTDT DS    CL8                 CREATED DATE                                 
LC$STT   DS    CL16                STATUS                                       
LC$ITMCT DS    0CL12               ITEM COUNT                                   
LC$ITMC1 DS    CL6                                                              
LC$ITMC2 DS    CL6                                                              
LC$ITMSA DS    0CL12               ITEMS ADDED                                  
LC$ITMS1 DS    CL6                                                              
LC$ITMS2 DS    CL6                                                              
LC$BATTO DS    CL13                BATCH TOTAL                                  
LC$AMTIN DS    CL13                AMOUNT INPUT                                 
LC$OFF   DS    CL3                 OFFICE                                       
LC$CMTS  DS    CL15                COMMENTS                                     
LC$APRVR DS    CL8                 APPROVER                                     
LC$GROUP DS    CL3                 GROUP                                        
LC$LUID  DS    CL8                 LUID                                         
LC$NUM   DS    CL4                 NUM.                                         
LC$ADR   DS    CL8                 ADDRESS                                      
LC@PAGE  DS    CL8                 PAGE (FOR SCROLLING)                         
LC@HALF  DS    CL8                 HALF (FOR SCROLLING)                         
LC@ALTPF DS    CL8                 ALTPFS                                       
LC@FRBAT DS    CL(L'BATRHD1)       FROM BATCH                                   
LC@TOBAT DS    CL(L'BATRHD1)       TO BATCH                                     
LC@COPY  DS    CL(ACTNAMLQ)        COPY (VERB)                                  
LC@RVRS  DS    CL(ACTNAMLQ)        REVERSE                                      
LC@SEL   DS    CL(ACTNAMLQ)        SELECT                                       
LC@ANL1  DS    CL(ACTNAMLQ)        ANALYSIS                                     
LC@NXT   DS    CL(ACTNAMLQ)        NEXT                                         
LC$DRTON DS    CL10                DRAFTED ON                                   
LC$LIVON DS    CL7                 LIVE ON                                      
LC$UPDON DS    CL10                UPDATED ON                                   
LC$RVRON DS    CL11                REVERSED ON                                  
LC$MAUON DS    CL14                MARKED USED ON                               
LC$PELON DS    CL9                 PEELED ON                                    
LC$LSTON DS    CL16                LAST ACTIVITY ON                             
LC$FEEAJ DS    CL11                FEE ADJUSTMENT                               
LC$BEN   DS    CL7                 BENEFIT                                      
LC$CMN   DS    CL10                COMMISSION                                   
LC$DPR   DS    CL12                DEPRECIATION                                 
LC$CSHDS DS    CL13                CASH DISCOUNT                                
LC$XFRAM DS    CL16                TRANSFER AMOUNT                              
LC$GRSCK DS    CL22                GROSS/NET FOR COKE EXP                       
LC$FEE   DS    CL3                 FEE                                          
LC$GRSBD DS    CL18                GROSS BILLED                                 
LC$HOURS DS    CL7                 HOURS                                        
LC$INCM  DS    CL6                 INCOME                                       
LC$HRSDC DS    CL18                HOURS DEBIT/CREDIT                           
LC$FLTX  DS    CL13                FREELANCE TAX                                
LC$RCVCL DS    CL23                RECEIVABLE CREDIT LIMIT                      
LC$GRSMV DS    CL16                GROSS MINUS VAT                              
LC$FLYMT DS    CL13                FULLY MATCHED                                
LC$PTYMT DS    CL14                PARTLY MATCHED                               
LC$CSTRT DS    CL12                COSTING RATE                                 
LC$TCHKS DS    CL13                TOTAL CHEQUES                                
LC$TAXPD DS    CL8                 TAX PAID                                     
LC$VCLS  DS    CL8                 VEHICLES                                     
LC$VAT   DS    CL3                 VAT                                          
LC$NOCHD DS    CL16                NO CASH DISCOUNT                             
LC$ASBOF DS    CL5                 ASBOF                                        
LC$CHKOC DS    CL23                CHEQUE TOTAL IN OFF/CHQ                      
LC$CODEX DS    CL16                COKE EXPENDITURE                             
LC$TOLAM DS    CL16                TOLERANCE AMOUNT                             
LC$TOLPC DS    CL17                TOLERANCE PERCENT                            
LC$MAXCB DS    CL22                MAXIMUM CREDIT BALANCE                       
LC$MAXDB DS    CL21                MAXIMUM DEBIT BALANCE                        
LC@RVRSD DS    CL11                REVERSED                                     
LC@PELED DS    CL8                 PEELED                                       
LC@USED  DS    CL8                 USED                                         
LC@AUTHD DS    CL10                AUTHORISED                                   
LC@NRTV  DS    CL9                 NARRATIVE                                    
LC@DRAFT DS    CL7                 DRAFT                                        
LC@DEL   DS    CL(ACTNAMLQ)        DELETE                                       
LC@WC    DS    CL9                 WORK CODE                                    
LC$CHKC  DS    CL13                CHEQUE NUMBER                                
LC$WRTRF DS    CL19                WRITE-OFF REFERENCE                          
LC$WRTFA DS    CL13                WRITE-OFF A/C                                
LC$XFRFR DS    CL16                TRANSFERRED FROM                             
LC$XFRTO DS    CL14                TRANSFERRED TO                               
LC$EFFON DS    CL12                EFFECTIVE ON                                 
LC$PSTGM DS    CL13                POSTING MOA                                  
LC$RVRMA DS    CL13                REVERSING MOA                                
LC$MAUMA DS    CL15                MARKED USED MOA                              
LC$CHKDT DS    CL11                CHEQUE DATE                                  
LC$WRTFO DS    CL14                WRITTEN-OFF ON                               
LC$CHKDP DS    CL16                CHQ DEPOSITED ON                             
LC$OFFSO DS    CL9                 OFFSET ON                                    
LC$XFRON DS    CL14                TRANSFERRED ON                               
LC$XFRMA DS    CL16                TRANSFERRING MOA                             
LC@VALAC DS    CL32                VALID ACTIONS                                
LC@YES   DS    CL4                 YES                                          
LC@NO    DS    CL4                 NO                                           
LC@APRV  DS    CL(ACTNAMLQ)        APPROVE                                      
LC@UAPRV DS    CL(ACTNAMLQ)        UNAPPROVE                                    
LC@APRVD DS    CL8                 APPROVED                                     
LC3APRVD DS    CL3                                                              
LC@USRID DS    CL(L'BATRHD1)       USER-ID                                      
LC@APRVR DS    CL(L'BATRHD1)       APPROVER                                     
LC@ACRL  DS    CL(L'BATRHD1)       ACCRUAL                                      
LC@RVRSL DS    CL10                REVERSAL                                     
LC@SUBR  DS    CL9                 SUBREF                                       
LC@LEFT  DS    CL(ACTNAMLQ)        LEFT                                         
LC@RIGHT DS    CL(ACTNAMLQ)        RIGHT                                        
LC@UP    DS    CL(ACTNAMLQ)        UP                                           
LC@DOWN  DS    CL(ACTNAMLQ)        DOWN                                         
LC@OTHRI DS    CL17                OTHER INFORMATION                            
LC@CTR   DS    CL14                CONTRA ACCOUNT                               
LC@URG   DS    CL10                URGENT                                       
LC@NCOM  DS    CL10                NON-COMMISSIONABLE                           
LC@AUTO  DS    CL(ACTNAMLQ)        AUTO                                         
LC@UPDGL DS    CL16                UPDATED TO G/L                               
LC@BLD   DS    CL8                 BILLED                                       
LC@PAID  DS    CL8                 PAID                                         
LC@CTRD  DS    CL8                 CONTRA'D/OFFSET                              
LC$PTYMO DS    CL20                PARTLY MATCHED ORDER                         
LC$FLYMO DS    CL24                FULLY MATCHED ORDER                          
LC$BLDON DS    CL15                BILLED ON                                    
LC$PAION DS    CL15                PAID ON                                      
LC$CTRON DS    CL15                CONTRA'D ON/OFFSET ON                        
LC$BLGMA DS    CL15                BILLING MOA                                  
LC$PAIMA DS    CL15                PAID IN MOA                                  
LC$CTRMA DS    CL15                CONTRA'D IN MOA/OFFSET IN MOA                
LC$UPGON DS    CL15                UPDATED G/L ON                               
LC@CNTRL DS    CL(RECNAMLQ)        CONTROL                                      
LC@LIVE  DS    CL8                 LIVE                                         
LC@TYPE  DS    CL8                 TYPE                                         
LC@TIME  DS    CL8                 TIME                                         
LC@MSNG  DS    CL8                 MISSING                                      
LC@ADJ   DS    CL8                 ADJUST                                       
LC@TAX   DS    CL8                 TAX                                          
LC@CHK   DS    CL8                 CKECK (CHEQUE)                               
LC@INV   DS    CL8                 INVOICE                                      
LC@RFRSH DS    CL(ACTNAMLQ)        REFRESH                                      
LC@1ST   DS    CL8                 FIRST                                        
LC@2ND   DS    CL8                 SECOND                                       
LC@ERASE DS    CL8                 ERASE                                        
LC$DR    DS    CL14                DEBITS                                       
LC$CR    DS    CL14                CREDITS                                      
LC@MAINT DS    CL(ACTNAMLQ)        MAINTAIN                                     
LC@ACC1  DS    CL14                ACCOUNT#1                                    
LC@ACC2  DS    CL14                ACCOUNT#2                                    
LC@AMT   DS    CL13                AMOUNT                                       
LC@SEQNO DS    CL6                 SEQUENCE NUMBER                              
LC@GENER DS    CL(ACTNAMLQ)        GENERATE                                     
LC@SCRN  DS    CL(RECNAMLQ)        SCREEN                                       
LC$GRSFI DS    CL20                GROSS ON FEE INVOICE                         
LC$MILGE DS    CL7                 MILEAGE                                      
LC$INSAM DS    CL16                INSURABLE AMOUNT                             
LC$FEEAM DS    CL10                FEE AMOUNT                                   
LC$AMPEX DS    CL25                AMOUNT POSTED TO EXPENSES                    
LC$RCNAM DS    CL21                RECONCILIATION AMOUNT                        
LC$INVTO DS    CL13                INVOICE TOTAL                                
LC$MEMOT DS    CL8                 MEMO TAX                                     
LC$VSCHN DS    CL18                VERSCHILLEN NUMBER                           
LC@HELD  DS    CL6                 HELD                                         
LC@SELED DS    CL8                 SELECTED                                     
LC3COPY  DS    CL3                 COPY (VERB)                                  
LC3RVRSL DS    CL3                 REVERSAL                                     
LC@GENED DS    CL10                GENERATED                                    
LC3GENED DS    CL3                 GENERATED                                    
LC@RCND  DS    CL14                RECONCILED                                   
LC@ACRRV DS    CL12                ACCRUAL REV                                  
LC@UAPR  DS    CL10                UNAPPROVED                                   
LC3UAPR  DS    CL3                 UNAPPROVED                                   
LC@BLBCS DS    CL13                BILLABLE CASH                                
LC$DUEON DS    CL9                 DUE ON                                       
LC$VATAM DS    CL10                VAT AMOUNT                                   
LC@CURRY DS    CL16                CURRENCY                                     
LC@BLB   DS    CL9                 BILLABLE                                     
LC@NBLB  DS    CL15                NON-BILLABLE                                 
LC@COPY2 DS    CL8                 COPY (NOUN)                                  
LC3COPY2 DS    CL3                 COPY (NOUN)                                  
LC@OPEN2 DS    CL8                 OPEN (ADJECTIVE)                             
LC4OPEN2 DS    CL4                 OPEN (ADJECTIVE)                             
LC@CTAX  DS    CL8                 CTAX                                         
LC$MEMEX DS    CL13                MEMO EXPENSES                                
LC@CURBT DS    CL14                CURRENT BATCH                                
LC@ORGBT DS    CL14                ORIGIN BATCH                                 
LC@CURRL DS    CL10                CURRENCY (LEFT ALIGNED)                      
LC@VPB   DS    CL3                 VPB (TAX)                                    
LC@SUBIT DS    CL(RECNAMLQ)        SUBITEM                                      
LC@DEBSC DS    CL(ACTNAMLQ)        DEBIT SCREEN                                 
LC@TOP   DS    CL(ACTNAMLQ)        TOP                                          
LC@CBOTT DS    CL(ACTNAMLQ)        BOTTOM                                       
LC@RETRN DS    CL(ACTNAMLQ)        RETURN                                       
LC@ADD   DS    CL(ACTNAMLQ)        ADD                                          
LC@RPT   DS    CL(ACTNAMLQ)        REPORT                                       
LC@PRINT DS    CL(ACTNAMLQ)        PRINT                                        
LC@VNDR  DS    CL(ACTNAMLQ)        VENDOR                                       
LC@DTL   DS    CL(ACTNAMLQ)        DETAIL                                       
LC@ZOOM  DS    CL(ACTNAMLQ)        ZOOM                                         
LC@MEMO  DS    CL(ACTNAMLQ)        MEMO                                         
LC@TMSTT DS    CL15                TIME SHEET                                   
LC@POST  DS    CL(ACTNAMLQ)        POST                                         
LC@MULT  DS    CL(ACTNAMLQ)        MULTIPLE                                     
LC@FIS   DS    CL(ACTNAMLQ)        FIS                                          
LC@GLU   DS    CL(ACTNAMLQ)        GLUPDATE                                     
LC3GLU   DS    CL3                 GLU                                          
LC@GLUED DS    CL10                GLUPDATED                                    
LC3GLUED DS    CL3                 GLUPDATED                                    
         ORG   BSDICTL+L'BSDICTL                                                
BSDICTX  DS    0C                  ** END OF DICTIONARY WORDS **                
*                                                                               
WORKD    DSECT                                                                  
         ORG   WORKX                                                            
WORKREP  DS    XL(REPX-REPD)      FAREPORT WORK AREA                            
PQBUFF   DS    (14*1024)X         PRINT QUEUE BUFFER AREA                       
WORKXTRA EQU   *-WORKX             SIZE FOR PRINT OPTION                        
*                                                                               
WORKL    EQU   *-WORKD                                                          
