*          DATA SET ACBATCED   AT LEVEL 002 AS OF 03/15/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BCED      DATE 03/15/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL11     6    2   11  A  P N             T        Y              
ATRDOCH  DS    XL8                                                              
ATRDOC   DS    CL6      6   14    6  A  U N             T    I   Y   11         
ATRDOCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   31    4  A  P N             T        Y              
ATRDAT1H DS    XL8                                                              
ATRDAT1  DS    CL8      6   37    8  A  U N             T        Y   12         
ATRDAT1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   65    6  A  P N             T        Y              
ATRURGH  DS    XL8                                                              
ATRURG   DS    CL1      6   72    1  A  U N             T        Y   13         
ATRURGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
ATRCSHH  DS    XL8                                                              
ATRCSH   DS    CL15     7   14   15  A  U N             T        Y   14         
ATRCSHX  DS    XL8                                                              
ATRCSDH  DS    XL8                                                              
ATRCSD   DS    CL36     7   31   36  A  P N             T        Y   15         
ATRCSDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
ATRACCH  DS    XL8                                                              
ATRACC   DS    CL15     8   14   15  A  U N             T        Y   16         
ATRACCX  DS    XL8                                                              
ATRACDH  DS    XL8                                                              
ATRACD   DS    CL36     8   31   36  A  P N             T        Y   17         
ATRACDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      8   68    3  A  P N             T        Y              
ATRCDH   DS    XL8                                                              
ATRCD    DS    CL1      8   72    1  A  U N             T        Y   18         
ATRCDX   DS    XL8                                                              
ATRCDDH  DS    XL8                                                              
ATRCDD   DS    CL6      8   75    6  A  P N             T        Y   19         
ATRCDDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     9    2   11  A  P N             T        Y              
ATRACC2H DS    XL8                                                              
ATRACC2  DS    CL15     9   14   15  A  U N             T        Y   20         
ATRACC2X DS    XL8                                                              
ATRAC2DH DS    XL8                                                              
ATRAC2D  DS    CL36     9   31   36  A  P N             T        Y   21         
ATRAC2DX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      9   68    3  A  P N             T        Y              
ATRCD2H  DS    XL8                                                              
ATRCD2   DS    CL1      9   72    1  A  U N             T        Y   22         
ATRCD2X  DS    XL8                                                              
ATRCDD2H DS    XL8                                                              
ATRCDD2  DS    CL6      9   75    6  A  P N             T        Y   23         
ATRCDD2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     10    2    9  A  P N             T        Y              
ATRNARH  DS    XL8                                                              
ATRNAR   DS    CL55    10   14   55  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL55    11   14   55  A  U N             T        Y   24         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     11   75    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     12    3    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    12   17   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     13    3    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    13   17   11  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    13   41   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     13   58    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     13   69    6  A  P N             T        Y              
ATRWCH   DS    XL8                                                              
ATRWC    DS    CL2     14    4    2  A  U N             T        Y   25         
ATRWCX   DS    XL8                                                              
ATRWC2H  DS    XL8                                                              
ATRWC2   DS    CL2     14    9    2  A  U N             T        Y   26         
ATRWC2X  DS    XL8                                                              
ATREXH   DS    XL8                                                              
ATREX    DS    CL15    14   17   15  A  U N             T        Y   27         
ATREXX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    14   41   14  A  U N             T        Y   28         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     14   58    7  A  U N             T        Y   29         
         DS    XL8                                                              
ATRAMH   DS    XL8                                                              
ATRAM    DS    CL11    14   69   11  A  U N             T        Y   30         
ATRAMX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    15    3   75  A  P N             T        Y   31         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     16    4    2  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     16    9    2  A  U N             T        Y   33         
         DS    XL8                                                              
ATREX2H  DS    XL8                                                              
ATREX2   DS    CL15    16   17   15  A  U N             T        Y   34         
ATREX2X  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    16   41   14  A  U N             T        Y   35         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     16   58    7  A  U N             T        Y   36         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    16   69   11  A  U N             T        Y   37         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    17    3   75  A  P N             T        Y   38         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     18    4    2  A  U N             T        Y   39         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     18    9    2  A  U N             T        Y   40         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    18   17   15  A  U N             T        Y   41         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    18   41   14  A  U N             T        Y   42         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     18   58    7  A  U N             T        Y   43         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    18   69   11  A  U N             T        Y   44         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    19    3   75  A  P N             T        Y   45         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     20    4    2  A  U N             T        Y   46         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     20    9    2  A  U N             T        Y   47         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    20   17   15  A  U N             T        Y   48         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    20   41   14  A  U N             T        Y   49         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     20   58    7  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    20   69   11  A  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    21    3   75  A  P N             T        Y   52         
         DS    XL8                                                              
ATRTABH  DS    XL8                                                              
ATRTAB   DS    CL1     21   79    1  A  U N             T        Y   53         
ATRTABX  DS    XL8                                                              
ATRTOTH  DS    XL8                                                              
ATRTOT   DS    CL61    22   10   61  A  P N             T        Y   54         
ATRTOTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  255         
         DS    XL8                                                              
ATRLAST  DS    XL1                                                              
         DS    XL2    INDICS=I                                                  
ATRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1944 BYTES                            
