*          DATA SET ACBATB2D   AT LEVEL 022 AS OF 02/15/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BB2D      DATE 02/15/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL9      6    2    9  A  P H             T        Y              
LISDOCH  DS    XL8                                                              
LISDOC   DS    CL27     6   13   27  A  P N             T        Y   10         
LISDOCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   42    4  A  P H             T        Y              
LISDATH  DS    XL8                                                              
LISDAT   DS    CL8      6   48    8  A  P N             T        Y   11         
LISDATX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P H             T        Y              
LISVENH  DS    XL8                                                              
LISVEN   DS    CL64     7   15   64  A  P N             T        Y   12         
LISVENX  DS    XL8                                                              
LISVEN2H DS    XL8                                                              
LISVEN2  DS    CL77     8    2   77  A  P N             T        Y   13         
LISVEN2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     9    2   10  A  P H             T        Y              
LISXVNH  DS    XL8                                                              
LISXVN   DS    CL64     9   15   64  A  P N             T        Y   15         
LISXVNX  DS    XL8                                                              
LISXVN2H DS    XL8                                                              
LISXVN2  DS    CL77    10    2   77  A  P N             T        Y   16         
LISXVN2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  P Z             T        Y              
LISHEADH DS    XL8                                                              
LISHEAD  DS    CL74    11    6   74  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  P Z             T        Y              
LISUNDRH DS    XL8                                                              
LISUNDR  DS    CL74    12    6   74  A  P H             T        Y              
LISSEL1H DS    XL8                                                              
LISSEL1  DS    CL3     13    2    3  A  U N             T        Y              
LISLIN1H DS    XL8                                                              
LISLIN1  DS    CL74    13    6   74  A  P H             T        Y              
LISSEL2H DS    XL8                                                              
LISSEL2  DS    CL3     14    2    3  A  U N             T        Y              
LISLIN2H DS    XL8                                                              
LISLIN2  DS    CL74    14    6   74  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    15    6   74  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    16    6   74  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    17    6   74  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    18    6   74  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    19    6   74  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    20    6   74  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    21    6   74  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    22    6   74  A  P H             T        Y              
LISTOTH  DS    XL8                                                              
LISTOT   DS    CL78    23    2   78  A  P H             T        Y   98         
LISTOTX  DS    XL8                                                              
LISPFKH  DS    XL8                                                              
LISPFK   DS    CL78    24    2   78  A  P H             T        Y  255         
LISPFKX  DS    XL8                                                              
LISLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
LISWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1792 BYTES                            
