*          DATA SET ACBATC4D   AT LEVEL 002 AS OF 10/11/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BC4D      DATE 10/11/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL12     6    3   12  A  P N             T        Y              
BICDOCH  DS    XL8                                                              
BICDOC   DS    CL6      6   20    6  A  U N             T    I   Y   11         
BICDOCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      7    3    4  A  P N             T        Y              
BICDATEH DS    XL8                                                              
BICDATE  DS    CL8      7   20    8  A  U N             T        Y   12         
BICDATEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      8    3    6  A  P N             T        Y              
BICCLIH  DS    XL8                                                              
BICCLI   DS    CL6      8   20    6  A  U N             T        Y   13         
BICCLIX  DS    XL8                                                              
BICCLINH DS    XL8                                                              
BICCLIN  DS    CL36     8   36   36  A  P N             T        Y   14         
BICCLINX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    3    7  A  P N             T        Y              
BICPROH  DS    XL8                                                              
BICPRO   DS    CL6      9   20    6  A  U N             T        Y   15         
BICPROX  DS    XL8                                                              
BICPRONH DS    XL8                                                              
BICPRON  DS    CL36     9   36   36  A  P N             T        Y   16         
BICPRONX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     10    3    3  A  P N             T        Y              
BICJOBH  DS    XL8                                                              
BICJOB   DS    CL6     10   20    6  A  U N             T        Y   17         
BICJOBX  DS    XL8                                                              
BICJOBNH DS    XL8                                                              
BICJOBN  DS    CL36    10   36   36  A  P N             T        Y   18         
BICJOBNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     11    3    9  A  P N             T        Y              
BICWRKH  DS    XL8                                                              
BICWRK   DS    CL2     11   20    2  A  U N             T        Y   19         
BICWRKX  DS    XL8                                                              
BICWRKNH DS    XL8                                                              
BICWRKN  DS    CL15    11   36   15  A  P N             T        Y   20         
BICWRKNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    12    3   10  A  P N             T        Y              
BICJAMTH DS    XL8                                                              
BICJAMT  DS    CL12    12   20   12  A  U N             T        Y   21         
BICJAMTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     12   36    3  A  P N             T        Y              
BICCDH   DS    XL8                                                              
BICCD    DS    CL1     12   40    1  A  U N             T        Y   22         
BICCDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     13    3    8  A  P N             T        Y              
BICSUPH  DS    XL8                                                              
BICSUP   DS    CL15    13   20   15  A  U N             T        Y   23         
BICSUPX  DS    XL8                                                              
BICSUPNH DS    XL8                                                              
BICSUPN  DS    CL36    13   36   36  A  P N             T        Y   24         
BICSUPNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    14    3   15  A  P N             T        Y              
BICSAMTH DS    XL8                                                              
BICSAMT  DS    CL12    14   20   12  A  U N             T        Y   25         
BICSAMTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     15    3    8  A  P N             T        Y              
BICTYPEH DS    XL8                                                              
BICTYPE  DS    CL1     15   20    1  A  U N             T        Y   26         
BICTYPEX DS    XL8                                                              
BICTYPNH DS    XL8                                                              
BICTYPN  DS    CL21    15   22   21  A  P N             T        Y   27         
BICTYPNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    15   45   13  A  P N             T        Y              
BICGORNH DS    XL8                                                              
BICGORN  DS    CL1     15   59    1  A  U N             T        Y   28         
BICGORNX DS    XL8                                                              
BICGSTXH DS    XL8                                                              
BICGSTX  DS    CL18    15   61   18  A  P N             T        Y   29         
BICGSTXX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16    3   10  A  P N             T        Y              
BICGAMTH DS    XL8                                                              
BICGAMT  DS    CL13    16   20   13  A  U N             T        Y   30         
BICGAMTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     16   45    8  A  P N             T        Y              
BICPROVH DS    XL8                                                              
BICPROV  DS    CL2     16   54    2  A  U N             T        Y   40         
BICPROVX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    17    3   14  A  P N             T        Y              
BICINCH  DS    XL8                                                              
BICINC   DS    CL15    17   20   15  A  U N             T        Y   31         
BICINCX  DS    XL8                                                              
BICINCNH DS    XL8                                                              
BICINCN  DS    CL36    17   36   36  A  P N             T        Y   32         
BICINCNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    18    3   13  A  P N             T        Y              
BICIAMTH DS    XL8                                                              
BICIAMT  DS    CL12    18   20   12  A  U N             T        Y   33         
BICIAMTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    19    3   11  A  P N             T        Y              
BICNARH  DS    XL8                                                              
BICNAR   DS    CL49    19   20   49  A  U N             T        Y   34         
BICNARX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     20   12    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL49    20   20   49  A  U N             T        Y   35         
         DS    XL8                                                              
BICTABH  DS    XL8                                                              
BICTAB   DS    CL1     21   20    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  255         
         DS    XL8                                                              
BICLAST  DS    XL1                                                              
         DS    XL2    INDICS=I                                                  
BICWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1272 BYTES                            
