*          DATA SET ACBATFCD   AT LEVEL 035 AS OF 03/21/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BFCD      DATE 03/21/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      6    3    8  A  P N             T        Y              
CHUORDH  DS    CL8                                                              
CHUORD   DS    CL11     6   16   11  A  U N             T    I   Y   11         
CHUORDX  DS    CL8                                                              
CHUOHSTH DS    CL8                                                              
CHUOHST  DS    CL40     6   32   40  A  P N             T        Y   12         
CHUOHSTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     7    3   11  A  P N             T        Y              
CHUDOCH  DS    CL8                                                              
CHUDOC   DS    CL13     7   16   13  A  U N             T        Y   13         
CHUDOCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7   32    4  A  P N             T        Y              
CHUDATH  DS    CL8                                                              
CHUDAT   DS    CL8      7   42    8  A  U N             T        Y   14         
CHUDATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      8    3    6  A  P N             T        Y              
CHUCLIH  DS    CL8                                                              
CHUCLI   DS    CL6      8   16    6  A  U N             T        Y   15         
CHUCLIX  DS    CL8                                                              
CHUCLINH DS    CL8                                                              
CHUCLIN  DS    CL36     8   32   36  A  P N             T        Y   16         
CHUCLINX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9    3    7  A  P N             T        Y              
CHUPROH  DS    CL8                                                              
CHUPRO   DS    CL6      9   16    6  A  U N             T        Y   17         
CHUPROX  DS    CL8                                                              
CHUPRONH DS    CL8                                                              
CHUPRON  DS    CL36     9   32   36  A  P N             T        Y   18         
CHUPRONX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     10    3    3  A  P N             T        Y              
CHUJOBH  DS    CL8                                                              
CHUJOB   DS    CL6     10   16    6  A  U N             T        Y   19         
CHUJOBX  DS    CL8                                                              
CHUJOBNH DS    CL8                                                              
CHUJOBN  DS    CL36    10   32   36  A  P N             T        Y   20         
CHUJOBNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    11    3   12  A  P N             T        Y              
CHUCRDH  DS    CL8                                                              
CHUCRD   DS    CL15    11   16   15  A  U N             T        Y   21         
CHUCRDX  DS    CL8                                                              
CHUCRDNH DS    CL8                                                              
CHUCRDN  DS    CL24    11   32   24  A  P N             T        Y   22         
CHUCRDNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     11   58    6  A  P N             T        Y              
CHUSRCH  DS    CL8                                                              
CHUSRC   DS    CL12    11   66   12  A  U N             T        Y   37         
CHUSRCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     12    3    6  A  P N             T        Y              
CHUSUPH  DS    CL8                                                              
CHUSUP   DS    CL15    12   16   15  A  U N             T        Y   35         
CHUSUPX  DS    CL8                                                              
CHUSUPNH DS    CL8                                                              
CHUSUPN  DS    CL36    12   32   36  A  P N             T        Y   36         
CHUSUPNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    13    3   12  A  P N             T        Y              
CHUWRKH  DS    CL8                                                              
CHUWRK   DS    CL11    13   16   11  A  U N             T        Y   23         
CHUWRKX  DS    CL8                                                              
CHUWCNMH DS    CL8                                                              
CHUWCNM  DS    CL49    13   32   49  A  P N             T        Y   24         
CHUWCNMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     14    3    9  A  P N             T        Y              
CHUAMTH  DS    CL8                                                              
CHUAMT   DS    CL40    14   16   40  A  U N             T        Y   25         
CHUAMTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14   57    6  A  P N             T        Y              
CHUCOFH  DS    CL8                                                              
CHUCOF   DS    CL2     14   64    2  A  U N             T        Y   45         
CHUCOFX  DS    CL8                                                              
CHUCOFNH DS    CL8                                                              
CHUCOFN  DS    CL11    14   67   11  A  P N             T        Y   46         
CHUCOFNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    15    3   12  A  P N             T        Y              
CHUNCWKH DS    CL8                                                              
CHUNCWK  DS    CL11    15   16   11  A  U N             T        Y   27         
CHUNCWKX DS    CL8                                                              
CHUWNNMH DS    CL8                                                              
CHUWNNM  DS    CL49    15   32   49  A  P N             T        Y   28         
CHUWNNMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     16    3    9  A  P N             T        Y              
CHUNCAH  DS    CL8                                                              
CHUNCA   DS    CL40    16   16   40  A  U N             T        Y   29         
CHUNCAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    17    3   11  A  P N             T        Y              
CHUEXPH  DS    CL8                                                              
CHUEXP   DS    CL15    17   16   15  A  U N             T        Y   33         
CHUEXPX  DS    CL8                                                              
CHUEXPNH DS    CL8                                                              
CHUEXPN  DS    CL24    17   32   24  A  P N             T        Y   34         
CHUEXPNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     17   57    9  A  P N             T        Y              
CHUFOFH  DS    CL8                                                              
CHUFOF   DS    CL2     17   67    2  A  U N             T        Y   43         
CHUFOFX  DS    CL8                                                              
CHUFOFNH DS    CL8                                                              
CHUFOFN  DS    CL11    17   70   11  A  P N             T        Y   44         
CHUFOFNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    18    3   12  A  P N             T        Y              
CHUAOFH  DS    CL8                                                              
CHUAOF   DS    CL2     18   16    2  A  U N             T        Y   41         
CHUAOFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     18   20    4  A  P N             T        Y              
CHUDEPH  DS    CL8                                                              
CHUDEP   DS    CL3     18   25    3  A  U N             T        Y   42         
CHUDEPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     18   30    6  A  P N             T        Y              
CHUSTFH  DS    CL8                                                              
CHUSTF   DS    CL6     18   37    6  A  U N             T        Y   31         
CHUSTFX  DS    CL8                                                              
CHUSTFNH DS    CL8                                                              
CHUSTFN  DS    CL36    18   44   36  A  P N             T        Y   32         
CHUSTFNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     19    3    9  A  P N             T        Y              
CHUNARH  DS    CL8                                                              
CHUNAR   DS    CL49    19   16   49  A  U N             T        Y   38         
CHUNARX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL49    20   16   49  A  U N             T        Y   39         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20   70    1  A  U N             T        Y              
CHUTOTH  DS    CL8                                                              
CHUTOT   DS    CL25    23   16   25  A  P N             T        Y   40         
CHUTOTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  255         
         DS    CL8                                                              
CHULAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
CHUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1712 BYTES                            
