*          DATA SET ACBATB8D   AT LEVEL 005 AS OF 01/10/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BB8D      DATE 01/10/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL14     7    2   14  L  P N             T        Y              
IVZWCH   DS    CL8                                                              
IVZWC    DS    CL2      7   18    2  A  U N             T    I   Y   30         
IVZWCX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     8    2   14  L  P N             T        Y              
IVZCPJH  DS    CL8                                                              
IVZCPJ   DS    CL14     8   18   14  A  U N             T        Y   31         
IVZCPJX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     8   40   14  L  P N             T        Y              
IVZEXPH  DS    CL8                                                              
IVZEXP   DS    CL14     8   56   14  A  U N             T        Y   32         
IVZEXPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     9    2   14  L  P N             T        Y              
IVZODSH  DS    CL8                                                              
IVZODS   DS    CL15     9   18   15  A  U N             T        Y   33         
IVZODSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     9   40   14  L  P N             T        Y              
IVZAOFH  DS    CL8                                                              
IVZAOF   DS    CL2      9   56    2  A  U N             T        Y   34         
IVZAOFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    10    2   14  L  P N             T        Y              
IVZAMTH  DS    CL8                                                              
IVZAMT   DS    CL11    10   18   11  A  U N             T        Y   35         
IVZAMTX  DS    CL8                                                              
IVZTABH  DS    CL8                                                              
IVZTAB   DS    CL1     10   79    1  A  U N             T        Y   58         
IVZTABX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  255         
         DS    CL8                                                              
IVZLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
IVZWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 400  BYTES                            
