*          DATA SET ACBATFFD   AT LEVEL 006 AS OF 03/23/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BFFD      DATE 03/23/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
BASMSGH  DS    CL8                                                              
BASMSG   DS    CL60     1    2   60  L  P H             T        Y              
BASSRVH  DS    CL8                                                              
BASSRV   DS    CL17     1   63   17  A  U N             T        Y              
BASFTABH DS    CL8                                                              
BASFTAB  DS    CL10     2    2   10  L  P H             T        Y              
BASRECH  DS    CL8                                                              
BASREC   DS    CL8      2   13    8  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL10     2   23   10  L  P H             T        Y              
BASACTH  DS    CL8                                                              
BASACT   DS    CL8      2   34    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     2   45   10  L  P N             T        Y              
BASSCRH  DS    CL8                                                              
BASSCR   DS    CL8      2   56    8  A  U N             T        Y    1         
BASSCRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     2   66   10  L  P N             T        Y              
BASREPH  DS    CL8                                                              
BASREP   DS    CL3      2   77    3  A  U H             T        Y    2         
BASREPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     3    2   10  L  P N             T        Y              
BASOPTH  DS    CL8                                                              
BASOPT   DS    CL67     3   13   67  A  U H        M    T        Y              
BASOLY1H DS    CL8                                                              
BASOLY1  DS    CL1      4    2    1  A  P N             T        Y              
BASPFKH  DS    CL8                                                              
BASPFK   DS    CL78    24    2   78  A  P N             T        Y  255         
BASPFKX  DS    CL8                                                              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 440  BYTES                            
