*          DATA SET ACBATA9D   AT LEVEL 004 AS OF 03/01/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BA9D      DATE 03/01/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL10     4    2   10  L  P N             T        Y              
PTXACCH  DS    XL8                                                              
PTXACC   DS    CL14     4   13   14  A  P H             T    I   Y              
PTXACCNH DS    XL8                                                              
PTXACCN  DS    CL36     4   34   36  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10     5    2   10  L  P N             T        Y              
PTXCACH  DS    XL8                                                              
PTXCAC   DS    CL14     5   13   14  A  P H             T        Y              
PTXCACNH DS    XL8                                                              
PTXCACN  DS    CL36     5   34   36  A  P H             T        Y              
PTXWCH   DS    XL8                                                              
PTXWC    DS    CL10     6    2   10  L  P N             T        Y              
PTXWOCH  DS    XL8                                                              
PTXWOC   DS    CL2      6   13    2  A  P H             T        Y              
PTXWOCNH DS    XL8                                                              
PTXWOCN  DS    CL36     6   34   36  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10     7    2   10  L  P N             T        Y              
PTXREFH  DS    XL8                                                              
PTXREF   DS    CL20     7   13   20  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10     7   34   10  L  P N             T        Y              
PTXDATEH DS    XL8                                                              
PTXDATE  DS    CL8      7   45    8  A  P H             T        Y              
PTXSUBTH DS    XL8                                                              
PTXSUBT  DS    CL9      7   56    9  A  P N             T        Y              
PTXSUBH  DS    XL8                                                              
PTXSUB   DS    CL12     7   66   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10     8    2   10  L  P N             T        Y              
PTXAMTH  DS    XL8                                                              
PTXAMT   DS    CL15     8   13   15  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10     8   34   10  L  P N             T        Y              
PTXBATH  DS    XL8                                                              
PTXBAT   DS    CL30     8   45   30  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10     9    2   10  L  P N             T        Y              
PTXSTATH DS    XL8                                                              
PTXSTAT  DS    CL66     9   13   66  A  P H             T        Y              
PTXSTA2H DS    XL8                                                              
PTXSTA2  DS    CL66    10   13   66  A  P H             T        Y              
PTXLIN1H DS    XL8                                                              
PTXLIN1  DS    CL78    11    2   78  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL78    12    2   78  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL78    13    2   78  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL78    14    2   78  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL78    15    2   78  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL78    16    2   78  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL78    17    2   78  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL78    18    2   78  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL78    19    2   78  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL78    20    2   78  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL78    21    2   78  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL78    22    2   78  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL78    23    2   78  L  P H             T        Y              
PTXPFKH  DS    XL8                                                              
PTXPFK   DS    CL78    24    2   78  A  P N             T        Y  255         
PTXPFKX  DS    XL8                                                              
         DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1840 BYTES                            
