*          DATA SET ACBATBDD   AT LEVEL 001 AS OF 05/14/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BBDD      DATE 05/14/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
VNDPVTH  DS    CL8                                                              
VNDPVT   DS    CL13     7    3   13  L  P N             T        Y              
VNDPVNDH DS    CL8                                                              
VNDPVND  DS    CL15     7   17   15  A  U N             T    I   Y   11         
VNDPVNDX DS    CL8                                                              
VNDPVDNH DS    CL8                                                              
VNDPVDN  DS    CL25     7   33   25  L  P H             T        Y   12         
VNDPVDNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   60    7  L  P N             T        Y              
VNDPVDAH DS    CL8                                                              
VNDPVDA  DS    CL12     7   68   12  A  U N             T        Y   13         
VNDPVDAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13     8    3   13  L  P N             T        Y              
VNDXVNDH DS    CL8                                                              
VNDXVND  DS    CL15     8   17   15  A  U N             T        Y   14         
VNDXVNDX DS    CL8                                                              
VNDXVDNH DS    CL8                                                              
VNDXVDN  DS    CL25     8   33   25  L  P H             T        Y   15         
VNDXVDNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   60    7  L  P N             T        Y              
VNDXVDAH DS    CL8                                                              
VNDXVDA  DS    CL12     8   68   12  A  U N             T        Y   16         
VNDXVDAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13     9    3   13  L  P N             T        Y              
VNDXACTH DS    CL8                                                              
VNDXACT  DS    CL15     9   17   15  A  U N             T        Y   22         
VNDXACTX DS    CL8                                                              
VNDXATNH DS    CL8                                                              
VNDXATN  DS    CL25     9   33   25  L  P H             T        Y   23         
VNDXATNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    10    3   13  L  P N             T        Y              
VNDINRFH DS    CL8                                                              
VNDINRF  DS    CL21    10   17   21  A  U N             T        Y   17         
VNDINRFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     10   41    5  L  P N             T        Y              
VNDDATEH DS    CL8                                                              
VNDDATE  DS    CL8     10   48    8  L  U N             T        Y   18         
VNDDATEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    10   58   12  L  P N             T        Y              
VNDDUEDH DS    CL8                                                              
VNDDUED  DS    CL8     10   71    8  L  U N             T        Y   19         
VNDDUEDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    12    3   11  L  P N             T        Y              
VNDPONH  DS    CL8                                                              
VNDPON   DS    CL6     12   17    6  A  U N             T        Y   20         
VNDPONX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    12   33   12  L  P N             T        Y              
VNDPARTH DS    CL8                                                              
VNDPART  DS    CL1     12   48    1  A  U N             T        Y   25         
VNDPARTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    13    3   13  L  P N             T        Y              
VNDOFFCH DS    CL8                                                              
VNDOFFC  DS    CL2     13   17    2  A  U N             T        Y   24         
VNDOFFCX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    13   33   12  L  P N             T        Y              
VNDCDH   DS    CL8                                                              
VNDCD    DS    CL1     13   48    1  A  U N             T        Y   32         
VNDCDX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    15    3   13  L  P N             T        Y              
VNDNAR1H DS    CL8                                                              
VNDNAR1  DS    CL60    15   17   60  L  U N             T        Y   26         
VNDNAR1X DS    CL8                                                              
VNDNAR2H DS    CL8                                                              
VNDNAR2  DS    CL60    16   17   60  L  U N             T        Y   27         
VNDNAR2X DS    CL8                                                              
VNDNAR3H DS    CL8                                                              
VNDNAR3  DS    CL60    17   17   60  L  U N             T        Y   28         
VNDNAR3X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    18    3   13  L  P N             T        Y              
VNDCOM1H DS    CL8                                                              
VNDCOM1  DS    CL60    18   17   60  L  U N             T        Y   29         
VNDCOM1X DS    CL8                                                              
VNDCOM2H DS    CL8                                                              
VNDCOM2  DS    CL60    19   17   60  L  U N             T        Y   30         
VNDCOM2X DS    CL8                                                              
VNDCOM3H DS    CL8                                                              
VNDCOM3  DS    CL60    20   17   60  L  U N             T        Y   31         
VNDCOM3X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  255         
         DS    CL8                                                              
VNDLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
VNDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1256 BYTES                            
