*          DATA SET ACBATF1D   AT LEVEL 002 AS OF 06/26/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BF1D      DATE 06/26/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL12     6    3   12  L  P N             T        Y              
BITDOCH  DS    XL8                                                              
BITDOC   DS    CL6      6   21    6  A  U N             T    I   Y   11         
BITDOCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      7    3    4  L  P N             T        Y              
BITDATH  DS    XL8                                                              
BITDAT   DS    CL8      7   21    8  A  U N             T        Y   12         
BITDATX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      8    3    6  L  P N             T        Y              
BITCLIH  DS    XL8                                                              
BITCLI   DS    CL6      8   21    6  A  U N             T        Y   13         
BITCLIX  DS    XL8                                                              
BITCLINH DS    XL8                                                              
BITCLIN  DS    CL36     8   37   36  L  P N             T        Y   14         
BITCLINX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9    3    7  L  P N             T        Y              
BITPROH  DS    XL8                                                              
BITPRO   DS    CL6      9   21    6  A  U N             T        Y   15         
BITPROX  DS    XL8                                                              
BITPRONH DS    XL8                                                              
BITPRON  DS    CL36     9   37   36  L  P N             T        Y   16         
BITPRONX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     10    3    3  L  P N             T        Y              
BITJOBH  DS    XL8                                                              
BITJOB   DS    CL6     10   21    6  A  U N             T        Y   17         
BITJOBX  DS    XL8                                                              
BITJOBNH DS    XL8                                                              
BITJOBN  DS    CL36    10   37   36  L  P N             T        Y   18         
BITJOBNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     11    3    9  L  P N             T        Y              
BITWRKH  DS    XL8                                                              
BITWRK   DS    CL2     11   21    2  A  U N             T        Y   19         
BITWRKX  DS    XL8                                                              
BITWRKNH DS    XL8                                                              
BITWRKN  DS    CL15    11   37   15  L  P N             T        Y   20         
BITWRKNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    12    3   11  L  P N             T        Y              
BITEXPH  DS    XL8                                                              
BITEXP   DS    CL15    12   21   15  A  U N             T        Y   21         
BITEXPX  DS    XL8                                                              
BITEXPNH DS    XL8                                                              
BITEXPN  DS    CL36    12   37   36  L  P N             T        Y   22         
BITEXPNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     13    3    6  L  P N             T        Y              
BITAMTH  DS    XL8                                                              
BITAMT   DS    CL10    13   21   10  A  U N             T        Y   33         
BITAMTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    14    3   13  L  P N             T        Y              
BITDUSH  DS    XL8                                                              
BITDUS   DS    CL12    14   21   12  A  U N             T        Y   23         
BITDUSX  DS    XL8                                                              
BITDUSNH DS    XL8                                                              
BITDUSN  DS    CL36    14   37   36  L  P N             T        Y   24         
BITDUSNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    15    3   14  L  P N             T        Y              
BITJCAH  DS    XL8                                                              
BITJCA   DS    CL14    15   21   14  A  U N             T        Y   25         
BITJCAX  DS    XL8                                                              
BITJCANH DS    XL8                                                              
BITJCAN  DS    CL36    15   37   36  L  P N             T        Y   26         
BITJCANX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     16    3    4  A  P N             T        Y              
BITCOMMH DS    XL8                                                              
BITCOMM  DS    CL1     16   21    1  A  U N             T        Y   27         
BITCOMMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    17    3   16  L  P N             T        Y              
BITUNFH  DS    XL8                                                              
BITUNF   DS    CL2     17   21    2  A  U N             T        Y   30         
BITUNFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    17   27   15  L  P N             T        Y              
BITUNAH  DS    XL8                                                              
BITUNA   DS    CL2     17   44    2  A  U N             T        Y   35         
BITUNAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     18    3    4  L  P N             T        Y              
BITDEPH  DS    XL8                                                              
BITDEP   DS    CL4     18   21    4  A  U N             T        Y   28         
BITDEPX  DS    XL8                                                              
BITDEPNH DS    XL8                                                              
BITDEPN  DS    CL36    18   37   36  L  P N             T        Y   29         
BITDEPNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     19    3    6  L  P N             T        Y              
BITSTFH  DS    XL8                                                              
BITSTF   DS    CL6     19   21    6  A  U N             T        Y   31         
BITSTFX  DS    XL8                                                              
BITSTFNH DS    XL8                                                              
BITSTFN  DS    CL36    19   37   36  L  P N             T        Y   32         
BITSTFNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     20    3    6  L  P N             T        Y              
BITNARH  DS    XL8                                                              
BITNAR   DS    CL49    20   21   49  A  U N             T        Y   34         
BITNARX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL49    21   21   49  A  U N             T        Y   36         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22   18    1  A  P N             T        Y              
BITPFKH  DS    XL8                                                              
BITPFK   DS    CL78    24    2   78  A  P N             T        Y  255         
BITPFKX  DS    XL8                                                              
BITLAST  DS    XL1                                                              
         DS    XL2    INDICS=I                                                  
BITWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1288 BYTES                            
