*          DATA SET ACBATC8D   AT LEVEL 002 AS OF 10/27/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BC8D      DATE 10/27/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      6    3    8  A  P N             T        Y              
PITORDH  DS    CL8                                                              
PITORD   DS    CL8      6   16    8  A  U N             T    I   Y   11         
PITORDX  DS    CL8                                                              
PITOHSTH DS    CL8                                                              
PITOHST  DS    CL40     6   32   40  A  P N             T        Y   12         
PITOHSTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     7    3   11  A  P N             T        Y              
PITDOCH  DS    CL8                                                              
PITDOC   DS    CL6      7   16    6  A  U N             T        Y   13         
PITDOCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7   32    4  A  P N             T        Y              
PITDATH  DS    CL8                                                              
PITDAT   DS    CL8      7   42    8  A  U N             T        Y   14         
PITDATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     8    3   11  A  P N             T        Y              
PITDBTH  DS    CL8                                                              
PITDBT   DS    CL15     8   16   15  A  U N             T        Y   15         
PITDBTX  DS    CL8                                                              
PITDBTNH DS    CL8                                                              
PITDBTN  DS    CL36     8   32   36  A  P N             T        Y   16         
PITDBTNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12     9    3   12  A  P N             T        Y              
PITCRTH  DS    CL8                                                              
PITCRT   DS    CL15     9   16   15  A  U N             T        Y   17         
PITCRTX  DS    CL8                                                              
PITCRTNH DS    CL8                                                              
PITCRTN  DS    CL36     9   32   36  A  P N             T        Y   18         
PITCRTNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     10    3    6  A  P N             T        Y              
PITURGH  DS    CL8                                                              
PITURG   DS    CL1     10   16    1  A  U N             T        Y   19         
PITURGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     10   32    3  A  P N             T        Y              
PITCDH   DS    CL8                                                              
PITCD    DS    CL1     10   37    1  A  U N             T        Y   20         
PITCDX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     11    3    6  A  P N             T        Y              
PITAMTH  DS    CL8                                                              
PITAMT   DS    CL12    11   16   12  A  U N             T        Y   21         
PITAMTX  DS    CL8                                                              
PITCDCDH DS    CL8                                                              
PITCDCD  DS    CL13    11   32   13  A  P N             T        Y   22         
PITCDCDX DS    CL8                                                              
PITDAMTH DS    CL8                                                              
PITDAMT  DS    CL10    11   51   10  A  P N             T        Y   23         
PITDAMTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     12    3    8  A  P N             T        Y              
PITTYPEH DS    CL8                                                              
PITTYPE  DS    CL1     12   16    1  A  U N             T        Y   24         
PITTYPEX DS    CL8                                                              
PITTYPNH DS    CL8                                                              
PITTYPN  DS    CL21    12   18   21  A  P N             T        Y   25         
PITTYPNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    12   42   13  A  P N             T        Y              
PITGORNH DS    CL8                                                              
PITGORN  DS    CL1     12   57    1  A  U N             T        Y   26         
PITGORNX DS    CL8                                                              
PITGSTXH DS    CL8                                                              
PITGSTX  DS    CL18    12   60   18  A  P N             T        Y   27         
PITGSTXX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    13    3   10  A  P N             T        Y              
PITGAMTH DS    CL8                                                              
PITGAMT  DS    CL10    13   16   10  A  U N             T        Y   28         
PITGAMTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     13   42    8  A  P N             T        Y              
PITPROVH DS    CL8                                                              
PITPROV  DS    CL2     13   51    2  A  U N             T        Y   63         
PITPROVX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     14    3    7  A  P N             T        Y              
PITFOFFH DS    CL8                                                              
PITFOFF  DS    CL2     14   16    2  A  U N             T        Y   29         
PITFOFFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14   32    6  A  P N             T        Y              
PITCOFFH DS    CL8                                                              
PITCOFF  DS    CL2     14   40    2  A  U N             T        Y   30         
PITCOFFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14   53    6  A  P N             T        Y              
PITPOFFH DS    CL8                                                              
PITPOFF  DS    CL2     14   61    2  A  U N             T        Y   31         
PITPOFFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    15    3   10  A  P N             T        Y              
PITFDPTH DS    CL8                                                              
PITFDPT  DS    CL3     15   16    3  A  U N             T        Y   32         
PITFDPTX DS    CL8                                                              
PITFDPNH DS    CL8                                                              
PITFDPN  DS    CL36    15   32   36  A  P N             T        Y   33         
PITFDPNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     16    3    8  A  P N             T        Y              
PITSTFH  DS    CL8                                                              
PITSTF   DS    CL6     16   16    6  A  U N             T        Y   42         
PITSTFX  DS    CL8                                                              
PITSTFNH DS    CL8                                                              
PITSTFN  DS    CL36    16   32   36  A  P N             T        Y   44         
PITSTFNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     17    3    6  A  P N             T        Y              
PITCLIH  DS    CL8                                                              
PITCLI   DS    CL6     17   16    6  A  U N             T        Y   46         
PITCLIX  DS    CL8                                                              
PITCLINH DS    CL8                                                              
PITCLIN  DS    CL36    17   32   36  A  P N             T        Y   48         
PITCLINX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     18    3    7  A  P N             T        Y              
PITPROH  DS    CL8                                                              
PITPRO   DS    CL6     18   16    6  A  U N             T        Y   50         
PITPROX  DS    CL8                                                              
PITPRONH DS    CL8                                                              
PITPRON  DS    CL36    18   32   36  A  P N             T        Y   52         
PITPRONX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     19    3    6  A  P N             T        Y              
PITVNDH  DS    CL8                                                              
PITVND   DS    CL14    19   16   14  A  P N             T        Y   54         
PITVNDX  DS    CL8                                                              
PITVNDNH DS    CL8                                                              
PITVNDN  DS    CL36    19   32   36  A  P N             T        Y   56         
PITVNDNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     20    3    6  A  P N             T        Y              
PITSRCH  DS    CL8                                                              
PITSRC   DS    CL12    20   16   12  A  U N             T        Y   57         
PITSRCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    21    3   13  A  P N             T        Y              
PITPDPTH DS    CL8                                                              
PITPDPT  DS    CL3     21   18    3  A  U N             T        Y   58         
PITPDPTX DS    CL8                                                              
PITPDPNH DS    CL8                                                              
PITPDPN  DS    CL36    21   32   36  A  P N             T        Y   59         
PITPDPNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     22    3    9  A  P N             T        Y              
PITNARH  DS    CL8                                                              
PITNAR   DS    CL49    22   16   49  A  U N             T        Y   60         
PITNARX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL49    23   16   49  A  U N             T        Y   62         
         DS    CL8                                                              
PITTABH  DS    CL8                                                              
PITTAB   DS    CL1     23   76    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  255         
         DS    CL8                                                              
PITLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
PITWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1696 BYTES                            
