*          DATA SET ACBATB9D   AT LEVEL 014 AS OF 04/12/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BB9D      DATE 04/12/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL14     6   11   14  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL14     6   46   14  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      7    6    4  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL14     7   11   14  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL19     7   26   19  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL14     7   46   14  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      7   66    6  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8    6    4  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL14     8   11   14  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL19     8   26   19  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL14     8   46   14  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     8   61   11  L  P N             T        Y              
IVDSUBH  DS    CL8                                                              
IVDSUB   DS    CL3      9    2    3  A  U N             T    I   Y   29         
IVDSUBX  DS    CL8                                                              
IVDWCH   DS    CL8                                                              
IVDWC    DS    CL4      9    6    4  A  U N             T        Y   30         
IVDWCX   DS    CL8                                                              
IVDCPJH  DS    CL8                                                              
IVDCPJ   DS    CL14     9   11   14  A  U N             T        Y   31         
IVDCPJX  DS    CL8                                                              
IVDODSH  DS    CL8                                                              
IVDODS   DS    CL19     9   26   19  A  U N             T        Y   32         
IVDODSX  DS    CL8                                                              
IVDEXPH  DS    CL8                                                              
IVDEXP   DS    CL14     9   46   14  A  U N             T        Y   33         
IVDEXPX  DS    CL8                                                              
IVDAMTH  DS    CL8                                                              
IVDAMT   DS    CL11     9   61   11  A  U N             T        Y   34         
IVDAMTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y   29         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     10    6    4  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    10   11   14  A  U N             T        Y   31         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19    10   26   19  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    10   46   14  A  U N             T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    10   61   11  A  U N             T        Y   34         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y   29         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     11    6    4  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    11   11   14  A  U N             T        Y   31         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19    11   26   19  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    11   46   14  A  U N             T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    11   61   11  A  U N             T        Y   34         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y   29         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     12    6    4  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    12   11   14  A  U N             T        Y   31         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19    12   26   19  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    12   46   14  A  U N             T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    12   61   11  A  U N             T        Y   34         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y   29         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     13    6    4  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    13   11   14  A  U N             T        Y   31         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19    13   26   19  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    13   46   14  A  U N             T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    13   61   11  A  U N             T        Y   34         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y   29         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     14    6    4  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    14   11   14  A  U N             T        Y   31         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19    14   26   19  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    14   46   14  A  U N             T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    14   61   11  A  U N             T        Y   34         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y   29         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     15    6    4  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    15   11   14  A  U N             T        Y   31         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19    15   26   19  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    15   46   14  A  U N             T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    15   61   11  A  U N             T        Y   34         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y   29         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     16    6    4  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    16   11   14  A  U N             T        Y   31         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19    16   26   19  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    16   46   14  A  U N             T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    16   61   11  A  U N             T        Y   34         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y   29         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     17    6    4  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    17   11   14  A  U N             T        Y   31         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19    17   26   19  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    17   46   14  A  U N             T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    17   61   11  A  U N             T        Y   34         
         DS    CL8                                                              
IVDLLNH  DS    CL8                                                              
IVDLLN   DS    CL1     17   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    22    2   18  L  P N             T        Y              
IVDDIFFH DS    CL8                                                              
IVDDIFF  DS    CL11    22   26   11  A  P N             T        Y   40         
IVDDIFFX DS    CL8                                                              
IVDTABH  DS    CL8                                                              
IVDTAB   DS    CL1     22   79    1  A  U N             T        Y   58         
IVDTABX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  255         
         DS    CL8                                                              
IVDLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
IVDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1896 BYTES                            
