*          DATA SET ACBATE1D   AT LEVEL 005 AS OF 06/09/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BE1D      DATE 06/09/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL11     6    2   11  A  P N             T        Y              
ATRDOCH  DS    XL8                                                              
ATRDOC   DS    CL13     6   14   13  A  U N             T    I   Y   11         
ATRDOCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   31    4  A  P N             T        Y              
ATRDAT1H DS    XL8                                                              
ATRDAT1  DS    CL8      6   37    8  A  U N             T        Y   12         
ATRDAT1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   65    6  A  P N             T        Y              
ATRURGH  DS    XL8                                                              
ATRURG   DS    CL1      6   72    1  A  U N             T        Y   13         
ATRURGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
ATRCSHH  DS    XL8                                                              
ATRCSH   DS    CL15     7   14   15  A  U N             T        Y   14         
ATRCSHX  DS    XL8                                                              
ATRCSDH  DS    XL8                                                              
ATRCSD   DS    CL36     7   31   36  A  P N             T        Y   15         
ATRCSDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
ATRACCH  DS    XL8                                                              
ATRACC   DS    CL15     8   14   15  A  U N             T        Y   16         
ATRACCX  DS    XL8                                                              
ATRACDH  DS    XL8                                                              
ATRACD   DS    CL36     8   31   36  A  P N             T        Y   17         
ATRACDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      8   68    3  A  P N             T        Y              
ATRCDH   DS    XL8                                                              
ATRCD    DS    CL1      8   72    1  A  U N             T        Y   18         
ATRCDX   DS    XL8                                                              
ATRCDDH  DS    XL8                                                              
ATRCDD   DS    CL6      8   75    6  A  P N             T        Y   19         
ATRCDDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     9    2   11  A  P N             T        Y              
ATRACC2H DS    XL8                                                              
ATRACC2  DS    CL15     9   14   15  A  U N             T        Y   20         
ATRACC2X DS    XL8                                                              
ATRAC2DH DS    XL8                                                              
ATRAC2D  DS    CL36     9   31   36  A  P N             T        Y   21         
ATRAC2DX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      9   68    3  A  P N             T        Y              
ATRCD2H  DS    XL8                                                              
ATRCD2   DS    CL1      9   72    1  A  U N             T        Y   22         
ATRCD2X  DS    XL8                                                              
ATRCDD2H DS    XL8                                                              
ATRCDD2  DS    CL6      9   75    6  A  P N             T        Y   23         
ATRCDD2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     10    2    9  A  P N             T        Y              
ATRNARH  DS    XL8                                                              
ATRNAR   DS    CL55    10   14   55  A  U N             T        Y   24         
ATRNARX  DS    XL8                                                              
ATRNAR2H DS    XL8                                                              
ATRNAR2  DS    CL55    11   14   55  A  U N             T        Y   25         
ATRNAR2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     11   75    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     13    2    6  A  P H             T        Y              
ATRCLIH  DS    XL8                                                              
ATRCLI   DS    CL6     13   10    6  A  U N             T        Y   30         
ATRCLIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     13   18    7  A  P H             T        Y              
ATRPROH  DS    XL8                                                              
ATRPRO   DS    CL6     13   27    6  A  U N             T        Y   32         
ATRPROX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13   35    3  A  P H             T        Y              
ATRJOBH  DS    XL8                                                              
ATRJOB   DS    CL6     13   40    6  A  U N             T        Y   34         
ATRJOBX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    13   48   11  A  P H             T        Y              
ATREXH   DS    XL8                                                              
ATREX    DS    CL15    13   60   15  A  U N             T        Y   36         
ATREXX   DS    XL8                                                              
ATRNAM1H DS    XL8                                                              
ATRNAM1  DS    CL76    14    2   76  A  P N             T        Y   38         
ATRNAM1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     15    2    6  A  P N             T        Y              
ATRWCH   DS    XL8                                                              
ATRWC    DS    CL2     15   10    2  A  U N             T        Y   40         
ATRWCX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     15   18    7  A  P N             T        Y              
ATRNWCH  DS    XL8                                                              
ATRNWC   DS    CL2     15   27    2  A  U N             T        Y   42         
ATRNWCX  DS    XL8                                                              
ATRWCNH  DS    XL8                                                              
ATRWCN   DS    CL15    15   31   15  A  P N             T        Y   44         
ATRWCNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     15   52    6  A  P N             T        Y              
ATRAMH   DS    XL8                                                              
ATRAM    DS    CL12    15   60   12  A  U N             T        Y    1         
ATRAMX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     16    2    6  A  P N             T        Y              
ATRFOFFH DS    XL8                                                              
ATRFOFF  DS    CL2     16   10    2  A  U N             T        Y   46         
ATRFOFFX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     16   18    6  A  P N             T        Y              
ATRCOFFH DS    XL8                                                              
ATRCOFF  DS    CL2     16   27    2  A  U N             T        Y   48         
ATRCOFFX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     16   35    6  A  P N             T        Y              
ATRAOFFH DS    XL8                                                              
ATRAOFF  DS    CL2     16   43    2  A  U N             T        Y   50         
ATRAOFFX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     16   52    4  A  P N             T        Y              
ATRDEPTH DS    XL8                                                              
ATRDEPT  DS    CL3     16   58    3  A  U N             T        Y   52         
ATRDEPTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     16   63    6  A  P N             T        Y              
ATRSTFH  DS    XL8                                                              
ATRSTF   DS    CL8     16   71    8  A  U N             T        Y   54         
ATRSTFX  DS    XL8                                                              
ATRNAM2H DS    XL8                                                              
ATRNAM2  DS    CL76    17    2   76  A  P N             T        Y   56         
ATRNAM2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     18    2    6  A  P H             T        Y              
ATRCLI2H DS    XL8                                                              
ATRCLI2  DS    CL6     18   10    6  A  U N             T        Y   58         
ATRCLI2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     18   18    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     18   27    6  A  U N             T        Y   60         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18   35    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     18   40    6  A  U N             T        Y   62         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    18   48   11  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL15    18   60   15  A  U N             T        Y   64         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL76    19    2   76  A  P N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     20    2    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   10    2  A  U N             T        Y   68         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     20   18    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   27    2  A  U N             T        Y   70         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    20   31   15  A  P N             T        Y   72         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     20   52    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    20   60   12  A  U N             T        Y    2         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     21    2    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     21   10    2  A  U N             T        Y   74         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     21   18    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     21   27    2  A  U N             T        Y   76         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     21   35    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     21   43    2  A  U N             T        Y   78         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     21   52    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   58    3  A  U N             T        Y   80         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     21   63    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   71    8  A  U N             T        Y   82         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL76    22    2   76  A  P N             T        Y   84         
         DS    XL8                                                              
ATRTABH  DS    XL8                                                              
ATRTAB   DS    CL1     22   79    1  A  U N             T        Y   86         
ATRTABX  DS    XL8                                                              
ATRTOTH  DS    XL8                                                              
ATRTOT   DS    CL61    23   10   61  A  P N             T        Y   88         
ATRTOTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  255         
         DS    XL8                                                              
ATRLAST  DS    XL1                                                              
         DS    XL2    INDICS=I                                                  
ATRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2168 BYTES                            
