*          DATA SET ACBATA7D   AT LEVEL 001 AS OF 06/17/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BA7D      DATE 06/17/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL10     6    2   10  L   P    H         T        Y              
TYPBTYH  DS    CL8                                                              
TYPBTY   DS    CL19     6   13   19  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL10     7    2   10  L   P    H         T        Y              
TYPCTRH  DS    CL8                                                              
TYPCTR   DS    CL11     7   13   11  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL21    10    2   21  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9     10   24    9  L   P    N         T        Y              
TYPACC1H DS    CL8                                                              
TYPACC1  DS    CL30    10   34   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     11   24    9  L   P    N         T        Y              
TYPACC2H DS    CL8                                                              
TYPACC2  DS    CL30    11   34   30  A   U    N         T        Y              
TYPPFKH  DS    CL8                                                              
TYPPFK   DS    CL78    24    2   78  A   P    N         T        Y  255         
TYPPFKX  DS    CL8                                                              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 320  BYTES                            
