*          DATA SET ACBATBBD   AT LEVEL 004 AS OF 09/17/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BBBD      DATE 09/17/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     6    2   11  L  P N             T        Y              
IVMORDH  DS    CL8                                                              
IVMORD   DS    CL11     6   14   11  A  U N             T    I   Y   11         
IVMORDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     6   31   11  L  P N             T        Y              
IVMOAMTH DS    CL8                                                              
IVMOAMT  DS    CL12     6   42   12  A  P N             T        Y   32         
IVMOAMTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16     6   55   16  L  P N             T        Y              
IVMITDH  DS    CL8                                                              
IVMITD   DS    CL6      6   72    6  A  P N             T        Y   33         
IVMITDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     7    2   11  L  P N             T        Y              
IVMREFH  DS    CL8                                                              
IVMREF   DS    CL21     7   14   21  A  U N             T        Y   13         
IVMREFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   55    6  L  P N             T        Y              
IVMDOCH  DS    CL8                                                              
IVMDOC   DS    CL6      7   63    6  L  U N             T        Y   14         
IVMDOCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     8    2   11  L  P N             T        Y              
IVMDAT1H DS    CL8                                                              
IVMDAT1  DS    CL8      8   14    8  A  U N             T        Y   15         
IVMDAT1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12     8   31   12  L  P N             T        Y              
IVMPDATH DS    CL8                                                              
IVMPDAT  DS    CL8      8   45    8  A  U N             T        Y   16         
IVMPDATX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      8   55    6  L  P N             T        Y              
IVMURGH  DS    CL8                                                              
IVMURG   DS    CL1      8   63    1  A  U N             T        Y   17         
IVMURGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     9    2   11  L  P N             T        Y              
IVMCSHH  DS    CL8                                                              
IVMCSH   DS    CL15     9   14   15  A  U N             T        Y   18         
IVMCSHX  DS    CL8                                                              
IVMCSDH  DS    CL8                                                              
IVMCSD   DS    CL36     9   31   36  A  P N             T        Y   19         
IVMCSDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     10    2    6  L  P N             T        Y              
IVMSRCH  DS    CL8                                                              
IVMSRC   DS    CL12    10   14   12  A  U N             T        Y   28         
IVMSRCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    11    2   11  L  P N             T        Y              
IVMPVENH DS    CL8                                                              
IVMPVEN  DS    CL15    11   14   15  A  U N             T        Y   20         
IVMPVENX DS    CL8                                                              
IVMPVNMH DS    CL8                                                              
IVMPVNM  DS    CL36    11   31   36  L  P N             T        Y   21         
IVMPVNMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     11   68    3  A  P N             T        Y              
IVMCDH   DS    CL8                                                              
IVMCD    DS    CL1     11   72    1  A  U N             T        Y   21         
IVMCDX   DS    CL8                                                              
IVMCDDH  DS    CL8                                                              
IVMCDD   DS    CL6     11   75    6  A  P N             T        Y   22         
IVMCDDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    12    2   11  L  P N             T        Y              
IVMEVENH DS    CL8                                                              
IVMEVEN  DS    CL15    12   14   15  A  U N             T        Y   23         
IVMEVENX DS    CL8                                                              
IVMEVNMH DS    CL8                                                              
IVMEVNM  DS    CL36    12   31   36  L  P N             T        Y   24         
IVMEVNMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     12   68    3  A  P N             T        Y              
IVMCD2H  DS    CL8                                                              
IVMCD2   DS    CL1     12   72    1  A  U N             T        Y   25         
IVMCD2X  DS    CL8                                                              
IVMCDD2H DS    CL8                                                              
IVMCDD2  DS    CL6     12   75    6  A  P N             T        Y   26         
IVMCDD2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    13    2   11  L  P N             T        Y              
IVMVAMTH DS    CL8                                                              
IVMVAMT  DS    CL12    13   14   12  A  U N             T        Y   34         
IVMVAMTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    13   31   11  L  P N             T        Y              
IVMCOFFH DS    CL8                                                              
IVMCOFF  DS    CL2     13   45    2  A  U N             T        Y   27         
IVMCOFFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    14    2   11  L  P N             T        Y              
IVMNARRH DS    CL8                                                              
IVMNARR  DS    CL64    14   14   64  L  U N             T        Y   29         
IVMNARRX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    15    2   11  L  P N             T        Y              
IVMOVRDH DS    CL8                                                              
IVMOVRD  DS    CL1     15   14    1  A  U N             T        Y   30         
IVMOVRDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    16   11   14  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    16   46   14  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  L  P Z             T        Y              
         DS    CL8                                                              
         DS    CL4     17    6    4  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    17   11   14  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL19    17   26   19  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    17   46   14  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   66    6  L  P Z             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  L  P Z             T        Y              
         DS    CL8                                                              
         DS    CL4     18    6    4  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    18   11   14  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL19    18   26   19  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    18   46   14  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   61   11  L  P Z             T        Y              
IVMSUBH  DS    CL8                                                              
IVMSUB   DS    CL3     19    2    3  A  P N             T        Y   35         
IVMSUBX  DS    CL8                                                              
IVMWCH   DS    CL8                                                              
IVMWC    DS    CL4     19    6    4  A  U N             T        Y   36         
IVMWCX   DS    CL8                                                              
IVMCPJH  DS    CL8                                                              
IVMCPJ   DS    CL14    19   11   14  A  U N             T        Y   37         
IVMCPJX  DS    CL8                                                              
IVMODSH  DS    CL8                                                              
IVMODS   DS    CL19    19   26   19  A  U N             T        Y   38         
IVMODSX  DS    CL8                                                              
IVMEXPH  DS    CL8                                                              
IVMEXP   DS    CL14    19   46   14  A  U N             T        Y   39         
IVMEXPX  DS    CL8                                                              
IVMAMTH  DS    CL8                                                              
IVMAMT   DS    CL11    19   61   11  A  P N             T        Y   40         
IVMAMTX  DS    CL8                                                              
IVMTABH  DS    CL8                                                              
IVMTAB   DS    CL1     19   79    1  A  U N             T        Y   70         
IVMTABX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  255         
         DS    CL8                                                              
IVMLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
IVMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1560 BYTES                            
