*          DATA SET ACBATADD   AT LEVEL 001 AS OF 06/17/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BADD      DATE 06/17/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
ILITXT1H DS    CL8                                                              
ILITXT1  DS    CL79     4    2   79  A   P    N         T        Y  254         
ILITXT1X DS    CL8                                                              
ILITXT2H DS    CL8                                                              
ILITXT2  DS    CL79     5    2   79  A   P    N         T        Y              
ILIIHDTH DS    CL8                                                              
ILIIHDT  DS    CL6      7    7    6  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL6      7   15    6  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL8      7   23    8  L   P    H         T        Y              
ILIHED1H DS    CL8                                                              
ILIHED1  DS    CL48     7   33   48  L   P    H         T        Y              
ILIACTTH DS    CL8                                                              
ILIACTT  DS    CL3      8    2    3  L   P    H         T        Y              
ILIIHDUH DS    CL8                                                              
ILIIHDU  DS    CL6      8    7    6  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL6      8   15    6  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL8      8   23    8  L   P    H         T        Y              
ILIHED2H DS    CL8                                                              
ILIHED2  DS    CL48     8   33   48  L   P    H         T        Y              
ILIACT1H DS    CL8                                                              
ILIACT1  DS    CL3      9    2    3  A   U    N         T        Y    1         
ILIACT1X DS    CL8                                                              
ILIITEMH DS    CL8                                                              
ILIITEM  DS    CL6      9    7    6  A   P    N         T        Y              
ILIREFH  DS    CL8                                                              
ILIREF   DS    CL6      9   15    6  A   P    N         T        Y              
ILIDATEH DS    CL8                                                              
ILIDATE  DS    CL8      9   23    8  A   P    N         T        Y              
ILILIN1H DS    CL8                                                              
ILILIN1  DS    CL48     9   33   48  A   P    N         T        Y              
ILIACT2H DS    CL8                                                              
ILIACT2  DS    CL3     10    2    3  A   U    N         T        Y    1         
ILIACT2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     10    7    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     10   15    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     10   23    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    10   33   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     11    7    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     11   15    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     11   23    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    11   33   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     12    7    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     12   15    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     12   23    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    12   33   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     13    7    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     13   15    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     13   23    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    13   33   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14    7    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     14   15    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     14   23    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    14   33   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     15    7    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     15   15    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     15   23    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    15   33   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     16    7    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     16   15    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     16   23    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    16   33   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     17    7    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     17   15    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     17   23    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    17   33   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     18    7    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     18   15    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     18   23    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    18   33   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     19    7    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     19   15    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     19   23    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    19   33   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     20    7    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     20   15    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     20   23    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    20   33   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     21    7    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     21   15    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     21   23    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    21   33   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     22    7    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     22   15    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     22   23    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    22   33   48  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     23    7    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     23   15    6  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     23   23    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48    23   33   48  A   P    N         T        Y              
ILIPFKH  DS    CL8                                                              
ILIPFK   DS    CL78    24    2   78  A   P    N         T        Y  255         
ILIPFKX  DS    CL8                                                              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2280 BYTES                            
