*          DATA SET ACBATF9D   AT LEVEL 003 AS OF 09/19/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BF9D      DATE 09/19/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      6    3    8  A   P    N         T        Y              
BILBILLH DS    CL8                                                              
BILBILL  DS    CL6      6   20    6  A   U    N         T    I   Y   11         
BILBILLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7    3    4  A   P    N         T        Y              
BILDATH  DS    CL8                                                              
BILDAT   DS    CL9      7   20    9  A   U    N         T        Y   12         
BILDATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      8    3    8  A   P    N         T        Y              
BILDUEH  DS    CL8                                                              
BILDUE   DS    CL9      8   20    9  A   U    N         T        Y   13         
BILDUEX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9    3    6  A   P    N         T        Y              
BILCLIH  DS    CL8                                                              
BILCLI   DS    CL6      9   20    6  A   U    N         T        Y   14         
BILCLIX  DS    CL8                                                              
BILCLINH DS    CL8                                                              
BILCLIN  DS    CL36     9   36   36  A   P    N         T        Y   15         
BILCLINX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    3    7  A   P    N         T        Y              
BILPROH  DS    CL8                                                              
BILPRO   DS    CL6     10   20    6  A   U    N         T        Y   16         
BILPROX  DS    CL8                                                              
BILPRONH DS    CL8                                                              
BILPRON  DS    CL36    10   36   36  A   P    N         T        Y   17         
BILPRONX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     11    3    3  A   P    N         T        Y              
BILJOBH  DS    CL8                                                              
BILJOB   DS    CL6     11   20    6  A   U    N         T        Y   18         
BILJOBX  DS    CL8                                                              
BILJOBNH DS    CL8                                                              
BILJOBN  DS    CL36    11   36   36  A   P    N         T        Y   19         
BILJOBNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    12    3   14  A   P    N         T        Y              
BILCOMH  DS    CL8                                                              
BILCOM   DS    CL12    12   20   12  A   U    N         T        Y   20         
BILCOMX  DS    CL8                                                              
BILCOMNH DS    CL8                                                              
BILCOMN  DS    CL36    12   36   36  A   P    N         T        Y   21         
BILCOMNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    13    3   14  A   P    N         T        Y              
BILDUMH  DS    CL8                                                              
BILDUM   DS    CL12    13   20   12  A   U    N         T        Y   22         
BILDUMX  DS    CL8                                                              
BILDUMNH DS    CL8                                                              
BILDUMN  DS    CL36    13   36   36  A   P    N         T        Y   23         
BILDUMNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    14    3   11  A   P    N         T        Y              
BILAMTH  DS    CL8                                                              
BILAMT   DS    CL11    14   20   11  A   U    N         T        Y   24         
BILAMTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    15    3   11  A   P    N         T        Y              
BILNETH  DS    CL8                                                              
BILNET   DS    CL11    15   20   11  A   U    N         T        Y   25         
BILNETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    16    3   10  A   P    N         T        Y              
BILCAMH  DS    CL8                                                              
BILCAM   DS    CL11    16   20   11  A   U    N         T        Y   26         
BILCAMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    17    3   13  A   P    N         T        Y              
BILCDH   DS    CL8                                                              
BILCD    DS    CL11    17   20   11  A   U    N         T        Y   27         
BILCDX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18   20    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A   P    N         T        Y  255         
         DS    CL8                                                              
BILLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
BILWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 880  BYTES                            
