*          DATA SET ACBATD4D   AT LEVEL 003 AS OF 06/17/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BD4D      DATE 06/17/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL44     6    1   44  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6      6   53    6  A   P    N         T        Y              
CALOVR1H DS    CL8                                                              
CALOVR1  DS    CL12     8    1   12  A   P    N         T        Y   11         
CALOVR1X DS    CL8                                                              
CALBILLH DS    CL8                                                              
CALBILL  DS    CL6      8   16    6  A   U    N         T        Y   12         
CALBILLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      8   26    8  A   U    N         T        Y   13         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12     8   38   12  A   U    N         T        Y   14         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2      8   54    2  A   U    N         T        Y   15         
         DS    CL8                                                              
CALOVR2H DS    CL8                                                              
CALOVR2  DS    CL12     9    1   12  A   P    N         T        Y   16         
CALOVR2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9   16    6  A   U    N         T        Y   17         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      9   26    8  A   U    N         T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12     9   38   12  A   U    N         T        Y   19         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2      9   54    2  A   U    N         T        Y   20         
         DS    CL8                                                              
CALOVR3H DS    CL8                                                              
CALOVR3  DS    CL12    10    1   12  A   P    N         T        Y   21         
CALOVR3X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     10   16    6  A   U    N         T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     10   26    8  A   U    N         T        Y   23         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    10   38   12  A   U    N         T        Y   24         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     10   54    2  A   U    N         T        Y   25         
         DS    CL8                                                              
CALOVR4H DS    CL8                                                              
CALOVR4  DS    CL12    11    1   12  A   P    N         T        Y   26         
CALOVR4X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     11   16    6  A   P    N         T        Y   27         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     11   26    8  A   P    N         T        Y   28         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    11   38   12  A   P    N         T        Y   29         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     11   54    2  A   P    N         T        Y   30         
         DS    CL8                                                              
CALOVR5H DS    CL8                                                              
CALOVR5  DS    CL12    12    1   12  A   P    N         T        Y   31         
CALOVR5X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     12   16    6  A   P    N         T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     12   26    8  A   P    N         T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    12   38   12  A   P    N         T        Y   34         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     12   54    2  A   P    N         T        Y   35         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     13    1    2  A   P    N         T        Y   36         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     14    1    2  A   P    N         T        Y   37         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     15    1    2  A   P    N         T        Y   38         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     16    1    2  A   P    N         T        Y   39         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     17    1    2  A   P    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     18    1    2  A   P    N         T        Y   41         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     19    1    2  A   P    N         T        Y   42         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     20    1    2  A   P    N         T        Y   43         
         DS    CL8                                                              
CALOVCRH DS    CL8                                                              
CALOVCR  DS    CL52    21    3   52  A   P    N         T        Y   44         
CALOVCRX DS    CL8                                                              
CALOVT1H DS    CL8                                                              
CALOVT1  DS    CL40    22    3   40  A   P    N         T        Y   45         
CALOVT1X DS    CL8                                                              
CALOVT2H DS    CL8                                                              
CALOVT2  DS    CL32    22   48   32  A   P    N         T        Y   46         
CALOVT2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    24    2   78  A   P    N         T        Y  255         
         DS    CL8                                                              
         DS    CL1                                                              
         DS    CL2    INDICS=II                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1080 BYTES                            
