*          DATA SET ACBATA1D   AT LEVEL 039 AS OF 11/01/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BA1D      DATE 11/01/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL14     8    3   14  A  P N             T        Y              
MSPINVH  DS    XL8                                                              
MSPINV   DS    CL11     8   22   11  A  U N             T        Y   12         
MSPINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      9    3    4  A  P N             T        Y              
MSPDATH  DS    XL8                                                              
MSPDAT   DS    CL8      9   22    8  A  U N             T        Y   14         
MSPDATX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    10    3   18  A  P N             T        Y              
MSPMCAH  DS    XL8                                                              
MSPMCA   DS    CL14    10   22   14  A  U N             T        Y   16         
MSPMCAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    10   40   12  A  P N             T        Y              
MSPCSHH  DS    XL8                                                              
MSPCSH   DS    CL14    10   58   14  A  U N             T        Y   18         
MSPCSHX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     11    3    6  A  P N             T        Y              
MSPVENH  DS    XL8                                                              
MSPVEN   DS    CL14    11   22   14  A  U N             T        Y   20         
MSPVENX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    11   40   10  A  P N             T        Y              
MSPPAYH  DS    XL8                                                              
MSPPAY   DS    CL8     11   58    8  A  U N             T        Y   22         
MSPPAYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     12    3    6  A  P N             T        Y              
MSPCLTH  DS    XL8                                                              
MSPCLT   DS    CL3     12   22    3  A  U N             T        Y   24         
MSPCLTX  DS    XL8                                                              
MSPCLTNH DS    XL8                                                              
MSPCLTN  DS    CL36    12   40   36  A  P N             T        Y   26         
MSPCLTNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     13    3    7  A  P N             T        Y              
MSPPRDH  DS    XL8                                                              
MSPPRD   DS    CL3     13   22    3  A  U N             T        Y   28         
MSPPRDX  DS    XL8                                                              
MSPPRDNH DS    XL8                                                              
MSPPRDN  DS    CL36    13   40   36  A  P N             T        Y   30         
MSPPRDNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     14    3    8  A  P N             T        Y              
MSPESTH  DS    XL8                                                              
MSPEST   DS    CL3     14   22    3  A  U N             T        Y   32         
MSPESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    15    3   16  A  P N             T        Y              
MSPMOSH  DS    XL8                                                              
MSPMOS   DS    CL6     15   22    6  A  U N             T        Y   38         
MSPMOSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    15   40   16  A  P N             T        Y              
MSPSUBH  DS    XL8                                                              
MSPSUB   DS    CL1     15   58    1  A  U N             T        Y   36         
MSPSUBX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    16    3   10  A  P N             T        Y              
MSPAOFH  DS    XL8                                                              
MSPAOF   DS    CL2     16   22    2  A  U N             T        Y   33         
MSPAOFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    17    3   10  A  P N             T        Y              
MSPAMTH  DS    XL8                                                              
MSPAMT   DS    CL12    17   22   12  A  U N             T        Y   34         
MSPAMTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    17   40   10  A  P N             T        Y              
MSPGAMTH DS    XL8                                                              
MSPGAMT  DS    CL12    17   58   12  A  U N             T        Y   44         
MSPGAMTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     18    3    9  A  P N             T        Y              
MSPNAR1H DS    XL8                                                              
MSPNAR1  DS    CL60    19    3   60  A  U N             T        Y   40         
MSPNAR1X DS    XL8                                                              
MSPNAR2H DS    XL8                                                              
MSPNAR2  DS    CL60    20    3   60  A  U N             T        Y   42         
MSPNAR2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21    3    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  255         
         DS    XL8                                                              
MSPLAST  DS    XL1                                                              
         DS    XL2    INDICS=I                                                  
MSPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 976  BYTES                            
