*          DATA SET ACBATFAD   AT LEVEL 001 AS OF 07/24/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BFAD      DATE 07/24/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      6    3    9  A  P N             T        Y              
MULDOCH  DS    CL8                                                              
MULDOC   DS    CL6      6   13    6  A  U N             T    I   Y   11         
MULDOCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6   20    4  A  P N             T        Y              
MULDATH  DS    CL8                                                              
MULDAT   DS    CL8      6   25    8  A  U N             T        Y   12         
MULDATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      7    3    9  A  P N             T        Y              
MULNARH  DS    CL8                                                              
MULNAR   DS    CL50     7   13   50  A  U N             T        Y   13         
MULNARX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9    3    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL49     9   19   49  A  P N             T        Y              
MULFRSTH DS    CL8                                                              
MULFRST  DS    CL14    10    3   14  A  U N             T        Y   14         
MULFRSTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    10   19   14  A  U N             T        Y   15         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     10   35    1  A  U N             T        Y   16         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     10   39    2  A  U N             T        Y   17         
         DS    CL8                                                              
MULFCASH DS    CL8                                                              
MULFCAS  DS    CL12    10   43   12  A  U N             T        Y    1         
MULFCASX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL24    10   56   24  A  P N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    11    3   14  A  U N             T        Y   19         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    11   19   14  A  U N             T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     11   35    1  A  U N             T        Y   21         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     11   39    2  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    11   43   12  A  U N             T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL24    11   56   24  A  P N             T        Y   23         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    12    3   14  A  U N             T        Y   24         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    12   19   14  A  U N             T        Y   25         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     12   35    1  A  U N             T        Y   26         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     12   39    2  A  U N             T        Y   27         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    12   43   12  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL24    12   56   24  A  P N             T        Y   28         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    13    3   14  A  U N             T        Y   29         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    13   19   14  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13   35    1  A  U N             T        Y   31         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     13   39    2  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    13   43   12  A  U N             T        Y    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL24    13   56   24  A  P N             T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    14    3   14  A  U N             T        Y   34         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    14   19   14  A  U N             T        Y   35         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     14   35    1  A  U N             T        Y   36         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     14   39    2  A  U N             T        Y   37         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    14   43   12  A  U N             T        Y    5         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL24    14   56   24  A  P N             T        Y   38         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    15    3   14  A  U N             T        Y   39         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    15   19   14  A  U N             T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15   35    1  A  U N             T        Y   41         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     15   39    2  A  U N             T        Y   42         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    15   43   12  A  U N             T        Y    6         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL24    15   56   24  A  P N             T        Y   43         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    16    3   14  A  U N             T        Y   44         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    16   19   14  A  U N             T        Y   45         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   35    1  A  U N             T        Y   46         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     16   39    2  A  U N             T        Y   47         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    16   43   12  A  U N             T        Y    7         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL24    16   56   24  A  P N             T        Y   48         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    17    3   14  A  U N             T        Y   49         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    17   19   14  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   35    1  A  U N             T        Y   51         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     17   39    2  A  U N             T        Y   52         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    17   43   12  A  U N             T        Y    8         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL24    17   56   24  A  P N             T        Y   53         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    18    3   14  A  U N             T        Y   54         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    18   19   14  A  U N             T        Y   55         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18   35    1  A  U N             T        Y   56         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     18   39    2  A  U N             T        Y   57         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    18   43   12  A  U N             T        Y    9         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL24    18   56   24  A  P N             T        Y   58         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    19    3   14  A  U N             T        Y   59         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    19   19   14  A  U N             T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   35    1  A  U N             T        Y   61         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     19   39    2  A  U N             T        Y   62         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    19   43   12  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL24    19   56   24  A  P N             T        Y   63         
         DS    CL8                                                              
MULTABH  DS    CL8                                                              
MULTAB   DS    CL1     20    3    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  255         
         DS    CL8                                                              
MULLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
MULWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1968 BYTES                            
