*          DATA SET ACBATD5D   AT LEVEL 004 AS OF 09/16/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BD5D      DATE 09/16/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      6    3    9  A   P    N         T        Y              
CMBDATH  DS    CL8                                                              
CMBDAT   DS    CL9      6   25    9  A   U    N         T    I   Y   11         
CMBDATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      7    3    8  A   P    N         T        Y              
CMBDUEDH DS    CL8                                                              
CMBDUED  DS    CL9      7   25    9  A   U    N         T        Y   12         
CMBDUEDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     8    3   11  A   P    N         T        Y              
CMBBILH  DS    CL8                                                              
CMBBIL   DS    CL6      8   25    6  A   U    N         T        Y   13         
CMBBILX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9    3    6  A   P    N         T        Y              
CMBAGYH  DS    CL8                                                              
CMBAGY   DS    CL3      9   25    3  A   U    N         T        Y   14         
CMBAGYX  DS    CL8                                                              
CMBAGYNH DS    CL8                                                              
CMBAGYN  DS    CL36     9   40   36  A   P    N         T        Y   15         
CMBAGYNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     10    3    6  A   P    N         T        Y              
CMBSRCH  DS    CL8                                                              
CMBSRC   DS    CL12    10   25   12  A   U    N         T        Y   16         
CMBSRCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    11    3   12  A   P    N         T        Y              
CMBINCH  DS    CL8                                                              
CMBINC   DS    CL2     11   25    2  A   U    N         T        Y   17         
CMBINCX  DS    CL8                                                              
CMBINCNH DS    CL8                                                              
CMBINCN  DS    CL36    11   40   36  A   P    N         T        Y   18         
CMBINCNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    12    3   20  A   P    N         T        Y              
CMBGRSH  DS    CL8                                                              
CMBGRS   DS    CL11    12   25   11  A   U    N         T        Y   19         
CMBGRSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    13    3   10  A   P    N         T        Y              
CMBDUEH  DS    CL8                                                              
CMBDUE   DS    CL11    13   25   11  A   U    N         T        Y   20         
CMBDUEX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     14    3    9  A   P    N         T        Y              
CMBNARH  DS    CL8                                                              
CMBNAR   DS    CL49    14   25   49  A   U    N         T        Y   21         
CMBNARX  DS    CL8                                                              
CMBTABH  DS    CL8                                                              
CMBTAB   DS    CL1     15   25    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A   P    N         T        Y  255         
         DS    CL8                                                              
         DS    CL1                                                              
         DS    CL2    INDICS=II                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 632  BYTES                            
