*          DATA SET ACBATE5D   AT LEVEL 003 AS OF 06/10/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BE5D      DATE 06/10/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL10     6    2   10  L   P    N         T        Y              
RETADVH  DS    CL8                                                              
RETADV   DS    CL1      6   14    1  A   U    N         T    I   Y   11         
RETADVX  DS    CL8                                                              
RETADVNH DS    CL8                                                              
RETADVN  DS    CL36     6   30   36  A   P    N         T        Y   12         
RETADVNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7    2    5  L   P    N         T        Y              
RETMEDH  DS    CL8                                                              
RETMED   DS    CL4      7   14    4  A   U    N         T        Y   13         
RETMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   30    7  L   P    N         T        Y              
RETPROH  DS    CL8                                                              
RETPRO   DS    CL6      7   42    6  A   U    N         T        Y   14         
RETPROX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      7   51    8  L   P    N         T        Y              
RETESTH  DS    CL8                                                              
RETEST   DS    CL3      7   64    3  A   U    N         T        Y   15         
RETESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  L   P    N         T        Y              
RETINVH  DS    CL8                                                              
RETINV   DS    CL10     8   14   10  A   U    N         T        Y   16         
RETINVX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     8   30   11  L   P    N         T        Y              
RETDATH  DS    CL8                                                              
RETDAT   DS    CL8      8   42    8  A   U    N         T        Y   17         
RETDATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     8   51   10  L   P    N         T        Y              
RETMOSH  DS    CL8                                                              
RETMOS   DS    CL6      8   64    6  A   U    N         T        Y   18         
RETMOSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL39    10    2   39  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    10   45   12  A   P    N         T        Y              
RETFMKTH DS    CL8                                                              
RETFMKT  DS    CL9     12    2    9  A   U    N         T        Y   19         
RETFMKTX DS    CL8                                                              
RETFCSHH DS    CL8                                                              
RETFCSH  DS    CL11    12   14   11  A   U    N         T        Y   20         
RETFCSHX DS    CL8                                                              
RETFNAMH DS    CL8                                                              
RETFNAM  DS    CL36    12   30   36  A   P    N         T        Y   21         
RETFNAMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     13    2    9  A   U    N         T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    13   14   11  A   U    N         T        Y   23         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL36    13   30   36  A   P    N         T        Y   24         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     14    2    9  A   U    N         T        Y   25         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    14   14   11  A   U    N         T        Y   26         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL36    14   30   36  A   P    N         T        Y   27         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     15    2    9  A   U    N         T        Y   28         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    15   14   11  A   U    N         T        Y   29         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL36    15   30   36  A   P    N         T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     16    2    9  A   U    N         T        Y   31         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    16   14   11  A   U    N         T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL36    16   30   36  A   P    N         T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     17    2    9  A   U    N         T        Y   34         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    17   14   11  A   U    N         T        Y   35         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL36    17   30   36  A   P    N         T        Y   36         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     18    2    9  A   U    N         T        Y   37         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    18   14   11  A   U    N         T        Y   38         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL36    18   30   36  A   P    N         T        Y   39         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     19    2    9  A   U    N         T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    19   14   11  A   U    N         T        Y   41         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL36    19   30   36  A   P    N         T        Y   42         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     20    2    9  A   U    N         T        Y   43         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    20   14   11  A   U    N         T        Y   44         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL36    20   30   36  A   P    N         T        Y   45         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     21    2    9  A   U    N         T        Y   46         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    21   14   11  A   U    N         T        Y   47         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL36    21   30   36  A   P    N         T        Y   48         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     22    2    9  A   U    N         T        Y   49         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    22   14   11  A   U    N         T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL36    22   30   36  A   P    N         T        Y   51         
         DS    CL8                                                              
RETTABH  DS    CL8                                                              
RETTAB   DS    CL1     22   70    1  A   U    N         T        Y              
RETPFKH  DS    CL8                                                              
RETPFK   DS    CL78    24    2   78  A   P    N         T        Y  255         
RETPFKX  DS    CL8                                                              
RETLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
RETWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1640 BYTES                            
