*          DATA SET ACBATFBD   AT LEVEL 003 AS OF 12/19/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BFBD      DATE 12/19/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
CMIORDH  DS    XL8                                                              
CMIORD   DS    CL8      6   15    8  A  U N             T    I   Y    7         
CMIORDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     6   25   12  A  P H             T        Y              
CMIORDAH DS    XL8                                                              
CMIORDA  DS    CL12     6   38   12  A  P H             T        Y    8         
CMIORDAX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15     6   51   15  A  P H             T        Y              
CMIORDNH DS    XL8                                                              
CMIORDN  DS    CL12     6   67   12  A  P H             T        Y    9         
CMIORDNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      7    2    9  A  P H             T        Y              
CMIDOCH  DS    XL8                                                              
CMIDOC   DS    CL27     7   15   27  A  U N             T        Y   10         
CMIDOCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      7   43    8  A  P H             T        Y              
CMIDATH  DS    XL8                                                              
CMIDAT   DS    CL8      7   53    8  A  U N             T        Y   11         
CMIDATX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      7   63    8  A  P H             T        Y              
CMIDUEH  DS    XL8                                                              
CMIDUE   DS    CL8      7   72    8  A  U N             T        Y   12         
CMIDUEX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     8    2   10  A  P H             T        Y              
CMIGONH  DS    XL8                                                              
CMIGON   DS    CL1      8   13    1  A  U N             T        Y   13         
CMIGONX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      8   17    8  A  P H             T        Y              
CMIGTYH  DS    XL8                                                              
CMIGTY   DS    CL1      8   26    1  A  U N             T        Y   14         
CMIGTYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     8   30   10  A  P H             T        Y              
CMIGAMH  DS    XL8                                                              
CMIGAM   DS    CL12     8   43   12  A  U N             T        Y   15         
CMIGAMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      9    2    8  A  P H             T        Y              
CMIPRVH  DS    XL8                                                              
CMIPRV   DS    CL2      9   13    2  A  U N             T        Y   16         
CMIPRVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      9   17    8  A  P H             T        Y              
CMIPTYH  DS    XL8                                                              
CMIPTY   DS    CL1      9   26    1  A  U N             T        Y   17         
CMIPTYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     9   30   10  A  P H             T        Y              
CMIPAMH  DS    XL8                                                              
CMIPAM   DS    CL12     9   43   12  A  U N             T        Y   18         
CMIPAMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    10    2   11  A  P H             T        Y              
CMIVENH  DS    XL8                                                              
CMIVEN   DS    CL50    10   15   50  A  U N             T        Y   19         
CMIVENX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     10   68    3  A  P H             T        Y              
CMIVCDH  DS    XL8                                                              
CMIVCD   DS    CL1     10   72    1  A  U N             T        Y   20         
CMIVCDX  DS    XL8                                                              
CMIVCDDH DS    XL8                                                              
CMIVCDD  DS    CL6     10   74    6  A  P H             T        Y   21         
CMIVCDDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    11    2   10  A  P H             T        Y              
CMIXVNH  DS    XL8                                                              
CMIXVN   DS    CL50    11   15   50  A  U N             T        Y   22         
CMIXVNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     11   68    3  A  P H             T        Y              
CMIXCDH  DS    XL8                                                              
CMIXCD   DS    CL1     11   72    1  A  U N             T        Y   23         
CMIXCDX  DS    XL8                                                              
CMIXCDDH DS    XL8                                                              
CMIXCDD  DS    CL6     11   74    6  A  P H             T        Y   24         
CMIXCDDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    12    2   12  A  P H             T        Y              
CMICSHH  DS    XL8                                                              
CMICSH   DS    CL15    12   15   15  A  U N             T        Y   25         
CMICSHX  DS    XL8                                                              
CMICSHNH DS    XL8                                                              
CMICSHN  DS    CL26    12   31   26  A  P H             T        Y   26         
CMICSHNX DS    XL8                                                              
CMIOVRTH DS    XL8                                                              
CMIOVRT  DS    CL8     12   57    8  A  P Z             T        Y              
CMIOVRH  DS    XL8                                                              
CMIOVR   DS    CL1     12   66    1  A  P N             T        Y   27         
CMIOVRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     12   68    6  A  P H             T        Y              
CMIURGH  DS    XL8                                                              
CMIURG   DS    CL1     12   75    1  A  U N             T        Y   28         
CMIURGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     13    2    9  A  P H             T        Y              
CMINARH  DS    XL8                                                              
CMINAR   DS    CL60    13   14   60  A  U N             T        Y   29         
CMINARX  DS    XL8                                                              
CMINAR2H DS    XL8                                                              
CMINAR2  DS    CL60    14   14   60  A  U N             T        Y   30         
CMINAR2X DS    XL8                                                              
CMIFSTH  DS    XL8                                                              
CMIFST   DS    CL6     15    2    6  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     15   16    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     15   23    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     15   27    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     15   31    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL11    15   39   11  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     15   56    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     15   60    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     15   64    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL4     15   68    4  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     15   73    6  A  P H             T        Y              
CMIAMTH  DS    XL8                                                              
CMIAMT   DS    CL12    16    2   12  A  U N             T        Y   31         
CMIAMTX  DS    XL8                                                              
CMIWKCH  DS    XL8                                                              
CMIWKC   DS    CL5     16   16    5  A  U N             T        Y   32         
CMIWKCX  DS    XL8                                                              
CMICLIH  DS    XL8                                                              
CMICLI   DS    CL3     16   23    3  A  U N             T        Y   33         
CMICLIX  DS    XL8                                                              
CMIPROH  DS    XL8                                                              
CMIPRO   DS    CL3     16   27    3  A  U N             T        Y   34         
CMIPROX  DS    XL8                                                              
CMIJOBH  DS    XL8                                                              
CMIJOB   DS    CL6     16   31    6  A  U N             T        Y   35         
CMIJOBX  DS    XL8                                                              
CMIEXAH  DS    XL8                                                              
CMIEXA   DS    CL15    16   39   15  A  U N             T        Y   36         
CMIEXAX  DS    XL8                                                              
CMIDOFH  DS    XL8                                                              
CMIDOF   DS    CL2     16   56    2  A  U N             T        Y   37         
CMIDOFX  DS    XL8                                                              
CMICOFH  DS    XL8                                                              
CMICOF   DS    CL2     16   60    2  A  U N             T        Y   38         
CMICOFX  DS    XL8                                                              
CMIAOFH  DS    XL8                                                              
CMIAOF   DS    CL2     16   64    2  A  U N             T        Y   39         
CMIAOFX  DS    XL8                                                              
CMIDPTH  DS    XL8                                                              
CMIDPT   DS    CL3     16   68    3  A  U N             T        Y   40         
CMIDPTX  DS    XL8                                                              
CMIPERH  DS    XL8                                                              
CMIPER   DS    CL7     16   73    7  A  U N             T        Y   41         
CMIPERX  DS    XL8                                                              
CMILIN2H DS    XL8                                                              
CMILIN2  DS    CL12    17    2   12  A  U N             T        Y   42         
CMILIN2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     17   16    5  A  U N             T        Y   43         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17   23    3  A  U N             T        Y   44         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17   27    3  A  U N             T        Y   45         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     17   31    6  A  U N             T        Y   46         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    17   39   15  A  U N             T        Y   47         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     17   56    2  A  U N             T        Y   48         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     17   60    2  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     17   64    2  A  U N             T        Y   51         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17   68    3  A  U N             T        Y   52         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     17   73    7  A  U N             T        Y   53         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    18    2   12  A  U N             T        Y   55         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     18   16    5  A  U N             T        Y   56         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18   23    3  A  U N             T        Y   57         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18   27    3  A  U N             T        Y   58         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     18   31    6  A  U N             T        Y   59         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    18   39   15  A  U N             T        Y   60         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     18   56    2  A  U N             T        Y   61         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     18   60    2  A  U N             T        Y   62         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     18   64    2  A  U N             T        Y   63         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18   68    3  A  U N             T        Y   64         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     18   73    7  A  U N             T        Y   65         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    19    2   12  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     19   16    5  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19   23    3  A  U N             T        Y   68         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19   27    3  A  U N             T        Y   69         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     19   31    6  A  U N             T        Y   70         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    19   39   15  A  U N             T        Y   72         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     19   56    2  A  U N             T        Y   73         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     19   60    2  A  U N             T        Y   74         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     19   64    2  A  U N             T        Y   75         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19   68    3  A  U N             T        Y   76         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     19   73    7  A  U N             T        Y   77         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    20    2   12  A  U N             T        Y   78         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     20   16    5  A  U N             T        Y   79         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20   23    3  A  U N             T        Y   80         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20   27    3  A  U N             T        Y   81         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     20   31    6  A  U N             T        Y   82         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    20   39   15  A  U N             T        Y   83         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     20   56    2  A  U N             T        Y   84         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     20   60    2  A  U N             T        Y   86         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     20   64    2  A  U N             T        Y   87         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20   68    3  A  U N             T        Y   88         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     20   73    7  A  U N             T        Y   89         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    21    2   12  A  U N             T        Y   90         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5     21   16    5  A  U N             T        Y   91         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21   23    3  A  U N             T        Y   92         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21   27    3  A  U N             T        Y   93         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     21   31    6  A  U N             T        Y   94         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    21   39   15  A  U N             T        Y   95         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     21   56    2  A  U N             T        Y   96         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     21   60    2  A  U N             T        Y   98         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     21   64    2  A  U N             T        Y   99         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21   68    3  A  U N             T        Y  100         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     21   73    7  A  U N             T        Y  101         
         DS    XL8                                                              
CMITABH  DS    XL8                                                              
CMITAB   DS    CL1     22    2    1  A  U N             T        Y  130         
CMITABX  DS    XL8                                                              
CMITOTH  DS    XL8                                                              
CMITOT   DS    CL78    23    2   78  A  P H             T        Y  139         
CMITOTX  DS    XL8                                                              
CMIPFKH  DS    XL8                                                              
CMIPFK   DS    CL78    24    2   78  A  P H             T        Y  255         
CMIPFKX  DS    XL8                                                              
CMILAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
CMIWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2864 BYTES                            
