*          DATA SET ACBATBED   AT LEVEL 022 AS OF 08/13/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BBED      DATE 08/13/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      6    2    8  A  P N             T        Y              
JBGFJOBH DS    CL8                                                              
JBGFJOB  DS    CL17     6   15   17  A  P N             T        Y   71         
JBGFJOBX DS    CL8                                                              
JBGFNAMH DS    CL8                                                              
JBGFNAM  DS    CL35     6   45   35  A  P N             T        Y   72         
JBGFNAMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      7    2    8  A  P N             T        Y              
JBGTJOBH DS    CL8                                                              
JBGTJOB  DS    CL17     7   15   17  A  U N             T        Y   73         
JBGTJOBX DS    CL8                                                              
JBGTNAMH DS    CL8                                                              
JBGTNAM  DS    CL35     7   45   35  A  P N             T        Y   74         
JBGTNAMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
JBGCRACH DS    CL8                                                              
JBGCRAC  DS    CL17     8   15   17  A  P N             T        Y   75         
JBGCRACX DS    CL8                                                              
JBGCRNMH DS    CL8                                                              
JBGCRNM  DS    CL35     8   45   35  A  P N             T        Y   76         
JBGCRNMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  P N             T        Y              
JBGWCH   DS    CL8                                                              
JBGWC    DS    CL2      9    7    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      9   15    4  A  P N             T        Y              
JBGREFH  DS    CL8                                                              
JBGREF   DS    CL6      9   21    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      9   30    4  A  P N             T        Y              
JBGDATEH DS    CL8                                                              
JBGDATE  DS    CL8      9   36    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   48    6  A  P N             T        Y              
JBGSTATH DS    CL8                                                              
JBGSTAT  DS    CL3      9   56    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    10    2   12  A  P N             T        Y              
JBGTAMTH DS    CL8                                                              
JBGTAMT  DS    CL11    10   15   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    12    2   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    12   21   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   44    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   61    6  A  P N             T        Y              
JBGJOBH  DS    CL8                                                              
JBGJOB   DS    CL17    13    2   17  A  U N             T    I   Y              
JBGJOBNH DS    CL8                                                              
JBGJOBN  DS    CL20    13   21   20  A  P N             T        Y              
JBGPCNTH DS    CL8                                                              
JBGPCNT  DS    CL8     13   43    8  A  U N             T        Y              
JBGAMNTH DS    CL8                                                              
JBGAMNT  DS    CL11    13   56   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    14    2   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    14   21   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   56   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    15    2   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    15   21   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   56   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    16    2   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    16   21   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   56   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    17    2   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    17   21   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   56   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    18    2   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    18   21   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   56   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    19    2   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    19   21   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   56   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    20    2   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    20   21   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   56   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17    21    2   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    21   21   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   43    8  A  U N             T        Y              
JBGNNNNH DS    CL8                                                              
JBGNNNN  DS    CL11    21   56   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   43    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   56   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   36    5  A  P N             T        Y              
JBGPCTSH DS    CL8                                                              
JBGPCTS  DS    CL8     23   43    8  A  P N             T        Y              
JBGTOTSH DS    CL8                                                              
JBGTOTS  DS    CL11    23   56   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  255         
         DS    CL8                                                              
JBGLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
JBGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1496 BYTES                            
