*          DATA SET ACBATEAD   AT LEVEL 005 AS OF 06/09/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BEAD      DATE 06/09/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL11     6    2   11  A  P N             T        Y              
ATSDOCH  DS    XL8                                                              
ATSDOC   DS    CL13     6   14   13  A  P N             T    I   Y   11         
ATSDOCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   29    4  A  P N             T        Y              
ATSDAT1H DS    XL8                                                              
ATSDAT1  DS    CL8      6   35    8  A  P N             T        Y   12         
ATSDAT1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   45    4  A  P N             T        Y              
ATSURGH  DS    XL8                                                              
ATSURG   DS    CL1      6   51    1  A  P N             T        Y   13         
ATSURGX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      6   54    9  A  P N             T        Y              
ATSCSHH  DS    XL8                                                              
ATSCSH   DS    CL15     6   64   15  A  P N             T        Y   14         
ATSCSHX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
ATSACCH  DS    XL8                                                              
ATSACC   DS    CL15     7   14   15  A  P N             T        Y   15         
ATSACCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     7   31   11  A  P N             T        Y              
ATSACC2H DS    XL8                                                              
ATSACC2  DS    CL15     7   44   15  A  P N             T        Y   16         
ATSACC2X DS    XL8                                                              
ATSACCNH DS    XL8                                                              
ATSACCN  DS    CL76     8    2   76  A  P N             T        Y   17         
ATSACCNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      9    2    6  A  P H             T        Y              
ATSCLIH  DS    XL8                                                              
ATSCLI   DS    CL6      9   10    6  A  U N             T        Y   30         
ATSCLIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      9   18    7  A  P H             T        Y              
ATSPROH  DS    XL8                                                              
ATSPRO   DS    CL6      9   27    6  A  U N             T        Y   32         
ATSPROX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      9   35    3  A  P H             T        Y              
ATSJOBH  DS    XL8                                                              
ATSJOB   DS    CL6      9   40    6  A  U N             T        Y   34         
ATSJOBX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     9   48   11  A  P H             T        Y              
ATSEXH   DS    XL8                                                              
ATSEX    DS    CL15     9   60   15  A  U N             T        Y   36         
ATSEXX   DS    XL8                                                              
ATSNAM1H DS    XL8                                                              
ATSNAM1  DS    CL76    10    2   76  A  P N             T        Y   38         
ATSNAM1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     11    2    6  A  P N             T        Y              
ATSWCH   DS    XL8                                                              
ATSWC    DS    CL2     11   10    2  A  U N             T        Y   40         
ATSWCX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     11   18    7  A  P N             T        Y              
ATSNWCH  DS    XL8                                                              
ATSNWC   DS    CL2     11   27    2  A  U N             T        Y   42         
ATSNWCX  DS    XL8                                                              
ATSWCNH  DS    XL8                                                              
ATSWCN   DS    CL15    11   31   15  A  P N             T        Y   44         
ATSWCNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     11   52    6  A  P N             T        Y              
ATSAMH   DS    XL8                                                              
ATSAM    DS    CL12    11   60   12  A  U N             T        Y    1         
ATSAMX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     12    2    6  A  P N             T        Y              
ATSFOFFH DS    XL8                                                              
ATSFOFF  DS    CL2     12   10    2  A  U N             T        Y   46         
ATSFOFFX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     12   18    6  A  P N             T        Y              
ATSCOFFH DS    XL8                                                              
ATSCOFF  DS    CL2     12   27    2  A  U N             T        Y   48         
ATSCOFFX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     12   35    6  A  P N             T        Y              
ATSAOFFH DS    XL8                                                              
ATSAOFF  DS    CL2     12   43    2  A  U N             T        Y   50         
ATSAOFFX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     12   52    4  A  P N             T        Y              
ATSDEPTH DS    XL8                                                              
ATSDEPT  DS    CL3     12   58    3  A  U N             T        Y   52         
ATSDEPTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     12   63    6  A  P N             T        Y              
ATSSTFH  DS    XL8                                                              
ATSSTF   DS    CL8     12   71    8  A  U N             T        Y   54         
ATSSTFX  DS    XL8                                                              
ATSNAM2H DS    XL8                                                              
ATSNAM2  DS    CL76    13    2   76  A  P N             T        Y   56         
ATSNAM2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     14    2    6  A  P H             T        Y              
ATSCLI2H DS    XL8                                                              
ATSCLI2  DS    CL6     14   10    6  A  U N             T        Y   58         
ATSCLI2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     14   18    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     14   27    6  A  U N             T        Y   60         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     14   35    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     14   40    6  A  U N             T        Y   62         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    14   48   11  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL15    14   60   15  A  U N             T        Y   64         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL76    15    2   76  A  P N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     16    2    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   10    2  A  U N             T        Y   68         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     16   18    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   27    2  A  U N             T        Y   70         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    16   31   15  A  P N             T        Y   72         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     16   52    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    16   60   12  A  U N             T        Y    2         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     17    2    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     17   10    2  A  U N             T        Y   74         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     17   18    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     17   27    2  A  U N             T        Y   76         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     17   35    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     17   43    2  A  U N             T        Y   78         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     17   52    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   58    3  A  U N             T        Y   80         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     17   63    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   71    8  A  U N             T        Y   82         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL76    18    2   76  A  P N             T        Y   84         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     19    2    6  A  P H             T        Y              
ATSCLI3H DS    XL8                                                              
ATSCLI3  DS    CL6     19   10    6  A  U N             T        Y   90         
ATSCLI3X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     19   18    7  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     19   27    6  A  U N             T        Y   92         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19   35    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6     19   40    6  A  U N             T        Y   94         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    19   48   11  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL15    19   60   15  A  U N             T        Y   96         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL76    20    2   76  A  P N             T        Y   98         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     21    2    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     21   10    2  A  U N             T        Y  100         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     21   18    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     21   27    2  A  U N             T        Y  102         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    21   31   15  A  P N             T        Y  104         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     21   52    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    21   60   12  A  U N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     22    2    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   10    2  A  U N             T        Y  106         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     22   18    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   27    2  A  U N             T        Y  108         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     22   35    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   43    2  A  U N             T        Y  110         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4     22   52    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   58    3  A  U N             T        Y  112         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     22   63    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   71    8  A  U N             T        Y  114         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL76    23    2   76  A  P N             T        Y  116         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  255         
         DS    XL8                                                              
ATSLAST  DS    XL1                                                              
         DS    XL2    INDICS=I                                                  
ATSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2384 BYTES                            
