*          DATA SET ACBATE4D   AT LEVEL 026 AS OF 10/24/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BE4D      DATE 10/24/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      6    3    9  A  P N             T        Y              
CMBDATH  DS    CL8                                                              
CMBDAT   DS    CL8      6   18    8  A  U N             T    I   Y   11         
CMBDATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      6   44    8  A  P N             T        Y              
CMBDUEH  DS    CL8                                                              
CMBDUE   DS    CL9      6   56    9  A  U N             T        Y   12         
CMBDUEX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12     7    3   12  A  P N             T        Y              
CMBSYMH  DS    CL8                                                              
CMBSYM   DS    CL25     7   18   25  A  U N             T        Y   13         
CMBSYMX  DS    CL8                                                              
CMBSYMNH DS    CL8                                                              
CMBSYMN  DS    CL36     7   44   36  A  P N             T        Y   14         
CMBSYMNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      8    3    6  A  P N             T        Y              
CMBCLIH  DS    CL8                                                              
CMBCLI   DS    CL3      8   18    3  A  U N             T        Y   15         
CMBCLIX  DS    CL8                                                              
CMBCLINH DS    CL8                                                              
CMBCLIN  DS    CL36     8   44   36  A  P N             T        Y   16         
CMBCLINX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9    3    7  A  P N             T        Y              
CMBPROH  DS    CL8                                                              
CMBPRO   DS    CL3      9   18    3  A  U N             T        Y   17         
CMBPROX  DS    CL8                                                              
CMBPRONH DS    CL8                                                              
CMBPRON  DS    CL36     9   44   36  A  P N             T        Y   18         
CMBPRONX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10    3    7  A  P N             T        Y              
CMBESTH  DS    CL8                                                              
CMBEST   DS    CL6     10   18    6  A  U N             T        Y   19         
CMBESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     10   44    9  A  P N             T        Y              
CMBMTHH  DS    CL8                                                              
CMBMTH   DS    CL6     10   56    6  A  U N             T        Y   20         
CMBMTHX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    11    3   11  A  P N             T        Y              
CMBDSPH  DS    CL8                                                              
CMBDSP   DS    CL36    11   18   36  A  U N             T        Y   21         
CMBDSPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    12    3   11  A  P N             T        Y              
CMBBILH  DS    CL8                                                              
CMBBIL   DS    CL6     12   18    6  A  U N             T        Y   22         
CMBBILX  DS    CL8                                                              
CMBBASH  DS    CL8                                                              
CMBBAS   DS    CL9     12   44    9  A  P N             T        Y   41         
CMBBASX  DS    CL8                                                              
CMBAORH  DS    CL8                                                              
CMBAOR   DS    CL11    12   55   11  A  U N             T        Y   40         
CMBAORX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    13    3   11  A  P N             T        Y              
CMBAMTH  DS    CL8                                                              
CMBAMT   DS    CL11    13   18   11  A  U N             T        Y   23         
CMBAMTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    14    3   11  A  P N             T        Y              
CMBNETH  DS    CL8                                                              
CMBNET   DS    CL11    14   18   11  A  U N             T        Y   24         
CMBNETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    15    3   10  A  P N             T        Y              
CMBCOMH  DS    CL8                                                              
CMBCOM   DS    CL20    15   18   20  A  U N             T        Y   25         
CMBCOMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    15   44   14  A  P N             T        Y              
CMBSPLH  DS    CL8                                                              
CMBSPL   DS    CL11    15   60   11  A  U N             T        Y   26         
CMBSPLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    16    3   11  A  P N             T        Y              
CMBARH   DS    CL8                                                              
CMBAR    DS    CL14    16   18   14  A  U N             T        Y   29         
CMBARX   DS    CL8                                                              
CMBARNH  DS    CL8                                                              
CMBARN   DS    CL36    16   44   36  A  P N             T        Y   30         
CMBARNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    17    3   11  A  P N             T        Y              
CMBAPH   DS    CL8                                                              
CMBAP    DS    CL15    17   18   15  A  U N             T        Y   31         
CMBAPX   DS    CL8                                                              
CMBAPNH  DS    CL8                                                              
CMBAPN   DS    CL36    17   44   36  A  P N             T        Y   32         
CMBAPNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     18    3    6  A  P N             T        Y              
CMBOFFH  DS    CL8                                                              
CMBOFF   DS    CL2     18   18    2  A  U N             T        Y   27         
CMBOFFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    18   22   15  A  P N             T        Y              
CMBAOFH  DS    CL8                                                              
CMBAOF   DS    CL2     18   39    2  A  U N             T        Y   28         
CMBAOFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     18   44    4  A  P N             T        Y              
CMBDEPH  DS    CL8                                                              
CMBDEP   DS    CL3     18   50    3  A  U N             T        Y   38         
CMBDEPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     18   55    6  A  P N             T        Y              
CMBSTFH  DS    CL8                                                              
CMBSTF   DS    CL10    18   62   10  A  U N             T        Y   39         
CMBSTFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    19    3   14  A  P N             T        Y              
CMBBLSRH DS    CL8                                                              
CMBBLSR  DS    CL12    19   18   12  A  U N             T        Y   33         
CMBBLSRX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    19   44   13  A  P N             T        Y              
CMBCDH   DS    CL8                                                              
CMBCD    DS    CL11    19   60   11  A  U N             T        Y   34         
CMBCDX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    20    3   14  A  P N             T        Y              
CMBNUMH  DS    CL8                                                              
CMBNUM   DS    CL60    20   18   60  A  U N             T        Y   35         
CMBNUMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     21    3    9  A  P N             T        Y              
CMBNARH  DS    CL8                                                              
CMBNAR   DS    CL50    21   18   50  A  U N             T        Y   36         
CMBNARX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50    22   18   50  A  U N             T        Y   37         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     22   71    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  255         
         DS    CL8                                                              
CMBLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
CMBWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1600 BYTES                            
