*          DATA SET ACBATA5D   AT LEVEL 001 AS OF 05/02/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BA5D      DATE 05/02/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL13     7    2   13  L  P N             T        Y              
PICSUNH  DS    CL8                                                              
PICSUN   DS    CL36     7   18   36  A  U N        M    T    I   Y  128         
PICSUNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     8    2   14  L  P N             T        Y              
PICAD1H  DS    CL8                                                              
PICAD1   DS    CL26     8   18   26  A  U N             T        Y  129         
PICAD1X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     9    2   14  L  P N             T        Y              
PICAD2H  DS    CL8                                                              
PICAD2   DS    CL26     9   18   26  A  U N             T        Y  130         
PICAD2X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    10    2   14  L  P N             T        Y              
PICAD3H  DS    CL8                                                              
PICAD3   DS    CL26    10   18   26  A  U N             T        Y  131         
PICAD3X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    11    2   14  L  P N             T        Y              
PICAD4H  DS    CL8                                                              
PICAD4   DS    CL26    11   18   26  A  U N             T        Y  132         
PICAD4X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    12    2   14  L  P N             T        Y              
PICAD5H  DS    CL8                                                              
PICAD5   DS    CL26    12   18   26  A  U N             T        Y  132         
PICAD5X  DS    CL8                                                              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 400  BYTES                            
