*          DATA SET ACBATAFD   AT LEVEL 016 AS OF 06/28/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BAFD      DATE 06/28/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
BATFKEYH DS    XL8                                                              
BATFKEY  DS    CL20     5   23   20  A  P H             T        Y              
BATTKEYH DS    XL8                                                              
BATTKEY  DS    CL20     5   52   20  A  P H             T        Y              
BATRHD1H DS    XL8                                                              
BATRHD1  DS    CL20     6    2   20  L  P N             T        Y              
BATUIDH  DS    XL8                                                              
BATUID   DS    CL8      6   23    8  A  U N             T        Y    1         
BATUIDX  DS    XL8                                                              
BATUID2H DS    XL8                                                              
BATUID2  DS    CL8      6   52    8  A  U N             T        Y    2         
BATUID2X DS    XL8                                                              
BATRHD2H DS    XL8                                                              
BATRHD2  DS    CL20     7    2   20  L  P N             T        Y              
BATREFH  DS    XL8                                                              
BATREF   DS    CL4      7   23    4  A  U N             T        Y    3         
BATREFX  DS    XL8                                                              
BATREF2H DS    XL8                                                              
BATREF2  DS    CL4      7   52    4  A  U N             T        Y    4         
BATREF2X DS    XL8                                                              
BATRHD3H DS    XL8                                                              
BATRHD3  DS    CL20     8    2   20  L  P N             T        Y              
BATNAMH  DS    XL8                                                              
BATNAM   DS    CL15     8   23   15  A  U N             T        Y    5         
BATNAMX  DS    XL8                                                              
BATNAM2H DS    XL8                                                              
BATNAM2  DS    CL15     8   52   15  A  U N             T        Y    6         
BATNAM2X DS    XL8                                                              
BATRHD4H DS    XL8                                                              
BATRHD4  DS    CL20     9    2   20  L  P N             T        Y              
BATTYPH  DS    XL8                                                              
BATTYP   DS    CL19     9   23   19  A  U N             T        Y    7         
BATTYPX  DS    XL8                                                              
BATTYP2H DS    XL8                                                              
BATTYP2  DS    CL19     9   52   19  A  U N             T        Y   33         
BATTYP2X DS    XL8                                                              
BATRHD5H DS    XL8                                                              
BATRHD5  DS    CL20    10    2   20  L  P N             T        Y              
BATMOAH  DS    XL8                                                              
BATMOA   DS    CL6     10   23    6  A  U N             T        Y    8         
BATMOAX  DS    XL8                                                              
BATMOA2H DS    XL8                                                              
BATMOA2  DS    CL6     10   52    6  A  U N             T        Y    9         
BATMOA2X DS    XL8                                                              
BATRHD6H DS    XL8                                                              
BATRHD6  DS    CL20    11    2   20  L  P N             T        Y              
BATCRDH  DS    XL8                                                              
BATCRD   DS    CL8     11   23    8  A  U N             T        Y   10         
BATCRDX  DS    XL8                                                              
BATCRD2H DS    XL8                                                              
BATCRD2  DS    CL8     11   52    8  A  U N             T        Y   11         
BATCRD2X DS    XL8                                                              
BATRHD7H DS    XL8                                                              
BATRHD7  DS    CL20    12    2   20  L  P N             T        Y              
BATEFDH  DS    XL8                                                              
BATEFD   DS    CL17    12   23   17  A  U N             T        Y   12         
BATEFDX  DS    XL8                                                              
BATEFD2H DS    XL8                                                              
BATEFD2  DS    CL17    12   52   17  A  U N             T        Y   13         
BATEFD2X DS    XL8                                                              
BATRHD8H DS    XL8                                                              
BATRHD8  DS    CL20    13    2   20  L  P N             T        Y              
BATIUPH  DS    XL8                                                              
BATIUP   DS    CL4     13   23    4  A  U N             T        Y   14         
BATIUPX  DS    XL8                                                              
BATIUP2H DS    XL8                                                              
BATIUP2  DS    CL4     13   52    4  A  U N             T        Y   15         
BATIUP2X DS    XL8                                                              
BATRHD9H DS    XL8                                                              
BATRHD9  DS    CL20    14    2   20  L  P N             T        Y              
BATPERH  DS    XL8                                                              
BATPER   DS    CL8     14   23    8  A  U N             T        Y   16         
BATPERX  DS    XL8                                                              
BATPER2H DS    XL8                                                              
BATPER2  DS    CL8     14   52    8  A  U N             T        Y   17         
BATPER2X DS    XL8                                                              
BATRHDAH DS    XL8                                                              
BATRHDA  DS    CL20    15    2   20  L  P N             T        Y              
BATSTAH  DS    XL8                                                              
BATSTA   DS    CL20    15   23   20  A  U N             T        Y   18         
BATSTAX  DS    XL8                                                              
BATSTA2H DS    XL8                                                              
BATSTA2  DS    CL20    15   52   20  A  U N             T        Y   19         
BATSTA2X DS    XL8                                                              
BATRHDBH DS    XL8                                                              
BATRHDB  DS    CL20    16    2   20  L  P N             T        Y              
BATITCH  DS    XL8                                                              
BATITC   DS    CL5     16   23    5  A  U N             T        Y   20         
BATITCX  DS    XL8                                                              
BATITC2H DS    XL8                                                              
BATITC2  DS    CL5     16   52    5  A  U N             T        Y   21         
BATITC2X DS    XL8                                                              
BATRHDCH DS    XL8                                                              
BATRHDC  DS    CL20    17    2   20  L  P N             T        Y              
BATITAH  DS    XL8                                                              
BATITA   DS    CL5     17   23    5  A  U N             T        Y   22         
BATITAX  DS    XL8                                                              
BATITA2H DS    XL8                                                              
BATITA2  DS    CL5     17   52    5  A  U N             T        Y   23         
BATITA2X DS    XL8                                                              
BATRHDDH DS    XL8                                                              
BATRHDD  DS    CL20    18    2   20  L  P N             T        Y              
BATAMCH  DS    XL8                                                              
BATAMC   DS    CL13    18   23   13  A  U N             T        Y   24         
BATAMCX  DS    XL8                                                              
BATAMC2H DS    XL8                                                              
BATAMC2  DS    CL13    18   52   13  A  U N             T        Y   25         
BATAMC2X DS    XL8                                                              
BATRHDEH DS    XL8                                                              
BATRHDE  DS    CL20    19    2   20  L  P N             T        Y              
BATAMAH  DS    XL8                                                              
BATAMA   DS    CL28    19   23   28  A  U N             T        Y   26         
BATAMAX  DS    XL8                                                              
BATAMA2H DS    XL8                                                              
BATAMA2  DS    CL28    19   52   28  A  U N             T        Y   27         
BATAMA2X DS    XL8                                                              
BATRHDFH DS    XL8                                                              
BATRHDF  DS    CL20    20    2   20  L  P N             T        Y              
BATACRH  DS    XL8                                                              
BATACR   DS    CL16    20   23   16  A  U N             T        Y   28         
BATACRX  DS    XL8                                                              
BATACR2H DS    XL8                                                              
BATACR2  DS    CL16    20   52   16  A  U N             T        Y   29         
BATACR2X DS    XL8                                                              
BATRHDGH DS    XL8                                                              
BATRHDG  DS    CL20    21    2   20  L  P N             T        Y              
BATAPRH  DS    XL8                                                              
BATAPR   DS    CL8     21   23    8  A  U N             T        Y   30         
BATAPRX  DS    XL8                                                              
BATAPR2H DS    XL8                                                              
BATAPR2  DS    CL8     21   52    8  A  U N             T        Y   31         
BATAPR2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    22    2   20  L  P N             T        Y              
BATCOM1H DS    XL8                                                              
BATCOM1  DS    CL57    22   23   57  L  U N             T        Y   32         
BATCOM1X DS    XL8                                                              
BATCOM2H DS    XL8                                                              
BATCOM2  DS    CL57    23   23   57  L  U N             T        Y   32         
BATCOM2X DS    XL8                                                              
BATPFKH  DS    XL8                                                              
BATPFK   DS    CL78    24    2   78  A  P N             T        Y  255         
BATPFKX  DS    XL8                                                              
         DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1656 BYTES                            
