*          DATA SET ACBATF2D   AT LEVEL 004 AS OF 11/10/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BF2D      DATE 11/10/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
UNTCLIH  DS    CL8                                                              
UNTCLI   DS    CL3      6   16    3  A  U N             T    I   Y   11         
UNTCLIX  DS    CL8                                                              
UNTCLINH DS    CL8                                                              
UNTCLIN  DS    CL36     6   27   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
UNTPROH  DS    CL8                                                              
UNTPRO   DS    CL3      7   16    3  A  U N             T        Y   12         
UNTPROX  DS    CL8                                                              
UNTPRONH DS    CL8                                                              
UNTPRON  DS    CL36     7   27   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A  P H             T        Y              
UNTJOBH  DS    CL8                                                              
UNTJOB   DS    CL6      8   16    6  A  U N             T        Y   13         
UNTJOBX  DS    CL8                                                              
UNTJOBNH DS    CL8                                                              
UNTJOBN  DS    CL36     8   27   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      9    2    4  A  P H             T        Y              
UNTDATH  DS    CL8                                                              
UNTDAT   DS    CL8      9   16    8  A  U N             T        Y   14         
UNTDATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      9   27    9  A  P H             T        Y              
UNTREFH  DS    CL8                                                              
UNTREF   DS    CL6      9   37    6  A  U N             T        Y   15         
UNTREFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     9   46   10  A  P H             T        Y              
UNTCOMH  DS    CL8                                                              
UNTCOM   DS    CL1      9   58    1  A  U N             T        Y   16         
UNTCOMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     10    2    8  A  P H             T        Y              
UNTCATH  DS    CL8                                                              
UNTCAT   DS    CL2     10   16    2  A  U N             T        Y   17         
UNTCATX  DS    CL8                                                              
UNTCATNH DS    CL8                                                              
UNTCATN  DS    CL36    10   27   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     11    2    9  A  P H             T        Y              
UNTNAR1H DS    CL8                                                              
UNTNAR1  DS    CL49    11   16   49  A  U N             T        Y   18         
UNTNAR1X DS    CL8                                                              
UNTNAR2H DS    CL8                                                              
UNTNAR2  DS    CL49    12   16   49  A  U N             T        Y   19         
UNTNAR2X DS    CL8                                                              
UNTTABH  DS    CL8                                                              
UNTTAB   DS    CL1     12   78    1  A  P N             T        Y              
UNTTITH  DS    CL8                                                              
UNTTIT   DS    CL5     13    2    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL3     13    9    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     13   14    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL15    13   18   15  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     13   35    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL10    13   39   10  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL12    13   52   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL15    13   65   15  A  P H             T        Y              
UNTUNTH  DS    CL8                                                              
UNTUNT   DS    CL6     14    2    6  A  U N             T        Y   20         
UNTUNTX  DS    CL8                                                              
UNTLVLH  DS    CL8                                                              
UNTLVL   DS    CL1     14   10    1  A  U N             T        Y   21         
UNTLVLX  DS    CL8                                                              
UNTWRKH  DS    CL8                                                              
UNTWRK   DS    CL2     14   14    2  A  U N             T        Y   22         
UNTWRKX  DS    CL8                                                              
UNTWRKDH DS    CL8                                                              
UNTWRKD  DS    CL15    14   18   15  A  P N             T        Y              
UNTTAXH  DS    CL8                                                              
UNTTAX   DS    CL2     14   35    2  A  U N             T        Y   23         
UNTTAXX  DS    CL8                                                              
UNTPRCH  DS    CL8                                                              
UNTPRC   DS    CL10    14   39   10  A  U N             T        Y   24         
UNTPRCX  DS    CL8                                                              
UNTTOTH  DS    CL8                                                              
UNTTOT   DS    CL12    14   52   12  A  P N             T        Y   25         
UNTTOTX  DS    CL8                                                              
UNTINCH  DS    CL8                                                              
UNTINC   DS    CL15    14   65   15  A  U N             T        Y   26         
UNTINCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     15    2    6  A  U N             T        Y   27         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15   10    1  A  U N             T        Y   28         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     15   14    2  A  U N             T        Y   29         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    15   18   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   35    2  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    15   39   10  A  U N             T        Y   31         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    15   52   12  A  P N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    15   65   15  A  U N             T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     16    2    6  A  U N             T        Y   34         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   10    1  A  U N             T        Y   35         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     16   14    2  A  U N             T        Y   36         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    16   18   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   35    2  A  U N             T        Y   37         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    16   39   10  A  U N             T        Y   38         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    16   52   12  A  P N             T        Y   39         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    16   65   15  A  U N             T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     17    2    6  A  U N             T        Y   41         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   10    1  A  U N             T        Y   42         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     17   14    2  A  U N             T        Y   43         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    17   18   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   35    2  A  U N             T        Y   44         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    17   39   10  A  U N             T        Y   45         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    17   52   12  A  P N             T        Y   46         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    17   65   15  A  U N             T        Y   47         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     18    2    6  A  U N             T        Y   48         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18   10    1  A  U N             T        Y   49         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     18   14    2  A  U N             T        Y   50         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    18   18   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   35    2  A  U N             T        Y   51         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    18   39   10  A  U N             T        Y   52         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    18   52   12  A  P N             T        Y   53         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    18   65   15  A  U N             T        Y   54         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     19    2    6  A  U N             T        Y   55         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   10    1  A  U N             T        Y   56         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     19   14    2  A  U N             T        Y   57         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    19   18   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   35    2  A  U N             T        Y   58         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    19   39   10  A  U N             T        Y   59         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    19   52   12  A  P N             T        Y   60         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    19   65   15  A  U N             T        Y   61         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     20    2    6  A  U N             T        Y   62         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20   10    1  A  U N             T        Y   63         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     20   14    2  A  U N             T        Y   64         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    20   18   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   35    2  A  U N             T        Y   65         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    20   39   10  A  U N             T        Y   66         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    20   52   12  A  P N             T        Y   67         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    20   65   15  A  U N             T        Y   68         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     21    2    6  A  U N             T        Y   69         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21   10    1  A  U N             T        Y   70         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     21   14    2  A  U N             T        Y   71         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    21   18   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   35    2  A  U N             T        Y   72         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    21   39   10  A  U N             T        Y   73         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    21   52   12  A  P N             T        Y   74         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    21   65   15  A  U N             T        Y   75         
         DS    CL8                                                              
UNTENDH  DS    CL8                                                              
UNTEND   DS    CL6     22    2    6  A  U N             T        Y   76         
UNTENDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     22   10    1  A  U N             T        Y   77         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     22   14    2  A  U N             T        Y   78         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    22   18   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   35    2  A  U N             T        Y   79         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    22   39   10  A  U N             T        Y   80         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    22   52   12  A  P N             T        Y   81         
         DS    CL8                                                              
UNTLSTH  DS    CL8                                                              
UNTLST   DS    CL15    22   65   15  A  U N             T        Y   82         
UNTLSTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     23    2    8  A  P H             T        Y              
UNTUPDH  DS    CL8                                                              
UNTUPD   DS    CL1     23   12    1  A  U N             T        Y   83         
UNTUPDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  255         
         DS    CL8                                                              
UNTLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
UNTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2488 BYTES                            
