*          DATA SET ACBATBCD   AT LEVEL 011 AS OF 05/07/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61BBCD      DATE 05/07/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
DETVNDTH DS    CL8                                                              
DETVNDT  DS    CL13     7    3   13  L  P N             T        Y              
DETVNDH  DS    CL8                                                              
DETVND   DS    CL15     7   17   15  A  P H             T        Y   11         
DETVNDX  DS    CL8                                                              
DETVNDNH DS    CL8                                                              
DETVNDN  DS    CL25     7   33   25  L  P H             T        Y   12         
DETVNDNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   59    7  L  P N             T        Y              
DETVNDAH DS    CL8                                                              
DETVNDA  DS    CL12     7   68   12  L  U N             T        Y   13         
DETVNDAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13     8    3   13  L  P N             T        Y              
DETXACTH DS    CL8                                                              
DETXACT  DS    CL15     8   17   15  A  P H             T        Y   22         
DETXACTX DS    CL8                                                              
DETXATNH DS    CL8                                                              
DETXATN  DS    CL25     8   33   25  L  P H             T        Y   23         
DETXATNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      8   59    9  L  P N             T        Y              
DETMEMDH DS    CL8                                                              
DETMEMD  DS    CL8      8   72    8  L  U N             T    I   Y   24         
DETMEMDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13     9    3   13  L  P N             T        Y              
DETINRFH DS    CL8                                                              
DETINRF  DS    CL21     9   17   21  L  P H             T        Y   17         
DETINRFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      9   41    5  L  P N             T        Y              
DETDATEH DS    CL8                                                              
DETDATE  DS    CL8      9   48    8  L  P H             T        Y   18         
DETDATEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12     9   59   12  L  P N             T        Y              
DETDUEDH DS    CL8                                                              
DETDUED  DS    CL8      9   72    8  L  P H             T        Y   19         
DETDUEDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    10    3   13  L  P N             T        Y              
DETMEMBH DS    CL8                                                              
DETMEMB  DS    CL6     10   17    6  L  P H             T        Y   50         
DETMEMBX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     10   41    5  L  P N             T        Y              
DETORDNH DS    CL8                                                              
DETORDN  DS    CL8     10   48    8  A  P H             T        Y   51         
DETORDNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    10   59   12  L  P N             T        Y              
DETLOCLH DS    CL8                                                              
DETLOCL  DS    CL8     10   72    8  A  U H             T        Y   52         
DETLOCLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    11    2   78  A  P N             T        Y              
DETTTL1H DS    CL8                                                              
DETTTL1  DS    CL78    12    2   78  L  P N             T        Y              
DETTTL2H DS    CL8                                                              
DETTTL2  DS    CL78    13    2   78  A  P N             T        Y              
DETCTRH  DS    CL8                                                              
DETCTR   DS    CL8     14    2    8  A  P N             T        Y  130         
DETCTRX  DS    CL8                                                              
DETQTYH  DS    CL8                                                              
DETQTY   DS    CL5     14   11    5  A  U N             T        Y  131         
DETQTYX  DS    CL8                                                              
DETSTKNH DS    CL8                                                              
DETSTKN  DS    CL8     14   17    8  A  P N             T        Y  132         
DETSTKNX DS    CL8                                                              
DETUPRCH DS    CL8                                                              
DETUPRC  DS    CL12    14   26   12  A  P N             T        Y  133         
DETUPRCX DS    CL8                                                              
DETURETH DS    CL8                                                              
DETURET  DS    CL12    14   39   12  A  P N             T        Y  134         
DETURETX DS    CL8                                                              
DETTAXH  DS    CL8                                                              
DETTAX   DS    CL8     14   52    8  A  U N             T        Y  135         
DETTAXX  DS    CL8                                                              
DETRATH  DS    CL8                                                              
DETRAT   DS    CL6     14   61    6  A  P N             T        Y  136         
DETRATX  DS    CL8                                                              
DETCALH  DS    CL8                                                              
DETCAL   DS    CL12    14   68   12  A  P N             T        Y  137         
DETCALX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     15    2    8  A  P N             T        Y  130         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     15   11    5  A  U N             T        Y  131         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     15   17    8  A  P N             T        Y  132         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    15   26   12  A  P N             T        Y  133         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    15   39   12  A  P N             T        Y  134         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     15   52    8  A  U N             T        Y  135         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     15   61    6  A  P N             T        Y  136         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    15   68   12  A  P N             T        Y  137         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     16    2    8  A  P N             T        Y  130         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     16   11    5  A  U N             T        Y  131         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     16   17    8  A  P N             T        Y  132         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    16   26   12  A  P N             T        Y  133         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    16   39   12  A  P N             T        Y  134         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     16   52    8  A  U N             T        Y  135         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     16   61    6  A  P N             T        Y  136         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    16   68   12  A  P N             T        Y  137         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     17    2    8  A  P N             T        Y  130         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     17   11    5  A  U N             T        Y  131         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     17   17    8  A  P N             T        Y  132         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    17   26   12  A  P N             T        Y  133         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    17   39   12  A  P N             T        Y  134         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     17   52    8  A  U N             T        Y  135         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     17   61    6  A  P N             T        Y  136         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    17   68   12  A  P N             T        Y  137         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     18    2    8  A  P N             T        Y  130         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     18   11    5  A  U N             T        Y  131         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     18   17    8  A  P N             T        Y  132         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    18   26   12  A  P N             T        Y  133         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    18   39   12  A  P N             T        Y  134         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     18   52    8  A  U N             T        Y  135         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     18   61    6  A  P N             T        Y  136         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    18   68   12  A  P N             T        Y  137         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     19    2    8  A  P N             T        Y  130         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     19   11    5  A  U N             T        Y  131         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     19   17    8  A  P N             T        Y  132         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    19   26   12  A  P N             T        Y  133         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    19   39   12  A  P N             T        Y  134         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     19   52    8  A  U N             T        Y  135         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     19   61    6  A  P N             T        Y  136         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    19   68   12  A  P N             T        Y  137         
         DS    CL8                                                              
DETTABH  DS    CL8                                                              
DETTAB   DS    CL1     20    1    1  A  P N             T        Y              
DETTTL3H DS    CL8                                                              
DETTTL3  DS    CL54    20   26   54  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    21    3   14  L  P N             T        Y              
DETTOTUH DS    CL8                                                              
DETTOTU  DS    CL12    21   26   12  A  P N             T        Y              
DETTOTRH DS    CL8                                                              
DETTOTR  DS    CL12    21   39   12  A  P N             T        Y              
DETTOTTH DS    CL8                                                              
DETTOTT  DS    CL8     21   52    8  A  P N             T        Y              
DETTOTCH DS    CL8                                                              
DETTOTC  DS    CL12    21   68   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    22    3   14  L  P N             T        Y              
DETDIFFH DS    CL8                                                              
DETDIFF  DS    CL12    22   26   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  255         
         DS    CL8                                                              
DETLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
DETWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2296 BYTES                            
