*          DATA SET ACBILFFD   AT LEVEL 004 AS OF 10/20/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60EFFD      DATE 10/20/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
BILMSGH  DS    CL8                                                              
BILMSG   DS    CL60     1    2   60  L  P N             T        Y              
BILSRVH  DS    CL8                                                              
BILSRV   DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      3    2    6  L  P H             T        Y              
BILACTH  DS    CL8                                                              
BILACT   DS    CL60     3   14   60  A  U N        M    T    I   Y   10         
BILACTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     4    2   11  L  P H             T        Y              
BILNUMH  DS    CL8                                                              
BILNUM   DS    CL7      4   14    7  A  U N             T        Y   20         
BILNUMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      4   23    9  L  P H             T        Y              
BILPARAH DS    CL8                                                              
BILPARA  DS    CL3      4   34    3  A  U N             T        Y   30         
BILPARAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5    2    6  L  P H             T        Y              
BILCLIH  DS    CL8                                                              
BILCLI   DS    CL6      5   14    6  A  U N             T        Y   40         
BILCLIX  DS    CL8                                                              
BILCLINH DS    CL8                                                              
BILCLIN  DS    CL36     5   23   36  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  L  P H             T        Y              
BILPROH  DS    CL8                                                              
BILPRO   DS    CL6      6   14    6  A  U N             T        Y   50         
BILPROX  DS    CL8                                                              
BILPRONH DS    CL8                                                              
BILPRON  DS    CL36     6   23   36  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  L  P H             T        Y              
BILJOBH  DS    CL8                                                              
BILJOB   DS    CL6      7   14    6  A  U N             T        Y   60         
BILJOBX  DS    CL8                                                              
BILJOBNH DS    CL8                                                              
BILJOBN  DS    CL36     7   23   36  L  P N             T        Y              
BILTABH  DS    CL8                                                              
BILTAB   DS    CL1      7   74    1  A  U N             T        Y              
BILLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
BILWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 512  BYTES                            
