*          DATA SET ACBILFBD   AT LEVEL 004 AS OF 10/20/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60EFBD      DATE 10/20/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
LISTABH  DS    CL8                                                              
LISTAB   DS    CL1      8   74    1  A  U N             T        Y              
LISHEDH  DS    CL8                                                              
LISHED   DS    CL79     9    2   79  L  P H             T        Y              
LISHED2H DS    CL8                                                              
LISHED2  DS    CL79    10    2   79  L  P H             T        Y              
LISFRSTH DS    CL8                                                              
LISFRST  DS    CL78    11    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    12    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    13    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    14    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    15    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    22    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  A  P N             T        Y              
LISFINLH DS    CL8                                                              
LISFINL  DS    CL78    24    2   78  A  P N             T        Y              
LISLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LISWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1392 BYTES                            
