*          DATA SET ACBILFDD   AT LEVEL 005 AS OF 10/20/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60EFDD      DATE 10/20/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      9    2    9  L  P H             T        Y              
BLPWRKH  DS    CL8                                                              
BLPWRK   DS    CL60     9   14   60  A  U N             T        Y   10         
BLPWRKX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    10    2   11  L  P H             T        Y              
BLPDSCH  DS    CL8                                                              
BLPDSC   DS    CL36    10   14   36  L  U N             T        Y   20         
BLPDSCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     11    2    4  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     11    7    1  A  P H             T        Y              
BLPFRSTH DS    CL8                                                              
BLPFRST  DS    CL70    11   10   70  L  U N             T        N   30         
BLPFRSTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     12    7    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    12   10   70  L  U N             T        N   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13    7    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    13   10   70  L  U N             T        N   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     14    7    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    14   10   70  L  U N             T        N   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15    7    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    15   10   70  L  U N             T        N   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16    7    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    16   10   70  L  U N             T        N   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17    7    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    17   10   70  L  U N             T        N   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18    7    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    18   10   70  L  U N             T        N   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19    7    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL70    19   10   70  L  U N             T        N   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     20    6    2  A  P H             T        Y              
BLPFINLH DS    CL8                                                              
BLPFINL  DS    CL70    20   10   70  L  U N             T        N   30         
BLPFINLX DS    CL8                                                              
BLPTITLH DS    CL8                                                              
BLPTITL  DS    CL79    21    2   79  L  P N             T        Y              
BLPPARTH DS    CL8                                                              
BLPPART  DS    CL79    22    2   79  L  P N             T        Y              
BLPBILTH DS    CL8                                                              
BLPBILT  DS    CL79    23    2   79  L  P N             T        Y              
BLPJOBTH DS    CL8                                                              
BLPJOBT  DS    CL79    24    2   79  L  P N             T        Y              
BLPLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
BLPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1480 BYTES                            
