*          DATA SET ACBILFAD   AT LEVEL 005 AS OF 10/20/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60EFAD      DATE 10/20/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
ALCHEDH  DS    CL8                                                              
ALCHED   DS    CL65     9    2   65  L  P H             T        Y              
ALCHED2H DS    CL8                                                              
ALCHED2  DS    CL65    10    2   65  L  P H             T        Y              
ALCHEDAH DS    CL8                                                              
ALCHEDA  DS    CL11    10   68   11  L  P H             T        Y              
ALCFRSTH DS    CL8                                                              
ALCFRST  DS    CL64    11    3   64  L  P N             T        Y              
ALCMARKH DS    CL8                                                              
ALCMARK  DS    CL11    11   68   11  A  U N             T        Y   10         
ALCMARKX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL64    12    3   64  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   68   11  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL64    13    3   64  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   68   11  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL64    14    3   64  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   68   11  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL64    15    3   64  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   68   11  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL64    16    3   64  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   68   11  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL64    17    3   64  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   68   11  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL64    18    3   64  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   68   11  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL64    19    3   64  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   68   11  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL64    20    3   64  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   68   11  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL64    21    3   64  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   68   11  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL64    22    3   64  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   68   11  A  U N             T        Y   10         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL64    23    3   64  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    23   68   11  A  U N             T        Y   10         
         DS    CL8                                                              
ALCTABH  DS    CL8                                                              
ALCTAB   DS    CL1     23   80    1  A  U N             T        Y              
ALCTOTH  DS    CL8                                                              
ALCTOT   DS    CL77    24    3   77  L  P H             T        Y              
ALCLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
ALCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1552 BYTES                            
