*          DATA SET ACBILF8D   AT LEVEL 006 AS OF 10/20/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60EF8D      DATE 10/20/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      9    2    4  L  P H             T        Y              
WONDATEH DS    CL8                                                              
WONDATE  DS    CL8      9   14    8  A  U N        M    T        Y              
WONHED1H DS    CL8                                                              
WONHED1  DS    CL10     9   23   10  L  P H             T        Y              
WONAMT1H DS    CL8                                                              
WONAMT1  DS    CL13     9   35   13  A  P N             T        Y              
WONHED2H DS    CL8                                                              
WONHED2  DS    CL10     9   49   10  L  P H             T        Y              
WONAMT2H DS    CL8                                                              
WONAMT2  DS    CL13     9   61   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     11    2    9  L  P H             T        Y              
WONLIN1H DS    CL8                                                              
WONLIN1  DS    CL55    11   14   55  A  U N             T        Y              
WONLIN2H DS    CL8                                                              
WONLIN2  DS    CL55    12   14   55  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    14    2   14  L  P H             T        Y              
WONSBT1H DS    CL8                                                              
WONSBT1  DS    CL13    14   21   13  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL14    14   42   14  L  P H             T        Y              
WONSBT2H DS    CL8                                                              
WONSBT2  DS    CL13    14   61   13  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL32    15    2   32  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL32    15   42   32  A  P H             T        Y              
WONFRSTH DS    CL8                                                              
WONFRST  DS    CL15    16    2   15  L  P N             T        Y              
WONAMTFH DS    CL8                                                              
WONAMTF  DS    CL13    16   21   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    16   42   15  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    16   61   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    17    2   15  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    17   21   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    17   42   15  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    17   61   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    18    2   15  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    18   21   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    18   42   15  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    18   61   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    19    2   15  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    19   21   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    19   42   15  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    19   61   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    20    2   15  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    20   21   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    20   42   15  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    20   61   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    21    2   15  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    21   21   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    21   42   15  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    21   61   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    22    2   15  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    22   21   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    22   42   15  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    22   61   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    23    2   15  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    23   21   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    23   42   15  L  P N             T        Y              
WONTABH  DS    CL8                                                              
WONTAB   DS    CL13    23   61   13  A  P N             T        Y              
WONLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
WONWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1128 BYTES                            
