*          DATA SET ACBMONVALD AT LEVEL 003 AS OF 05/04/98                      
BMONVALD DSECT                                                                  
BMOMSG   DS    XL2                 MESSAGE NUMBER OR ZERO                       
BMOERR   DS    XL1                 ERROR INDICATORS                             
BMOEOKQ  EQU   0                   NO ERROR                                     
BMOEINVQ EQU   X'80'               DATE INVALID                                 
BMOELOKQ EQU   X'40'               MOS LOCKED                                   
BMOERNGQ EQU   X'20'               DATE OUT OF RANGE                            
BMOMOSP  DS    PL2                 PWOS X'YYMM'                                 
BMOMOSC  DS    CL2                 CHARACTER YEAR AND MONTH                     
BMOLCKP  DS    PL2                 LAST LOCKED MOS                              
BMONVALQ EQU   *-BMONVALD                                                       
