*          DATA SET ACBRAWRKD  AT LEVEL 039 AS OF 08/19/20                      
***********************************************************************         
* GLOBAL WORKING STORAGE                                              *         
*                                                                     *         
***********************************************************************         
                                                                                
***********************************************************************         
* MISCELLANEOUS EQUATES                                               *         
***********************************************************************         
                                                                                
FF       EQU   X'FF'                                                            
FE       EQU   X'FE'                                                            
YESQ     EQU   C'Y'                                                             
NOQ      EQU   C'N'                                                             
ONEK     EQU   1024                                                             
EUROQ    EQU   C'þ'                                                             
EOF      EQU   FF                                                               
                                                                                
BMQ      EQU   X'40'               MIXED      /  MINUS                          
BZQ      EQU   X'80'               ZEROES     /  ZERO                           
BEQ      EQU   X'80'               EQUAL                                        
BNEQ     EQU   X'70'               NOT EQUAL                                    
BNLQ     EQU   X'B0'               NOT LOW                                      
BNHQ     EQU   X'D0'               NOT HIGH                                     
BHQ      EQU   X'20'               HIGH                                         
BNPQ     EQU   X'D0'               NOT PLUS                                     
BNOQ     EQU   X'E0'               NOT ONES   /  NOT OVERFLOW                   
BNMQ     EQU   X'B0'               NOT MIXED  /  NOT MINUS                      
BNZQ     EQU   X'70'               NOT ZEROES /  NOT ZERO                       
                                                                                
SKLDGQ   EQU   C'K'                                                             
SILDGQ   EQU   C'I'                                                             
STLDGQ   EQU   C'T'                                                             
                                                                                
O#ROU1   EQU   X'01'               ACBRA ROUTINES 1                             
O#ROU2   EQU   X'02'               ACBRA ROUTINES 2                             
O#SRVR10 EQU   X'10'               ESTIMATE ELECTR. SIGN. UPLOAD SERVER         
O#SRVR11 EQU   X'11'               ACBRA GENERAL DOWNLOAD SERVER                
O#SRVR12 EQU   X'12'               ACBRA TIME DOWNLOAD SERVER                   
O#SRVR13 EQU   X'13'               ACBRA EBUYER UPLOAD SERVER                   
O#SRVR14 EQU   X'14'               HISTORY/SALARY UPLOAD (WAS TIME)             
O#SRVR15 EQU   X'15'               ACBRA EXPENSES DOWNLOAD SERVER               
O#SRVR16 EQU   X'16'               ACBRA EXPENSES UPLOAD SERVER                 
O#SRVR17 EQU   X'17'               ACBRA ESTIMATES DOWNLOAD SERVER              
O#SRVR18 EQU   X'18'               ACBRA ESTIMATES UPLOAD SERVER                
O#SRVR19 EQU   X'19'               ACBRA JOBS DOWNLOAD SERVER                   
O#SRVR1A EQU   X'1A'               ACBRA SALARY POSTING UPLOAD OVERLAY          
O#SRVR1B EQU   X'1B'               ACBRA RUNNER UPLOAD                          
O#SRVR1C EQU   X'1C'               ACBRA FILE UPLOADS AVAILABLE D/LOAD          
O#SRVR1D EQU   X'1D'               ACBRA ESTIMATE COMBINED D/LOAD               
O#SRVR1E EQU   X'1E'               ACBRA ARTIST AGENT UPLOAD                    
O#SRVR1F EQU   X'1F'               ACBRA INTERMEDIATE ORDER DOWNLOADS           
O#SRVR20 EQU   X'20'               ACBRA GENERAL DOWNLOAD SERVER 2              
O#SRVR21 EQU   X'21'               ACBRA GENERAL & JOBS UPLOAD SERVER           
O#SRVR22 EQU   X'22'               ACBRA INVOICE APPR DOWNLOAD SERVER           
O#SRVR23 EQU   X'23'               ACBRA INVOICE APPR UPLOAD SERVER             
O#SRVR24 EQU   X'24'               ACBRA RESOURCES DOWNLOAD SERVER              
O#SRVR25 EQU   X'25'               ACBRA RESOURCES UPLOAD SERVER                
O#SRVR26 EQU   X'26'               ACBRA NEW STYLE MAINT D/L SERVER             
O#SRVR27 EQU   X'27'               ACBRA NEW STYLE TIME D/L SERVER              
O#SRVR28 EQU   X'28'               ACBRA NEW STYLE MAINT D/L SERVER             
O#SRVR29 EQU   X'29'               ACBRA ACCOUNT UPLOAD SERVER                  
O#SRVR2A EQU   X'2A'               ACBRA PERSON UPLOAD SERVER                   
O#SRVR2B EQU   X'2B'               ACBRA WORKER FILE UPLOAD SERVER              
O#SRVR2C EQU   X'2C'               ACBRA FILE MAINT UPLOAD SERVER               
O#SRVR2D EQU   X'2D'               ACBRA JOB/WC/ITEM/JOB AUDIT DOWNLOAD         
O#SRVR2E EQU   X'2E'               ACBRA AURA ORDER LIST/SEARCH SERVER          
O#SRVR2F EQU   X'2F'               ACBRA AURA ORDER ELEC SIG UPLOAD SVR         
O#SRVR30 EQU   X'30'               ACBRA ACCOUNT TRANS D/L SVR                  
                                                                                
***********************************************************************         
* SYSTEM/PROGRAM/RECORD/ACTION/OPTION/FIELD EQUATES                   *         
***********************************************************************         
                                                                                
ACCSYSQ  EQU   X'06'               SYSTEM   -  ACCOUNT                          
MEDSYSQ  EQU   X'04'                        -  MEDIA                            
CTLSYSQ  EQU   X'0A'                        -  CONTROL                          
                                                                                
BRAPRGQ  EQU   X'24'               PROGRAM  -  ACC/BRA                          
*&&UK                                                                           
BRAUPLQ  EQU   X'F1'                        -  ACC/UPLOAD                       
*&&                                                                             
BRATIMQ  EQU   X'FA'                        -  ACC/TIME                         
                                                                                
SYSPHASE EQU   X'0624'             SYSPHASE -  ACCOUNT                          
                                                                                
                                                                                
** SECRET EQUATES                                                               
                                                                                
RECHIST  EQU   01                  RECORD   -  BRO HISTORY UPLOAD               
RECACCT  EQU   02                  RECORD   -  BRO ACC UPLOAD                   
RECPOST  EQU   03                  RECORD   -  BRO POSTING UPLD                 
RECRATS  EQU   04                  RECORD   -  BRO TMS RATES UPLOAD             
                                                                                
USEUPLD  EQU   01                  ACTION   -  IN USE                           
B69UPLD  EQU   02                           -  BT69                             
B30UPLD  EQU   03                           -  BT30                             
B36UPLD  EQU   04                           -  BT36                             
ALKUPLD  EQU   05                           -  ACOUNT LOCK                      
                                                                                
                                                                                
** TIME STATUS EQUATES                                                          
                                                                                
TS#AWAIT EQU   C'1'                AWAITING APPROVAL                            
TS#NSTRT EQU   C'2'                NOT STARTED                                  
TS#OVERD EQU   C'3'                OVERDUE                                      
TS#PROGR EQU   C'4'                IN PROGRESS                                  
TS#SUBMT EQU   C'5'                SUBMITTED                                    
TS#APPRO EQU   C'6'                APPROVED                                     
TS#REJEC EQU   C'7'                REJECTED                                     
TS#PAAPR EQU   C'8'                PART APPROVED                                
TS#AWBAP EQU   C'9'                AWAITING APPROVAL - BACK UP APPROVER         
                                                                                
** ORDER TYPE EQUATES                                                           
                                                                                
PROOQ    EQU   ALIKPROD                                                         
EXPOQ    EQU   ALIKEXP                                                          
INTOQ    EQU   ALIKINT                                                          
ARTOQ    EQU   ALIKART                                                          
                                                                                
                                                                                
** APPLICATION EQUATES                                                          
                                                                                
QINV     EQU   C'I'                Invoices                                     
QORD     EQU   C'O'                Orders                                       
QJOB     EQU   C'J'                Jobs                                         
QJOBDSH  EQU   C'D'                Jobs dashboard                               
QTIME    EQU   C'T'                Time                                         
QEST     EQU   C'E'                Estimates                                    
QESTJBL  EQU   C'B'                Estimates FOR JOB LIST                       
QEXPCLM  EQU   C'X'                Expenses                                     
QREPORTS EQU   C'R'                Reports                                      
QRESRCES EQU   C'S'                Resources                                    
QTIMOFF  EQU   C'M'                Timeoff                                      
                                                                                
***********************************************************************         
* EQUATES FOR DDLINK BLOCK USAGE AND CORRESPONDING IOAREAS            *         
***********************************************************************         
                                                                                
B#WORKD  EQU   1                   WORKD LP_BLK#                                
B#SAVED  EQU   2                   SAVED LP_BLK#                                
B#TWAD   EQU   15                  BLOCK NUMBER FOR TWAD                        
                                                                                
***********************************************************************         
* WORKING STORAGE                                                     *         
***********************************************************************         
                                                                                
WORKD    DSECT                                                                  
                                                                                
*** STORAGE USED FOR GENERAL PURPOSES                                           
                                                                                
DUB      DS    D                                                                
DUB1     DS    D                                                                
DUB2     DS    D                                                                
FULL1    DS    F                                                                
FULL2    DS    F                                                                
HALF1    DS    H                                                                
HALF2    DS    H                                                                
BYTE1    DS    XL1                                                              
BYTE2    DS    XL1                                                              
BYTE3    DS    XL1                                                              
BYTE4    DS    XL1                                                              
                                                                                
DMCB     DS    6F                                                               
PARM     DS    6F                                                               
                                                                                
SAVERE   DS    A                                                                
ELEMENT  DS    XL256                                                            
*&&US                                                                           
         ORG   ELEMENT                                                          
CATBLK   DS    XL64                BLOCK RETURN BY CATCALL                      
         ORG                                                                    
*&&                                                                             
                                                                                
TWAMODE  DS    XL1                 GENERAL MODE                                 
TWAMUWD  EQU   X'80'               UNWIND/ABEND                                 
TWAMPER  EQU   X'40'               PREVIOUS ERROR IN REQUEST                    
TWAMEMQ  EQU   X'20'               ERROR UNDER MQ                               
TWAMMEM  EQU   X'10'               USE MULTIPLE ERROR RETURN MODULE             
TWAMEDP  EQU   X'08'               ERROR - DON'T PROCEED                        
TWAMERP  EQU   X'01'               ERROR - PROCEED                              
                                                                                
BASERD   DS    A                                                                
BASEADDR DS    A                                                                
BASERELO DS    A                                                                
ROU1RELO DS    A                                                                
ROU2RELO DS    A                                                                
SRVRRELO DS    A                                                                
                                                                                
AFAPARM  DS    A                                                                
ATIOB    DS    A                                                                
ATWA     DS    A                                                                
ATIA     DS    A                                                                
ALP      DS    A                                                                
AXLATES  DS    A                                                                
         DS    A                                                                
                                                                                
FACLISTS DS    0A                  ** FACILITIES LISTS **                       
ACOMFACS DS    A                   A(COMMON FACILITES LIST)                     
AACCFACS DS    A                   A(ACC FACILITES LIST)                        
         DS    2A                                                               
                                                                                
AIOS     DS    0A                  ** ADDRESSES OF I/O AREAS **                 
AIO1     DS    A                                                                
AIO2     DS    A                                                                
AIO3     DS    A                                                                
AIO4     DS    A                                                                
AIO5     DS    A                                                                
AIO6     DS    A                                                                
AIO7     DS    A                                                                
AIO8     DS    A                                                                
AIONM    EQU   (*-AIO1)/L'AIO1                                                  
                                                                                
AOFFAREA DS    A                                                                
AGENAREA DS    0A                                                               
AELEAREA DS    A                                                                
AGOBLOCK DS    A                                                                
AJOBLOCK DS    A                                                                
ACOLIST  DS    A                                                                
AELEPTRR DS    A                                                                
ACOLTAB  DS    A                                                                
AFREEST  DS    A                                                                
AGENAXTN DS    A                                                                
ACOBLOCK DS    A                                                                
AGOBLOCB DS    A                                                                
AGOXBLCK DS    A                                                                
AGOBBLCK DS    A                                                                
ABLOCK   DS    A                                                                
AWKBUFF  DS    A                                                                
         DS    8A                  SPARE                                        
                                                                                
AFABLK   DS    A                   A(FALINK CONTROL BLOCK)                      
ASECBLK  DS    A                   A(SECRET BLOCK)                              
                                                                                
SVALUES  DS    0D                                                               
                                                                                
RELOLST  DS    0A                  ** RELOCATED ADDRESS CONSTANTS **            
VTWABLD  DS    V                   V(TWABLD)                                    
VWRKIO   DS    V                   V(WRKIO)                                     
         DS    A                   N/D                                          
VGETALP  DS    V                   V(ACGETALP)                                  
VPTAORD  DS    V                   V(ACPTAORD)                                  
AFACTAB  DS    A                   A(FACILITIES TABLE)                          
ACORPHS  DS    A                   A(CORE RESIDENT PHASE LIST)                  
ANFITAB  DS    A                   A(I/O FILE TABLE)                            
ACMDTAB  DS    A                   A(I/O COMMAND TABLE)                         
VJOBCOL  DS    V                   V(ACJOBCOL)                                  
BMONVAL  DS    V                   V(BMONVAL)                                   
VATICAN  DS    V                   V(VATICAN)                                   
VGETRTE  DS    V                   V(ACGETRTE)                                  
VRECUP   DS    V                   V(RECUP)                                     
VVATSUB  DS    V                   V(VATSUB)                                    
*&&US                                                                           
         ORG   VVATSUB                                                          
VCONVERT DS    V                   V(CONVERT)                                   
*&&                                                                             
VCOVAIL  DS    V                   V(COVAIL)                                    
*&&US                                                                           
VCATCALL DS    V                   V(CATCALL)                                   
*&&                                                                             
*&&UK                                                                           
         DS    A                   was V(PROMOTE)                               
*&&                                                                             
         DS    V                   V(GETRET)                                    
*&&UK                                                                           
VSRCHPAS DS    V                   V(SRCHPASS)                                  
*&&                                                                             
RELOLSTN EQU   (*-RELOLST)/L'RELOLST                                            
*&&US*&& DS    10A                                                              
*&&UK*&& DS    9A                                                               
                                                                                
SPACES   DS    CL132               C' '                                         
VERFD    DS    CL2                 C'FD'                                        
VERFE    DS    CL2                 C'FE'                                        
T00A     DS    XL3                 X'D9000A'                                    
EZEROES  DS    CL8                 C'00000000'                                  
UNIQUEQ  DS    CL60                C'><   ...'                                  
SVALUESL EQU   *-SVALUES                                                        
         DS    XL194               SPARE FOR SVALUES GROWTH                     
USERDATA DS    XL6                 USED TO HOLD MODULE AND REQUEST CALL         
                                                                                
ALACCBLK DS    A                   A(LIMACC BLOCK)                              
                                                                                
AROUT1   DS    A                   A(ROUTINES OVERLAY 1)                        
#WRKINI  EQU   0                                                                
AWRKINI  EQU   AROUT1,,C'A'                                                     
#CPYINI  EQU   1                                                                
ACPYINI  EQU   AROUT1,,C'A'                                                     
#IOEXEC  EQU   2                                                                
AIOEXEC  EQU   AROUT1,,C'A'                                                     
#NXTREC  EQU   3                                                                
ANXTREC  EQU   AROUT1,,C'A'                                                     
$NXTRCTF EQU   X'40'               CTFILE                                       
$NXTRGEN EQU   X'08'               GENDIR/GENFIL                                
$NXTRXGR EQU   X'04'               INHIBIT GETREC (PASSIVE POINTER)             
$NXTRXAD EQU   X'02'               INHIBIT SETTING OF LP_ADATA                  
$NXTRDEL EQU   X'01'               READ DELETED RECORDS                         
#TSTNUM  EQU   4                                                                
ATSTNUM  EQU   AROUT1,,C'A'                                                     
#SETCPY  EQU   5                                                                
ASETCPY  EQU   AROUT1,,C'A'                                                     
#ORDPRF  EQU   6                                                                
AORDPRF  EQU   AROUT1,,C'A'                                                     
#SECCHK  EQU   7                                                                
ASECCHK  EQU   AROUT1,,C'A'                                                     
#SETLDG  EQU   8                                                                
ASETLDG  EQU   AROUT1,,C'A'                                                     
#GETWCD  EQU   9                                                                
AGETWCD  EQU   AROUT1,,C'A'                                                     
#GETACN  EQU   10                                                               
AGETACN  EQU   AROUT1,,C'A'                                                     
#GETETN  EQU   11                                                               
AGETETN  EQU   AROUT1,,C'A'                                                     
#GETPIN  EQU   12                                                               
AGETPIN  EQU   AROUT1,,C'A'                                                     
#GETUID  EQU   13                                                               
AGETUID  EQU   AROUT1,,C'A'                                                     
#GETUSR  EQU   14                                                               
AGETUSR  EQU   AROUT1,,C'A'                                                     
#CONAMT  EQU   15                                                               
ACONAMT  EQU   AROUT1,,C'A'                                                     
#GETPID  EQU   16                                                               
AGETPID  EQU   AROUT1,,C'A'                                                     
#SYSCHK  EQU   17                                                               
ASYSCHK  EQU   AROUT1,,C'A'                                                     
#ACCPID  EQU   18                                                               
AACCPID  EQU   AROUT1,,C'A'                                                     
#ACCPFP  EQU   19                                                               
AACCPFP  EQU   AROUT1,,C'A'                                                     
#GETITM  EQU   20                                                               
AGETITM  EQU   AROUT1,,C'A'                                                     
#EDTPID  EQU   21                                                               
$EDTPID  EQU   LO_IUIR1                                                         
AEDTPID  EQU   AROUT1,,C'A'                                                     
#EDTANM  EQU   22                                                               
$EDTANM  EQU   LO_IUIR1                                                         
AEDTANM  EQU   AROUT1,,C'A'                                                     
#EDTCLI  EQU   23                                                               
$EDTCLI  EQU   LO_IUIR1                                                         
AEDTCLI  EQU   AROUT1,,C'A'                                                     
#EDTCLN  EQU   24                                                               
$EDTCLN  EQU   LO_IUIR1                                                         
AEDTCLN  EQU   AROUT1,,C'A'                                                     
#EDTPRD  EQU   25                                                               
$EDTPRD  EQU   LO_IUIR1                                                         
AEDTPRD  EQU   AROUT1,,C'A'                                                     
#EDTPRN  EQU   26                                                               
$EDTPRN  EQU   LO_IUIR1                                                         
AEDTPRN  EQU   AROUT1,,C'A'                                                     
#EDTJOB  EQU   27                                                               
$EDTJOB  EQU   LO_IUIR1                                                         
AEDTJOB  EQU   AROUT1,,C'A'                                                     
#EDTJBN  EQU   28                                                               
$EDTJBN  EQU   LO_IUIR1                                                         
AEDTJBN  EQU   AROUT1,,C'A'                                                     
#EDTWCD  EQU   29                                                               
$EDTWCD  EQU   LO_IUIR1                                                         
AEDTWCD  EQU   AROUT1,,C'A'                                                     
#EDTUSR  EQU   30                                                               
$EDTUSR  EQU   LO_IUIR1                                                         
AEDTUSR  EQU   AROUT1,,C'A'                                                     
#EDTRLN  EQU   31                                                               
$EDTRLN  EQU   LO_IUIR1                                                         
AEDTRLN  EQU   AROUT1,,C'A'                                                     
#EDTCMN  EQU   32                                                               
$EDTCMN  EQU   LO_IUIR1                                                         
AEDTCMN  EQU   AROUT1,,C'A'                                                     
#EDTMED  EQU   33                                                               
$EDTMED  EQU   LO_IUIR1                                                         
AEDTMED  EQU   AROUT1,,C'A'                                                     
#EDTMDN  EQU   34                                                               
$EDTMDN  EQU   LO_IUIR1                                                         
AEDTMDN  EQU   AROUT1,,C'A'                                                     
#EDTOFF  EQU   35                                                               
$EDTOFF  EQU   LO_IUIR1                                                         
AEDTOFF  EQU   AROUT1,,C'A'                                                     
#EDTOFN  EQU   36                                                               
$EDTOFN  EQU   LO_IUIR1                                                         
AEDTOFN  EQU   AROUT1,,C'A'                                                     
#EDTDPT  EQU   37                                                               
$EDTDPT  EQU   LO_IUIR1                                                         
AEDTDPT  EQU   AROUT1,,C'A'                                                     
#EDTDPN  EQU   38                                                               
$EDTDPN  EQU   LO_IUIR1                                                         
AEDTDPN  EQU   AROUT1,,C'A'                                                     
#EDTSUB  EQU   39                                                               
$EDTSUB  EQU   LO_IUIR1                                                         
AEDTSUB  EQU   AROUT1,,C'A'                                                     
#EDTSUN  EQU   40                                                               
$EDTSUN  EQU   LO_IUIR1                                                         
AEDTSUN  EQU   AROUT1,,C'A'                                                     
#EDTPER  EQU   41                                                               
$EDTPER  EQU   LO_IUIR1                                                         
AEDTPER  EQU   AROUT1,,C'A'                                                     
#EDTPEN  EQU   42                                                               
$EDTPEN  EQU   LO_IUIR1                                                         
AEDTPEN  EQU   AROUT1,,C'A'                                                     
#EDTMCN  EQU   43                                                               
$EDTMCN  EQU   LO_IUIR1                                                         
AEDTMCN  EQU   AROUT1,,C'A'                                                     
#EDTSCN  EQU   44                                                               
$EDTSCN  EQU   LO_IUIR1                                                         
AEDTSCN  EQU   AROUT1,,C'A'                                                     
#EDTGRN  EQU   45                                                               
$EDTGRN  EQU   LO_IUIR1                                                         
AEDTGRN  EQU   AROUT1,,C'A'                                                     
#EDT2CD  EQU   46                                                               
$EDT2CD  EQU   LO_IUIR1                                                         
AEDT2CD  EQU   AROUT1,,C'A'                                                     
#SEMAIL  EQU   47                                                               
$SEMAIL  EQU   LO_IUIR1                                                         
ASEMAIL  EQU   AROUT1,,C'A'                                                     
#GETOFN  EQU   48                                                               
$GETOFN  EQU   LO_IUIR1                                                         
AGETOFN  EQU   AROUT1,,C'A'                                                     
#GETROL  EQU   49                                                               
$GETROL  EQU   LO_IUIR1                                                         
AGETROL  EQU   AROUT1,,C'A'                                                     
#EDTMIN  EQU   50                                                               
$EDTMIN  EQU   LO_IUIR1                                                         
AEDTMIN  EQU   AROUT1,,C'A'                                                     
#EDTHEX  EQU   51                                                               
$EDTHEX  EQU   LO_IUIR1                                                         
AEDTHEX  EQU   AROUT1,,C'A'                                                     
*                                                                               
AROUT2   DS    A                   A(ROUTINES OVERLAY 2)                        
#SETFAC  EQU   0                                                                
ASETFAC  EQU   AROUT2,,C'A'                                                     
#GAPLST  EQU   1                                                                
AGAPLST  EQU   AROUT2,,C'A'                                                     
#MTSAR   EQU   2                                                                
AMTSAR   EQU   AROUT2,,C'A'                                                     
#CSTPRF  EQU   3                                                                
ACSTPRF  EQU   AROUT2,,C'A'                                                     
#CLRIO   EQU   4                                                                
ACLRIO   EQU   AROUT2,,C'A'                                                     
#GOATSR  EQU   5                                                                
AGOATSR  EQU   AROUT2,,C'A'                                                     
                                                                                
COMADDR  DS    0V                  ** ADDRESSES FROM COMFACS **                 
VADDAY   DS    V                                                                
VBLDCUR  DS    V                                                                
VCALLOV  DS    V                                                                
VCASHVAL DS    V                                                                
*&&UK                                                                           
VCONVERT DS    V                                                                
*&&                                                                             
VCUREDIT DS    V                                                                
CUREDIT  EQU   VCUREDIT                                                         
VDATCON  DS    V                                                                
VDATVAL  DS    V                                                                
VDATAMGR DS    V                                                                
VRUNIT   DS    V                                                                
VEUREKA  DS    V                                                                
VGENERAL DS    V                                                                
VGETDAY  DS    V                                                                
VGETFACT DS    V                                                                
VGETMSG  DS    V                                                                
VGETPROF DS    V                                                                
VGETTXT  DS    V                                                                
VGLOBBER DS    V                                                                
VHELLO   DS    V                                                                
VHEXIN   DS    V                                                                
VHEXOUT  DS    V                                                                
VLIMACC  DS    V                                                                
VPARSNIP DS    V                                                                
VPERVAL  DS    V                                                                
VPERVERT DS    V                                                                
*&&UK                                                                           
VPROMOTE DS    V                                                                
*&&                                                                             
VREPORT  DS    V                                                                
VREQTWA  DS    V                                                                
VSCANNER DS    V                                                                
VSEARCH  DS    V                                                                
VSECRET  DS    V                                                                
VSOFDAT  DS    V                                                                
VSWITCH  DS    V                                                                
VWSSVR   DS    V                                                                
VXSORT   DS    V                                                                
VDICTATE DS    V                                                                
*&&UK                                                                           
VTOBACCO DS    V                                                                
*&&                                                                             
VJESMAIL DS    V                                                                
*&&UK                                                                           
VMQIO    DS    V                                                                
*&&                                                                             
VGETRET  DS    V                                                                
*&&UK                                                                           
         DS    6V                                                               
*&&                                                                             
*&&US                                                                           
         DS    10V                                                              
*&&                                                                             
                                                                                
APHASES  DS    0V                  ** LOADED PHASES **                          
VCENTER  DS    V                                                                
VCHOPPER DS    V                                                                
VDAYVAL  DS    V                                                                
VSPOOL   DS    V                                                                
VSQUASH  DS    V                                                                
VTIMVAL  DS    V                                                                
VUNDAY   DS    V                                                                
VUNDRLIN DS    V                                                                
VUNTIME  DS    V                                                                
*&&UK                                                                           
VGETEST  DS    V                                                                
*&&                                                                             
VQSORT   DS    V                                                                
*&&UK                                                                           
VDEMPARS DS    V                                                                
*&&                                                                             
VSETLOCK DS    V                                                                
VRFPIO   DS    V                                                                
*&&UK                                                                           
VCCRTABS DS    V                                                                
*&&                                                                             
VFALINK  DS    V                                                                
VGETIDS  DS    V                                                                
VGENIDS  DS    V                                                                
VDDLINK  DS    V                                                                
VOFFAL   DS    V                                                                
VGETOPT  DS    V                                                                
VJOBBER  DS    V                                                                
VGETCAP  DS    V                                                                
VADDTRN  DS    V                                                                
VTSAR    DS    V                                                                
VPADDLE  DS    V                                                                
VGENBAT  DS    V                                                                
VPRORATA DS    V                                                                
*&&UK                                                                           
VTRVAIL  DS    V                                                                
*&&                                                                             
*&&UK*&& DS    4V                  UK SPARE                                     
*&&US*&& DS    8V                  US SPARE                                     
                                                                                
         DS    13A                                                              
                                                                                
AALIOB   DS    A                                                                
AALINKIO DS    A                                                                
                                                                                
TEMP     DS    XL80                                                             
TEMP2    DS    XL80                                                             
WORK     DS    XL64                                                             
WORK2    DS    XL64                                                             
                                                                                
CSVKEY1  DS    XL64                KEY SAVE AREAS                               
CSVKEY2  DS    XL64                                                             
CSVKEY3  DS    XL64                                                             
CSVKEY4  DS    XL64                                                             
                                                                                
SWSTAB   DS    (SYSSWMAX)XL(SYSSWLEN)                                           
         DS    XL22                N/D                                          
                                                                                
GIND1    DS    XL1                 GLOBAL INDICATOR - 1                         
GIUNWIND EQU   X'80'               UNWIND TRANSACTION VIA $ABEND                
GIONLINE EQU   X'40'               RUNNING ONLINE (ELSE OFFLINE)                
GIND2    DS    XL1                 GLOBAL INDICATOR - 2                         
GI2NONE  EQU   0                                                                
GI2EBUY  EQU   C'E'                INDICATE EBUYER                              
GI2ETIM  EQU   C'T'                INDICATE ETIME                               
GI2EEXP  EQU   C'X'                INDICATE EEXPENSES                           
GI2EEST  EQU   C'S'                INDICATE EESTIMATES                          
GI2EJOB  EQU   C'J'                INDICATE JOB MODULE                          
GI2INAP  EQU   C'I'                INDICATE INVOICE APPROVAL                    
GI2RSRC  EQU   C'R'                INDICATE RESOURCES                           
GI2ACCT  EQU   C'A'                INDICATE ACCOUNT UPLOAD/DOWNLOAD             
GI2PERS  EQU   C'P'                INDICATE PERSON UPLOAD/DOWNLOAD              
GI2MAIN  EQU   C'M'                INDICATE MAINTENANCE                         
                                                                                
CUCTRY   DS    XL1                 CONNECTED USER COUNTRY                       
CULANG   DS    XL1                 CONNECTED USER LANGUAGE                      
CUACCS   DS    XL(L'TWAACCS)       LIMIT ACCESS                                 
CUUSER   DS    XL(L'TWAUSRID)      USER-ID NUMBER                               
CUAUTH   DS    XL(L'TWAAUTH)       AUTHORIZATION CODE                           
CUAALF   DS    XL(L'TWAAGY)        AGENCY ALPHA-ID                              
CUSALF   DS    XL(L'CUAALF)        SECURITY AGENCY ALPHA-ID                     
CUTSYM   DS    XL(L'FASYM)         SYSMOLIC ID (WHATEVER THAT MEANS)            
CUTSYS   DS    XL(L'FASYS)         SE SYSTEM NUMBER                             
CUPASS   DS    XL(L'FAPASSWD)      CONNECTED USER PASSWORD                      
CUTERM   DS    XL2                 CONNECTED USER TERMINAL #                    
CUSTAT   DS    XL1                 CONNECTED USER STATUS                        
CUSDDS   EQU   X'80'                                                            
CUSPER   EQU   X'40'                                                            
CUCBIT   DS    XL1                 CONNECTED USER COUNTRY BIT                   
CUXCPY   DS    XL1                 CONNECTED USER HEXCOMP                       
CCTPID   DS    XL2                 CONNECTED ACC PID                            
CUAUTL   DS    A                   ADDRESS OF UTL                               
                                                                                
SCPYEL   DS    XL(CPYLN4Q)         SAVED COMPANY ELEMENT                        
AGYCURR  DS    CL3                 AGENCY CURRENCY                              
OFFIND   DS    XL1                 OFFICE                                       
FULLYQ   EQU   C'F'                 - FULLY                                     
PANDLQ   EQU   C'P'                 - P&L                                       
NONEQ    EQU   C'N'                 - NONE                                      
PRODUL   DS    CL2                 PRODUCTION U/L                               
POFFPOS  DS    XL1                 PROD LDG OFFPOS                              
PLSEC    DS    XL1                 PROD LDG SECURITY                            
PCLILEN  DS    XL1                 CLIENT LENGTH                                
PPROLEN  DS    XL1                 PRODUCT LENGTH                               
PJOBLEN  DS    XL1                 JOB LENGTH                                   
                                                                                
DEFEXPTY DS    CL3                 DEFAULT EXPENDITURE TYPE                     
REQALIAS DS    CL20                REQUISITION ALIAS OR SPACES                  
                                                                                
LDGAREA  DS    0X                                                               
LDGAUL   DS    CL2                                                              
LDGAOP   DS    XL1                                                              
LDGAL1   DS    XL1                                                              
LDGAL2   DS    XL1                                                              
LDGAL3   DS    XL1                                                              
LDGAL4   DS    XL1                                                              
LDGASC   DS    XL1                                                              
LDGALNQ  EQU   *-LDGAREA                                                        
                                                                                
XERRTXT  DS    CL16                                                             
                                                                                
ONERL1L  DS    XL1                                                              
ONERL2L  DS    XL1                                                              
ONERL3L  DS    XL1                                                              
ONERL4L  DS    XL1                                                              
                                                                                
SJACCNT  DS    CL12                GENERAL CLI/PRO/JOB AREA                     
*&&UK                                                                           
SJACLIC  DS    CL5                                                              
SJAPROC  DS    CL2                                                              
SJAJOBC  DS    CL7                                                              
*&&                                                                             
*&&US                                                                           
SJACLIC  DS    CL3                                                              
SJAPROC  DS    CL3                                                              
SJAJOBC  DS    CL7                                                              
         DS    CL1                                                              
*&&                                                                             
                                                                                
ORACCNT  DS    CL12                1R ACCOUNT                                   
SJOFFC   DS    CL2                 SJ OFFICE                                    
CUXPINFO DS    CL1                 CONNECTING PROGRAM INFO                      
APPEMAIL DS    CL52                                                             
ANYACCNT DS    0CL14               ANY ACCOUNT                                  
ANYACUL  DS    0CL2                                                             
ANYACUN  DS    CL1                                                              
ANYACLE  DS    CL1                                                              
ANYACCD  DS    CL12                                                             
G#OFSTA2 DS    XL1                 SEE OFFKSTA2                                 
                                                                                
CTIME    DS    XL4                                                              
*&&UK                                                                           
         DS    XL8                 N/D                                          
*&&                                                                             
*&&US                                                                           
REQRPID  DS    CL(L'SECPID)                                                     
*&&                                                                             
                                                                                
ROUERRV  DS    XL2                 ROUTINE ERROR VALUE                          
                                                                                
         DS    CL90                N/D                                          
                                                                                
TSARTYP  DS    XL1                 INDICATOR WHICH TYPE IN USE                  
TSARTDL  EQU   1                   TIMESHEET DOWNLOAD LIST + SUMMARY            
TSARTDSR EQU   2                   TIMESHEET DOWNLOAD SEARCH                    
TSAREMRG EQU   3                   ESTIMATE MERGE                               
TSARESBS EQU   4                   ESTIMATE SIDE BY SIDE                        
                                                                                
TSARERRS DS    XL1                 ERRORS                                       
                                                                                
G#SGOOFF DS    CL2                 OFFICE                                       
G#SGOCLI DS    CL6                 CLIENT                                       
G#SGOPRO DS    CL6                 PRODUCT                                      
G#SGOJOB DS    CL6                 JOB                                          
G#SGOLLA DS    XL4                 A(LIMIT LIST)                                
G#SGWRKC DS    CL2                 WORK CODE                                    
G#SGRATE DS    PL5                 ECHANGE RATE                                 
G#SGCURR DS    CL3                 CURRENCY                                     
G#SGSUPP DS    CL14                SUPPLIER                                     
                                                                                
SCPXEL   DS    XL(CPXLNQ)          SAVED COMPANY EXTRA ELEMENT                  
CUXINFO  DS    0CL6                CONNECTING PROGRAM INFO                      
CUXPTYPE DS    XL1                 TYPE - SEE TXPTYPE EQUATES                   
CUXPNUM  DS    XL2                 NUMBER                                       
CUXPVER  DS    XL3                 VERSION                                      
GCSWSE   DS    XL1                 SWITCH SYSTEM SE FOR XIO                     
GCSWSYSN DS    XL1                 NATIVE SYSTEM                                
GCSWSYSC DS    XL1                 CURRENT SWITCHED SYSTEM                      
GCSWSYSP DS    XL1                 PREVIOUS SWITCHED SYSTEM                     
FEDURL   DS    CL250               FEDERATED URL                                
FEDLEN   DS    XL1                 FEDERATED URL LENGTH                         
         DS    XL748               ACTUALLY SPARE!                              
                                                                                
IOVALS   DS    0XL(IOVALSL)        *** I/O CONTROLLER VARIABLES ***             
IOADDR   DS    A                   I/O AREA ADDRESS                             
IOFILE   DS    CL7                 FILE NAME                                    
IOCMND   DS    CL7                 DATAMGR COMMAND                              
IOFLAG   DS    XL1                 FLAG BYTE USED BY IO ROUTINE                 
IOFSWTCH EQU   X'80'               SYSTEM SWITCH OCCURRED FOR I/O               
IOERR    DS    XL1                 I/O ERROR RETURN BYTE                        
IOEEOF   EQU   X'80'               END-OF-FILE                                  
IOEDSK   EQU   X'40'               NON-RECOVERABLE DISK ERROR                   
IOEDUP   EQU   X'20'               DUPLICATE KEY ON ADD                         
IOERNF   EQU   X'10'               RECORD NOT FOUND                             
IOEDEL   EQU   X'02'               RECORD IS DELETED                            
IOERRS   EQU   X'FF'               RESERVED FOR CONTROLLER USE                  
IOKEY    DS    CL64                ACTUAL KEY VALUE                             
IOKEYSAV DS    CL64                SAVED ACTUAL KEY VALUE (BEFORE I/O)          
IODA     DS    XL4                 DISK ADDRESS OF D/A RECORD                   
IOWORK   DS    XL44                D/A LINKED FILES WORK AREA                   
IODASAV  DS    XL4                 SAVED DISK ADDRESS OF D/A RECORD             
IODAOVER DS    XL4                 OVERRIDE D/A (ALWAYS USED AND XC'D)          
IOTRACE  DS    XL1                 TRACE OPTION                                 
IOINDS1  DS    XL1                 INDICATOR BYTE 1                             
IO1XSWCH EQU   X'80'               DO NOT SWITCH BACK AFTER I/O                 
IOINDS2  DS    XL1                 INDICATOR BYTE 2                             
         DS    XL8                 N/D                                          
IOVALSL  EQU   *-IOADDR                                                         
***********************************************************************         
* I/O CONTROLLER EQUATES                                              *         
***********************************************************************         
         SPACE 1                                                                
IOFILES  EQU   X'0000FF00'         RESERVED FOR CONTROLLER USE                  
IOSPTDIR EQU   X'00000100'         I/O TO SPOT DIRECTORY                        
IOSPTFIL EQU   X'00000200'         I/O TO SPOT FILE                             
IOSTAFIL EQU   X'00000300'         I/O TO STATION FILE                          
IOMEDDIR EQU   X'00000400'         I/O TO MEDIA DIRECTORY                       
IOMEDFIL EQU   X'00000500'         I/O TO MEDIA FILE                            
IOMEDZDR EQU   X'00000600'         I/O TO MEDDIRZ                               
IOMEDZFL EQU   X'00000700'         I/O TO MEDFILZ                               
IOMPLDIR EQU   X'00000800'         I/O TO MPL USER UPDATED DIRECTORY            
IOMPLFIL EQU   X'00000900'         I/O TO MPL USER UPDATED FILE                 
IOMPRDRA EQU   X'00000A00'         I/O TO MPL STATIC DIRECTORY                  
IOMPRFLA EQU   X'00000B00'         I/O TO MPL STATIC FILE                       
IOMBADIR EQU   X'00000C00'         I/O TO MBASE DIRECTORY                       
IOMBANDX EQU   X'00000D00'         I/O TO MBASE INDEX                           
IOMBAFIL EQU   X'00000E00'         I/O TO MBASE FILE                            
IOMBUDIR EQU   X'00000F00'         I/O TO MBASE USER DIRECTORY                  
IOMBUFIL EQU   X'00001000'         I/O TO MBASE USER FILE                       
IOGENDIR EQU   X'00001100'         I/O TO GENERAL DIRECTORY                     
IOGND    EQU   IOGENDIR                                                         
IOGENFIL EQU   X'00001200'         I/O TO GENERAL FILE                          
IOGNF    EQU   IOGENFIL                                                         
IOCONFIL EQU   X'00001300'         I/O TO CONTROL FILE                          
IOCTL    EQU   IOCONFIL                                                         
IOACCFIL EQU   X'00001400'         I/O TO ACCOUNT FILE                          
IOPRTDIR EQU   X'00001500'         I/O TO PRTDIR                                
IOPRTFIL EQU   X'00001600'         I/O TO PRTFILE                               
IOACCDIR EQU   X'00001700'         I/O TO ACCDIR                                
IODIR    EQU   IOACCDIR                                                         
IOACCMST EQU   X'00001800'         I/O TO ACCMST                                
IOMST    EQU   IOACCMST                                                         
IOACCARC EQU   X'00001900'         I/O TO ACCARC                                
IOARC    EQU   IOACCARC                                                         
IOFEEDIR EQU   X'00001A00'         I/O TO ARTISTE FEES DIRECTORY                
IOFEEFIL EQU   X'00001B00'         I/O TO ARTISTE FEES FILE                     
IOREPDIR EQU   X'00001C00'         I/O TO REP DIRECTORY                         
IOREPFIL EQU   X'00001D00'         I/O TO REP FILE                              
IOREPREQ EQU   X'00001E00'         I/O TO REP REQUEST FILE                      
IOMEDREQ EQU   X'00001F00'         I/O TO MEDIA REQUEST FILE                    
IOREPVEW EQU   X'00002000'         I/O TO REP VIEW FILE                         
         SPACE 1                                                                
*                                  ** I/O AREA EQUATES **                       
IOAREAS  EQU   X'000000F0'         RESERVED FOR IO AREAS                        
IO1      EQU   X'00000010'         I/O AREA 1 TO BE USED FOR I/O                
IO2      EQU   X'00000020'         I/O AREA 2 TO BE USED FOR I/O                
IO3      EQU   X'00000030'         I/O AREA 3 TO BE USED FOR I/O                
IO4      EQU   X'00000040'         I/O AREA 4 TO BE USED FOR I/O                
IO5      EQU   X'00000050'         I/O AREA 5 TO BE USED FOR I/O                
IO6      EQU   X'00000060'         I/O AREA 6 TO BE USED FOR I/O                
IO7      EQU   X'00000070'         I/O AREA 7 TO BE USED FOR I/O                
IO8      EQU   X'00000080'         I/O AREA 8 TO BE USED FOR I/O                
IO9      EQU   X'00000090'         I/O AREA 9 TO BE USED FOR I/O                
IO10     EQU   X'000000A0'         I/O AREA 10 TO BE USED FOR I/O               
IO11     EQU   X'000000B0'         I/O AREA RESERVED FOR CONTROLLER             
         SPACE 1                                                                
*                                  ** I/O COMMAND EQUATES **                    
IOCMNDS  EQU   X'0000000F'         RESERVED FOR COMMANDS                        
IOLOCK   EQU   X'00010000'         READ FOR UPDATE                              
IORDEL   EQU   X'00020000'         READ DELETED RECORDS (=> USE IORDD)          
IOADD    EQU   X'00000001'         DMADD                                        
IORD     EQU   X'00000002'         DMREAD                                       
IOHI     EQU   X'00000004'         DMRDHI                                       
IOSQ     EQU   X'00000003'         DMRSEQ                                       
IOWRITE  EQU   X'00000008'         DMWRT                                        
IOGET    EQU   X'0000000B'         GETREC                                       
IOPUTREC EQU   X'0000000C'         PUTREC                                       
IOADDREC EQU   X'0000000D'         ADDREC                                       
IOADFREC EQU   X'0000000E'         ADD ARCHIVE RECORD                           
IOHID    EQU   IOHI+IORDEL         DMRDHI (FOR DELETES)                         
IOHIUP   EQU   IOHI+IOLOCK         DMRDHI (FOR UPDATE)                          
IOHIUPD  EQU   IOHI+IOLOCK+IORDEL  DMRDHI (FOR UPDATE & DELETES)                
IORDD    EQU   IORD+IORDEL         DMREAD (FOR DELETES)                         
IORDUP   EQU   IORD+IOLOCK         DMREAD (FOR UPDATE)                          
IORDUPD  EQU   IORD+IOLOCK+IORDEL  DMREAD (FOR UPDATE & DELETES)                
IOSQD    EQU   IOSQ+IORDEL         DMRSEQ (FOR DELETES)                         
IOSQUP   EQU   IOSQ+IOLOCK         DMRSEQ (FOR UPDATE)                          
IOSQUPD  EQU   IOSQ+IOLOCK+IORDEL  DMRSEQ (FOR UPDATE & DELETES)                
IOGETRUP EQU   IOGET+IOLOCK        GETREC (FOR UPDATE)                          
         SPACE 1                                                                
***********************************************************************         
* SYSTEM EQUATES                                                      *         
***********************************************************************         
         SPACE 1                                                                
QSSPT    EQU   X'02'                                                            
QSNET    EQU   X'03'                                                            
QSMED    EQU   X'04'                                                            
QSPRT    EQU   X'04'                                                            
QSMPL    EQU   X'05'                                                            
QSACC    EQU   X'06'                                                            
QSFEE    EQU   X'07'                                                            
QSREP    EQU   X'08'                                                            
QSMBA    EQU   X'09'                                                            
QSCON    EQU   X'0A'                                                            
QSPER    EQU   X'0E'                                                            
QSMEDZ   EQU   X'14'                                                            
         SPACE 1                                                                
ACCBLK   DS    XL(4*ONEK)                                                       
         ORG   ACCBLK                                                           
COBLOCKA DS    (COBLOCKX-COBLOCK)X         (2000)                               
GOBLOCKB DS    (GOBLOCKX-GOBLOCK)X         (400)                                
GOXBLCKA DS    (GOXBLKX-GOXBLOCK)X         (400)                                
GOBBLCKA DS    (GOBBLKXX-GOBBLOCK)X        (600)                                
BLOCK    DS    XL480                                                            
                                                                                
***********************************************************************         
* NEXT DECLARATIVE SOFTLY DEFINES REMAINING AVAILABLE ACCBLK          *         
* IF YOU OVERSTEP ABOVE, THE ASSEMBLER WILL SHOUT                     *         
***********************************************************************         
                                                                                
         DS    XL(L'ACCBLK-(*-ACCBLK))                                          
                                                                                
OFFAREA  DS    XL(OFFALLEN)                                                     
         DS    XL(3600-OFFALLEN)                                                
                                                                                
IOLENQ   EQU   2*ONEK                                                           
IODDWQ   EQU   IOLENQ-(L'IODA+L'IOWORK)                                         
IOAREA1  DS    XL(IOLENQ)                                                       
IOAREA2  DS    XL(IOLENQ)                                                       
IOAREA3  DS    XL(IOLENQ)                                                       
IOAREA4  DS    XL(IOLENQ)                                                       
IOAREA5  DS    XL(IOLENQ)                                                       
IOAREA6  DS    XL(IOLENQ)                                                       
IOAREA7  DS    XL(IOLENQ)                                                       
IOAREA8  DS    XL(IOLENQ)                                                       
IOAREASL EQU   *-IOAREA1                                                        
                                                                                
GENAREA  DS    0XL(24*ONEK)                                                     
ELEAREA  DS    XL(LELEAREA)                (6144)                               
LELEAREA EQU   3*IOLENQ                    (6144)                               
         ORG   ELEAREA                                                          
WKBUFF   DS    XL(LELEAREA)                                                     
COLIST   DS    XL200                       (200)                                
COLTAB   DS    XL3600                      (3600)                               
GOBLOCKA DS    (GOBLOCKX-GOBLOCK)X         (400)                                
JOBLOCKA DS    (JBLOCKL)X                  (400)                                
FREESTOR DS    XL1544                      (1544)                               
GENAEXTN DS    XL(12*ONEK)                 (12288)                              
GENAREAX DS    0H                                                               
                                                                                
         DS    0D                  ALIGN TO DOUBLEWORD BOUNDARY                 
WORKL    EQU   *-WORKD                                                          
                                                                                
***********************************************************************         
* FACPAK USER CODES                                                   *         
***********************************************************************         
                                                                                
BRO#TIME EQU   X'0001'             TIMESHEETS                                   
BRO#ORDS EQU   X'0002'             ORDERS                                       
BRO#ESTS EQU   X'0003'             ESTIMATES                                    
BRO#EXPS EQU   X'0004'             EXPENSES                                     
BRO#INVS EQU   X'0005'             INVOICES                                     
BRO#JOBS EQU   X'0006'             JOBS                                         
BRO#QRPT EQU   X'0007'             QUICK REPORTS                                
BRO#RESR EQU   X'0008'             RESOURCES                                    
BRO#GENR EQU   X'0009'             GENERAL                                      
BRO#ACCT EQU   X'000A'             ACCOUNT                                      
BRO#PERS EQU   X'000B'             PERSON                                       
BRO#HISL EQU   X'000C'             History/Salary upload                        
BRO#SALP EQU   X'000D'             Salary posting upload                        
                                                                                
***********************************************************************         
* EXTRA WORK AREA ACQUIRED FOR DDLINK APPLICATIONS                    *         
***********************************************************************         
                                                                                
XWORKD   DSECT                                                                  
                                                                                
DDRUNP   DS    (RUNPARML)X         RUNPARMS EMULATION                           
DDRUNF   DS    (RUNFACSL)X         RUNFACS EMULATION                            
DDLINKC  DS    (LP_LNQ)X           DDLINK CONTROL BLOCK                         
DDWRKIOC DS    (WRKIOBL)X          WRKIO CONTROL BLOCK                          
LINKWORK DS    XL(10*ONEK)         DDLINK WORK AREA                             
DDWRKIAR DS    XL(12*ONEK)         WRKIO RECORD AREA                            
*&&US                                                                           
WMP      DS    XL(8*ONEK)          WORK MAP POOL (ONLINE OVERRIDE)              
*&&                                                                             
         DS    0D                  ALIGN TO DOUBLEWORD BOUNDARY                 
XWORKL   EQU   *-XWORKD                                                         
         EJECT                                                                  
***********************************************************************         
* I/O FILE TABLE                                                      *         
***********************************************************************         
         SPACE 1                                                                
NFITABD  DSECT                                                                  
NFINUM   DS    XL1                 FILE NUMBER (IOFILES EQUATE)                 
NFIOSE   DS    XL1                 NATIVE SYSTEM FOR THIS FILE                  
NFISE    DS    XL1                 OVERRIDE SYSTEM FOR THIS FILE                
NFINAME  DS    CL7                 FILE NAME                                    
*                                                                               
NFIINDS  DS    XL1                 FILE INDICATORS - 1                          
NFIIVL   EQU   X'80'               FILE RECORDS ARE VARIABLE LENGTH             
NFIIDA   EQU   X'40'               FILE IS A DIRECT ACCESS FILE                 
NFIIIS   EQU   X'20'               FILE IS AN INDEX SEQUENTIAL FILE             
NFIREQ   EQU   X'10'               FILE IS A REQUEST FILE                       
*                                                                               
NFIINDS2 DS    XL1                 FILE INDICATORS - 2                          
NFIIDI   EQU   X'80'               FILE IS D/A WITH I/S INDEX                   
NFIIID   EQU   NFIIDI              FILE IS I/S INDEX TO A D/A FILE              
NFIIARC  EQU   X'40'               I/S INDEXES MULTIPLE D/A FILES               
*                                                                               
NFINUM2  DS    XL1                 D/A OR I/S FILE NUMBER                       
NFIKEYL  DS    XL1                 D/A OR I/S KEY LENGTH                        
NFICTLL  DS    XL1                 FIXED LENGTH I/S CONTROL LENGTH              
NFIDISP  EQU   NFICTLL             DISPLACEMENT TO FIRST RECORD ELEMENT         
NFIMAXL  DS    XL2                 MAXIMUM RECORD LENGTH                        
*                                                                               
NFIATST  DS    XL1                 TEST TYPE TO APPLY                           
NFIABOOL EQU   X'80'               USE MASK AS BITMASK                          
NFIAEQU  EQU   X'40'               USE MASK AS COMPARE VALUE                    
NFIABIT  DS    XL1                 BITMASK TO TEST                              
NFIANUM  DS    XL1                 CORRESPONDENT D/A FILE NUMBER                
NFIADSP  DS    XL1                 DISP TO BIT IN CTL FOR MULTIPLE FILE         
         DS    XL7                 N/D                                          
NFITABL  EQU   *-NFITABD                                                        
         SPACE 1                                                                
FILTABD  DSECT                                                                  
FILNUM   DS    XL1                 FILE NUMBER (IOFILES EQUATE)                 
FILNAME  DS    CL7                 FILE NAME                                    
FILINDS  DS    XL1                 FILE INDICATORS - 1                          
FILIVL   EQU   X'80'               FILE RECORDS ARE VARIABLE LENGTH             
FILIDA   EQU   X'40'               FILE IS A DIRECT ACCESS FILE                 
FILIIS   EQU   X'20'               FILE IS AN INDEX SEQUENTIAL FILE             
FILINDS2 DS    XL1                 FILE INDICATORS - 2                          
FILIDI   EQU   X'80'               FILE IS D/A WITH I/S INDEX                   
FILIID   EQU   FILIDI              FILE IS I/S INDEX TO A D/A FILE              
FILNUM2  DS    XL1                 D/A OR I/S FILE NUMBER                       
FILKEYL  DS    XL1                 D/A OR I/S KEY LENGTH                        
FILCTLL  DS    XL1                 FIXED LENGTH I/S CONTROL LENGTH              
FILMAXL  DS    XL2                 MAXIMUM RECORD LENGTH                        
         DS    XL5                 N/D                                          
FILTABL  EQU   *-FILTABD                                                        
                                                                                
***********************************************************************         
* GAPLST - LIST OF APPROVES - TABLE DEFINITION                        *         
***********************************************************************         
* Calling equates                                                               
GAPLLIML EQU   C'L'                - LIMIT LIST                                 
GAPLAPPR EQU   C'A'                - APPROVER                                   
GAPLBKAP EQU   C'B'                - BACK UP APPROVER                           
GAPLALLC EQU   C'C'                - ALL CLIENTS - TIME SUMMARY                 
* Type of view equates                                                          
GAPLTDTE EQU   X'01'               BY DATE FOR APPROVER                         
GAPLTSTA EQU   X'02'               BY STATUS FOR APPROVER                       
GAPLTACC EQU   X'03'               BY ACCESS                                    
* Adding to existing buffer                                                     
GAPLPADD EQU   X'80'               ADD TO EXISTING ENTRIES IN TSAR              
* Account list/search call                                                      
GAPLACLS EQU   X'40'               LOOK AT RSTEL TO DETERMINE ACCESS            
*                                  ALL OR NO ACCOUNTS                           
                                                                                
GAPTABD  DSECT                                                                  
GAPTDAT1 DS    XL1                 DATA TYPE                                    
GAPTEOT  EQU   FF                  END OF TABLE MARKER                          
GAPTT1Q  EQU   X'01'               - 1R ACCOUNT                                 
GAPTT2Q  EQU   X'02'               - SJ ACCOUNT/OFFICE WITH NO MEDIA            
GAPTT3Q  EQU   X'03'               - 1N ACCOUNT                                 
GAPTT4Q  EQU   X'04'               - SCHEME CODE                                
GAPTT5Q  EQU   X'05'               - MEDIA CODE                                 
GAPTT6Q  EQU   X'06'               - SJ ACCOUNT WITH OFFICE AND MEDIA           
GAPTT7Q  EQU   X'07'               - ETYPE CODE                                 
GAPTT8Q  EQU   X'08'               - SUPPLIER ACCOUNT                           
GAPTT9Q  EQU   X'09'               - 1R ACCOUNT FINANCE                         
GAPTTAQ  EQU   X'0A'               - WORKCODE                                   
* ADDITIONAL REQUEST TYPES BELOW                                                
GAPTT20Q EQU   X'20'               - 02+03 (SJ+1N)                              
GAPTT21Q EQU   X'21'               - 02+04+05 (SJ+SCHEME+MEDIA)                 
GAPTT22Q EQU   X'22'               - 01+02+03 (1R+SJ+1N)                        
GAPTT23Q EQU   X'23'               - 02+05+06+07+08(SJ+MEDIA+ETYPE+SUP)         
GAPTT24Q EQU   X'24'               - 01+02+03+0A (1R+SJ+1N+WC)                  
GAPTDAT2 DS    XL1                 MORE DATA TYPES (FOR FUTURE USE)             
GAPTAPPL DS    XL1                 APPLICATION TYPE SEE JOBPASD DPAPASD         
GAPTXXX  DS    XL2                 0 OR X'FFFF' TO AID SORTING                  
GAPTCODE DS    0CL16                                                            
GAPTMED  DS    CL1                 MEDIA                                        
GAPTOFF  DS    CL2                 OFFICE                                       
GAPTCPJ  DS    CL12                CLIENT PRODUCT JOB                           
         DS    CL1                                                              
         ORG   GAPTCODE                                                         
GAPTCOFF DS    CL2                 OFFICE                                       
GAPTACC  DS    CL12                CLIENT PRODUCT JOB                           
GAPTCMED DS    CL1                 MEDIA                                        
         DS    CL1                                                              
         ORG   GAPTCODE                                                         
GAPTACT  DS    CL12                ACCOUNT CODE                                 
         DS    CL4                                                              
         ORG   GAPTCODE                                                         
GAPTMEDI DS    CL1                 MEDIA CODES                                  
         DS    CL15                                                             
         ORG   GAPTCODE                                                         
GAPTSCH  DS    CL8                 SCHEME CODE                                  
         DS    CL8                                                              
         ORG   GAPTCODE                                                         
GAPTETYP DS    CL3                 EXPENDITURE TYPE CODE                        
         DS    CL13                                                             
         ORG   GAPTCODE                                                         
GAPTCRED DS    0CL14               CREDITOR/VENDOR UNIT LEDGER ACCOUNT          
GAPTCUNL DS    0CL2                CREDITOR/VENDOR UNIT LEDGER                  
GAPTCUNT DS    CL1                 CREDITOR/VENDOR UNIT                         
GAPTCLDG DS    CL1                 CREDITOR/VENDOR LEDGER                       
GAPTCACT DS    CL12                CREDITOR/VENDOR ACCOUNT                      
GAPTCOFC DS    CL2                 CREDITOR/VENDOR OFFICE                       
GAPTKLNQ EQU   *-GAPTABD                                                        
GAPTSTA  DS    XL1                 STATUS                                       
GAPTSMQ  EQU   X'80'               - MAIN ACCOUNT CODE                          
GAPTSIQ  EQU   X'20'               - INCLUDE                                    
GAPTSEQ  EQU   X'10'               - EXCLUDE                                    
GAPTSMDQ EQU   X'08'               - MODIFIED FROM LIDEL                        
GAPTLVL  DS    XL1                 STATUS 2                                     
GAPTSL0  EQU   0                   - LEVEL 0                                    
GAPTSL1  EQU   1                   - LEVEL 1                                    
GAPTSL2  EQU   2                   - LEVEL 2                                    
GAPTSL3  EQU   3                   - LEVEL 3                                    
GAPTSL4  EQU   4                   - LEVEL 4                                    
GAPTSL5  EQU   5                   - LEVEL 5                                    
GAPTSL6  EQU   6                   - LEVEL 6                                    
GAPTSL7  EQU   7                   - LEVEL 7                                    
GAPTSL8  EQU   8                   - LEVEL 8                                    
GAPTSL9  EQU   9                   - LEVEL 9                                    
GAPTSL10 EQU   10                  - LEVEL 10                                   
GAPTSL11 EQU   11                  - LEVEL 11                                   
GAPTLEN  DS    XL1                 LENGTH FOR READING PASSIVES                  
*                                                                               
* Level has different meaning depending on unit ledger                          
* For production ledger we have the following:-                                 
* Level 0  Agency                                                               
* Level 1  Office                                                               
* Level 2  Office/client                                                        
* Level 3  Office/client/product                                                
* Level 4  Office/client/product/job - only applicable for limit list           
* Level 5  Media - the rest of them only applicable for approvers               
* Level 6  Media/office                                                         
* Level 7  Media/office/client                                                  
* Level 8  Media/office/client/product                                          
* Level 9  Media/office/client/product/job                                      
*                                                                               
* For personnel ledger 1R:-                                                     
*                                                                               
* Level 0  Agency                                                               
* Level 1  Office                                                               
* Level 2  Department                                                           
* Level 3  Sub-dept                                                             
* Level 4  Person                                                               
*                                                                               
GAPTPASS DS    XL1                 PASSIVE SEARCH                               
GAPTBKUP DS    XL2                 PID OF APPROVER WE ARE BACKING UP            
GAPTLNQ  EQU   *-GAPTABD                                                        
***********************************************************************         
* TIME FILTERING DSECTS FOR ESTIMATES JOB DASHBOARD                   *         
***********************************************************************         
                                                                                
COGOTABD DSECT                     GETCAP/GETOPT TABLE DSECT                    
COGOCAP  DS    XL1                 GETCAP VALUE  FOR COTUP                      
COGOGOPT DS    XL1                 GETOPT VALUE FOR TIME REQUIRED               
COGOMPTY DS    XL1                 INTERESTED IN EMPTY STATUSES                 
COGOSTA  DS    XL1                 STATUSES WE ARE INTERESTED IN                
COGOXST  DS    XL1                 EXCEPTION TO STATUSES ABOVE                  
COGOPST  DS    XL1                 CLIENT APPROVAL STATUS                       
COGOTABL EQU   *-COGOTABD          TABLE LENGTH                                 
                                                                                
TMSTTABD DSECT                                                                  
TMSTMPTY DS    XL1                 INTERESTED IN EMPTY STATUS                   
TMSTSTAT DS    XL1                 STATUSES WE WANT                             
TMSTXSTA DS    XL1                 EXCEPTION TO STATUSES                        
TMSTCLST DS    XL1                 CLIENT APPROVAL STATUS                       
TMSTTABL EQU   *-TMSTTABD          DATA LENGTH                                  
*                                                                               
***********************************************************************         
* PPFLST - PRODUCTION PROFILE LIST - TABLE DEFINITION                 *         
***********************************************************************         
                                                                                
PPFTABD  DSECT                                                                  
PPFTTYP  DS    XL1                 TYPE                                         
PPFTAGY  EQU   C'1'                - AGENCY                                     
PPFTOFG  EQU   C'2'                - OFFICE GROUP                               
PPFTOFF  EQU   C'3'                - OFFICE                                     
PPFTCLI  EQU   C'4'                - CLIENT                                     
PPFTPRO  EQU   C'5'                - PRODUCT                                    
PPFTJOB  EQU   C'6'                - JOB                                        
PPFTEOT  EQU   FF                                                               
PPFOFGP  DS    CL1                 OFFICE GROUP                                 
PPFOFFC  DS    CL2                 OFFICE                                       
PPFCLI   DS    CL6                 CLIENT CODE                                  
PPFPRO   DS    CL6                 PRODUCT CODE                                 
PPFJOB   DS    CL6                 JOB CODE                                     
PPFTOT   DS    CL1                 DEFAULT TYPE OF TIME                         
PPFTOTY  DS    CL1                                                              
PPFTTA   DS    CL3                 TYPE OF TIME ALLOWABLE                       
PPFTTAY  DS    CL1                                                              
PPFFPT   DS    CL1                 FORCE PRODUCT ON TIMESHEET                   
PPFFPTY  DS    CL1                                                              
PPFFJT   DS    CL1                 FORCE JOB ON TIMESHEET                       
PPFFJTY  DS    CL1                                                              
PPFFNT   DS    CL3                 FORCE NARRATIVE ON TIMESHEET                 
PPFFNTY  DS    CL1                                                              
PPJOBT   DS    CL1                 JOB INPUT ALLOWED ON TIME                    
PPJOBTY  DS    CL1                                                              
PPFJLE   DS    CL1                 NO JOB LEVEL ENTRY FOR EXPENSE               
PPFJLEY  DS    CL1                                                              
PPFBIO   DS    CL1                 BILLABLE ONLY                                
PPFBIOY  DS    CL1                                                              
PPFTLNQ  EQU   *-PPFTABD                                                        
                                                                                
***********************************************************************         
* POPTLST - PRODUCTION OPTION TABLE                                   *         
***********************************************************************         
                                                                                
POPTTABD DSECT                                                                  
POPTOPTN DS    XL1                 OPTION NUMBER - SEE ACOPTEQUS                
POPTLEN  DS    XL1                 OPTION DATA LENGTH                           
POPTDISP DS    H                   DISP TO OPTION DATA IN TABLE                 
POPTDISY DS    H                   DISPLACEMENT TO WHETHER OPTION FOUND         
POPTLENQ EQU   *-POPTTABD                                                       
                                                                                
***********************************************************************         
* OFGRLST - OFFICE GROUP LIST                                         *         
***********************************************************************         
                                                                                
OFGRTABD DSECT                                                                  
OFGROFFC DS    CL2                 OFFICE                                       
OFGRGRUP DS    CL1                 OFFICE GROUP                                 
OFGRLENQ EQU   *-OFGRTABD                                                       
                                                                                
***********************************************************************         
* REPORT TYPE DSECT                                                   *         
***********************************************************************         
         SPACE 2                                                                
REPTYPD  DSECT                                                                  
REPTYLLN DS    XL1                 LENGTH                                       
REPTYPE  DS    CL1                 SEE QR_FRMTY                                 
REPLN1Q  EQU   *-REPTYPD           LENGTH OF RECORD WITHOUT CODES               
REPCODES DS    0X                  CODES FOR WHICH NAME APPLIES                 
REP#RCV  EQU   C'R'                  RECEIVABLES REPORT          (SR)           
REP#ADV  EQU   C'A'                  ADVANCES REPORT             (SA)           
REP#BAL  EQU   C'B'                  BALANCE SHEET/MISC. REPORT  (SB)           
*                                                                               
REP#INC  EQU   C'I'                  INCOME REPORT               (SI)           
REP#SUP  EQU   C'K'                  INCOME SUSPENDED            (SK)           
REP#ICST EQU   C'1'                  INCOME COST REPORT          (1C)           
*                                                                               
REP#PAY  EQU   C'P'                  PAYABLES                    (SP)           
REP#PAYQ EQU   C'Q'                  PAYABLES                    (SQ)           
REP#PAYS EQU   C'S'                  PAYABLES                    (SS)           
REP#PAYT EQU   C'T'                  PAYABLES                    (ST)           
REP#PAYU EQU   C'U'                  PAYABLES                    (SU)           
REP#PAYV EQU   C'V'                  PAYABLES                    (SV)           
REP#PAYW EQU   C'W'                  PAYABLES                    (SW)           
REP#PAYX EQU   C'X'                  PAYABLES                    (SX)           
REP#PAYY EQU   C'Y'                  PAYABLES                    (SY)           
REP#PAYC EQU   C'C'                  PAYABLES                    (2C)           
REP#PAYF EQU   C'F'                  PAYABLES            UK ONLY (SF)           
*                                                                               
REP#EXP  EQU   C'E'                  EXPENSE REPORT              (SE)           
REP#EXPF EQU   C'F'                  EXPENSE REPORT              (SF)           
REP#EXPL EQU   C'L'                  EXPENSE REPORT              (SL)           
REP#EXPD EQU   C'D'                  EXPENSE REPORT              (2D)           
REP#EXPB EQU   C'B'                  EXPENSE REPORT              (SB)           
REP#EXPP EQU   C'H'                  EXPENSE REPORT              (2P)           
*                                                                               
REP#PROD EQU   C'J'                  PRODUCTION REPORT           (SJ)           
*                                                                               
REP#CST  EQU   C'0'                  MANPOWER REPORT             (1R)           
*                                                                               
REP#CASH EQU   C'7'                  CASH REPORT                 (SC)           
*                                                                               
REP#PNL  EQU   C'9'                  PNL  REPORT                 (1C)           
*                                                                               
REP#GNL  EQU   C'G'                  G/L  REPORT                 (GB)           
REP#GNLP EQU   C'8'                  G/L  REPORT                 (GP)           
*                                                                               
REP#MEDA EQU   C'Z'                  MEDIA REPORT                (SZ)           
*                                                                               
REP#FI   EQU   C'I'                  APG  FINANCIAL REPORT                      
REP#M2   EQU   C'2'                  APG  MANPOWER  REPORT                      
REP#IV   EQU   C'3'                  APG  INVOICE   REPORT                      
*                                                                               
***********************************************************************         
* ORDERS PROFILE BLOCK                                                *         
***********************************************************************         
                                                                                
ORDPRFD  DSECT                                                                  
ULEBYPRF DS    0XL16               USER ID LVL EBUYER PROFS                     
PROEBY01 DS    XL1                 - MINIMUM ORDER AMOUNT                       
DEFEBY01 EQU   0                                                                
PROEBY02 DS    XL1                 - SUPPLIER REQUIRED TO SUBMIT                
DEFEBY02 EQU   C'Y'                                                             
PROEBY03 DS    XL1                 - EXPENSE A/C VISIBLE TO ORDERER             
DEFEBY03 EQU   C'Y'                                                             
PROEBY04 DS    XL1                 - SEQUENTIAL APPROVAL                        
DEFEBY04 EQU   C'N'                                                             
PROEBY05 DS    XL1                 - ESTIMATE CHECKING                          
DEFEBY05 EQU   C'N'                                                             
PROEBY06 DS    XL1                 - ESTIMATE CHECK - APPROVED CE               
DEFEBY06 EQU   C'N'                                                             
PROEBY07 DS    XL1                 - ESTIMATE CHECK - ORDER OVER AMOUNT         
DEFEBY07 EQU   C'N'                                                             
PROEBY08 DS    XL1                 - ALLOW SELF APPROVAL                        
DEFEBY08 EQU   C'N'                                                             
PROEBY09 DS    XL1                 - REQUISITION NUMBERING IN USE               
DEFEBY09 EQU   C'N'                                                             
PROEBY10 DS    XL1                 - STAFF/DEPT ANALYSIS                        
DEFEBY10 EQU   C'N'                                                             
PROEBY11 DS    XL1                 - INT ORDER CREDIT A/C - WC OR MEDIA         
DEFEBY11 EQU   C'W'                                                             
PROEBY12 DS    XL1                 - ESTIMATE NUMBER COMPULSORY                 
DEFEBY12 EQU   C'N'                                                             
PROEBY13 DS    XL1                 - PROFILE 1 VALUE BASE (*TEN)                
DEFEBY13 EQU   C'0'                                                             
PROEBY14 DS    XL1                 - W/C INPUT ON EXPENSE ORDERS                
DEFEBY14 EQU   C'N'                                                             
PROEBY15 DS    XL1                 - RESUBMIT IF CHANGE APPR. ORDER             
DEFEBY15 EQU   C'N'                                                             
PROEBY16 DS    XL1                 - ITEM/ARTICLES IN USE                       
DEFEBY16 EQU   C'N'                                                             
                                                                                
ULPO2PRF DS    0XL16               USER ID LVL EBUYER PROFS (2)                 
PROPO201 DS    XL1                 - ITEMS MODE 'ALL ORDER ITEMS'               
DEFPO201 EQU   C'N'                                                             
PROPO202 DS    XL1                 - USE WC 'INCL EST. CHKS' FLAGS              
DEFPO202 EQU   C'N'                                                             
PROPO203 DS    XL1                 - PRODUCTION AUTO APPROVAL LIMIT             
DEFPO203 EQU   0                                                                
PROPO204 DS    XL1                 - MULTIPLIER PROD AUTO APPR LIM              
DEFPO204 EQU   C'0'                                                             
PROPO205 DS    XL1                 - REQUISITION NUMBER EXPENSE                 
DEFPO205 EQU   C'N'                                                             
PROPO206 DS    XL1                 - ALLOW SELF APPROVAL EXPENSE                
DEFPO206 EQU   C'N'                                                             
PROPO207 DS    XL1                 - EXPENSE AUTO APPROVAL LIMIT                
DEFPO207 EQU   0                                                                
PROPO208 DS    XL1                 - MULTIPLIER EXP AUTO APPR LIM               
DEFPO208 EQU   C'0'                                                             
PROPO209 DS    XL1                 - REQUISITION NUMBER INTERNAL                
DEFPO209 EQU   C'N'                                                             
PROPO210 DS    XL1                 - ALLOW SELF APPROVAL INTERNAL               
DEFPO210 EQU   C'N'                                                             
PROPO211 DS    XL1                 - INTERNAL AUTO APPROVAL LIMIT               
DEFPO211 EQU   0                                                                
PROPO212 DS    XL1                 - MULTIPLIER INT AUTO APPR LIM               
DEFPO212 EQU   C'0'                                                             
PROPO213 DS    XL1                 - REQUISITION NUMBER ARTISTS                 
DEFPO213 EQU   C'N'                                                             
PROPO214 DS    XL1                 - ALLOW SELF APPROVAL ARTISTS                
DEFPO214 EQU   C'N'                                                             
PROPO215 DS    XL1                 - ARTISTS AUTO APPROVAL LIMIT                
DEFPO215 EQU   0                                                                
PROPO216 DS    XL1                 - MULTIPLIER ART AUTO APPR LIM               
DEFPO216 EQU   C'0'                                                             
                                                                                
MINOAMT  DS    PL8                                                              
MINPAMT  DS    PL8                                                              
MINEAMT  DS    PL8                                                              
MINAAMT  DS    PL8                                                              
MINIAMT  DS    PL8                                                              
                                                                                
RNSAIND  DS    XL1                 REQ. NO./SELF APPR. INDICATOR                
*                                    REQUISITION NO:                            
RNSARPQ  EQU   X'80'               - PRODUCTION ORDERS                          
RNSAREQ  EQU   X'40'               - EXPENSE ORDERS                             
RNSARAQ  EQU   X'20'               - ARTIST ORDERS                              
RNSARIQ  EQU   X'10'               - INTERNAL ORDERS                            
RNSARYQ  EQU   RNSARPQ+RNSAREQ+RNSARAQ+RNSARIQ                                  
*                                    SELF APPROVAL:                             
RNSASPQ  EQU   X'08'               - PRODUCTION ORDERS                          
RNSASEQ  EQU   X'04'               - EXPENSE ORDERS                             
RNSASAQ  EQU   X'02'               - ARTIST ORDERS                              
RNSASIQ  EQU   X'01'               - INTERNAL ORDERS                            
RNSASYQ  EQU   RNSASPQ+RNSASEQ+RNSASAQ+RNSASIQ                                  
                                                                                
ULPO3PRF DS    0XL16               USER ID LVL EBUYER PROFS (3)                 
PROPO301 DS    XL1                 - PREVENT ZERO ORDER AMOUNT                  
DEFPO301 EQU   C'N'                                                             
PROPO302 DS    XL1                 - ESTIMATE CHECK - ALL ORDERS                
DEFPO302 EQU   C'N'                                                             
PROPO303 DS    XL1                 - N/D                                        
DEFPO303 EQU   0                                                                
PROPO304 DS    XL1                 - N/D                                        
DEFPO304 EQU   0                                                                
PROPO305 DS    XL1                 - N/D                                        
DEFPO305 EQU   0                                                                
PROPO306 DS    XL1                 - N/D                                        
DEFPO306 EQU   0                                                                
PROPO307 DS    XL1                 - N/D                                        
DEFPO307 EQU   0                                                                
PROPO308 DS    XL1                 - N/D                                        
DEFPO308 EQU   0                                                                
PROPO309 DS    XL1                 - N/D                                        
DEFPO309 EQU   0                                                                
PROPO310 DS    XL1                 - N/D                                        
DEFPO310 EQU   0                                                                
PROPO311 DS    XL1                 - N/D                                        
DEFPO311 EQU   0                                                                
PROPO312 DS    XL1                 - N/D                                        
DEFPO312 EQU   0                                                                
PROPO313 DS    XL1                 - N/D                                        
DEFPO313 EQU   0                                                                
PROPO314 DS    XL1                 - N/D                                        
DEFPO314 EQU   0                                                                
PROPO315 DS    XL1                 - N/D                                        
DEFPO315 EQU   0                                                                
PROPO316 DS    XL1                 - N/D                                        
DEFPO316 EQU   0                                                                
ORDPRFL  EQU   *-ORDPRFD                                                        
                                                                                
***********************************************************************         
* MERROU - MULTIPLE ERRORS ON UPLOAD - DEFINITION                     *         
***********************************************************************         
                                                                                
MERROUD  DSECT                                                                  
MERRTYP  DS    XL1                 TYPE                                         
MERREOT  EQU   0                   - EOT                                        
MERRERR  EQU   C'E'                - ERROR                                      
MERRIDF  DS    CL12                - IDENTIFIER                                 
MERRERD  DS    CL12                - ERROR RELATED DATA                         
MERRMES  DS    CL50                - ERROR MESSAGE                              
MERRNUM  DS    XL2                 - INTERNAL BRA ERROR NUMBER                  
MERRLNQ  EQU   *-MERROUD                                                        
                                                                                
D#ME#ERR EQU   01                                                               
D#ME#IDF EQU   02                                                               
D#ME#ERD EQU   03                                                               
D#ME#MES EQU   04                                                               
D#ME#NUM EQU   05                                                               
                                                                                
***********************************************************************         
* ERROR TABLE - DEFINITION                                            *         
***********************************************************************         
                                                                                
ERRTABD  DSECT                                                                  
ERRMESNM DS    XL2                 MESSAGE                                      
ERRMESDT DS    CL14                MESSAGE DATA                                 
ERRTABL  EQU   *-ERRTABD                                                        
                                                                                
***********************************************************************         
* TIMESHEET LIST AND SEARCH - DEFINITION FOR TSAR BUFFER              *         
***********************************************************************         
                                                                                
TD#TABD  DSECT                                                                  
TD#KEY   DS    0C                  KEY                                          
TD#ULA   DS    0CL14               UNIT LEDGER ACCOUNT OF TIME                  
TD#UNT   DS    CL1                   - USED FOR SEARCH                          
TD#LDG   DS    CL1                                                              
TD#ACC   DS    CL12                                                             
TD#WRKC  DS    CL2                 WORK CODE                                    
TD#ORD#  DS    CL6                 ORDER NUMBER                                 
TD#EST#  DS    CL6                 ESTIMATE NUMBER                              
TD#OFFC  DS    CL2                 OFFICE                                       
TD#DEPT  DS    CL6                 DEPARTMENT                                   
TD#SBDP  DS    CL6                 SUB-DEPARTMENT                               
TD#PERC  DS    CL8                 PERSON CODE ACCOUNTING                       
TD#ENDD  DS    PL3                 PERIOD END DATE                              
TD#TTYE  DS    CL1                 TYPE OF TIME - USED IN SUMMARY               
TD#KY1Q  EQU   *-TD#KEY            KEY LENGTH FOR COMPARE                       
TD#TYP   DS    XL1                 TYPE - WHERE RECORD CAME FROM                
TD#1RAQ  EQU   1                   LINE MANAGER - APPROVER PASS                 
TD#1RQ   EQU   2                   LINE MANAGER                                 
TD#SJ1AQ EQU   3                   CLIENT/1N  - APPROVER PASS                   
TD#SJ1NQ EQU   4                   CLIENT/1N                                    
TD#SEQ   DS    XL3                 SEQUENCE NUMBER TO ENSURE UNIQUENESS         
TD#KYLNQ EQU   *-TD#KEY            KEY LENGTH FOR TSAR CALL                     
TD#PNUM  DS    XL1                 PERIOD NUMBER                                
TD#STAD  DS    PL3                 PERIOD START DATE                            
TD#HOUR  DS    PL4                 HOURS                                        
TD#CLIHR DS    PL4                 CLIENT RELATED HOURS                         
TD#MATRS DS    PL6                 MATERIALS USED                               
TD#STTV  DS    XL1                 STATUS TO VIEWER                             
TD#STTS  DS    XL1                 STATUS TO TIMESHEET                          
TD#LN1Q  EQU   *-TD#TABD                                                        
TD#CLINM DS    CL36                CLIENT NAME OR NON CLIENT NAME               
TD#PRDNM DS    CL36                PRODUCT NAME                                 
TD#JOBNM DS    CL36                JOB NAME                                     
TD#JOBLK DS    CL1                 JOB LOCKED                                   
TD#JOBCL DS    CL1                 JOB CLOSED                                   
TD#TIMAC DS    CL14                TIMEL ACCOUNT CODE 1N OR SJ                  
TD#TSKNM DS    CL15                TASK/WORKCODE DESCRIPTION                    
TD#TSKCD DS    CL2                 TASK/WORKCODE CODE                           
TD#ORD#2 DS    CL6                 ORDER NUMBER                                 
TD#ORDNM DS    CL100               ORDER NAME                                   
TD#EST#2 DS    CL6                 ESTIMATE NUMBER GLOBAL                       
TD#EST#L DS    XL1                 ESTIMATE NUMBER LOCAL                        
TD#ESTNM DS    CL50                ESTIMATE NAME                                
TD#INTRF DS    CL12                INTERNAL REFERENCE                           
TD#OFFNM DS    CL36                OFFICE NAME                                  
TD#DEPNM DS    CL36                DEPARTMENT NAME                              
TD#SDPNM DS    CL36                SUB-DEPARTMENT NAME                          
TD#NARR  DS    CL(L'TIMNARR)       NARRATIVE                                    
TD#LMPIN DS    XL2                 LINE MANAGER PIN (BINARY PID)                
TD#LMPID DS    CL8                 LINE MANAGER PID                             
TD#LMFNM DS    CL16                LINE MANAGER FIRST NAME                      
TD#LMMNM DS    CL16                LINE MANAGER MIDDLE NAME                     
TD#LMSNM DS    CL58                LINE MANAGER LAST NAME                       
TD#LMEML DS    CL52                LINE MANAGER EMAIL ADDRESS                   
TD#TTYPE DS    CL1                 TYPE OF TIME                                 
TD#LENQ  EQU   *-TD#TABD                                                        
                                                                                
***********************************************************************         
* APPROVER TABLE - DEFINITION                                         *         
***********************************************************************         
                                                                                
APPTABD  DSECT                                                                  
APPRLN   DS    XL1                 LENGTH OF ENTRY                              
APPRTYP  DS    XL1                 TYPE                                         
APPRTCLI EQU   X'01'               - CLIENT LEVEL 1                             
APPRTCL2 EQU   X'02'               - CLIENT LEVEL 2                             
APPRTCL3 EQU   X'03'               - CLIENT LEVEL 3                             
APPRTMAN EQU   X'11'               - LINE MANAGER LEVEL 1                       
APPRTMA2 EQU   X'12'               - LINE MANAGER LEVEL 2                       
APPRTMA3 EQU   X'13'               - LINE MANAGER LEVEL 3                       
APPRTFIN EQU   X'21'               - FINANCE LEVEL 1                            
APPRPID  DS    XL2                 - PID OF APPROVER                            
APPRNTFY DS    CL1                 - NOTIFY                                     
APPRAST  DS    XL1                 - APPROVAL STATUS (X'80' APPROVED)           
APPRTOKN DS    CL8                 - TOKEN                                      
APPKLNQ  EQU   *-APPTABD                                                        
APPROFFC DS    CL2                 - SJ OFFICE                                  
APPRULA  DS    0CL14               - ACCOUNT THEY ARE APPROVING                 
APPRUNT  DS    CL1                 - UNIT                                       
APPRLDG  DS    CL1                 - LEDGER                                     
APPRACT  DS    CL12                - ACCOUNT                                    
APPRCLNM DS    CL36                - ACCOUNT NAME - CLIENT OR 1N NAME           
APPROFNM DS    CL36                - OFFICE NAME                                
APPCLNQ  EQU   *-APPTABD                                                        
APPRPRNM DS    CL36                - ACCOUNT NAME - PRODUCT                     
APPPLNQ  EQU   *-APPTABD                                                        
APPRJBNM DS    CL36                - ACCOUNT NAME - JOB                         
APPRMED  DS    CL1                 - MEDIA CODE - JOB                           
APPRMDNM DS    CL36                - MEDIA NAME - JOB                           
APPJLNQ  EQU   *-APPTABD                                                        
                                                                                
***********************************************************************         
* I/O COMMAND TABLE                                                   *         
***********************************************************************         
                                                                                
CMDTABD  DSECT                     COVERS I/O COMMAND TABLES                    
CMDFILT  DS    XL1                 FILE TYPE                                    
         DS    XL1                 N/D                                          
CMDTABL  DS    XL2                 TABLE LENGTH                                 
CMDNTRY  DS    0X                  COVERS I/O COMMAND TABLE ENTRY               
CMDNAME  DS    CL7                 COMMAND NAME                                 
CMDNUM   DS    XL1                 COMMAND NUMBER (SEE IOCMNDS)                 
CMDINDS  DS    XL1                 COMMAND INDICATORS - 1                       
CMDIDARQ EQU   X'80'               DISK ADDRESS REQUIRED FOR I/O                
CMDIDAXC EQU   X'40'               CLEAR DISK ADDRESS BEFORE I/O                
CMDIDADD EQU   X'20'               DISK ADDRESS RETURNED BY I/O                 
CMDINDS2 DS    XL1                 COMMAND INDICATORS - 2                       
CMDNTRYL EQU   *-CMDNTRY                                                        
                                                                                
***********************************************************************         
* SYSTEM SWITCH TABLE (LOCATED AT ASSWTAB)                            *         
***********************************************************************         
         SPACE 1                                                                
SYSSWTAB DSECT                     ** SYSTEM SWITCH TABLE **                    
SYSSWSYS DS    XL1                 SE NUMBER                                    
SYSSWSOV DS    XL1                 SYSTEM CALLOV NUMBER                         
SYSSWAGB DS    XL1                 AGENCY BINARY VALUE                          
SYSSWACS DS    XL4                 LIMIT ACCESS VALUE 1                         
SYSSWAC2 DS    XL4                 LIMIT ACCESS VALUE 2                         
SYSSINDS DS    XL1                 INDICATORS                                   
SYSSIOPN EQU   X'80'               OFFLINE - SYSTEM IS ALREADY OPEN             
SYSSWLEN EQU   *-SYSSWTAB                                                       
SYSSWMAX EQU   8                   MAXIMUM NUMBER OF ENTRIES IN TABLE           
         EJECT                                                                  
***********************************************************************         
* XDATA SEARCH TABLE DSECT                                            *         
***********************************************************************         
         SPACE 1                                                                
SRCXDD   DSECT                     XDATA SEARCH TABLE                           
SRCXDSTT DS    XL1                 DESCRIBES HOW TO BUILD KEY                   
SRCXDOFF EQU   X'80'               OFFICE                                       
SRCXDOTY EQU   X'40'               ORDER TYPE                                   
SRCXDCLI EQU   X'20'               CLIENT                                       
SRCXDETY EQU   X'10'               EXPENDITURE TYPE                             
SRCXDWCD EQU   X'08'               WORKCODE                                     
SRCXDMED EQU   X'04'               MEDIA CODE                                   
                                                                                
***********************************************************************         
* SCREEN AND SAVED STORAGE WITHIN TWA                                 *         
***********************************************************************         
                                                                                
       ++INCLUDE FATWA                                                          
       ++INCLUDE ACBRAFFD                                                       
         ORG   TWAUSER                                                          
TWAIND1  DS    XL1                                                              
TWAIINIT EQU   X'80'               SAVED STORAGE HAS BEEN INITIALISED           
         ORG   TWAD+2304                                                        
FABLK    DS    XL(FALINKDL)        BLOCK FOR FALINK                             
FPARMS   DS    0F                  RETURN PARAMETERS FROM GETDATA               
FPACODE  DS    F                   A(HEADER/DATA CODE)                          
FPADATA  DS    F                   A(DATA)                                      
FPLDATA  DS    F                   L'DATA                                       
         DS    3F                  N/D                                          
FAMSGBLK DS    CL(FAMSGDL)         BLOCK FOR FALINK ERROR MESSAGES              
FACON    DS    CL(L'FALCON)        BLOCK FOR FALINK CONTROL FIELD               
                                                                                
SVCTRL   DS    XL1                 ** SAVED CONTROLLER TYPE **                  
SVCDDLQ  EQU   1                   DDLINK LAST USED                             
SVCFALQ  EQU   2                   FALINK LAST USED                             
                                                                                
SVXFROV  DS    XL1                 OVERLAY FOR XFRCTL RETURN                    
SVRESUME DS    XL1                 GLOBBER RETURN IF NON-ZERO                   
SVREASON DS    XL1                 REASON FOR GLOBBER EXIT                      
                                                                                
         DS    0F                                                               
         DS    8A                                                               
                                                                                
SVOLAY   DS    XL1                                                              
         DS    XL3                 N/D                                          
                                                                                
TODAYF   DS    CL6                 TODAY'S DATE YYMMDD                          
TODAYB   DS    XL3                 TODAY'S DATE BINARY                          
TODAYC   DS    XL2                 TODAY'S DATE COMPRESSED                      
TODAYP   DS    PL3                 TODAY'S DATE PWOS                            
         ORG   TODAYP                                                           
TODAYPY  DS    XL1                 TODAY'S YEAR PWOS X'YY'                      
TODAYPM  DS    XL1                 TODAY'S MONTH PWOS X'MM'                     
TODAYPD  DS    XL1                 TODAY'S DAY PWOS X'DD'                       
                                                                                
         DS    XL1075              SPARE                                        
                                                                                
*                                                                               
***********************************************************************         
* NEXT DECLARATIVE SOFTLY DEFINES REMAINING SAVED W/S IN TWA          *         
* IF YOU OVERSTEP ABOVE, FEAR NOT - THE ASSEMBLER WILL SHOUT          *         
***********************************************************************         
         DS    XL((TWANOGO-SVXTRAS)-(*-TWAD))                                   
                                                                                
SVXTRA   DS    0X                  EXTRA SAVED STORAGE                          
LIMACBLK DS    XL(ONEK)            LIMACC BLOCK                                 
SECBLK   DS    XL(ONEK)            SECRET BLOCK                                 
SVSERVER DS    XL(7*ONEK)          SERVER SAVE AREA                             
SVDDLINK DS    XL(LS_LNQ)          DDLINK SAVED STORAGE                         
SVFALINK DS    XL(2*ONEK)          FALINK SAVED STORAGE                         
SVXTRAS  EQU   *-SVXTRA                                                         
                                                                                
***********************************************************************         
* DDLINK MAP EQUATES                                                  *         
***********************************************************************         
                                                                                
***********************************************************************         
* A#XXX DOWNLOAD REQUEST (INPUT) MAP NUMBERS                          *         
*                                                                     *         
* R#XXX DOWNLOAD RETURN (OUTPUT) MAP NUMBERS                          *         
*   ONE PER RETURN (OUTPUT) MAP                                       *         
*                                                                     *         
* E#XXX DOWNLOAD RETURN RECORD NUMBERS                                *         
*   ONE PER RECORD RETURNED IN DOWNLOAD                               *         
***********************************************************************         
                                                                                
A#INIT   EQU   X'0001'             Order initial call                           
R#INIT   EQU   A#INIT                                                           
E#INIT   EQU   A#INIT                                                           
                                                                                
A#ODIS   EQU   X'0002'             Order display call                           
R#ODIS   EQU   A#ODIS                                                           
E#ODIS   EQU   A#ODIS                                                           
                                                                                
A#GRPL   EQU   X'0003'             Group list list                              
                                                                                
A#PRAC   EQU   X'0004'             Person add/delete to job upload              
R#PRAC   EQU   A#PRAC                                                           
E#PRAC   EQU   A#PRAC                                                           
                                                                                
A#TLUPL  EQU   X'0005'             Time line upload                             
R#TLUPL  EQU   A#TLUPL             (return)                                     
                                                                                
A#ETYL   EQU   X'0006'             Expenditure type download                    
R#ETYL   EQU   A#ETYL                                                           
E#ETYL   EQU   A#ETYL                                                           
                                                                                
A#WCOL   EQU   X'0007'             Workcode list download                       
R#WCOL   EQU   A#WCOL                                                           
E#WCOL   EQU   A#WCOL                                                           
                                                                                
A#ESTES  EQU   X'0008'             Est.Electr.Sign.Upload                       
R#ESTES  EQU   A#ESTES             (return)                                     
                                                                                
A#CURR   EQU   X'0009'             Currency download                            
R#CURR   EQU   A#CURR                                                           
E#CURR   EQU   A#CURR                                                           
                                                                                
A#WRKUP  EQU   X'000A'             Worker file upload                           
R#WRKUP  EQU   A#WRKUP                                                          
E#WRKUP  EQU   A#WRKUP                                                          
                                                                                
A#OFFL   EQU   X'000B'             Office list download                         
R#OFFL   EQU   A#OFFL                                                           
E#OFFL   EQU   A#OFFL                                                           
                                                                                
A#OESI   EQU   X'000C'             Order electronic signature upload            
R#OESI   EQU   A#OESI                                                           
E#OESI   EQU   A#OESI                                                           
                                                                                
A#ACCL   EQU   X'000D'             Account list                                 
R#ACCL   EQU   A#ACCL                                                           
E#ACCL   EQU   A#ACCL                                                           
                                                                                
A#SRCH   EQU   X'000E'             Account name search                          
R#SRCH   EQU   A#SRCH                                                           
E#SRCH   EQU   A#SRCH                                                           
                                                                                
                                                                                
A#XDFA   EQU   X'000F'             Extra data download                          
R#XDFA   EQU   A#XDFA                                                           
E#XDFA   EQU   A#XDFA                                                           
                                                                                
A#ODIX   EQU   X'0010'             Order extra data download                    
R#ODIX   EQU   A#ODIX                                                           
E#ODIX   EQU   A#ODIX                                                           
                                                                                
A#ODIT   EQU   X'0011'             Order text/item/article download             
R#ODIT   EQU   A#ODIT                                                           
E#ODIT   EQU   A#ODIT                                                           
                                                                                
A#ITML   EQU   X'0012'             Item list download                           
R#ITML   EQU   A#ITML                                                           
E#ITML   EQU   A#ITML                                                           
*                                                                               
A#ALCK   EQU   X'0013'             Account lock/unlock upload                   
R#ALCK   EQU   A#ALCK                                                           
E#ALCK   EQU   A#ALCK                                                           
*                                                                               
A#APPL   EQU   X'0014'             Invoice/order approver list call             
R#APPL   EQU   A#APPL                                                           
E#APPL   EQU   A#APPL                                                           
                                                                                
A#OAUD   EQU   X'0015'             Order audit call                             
R#OAUD   EQU   A#OAUD                                                           
E#OAUD   EQU   A#OAUD                                                           
                                                                                
A#TINI   EQU   X'0016'             Time initial call                            
R#TINI   EQU   A#TINI                                                           
E#TINI   EQU   A#TINI                                                           
                                                                                
A#CNTUP  EQU   X'0017'             CONTRA CREDITOR UPLOAD SERVER                
R#CNTUP  EQU   A#CNTUP                                                          
E#CNTUP  EQU   A#CNTUP                                                          
                                                                                
A#OVTM   EQU   X'0018'             Overdue time call                            
                                                                                
A#CALD   EQU   X'0019'             Calendar call                                
R#CALD   EQU   A#CALD                                                           
                                                                                
A#NARR   EQU   X'001A'             Narrative call                               
R#NARR   EQU   A#NARR                                                           
E#NARR   EQU   A#NARR                                                           
                                                                                
A#TIML   EQU   X'001B'             Timesheet list call                          
R#TIML   EQU   A#TIML                                                           
E#TIML   EQU   A#TIML                                                           
                                                                                
A#TSTL   EQU   X'001C'             Timesheet search call                        
R#TSTL   EQU   A#TSTL                                                           
E#TSTL   EQU   A#TSTL                                                           
                                                                                
A#TSUM   EQU   X'001D'             Timesheet summary call                       
R#TSUM   EQU   A#TSUM                                                           
E#TSUM   EQU   A#TSUM                                                           
                                                                                
A#TSAT   EQU   X'001E'             Timesheet audit                              
R#TSAT   EQU   A#TSAT                                                           
E#TSAT   EQU   A#TSAT                                                           
                                                                                
A#UFDL   EQU   X'001F'             User fields download                         
R#UFDL   EQU   A#UFDL                                                           
E#UFDL   EQU   A#UFDL                                                           
                                                                                
A#ADTL   EQU   X'0020'             Account detail call                          
R#ADTL   EQU   A#ADTL                                                           
E#ADTL   EQU   A#ADTL                                                           
                                                                                
A#CLID   EQU   X'0021'             Claim initial call                           
R#CLID   EQU   A#CLID                                                           
E#CLID   EQU   A#CLID                                                           
                                                                                
A#CLLD   EQU   X'0022'             Claim list call                              
R#CLLD   EQU   A#CLLD                                                           
E#CLLD   EQU   A#CLLD                                                           
                                                                                
A#CMCD   EQU   X'0023'             Claim mileage calculation call               
R#CMCD   EQU   A#CMCD                                                           
E#CMCD   EQU   A#CMCD                                                           
                                                                                
A#CLSD   EQU   X'0024'             Claim search call                            
R#CLSD   EQU   A#CLSD                                                           
E#CLSD   EQU   A#CLSD                                                           
                                                                                
A#MOAD   EQU   X'0025'             MOA download call                            
R#MOAD   EQU   A#MOAD                                                           
E#MOAD   EQU   A#MOAD                                                           
                                                                                
A#CLAD   EQU   X'0028'             Claim audit call                             
R#CLAD   EQU   A#CLAD                                                           
E#CLAD   EQU   A#CLAD                                                           
                                                                                
A#FNVD   EQU   X'002B'             Filter name download                         
R#FNVD   EQU   A#FNVD                                                           
E#FNVD   EQU   A#FNVD                                                           
                                                                                
A#JLSD   EQU   X'002C'             Job list/search download                     
R#JLSD   EQU   A#JLSD                                                           
E#JLSD   EQU   A#JLSD                                                           
                                                                                
A#TEAP   EQU   X'002E'             Email approver download                      
R#TEAP   EQU   A#TEAP                                                           
E#TEAP   EQU   A#TEAP                                                           
                                                                                
A#MEDC   EQU   X'002F'             Media code download                          
R#MEDC   EQU   A#MEDC                                                           
E#MEDC   EQU   A#MEDC                                                           
                                                                                
A#EIFA   EQU   X'0030'             Estimate initial for add call                
R#EIFA   EQU   A#EIFA                                                           
E#EIFA   EQU   A#EIFA                                                           
                                                                                
A#EMUP   EQU   X'0031'             Estimate upload                              
R#EMUP   EQU   A#EMUP                                                           
E#EMUP   EQU   A#EMUP                                                           
                                                                                
A#ELIS   EQU   X'0032'             Estimate list call                           
R#ELIS   EQU   A#ELIS                                                           
E#ELIS   EQU   A#ELIS                                                           
                                                                                
A#EDIS   EQU   X'0033'             Estimate display call                        
R#EDIS   EQU   A#EDIS                                                           
E#EDIS   EQU   A#EDIS                                                           
                                                                                
A#ESCH   EQU   X'0034'             Scheme list download                         
R#ESCH   EQU   A#ESCH                                                           
E#ESCH   EQU   A#ESCH                                                           
                                                                                
A#EINI   EQU   X'0035'             Estimate initial download                    
R#EINI   EQU   A#EINI                                                           
E#EINI   EQU   A#EINI                                                           
                                                                                
A#JINI   EQU   X'0036'             Jobs initial call                            
R#JINI   EQU   A#JINI                                                           
E#JINI   EQU   A#JINI                                                           
                                                                                
A#AALL   EQU   X'0037'             Add account to limit list call               
R#AALL   EQU   A#AALL                                                           
E#AALL   EQU   A#AALL                                                           
                                                                                
A#ESRC   EQU   X'0038'             Estimate search call                         
R#ESRC   EQU   A#ESRC                                                           
E#ESRC   EQU   A#ESRC                                                           
                                                                                
A#VCDL   EQU   X'003A'             Vat code list call                           
R#VCDL   EQU   A#VCDL                                                           
E#VCDL   EQU   A#VCDL                                                           
                                                                                
A#EAPP   EQU   X'003B'             Estimate approvers download call             
R#EAPP   EQU   A#EAPP                                                           
E#EAPP   EQU   A#EAPP                                                           
                                                                                
A#REFO   EQU   X'003C'             Report format code download                  
R#REFO   EQU   A#REFO                                                           
E#REFO   EQU   A#REFO                                                           
*                                                                               
A#IAIN   EQU   X'0040'             Invoices initial call                        
R#IAIN   EQU   A#IAIN                                                           
E#IAIN   EQU   A#IAIN                                                           
*                                                                               
A#FUMDL  EQU   X'0041'             CSV File uploads available                   
R#FUMDL  EQU   A#FUMDL                                                          
E#FUMDL  EQU   A#FUMDL                                                          
*                                                                               
A#ESAUD  EQU   X'0042'             Estimate audit call                          
R#ESAUD  EQU   A#ESAUD                                                          
E#ESAUD  EQU   A#ESAUD                                                          
*                                                                               
A#IALI   EQU   X'0043'             Invoices list call                           
R#IALI   EQU   A#IALI                                                           
E#IALI   EQU   A#IALI                                                           
*                                                                               
A#IASR   EQU   X'0044'             Invoices search call                         
R#IASR   EQU   A#IASR                                                           
E#IASR   EQU   A#IASR                                                           
*                                                                               
A#QRLL   EQU   X'0045'             Quick reports initial call                   
R#QRLL   EQU   A#QRLL                                                           
E#QRLL   EQU   A#QRLL                                                           
*                                                                               
A#GINI   EQU   X'0046'             Brandocean initial call                      
R#GINI   EQU   A#GINI                                                           
E#GINI   EQU   A#GINI                                                           
*                                                                               
A#JAUD   EQU   X'0047'             Job audit call                               
R#JAUD   EQU   A#JAUD                                                           
E#JAUD   EQU   A#JAUD                                                           
*                                                                               
A#EROW   EQU   X'0048'             Estimate row copy validation                 
R#EROW   EQU   A#EROW                                                           
E#EROW   EQU   A#EROW                                                           
*                                                                               
A#CSPS   EQU   X'0049'             Security person code download                
R#CSPS   EQU   A#CSPS                                                           
E#CSPS   EQU   A#CSPS                                                           
*                                                                               
A#JAPP   EQU   X'004A'             Job approver download                        
R#JAPP   EQU   A#JAPP                                                           
E#JAPP   EQU   A#JAPP                                                           
*                                                                               
A#OUPL   EQU   X'004B'             New order upload                             
R#OUPL   EQU   A#OUPL                                                           
E#OUPL   EQU   A#OUPL                                                           
*                                                                               
A#RSTDL  EQU   X'004C'             RESOURCES STATUS REPORT/SEARCH DL            
R#RSTDL  EQU   A#RSTDL                                                          
E#RSTDL  EQU   A#RSTDL                                                          
*                                                                               
A#RSRDL  EQU   X'004D'             RESOURCES SEARCH DOWNLOAD                    
R#RSRDL  EQU   A#RSRDL                                                          
E#RSRDL  EQU   A#RSRDL                                                          
*                                                                               
A#RMYDL  EQU   X'0051'             RESOURCES MY TASKS DOWNLOAD                  
R#RMYDL  EQU   A#RMYDL                                                          
E#RMYDL  EQU   A#RMYDL                                                          
*                                                                               
A#RDEDL  EQU   X'0052'             RESOURCES DETAIL DOWNLOAD                    
R#RDEDL  EQU   A#RDEDL                                                          
E#RDEDL  EQU   A#RDEDL                                                          
*                                                                               
A#RAUDL  EQU   X'0053'             RESOURCES AUDIT DOWNLOAD                     
R#RAUDL  EQU   A#RAUDL                                                          
E#RAUDL  EQU   A#RAUDL                                                          
*                                                                               
A#RWKUP  EQU   X'0054'             RESOURCES WORK UPLOAD                        
R#RWKUP  EQU   A#RWKUP                                                          
E#RWKUP  EQU   A#RWKUP                                                          
*                                                                               
A#TMRLDL EQU   X'0055'             TEAM/ROLE DOWNLOAD                           
R#TEAMDL EQU   A#TMRLDL                                                         
R#ROLEDL EQU   X'0056'                                                          
E#TMRLDL EQU   A#TMRLDL                                                         
*                                                                               
A#KSTMDL EQU   X'0057'             KEYSTAGE/TEMPLATE DOWNLOAD                   
R#KSTGDL EQU   A#KSTMDL                                                         
R#TEMPDL EQU   X'0058'                                                          
E#KSTMDL EQU   A#KSTMDL                                                         
*                                                                               
A#OUTUP  EQU   X'0059'             OUT OF OFFICE UPLOAD - ITEM                  
R#OUTUP  EQU   A#OUTUP                                                          
E#OUTUP  EQU   A#OUTUP                                                          
*                                                                               
A#OUTDL  EQU   X'005A'             OUT OF OFFICE DOWNLOAD                       
R#OUTDL  EQU   A#OUTDL                                                          
E#OUTDL  EQU   A#OUTDL                                                          
*                                                                               
A#CAMDL  EQU   X'005B'             CAMPAIGN DOWNLOAD                            
R#CAMDL  EQU   A#CAMDL                                                          
E#CAMDL  EQU   A#CAMDL                                                          
*                                                                               
A#OCDL   EQU   X'005C'             COMBINED ORDER DOWNLOAD                      
A#OCID   EQU   X'005D'                                                          
A#OCIT   EQU   X'005E'                                                          
* SEE A#OCPI   X'0068'                                                          
R#OCDL   EQU   A#OCDL                                                           
E#OCDL   EQU   A#OCDL                                                           
*                                                                               
A#OUTHD  EQU   X'005F'             OUT OF OFFICE UPLOAD - HEADER                
R#OUTHD  EQU   A#OUTHD                                                          
E#OUTHD  EQU   A#OUTHD                                                          
*                                                                               
A#OUTTR  EQU   X'0060'             OUT OF OFFICE UPLOAD - TRAILER               
R#OUTTR  EQU   A#OUTTR                                                          
E#OUTTR  EQU   A#OUTTR                                                          
*                                                                               
A#TIMDIS EQU   X'0061'             TIMESHEET DISPLAY (NEW - BIMONTHLY)          
R#TIMHDR EQU   A#TIMDIS                                                         
R#TIMTIM EQU   X'0062'                                                          
E#TIMDIS EQU   A#TIMDIS                                                         
*                                                                               
A#HISSAL EQU   X'0064'             HISTORY/SALARY UPLOAD                        
R#HSLHDR EQU   A#HISSAL                                                         
R#HSLELE EQU   X'0065'                                                          
R#HSLTRL EQU   X'0066'                                                          
E#HISSAL EQU   A#HISSAL                                                         
*                                                                               
A#IAUDL  EQU   X'0067'             INVOICES - AUDIT DOWNLOAD                    
R#IAUDL  EQU   A#IAUDL                                                          
E#IAUDL  EQU   A#IAUDL                                                          
*                                                                               
A#HRRAT  EQU   X'0068'             HOURLY RATES                                 
R#HRRAT  EQU   A#HRRAT                                                          
E#HRRAT  EQU   A#HRRAT                                                          
*                                                                               
A#SMPW   EQU   X'0069'             SEND MAIL FOR PASSWORD REQUEST               
R#SMPW   EQU   A#SMPW                                                           
E#SMPW   EQU   A#SMPW                                                           
*                                                                               
A#IHDR   EQU   X'006B'             INVOICE HEADER                               
A#IITM   EQU   X'006C'             INVOICE ITEM                                 
A#IPOS   EQU   X'006D'             INVOICE POSTING ITEM                         
A#IWC    EQU   X'006E'             INVOICE WORKCODE/NARRATIVE ITEM              
A#ITRL   EQU   X'006F'             INVOICE TRAILER                              
*                                                                               
A#XTLG   EQU   X'0070'             XT LOGON INFO REQUEST                        
R#XTLG   EQU   A#XTLG                                                           
E#XRLG   EQU   A#XTLG                                                           
*                                                                               
* NEW ETYPE DOWNLOAD - USED ONLY IN INVOICE LOG                                 
*                                                                               
A#ETYP   EQU   X'0071'             ETYPE DOWNLOAD REQUEST                       
R#ETYP   EQU   X'0071'             ETYPE HEADER INFO                            
R#ETEX   EQU   X'0072'             ETYPE EXPENSE ACCOUNT INFO                   
R#ETSU   EQU   X'0073'             ETYPE SUPPLIER ACCOUNT INFO                  
R#ETWC   EQU   X'0074'             ETYPE WORK CODE INFO                         
*&&US                                                                           
R#ETPR   EQU   X'0075'             ETYPE WORK CODE INFO                         
*&&                                                                             
*                                                                               
A#POHD   EQU   X'0075'             SALARY UPLOAD HEADER                         
A#PITM   EQU   X'0076'             SALARY UPLOAD POSTING ITEM                   
A#PWKC   EQU   X'0077'             SALARY UPLOAD WORKCODE                       
A#POTL   EQU   X'0078'             SALARY UPLOAD TRAILER                        
A#ACCU   EQU   X'007A'             ACCOUNT/CLIENT/PROD/JOB UPLOAD               
A#MEDU   EQU   X'007B'             MEDIA UPLOAD                                 
A#ATRL   EQU   X'007C'             ACCOUNT UPLOAD TRAILER RECORD                
*                                                                               
* FILE MAINTENANCE                                                              
*                                                                               
A#ACTD   EQU   X'0080'             ACCOUNT/CLIENT/PROD/JOB DISPLAY              
A#ACTS   EQU   X'0081'             ACCOUNT/CLIENT/PROD/JOB LIST/SEARCH          
A#ACTU   EQU   X'0082'             ACCOUNT/CLIENT/PROD/JOB UPLOAD               
*                                                                               
A#PSEC   EQU   X'0084'             PERSON SECURITY DOWNLOAD                     
A#PTIM   EQU   X'0085'             PERSON TIMESHEET DOWNLOAD                    
A#PCRD   EQU   X'0086'             PERSON CREDITOR DOWNLOAD                     
A#PACCS  EQU   X'0087'             PERSON ACCESS DOWNLOAD                       
A#PAPPR  EQU   X'0088'             PERSON APPROVER DOWNLOAD                     
A#PCLRL  EQU   X'0089'             PERSON CLIENT ROLES DOWNLOAD                 
*                                                                               
A#PLST   EQU   X'008A'             PERSON LIST DOWNLOAD                         
*                                                                               
A#PAUD   EQU   X'008B'             PERSON AUDIT DOWNLOAD                        
A#LINM   EQU   X'008C'             LINE MANAGER DOWNLOAD                        
*                                                                               
A#5PEM   EQU   X'008F'             BACS EMAIL STATUS UPLOAD                     
*                                                                               
*  NEW CLAIMS REQUESTS                                                          
*                                                                               
A#XHDR   EQU   X'0090'             UPLOAD EXPENSE HEADER                        
A#XITM   EQU   X'0091'             UPLOAD EXPENSE ITEM                          
A#XXDT   EQU   X'0092'             UPLOAD EXPENSE ITEM XDATA                    
A#XTRL   EQU   X'0093'             UPLOAD EXPENSE TRAILER                       
*                                                                               
A#XDIS   EQU   X'0095'             DOWNLOAD EXPENSE REQUEST                     
R#XDHDR  EQU   X'0095'             DOWNLOAD EXPENSE HEADER                      
R#XDITM  EQU   X'0096'             DOWNLOAD EXPENSE ITEM                        
R#XDXDT  EQU   X'0097'             DOWNLOAD EXPENSE ITEM XDATA                  
R#XDTRL  EQU   X'0098'             DOWNLOAD EXPENSE TRAILER                     
*                                                                               
* TIME UPLOAD                                                                   
*                                                                               
A#THDR   EQU   X'009A'             UPLOAD TIME HEADER                           
A#TTIM   EQU   X'009B'             UPLOAD TIME LINE                             
A#TMAT   EQU   X'009C'             UPLOAD MATERIALS LINE                        
A#TDNR   EQU   X'009D'             UPLOAD TIME DAY NARRATIVE                    
A#TTRL   EQU   X'009F'             UPLOAD TIME TRAILER                          
*                                                                               
* FILE MAINTENANCE                                                              
*                                                                               
A#PHDR   EQU   X'00A0'             PERSON HEADER - UPLOAD                       
A#PCLI   EQU   X'00A1'             PERSON CLIENT ACCESS                         
A#PMED   EQU   X'00A2'             PERSON MEDIA ACCESS                          
A#PEXP   EQU   X'00A3'             PERSON EXPENDITURE TYPE ACCESS               
A#PNCL   EQU   X'00A4'             PERSON NON CLIENT ACCESS                     
A#PSTF   EQU   X'00A5'             PERSON STAFF ACCOUNT ACCESS                  
A#PWC    EQU   X'00A6'             PERSON WORK CODE ACCESS                      
A#PREP   EQU   X'00A7'             PERSON REPORT FORMAT ACCESS                  
A#PESCH  EQU   X'00A8'             PERSON SCHEME ACCESS                         
A#PSUP   EQU   X'00A9'             PERSON SUPPLIER ACCESS                       
A#PGRP   EQU   X'00AA'             PERSON GROUP LIST ACCESS                     
A#PGLOAP EQU   X'00B0'             PERSON GLOBAL APPROVER                       
A#PCLIAP EQU   X'00B1'             PERSON CLIENT APPROVER                       
A#PNCLAP EQU   X'00B2'             PERSON NON CLIENT APPROVER                   
A#PSTFAP EQU   X'00B3'             PERSON STAFF ACCOUNTS APPROVER               
A#PI_OAP EQU   X'00B4'             PERSON INVOICE/ORDERS APPROVER               
A#PBUAP  EQU   X'00B5'             PERSON BACK UP APPROVER                      
A#PROL   EQU   X'00B6'             PERSON ROLE UPLOAD                           
A#PTRL   EQU   X'00BF'             PERSON TRAILER                               
                                                                                
A#GRPHDR EQU   X'00C0'             GROUP LIST HEADER - UPLOAD                   
*                                                                               
A#STUL   EQU   X'00C2'             STUDIO LIST DOWNLOAD                         
R#STUL   EQU   A#STUL                                                           
E#STUL   EQU   A#STUL                                                           
*                                                                               
A#RATUPL EQU   X'00CA'             TMS RATES - UPLOAD                           
*                                                                               
A#PERUPL EQU   X'00CB'             ACCOUNTING PERSON - UPLOAD                   
*                                                                               
* TRANSACTION CALL FOR ALL ACCOUNTS                                             
*                                                                               
A#ACSD   EQU   X'00D0'             ACCOUNTING SUMMARY DOWNLOAD                  
R#ACSD   EQU   A#ACSD               WORKCODE/OFFICE SUMMARY                     
R#ACSDA  EQU   X'00D1'              ACCOUNTING DETAIL                           
R#ACSDE  EQU   X'00D2'              ESTIMATES BY WORKCODE                       
R#ACSDB  EQU   X'00D3'              BILLING DETAIL                              
R#ACJBD  EQU   X'00D4'              JOB DETAIL                                  
R#ACORL  EQU   X'00D6'              ORDER LIST                                  
R#ACESL  EQU   X'00D7'              ESTIMATE LIST                               
*                                                                               
*  ESTIMATE COMBINED DOWNLOAD                                                   
*                                                                               
A#ESCD  EQU   X'00D5'              ESTIMATES COMBINED DOWNLOAD                  
R#ESCD  EQU   A#ESCD                                                            
E#ESCD  EQU   A#ESCD                                                            
*                                                                               
* NEW INVOICE DISPLAY CALLS                                                     
*                                                                               
A#IDIS   EQU   X'00E0'             INVOICE DISPLAY DOWNLOAD                     
R#IDHDR  EQU   A#IDIS              INVOICE DISPLAY HEADER RECORD                
R#IDITM  EQU   X'00E1'             INVOICE DISPLAY ITEM RECORD                  
R#IDWCD  EQU   X'00E2'             INVOICE DISPLAY WORKCODE/NARRATIVE           
R#IDORD  EQU   X'00E3'             INVOICE DISPLAY ORDER RECORD                 
R#IDQER  EQU   X'00E4'             INVOICE DISPLAY QUERY RECORD                 
*                                                                               
* EXPENSE CLAIM MILEAGE RECORDS                                                 
*                                                                               
A#XMIL   EQU   X'00E6'             DOWNLOAD MILEAGE RECORDS REQUEST             
R#XVEHT  EQU   X'00E6'             DOWNLOAD VEHICLE TYPE RECORD                 
R#XFUEL  EQU   X'00E7'             DOWNLOAD FUEL TYPE RECORD                    
R#XENG   EQU   X'00E8'             DOWNLOAD ENGINE SIZE RECORD                  
R#XDIST  EQU   X'00E9'             DOWNLOAD DISTANCE RECORD                     
*                                                                               
* ARTIST FEE AGENT UPLOAD                                                       
*                                                                               
*  AURA ORDER LIST & SEARCH SERVER                                              
*                                                                               
A#AOLD  EQU   X'00EB'              Aura order list download                     
R#AOLD  EQU   A#AOLD                                                            
E#AOLD  EQU   A#AOLD                                                            
*                                                                               
* AURA ORDERS APPROVER LOOKUP + ESTIMATE CHECK                                  
A#ALKE  EQU   X'00EC'              Aura approver lookup and est check           
R#ALKE  EQU   A#ALKE                                                            
E#ALKE  EQU   A#ALKE                                                            
*                                                                               
* AURA 'ORDER UNCOMMITTED AMOUNT'                                               
A#OUCA  EQU   X'00ED'              Aura 'Order uncommitted amount'              
R#OUCA  EQU   A#OUCA                                                            
E#OUCA  EQU   A#OUCA                                                            
* PDFGEN BILL LOOKUP REQUEST                                                    
A#PDFA  EQU   X'00EE'              Pdfgen bill lookup request                   
R#PDFA  EQU   A#PDFA                                                            
E#PDFA  EQU   A#PDFA                                                            
*                                                                               
**********************************************************************          
* SEMAIL EQUATES FOR APPLICATION                                     *          
**********************************************************************          
SE#TIME  EQU   C'T'                TIME APPLICATION                             
SE#ORDS  EQU   C'O'                ORDER APPLICATION                            
SE#ESTS  EQU   C'S'                ESTIMATE APPLICATION                         
SE#EXPS  EQU   C'E'                EXPENSE APPLICATION                          
SE#INVS  EQU   C'I'                INVOICE APPLICATION                          
SE#JOBS  EQU   C'J'                JOB APPLICATION                              
***********************************************************************         
* INCLUDES                                                            *         
***********************************************************************         
                                                                                
       ++INCLUDE DDCOMFACS                                                      
       ++INCLUDE DDCOREQUS                                                      
       ++INCLUDE DDCURTABD                                                      
       ++INCLUDE DDFH                                                           
       ++INCLUDE DDGLOBEQUS                                                     
       ++INCLUDE DDGLVXCTLD                                                     
       ++INCLUDE DDLINKD                                                        
       ++INCLUDE DDMASTD                                                        
       ++INCLUDE DDRUNNERD                                                      
       ++INCLUDE DDTSARD                                                        
       ++INCLUDE SEACSFILE                                                      
WRKIOD   DSECT                                                                  
       ++INCLUDE DDWRKIOD                                                       
       ++INCLUDE FAFACTS                                                        
       ++INCLUDE FAGETTXTD                                                      
       ++INCLUDE FALINKBLK                                                      
LIOBD    DSECT                                                                  
       ++INCLUDE DDLINKIOD                                                      
TRAVD    DSECT                                                                  
       ++INCLUDE METRAVBLK                                                      
                                                                                
MHELD    DSECT                                                                  
         ORG   MHUSER                                                           
MHOLAY   DS    XL1                 OVERLAY OR 0                                 
         DS    XL1                 N/D                                          
MHOUTD   DS    AL2                 A(OUTPUT HEADER-FAMAP) OR 0                  
MHIND1   DS    XL1                 INDICATOR - 1                                
MHIHOOK  EQU   X'80'               CALL OVERLAY ON RECEIPT OF HEADER            
MHIND2   DS    XL1                 INDICATOR - 2                                
                                                                                
MDELD    DSECT                                                                  
         ORG   MDUSER                                                           
MDIND1   DS    XL1                 INDICATOR - 1                                
MDIVAL1  EQU   X'80'               VALIDATION IN ROUTINES 1                     
MDIVAL2  EQU   X'40'               VALIDATION IN ROUTINES 2                     
MDISND1  EQU   X'20'               SEND IN ROUTINES 1                           
MDISND2  EQU   X'10'               SEND IN ROUTINES 2                           
MDIHOOK  EQU   X'08'               CALL OVERLAY ON RECEIPT OF THIS DATA         
MDIND2   DS    XL1                 INDICATOR - 2                                
MDIQVLO  EQU   X'80'               OUTPUT IS IN QVALS                           
MDIMEBO  EQU   X'40'               OUTPUT IS IN MEDBLK                          
MDIQVLI  EQU   X'20'               INPUT IS IN QVALS                            
MDIDMVC  EQU   X'10'               DIRECT MOVE (NO VALIDATION)                  
MDIELEM  EQU   X'08'               OUTPUT IS IN ELEMENT FORMAT                  
MDIACOD  EQU   X'04'               SET ALTERNATE CODE IN MEDBLK ELEMENT         
MDIXNUL  EQU   X'02'               DON'T SET NULL DATA                          
MDIMBEL  EQU   MDIMEBO+MDIELEM     OUTPUT IS IN MEDBLK ELEMENT FORMAT           
MDIND3   DS    XL1                 INDICATOR - 3                                
MDIND4   DS    XL1                 INDICATOR - 4                                
MDVALRX  DS    XL1                 VALIDATE ROUTINE INDEX                       
MDSNDRX  DS    XL1                 SEND ROUTINE INDEX                           
MDODSP   DS    XL2                 OUTPUT DATA DISPLACEMENT                     
MDIDSP   DS    XL2                 INPUT DATA DISPLACEMENT                      
MDTABL   DS    XL1                 L'OUTPUT TABLE ENTRY OR 0                    
MDACODE  DS    0XL(L'MDCODE)       ALTERNATE CODE (MDIACOD ON)                  
MDTMXN   DS    XL2                 MAXIMUM OUTPUT TABLE ENTRIES                 
MDTDATL  DS    XL1                 L'DATA ITEM IN OUTPUT TABLE                  
MDTNULC  DS    XL1                 NULL CHARACTER IN TABLE                      
         DS    XL1                 N/D                                          
                                                                                
*                                                                               
* ACGENFILE                                                                     
* DDCTRYEQUS                                                                    
* ACGOBLOCK                                                                     
* ACGOBBLOCK                                                                    
* ACGOXBLOCK                                                                    
* ACCAPBLOCK                                                                    
* ACBMONVALD                                                                    
* ACCAP30DST                                                                    
* ACGOBLOCK                                                                     
* ACJOBBLOCK                                                                    
* ACJOBBERD                                                                     
* ACDDEQUS                                                                      
* ACTIMETRND                                                                    
* DDPERVALD                                                                     
* FALIMACCD                                                                     
* FASECRETD                                                                     
* FATABSRUN                                                                     
* FAWSSVRD                                                                      
* FASELIST                                                                      
* FAUTL                                                                         
* CTDDEQUS                                                                      
* CTGENFILE                                                                     
* ACGENRAC                                                                      
* ACRAPPERD                                                                     
* ACMSGEQUS                                                                     
* ACOFFALD                                                                      
* DDBUFFD                                                                       
* ACLDCPTRD                                                                     
* DDEUREKAD                                                                     
* DDCUREDITD                                                                    
* ACGETCRLD                                                                     
* ACGETALPD (WITH X_ PREFIX)                                                    
* DDACCFACS (WITH X_ PREFIX)                                                    
* ACGENBATD                                                                     
* ACOPTEQUS                                                                     
*        PRINT OFF                                                              
       ++INCLUDE ACGENFILE                                                      
*&&UK                                                                           
TIMELD   DSECT                                                                  
         ORG   TIMELD+TIMILN2Q                                                  
TIMERTE  DS    PL4                 EURO CHARGE RATE                             
TIMECRTE DS    PL4                 EURO COST RATE                               
TIMB2LNQ EQU   *-TIMELD            LENGTH OF BILLABLE DATA W/EURO INFO          
*&&                                                                             
       ++INCLUDE DDCTRYEQUS                                                     
COBLOCKD DSECT                                                                  
       ++INCLUDE ACCAPBLOCK                                                     
GOBLOCKD DSECT                                                                  
       ++INCLUDE ACGOBLOCK                                                      
GOXBLKD  DSECT                                                                  
       ++INCLUDE ACGOXBLOCK                                                     
GOBBLKD  DSECT                                                                  
       ++INCLUDE ACGOBBLOCK                                                     
JBLOCKD  DSECT                                                                  
       ++INCLUDE ACJOBBLOCK                                                     
       ++INCLUDE ACJOBBERD                                                      
*PREFIX=X_                                                                      
       ++INCLUDE ACGETRATED                                                     
*PREFIX=                                                                        
PRORATAD DSECT                                                                  
       ++INCLUDE ACPRORATAD                                                     
                                                                                
       ++INCLUDE ACDDEQUS                                                       
CPTRD    DSECT                                                                  
       ++INCLUDE ACLDCPTRD                                                      
       ++INCLUDE ACSCRDSECT                                                     
       ++INCLUDE DDPERVALD                                                      
       ++INCLUDE FALIMACCD                                                      
       ++INCLUDE FASECRETD                                                      
       ++INCLUDE FATABSRUN                                                      
       ++INCLUDE FAWSSVRD                                                       
       ++INCLUDE CTDDEQUS                                                       
       ++INCLUDE CTGENFILE                                                      
       ++INCLUDE ACGENRAC                                                       
       ++INCLUDE ACCAP30DST                                                     
       ++INCLUDE ACBMONVALD                                                     
       ++INCLUDE ACRAPPERD                                                      
       ++INCLUDE ACMSGEQUS                                                      
       ++INCLUDE ACRECEQUS                                                      
       ++INCLUDE ACOFFALD                                                       
       ++INCLUDE DDBUFFD                                                        
       ++INCLUDE DDEUREKAD                                                      
       ++INCLUDE ACGETCRLD                                                      
       ++INCLUDE DDCUREDITD                                                     
       ++INCLUDE GEGENXTR                                                       
       ++INCLUDE FAXPEQUS                                                       
       ++INCLUDE FAXTRAINF                                                      
       ++INCLUDE FASELIST                                                       
       ++INCLUDE FAUTL                                                          
       ++INCLUDE ACOPTEQUS                                                      
       ++INCLUDE ACGETURLD                                                      
*PREFIX=X_                                                                      
       ++INCLUDE ACGETALPD                                                      
       ++INCLUDE DDACCFACS                                                      
*PREFIX=                                                                        
       ++INCLUDE ACGENBATD                                                      
*        PRINT ON                                                               
