*          DATA SET ACBUDFCD   AT LEVEL 007 AS OF 08/05/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T610FCD      DATE 08/05/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      3    2    7  A  P H             T        Y              
BUDACCH  DS    XL8                                                              
BUDACC   DS    CL19     3   17   19  A  U N             T        Y              
BUDACCNH DS    XL8                                                              
BUDACCN  DS    CL36     3   41   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P H             T        Y              
BUDCACH  DS    XL8                                                              
BUDCAC   DS    CL22     4   17   22  A  U N             T        Y              
BUDCACNH DS    XL8                                                              
BUDCACN  DS    CL36     4   41   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
BUDFORMH DS    XL8                                                              
BUDFORM  DS    CL15     5   17   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   41    6  A  P H             T        Y              
BUDOFFCH DS    XL8                                                              
BUDOFFC  DS    CL2      5   51    2  A  U N             T        Y              
BUDOFFNH DS    XL8                                                              
BUDOFFN  DS    CL20     5   54   20  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13     6    2   13  A  P H             T        Y              
BUDTYP1H DS    XL8                                                              
BUDTYP1  DS    CL29     6   17   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      6   47    2  A  P H             T        Y              
BUDTYP2H DS    XL8                                                              
BUDTYP2  DS    CL29     6   51   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      7   13    2  A  P H             T        Y              
BUDTYP3H DS    XL8                                                              
BUDTYP3  DS    CL29     7   17   29  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      7   47    2  A  P H             T        Y              
BUDTYP4H DS    XL8                                                              
BUDTYP4  DS    CL29     7   51   29  A  U N             T        Y              
BUDTABFH DS    XL8                                                              
BUDTABF  DS    CL1      8   17    1  A  U N             T        Y              
         DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 480  BYTES                            
