*          DATA SET ACBUDFED   AT LEVEL 004 AS OF 07/09/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T610FED      DATE 07/09/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     4    2   11  A  P H             T        Y              
BTYCODEH DS    CL8                                                              
BTYCODE  DS    CL10     4   17   10  A  U N             T        Y              
BTYCODNH DS    CL8                                                              
BTYCODN  DS    CL10     4   41   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9      5    2    9  A  P H             T        Y              
BTYNAMEH DS    CL8                                                              
BTYNAME  DS    CL36     5   17   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13     6    2   13  A  P H             T        Y              
BTYCOL1H DS    CL8                                                              
BTYCOL1  DS    CL10     6   17   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2      7   13    2  A  P H             T        Y              
BTYCOL2H DS    CL8                                                              
BTYCOL2  DS    CL10     7   17   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
BTYOPTH  DS    CL8                                                              
BTYOPT   DS    CL44     8   17   44  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL17    11   11   17  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6     12    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL19    12   11   19  A  P N             T        Y              
BTYACC1H DS    CL8                                                              
BTYACC1  DS    CL4     13    3    4  A  U N             T        Y              
BTYCAC1H DS    CL8                                                              
BTYCAC1  DS    CL29    13   11   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14    3    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    14   11   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     15    3    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    15   11   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16    3    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    16   11   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     17    3    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    17   11   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18    3    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    18   11   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     19    3    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    19   11   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20    3    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    20   11   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     21    3    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    21   11   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     22    3    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    22   11   29  A  U N             T        Y              
BTYACCLH DS    CL8                                                              
BTYACCL  DS    CL4     23    3    4  A  U N             T        Y              
BTYCACLH DS    CL8                                                              
BTYCACL  DS    CL29    23   11   29  A  U N             T        Y              
BTYTABH  DS    CL8                                                              
BTYTAB   DS    CL1     24    3    1  A  U N             T        Y              
BTYLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
BTYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 888  BYTES                            
