*          DATA SET ACCAPC9D   AT LEVEL 002 AS OF 08/20/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DC9D      DATE 08/20/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
DESDSECH DS    CL8                                                              
DESDSEC  DS    CL3     13    2    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13    6    6  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   13    7  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   21    5  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   26    6  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   33    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   37    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     13   45    4  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   53    6  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    13   62   14  L  P N             T        Y              
DESLIN1H DS    CL8                                                              
DESLIN1  DS    CL2     14    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     14   52    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    14   62   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    15   13   60  A  U N             T        Y              
DESLIN2H DS    CL8                                                              
DESLIN2  DS    CL2     16    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     16   52    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    16   62   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    17   13   60  A  U N             T        Y              
DESLIN3H DS    CL8                                                              
DESLIN3  DS    CL2     18    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     18   52    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    18   62   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    19   13   60  A  U N             T        Y              
DESLIN4H DS    CL8                                                              
DESLIN4  DS    CL2     20    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     20   52    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    20   62   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    21   13   60  A  U N             T        Y              
DESLSTH  DS    CL8                                                              
DESLST   DS    CL2     22    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     22   52    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    22   62   18  A  P N             T        Y              
DESENDH  DS    CL8                                                              
DESEND   DS    CL60    23   13   60  A  U N             T        Y              
DESPFKYH DS    CL8                                                              
DESPFKY  DS    CL78    24    2   78  A  P N             T        Y              
DESLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
DESWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1312 BYTES                            
