*          DATA SET ACCAPC5D   AT LEVEL 002 AS OF 08/20/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DC5D      DATE 08/20/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
BDTDSECH DS    CL8                                                              
BDTDSEC  DS    CL3     13    2    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13    6    6  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   13    7  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   21    5  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   26    6  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   33    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   37    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   43    2  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     13   48    4  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   56    6  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    13   65   14  L  P N             T        Y              
BDTLIN1H DS    CL8                                                              
BDTLIN1  DS    CL2     14    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     14   55    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    14   65   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     15    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     15   55    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    15   65   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     16   55    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    16   65   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     17   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     17   55    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    17   65   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     18   55    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    18   65   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     19   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     19   55    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    19   65   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     20   55    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    20   65   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     21   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     21   55    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    21   65   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     22   55    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    22   65   15  A  U N             T        Y              
BDTLSTH  DS    CL8                                                              
BDTLST   DS    CL2     23    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     23    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     23   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     23   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     23   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     23   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     23   55    9  A  P N             T        Y              
BDTENDH  DS    CL8                                                              
BDTEND   DS    CL15    23   65   15  A  U N             T        Y              
BDTPFKYH DS    CL8                                                              
BDTPFKY  DS    CL78    24    2   78  A  P N             T        Y              
BDTLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
BDTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1800 BYTES                            
