*          DATA SET ACCAPC8D   AT LEVEL 004 AS OF 08/20/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DC8D      DATE 08/20/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
TEPDSECH DS    CL8                                                              
TEPDSEC  DS    CL3     13    2    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13    6    6  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   13    7  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   21    5  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   26    6  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   33    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   37    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   43    2  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     13   48    4  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   56    6  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    13   65   14  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     14    2    4  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     14   13    9  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   48    5  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   56    5  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   65    3  L  P N             T        Y              
TEPLIN1H DS    CL8                                                              
TEPLIN1  DS    CL2     15    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     15    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     15   55    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    15   65   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    16   13   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     17   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   65    2  A  U N             T        Y              
TEPLSTH  DS    CL8                                                              
TEPLST   DS    CL2     18    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     18   55    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    18   65   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    19   13   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     20   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   56    8  A  U N             T        Y              
TEPENDH  DS    CL8                                                              
TEPEND   DS    CL2     20   65    2  A  U N             T        Y              
TEPPFKYH DS    CL8                                                              
TEPPFKY  DS    CL78    24    2   78  A  P N             T        Y              
TEPLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
TEPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 864  BYTES                            
