*          DATA SET ACCAPE8D   AT LEVEL 007 AS OF 07/17/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DE8D      DATE 07/17/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
RTMDETLH DS    CL8                                                              
RTMDETL  DS    CL50     5    2   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  L  P H             T        Y  201         
         DS    CL8                                                              
RTMOFFH  DS    CL8                                                              
RTMOFF   DS    CL2      6   10    2  A  U N             T    I   Y              
RTMOFNMH DS    CL8                                                              
RTMOFNM  DS    CL30     6   18   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  L  P H             T        Y  202         
         DS    CL8                                                              
RTMDEPTH DS    CL8                                                              
RTMDEPT  DS    CL2      7   10    2  A  U N             T        Y              
RTMDPNMH DS    CL8                                                              
RTMDPNM  DS    CL30     7   18   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8    2    6  L  P H             T        Y  203         
         DS    CL8                                                              
RTMSDPTH DS    CL8                                                              
RTMSDPT  DS    CL2      8   10    2  A  U N             T        Y              
RTMSDNMH DS    CL8                                                              
RTMSDNM  DS    CL30     8   18   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      9    2    6  L  P H             T        Y  204         
         DS    CL8                                                              
RTMPERH  DS    CL8                                                              
RTMPER   DS    CL2      9   10    2  A  U N             T        Y              
RTMPENMH DS    CL8                                                              
RTMPENM  DS    CL30     9   18   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  L  P H             T        Y              
RTMTASKH DS    CL8                                                              
RTMTASK  DS    CL3     10   10    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     10   18    7  L  P H             T        Y              
RTMMETHH DS    CL8                                                              
RTMMETH  DS    CL3     10   26    3  A  U N             T        Y              
RTMMTNMH DS    CL8                                                              
RTMMTNM  DS    CL30    10   31   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     12    7    8  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     12   17    8  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     12   28    5  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     12   34    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   38   11  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL11    12   53   11  L  P H             T        Y              
RTMSELH  DS    CL8                                                              
RTMSEL   DS    CL3     13    2    3  A  U N             T        Y              
RTMSTDTH DS    CL8                                                              
RTMSTDT  DS    CL8     13    7    8  A  U N             T        Y              
RTMENDTH DS    CL8                                                              
RTMENDT  DS    CL8     13   17    8  A  U N             T        Y              
RTMPCDEH DS    CL8                                                              
RTMPCDE  DS    CL5     13   28    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   34    1  A  P N             T        Y              
RTMRATEH DS    CL8                                                              
RTMRATE  DS    CL12    13   38   12  A  U N             T        Y              
RTMFROMH DS    CL8                                                              
RTMFROM  DS    CL8     13   53    8  A  P N             T        Y              
RTMLIN1H DS    CL8                                                              
RTMLIN1  DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   28    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   34    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    14   38   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   53    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   28    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   34    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   38   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   53    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   28    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   34    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    16   38   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   53    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   28    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   34    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    17   38   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   53    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   28    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   34    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    18   38   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   53    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   28    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   34    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    19   38   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   53    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   28    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   34    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    20   38   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   53    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   28    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   34    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    21   38   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   53    8  A  P N             T        Y              
RTMENDH  DS    CL8                                                              
RTMEND   DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22    7    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   17    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   28    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   34    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    22   38   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   53    8  A  P N             T        Y              
RTMPFKYH DS    CL8                                                              
RTMPFKY  DS    CL79    24    2   79  A  P H             T        Y              
RTMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
RTMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1640 BYTES                            
