*          DATA SET ACCAPEBD   AT LEVEL 003 AS OF 12/11/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DEBD      DATE 12/11/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
STDMTH1H DS    XL8                                                              
STDMTH1  DS    CL3      6    2    3  L  P H             T        Y              
STDNUM1H DS    XL8                                                              
STDNUM1  DS    CL2      6    6    2  A  P H             T        Y              
STDPER1H DS    XL8                                                              
STDPER1  DS    CL10     6    9   10  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      6   21    6  L  P H             T        Y              
STDMTH2H DS    XL8                                                              
STDMTH2  DS    CL3      6   29    3  L  P H             T        Y              
STDNUM2H DS    XL8                                                              
STDNUM2  DS    CL2      6   33    2  A  P H             T        Y              
STDPER2H DS    XL8                                                              
STDPER2  DS    CL10     6   36   10  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      6   48    6  L  P H             T        Y              
STDMTH3H DS    XL8                                                              
STDMTH3  DS    CL3      6   56    3  L  P H             T        Y              
STDNUM3H DS    XL8                                                              
STDNUM3  DS    CL2      6   60    2  A  P H             T        Y              
STDPER3H DS    XL8                                                              
STDPER3  DS    CL10     6   63   10  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      6   75    6  L  P H             T        Y              
STDCOL1H DS    XL8                                                              
STDCOL1  DS    CL18     7    2   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   21    6  A  U N             T        Y              
STDCOL2H DS    XL8                                                              
STDCOL2  DS    CL18     7   29   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   48    6  A  U N             T        Y              
STDCOL3H DS    XL8                                                              
STDCOL3  DS    CL18     7   56   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   75    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18     8    2   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      8   21    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18     8   29   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      8   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18     8   56   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      8   75    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18     9    2   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      9   21    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18     9   29   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      9   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18     9   56   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      9   75    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    10    2   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     10   21    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    10   29   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     10   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    10   56   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     10   75    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    11    2   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     11   21    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    11   29   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     11   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    11   56   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     11   75    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    12    2   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     12   21    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    12   29   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     12   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    12   56   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     12   75    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    13    2   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     13   21    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    13   29   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     13   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    13   56   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     13   75    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    14    2   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     14   21    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    14   29   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     14   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    14   56   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     14   75    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    15    2   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     15   21    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    15   29   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     15   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    15   56   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     15   75    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    16    2   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     16   21    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    16   29   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     16   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    16   56   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     16   75    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    17    2   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   21    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    17   29   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    17   56   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   75    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    18    2   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   21    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    18   29   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    18   56   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     18   75    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    19    2   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   21    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    19   29   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    19   56   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   75    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    20    2   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   21    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    20   29   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    20   56   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     20   75    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    21    2   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   21    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    21   29   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    21   56   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   75    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    22    2   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   21    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    22   29   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   48    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    22   56   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     22   75    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    23    2   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     23   21    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    23   29   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     23   48    6  A  U N             T        Y              
STDEND3H DS    XL8                                                              
STDEND3  DS    CL18    23   56   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     23   75    6  A  U N             T        Y              
STDEND1H DS    XL8                                                              
STDEND1  DS    CL18    24    2   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     24   21    6  A  U N             T        Y              
STDEND2H DS    XL8                                                              
STDEND2  DS    CL18    24   29   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     24   48    6  A  U N             T        Y              
STDTOTH  DS    XL8                                                              
STDTOT   DS    CL20    24   56   20  A  P N             T        Y              
         DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2312 BYTES                            
