*          DATA SET ACCAPF6D   AT LEVEL 009 AS OF 11/10/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DF6D      DATE 11/10/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL3      6    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      6    7    7  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL11     6   15   11  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL3      6   53    3  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL5      6   59    5  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL9      6   68    9  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
MELSELH  DS    CL8                                                              
MELSEL   DS    CL3      7    2    3  A  U N             T        Y    3         
MELSELX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74     7    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74     8    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74     9    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
MELPFKYH DS    CL8                                                              
MELPFKY  DS    CL78    24    2   78  A  P H             T        Y              
MELLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MELWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1800 BYTES                            
