*          DATA SET ACCAPE1D   AT LEVEL 034 AS OF 12/11/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DE1D      DATE 12/11/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  L  P N             T        Y              
STLYEARH DS    XL8                                                              
STLYEAR  DS    CL4      5   10    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   16    6  L  P N             T        Y  201         
         DS    XL8                                                              
STLOFFH  DS    XL8                                                              
STLOFF   DS    CL2      5   24    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      5   28    4  L  P N             T        Y  202         
         DS    XL8                                                              
STLDEPTH DS    XL8                                                              
STLDEPT  DS    CL2      5   34    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   38    6  L  P N             T        Y  203         
         DS    XL8                                                              
STLSDPTH DS    XL8                                                              
STLSDPT  DS    CL2      5   46    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   50    6  L  P N             T        Y  204         
         DS    XL8                                                              
STLPERH  DS    XL8                                                              
STLPER   DS    CL7      5   58    7  A  U N             T        Y              
STLDAYTH DS    XL8                                                              
STLDAYT  DS    CL6      5   67    6  L  P N             T        Y              
STLDAYH  DS    XL8                                                              
STLDAY   DS    CL4      5   74    4  A  U N             T        Y              
STLACTH  DS    XL8                                                              
STLACT   DS    CL3      7    2    3  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10     7    9   10  L  P H             T        Y  201         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      7   21    9  L  P H             T        Y  202         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   32    6  L  P H             T        Y  203         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     7   44   12  L  P H             T        Y  204         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7   58   10  L  P H             T        Y              
STLDLYH  DS    XL8                                                              
STLDLY   DS    CL8      7   69    8  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
STLSELH  DS    XL8                                                              
STLSEL   DS    CL3      8    2    3  A  U N             T        Y    3         
STLSELX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74     8    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74     9    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y    3         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
STLPFKYH DS    XL8                                                              
STLPFKY  DS    CL70    24    2   70  A  P H             T        Y              
STLTAGH  DS    XL8                                                              
STLTAG   DS    CL1     24   78    1  A  P N             T        Y              
STLLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
STLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1944 BYTES                            
