*          DATA SET ACCAPFFD   AT LEVEL 002 AS OF 12/11/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DFFD      DATE 12/11/98                 
         SPACE 1                                                                
T61DFFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
CONHEADH DS    CL8                                                              
CONHEAD  DS    CL60     1    2   60  L  P N             T        Y              
CONSERVH DS    CL8                                                              
CONSERV  DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      2    2    6  L  P H             T        Y              
CONRECH  DS    CL8                                                              
CONREC   DS    CL8      2   10    8  A  U N             T    I   Y    2         
CONRECX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      2   20    7  L  P H             T        Y              
CONACTH  DS    CL8                                                              
CONACT   DS    CL8      2   28    8  A  U N             T        Y    4         
CONACTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      2   38    3  L  P N             T        Y              
CONKEYH  DS    CL8                                                              
CONKEY   DS    CL34     2   46   34  A  U N             T        Y    6         
CONKEYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      3    2    6  L  P N             T        Y              
CONWHENH DS    CL8                                                              
CONWHEN  DS    CL8      3   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      3   20    7  L  P N             T        Y              
CONOUTH  DS    CL8                                                              
CONOUT   DS    CL8      3   28    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      3   38    5  L  P N             T        Y              
CONDESTH DS    CL8                                                              
CONDEST  DS    CL8      3   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      3   56    7  L  P N             T        Y              
CONOTHH  DS    CL8                                                              
CONOTH   DS    CL13     3   64   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      4    2    7  L  P N             T        Y              
CONOPTH  DS    CL8                                                              
CONOPT   DS    CL65     4   10   65  A  U N             T        Y    9         
CONOPTX  DS    CL8                                                              
CONTAGH  DS    CL8                                                              
CONTAG   DS    CL1      4   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      6   38    7  L  P H             T        Y              
CONLIN1H DS    CL8                                                              
CONLIN1  DS    CL20     8    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     8   23   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25     8   38   25  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL20     9    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     9   23   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25     9   38   25  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    10    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    10   23   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    10   38   25  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    11    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    11   23   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    11   38   25  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    12    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    12   23   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    12   38   25  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    13    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    13   23   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    13   38   25  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    14    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    14   23   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    14   38   25  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    15    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   23   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    15   38   25  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    16    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    16   23   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    16   38   25  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    17    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    17   23   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    17   38   25  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    18    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    18   23   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    18   38   25  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    19    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    19   23   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    19   38   25  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    20    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    20   23   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    20   38   25  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    21    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   23   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    21   38   25  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    22    2   20  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    22   23   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    22   38   25  L  P N             T        Y              
CONPFKYH DS    CL8                                                              
CONPFKY  DS    CL79    24    2   79  A  P N             T        Y              
CONLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CONWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1832 BYTES                            
