*          DATA SET ACCAPCCD   AT LEVEL 015 AS OF 04/02/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DCCD      DATE 04/02/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  L  P H             T        Y              
TLNPERH  DS    XL8                                                              
TLNPER   DS    CL9      5   11    9  A  U H             T    I   Y              
TLNPDESH DS    XL8                                                              
TLNPDES  DS    CL30     5   21   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  L  P H             T        Y  204         
         DS    XL8                                                              
TLNCODEH DS    XL8                                                              
TLNCODE  DS    CL8      6   11    8  A  U H             T        Y              
TLNNAMEH DS    XL8                                                              
TLNNAME  DS    CL30     6   21   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   52    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      7    2    4  L  P H             T        Y              
TLNLN#H  DS    XL8                                                              
TLNLN#   DS    CL5      7    7    5  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL4      8    2    4  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8    7    5  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      8   20    4  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   25    5  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      8   40    4  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   45    5  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      8   58    4  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   64    5  L  P N             T        Y              
TLNDAYH  DS    XL8                                                              
TLNDAY   DS    CL2      9    2    2  A  U N             T        Y              
TLNSWPH  DS    XL8                                                              
TLNSWP   DS    CL11     9    7   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   20    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     9   25   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     9   45   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      9   58    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     9   64   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     10    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    10    7   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   20    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    10   25   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    10   45   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     10   58    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    10   64   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     11    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    11    7   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   20    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    11   25   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    11   45   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   58    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    11   64   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    12    7   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   20    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    12   25   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    12   45   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   58    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    12   64   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     13    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    13    7   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     13   20    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    13   25   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     13   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    13   45   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     13   58    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    13   64   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     14    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    14    7   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     14   20    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    14   25   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     14   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    14   45   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     14   58    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    14   64   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     15    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    15    7   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     15   20    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    15   25   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     15   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    15   45   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     15   58    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    15   64   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    16    7   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   20    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    16   25   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    16   45   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   58    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    16   64   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     17    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    17    7   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     17   20    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    17   25   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     17   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    17   45   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     17   58    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    17   64   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    18    7   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   20    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    18   25   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    18   45   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   58    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    18   64   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     19    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    19    7   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     19   20    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    19   25   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     19   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    19   45   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     19   58    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    19   64   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     20    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    20    7   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   20    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    20   25   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    20   45   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   58    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    20   64   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     21    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    21    7   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     21   20    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    21   25   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     21   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    21   45   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     21   58    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    21   64   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     22    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    22    7   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   20    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    22   25   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    22   45   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   58    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    22   64   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     23    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    23    7   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     23   20    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    23   25   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     23   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    23   45   11  A  U N             T        Y              
TLNDAYLH DS    XL8                                                              
TLNDAYL  DS    CL2     23   58    2  A  U N             T        Y              
TLNSWPLH DS    XL8                                                              
TLNSWPL  DS    CL11    23   64   11  A  U N             T        Y              
TLNPFKYH DS    XL8                                                              
TLNPFKY  DS    CL78    24    2   78  A  P N             T        Y              
TLNLAST  DS    XL1                                                              
         DS    XL2    INDICS=11                                                 
TLNWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2112 BYTES                            
