*          DATA SET ACCAPE7D   AT LEVEL 001 AS OF 04/07/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DE7D      DATE 04/07/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  L  P H             T        Y  201         
         DS    CL8                                                              
OVMOFFH  DS    CL8                                                              
OVMOFF   DS    CL2      6   10    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      6   14    4  L  P H             T        Y  202         
         DS    CL8                                                              
OVMDEPTH DS    CL8                                                              
OVMDEPT  DS    CL6      6   20    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6   28    6  L  P H             T        Y  203         
         DS    CL8                                                              
OVMSDPTH DS    CL8                                                              
OVMSDPT  DS    CL6      6   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6   44    6  L  P H             T        Y              
OVMPERH  DS    CL8                                                              
OVMPER   DS    CL8      6   52    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  L  P N             T        Y              
OVMNAMEH DS    CL8                                                              
OVMNAME  DS    CL36     7   10   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     8    2   10  A  P N             T        Y              
OVMFLT1H DS    CL8                                                              
OVMFLT1  DS    CL1      8   14    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8   17    1  A  P N             T        Y              
OVMFLT2H DS    CL8                                                              
OVMFLT2  DS    CL1      8   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8   23    1  A  P N             T        Y              
OVMFLT3H DS    CL8                                                              
OVMFLT3  DS    CL1      8   26    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8   29    1  A  P N             T        Y              
OVMFLT4H DS    CL8                                                              
OVMFLT4  DS    CL1      8   32    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8   35    1  A  P N             T        Y              
OVMFLT5H DS    CL8                                                              
OVMFLT5  DS    CL1      8   38    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19     9    2   19  L  P N             T        Y              
OVMLOCKH DS    CL8                                                              
OVMLOCK  DS    CL1      9   23    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    11   20   13  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   38    5  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    11   48   15  L  P N             T        Y              
OVMADDLH DS    CL8                                                              
OVMADDL  DS    CL3     12    2    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    12   20   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    12   48   15  A  U N             T        Y              
OVMLIN1H DS    CL8                                                              
OVMLIN1  DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    13   20   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     13   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    13   48   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    14   20   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    14   48   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    15   20   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    15   48   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    16   20   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    16   48   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    17   20   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     17   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    17   48   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    18   20   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    18   48   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    19   20   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     19   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    19   48   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    20   20   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    20   48   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    21   20   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     21   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    21   48   15  A  U N             T        Y              
OVMENDH  DS    CL8                                                              
OVMEND   DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    22   20   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   38    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    22   48   15  A  U N             T        Y              
OVMPFKYH DS    CL8                                                              
OVMPFKY  DS    CL79    24    2   79  A  P H             T        Y              
OVMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
OVMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1232 BYTES                            
