*          DATA SET ACCAPC4D   AT LEVEL 002 AS OF 08/20/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DC4D      DATE 08/20/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
CABDSECH DS    CL8                                                              
CABDSEC  DS    CL3     13    2    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13    6    6  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   13    7  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   21    5  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   26    6  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   33    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   37    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   43    2  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     13   48    4  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   56    6  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    13   65   14  L  P N             T        Y              
CABLIN1H DS    CL8                                                              
CABLIN1  DS    CL2     14    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     14   55    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    14   65   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    15   13   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     16   55    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    16   65   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    17   13   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     18   55    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    18   65   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    19   13   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     20   55    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    20   65   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL60    21   13   60  A  U N             T        Y              
CABLSTH  DS    CL8                                                              
CABLST   DS    CL2     22    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     22   55    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    22   65   15  A  U N             T        Y              
CABENDH  DS    CL8                                                              
CABEND   DS    CL60    23   13   60  A  U N             T        Y              
CABPFKYH DS    CL8                                                              
CABPFKY  DS    CL78    24    2   78  A  P N             T        Y              
CABLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
CABWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1360 BYTES                            
