*          DATA SET ACCAPE4D   AT LEVEL 006 AS OF 11/10/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DE4D      DATE 11/10/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  L  P N             T        Y              
PRLMETHH DS    CL8                                                              
PRLMETH  DS    CL3      6   10    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6   15    6  L  P N             T        Y  201         
         DS    CL8                                                              
PRLOFFH  DS    CL8                                                              
PRLOFF   DS    CL2      6   23    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      6   28    4  L  P N             T        Y  202         
         DS    CL8                                                              
PRLDEPTH DS    CL8                                                              
PRLDEPT  DS    CL6      6   34    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6   42    6  L  P N             T        Y  203         
         DS    CL8                                                              
PRLSDPTH DS    CL8                                                              
PRLSDPT  DS    CL6      6   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      6   58    7  L  P N             T        Y              
PRLFLTH  DS    CL8                                                              
PRLFLT   DS    CL8      6   67    8  A  U N             T        Y    2         
PRLFLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL9      8    9    9  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL9      8   20    9  L  P H             T        Y  201         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   31    7  L  P H             T        Y  202         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     8   40   10  L  P H             T        Y  203         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     8   52   10  L  P H             T        Y  204         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      8   79    1  A  P N             T        Y              
PRLSELH  DS    CL8                                                              
PRLSEL   DS    CL3      9    2    3  A  U N             T        Y    4         
PRLSELX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74     9    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    23    7   74  A  P N             T        Y              
PRLPFKYH DS    CL8                                                              
PRLPFKY  DS    CL75    24    2   75  A  P H             T        Y              
PRLTAGH  DS    CL8                                                              
PRLTAG   DS    CL1     24   78    1  A  P N             T        Y              
PRLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PRLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1928 BYTES                            
