*          DATA SET ACCAPC0D   AT LEVEL 006 AS OF 04/28/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DC0D      DATE 04/28/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
ADDLOCSH DS    CL8                                                              
ADDLOCS  DS    CL42     5   20   42  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9      5   64    9  L  P H             T        Y              
ADDSCRLH DS    CL8                                                              
ADDSCRL  DS    CL4      5   74    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  L  P H             T        Y              
ADDPERH  DS    CL8                                                              
ADDPER   DS    CL9      6   10    9  A  U H             T    I   Y              
ADDPDESH DS    CL8                                                              
ADDPDES  DS    CL30     6   20   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      6   64    3  L  P N             T        Y              
ADDMOAH  DS    CL8                                                              
ADDMOA   DS    CL6      6   72    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  L  P H             T        Y  204         
         DS    CL8                                                              
ADDCODEH DS    CL8                                                              
ADDCODE  DS    CL8      7   10    8  A  U H             T        Y              
ADDNAMEH DS    CL8                                                              
ADDNAME  DS    CL30     7   20   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      7   52    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      7   73    5  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8    2    6  L  P N             T        Y  201         
         DS    CL8                                                              
ADDOFFH  DS    CL8                                                              
ADDOFF   DS    CL2      8   10    2  A  P N             T        Y              
ADDOFNMH DS    CL8                                                              
ADDOFNM  DS    CL20     8   20   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     8   42   10  L  P H             T        Y              
ADDHWRKH DS    CL8                                                              
ADDHWRK  DS    CL7      8   54    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   64    4  L  P N             T        Y              
ADDNTIMH DS    CL8                                                              
ADDNTIM  DS    CL7      8   71    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      9    2    4  L  P N             T        Y  202         
         DS    CL8                                                              
ADDDEPTH DS    CL8                                                              
ADDDEPT  DS    CL6      9   10    6  A  P N             T        Y              
ADDDPNMH DS    CL8                                                              
ADDDPNM  DS    CL20     9   20   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     9   42   10  L  P N             T        Y              
ADDHINPH DS    CL8                                                              
ADDHINP  DS    CL7      9   54    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      9   64    4  L  P N             T        Y              
ADDBTIMH DS    CL8                                                              
ADDBTIM  DS    CL7      9   71    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     10    2    6  L  P N             T        Y  203         
         DS    CL8                                                              
ADDSDPTH DS    CL8                                                              
ADDSDPT  DS    CL6     10   10    6  A  P N             T        Y              
ADDSDNMH DS    CL8                                                              
ADDSDNM  DS    CL20    10   20   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    10   42   10  L  P N             T        Y              
ADDHDIFH DS    CL8                                                              
ADDHDIF  DS    CL7     10   54    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   64    4  L  P N             T        Y              
ADDRTIMH DS    CL8                                                              
ADDRTIM  DS    CL7     10   71    7  A  P N             T        Y              
ADDCUPNH DS    CL8                                                              
ADDCUPN  DS    CL14    11   42   14  L  P N             T        Y              
ADDCUPDH DS    CL8                                                              
ADDCUPD  DS    CL1     11   60    1  A  U N             T        Y              
ADDLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
ADDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 672  BYTES                            
