*          DATA SET ACCAPROTAB AT LEVEL 078 AS OF 07/07/20                      
*                                                                               
* COSTING PROFILE TABLE - COVERED BY COPFTABD                                   
*                                                                               
         DS    0D                                                               
PROFTAB  DS    0CL(COTBLEN)                                                     
*                                                                               
         DC    AL1(CORUN#),X'00'   *RUN                                         
         DC    AL2(AC@P02L-PDSLIST,AC@P02S-PDSLIST,AC@P02M-PDSLIST)             
         DC    X'02',X'00',AL1(CORUNF)                                          
         DC    X'00'                                                            
         DC    A(PRDESC01)                                                      
         DC    Y(CORUN_-COPTIONS),AL1(L'CORUN)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11000000',B'10111111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COSTD#),X'00'   *STD                                         
         DC    AL2(AC@P04L-PDSLIST,AC@P04S-PDSLIST,AC@P04M-PDSLIST)             
         DC    X'02',X'00',AL1(CORUNF)                                          
         DC    X'00'                                                            
         DC    A(PRDESC03)                                                      
         DC    Y(COSTD_-COPTIONS),AL1(L'COSTD)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11000000',B'10111111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COCON#),X'00'   *CON                                         
         DC    AL2(AC@P05L-PDSLIST,AC@P05S-PDSLIST,AC@P05M-PDSLIST)             
         DC    X'04',X'00',AL1(CORUNF)                                          
         DC    X'00'                                                            
         DC    A(PRDESC16)                                                      
         DC    Y(COCON_-COPTIONS),AL1(L'COCON)                                  
         DC    AL1(CODCACQ,COVCACQ)                                             
         DC    B'11000000',B'10111111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COLOK#),X'00'   *LOC                                         
         DC    AL2(AC@P06L-PDSLIST,AC@P06S-PDSLIST,AC@P06M-PDSLIST)             
         DC    X'03',X'00',AL1(CORUNF)                                          
         DC    X'00'                                                            
         DC    A(PRDESC03)                                                      
         DC    Y(COLOK_-COPTIONS),AL1(L'COLOK)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11000000',B'10111111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COINC#),X'00'   *INC                                         
         DC    AL2(AC@P08L-PDSLIST,AC@P08S-PDSLIST,AC@P08M-PDSLIST)             
         DC    X'04',X'00',AL1(CORUNF)                                          
         DC    X'00'                                                            
         DC    A(PRDESC03)                                                      
         DC    Y(COINC_-COPTIONS),AL1(L'COINC)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111110',B'11100000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COEXEC#),X'00'  *EXE                                         
         DC    AL2(AC@P10L-PDSLIST,AC@P10S-PDSLIST,AC@P10M-PDSLIST)             
         DC    X'05',X'00',AL1(CORUNF)                                          
         DC    X'00'                                                            
         DC    A(PRDESC03)                                                      
         DC    Y(COEXEC_-COPTIONS),AL1(L'COEXEC)                                
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111110',B'10000011'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COHRRAT#),X'00'   *HRR                                       
         DC    AL2(AC@P13L-PDSLIST,AC@P13S-PDSLIST,AC@P13M-PDSLIST)             
         DC    X'04',X'00',AL1(CORUNF)                                          
         DC    X'00'                                                            
         DC    A(PRDESC15)                                                      
         DC    Y(COHRRAT_-COPTIONS),AL1(L'COHRRAT)                              
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111110',B'10000001'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COONUPD#),X'00'   *ONU                                       
         DC    AL2(AC@P81L-PDSLIST,AC@P81S-PDSLIST,AC@P81M-PDSLIST)             
         DC    X'04',X'00',AL1(CORUNF)                                          
         DC    X'00'                                                            
         DC    A(PRDESC03)                                                      
         DC    Y(COONUPD_-COPTIONS),AL1(L'COONUPD)                              
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111110',B'10000001'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COUBK#),X'00'   *UBK                                         
         DC    AL2(AC@P158-PDSLIST,AC3P158-PDSLIST,AC8P158-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC29)         SA/SU/CL/LM/FU                               
         DC    Y(COUBK_-COPTIONS),AL1(L'COUBK)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'10000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COPCT#),X'00'   *PCT                                         
         DC    AL2(AC@P12L-PDSLIST,AC@P12S-PDSLIST,AC@P12M-PDSLIST)             
         DC    X'05',X'00',AL1(COINDTYP)                                        
         DC    X'04'               N' DECIMAL PLACES                            
         DC    A(PRDESC06)                                                      
         DC    Y(COPCT_-COPTIONS),AL1(L'COPCT)                                  
         DC    AL1(CODNUMQ,COVNUMQ)                                             
         DC    B'11111110',B'10000001'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COINDX#),X'00'  *INS                                         
         DC    AL2(AC@P80L-PDSLIST,AC@P80S-PDSLIST,AC@P80M-PDSLIST)             
         DC    X'07',X'00',AL1(COINDTYP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)                                                      
         DC    Y(COINDX_-COPTIONS),AL1(L'COINDX)                                
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111110',B'10000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COISOFL#),X'00' *ISL                                         
         DC    AL2(AC@P82L-PDSLIST,AC@P82S-PDSLIST,AC@P82M-PDSLIST)             
         DC    X'05',X'00',AL1(COINDTYP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC05)                                                      
         DC    Y(COISOFL_-COPTIONS),AL1(L'COISOFL)                              
         DC    AL1(CODOFFQ,COVOFFQ)                                             
         DC    B'10010000',B'11101111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COISALL#),X'00' *AIS                                         
         DC    AL2(AC@P84L-PDSLIST,AC@P84S-PDSLIST,AC@P84M-PDSLIST)             
         DC    X'07',AL1(TWOLINEP),AL1(COINDTYP)                                
         DC    X'00'                                                            
         DC    A(PRDESC10)                                                      
         DC    Y(COISALL_-COPTIONS),AL1(L'COISALL)                              
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11011110',B'10100111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COPC1#),X'00'   *PC1                                         
         DC    AL2(AC@P14L-PDSLIST,AC@P14S-PDSLIST,AC@P14M-PDSLIST)             
         DC    X'05',AL1(HIGHLEV),AL1(COINDTYP)                                 
         DC    X'04'               N' DECIMAL PLACES                            
         DC    A(PRDESC06)                                                      
         DC    Y(COPC1_-COPTIONS),AL1(L'COPC1)                                  
         DC    AL1(CODNUMQ,COVNUMQ)                                             
         DC    B'11111111',B'10000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COPC2#),X'00'   *PC2                                         
         DC    AL2(AC@P16L-PDSLIST,AC@P16S-PDSLIST,AC@P16M-PDSLIST)             
         DC    X'05',AL1(HIGHLEV),AL1(COINDTYP)                                 
         DC    X'04'               N' DECIMAL PLACES                            
         DC    A(PRDESC06)                                                      
         DC    Y(COPC2_-COPTIONS),AL1(L'COPC2)                                  
         DC    AL1(CODNUMQ,COVNUMQ)                                             
         DC    B'11111111',B'10000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(PIDREQ#),X'00'  *PID                                         
         DC    AL2(AC@P17L-PDSLIST,AC@P17S-PDSLIST,AC@P17M-PDSLIST)             
         DC    X'04',AL1(HIGHLEV),AL1(COTMESHT)                                 
         DC    X'00'                                                            
         DC    A(PRDESC03)                                                      
         DC    Y(PIDREQ_-COPTIONS),AL1(L'PIDREQ)                                
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'10000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CODTS#),X'00'   *DTS                                         
         DC    AL2(AC@P18L-PDSLIST,AC@P18S-PDSLIST,AC@P18M-PDSLIST)             
         DC    X'04',AL1(HIGHLEV),AL1(COTMESHT)                                 
         DC    X'00'                                                            
         DC    A(PRDESC13)                                                      
         DC    Y(CODTS_-COPTIONS),AL1(L'CODTS)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'10000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CNFTMS#),X'00'  *CNF                                         
         DC    AL2(AC@P19L-PDSLIST,AC@P19S-PDSLIST,AC@P19M-PDSLIST)             
         DC    X'04',AL1(HIGHLEV),AL1(COTMESHT)                                 
         DC    X'00'                                                            
         DC    A(PRDESC03)                                                      
         DC    Y(CNFTMS_-COPTIONS),AL1(L'CNFTMS)                                
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'10000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COFNM#),X'00'      *FNM                                      
         DC    AL2(AC@P186-PDSLIST,AC3P186-PDSLIST,AC8P186-PDSLIST)             
         DC    X'04',AL1(HIGHLEV),AL1(COTMESHT)                                 
         DC    X'00'                                                            
         DC    A(PRDESC03)                                                      
         DC    Y(COFNM_-COPTIONS),AL1(L'COFNM)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'10000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CODTMS#),X'00'  *COD                                         
         DC    AL2(AC@P85L-PDSLIST,AC@P85S-PDSLIST,AC@P85M-PDSLIST)             
         DC    X'04',AL1(HIGHLEV),AL1(COTMESHT)                                 
         DC    X'00'                                                            
         DC    A(PRDESC03)                                                      
         DC    Y(CODTMS_-COPTIONS),AL1(L'CODTMS)                                
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'10000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COBRTE#),X'00'  *RTB                                         
         DC    AL2(AC@P26L-PDSLIST,AC@P26S-PDSLIST,AC@P26M-PDSLIST)             
         DC    X'08',AL1(HIGHLEV),AL1(COTMESHT)                                 
         DC    X'00'                                                            
         DC    A(PRDESC03)                                                      
         DC    Y(COBRTE_-COPTIONS),AL1(L'COBRTE)                                
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'10000000'                                          
         DC    AL1(CTRYNOT+CTRYUSAQ)                                            
*                                                                               
         DC    AL1(CORRTE#),X'00'  *RTR                                         
         DC    AL2(AC@P25L-PDSLIST,AC@P25S-PDSLIST,AC@P25M-PDSLIST)             
         DC    X'08',AL1(HIGHLEV),AL1(COTMESHT)                                 
         DC    X'00'                                                            
         DC    A(PRDESC03)                                                      
         DC    Y(CORRTE_-COPTIONS),AL1(L'CORRTE)                                
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'10000000'                                          
         DC    AL1(CTRYNOT+CTRYUSAQ)                                            
*                                                                               
         DC    AL1(COTBTL#),X'00'  *BTL                                         
         DC    AL2(AC@P11L-PDSLIST,AC@P11S-PDSLIST,AC@P11M-PDSLIST)             
         DC    X'04',AL1(HIGHLEV),AL1(COTMESHT)                                 
         DC    X'00'                                                            
         DC    A(PRDESC18)                                                      
         DC    Y(COTBTL_-COPTIONS),AL1(L'COTBTL)                                
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'10000000'                                          
         DC    AL1(CTRYNOT+CTRYUSAQ)                                            
*                                                                               
         DC    AL1(COTDLK#),X'00'  *DLK                                         
         DC    AL2(AC@P15L-PDSLIST,AC@P15S-PDSLIST,AC@P15M-PDSLIST)             
         DC    X'04',AL1(HIGHLEV),AL1(COTMESHT)                                 
         DC    X'00'                                                            
         DC    A(PRDESC15)                                                      
         DC    Y(COTDLK_-COPTIONS),AL1(L'COTDLK)                                
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'10000000'                                          
         DC    AL1(CTRYNOT+CTRYUSAQ)                                            
*                                                                               
         DC    AL1(CODTM#),X'00'  *DTM                                          
         DC    AL2(AC@P28L-PDSLIST,AC@P28S-PDSLIST,AC@P28M-PDSLIST)             
         DC    X'04',AL1(HIGHLEV),AL1(COMCSTSP)                                 
         DC    X'00'                                                            
         DC    A(PRDESC21)                                                      
         DC    Y(CODTM_-COPTIONS),AL1(L'CODTM)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'10000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COATM#),X'00'  *ATM                                          
         DC    AL2(AC@P29L-PDSLIST,AC@P29S-PDSLIST,AC@P29M-PDSLIST)             
         DC    X'02',AL1(HIGHLEV),AL1(COMCSTSP)                                 
         DC    X'00'                                                            
         DC    A(PRDESC22)                                                      
         DC    Y(COATM_-COPTIONS),AL1(L'COATM)                                  
         DC    AL1(CODMLTQ,COVMLTQ)                                             
         DC    B'11111111',B'10000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CODONLY#),X'00' *DON                                         
         DC    AL2(AC@P20L-PDSLIST,AC@P20S-PDSLIST,AC@P20M-PDSLIST)             
         DC    X'04',X'00',AL1(CODIRECT)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)                                                      
         DC    Y(CODONLY_-COPTIONS),AL1(L'CODONLY)                              
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111110',B'10000001'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CODBASE#),X'00' *DBS                                         
         DC    AL2(AC@P22L-PDSLIST,AC@P22S-PDSLIST,AC@P22M-PDSLIST)             
         DC    X'04',X'00',AL1(CODIRECT)                                        
         DC    X'00'                                                            
         DC    A(PRDESC02)                                                      
         DC    Y(CODBASE_-COPTIONS),AL1(L'CODBASE)                              
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11000000',B'10111111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CODIR#),X'00'   *DIR                                         
         DC    AL2(AC@P24L-PDSLIST,AC@P24S-PDSLIST,AC@P24M-PDSLIST)             
         DC    X'04',X'00',AL1(CODIRECT)                                        
         DC    X'00'                                                            
         DC    A(PRDESC04)                                                      
         DC    Y(CODIR_-COPTIONS),AL1(L'CODIR)                                  
         DC    AL1(CODLDGQ,COVLDGQ)                                             
         DC    B'11000000',B'10111111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COIND#),X'00'   *IND                                         
         DC    AL2(AC@P30L-PDSLIST,AC@P30S-PDSLIST,AC@P30M-PDSLIST)             
         DC    X'04',X'00',AL1(COINDIR)                                         
         DC    X'00'                                                            
         DC    A(PRDESC04)                                                      
         DC    Y(COIND_-COPTIONS),AL1(L'COIND)                                  
         DC    AL1(CODLDGQ,COVLDGQ)                                             
         DC    B'11000000',B'01000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COIBASE#),X'00' *IBS                                         
         DC    AL2(AC@P32L-PDSLIST,AC@P32S-PDSLIST,AC@P32M-PDSLIST)             
         DC    X'04',AL1(NOSHOW),AL1(COINDIR)                                   
         DC    X'00'                                                            
         DC    A(PRDESC02)                                                      
         DC    Y(COIBASE_-COPTIONS),AL1(L'COIBASE)                              
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'00000000',B'11111111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COIOFFL#),X'00' *ILI                                         
         DC    AL2(AC@P34L-PDSLIST,AC@P34S-PDSLIST,AC@P34M-PDSLIST)             
         DC    X'04',X'00',AL1(COINDIR)                                         
         DC    X'00'                                                            
         DC    A(PRDESC05)                                                      
         DC    Y(COIOFFL_-COPTIONS),AL1(L'COIOFFL)                              
         DC    AL1(CODOFFQ,COVOFFQ)                                             
         DC    B'10010000',B'11101111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COINOH#),X'00'  *NOH                                         
         DC    AL2(AC@P36L-PDSLIST,AC@P36S-PDSLIST,AC@P36M-PDSLIST)             
         DC    X'02',X'00',AL1(COINDIR)                                         
         DC    X'00'                                                            
         DC    A(PRDESC07)                                                      
         DC    Y(COINOH_-COPTIONS),AL1(L'COINOH)                                
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111110',B'10000001'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COIEXC#),X'00'  *EXC                                         
         DC    AL2(AC@P38L-PDSLIST,AC@P38S-PDSLIST,AC@P38M-PDSLIST)             
         DC    X'05',X'00',AL1(COINDIR)                                         
         DC    X'00'                                                            
         DC    A(PRDESC07)                                                      
         DC    Y(COIEXC_-COPTIONS),AL1(L'COIEXC)                                
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111110',B'10000001'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COIPER#),X'00'  *PER                                         
         DC    AL2(AC@P27L-PDSLIST,AC@P27S-PDSLIST,AC@P27M-PDSLIST)             
         DC    X'05',X'00',AL1(COINDIR)                                         
         DC    X'00'                                                            
         DC    A(PRDESC17)                                                      
         DC    Y(COIPER_-COPTIONS),AL1(L'COIPER)                                
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111110',B'10000001'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COIALLD#),X'00' *DPI                                         
         DC    AL2(AC@P40L-PDSLIST,AC@P40S-PDSLIST,AC@P40M-PDSLIST)             
         DC    X'05',AL1(TWOLINEP),AL1(COINDIR)                                 
         DC    X'00'                                                            
         DC    A(PRDESC10)                                                      
         DC    Y(COIALLD_-COPTIONS),AL1(L'COIALLD)                              
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111000',B'10000111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COIALLO#),X'00' *OFI                                         
         DC    AL2(AC@P42L-PDSLIST,AC@P42S-PDSLIST,AC@P42M-PDSLIST)             
         DC    X'04',AL1(TWOLINEP),AL1(COINDIR)                                 
         DC    X'00'                                                            
         DC    A(PRDESC10)                                                      
         DC    Y(COIALLO_-COPTIONS),AL1(L'COIALLO)                              
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11110000',B'10001111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COIALLC#),X'00' *COI                                         
         DC    AL2(AC@P44L-PDSLIST,AC@P44S-PDSLIST,AC@P44M-PDSLIST)             
         DC    X'04',AL1(TWOLINEP),AL1(COINDIR)                                 
         DC    X'00'                                                            
         DC    A(PRDESC10)                                                      
         DC    Y(COIALLC_-COPTIONS),AL1(L'COIALLC)                              
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11110000',B'10001111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COOCIND#),X'00' *OIB                                         
         DC    AL2(AC@P43L-PDSLIST,AC@P43S-PDSLIST,AC@P43M-PDSLIST)             
         DC    X'03',X'00',AL1(COINDIR)                                         
         DC    X'00'                                                            
         DC    A(PRDESC20)                                                      
         DC    Y(COOCIND_-COPTIONS),AL1(L'COOCIND)                              
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11110000',B'10001111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COACIND#),X'00' *AIB                                         
         DC    AL2(AC@P46L-PDSLIST,AC@P46S-PDSLIST,AC@P46M-PDSLIST)             
         DC    X'03',X'00',AL1(COINDIR)                                         
         DC    X'00'                                                            
         DC    A(PRDESC20)                                                      
         DC    Y(COACIND_-COPTIONS),AL1(L'COACIND)                              
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11000000',B'10111111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CONBAB#),X'00'  *NBS                                         
         DC    AL2(AC@P49L-PDSLIST,AC@P49S-PDSLIST,AC@P49M-PDSLIST)             
         DC    X'05',X'00',AL1(CONEWBIZ)                                        
         DC    X'00'                                                            
         DC    A(PRDESC14)                                                      
         DC    Y(CONBAB_-COPTIONS),AL1(L'CONBAB)                                
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11110000',B'10111111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CONBAL#),X'00'  *NB                                          
         DC    AL2(AC@P50L-PDSLIST,AC@P50S-PDSLIST,AC@P50M-PDSLIST)             
         DC    X'03',X'00',AL1(CONEWBIZ)                                        
         DC    X'00'                                                            
         DC    A(PRDESC17)                                                      
         DC    Y(CONBAL_-COPTIONS),AL1(L'CONBAL)                                
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11110000',B'10001111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CONBOFF#),X'00' *NBO                                         
         DC    AL2(AC@P52L-PDSLIST,AC@P52S-PDSLIST,AC@P52M-PDSLIST)             
         DC    X'04',X'00',AL1(CONEWBIZ)                                        
         DC    X'00'                                                            
         DC    A(PRDESC09)                                                      
         DC    Y(CONBOFF_-COPTIONS),AL1(L'CONBOFF)                              
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11000000',B'10111111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CONBOUT#),X'00' *NBB                                         
         DC    AL2(AC@P54L-PDSLIST,AC@P54S-PDSLIST,AC@P54M-PDSLIST)             
         DC    X'05',X'00',AL1(CONEWBIZ)                                        
         DC    X'00'                                                            
         DC    A(PRDESC04)                                                      
         DC    Y(CONBOUT_-COPTIONS),AL1(L'CONBOUT)                              
         DC    AL1(CODLDGQ,COVLDGQ)                                             
         DC    B'11000000',B'10111111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CONBIN#),X'00'  *NBA                                         
         DC    AL2(AC@P56L-PDSLIST,AC@P56S-PDSLIST,AC@P56M-PDSLIST)             
         DC    X'04',X'00',AL1(CONEWBIZ)                                        
         DC    X'00'                                                            
         DC    A(PRDESC04)                                                      
         DC    Y(CONBIN_-COPTIONS),AL1(L'CONBIN)                                
         DC    AL1(CODLDGQ,COVLDGQ)                                             
         DC    B'11000000',B'10111111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COPBAB#),X'00'  *PBS                                         
         DC    AL2(AC@P59L-PDSLIST,AC@P59S-PDSLIST,AC@P59M-PDSLIST)             
         DC    X'05',X'00',AL1(COPROBON)                                        
         DC    X'00'                                                            
         DC    A(PRDESC14)                                                      
         DC    Y(COPBAB_-COPTIONS),AL1(L'COPBAB)                                
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11110000',B'10111111'                                          
         DC    AL1(CTRYNOT+CTRYGERQ)                                            
*                                                                               
         DC    AL1(COPBAL#),X'00'  *PB                                          
         DC    AL2(AC@P60L-PDSLIST,AC@P60S-PDSLIST,AC@P60M-PDSLIST)             
         DC    X'03',X'00',AL1(COPROBON)                                        
         DC    X'00'                                                            
         DC    A(PRDESC17)                                                      
         DC    Y(COPBAL_-COPTIONS),AL1(L'COPBAL)                                
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11110000',B'10001111'                                          
         DC    AL1(CTRYNOT+CTRYGERQ)                                            
*                                                                               
         DC    AL1(COPBOFF#),X'00' *PBO                                         
         DC    AL2(AC@P62L-PDSLIST,AC@P62S-PDSLIST,AC@P62M-PDSLIST)             
         DC    X'03',X'00',AL1(COPROBON)                                        
         DC    X'00'                                                            
         DC    A(PRDESC09)                                                      
         DC    Y(COPBOFF_-COPTIONS),AL1(L'COPBOFF)                              
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11000000',B'10111111'                                          
         DC    AL1(CTRYNOT+CTRYGERQ)                                            
*                                                                               
         DC    AL1(COPBOUT#),X'00' *PBB                                         
         DC    AL2(AC@P64L-PDSLIST,AC@P64S-PDSLIST,AC@P64M-PDSLIST)             
         DC    X'05',X'00',AL1(COPROBON)                                        
         DC    X'00'                                                            
         DC    A(PRDESC04)                                                      
         DC    Y(COPBOUT_-COPTIONS),AL1(L'COPBOUT)                              
         DC    AL1(CODLDGQ,COVLDGQ)                                             
         DC    B'11000000',B'10111111'                                          
         DC    AL1(CTRYNOT+CTRYGERQ)                                            
*                                                                               
         DC    AL1(COPBIN#),X'00'  *PBA                                         
         DC    AL2(AC@P66L-PDSLIST,AC@P66S-PDSLIST,AC@P66M-PDSLIST)             
         DC    X'03',X'00',AL1(COPROBON)                                        
         DC    X'00'                                                            
         DC    A(PRDESC04)                                                      
         DC    Y(COPBIN_-COPTIONS),AL1(L'COPBIN)                                
         DC    AL1(CODLDGQ,COVLDGQ)                                             
         DC    B'11000000',B'10111111'                                          
         DC    AL1(CTRYNOT+CTRYGERQ)                                            
*                                                                               
         DC    AL1(COHOAB#),X'00'  *HOS                                         
         DC    AL2(AC@P90L-PDSLIST,AC@P90S-PDSLIST,AC@P90M-PDSLIST)             
         DC    X'05',X'00',AL1(COHOUSEC)                                        
         DC    X'00'                                                            
         DC    A(PRDESC14)                                                      
         DC    Y(COHOAB_-COPTIONS),AL1(L'COHOAB)                                
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11110000',B'10111111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COHOAL#),X'00'  *HO                                          
         DC    AL2(AC@P92L-PDSLIST,AC@P92S-PDSLIST,AC@P92M-PDSLIST)             
         DC    X'03',X'00',AL1(COHOUSEC)                                        
         DC    X'00'                                                            
         DC    A(PRDESC17)                                                      
         DC    Y(COHOAL_-COPTIONS),AL1(L'COHOAL)                                
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11110000',B'10001111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COHOOFF#),X'00' *HOO                                         
         DC    AL2(AC@P94L-PDSLIST,AC@P94S-PDSLIST,AC@P94M-PDSLIST)             
         DC    X'03',X'00',AL1(COHOUSEC)                                        
         DC    X'00'                                                            
         DC    A(PRDESC09)                                                      
         DC    Y(COHOOFF_-COPTIONS),AL1(L'COHOOFF)                              
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11000000',B'10111111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COHOOUT#),X'00' *HOB                                         
         DC    AL2(AC@P96L-PDSLIST,AC@P96S-PDSLIST,AC@P96M-PDSLIST)             
         DC    X'05',X'00',AL1(COHOUSEC)                                        
         DC    X'00'                                                            
         DC    A(PRDESC04)                                                      
         DC    Y(COHOOUT_-COPTIONS),AL1(L'COHOOUT)                              
         DC    AL1(CODLDGQ,COVLDGQ)                                             
         DC    B'11000000',B'10111111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COHOIN#),X'00'  *HOA                                         
         DC    AL2(AC@P98L-PDSLIST,AC@P98S-PDSLIST,AC@P98M-PDSLIST)             
         DC    X'03',X'00',AL1(COHOUSEC)                                        
         DC    X'00'                                                            
         DC    A(PRDESC04)                                                      
         DC    Y(COHOIN_-COPTIONS),AL1(L'COHOIN)                                
         DC    AL1(CODLDGQ,COVLDGQ)                                             
         DC    B'11000000',B'10111111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COVAB#),X'00'   *OVA                                         
         DC    AL2(AC@P69L-PDSLIST,AC@P69S-PDSLIST,AC@P69M-PDSLIST)             
         DC    X'05',X'00',AL1(COOVHED)                                         
         DC    X'00'                                                            
         DC    A(PRDESC19)                                                      
         DC    Y(COVAB_-COPTIONS),AL1(L'COVAB)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111110',B'11100001'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COVBASE#),X'00' *AOY                                         
         DC    AL2(AC@P70L-PDSLIST,AC@P70S-PDSLIST,AC@P70M-PDSLIST)             
         DC    X'04',X'00',AL1(COOVHED)                                         
         DC    X'00'                                                            
         DC    A(PRDESC03)                                                      
         DC    Y(COVBASE_-COPTIONS),AL1(L'COVBASE)                              
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11000000',B'10111111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COVINC#),X'00'  *OVH                                         
         DC    AL2(AC@P71L-PDSLIST,AC@P71S-PDSLIST,AC@P71M-PDSLIST)             
         DC    X'07',X'00',AL1(COOVHED)                                         
         DC    X'00'                                                            
         DC    A(PRDESC03)                                                      
         DC    Y(COVINC_-COPTIONS),AL1(L'COVINC)                                
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111110',B'11100001'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COVALLD#),X'00' *DPO                                         
         DC    AL2(AC@P72L-PDSLIST,AC@P72S-PDSLIST,AC@P72M-PDSLIST)             
         DC    X'05',AL1(TWOLINEP),AL1(COOVHED)                                 
         DC    X'00'                                                            
         DC    A(PRDESC10)                                                      
         DC    Y(COVALLD_-COPTIONS),AL1(L'COVALLD)                              
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111000',B'10000111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COVALLO#),X'00' *OFO                                         
         DC    AL2(AC@P74L-PDSLIST,AC@P74S-PDSLIST,AC@P74M-PDSLIST)             
         DC    X'04',AL1(TWOLINEP),AL1(COOVHED)                                 
         DC    X'00'                                                            
         DC    A(PRDESC11)                                                      
         DC    Y(COVALLO_-COPTIONS),AL1(L'COVALLO)                              
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11110000',B'10001111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COVALLC#),X'00' *COO                                         
         DC    AL2(AC@P76L-PDSLIST,AC@P76S-PDSLIST,AC@P76M-PDSLIST)             
         DC    X'04',X'00',AL1(COOVHED)                                         
         DC    X'00'                                                            
         DC    A(PRDESC12)                                                      
         DC    Y(COVALLC_-COPTIONS),AL1(L'COVALLC)                              
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11000000',B'11111111'                                          
         DC    AL1(CTRYANY)                                                     
*                                  MCS TIMESHEET OPTIONS                        
         DC    AL1(COMCT#),X'00'   *MCT                                         
         DC    AL2(AC@P099-PDSLIST,AC3P099-PDSLIST,AC8P099-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COMCT_-COPTIONS),AL1(L'COMCT)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
*        DC    AL1(COTMO#),X'00'   *TMO                                         
*        DC    AL2(AC@P127-PDSLIST,AC3P127-PDSLIST,AC8P127-PDSLIST)             
*        DC    X'04',AL1(AGYONLY),AL1(COMCSTSP)                                 
*        DC    X'00'                                                            
*        DC    A(PRDESC24)         C/M                                          
*        DC    Y(COTMO_-COPTIONS),AL1(L'COTMO)                                  
*        DC    AL1(CODMVCQ,COVTBLQ)                                             
*        DC    B'11111111',B'10000000'                                          
*        DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COACS#),X'00'   *ACS                                         
         DC    AL2(AC@P137-PDSLIST,AC3P137-PDSLIST,AC8P137-PDSLIST)             
         DC    X'04',AL1(AGYONLY),AL1(COMCSTSP)                                 
         DC    X'00'                                                            
         DC    A(PRDESC27)         C/S                                          
         DC    Y(COACS_-COPTIONS),AL1(L'COACS)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'10000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COTUP#),X'00'   *TUP                                         
         DC    AL2(AC@P141-PDSLIST,AC3P141-PDSLIST,AC8P141-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC29)         SA/SU/CL/LM/FU                               
         DC    Y(COTUP_-COPTIONS),AL1(L'COTUP)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'11111111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COTSD#),X'00'   *TSD                                         
         DC    AL2(AC@P125-PDSLIST,AC3P125-PDSLIST,AC8P125-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC23)         M/O/N                                        
         DC    Y(COTSD_-COPTIONS),AL1(L'COTSD)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COCTS#),X'00'   *CTS                                         
         DC    AL2(AC@P126-PDSLIST,AC3P126-PDSLIST,AC8P126-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC33)         YES/NO/TEMPLATE                              
         DC    Y(COCTS_-COPTIONS),AL1(L'COCTS)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CONDO#),X'00'   *NDO                                         
         DC    AL2(AC@P128-PDSLIST,AC3P128-PDSLIST,AC8P128-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    AL1(0+COVRNG3)      N' DECIMAL PLACES + RANGE CHECK              
         DC    A(PRDESC25)         0-99                                         
         DC    Y(CONDO_-COPTIONS),AL1(L'CONDO)                                  
         DC    AL1(CODNUMQ,COVNUMQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CONBL#),X'00'   *NBL                                         
         DC    AL2(AC@P129-PDSLIST,AC3P129-PDSLIST,AC8P129-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    AL1(0+COVRNG2)      N' DECIMAL PLACES + RANGE CHECK              
         DC    A(PRDESC26)         1-99                                         
         DC    Y(CONBL_-COPTIONS),AL1(L'CONBL)                                  
         DC    AL1(CODNUMQ,COVNUMQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CODMO#),X'00'   *DMO                                         
         DC    AL2(AC@P130-PDSLIST,AC3P130-PDSLIST,AC8P130-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(CODMO_-COPTIONS),AL1(L'CODMO)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CODTU#),X'00'   *DTU                                         
         DC    AL2(AC@P131-PDSLIST,AC3P131-PDSLIST,AC8P131-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(CODTU_-COPTIONS),AL1(L'CODTU)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CODWE#),X'00'   *DWE                                         
         DC    AL2(AC@P132-PDSLIST,AC3P132-PDSLIST,AC8P132-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(CODWE_-COPTIONS),AL1(L'CODWE)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CODTH#),X'00'   *DTH                                         
         DC    AL2(AC@P133-PDSLIST,AC3P133-PDSLIST,AC8P133-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(CODTH_-COPTIONS),AL1(L'CODTH)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CODFR#),X'00'   *DFR                                         
         DC    AL2(AC@P134-PDSLIST,AC3P134-PDSLIST,AC8P134-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(CODFR_-COPTIONS),AL1(L'CODFR)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CODSA#),X'00'   *DSA                                         
         DC    AL2(AC@P135-PDSLIST,AC3P135-PDSLIST,AC8P135-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(CODSA_-COPTIONS),AL1(L'CODSA)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CODSU#),X'00'   *DSU                                         
         DC    AL2(AC@P136-PDSLIST,AC3P136-PDSLIST,AC8P136-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(CODSU_-COPTIONS),AL1(L'CODSU)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COPHA#),X'00'   *PHA                                         
         DC    AL2(AC@P138-PDSLIST,AC3P138-PDSLIST,AC8P138-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC28)         ACCOUNT CODE                                 
         DC    Y(COPHA_-COPTIONS),AL1(L'COPHA)                                  
         DC    AL1(COD1NAQ,COV1NAQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COSHA#),X'00'   *SHA                                         
         DC    AL2(AC@P139-PDSLIST,AC3P139-PDSLIST,AC8P139-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC28)         ACCOUNT CODE                                 
         DC    Y(COSHA_-COPTIONS),AL1(L'COSHA)                                  
         DC    AL1(COD1NAQ,COV1NAQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COTBV#),X'00'   *TBV                                         
         DC    AL2(AC@P144-PDSLIST,AC3P144-PDSLIST,AC8P144-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    AL1(0+COVRNG1)      N' DECIMAL PLACES + RANGE CHECK              
         DC    A(PRDESC31)         1-3                                          
         DC    Y(COTBV_-COPTIONS),AL1(L'COTBV)                                  
         DC    AL1(CODNUMQ,COVNUMQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COEML#),X'00'   *EML                                         
         DC    AL2(AC@P146-PDSLIST,AC3P146-PDSLIST,AC8P146-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    AL1(0+COVRNG4)                                                   
         DC    A(PRDESC34)         0-4                                          
         DC    Y(COEML_-COPTIONS),AL1(L'COEML)                                  
         DC    AL1(CODNUMQ,COVNUMQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COMAT#),X'00'   *MAT                                         
         DC    AL2(AC@P147-PDSLIST,AC3P147-PDSLIST,AC8P147-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COMAT_-COPTIONS),AL1(L'COMAT)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COCLA#),X'00'   *CLA                                         
         DC    AL2(AC@P149-PDSLIST,AC3P149-PDSLIST,AC8P149-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COCLA_-COPTIONS),AL1(L'COCLA)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COFNR#),X'00'   *FNR                                         
         DC    AL2(AC@P150-PDSLIST,AC3P150-PDSLIST,AC8P150-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COFNR_-COPTIONS),AL1(L'COFNR)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COURS#),X'00'   *URS                                         
         DC    AL2(AC@P157-PDSLIST,AC3P157-PDSLIST,AC8P157-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COURS_-COPTIONS),AL1(L'COURS)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CONJB#),X'00'   *NJB                                         
         DC    AL2(AC@P160-PDSLIST,AC3P160-PDSLIST,AC8P160-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(CONJB_-COPTIONS),AL1(L'CONJB)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COCNR#),X'00'   *CNR                                         
         DC    AL2(AC@P161-PDSLIST,AC3P161-PDSLIST,AC8P161-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COCNR_-COPTIONS),AL1(L'COCNR)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COPHL#),X'00'   *PHL                                         
         DC    AL2(AC@P148-PDSLIST,AC3P148-PDSLIST,AC8P148-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC32)         AGY/OFF/DEPT/SUBDEPT                         
         DC    Y(COPHL_-COPTIONS),AL1(L'COPHL)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COD2E#),X'00'   *D2E                                         
         DC    AL2(AC@P151-PDSLIST,AC3P151-PDSLIST,AC8P151-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    AL1(0+COVRNG3)      N' DECIMAL PLACES + RANGE CHECK              
         DC    A(PRDESC25)         0-99                                         
         DC    Y(COD2E_-COPTIONS),AL1(L'COD2E)                                  
         DC    AL1(CODNUMQ,COVNUMQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COORD#),X'00'   *ORD                                         
         DC    AL2(AC@P152-PDSLIST,AC3P152-PDSLIST,AC8P152-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC35)         YES/NO/COMPULSORY                            
         DC    Y(COORD_-COPTIONS),AL1(L'COORD)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COEST#),X'00'   *EST                                         
         DC    AL2(AC@P166-PDSLIST,AC3P166-PDSLIST,AC8P166-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC35)         YES/NO/COMPULSORY                            
         DC    Y(COEST_-COPTIONS),AL1(L'COEST)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COINR#),X'00'   *INR                                         
         DC    AL2(AC@P153-PDSLIST,AC3P153-PDSLIST,AC8P153-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COINR_-COPTIONS),AL1(L'COINR)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COTTU#),X'00'   *TTU                                         
         DC    AL2(AC@P164-PDSLIST,AC3P164-PDSLIST,AC8P164-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COTTU_-COPTIONS),AL1(L'COTTU)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COFAR#),X'00'   *FAR                                         
         DC    AL2(AC@P165-PDSLIST,AC3P165-PDSLIST,AC8P165-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COFAR_-COPTIONS),AL1(L'COFAR)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CONCM#),X'00'    *NCM                                        
         DC    AL2(AC@P174-PDSLIST,AC3P174-PDSLIST,AC8P174-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    AL1(0+COVR2G2)      N' DECIMAL PLACES + RANGE CHECK              
         DC    A(PRDESC39)         1-10                                         
         DC    Y(CONCM_-COPTIONS),AL1(L'CONCM)                                  
         DC    AL1(CODNU2Q,COVNU2Q)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CONCL#),X'00'    *NCL                                        
         DC    AL2(AC@P175-PDSLIST,AC3P175-PDSLIST,AC8P175-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    AL1(0+COVR2G2)      N' DECIMAL PLACES + RANGE CHECK              
         DC    A(PRDESC39)         1-10                                         
         DC    Y(CONCL_-COPTIONS),AL1(L'CONCL)                                  
         DC    AL1(CODNU2Q,COVNU2Q)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CONCA#),X'00'    *NCA                                        
         DC    AL2(AC@P176-PDSLIST,AC3P176-PDSLIST,AC8P176-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    AL1(0+COVR2G2)      N' DECIMAL PLACES + RANGE CHECK              
         DC    A(PRDESC39)         1-10                                         
         DC    Y(CONCA_-COPTIONS),AL1(L'CONCA)                                  
         DC    AL1(CODNU2Q,COVNU2Q)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CONLA#),X'00'    *NLA                                        
         DC    AL2(AC@P177-PDSLIST,AC3P177-PDSLIST,AC8P177-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    AL1(0+COVR2G2)      N' DECIMAL PLACES + RANGE CHECK              
         DC    A(PRDESC39)         1-10                                         
         DC    Y(CONLA_-COPTIONS),AL1(L'CONLA)                                  
         DC    AL1(CODNU2Q,COVNU2Q)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COPTA#),X'00'    *PTA                                        
         DC    AL2(AC@P178-PDSLIST,AC3P178-PDSLIST,AC8P178-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COPTA_-COPTIONS),AL1(L'COPTA)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COFTA#),X'00'   *FTA                                         
         DC    AL2(AC@P179-PDSLIST,AC3P179-PDSLIST,AC8P179-PDSLIST)             
         DC    X'02',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC40)         B/R/N/C                                      
         DC    Y(COFTA_-COPTIONS),AL1(L'COFTA)                                  
         DC    AL1(CODML2Q,COVML2Q)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COFAP#),X'00'   *FAP                                         
         DC    AL2(AC@P180-PDSLIST,AC3P180-PDSLIST,AC8P180-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COFAP_-COPTIONS),AL1(L'COFAP)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CODIA#),X'00'   *DIA                                         
         DC    AL2(AC@P182-PDSLIST,AC3P182-PDSLIST,AC8P182-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(CODIA_-COPTIONS),AL1(L'CODIA)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CONDA#),X'00'   *NDA                                         
         DC    AL2(AC@P181-PDSLIST,AC3P181-PDSLIST,AC8P181-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    AL1(0+COVR2G3)      N' DECIMAL PLACES + RANGE CHECK              
         DC    A(PRDESC41)         1-365 DAYS                                   
         DC    Y(CONDA_-COPTIONS),AL1(L'CONDA)                                  
         DC    AL1(CODNU2Q,COVNU2Q)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COMTS#),X'00'   *MTS                                         
         DC    AL2(AC@P185-PDSLIST,AC3P185-PDSLIST,AC8P185-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC42)                                                      
         DC    Y(COMTS_-COPTIONS),AL1(L'COMTS)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'10110001',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CODEF#),X'00'   *DEF                                         
         DC    AL2(AC@P188-PDSLIST,AC3P188-PDSLIST,AC8P188-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC43)         CLIENT PRODUCT JOB                           
         DC    Y(CODEF_-COPTIONS),AL1(L'CODEF)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COOVT#),X'00'   *OVT                                         
         DC    AL2(AC@P189-PDSLIST,AC3P189-PDSLIST,AC8P189-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COOVT_-COPTIONS),AL1(L'COOVT)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                  MCS TIMESHEET DISPLAY COLUMN OPTIONS         
         DC    AL1(COTYT#),X'00'   *TYT                                         
         DC    AL2(AC@P101-PDSLIST,AC3P101-PDSLIST,AC8P101-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSC)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COTYT_-COPTIONS),AL1(L'COTYT)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COCLC#),X'00'   *CLC                                         
         DC    AL2(AC@P102-PDSLIST,AC3P102-PDSLIST,AC8P102-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSC)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COCLC_-COPTIONS),AL1(L'COCLC)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COPRC#),X'00'   *PRC                                         
         DC    AL2(AC@P103-PDSLIST,AC3P103-PDSLIST,AC8P103-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSC)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COPRC_-COPTIONS),AL1(L'COPRC)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COJOC#),X'00'   *JOC                                         
         DC    AL2(AC@P104-PDSLIST,AC3P104-PDSLIST,AC8P104-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSC)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COJOC_-COPTIONS),AL1(L'COJOC)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COTSK#),X'00'   *TSK                                         
         DC    AL2(AC@P105-PDSLIST,AC3P105-PDSLIST,AC8P105-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSC)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COTSK_-COPTIONS),AL1(L'COTSK)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COORC#),X'00'   *ORC                                         
         DC    AL2(AC@P155-PDSLIST,AC3P155-PDSLIST,AC8P155-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSC)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COORC_-COPTIONS),AL1(L'COORC)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COESC#),X'00'   *ESC                                         
         DC    AL2(AC@P167-PDSLIST,AC3P167-PDSLIST,AC8P167-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSC)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COESC_-COPTIONS),AL1(L'COESC)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COIRC#),X'00'   *IRC                                         
         DC    AL2(AC@P156-PDSLIST,AC3P156-PDSLIST,AC8P156-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSC)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COIRC_-COPTIONS),AL1(L'COIRC)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CONCC#),X'00'   *NCC                                         
         DC    AL2(AC@P106-PDSLIST,AC3P106-PDSLIST,AC8P106-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSC)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(CONCC_-COPTIONS),AL1(L'CONCC)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COTOT#),X'00'   *TOT                                         
         DC    AL2(AC@P107-PDSLIST,AC3P107-PDSLIST,AC8P107-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSC)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COTOT_-COPTIONS),AL1(L'COTOT)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COCNM#),X'00'   *CNM                                         
         DC    AL2(AC@P108-PDSLIST,AC3P108-PDSLIST,AC8P108-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSC)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COCNM_-COPTIONS),AL1(L'COCNM)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COPNM#),X'00'   *PNM                                         
         DC    AL2(AC@P109-PDSLIST,AC3P109-PDSLIST,AC8P109-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSC)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COPNM_-COPTIONS),AL1(L'COPNM)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COJNM#),X'00'   *JNM                                         
         DC    AL2(AC@P110-PDSLIST,AC3P110-PDSLIST,AC8P110-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSC)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COJNM_-COPTIONS),AL1(L'COJNM)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CONCN#),X'00'   *NCN                                         
         DC    AL2(AC@P111-PDSLIST,AC3P111-PDSLIST,AC8P111-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSC)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(CONCN_-COPTIONS),AL1(L'CONCN)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COBHR#),X'00'   *BHR                                         
         DC    AL2(AC@P112-PDSLIST,AC3P112-PDSLIST,AC8P112-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSC)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COBHR_-COPTIONS),AL1(L'COBHR)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COCHR#),X'00'   *CHR                                         
         DC    AL2(AC@P113-PDSLIST,AC3P113-PDSLIST,AC8P113-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSC)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COCHR_-COPTIONS),AL1(L'COCHR)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CONBH#),X'00'   *NBH                                         
         DC    AL2(AC@P117-PDSLIST,AC3P117-PDSLIST,AC8P117-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSC)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(CONBH_-COPTIONS),AL1(L'CONBH)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CONCH#),X'00'   *NCH                                         
         DC    AL2(AC@P118-PDSLIST,AC3P118-PDSLIST,AC8P118-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSTSC)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(CONCH_-COPTIONS),AL1(L'CONCH)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COBCA#),X'00'   *BCA                                         
         DC    AL2(AC@P140-PDSLIST,AC3P140-PDSLIST,AC8P140-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSEXP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COBCA_-COPTIONS),AL1(L'COBCA)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COTNB#),X'00'   *TNB                                         
         DC    AL2(AC@P142-PDSLIST,AC3P142-PDSLIST,AC8P142-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSEXP)                                        
         DC    X'02'               N' DECIMAL PLACES                            
         DC    A(PRDESC30)                                                      
         DC    Y(COTNB_-COPTIONS),AL1(L'COTNB)                                  
         DC    AL1(CODNUMQ,COVNUMQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COLMA#),X'00'   *LMA                                         
         DC    AL2(AC@P143-PDSLIST,AC3P143-PDSLIST,AC8P143-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSEXP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COLMA_-COPTIONS),AL1(L'COLMA)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COEBV#),X'00'   *EBV                                         
         DC    AL2(AC@P145-PDSLIST,AC3P145-PDSLIST,AC8P145-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSEXP)                                        
         DC    AL1(0+COVR2G1)      N' DECIMAL PLACES + RANGE CHECK              
         DC    A(PRDESC38)         1-12                                         
         DC    Y(COEBV_-COPTIONS),AL1(L'COEBV)                                  
         DC    AL1(CODNUMQ,COVNU2Q)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COENR#),X'00'   *ENR                                         
         DC    AL2(AC@P159-PDSLIST,AC3P159-PDSLIST,AC8P159-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSEXP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC15)         YES/NO/ONLY                                  
         DC    Y(COENR_-COPTIONS),AL1(L'COENR)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COLTP#),X'00'    *LTP                                        
         DC    AL2(AC@P162-PDSLIST,AC3P162-PDSLIST,AC8P162-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSEXP)                                        
         DC    AL1(0+COVRNG5)                                                   
         DC    A(PRDESC36)                                                      
         DC    Y(COLTP_-COPTIONS),AL1(L'COLTP)                                  
         DC    AL1(CODNUMQ,COVNUMQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COCVA#),X'00'    *CVA                                        
         DC    AL2(AC@P163-PDSLIST,AC3P163-PDSLIST,AC8P163-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSEXP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC37)                                                      
         DC    Y(COCVA_-COPTIONS),AL1(L'COCVA)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COECL#),X'00'    *EST                                        
         DC    AL2(AC@P168-PDSLIST,AC3P168-PDSLIST,AC8P168-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSEXP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC35)                                                      
         DC    Y(COECL_-COPTIONS),AL1(L'COECL)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CONMX#),X'00'    *NMX                                        
         DC    AL2(AC@P169-PDSLIST,AC3P169-PDSLIST,AC8P169-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSEXP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)                                                      
         DC    Y(CONMX_-COPTIONS),AL1(L'CONMX)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COACM#),X'00'    *APC                                        
         DC    AL2(AC@P170-PDSLIST,AC3P170-PDSLIST,AC8P170-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSEXP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC35)                                                      
         DC    Y(COACM_-COPTIONS),AL1(L'COACM)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COCCM#),X'00'    *CLC                                        
         DC    AL2(AC@P171-PDSLIST,AC3P171-PDSLIST,AC8P171-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSEXP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC35)                                                      
         DC    Y(COCCM_-COPTIONS),AL1(L'COCCM)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COBDT#),X'00'    *CBD                                        
         DC    AL2(AC@P172-PDSLIST,AC3P172-PDSLIST,AC8P172-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSEXP)                                        
         DC    AL1(0+COVR2G1)       N' DECIMAL PLACES + RANGE CHECK             
         DC    A(PRDESC38)          1-12 MONTHS                                 
         DC    Y(COBDT_-COPTIONS),AL1(L'COBDT)                                  
         DC    AL1(CODNUMQ,COVNU2Q)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(CORCP#),X'00'    *RCP                                        
         DC    AL2(AC@P173-PDSLIST,AC3P173-PDSLIST,AC8P173-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSEXP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(CORCP_-COPTIONS),AL1(L'CORCP)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COCAE#),X'00'    *CAE                                        
         DC    AL2(AC@P183-PDSLIST,AC3P183-PDSLIST,AC8P183-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSEXP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COCAE_-COPTIONS),AL1(L'COCAE)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11111111',B'00000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COMIL#),X'00'    *MIL    -   NEW MILEAGE IN USE              
         DC    AL2(AC@P184-PDSLIST,AC3P184-PDSLIST,AC8P184-PDSLIST)             
         DC    X'04',X'00',AL1(COMCSEXP)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COMIL_-COPTIONS),AL1(L'COMIL)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'11110001',B'01001111'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    AL1(COTHR#),X'00'    *1R AVAILABLE IN THIRD PARTY UPLOAD         
         DC    AL2(AC@P187-PDSLIST,AC3P187-PDSLIST,AC8P187-PDSLIST)             
         DC    X'04',X'00',AL1(COTMESHT)                                        
         DC    X'00'                                                            
         DC    A(PRDESC03)         YES/NO                                       
         DC    Y(COTHR_-COPTIONS),AL1(L'COTHR)                                  
         DC    AL1(CODMVCQ,COVTBLQ)                                             
         DC    B'10111111',B'01000000'                                          
         DC    AL1(CTRYANY)                                                     
*                                                                               
         DC    X'00'               EOT                                          
         EJECT                                                                  
*                                                                               
* PROFILE DESCRIPTION/VALID OPTIONS - COVERED BY COPDD                          
*                                                                               
PRDESC01 DC    AL2(AC@DSC19-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(1)                                                           
         DC    AL1(1),AL2(AC@PMTH-PUDSLIST),AL1(COMTHLY)                        
*                                                                               
PRDESC02 DC    AL2(AC@DSC02-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(2)                                                           
         DC    AL1(1),AL2(AC@PMTH-PUDSLIST),AL1(COMTHLY)                        
         DC    AL1(1),AL2(AC@PYTD-PUDSLIST),AL1(COYTD)                          
*                                                                               
PRDESC03 DC    AL2(AC@DSC03-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(2)                                                           
         DC    AL1(1),AL2(AC@PYES-PUDSLIST),AL1(COOPTYQ)                        
         DC    AL1(1),AL2(AC@PNO-PUDSLIST),AL1(COOPTNQ)                         
*                                                                               
PRDESC04 DC    AL2(AC@DSC04-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(8)                                                           
         DC    AL1(CODIR#),C'14',AL2(CODIR-COPTIONS)                            
         DC    AL1(COIND#),C'15',AL2(COIND-COPTIONS)                            
         DC    AL1(CONBOUT#),C'15',AL2(CONBOUT-COPTIONS)                        
         DC    AL1(CONBIN#),C'15',AL2(CONBIN-COPTIONS)                          
         DC    AL1(COPBOUT#),C'15',AL2(COPBOUT-COPTIONS)                        
         DC    AL1(COPBIN#),C'15',AL2(COPBIN-COPTIONS)                          
         DC    AL1(COHOOUT#),C'15',AL2(COHOOUT-COPTIONS)                        
         DC    AL1(COHOIN#),C'15',AL2(COHOIN-COPTIONS)                          
*                                                                               
PRDESC05 DC    AL2(AC@DSC21-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(0)                                                           
*                                                                               
PRDESC06 DC    AL2(AC@DSC06-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(0)                                                           
*                                                                               
PRDESC07 DC    AL2(AC@DSC07-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(3)                                                           
         DC    AL1(1),AL2(AC@PDPT-PUDSLIST),AL1(COSET_D)                        
         DC    AL1(1),AL2(AC@POFF-PUDSLIST),AL1(COSET_O)                        
         DC    AL1(1),AL2(AC@PAGY-PUDSLIST),AL1(COSET_C)                        
*                                                                               
PRDESC08 DC    AL2(AC@DSC08-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(2)                                                           
         DC    AL1(1),AL2(AC@POFF-PUDSLIST),AL1(COSET_O)                        
         DC    AL1(1),AL2(AC@PAGY-PUDSLIST),AL1(COSET_C)                        
*                                                                               
PRDESC09 DC    AL2(AC@DSC09-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(2)                                                           
         DC    AL1(1),AL2(AC@PPER-PUDSLIST),AL1(COSTAFF)                        
         DC    AL1(1),AL2(AC@PCLI-PUDSLIST),AL1(COCLIENT)                       
*                                                                               
PRDESC10 DC    AL2(AC@DSC28-PDSLIST)                                            
         DC    AL2(AC@DSC30-PDSLIST)                                            
         DC    AL1(8)                                                           
         DC    AL1(5),AL2(AC@POLI-PUDSLIST),AL1(COSET_L)                        
         DC    AL1(4),AL2(AC@PCOF-PUDSLIST),AL1(COSET_M)                        
         DC    AL1(4),AL2(AC@PCLS-PUDSLIST),AL1(COSET_N)                        
         DC    AL1(1),AL2(AC@PDPT-PUDSLIST),AL1(COSET_D)                        
         DC    AL1(5),AL2(AC@POFF-PUDSLIST),AL1(COSET_O)                        
         DC    AL1(3),AL2(AC@PAGY-PUDSLIST),AL1(COSET_C)                        
         DC    AL1(5),AL2(AC@CLIST-PUDSLIST),AL1(COSET_K)                       
         DC    AL1(5),AL2(AC@COLST-PUDSLIST),AL1(COSET_Q)                       
*                                                                               
PRDESC11 DC    AL2(AC@DSC29-PDSLIST)                                            
         DC    AL2(AC@DSC30-PDSLIST)                                            
         DC    AL1(7)                                                           
         DC    AL1(5),AL2(AC@POLI-PUDSLIST),AL1(COSET_L)                        
         DC    AL1(4),AL2(AC@PCOF-PUDSLIST),AL1(COSET_M)                        
         DC    AL1(4),AL2(AC@PCLS-PUDSLIST),AL1(COSET_N)                        
         DC    AL1(5),AL2(AC@POFF-PUDSLIST),AL1(COSET_O)                        
         DC    AL1(3),AL2(AC@PAGY-PUDSLIST),AL1(COSET_C)                        
         DC    AL1(5),AL2(AC@CLIST-PUDSLIST),AL1(COSET_K)                       
         DC    AL1(5),AL2(AC@COLST-PUDSLIST),AL1(COSET_Q)                       
*                                                                               
PRDESC12 DC    AL2(AC@DSC12-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(1)                                                           
         DC    AL1(1),AL2(AC@PAGY-PUDSLIST),AL1(COSET_C)                        
*                                                                               
PRDESC13 DC    AL2(AC@DSC13-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(5)                                                           
         DC    AL1(2),AL2(AC@PB-PUDSLIST),AL1(COSETB)                           
         DC    AL1(2),AL2(AC@PBPL-PUDSLIST),AL1(COSETBP)                        
         DC    AL1(3),AL2(AC@PNB-PUDSLIST),AL1(COSETNB)                         
         DC    AL1(3),AL2(AC@PNBPL-PUDSLIST),AL1(COSETNBP)                      
         DC    AL1(3),AL2(AC@PBDPL-PUDSLIST),AL1(COSETBDP)                      
*                                                                               
PRDESC14 DC    AL2(AC@DSC14-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(3)                                                           
         DC    AL1(5),AL2(AC@COST-PUDSLIST),AL1(CODCOST)                        
         DC    AL1(1),AL2(AC@INCM-PUDSLIST),AL1(COINCOME)                       
         DC    AL1(5),AL2(AC@CNIND-PUDSLIST),AL1(COCONIND)                      
*                                                                               
PRDESC15 DC    AL2(AC@DSC15-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(3)                                                           
         DC    AL1(1),AL2(AC@PYES-PUDSLIST),AL1(COOPTYQ)                        
         DC    AL1(2),AL2(AC@PNO-PUDSLIST),AL1(COOPTNQ)                         
         DC    AL1(2),AL2(AC@PONLY-PUDSLIST),AL1(COOPTOQ)                       
*                                                                               
PRDESC16 DC    AL2(AC@DSC16-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(0)                                                           
*                                                                               
PRDESC17 DC    AL2(AC@DSC17-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(4)                                                           
         DC    AL1(5),AL2(AC@PPER-PUDSLIST),AL1(COSET_P)                        
         DC    AL1(1),AL2(AC@PDPT-PUDSLIST),AL1(COSET_D)                        
         DC    AL1(5),AL2(AC@POFF-PUDSLIST),AL1(COSET_O)                        
         DC    AL1(1),AL2(AC@PAGY-PUDSLIST),AL1(COSET_C)                        
*                                                                               
PRDESC18 DC    AL2(AC@DSC18-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(2)                                                           
         DC    AL1(1),AL2(AC@INCM-PUDSLIST),AL1(COINCOME)                       
         DC    AL1(1),AL2(AC@SUSP-PUDSLIST),AL1(COSUSP)                         
*                                                                               
PRDESC19 DC    AL2(AC@DSC20-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(4)                                                           
         DC    AL1(5),AL2(AC@COST-PUDSLIST),AL1(CODCOST)                        
         DC    AL1(1),AL2(AC@INCM-PUDSLIST),AL1(COINCOME)                       
         DC    AL1(1),AL2(AC@HOURS-PUDSLIST),AL1(COHOURS)                       
         DC    AL1(5),AL2(AC@CNIND-PUDSLIST),AL1(COCONIND)                      
*                                                                               
PRDESC20 DC    AL2(AC@DSC22-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(2)                                                           
         DC    AL1(5),AL2(AC@COST-PUDSLIST),AL1(CODCOST)                        
         DC    AL1(5),AL2(AC@CNIND-PUDSLIST),AL1(COCONIND)                      
*                                                                               
PRDESC21 DC    AL2(AC@DSC23-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(4)                                                           
         DC    AL1(2),AL2(AC@PB-PUDSLIST),AL1(COSETB)                           
         DC    AL1(2),AL2(AC@PR-PUDSLIST),AL1(COSETR)                           
         DC    AL1(2),AL2(AC@PN-PUDSLIST),AL1(COSETN)                           
         DC    AL1(4),AL2(AC@PX-PUDSLIST),AL1(CONODEFL)                         
*                                                                               
PRDESC22 DC    AL2(AC@DSC24-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(0)                                                           
*                                                                               
PRDESC23 DC    AL2(AC@DSC31-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(3)                                                           
         DC    AL1(3),AL2(AC@NEW-PUDSLIST),AL1(CONEWST)                         
         DC    AL1(1),AL2(AC@OLD-PUDSLIST),AL1(COOLDUN)                         
         DC    AL1(3),AL2(AC@PX-PUDSLIST),AL1(CONONE)                           
*                                                                               
PRDESC24 DC    AL2(AC@DSC32-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(2)                                                           
         DC    AL1(1),AL2(AC@CAL-PUDSLIST),AL1(COCALMO)                         
         DC    AL1(1),AL2(AC@TIME-PUDSLIST),AL1(COTIMMO)                        
*                                                                               
PRDESC25 DC    AL2(AC@DSC33-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(0)                                                           
*                                                                               
PRDESC26 DC    AL2(AC@DSC34-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(0)                                                           
*                                                                               
PRDESC27 DC    AL2(AC@DSC35-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(2)                                                           
         DC    AL1(1),AL2(AC@CONCU-PUDSLIST),AL1(COCONCU)                       
         DC    AL1(1),AL2(AC@SEQNT-PUDSLIST),AL1(COSEQNT)                       
*                                                                               
PRDESC28 DC    AL2(AC@DSC38-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(0)                                                           
*                                                                               
*                                                                               
PRDESC29 DC    AL2(AC@DSC36-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(5)                                                           
         DC    AL1(2),AL2(AC@SAVED-PUDSLIST),AL1(COSAVED)                       
         DC    AL1(2),AL2(AC@SUBMD-PUDSLIST),AL1(COSUBMD)                       
         DC    AL1(2),AL2(AC@CLIAP-PUDSLIST),AL1(COCLAPR)                       
         DC    AL1(2),AL2(AC@LIMA-PUDSLIST),AL1(COLMAPR)                        
         DC    AL1(2),AL2(AC@FUAP1-PUDSLIST),AL1(COFUAPR)                       
*                                                                               
PRDESC30 DC    AL2(AC@DSC39-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(0)                                                           
*                                                                               
PRDESC31 DC    AL2(AC@DSC40-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(0)                                                           
*                                                                               
PRDESC32 DC    AL2(AC@DSC41-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(4)                                                           
         DC    AL1(1),AL2(AC@SUBD-PUDSLIST),AL1(COSET_S)   SUB DEP              
         DC    AL1(1),AL2(AC@PDPT-PUDSLIST),AL1(COSET_D)   DEP                  
         DC    AL1(1),AL2(AC@POFF-PUDSLIST),AL1(COSET_O)   OFF                  
         DC    AL1(1),AL2(AC@PAGY-PUDSLIST),AL1(COSET_A)   AGY                  
*                                                                               
PRDESC33 DC    AL2(AC@DSC42-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(3)                                                           
         DC    AL1(1),AL2(AC@PYES-PUDSLIST),AL1(COOPTYQ)   YES                  
         DC    AL1(1),AL2(AC@PNO-PUDSLIST),AL1(COOPTNQ)    NO                   
         DC    AL1(1),AL2(AC@TMPLT-PUDSLIST),AL1(COTEMPLA) TEMPLATE             
*                                                                               
PRDESC34 DC    AL2(AC@DSC43-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(0)                                                           
*                                                                               
PRDESC35 DC    AL2(AC@DSC44-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(3)                                                           
         DC    AL1(1),AL2(AC@PYES-PUDSLIST),AL1(COOPTYQ)   YES                  
         DC    AL1(1),AL2(AC@PNO-PUDSLIST),AL1(COOPTNQ)    NO                   
         DC    AL1(1),AL2(AC@COMP2-PUDSLIST),AL1(COOPTCQ)  COMPULSORY           
*                                                                               
PRDESC36 DC    AL2(AC@DSC45-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(0)                                                           
*                                                                               
PRDESC37 DC    AL2(AC@DSC46-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(4)                                                           
         DC    AL1(1),AL2(AC@CLINT-PUDSLIST),AL1(COCLIENT)   CLIENT             
         DC    AL1(1),AL2(AC@PRO-PUDSLIST),AL1(COPROD)       PRODUCT            
         DC    AL1(1),AL2(AC@JOB-PUDSLIST),AL1(COJOB)        JOB                
         DC    AL1(1),AL2(AC@NONE-PUDSLIST),AL1(CONONE)      NONE               
*                                                                               
PRDESC38 DC    AL2(AC@DSC47-PDSLIST)                         1-12               
         DC    AL2(0)                                        MONTHS             
         DC    AL1(0)                                                           
*                                                                               
PRDESC39 DC    AL2(AC@DSC48-PDSLIST)                         1-10               
         DC    AL2(0)                                        DAYS               
         DC    AL1(0)                                                           
*                                                                               
PRDESC40 DC    AL2(AC@DSC49-PDSLIST)                        B,R,N,C             
         DC    AL2(0)                                                           
         DC    AL1(0)                                                           
*                                                                               
PRDESC41 DC    AL2(AC@DSC50-PDSLIST)                        1-365 DAYS          
         DC    AL2(0)                                                           
         DC    AL1(0)                                                           
*                                                                               
PRDESC42 DC    AL2(AC@DSC51-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(5)                                                           
         DC    AL1(1),AL2(AC@PN-PUDSLIST),AL1(CONSRT)   STORED AS X'01'         
         DC    AL1(1),AL2(AC@R-PUDSLIST),AL1(COREJC)    STORED AS X'02'         
         DC    AL1(1),AL2(AC@I-PUDSLIST),AL1(COINPRG)   STORED AS X'03'         
         DC    AL1(1),AL2(AC@S-PUDSLIST),AL1(COSUBMT)   STORED AS X'04'         
         DC    AL1(1),AL2(AC@P-PUDSLIST),AL1(COPRTAP)   STORED AS X'05'         
         DC    X'00'               EOT                                          
*                                                                               
PRDESC43 DC    AL2(AC@DSC52-PDSLIST)                                            
         DC    AL2(0)                                                           
         DC    AL1(4)                                                           
         DC    AL1(1),AL2(AC@CLINT-PUDSLIST),AL1(COCLIENT)   CLIENT             
         DC    AL1(1),AL2(AC@PRO-PUDSLIST),AL1(COPROD)       PRODUCT            
         DC    AL1(1),AL2(AC@JOB-PUDSLIST),AL1(COJOB)        JOB                
                                                                                
         DC    X'00'               EOT                                          
*                                                                               
CTRYANY  EQU   0                                                                
CTRYNOT  EQU   X'80'                                                            
       ++INCLUDE FACTRYEQUS                                                     
*                                                                               
PDCLIST  DS    0C                  PROFILE DICTIONARY DC STATEMENTS             
         DCDDL AC#COP02,3                                                       
         DCDDL AC#COP02,8                                                       
         DCDDL AC#COP02,24                                                      
         DCDDL AC#COP04,3                                                       
         DCDDL AC#COP04,8                                                       
         DCDDL AC#COP04,24                                                      
         DCDDL AC#COP05,3                                                       
         DCDDL AC#COP05,8                                                       
         DCDDL AC#COP05,24                                                      
         DCDDL AC#COP06,3                                                       
         DCDDL AC#COP06,8                                                       
         DCDDL AC#COP06,24                                                      
         DCDDL AC#COP08,3                                                       
         DCDDL AC#COP08,8                                                       
         DCDDL AC#COP08,24                                                      
         DCDDL AC#COP10,3                                                       
         DCDDL AC#COP10,8                                                       
         DCDDL AC#COP10,24                                                      
         DCDDL AC#COP11,3                                                       
         DCDDL AC#COP11,8                                                       
         DCDDL AC#COP11,24                                                      
         DCDDL AC#COP12,3                                                       
         DCDDL AC#COP12,8                                                       
         DCDDL AC#COP12,24                                                      
         DCDDL AC#COP13,3                                                       
         DCDDL AC#COP13,8                                                       
         DCDDL AC#COP13,24                                                      
         DCDDL AC#COP14,3                                                       
         DCDDL AC#COP14,8                                                       
         DCDDL AC#COP14,24                                                      
         DCDDL AC#COP15,3                                                       
         DCDDL AC#COP15,8                                                       
         DCDDL AC#COP15,24                                                      
         DCDDL AC#COP16,3                                                       
         DCDDL AC#COP16,8                                                       
         DCDDL AC#COP16,24                                                      
         DCDDL AC#COP17,3                                                       
         DCDDL AC#COP17,8                                                       
         DCDDL AC#COP17,24                                                      
         DCDDL AC#COP18,3                                                       
         DCDDL AC#COP18,8                                                       
         DCDDL AC#COP18,24                                                      
         DCDDL AC#COP19,3                                                       
         DCDDL AC#COP19,8                                                       
         DCDDL AC#COP19,24                                                      
         DCDDL AC#COP20,3                                                       
         DCDDL AC#COP20,8                                                       
         DCDDL AC#COP20,24                                                      
         DCDDL AC#COP22,3                                                       
         DCDDL AC#COP22,8                                                       
         DCDDL AC#COP22,24                                                      
         DCDDL AC#COP24,3                                                       
         DCDDL AC#COP24,8                                                       
         DCDDL AC#COP24,24                                                      
         DCDDL AC#COP25,3                                                       
         DCDDL AC#COP25,8                                                       
         DCDDL AC#COP25,24                                                      
         DCDDL AC#COP26,3                                                       
         DCDDL AC#COP26,8                                                       
         DCDDL AC#COP26,24                                                      
         DCDDL AC#COP27,3                                                       
         DCDDL AC#COP27,8                                                       
         DCDDL AC#COP27,24                                                      
         DCDDL AC#COP28,3                                                       
         DCDDL AC#COP28,8                                                       
         DCDDL AC#COP28,24                                                      
         DCDDL AC#COP29,3                                                       
         DCDDL AC#COP29,8                                                       
         DCDDL AC#COP29,24                                                      
         DCDDL AC#COP30,3                                                       
         DCDDL AC#COP30,8                                                       
         DCDDL AC#COP30,24                                                      
         DCDDL AC#COP32,3                                                       
         DCDDL AC#COP32,8                                                       
         DCDDL AC#COP32,24                                                      
         DCDDL AC#COP34,3                                                       
         DCDDL AC#COP34,8                                                       
         DCDDL AC#COP34,24                                                      
         DCDDL AC#COP36,3                                                       
         DCDDL AC#COP36,8                                                       
         DCDDL AC#COP36,24                                                      
         DCDDL AC#COP38,3                                                       
         DCDDL AC#COP38,8                                                       
         DCDDL AC#COP38,24                                                      
         DCDDL AC#COP40,3                                                       
         DCDDL AC#COP40,8                                                       
         DCDDL AC#COP40,24                                                      
         DCDDL AC#COP42,3                                                       
         DCDDL AC#COP42,8                                                       
         DCDDL AC#COP42,24                                                      
         DCDDL AC#COP43,3                                                       
         DCDDL AC#COP43,8                                                       
         DCDDL AC#COP43,24                                                      
         DCDDL AC#COP44,3                                                       
         DCDDL AC#COP44,8                                                       
         DCDDL AC#COP44,24                                                      
         DCDDL AC#COP46,3                                                       
         DCDDL AC#COP46,8                                                       
         DCDDL AC#COP46,24                                                      
         DCDDL AC#COP49,3                                                       
         DCDDL AC#COP49,8                                                       
         DCDDL AC#COP49,24                                                      
         DCDDL AC#COP50,3                                                       
         DCDDL AC#COP50,8                                                       
         DCDDL AC#COP50,24                                                      
         DCDDL AC#COP52,3                                                       
         DCDDL AC#COP52,8                                                       
         DCDDL AC#COP52,24                                                      
         DCDDL AC#COP54,3                                                       
         DCDDL AC#COP54,8                                                       
         DCDDL AC#COP54,24                                                      
         DCDDL AC#COP56,3                                                       
         DCDDL AC#COP56,8                                                       
         DCDDL AC#COP56,24                                                      
         DCDDL AC#COP59,3                                                       
         DCDDL AC#COP59,8                                                       
         DCDDL AC#COP59,24                                                      
         DCDDL AC#COP60,3                                                       
         DCDDL AC#COP60,8                                                       
         DCDDL AC#COP60,24                                                      
         DCDDL AC#COP62,3                                                       
         DCDDL AC#COP62,8                                                       
         DCDDL AC#COP62,24                                                      
         DCDDL AC#COP64,3                                                       
         DCDDL AC#COP64,8                                                       
         DCDDL AC#COP64,24                                                      
         DCDDL AC#COP66,3                                                       
         DCDDL AC#COP66,8                                                       
         DCDDL AC#COP66,24                                                      
         DCDDL AC#COP69,3                                                       
         DCDDL AC#COP69,8                                                       
         DCDDL AC#COP69,24                                                      
         DCDDL AC#COP70,3                                                       
         DCDDL AC#COP70,8                                                       
         DCDDL AC#COP70,24                                                      
         DCDDL AC#COP71,3                                                       
         DCDDL AC#COP71,8                                                       
         DCDDL AC#COP71,24                                                      
         DCDDL AC#COP72,3                                                       
         DCDDL AC#COP72,8                                                       
         DCDDL AC#COP72,24                                                      
         DCDDL AC#COP74,3                                                       
         DCDDL AC#COP74,8                                                       
         DCDDL AC#COP74,24                                                      
         DCDDL AC#COP76,3                                                       
         DCDDL AC#COP76,8                                                       
         DCDDL AC#COP76,24                                                      
         DCDDL AC#COP80,3                                                       
         DCDDL AC#COP80,8                                                       
         DCDDL AC#COP80,24                                                      
         DCDDL AC#COP81,3                                                       
         DCDDL AC#COP81,8                                                       
         DCDDL AC#COP81,24                                                      
         DCDDL AC#COP82,3                                                       
         DCDDL AC#COP82,8                                                       
         DCDDL AC#COP82,24                                                      
         DCDDL AC#COP84,3                                                       
         DCDDL AC#COP84,8                                                       
         DCDDL AC#COP84,24                                                      
         DCDDL AC#COP85,3                                                       
         DCDDL AC#COP85,8                                                       
         DCDDL AC#COP85,24                                                      
         DCDDL AC#COP90,3                                                       
         DCDDL AC#COP90,8                                                       
         DCDDL AC#COP90,24                                                      
         DCDDL AC#COP92,3                                                       
         DCDDL AC#COP92,8                                                       
         DCDDL AC#COP92,24                                                      
         DCDDL AC#COP94,3                                                       
         DCDDL AC#COP94,8                                                       
         DCDDL AC#COP94,24                                                      
         DCDDL AC#COP96,3                                                       
         DCDDL AC#COP96,8                                                       
         DCDDL AC#COP96,24                                                      
         DCDDL AC#COP98,3                                                       
         DCDDL AC#COP98,8                                                       
         DCDDL AC#COP98,24                                                      
         DCDDL AC#CP099,3                                                       
         DCDDL AC#CP099,8                                                       
         DCDDL AC#CP099,24                                                      
         DCDDL AC#CP101,3                                                       
         DCDDL AC#CP101,8                                                       
         DCDDL AC#CP101,24                                                      
         DCDDL AC#CP102,3                                                       
         DCDDL AC#CP102,8                                                       
         DCDDL AC#CP102,24                                                      
         DCDDL AC#CP103,3                                                       
         DCDDL AC#CP103,8                                                       
         DCDDL AC#CP103,24                                                      
         DCDDL AC#CP104,3                                                       
         DCDDL AC#CP104,8                                                       
         DCDDL AC#CP104,24                                                      
         DCDDL AC#CP105,3                                                       
         DCDDL AC#CP105,8                                                       
         DCDDL AC#CP105,24                                                      
         DCDDL AC#CP106,3                                                       
         DCDDL AC#CP106,8                                                       
         DCDDL AC#CP106,24                                                      
         DCDDL AC#CP107,3                                                       
         DCDDL AC#CP107,8                                                       
         DCDDL AC#CP107,24                                                      
         DCDDL AC#CP108,3                                                       
         DCDDL AC#CP108,8                                                       
         DCDDL AC#CP108,24                                                      
         DCDDL AC#CP109,3                                                       
         DCDDL AC#CP109,8                                                       
         DCDDL AC#CP109,24                                                      
         DCDDL AC#CP110,3                                                       
         DCDDL AC#CP110,8                                                       
         DCDDL AC#CP110,24                                                      
         DCDDL AC#CP111,3                                                       
         DCDDL AC#CP111,8                                                       
         DCDDL AC#CP111,24                                                      
         DCDDL AC#CP112,3                                                       
         DCDDL AC#CP112,8                                                       
         DCDDL AC#CP112,24                                                      
         DCDDL AC#CP113,3                                                       
         DCDDL AC#CP113,8                                                       
         DCDDL AC#CP113,24                                                      
         DCDDL AC#CP114,3                                                       
         DCDDL AC#CP114,8                                                       
         DCDDL AC#CP114,24                                                      
         DCDDL AC#CP115,3                                                       
         DCDDL AC#CP115,8                                                       
         DCDDL AC#CP115,24                                                      
         DCDDL AC#CP116,3                                                       
         DCDDL AC#CP116,8                                                       
         DCDDL AC#CP116,24                                                      
         DCDDL AC#CP117,3                                                       
         DCDDL AC#CP117,8                                                       
         DCDDL AC#CP117,24                                                      
         DCDDL AC#CP118,3                                                       
         DCDDL AC#CP118,8                                                       
         DCDDL AC#CP118,24                                                      
         DCDDL AC#CP119,3                                                       
         DCDDL AC#CP119,8                                                       
         DCDDL AC#CP119,24                                                      
         DCDDL AC#CP120,3                                                       
         DCDDL AC#CP120,8                                                       
         DCDDL AC#CP120,24                                                      
         DCDDL AC#CP121,3                                                       
         DCDDL AC#CP121,8                                                       
         DCDDL AC#CP121,24                                                      
         DCDDL AC#CP122,3                                                       
         DCDDL AC#CP122,8                                                       
         DCDDL AC#CP122,24                                                      
         DCDDL AC#CP123,3                                                       
         DCDDL AC#CP123,8                                                       
         DCDDL AC#CP123,24                                                      
         DCDDL AC#CP124,3                                                       
         DCDDL AC#CP124,8                                                       
         DCDDL AC#CP124,24                                                      
         DCDDL AC#CP125,3                                                       
         DCDDL AC#CP125,8                                                       
         DCDDL AC#CP125,24                                                      
         DCDDL AC#CP126,3                                                       
         DCDDL AC#CP126,8                                                       
         DCDDL AC#CP126,24                                                      
*        DCDDL AC#CP127,3                                                       
*        DCDDL AC#CP127,8                                                       
*        DCDDL AC#CP127,24                                                      
         DCDDL AC#CP128,3                                                       
         DCDDL AC#CP128,8                                                       
         DCDDL AC#CP128,24                                                      
         DCDDL AC#CP129,3                                                       
         DCDDL AC#CP129,8                                                       
         DCDDL AC#CP129,24                                                      
         DCDDL AC#CP130,3                                                       
         DCDDL AC#CP130,8                                                       
         DCDDL AC#CP130,24                                                      
         DCDDL AC#CP131,3                                                       
         DCDDL AC#CP131,8                                                       
         DCDDL AC#CP131,24                                                      
         DCDDL AC#CP132,3                                                       
         DCDDL AC#CP132,8                                                       
         DCDDL AC#CP132,24                                                      
         DCDDL AC#CP133,3                                                       
         DCDDL AC#CP133,8                                                       
         DCDDL AC#CP133,24                                                      
         DCDDL AC#CP134,3                                                       
         DCDDL AC#CP134,8                                                       
         DCDDL AC#CP134,24                                                      
         DCDDL AC#CP135,3                                                       
         DCDDL AC#CP135,8                                                       
         DCDDL AC#CP135,24                                                      
         DCDDL AC#CP136,3                                                       
         DCDDL AC#CP136,8                                                       
         DCDDL AC#CP136,24                                                      
         DCDDL AC#CP137,3                                                       
         DCDDL AC#CP137,8                                                       
         DCDDL AC#CP137,24                                                      
         DCDDL AC#CP138,3                                                       
         DCDDL AC#CP138,8                                                       
         DCDDL AC#CP138,24                                                      
         DCDDL AC#CP139,3                                                       
         DCDDL AC#CP139,8                                                       
         DCDDL AC#CP139,24                                                      
         DCDDL AC#CP140,3                                                       
         DCDDL AC#CP140,8                                                       
         DCDDL AC#CP140,24                                                      
         DCDDL AC#CP141,3                                                       
         DCDDL AC#CP141,8                                                       
         DCDDL AC#CP141,24                                                      
         DCDDL AC#CP142,3                                                       
         DCDDL AC#CP142,8                                                       
         DCDDL AC#CP142,24                                                      
         DCDDL AC#CP143,3                                                       
         DCDDL AC#CP143,8                                                       
         DCDDL AC#CP143,24                                                      
         DCDDL AC#CP144,3                                                       
         DCDDL AC#CP144,8                                                       
         DCDDL AC#CP144,24                                                      
         DCDDL AC#CP145,3                                                       
         DCDDL AC#CP145,8                                                       
         DCDDL AC#CP145,24                                                      
         DCDDL AC#CP146,3                                                       
         DCDDL AC#CP146,8                                                       
         DCDDL AC#CP146,24                                                      
         DCDDL AC#CP147,3                                                       
         DCDDL AC#CP147,8                                                       
         DCDDL AC#CP147,24                                                      
         DCDDL AC#CP148,3                                                       
         DCDDL AC#CP148,8                                                       
         DCDDL AC#CP148,24                                                      
         DCDDL AC#CP149,3                                                       
         DCDDL AC#CP149,8                                                       
         DCDDL AC#CP149,24                                                      
         DCDDL AC#CP150,3                                                       
         DCDDL AC#CP150,8                                                       
         DCDDL AC#CP150,24                                                      
         DCDDL AC#CP151,3                                                       
         DCDDL AC#CP151,8                                                       
         DCDDL AC#CP151,24                                                      
         DCDDL AC#CP152,3                                                       
         DCDDL AC#CP152,8                                                       
         DCDDL AC#CP152,24                                                      
         DCDDL AC#CP153,3                                                       
         DCDDL AC#CP153,8                                                       
         DCDDL AC#CP153,24                                                      
         DCDDL AC#CP155,3                                                       
         DCDDL AC#CP155,8                                                       
         DCDDL AC#CP155,24                                                      
         DCDDL AC#CP156,3                                                       
         DCDDL AC#CP156,8                                                       
         DCDDL AC#CP156,24                                                      
         DCDDL AC#CP157,3                                                       
         DCDDL AC#CP157,8                                                       
         DCDDL AC#CP157,24                                                      
         DCDDL AC#CP158,3                                                       
         DCDDL AC#CP158,8                                                       
         DCDDL AC#CP158,24                                                      
         DCDDL AC#CP159,3                                                       
         DCDDL AC#CP159,8                                                       
         DCDDL AC#CP159,24                                                      
         DCDDL AC#CP160,3                                                       
         DCDDL AC#CP160,8                                                       
         DCDDL AC#CP160,24                                                      
         DCDDL AC#CP161,3                                                       
         DCDDL AC#CP161,8                                                       
         DCDDL AC#CP161,24                                                      
         DCDDL AC#CP162,3                                                       
         DCDDL AC#CP162,8                                                       
         DCDDL AC#CP162,24                                                      
         DCDDL AC#CP163,3                                                       
         DCDDL AC#CP163,8                                                       
         DCDDL AC#CP163,24                                                      
         DCDDL AC#CP164,3                                                       
         DCDDL AC#CP164,8                                                       
         DCDDL AC#CP164,24                                                      
         DCDDL AC#CP165,3                                                       
         DCDDL AC#CP165,8                                                       
         DCDDL AC#CP165,24                                                      
         DCDDL AC#CP166,3                                                       
         DCDDL AC#CP166,8                                                       
         DCDDL AC#CP166,24                                                      
         DCDDL AC#CP167,3                                                       
         DCDDL AC#CP167,8                                                       
         DCDDL AC#CP167,24                                                      
         DCDDL AC#CP168,3                                                       
         DCDDL AC#CP168,8                                                       
         DCDDL AC#CP168,24                                                      
         DCDDL AC#CP169,3                                                       
         DCDDL AC#CP169,8                                                       
         DCDDL AC#CP169,24                                                      
         DCDDL AC#CP170,3                                                       
         DCDDL AC#CP170,8                                                       
         DCDDL AC#CP170,24                                                      
         DCDDL AC#CP171,3                                                       
         DCDDL AC#CP171,8                                                       
         DCDDL AC#CP171,24                                                      
         DCDDL AC#CP172,3                                                       
         DCDDL AC#CP172,8                                                       
         DCDDL AC#CP172,24                                                      
         DCDDL AC#CP173,3                                                       
         DCDDL AC#CP173,8                                                       
         DCDDL AC#CP173,24                                                      
         DCDDL AC#CP174,3                                                       
         DCDDL AC#CP174,8                                                       
         DCDDL AC#CP174,24                                                      
         DCDDL AC#CP175,3                                                       
         DCDDL AC#CP175,8                                                       
         DCDDL AC#CP175,24                                                      
         DCDDL AC#CP176,3                                                       
         DCDDL AC#CP176,8                                                       
         DCDDL AC#CP176,24                                                      
         DCDDL AC#CP177,3                                                       
         DCDDL AC#CP177,8                                                       
         DCDDL AC#CP177,24                                                      
         DCDDL AC#CP178,3                                                       
         DCDDL AC#CP178,8                                                       
         DCDDL AC#CP178,24                                                      
         DCDDL AC#CP179,3                                                       
         DCDDL AC#CP179,8                                                       
         DCDDL AC#CP179,24                                                      
         DCDDL AC#CP180,3                                                       
         DCDDL AC#CP180,8                                                       
         DCDDL AC#CP180,24                                                      
         DCDDL AC#CP181,3                                                       
         DCDDL AC#CP181,8                                                       
         DCDDL AC#CP181,24                                                      
         DCDDL AC#CP182,3                                                       
         DCDDL AC#CP182,8                                                       
         DCDDL AC#CP182,24                                                      
         DCDDL AC#CP183,3                                                       
         DCDDL AC#CP183,8                                                       
         DCDDL AC#CP183,24                                                      
         DCDDL AC#CP184,3                                                       
         DCDDL AC#CP184,8                                                       
         DCDDL AC#CP184,24                                                      
         DCDDL AC#COPB8,3                                                       
         DCDDL AC#COPB8,8                                                       
         DCDDL AC#COPB8,24                                                      
         DCDDL AC#COP31,3                                                       
         DCDDL AC#COP31,8                                                       
         DCDDL AC#COP31,24                                                      
         DCDDL AC#CP187,3                                                       
         DCDDL AC#CP187,8                                                       
         DCDDL AC#CP187,24                                                      
         DCDDL AC#CP188,3                                                       
         DCDDL AC#CP188,8                                                       
         DCDDL AC#CP188,24                                                      
         DCDDL AC#CP189,3                                                       
         DCDDL AC#CP189,8                                                       
         DCDDL AC#CP189,24                                                      
         DCDDL AC#CDS01,40                                                      
         DCDDL AC#CDS02,40                                                      
         DCDDL AC#CDS03,40                                                      
         DCDDL AC#CDS04,40                                                      
         DCDDL AC#CDS05,40                                                      
         DCDDL AC#CDS06,40                                                      
         DCDDL AC#CDS07,40                                                      
         DCDDL AC#CDS08,40                                                      
         DCDDL AC#CDS09,40                                                      
         DCDDL AC#CDS10,40                                                      
         DCDDL AC#CDS11,40                                                      
         DCDDL AC#CDS12,40                                                      
         DCDDL AC#CDS13,40                                                      
         DCDDL AC#CDS14,40                                                      
         DCDDL AC#CDS15,40                                                      
         DCDDL AC#CDS16,40                                                      
         DCDDL AC#CDS17,40                                                      
         DCDDL AC#CDS18,40                                                      
         DCDDL AC#CDS19,40                                                      
         DCDDL AC#CDS20,40                                                      
         DCDDL AC#CDS21,40                                                      
         DCDDL AC#CDS22,40                                                      
         DCDDL AC#CDS23,40                                                      
         DCDDL AC#CDS24,40                                                      
         DCDDL AC#CDS25,40                                                      
         DCDDL AC#CDS26,40                                                      
         DCDDL AC#CDS27,40                                                      
         DCDDL AC#CDS28,40                                                      
         DCDDL AC#CDS29,40                                                      
         DCDDL AC#CDS30,40                                                      
         DCDDL AC#CDS31,40                                                      
         DCDDL AC#CDS32,40                                                      
         DCDDL AC#CDS33,40                                                      
         DCDDL AC#CDS34,40                                                      
         DCDDL AC#CDS35,40                                                      
         DCDDL AC#CDS36,40                                                      
         DCDDL AC#CDS38,40                                                      
         DCDDL AC#CDS39,40                                                      
         DCDDL AC#CDS40,40                                                      
         DCDDL AC#CDS41,40                                                      
         DCDDL AC#CDS42,40                                                      
         DCDDL AC#CDS43,40                                                      
         DCDDL AC#CDS44,40                                                      
         DCDDL AC#CDS45,40                                                      
         DCDDL AC#CDS46,40                                                      
         DCDDL AC#CDS47,40                                                      
         DCDDL AC#CDS48,40                                                      
         DCDDL AC#CDS49,40                                                      
         DCDDL AC#CDS50,40                                                      
         DCDDL AC#CDS51,40                                                      
         DCDDL AC#CDS52,40                                                      
PDCLISTX DC    X'00'                                                            
*                                                                               
PUDCLIST DS    0C                  PROFILE DICTIONARY DC STATEMENTS             
         DCDDL AC#MTH,8                                                         
         DCDDL AC#QTR,8                                                         
         DCDDL AC#RSRY2,8                                                       
         DCDDL AC#YES,8                                                         
         DCDDL AC#CNO,8                                                         
         DCDDL AC#DPT,8                                                         
         DCDDL AC#CPOFF,8                                                       
         DCDDL AC#CDS12,8                                                       
         DCDDL AC#CPRSN,8                                                       
         DCDDL AC#CLINT,8                                                       
         DCDDL AC#CPOLS,8                                                       
         DCDDL AC#CPCOF,8                                                       
         DCDDL AC#CPCOL,8                                                       
         DCDDL AC#CCOLS,8                                                       
         DCDDL AC#CCPFF,8                                                       
         DCDDL AC#BGER,8                                                        
         DCDDL AC#BPL,8                                                         
         DCDDL AC#NB,8                                                          
         DCDDL AC#NBPL,8                                                        
         DCDDL AC#INCM,8                                                        
         DCDDL AC#COST,8                                                        
         DCDDL AC#ONLY,8                                                        
         DCDDL AC#BDPL,8                                                        
         DCDDL AC#SUSP,8                                                        
         DCDDL AC#HOURS,8                                                       
         DCDDL AC#CNIND,8                                                       
         DCDDL AC#R,8                                                           
         DCDDL AC#N,8                                                           
         DCDDL AC#NONE,8                                                        
         DCDDL AC#X,8                                                           
         DCDDL AC#Y,8                                                           
         DCDDL AC#C,8                                                           
         DCDDL AC#NEW,8                                                         
         DCDDL AC#OLD,8                                                         
         DCDDL AC#CAL,8                                                         
         DCDDL AC#TIME,8                                                        
         DCDDL AC#CONCU,8                                                       
         DCDDL AC#SEQNT,8                                                       
         DCDDL AC#SAVED,8                                                       
         DCDDL AC#SUB,8                                                         
         DCDDL AC#LIMA,8                                                        
         DCDDL AC#FUAPR,8                                                       
         DCDDL AC#CLIAP,8                                                       
         DCDDL AC#SUBDP,8                                                       
         DCDDL AC#TMPLT,8          TEMPLATE                                     
         DCDDL AC#COMP2,8                                                       
         DCDDL AC#CLINT,8                                                       
         DCDDL AC#PRO,8                                                         
         DCDDL AC#JOB,8                                                         
         DCDDL AC#NONE,8                                                        
         DCDDL AC#R,8                                                           
         DCDDL AC#I,8                                                           
         DCDDL AC#S,8                                                           
         DCDDL AC#P,8                                                           
*                                                                               
         DCDDL AC#CRUN,28                                                       
         DCDDL AC#CDIR,28                                                       
         DCDDL AC#CINDR,28                                                      
         DCDDL AC#COVHD,28                                                      
         DCDDL AC#CPAY,28                                                       
         DCDDL AC#CNBIZ,28                                                      
         DCDDL AC#CPBON,28                                                      
         DCDDL AC#CHOUS,28                                                      
         DCDDL AC#CTIME,28                                                      
         DCDDL AC#CMCST,28                                                      
         DCDDL AC#CMCSX,28                                                      
         DCDDL AC#CMCXP,28                                                      
PUDCLSTX DC    X'00'                                                            
*                                                                               
