*          DATA SET ACCAPE2D   AT LEVEL 002 AS OF 12/11/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DE2D      DATE 12/11/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  L  P H             T        Y              
STDYEARH DS    XL8                                                              
STDYEAR  DS    CL4      5   10    4  A  U N             T        Y    2         
STDYEARX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   16    6  L  P N             T        Y  201         
         DS    XL8                                                              
STDOFFH  DS    XL8                                                              
STDOFF   DS    CL2      5   24    2  A  U N             T        Y    3         
STDOFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   28    4  L  P N             T        Y  202         
         DS    XL8                                                              
STDDEPTH DS    XL8                                                              
STDDEPT  DS    CL2      5   34    2  A  U N             T        Y    4         
STDDEPTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   38    6  L  P N             T        Y  203         
         DS    XL8                                                              
STDSDPTH DS    XL8                                                              
STDSDPT  DS    CL2      5   46    2  A  U N             T        Y    5         
STDSDPTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   50    6  L  P N             T        Y  204         
         DS    XL8                                                              
STDPERH  DS    XL8                                                              
STDPER   DS    CL7      5   58    7  A  U N             T        Y    6         
STDPERX  DS    XL8                                                              
STDDLYTH DS    XL8                                                              
STDDLYT  DS    CL6      5   67    6  L  P N             T        Y  205         
STDDLYTX DS    XL8                                                              
STDDLYH  DS    XL8                                                              
STDDLY   DS    CL4      5   74    4  A  U N             T        Y    7         
STDDLYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
STDTAGH  DS    XL8                                                              
STDTAG   DS    CL1      6    2    1  A  P N             T        Y              
STDLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
STDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 264  BYTES                            
