*          DATA SET ACCAPFAD   AT LEVEL 004 AS OF 11/10/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DFAD      DATE 11/10/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  L  P H             T        Y              
PAYMETHH DS    CL8                                                              
PAYMETH  DS    CL3      6   15    3  A  U N             T    I   Y              
PAYMENMH DS    CL8                                                              
PAYMENM  DS    CL36     6   25   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL5      7    7    5  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL15     7   14   15  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL5      7   31    5  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL40     7   38   40  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL1      8    2    1  A  P N             T        Y              
PAYFRSTH DS    CL8                                                              
PAYFRST  DS    CL3      9    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      9    7    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15     9   14   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   31    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40     9   38   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     10    7    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    10   14   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     10   31    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    10   38   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     11    7    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    11   14   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   31    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    11   38   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     12    7    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    12   14   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     12   31    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    12   38   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13    7    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    13   14   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   31    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    13   38   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     14    7    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    14   14   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   31    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    14   38   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     15    7    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    15   14   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   31    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    15   38   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     16    7    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    16   14   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     16   31    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    16   38   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17    7    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    17   14   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   31    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    17   38   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     18    7    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    18   14   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     18   31    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    18   38   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     19    7    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    19   14   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     19   31    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    19   38   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     20    7    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    20   14   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     20   31    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    20   38   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     21    7    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    21   14   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   31    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    21   38   40  A  U N             T        Y              
PAYLSTH  DS    CL8                                                              
PAYLST   DS    CL3     22    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     22    7    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    22   14   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     22   31    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL40    22   38   40  A  U N             T        Y              
PAYPFKYH DS    CL8                                                              
PAYPFKY  DS    CL79    24    2   79  A  P H             T        Y              
PAYLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PAYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1768 BYTES                            
