*          DATA SET ACCAPDDICT AT LEVEL 034 AS OF 07/05/20                      
*                                                                               
* COSTING PROFILE DITIONARY LIST USED BY ACCAPROTAB                             
*                                                                               
PDSLIST  DS    0C                                                               
AC@P02S  DS    CL3                 PROFILE DESCRIPTIONS                         
AC@P02M  DS    CL8                                                              
AC@P02L  DS    CL24                                                             
AC@P04S  DS    CL3                                                              
AC@P04M  DS    CL8                                                              
AC@P04L  DS    CL24                                                             
AC@P05S  DS    CL3                                                              
AC@P05M  DS    CL8                                                              
AC@P05L  DS    CL24                                                             
AC@P06S  DS    CL3                                                              
AC@P06M  DS    CL8                                                              
AC@P06L  DS    CL24                                                             
AC@P08S  DS    CL3                                                              
AC@P08M  DS    CL8                                                              
AC@P08L  DS    CL24                                                             
AC@P10S  DS    CL3                                                              
AC@P10M  DS    CL8                                                              
AC@P10L  DS    CL24                                                             
AC@P11S  DS    CL3                                                              
AC@P11M  DS    CL8                                                              
AC@P11L  DS    CL24                                                             
AC@P12S  DS    CL3                                                              
AC@P12M  DS    CL8                                                              
AC@P12L  DS    CL24                                                             
AC@P13S  DS    CL3                                                              
AC@P13M  DS    CL8                                                              
AC@P13L  DS    CL24                                                             
AC@P14S  DS    CL3                                                              
AC@P14M  DS    CL8                                                              
AC@P14L  DS    CL24                                                             
AC@P15S  DS    CL3                                                              
AC@P15M  DS    CL8                                                              
AC@P15L  DS    CL24                                                             
AC@P16S  DS    CL3                                                              
AC@P16M  DS    CL8                                                              
AC@P16L  DS    CL24                                                             
AC@P17S  DS    CL3                                                              
AC@P17M  DS    CL8                                                              
AC@P17L  DS    CL24                                                             
AC@P18S  DS    CL3                                                              
AC@P18M  DS    CL8                                                              
AC@P18L  DS    CL24                                                             
AC@P19S  DS    CL3                                                              
AC@P19M  DS    CL8                                                              
AC@P19L  DS    CL24                                                             
AC@P20S  DS    CL3                                                              
AC@P20M  DS    CL8                                                              
AC@P20L  DS    CL24                                                             
AC@P22S  DS    CL3                                                              
AC@P22M  DS    CL8                                                              
AC@P22L  DS    CL24                                                             
AC@P24S  DS    CL3                                                              
AC@P24M  DS    CL8                                                              
AC@P24L  DS    CL24                                                             
AC@P25S  DS    CL3                                                              
AC@P25M  DS    CL8                                                              
AC@P25L  DS    CL24                                                             
AC@P26S  DS    CL3                                                              
AC@P26M  DS    CL8                                                              
AC@P26L  DS    CL24                                                             
AC@P27S  DS    CL3                                                              
AC@P27M  DS    CL8                                                              
AC@P27L  DS    CL24                                                             
AC@P28S  DS    CL3                                                              
AC@P28M  DS    CL8                                                              
AC@P28L  DS    CL24                                                             
AC@P29S  DS    CL3                                                              
AC@P29M  DS    CL8                                                              
AC@P29L  DS    CL24                                                             
AC@P30S  DS    CL3                                                              
AC@P30M  DS    CL8                                                              
AC@P30L  DS    CL24                                                             
AC@P32S  DS    CL3                                                              
AC@P32M  DS    CL8                                                              
AC@P32L  DS    CL24                                                             
AC@P34S  DS    CL3                                                              
AC@P34M  DS    CL8                                                              
AC@P34L  DS    CL24                                                             
AC@P36S  DS    CL3                                                              
AC@P36M  DS    CL8                                                              
AC@P36L  DS    CL24                                                             
AC@P38S  DS    CL3                                                              
AC@P38M  DS    CL8                                                              
AC@P38L  DS    CL24                                                             
AC@P40S  DS    CL3                                                              
AC@P40M  DS    CL8                                                              
AC@P40L  DS    CL24                                                             
AC@P42S  DS    CL3                                                              
AC@P42M  DS    CL8                                                              
AC@P42L  DS    CL24                                                             
AC@P43S  DS    CL3                                                              
AC@P43M  DS    CL8                                                              
AC@P43L  DS    CL24                                                             
AC@P44S  DS    CL3                                                              
AC@P44M  DS    CL8                                                              
AC@P44L  DS    CL24                                                             
AC@P46S  DS    CL3                                                              
AC@P46M  DS    CL8                                                              
AC@P46L  DS    CL24                                                             
AC@P49S  DS    CL3                                                              
AC@P49M  DS    CL8                                                              
AC@P49L  DS    CL24                                                             
AC@P50S  DS    CL3                                                              
AC@P50M  DS    CL8                                                              
AC@P50L  DS    CL24                                                             
AC@P52S  DS    CL3                                                              
AC@P52M  DS    CL8                                                              
AC@P52L  DS    CL24                                                             
AC@P54S  DS    CL3                                                              
AC@P54M  DS    CL8                                                              
AC@P54L  DS    CL24                                                             
AC@P56S  DS    CL3                                                              
AC@P56M  DS    CL8                                                              
AC@P56L  DS    CL24                                                             
AC@P59S  DS    CL3                                                              
AC@P59M  DS    CL8                                                              
AC@P59L  DS    CL24                                                             
AC@P60S  DS    CL3                                                              
AC@P60M  DS    CL8                                                              
AC@P60L  DS    CL24                                                             
AC@P62S  DS    CL3                                                              
AC@P62M  DS    CL8                                                              
AC@P62L  DS    CL24                                                             
AC@P64S  DS    CL3                                                              
AC@P64M  DS    CL8                                                              
AC@P64L  DS    CL24                                                             
AC@P66S  DS    CL3                                                              
AC@P66M  DS    CL8                                                              
AC@P66L  DS    CL24                                                             
AC@P69S  DS    CL3                                                              
AC@P69M  DS    CL8                                                              
AC@P69L  DS    CL24                                                             
AC@P70S  DS    CL3                                                              
AC@P70M  DS    CL8                                                              
AC@P70L  DS    CL24                                                             
AC@P71S  DS    CL3                                                              
AC@P71M  DS    CL8                                                              
AC@P71L  DS    CL24                                                             
AC@P72S  DS    CL3                                                              
AC@P72M  DS    CL8                                                              
AC@P72L  DS    CL24                                                             
AC@P74S  DS    CL3                                                              
AC@P74M  DS    CL8                                                              
AC@P74L  DS    CL24                                                             
AC@P76S  DS    CL3                                                              
AC@P76M  DS    CL8                                                              
AC@P76L  DS    CL24                                                             
AC@P80S  DS    CL3                                                              
AC@P80M  DS    CL8                                                              
AC@P80L  DS    CL24                                                             
AC@P81S  DS    CL3                                                              
AC@P81M  DS    CL8                                                              
AC@P81L  DS    CL24                                                             
AC@P82S  DS    CL3                                                              
AC@P82M  DS    CL8                                                              
AC@P82L  DS    CL24                                                             
AC@P84S  DS    CL3                                                              
AC@P84M  DS    CL8                                                              
AC@P84L  DS    CL24                                                             
AC@P85S  DS    CL3                                                              
AC@P85M  DS    CL8                                                              
AC@P85L  DS    CL24                                                             
AC@P90S  DS    CL3                                                              
AC@P90M  DS    CL8                                                              
AC@P90L  DS    CL24                                                             
AC@P92S  DS    CL3                                                              
AC@P92M  DS    CL8                                                              
AC@P92L  DS    CL24                                                             
AC@P94S  DS    CL3                                                              
AC@P94M  DS    CL8                                                              
AC@P94L  DS    CL24                                                             
AC@P96S  DS    CL3                                                              
AC@P96M  DS    CL8                                                              
AC@P96L  DS    CL24                                                             
AC@P98S  DS    CL3                                                              
AC@P98M  DS    CL8                                                              
AC@P98L  DS    CL24                                                             
AC3P099  DS    CL3                                                              
AC8P099  DS    CL8                                                              
AC@P099  DS    CL24                                                             
AC3P101  DS    CL3                                                              
AC8P101  DS    CL8                                                              
AC@P101  DS    CL24                                                             
AC3P102  DS    CL3                                                              
AC8P102  DS    CL8                                                              
AC@P102  DS    CL24                                                             
AC3P103  DS    CL3                                                              
AC8P103  DS    CL8                                                              
AC@P103  DS    CL24                                                             
AC3P104  DS    CL3                                                              
AC8P104  DS    CL8                                                              
AC@P104  DS    CL24                                                             
AC3P105  DS    CL3                                                              
AC8P105  DS    CL8                                                              
AC@P105  DS    CL24                                                             
AC3P106  DS    CL3                                                              
AC8P106  DS    CL8                                                              
AC@P106  DS    CL24                                                             
AC3P107  DS    CL3                                                              
AC8P107  DS    CL8                                                              
AC@P107  DS    CL24                                                             
AC3P108  DS    CL3                                                              
AC8P108  DS    CL8                                                              
AC@P108  DS    CL24                                                             
AC3P109  DS    CL3                                                              
AC8P109  DS    CL8                                                              
AC@P109  DS    CL24                                                             
AC3P110  DS    CL3                                                              
AC8P110  DS    CL8                                                              
AC@P110  DS    CL24                                                             
AC3P111  DS    CL3                                                              
AC8P111  DS    CL8                                                              
AC@P111  DS    CL24                                                             
AC3P112  DS    CL3                                                              
AC8P112  DS    CL8                                                              
AC@P112  DS    CL24                                                             
AC3P113  DS    CL3                                                              
AC8P113  DS    CL8                                                              
AC@P113  DS    CL24                                                             
AC3P114  DS    CL3                                                              
AC8P114  DS    CL8                                                              
AC@P114  DS    CL24                                                             
AC3P115  DS    CL3                                                              
AC8P115  DS    CL8                                                              
AC@P115  DS    CL24                                                             
AC3P116  DS    CL3                                                              
AC8P116  DS    CL8                                                              
AC@P116  DS    CL24                                                             
AC3P117  DS    CL3                                                              
AC8P117  DS    CL8                                                              
AC@P117  DS    CL24                                                             
AC3P118  DS    CL3                                                              
AC8P118  DS    CL8                                                              
AC@P118  DS    CL24                                                             
AC3P119  DS    CL3                                                              
AC8P119  DS    CL8                                                              
AC@P119  DS    CL24                                                             
AC3P120  DS    CL3                                                              
AC8P120  DS    CL8                                                              
AC@P120  DS    CL24                                                             
AC3P121  DS    CL3                                                              
AC8P121  DS    CL8                                                              
AC@P121  DS    CL24                                                             
AC3P122  DS    CL3                                                              
AC8P122  DS    CL8                                                              
AC@P122  DS    CL24                                                             
AC3P123  DS    CL3                                                              
AC8P123  DS    CL8                                                              
AC@P123  DS    CL24                                                             
AC3P124  DS    CL3                                                              
AC8P124  DS    CL8                                                              
AC@P124  DS    CL24                                                             
AC3P125  DS    CL3                                                              
AC8P125  DS    CL8                                                              
AC@P125  DS    CL24                                                             
AC3P126  DS    CL3                                                              
AC8P126  DS    CL8                                                              
AC@P126  DS    CL24                                                             
*C3P127  DS    CL3                                                              
*C8P127  DS    CL8                                                              
*C@P127  DS    CL24                                                             
AC3P128  DS    CL3                                                              
AC8P128  DS    CL8                                                              
AC@P128  DS    CL24                                                             
AC3P129  DS    CL3                                                              
AC8P129  DS    CL8                                                              
AC@P129  DS    CL24                                                             
AC3P130  DS    CL3                                                              
AC8P130  DS    CL8                                                              
AC@P130  DS    CL24                                                             
AC3P131  DS    CL3                                                              
AC8P131  DS    CL8                                                              
AC@P131  DS    CL24                                                             
AC3P132  DS    CL3                                                              
AC8P132  DS    CL8                                                              
AC@P132  DS    CL24                                                             
AC3P133  DS    CL3                                                              
AC8P133  DS    CL8                                                              
AC@P133  DS    CL24                                                             
AC3P134  DS    CL3                                                              
AC8P134  DS    CL8                                                              
AC@P134  DS    CL24                                                             
AC3P135  DS    CL3                                                              
AC8P135  DS    CL8                                                              
AC@P135  DS    CL24                                                             
AC3P136  DS    CL3                                                              
AC8P136  DS    CL8                                                              
AC@P136  DS    CL24                                                             
AC3P137  DS    CL3                                                              
AC8P137  DS    CL8                                                              
AC@P137  DS    CL24                                                             
AC3P138  DS    CL3                                                              
AC8P138  DS    CL8                                                              
AC@P138  DS    CL24                                                             
AC3P139  DS    CL3                                                              
AC8P139  DS    CL8                                                              
AC@P139  DS    CL24                                                             
AC3P140  DS    CL3                                                              
AC8P140  DS    CL8                                                              
AC@P140  DS    CL24                                                             
AC3P141  DS    CL3                                                              
AC8P141  DS    CL8                                                              
AC@P141  DS    CL24                                                             
AC3P142  DS    CL3                                                              
AC8P142  DS    CL8                                                              
AC@P142  DS    CL24                                                             
AC3P143  DS    CL3                                                              
AC8P143  DS    CL8                                                              
AC@P143  DS    CL24                                                             
AC3P144  DS    CL3                                                              
AC8P144  DS    CL8                                                              
AC@P144  DS    CL24                                                             
AC3P145  DS    CL3                                                              
AC8P145  DS    CL8                                                              
AC@P145  DS    CL24                                                             
AC3P146  DS    CL3                                                              
AC8P146  DS    CL8                                                              
AC@P146  DS    CL24                                                             
AC3P147  DS    CL3                                                              
AC8P147  DS    CL8                                                              
AC@P147  DS    CL24                                                             
AC3P148  DS    CL3                                                              
AC8P148  DS    CL8                                                              
AC@P148  DS    CL24                                                             
AC3P149  DS    CL3                                                              
AC8P149  DS    CL8                                                              
AC@P149  DS    CL24                                                             
AC3P150  DS    CL3                                                              
AC8P150  DS    CL8                                                              
AC@P150  DS    CL24                                                             
AC3P151  DS    CL3                                                              
AC8P151  DS    CL8                                                              
AC@P151  DS    CL24                                                             
AC3P152  DS    CL3                                                              
AC8P152  DS    CL8                                                              
AC@P152  DS    CL24                                                             
AC3P153  DS    CL3                                                              
AC8P153  DS    CL8                                                              
AC@P153  DS    CL24                                                             
AC3P155  DS    CL3                                                              
AC8P155  DS    CL8                                                              
AC@P155  DS    CL24                                                             
AC3P156  DS    CL3                                                              
AC8P156  DS    CL8                                                              
AC@P156  DS    CL24                                                             
AC3P157  DS    CL3                                                              
AC8P157  DS    CL8                                                              
AC@P157  DS    CL24                                                             
AC3P158  DS    CL3                                                              
AC8P158  DS    CL8                                                              
AC@P158  DS    CL24                                                             
AC3P159  DS    CL3                                                              
AC8P159  DS    CL8                                                              
AC@P159  DS    CL24                                                             
AC3P160  DS    CL3                                                              
AC8P160  DS    CL8                                                              
AC@P160  DS    CL24                                                             
AC3P161  DS    CL3                                                              
AC8P161  DS    CL8                                                              
AC@P161  DS    CL24                                                             
AC3P162  DS    CL3                                                              
AC8P162  DS    CL8                                                              
AC@P162  DS    CL24                                                             
AC3P163  DS    CL3                                                              
AC8P163  DS    CL8                                                              
AC@P163  DS    CL24                                                             
AC3P164  DS    CL3                                                              
AC8P164  DS    CL8                                                              
AC@P164  DS    CL24                                                             
AC3P165  DS    CL3                                                              
AC8P165  DS    CL8                                                              
AC@P165  DS    CL24                                                             
AC3P166  DS    CL3                                                              
AC8P166  DS    CL8                                                              
AC@P166  DS    CL24                                                             
AC3P167  DS    CL3                                                              
AC8P167  DS    CL8                                                              
AC@P167  DS    CL24                                                             
AC3P168  DS    CL3                                                              
AC8P168  DS    CL8                                                              
AC@P168  DS    CL24                                                             
AC3P169  DS    CL3                                                              
AC8P169  DS    CL8                                                              
AC@P169  DS    CL24                                                             
AC3P170  DS    CL3                                                              
AC8P170  DS    CL8                                                              
AC@P170  DS    CL24                                                             
AC3P171  DS    CL3                                                              
AC8P171  DS    CL8                                                              
AC@P171  DS    CL24                                                             
AC3P172  DS    CL3                                                              
AC8P172  DS    CL8                                                              
AC@P172  DS    CL24                                                             
AC3P173  DS    CL3                                                              
AC8P173  DS    CL8                                                              
AC@P173  DS    CL24                                                             
AC3P174  DS    CL3                                                              
AC8P174  DS    CL8                                                              
AC@P174  DS    CL24                                                             
AC3P175  DS    CL3                                                              
AC8P175  DS    CL8                                                              
AC@P175  DS    CL24                                                             
AC3P176  DS    CL3                                                              
AC8P176  DS    CL8                                                              
AC@P176  DS    CL24                                                             
AC3P177  DS    CL3                                                              
AC8P177  DS    CL8                                                              
AC@P177  DS    CL24                                                             
AC3P178  DS    CL3                                                              
AC8P178  DS    CL8                                                              
AC@P178  DS    CL24                                                             
AC3P179  DS    CL3                                                              
AC8P179  DS    CL8                                                              
AC@P179  DS    CL24                                                             
AC3P180  DS    CL3                                                              
AC8P180  DS    CL8                                                              
AC@P180  DS    CL24                                                             
AC3P181  DS    CL3                                                              
AC8P181  DS    CL8                                                              
AC@P181  DS    CL24                                                             
AC3P182  DS    CL3                                                              
AC8P182  DS    CL8                                                              
AC@P182  DS    CL24                                                             
AC3P183  DS    CL3                                                              
AC8P183  DS    CL8                                                              
AC@P183  DS    CL24                                                             
AC3P184  DS    CL3                                                              
AC8P184  DS    CL8                                                              
AC@P184  DS    CL24                                                             
AC3P185  DS    CL3                                                              
AC8P185  DS    CL8                                                              
AC@P185  DS    CL24                                                             
AC3P186  DS    CL3                                                              
AC8P186  DS    CL8                                                              
AC@P186  DS    CL24                                                             
AC3P187  DS    CL3                                                              
AC8P187  DS    CL8                                                              
AC@P187  DS    CL24                                                             
AC3P188  DS    CL3                                                              
AC8P188  DS    CL8                                                              
AC@P188  DS    CL24                                                             
AC3P189  DS    CL3                                                              
AC8P189  DS    CL8                                                              
AC@P189  DS    CL24                                                             
*                                                                               
AC@DSC01 DS    CL40                VALID SETTINGS DESCRIPTIONS                  
AC@DSC02 DS    CL40                                                             
AC@DSC03 DS    CL40                                                             
AC@DSC04 DS    CL40                                                             
AC@DSC05 DS    CL40                                                             
AC@DSC06 DS    CL40                                                             
AC@DSC07 DS    CL40                                                             
AC@DSC08 DS    CL40                                                             
AC@DSC09 DS    CL40                                                             
AC@DSC10 DS    CL40                                                             
AC@DSC11 DS    CL40                                                             
AC@DSC12 DS    CL40                                                             
AC@DSC13 DS    CL40                                                             
AC@DSC14 DS    CL40                                                             
AC@DSC15 DS    CL40                                                             
AC@DSC16 DS    CL40                                                             
AC@DSC17 DS    CL40                                                             
AC@DSC18 DS    CL40                                                             
AC@DSC19 DS    CL40                                                             
AC@DSC20 DS    CL40                                                             
AC@DSC21 DS    CL40                                                             
AC@DSC22 DS    CL40                                                             
AC@DSC23 DS    CL40                                                             
AC@DSC24 DS    CL40                                                             
AC@DSC25 DS    CL40                                                             
AC@DSC26 DS    CL40                                                             
AC@DSC27 DS    CL40                                                             
AC@DSC28 DS    CL40                                                             
AC@DSC29 DS    CL40                                                             
AC@DSC30 DS    CL40                                                             
AC@DSC31 DS    CL40                                                             
AC@DSC32 DS    CL40                                                             
AC@DSC33 DS    CL40                                                             
AC@DSC34 DS    CL40                                                             
AC@DSC35 DS    CL40                                                             
AC@DSC36 DS    CL40                                                             
AC@DSC38 DS    CL40                                                             
AC@DSC39 DS    CL40                                                             
AC@DSC40 DS    CL40                                                             
AC@DSC41 DS    CL40                                                             
AC@DSC42 DS    CL40                                                             
AC@DSC43 DS    CL40                                                             
AC@DSC44 DS    CL40                                                             
AC@DSC45 DS    CL40                                                             
AC@DSC46 DS    CL40                                                             
AC@DSC47 DS    CL40                                                             
AC@DSC48 DS    CL40                                                             
AC@DSC49 DS    CL40                                                             
AC@DSC50 DS    CL40                                                             
AC@DSC51 DS    CL40                                                             
AC@DSC52 DS    CL40                                                             
PDSLISTX EQU   *                                                                
*                                                                               
PUDSLIST DS    0C                  UPPERCASE FOR VALID SETTINGS                 
AC@PMTH  DS    CL8                                                              
AC@PQTR  DS    CL8                                                              
AC@PYTD  DS    CL8                                                              
AC@PYES  DS    CL8                                                              
AC@PNO   DS    CL8                                                              
AC@PDPT  DS    CL8                                                              
AC@POFF  DS    CL8                                                              
AC@PAGY  DS    CL8                                                              
AC@PPER  DS    CL8                                                              
AC@PCLI  DS    CL8                                                              
AC@POLI  DS    CL8                                                              
AC@PCOF  DS    CL8                                                              
AC@PCLS  DS    CL8                                                              
AC@CLIST DS    CL8                                                              
AC@COLST DS    CL8                                                              
AC@PB    DS    CL8                                                              
AC@PBPL  DS    CL8                                                              
AC@PNB   DS    CL8                                                              
AC@PNBPL DS    CL8                                                              
AC@INCM  DS    CL8                                                              
AC@COST  DS    CL8                                                              
AC@PONLY DS    CL8                                                              
AC@PBDPL DS    CL8                                                              
AC@SUSP  DS    CL8                                                              
AC@HOURS DS    CL8                                                              
AC@CNIND DS    CL8                                                              
AC@PR    DS    CL8                                                              
AC@PN    DS    CL8                                                              
AC@PX    DS    CL8                                                              
AC@PX2   DS    CL8                                                              
AC@PY    DS    CL8                                                              
AC@PC2   DS    CL8                                                              
AC@NEW   DS    CL8                                                              
AC@OLD   DS    CL8                                                              
AC@CAL   DS    CL8                                                              
AC@TIME  DS    CL8                                                              
AC@CONCU DS    CL8                                                              
AC@SEQNT DS    CL8                                                              
AC@SAVED DS    CL8                                                              
AC@SUBMD DS    CL8                                                              
AC@LIMA  DS    CL8                                                              
AC@FUAP1 DS    CL8                                                              
AC@CLIAP DS    CL8                                                              
AC@SUBD  DS    CL8                                                              
AC@TMPLT DS    CL8                 TEMPLATE                                     
AC@COMP2 DS    CL8                 COMPULSORY                                   
AC@CLINT DS    CL8                 *                                            
AC@PRO   DS    CL8                 *                                            
AC@JOB   DS    CL8                 *                                            
AC@NONE  DS    CL8                 *                                            
AC@R     DS    CL8                                                              
AC@I     DS    CL8                                                              
AC@S     DS    CL8                                                              
AC@P     DS    CL8                                                              
*                                                                               
AC@CRUN  DS    CL28                                                             
AC@CDIR  DS    CL28                                                             
AC@CINDR DS    CL28                                                             
AC@COVHD DS    CL28                                                             
AC@CPAY  DS    CL28                                                             
AC@CNBIZ DS    CL28                                                             
AC@CPBON DS    CL28                                                             
AC@CHOUS DS    CL28                                                             
AC@CTIME DS    CL28                                                             
AC@CMCST DS    CL28                                                             
AC@CMCSX DS    CL28                                                             
AC@CMCXP DS    CL28                                                             
PUDSLSTX EQU   *                                                                
*                                                                               
