*          DATA SET ACCAPF4D   AT LEVEL 004 AS OF 08/15/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DF4D      DATE 08/15/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      6    2    8  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      6   11    8  L  P H             T        Y  204         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL21     6   20   21  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL5      6   42    5  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL11     6   48   11  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL21     6   60   21  L  P H             T        Y              
MADFRSTH DS    CL8                                                              
MADFRST  DS    CL8      7    2    8  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL8      7   11    8  A  U N             T        Y              
MADNAMEH DS    CL8                                                              
MADNAME  DS    CL21     7   20   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      7   42    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     7   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21     7   60   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      8    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      8   11    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21     8   20   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      8   42    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     8   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21     8   60   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      9    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      9   11    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21     9   20   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      9   42    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     9   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21     9   60   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     10    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   11    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    10   20   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     10   42    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    10   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    10   60   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   11    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    11   20   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   42    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    11   60   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   11    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    12   20   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   42    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    12   60   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   11    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    13   20   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   42    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    13   60   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   11    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    14   20   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   42    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    14   60   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   11    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    15   20   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   42    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    15   60   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   11    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    16   20   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   42    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    16   60   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   11    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    17   20   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   42    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    17   60   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   11    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    18   20   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   42    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    18   60   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   11    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    19   20   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   42    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    19   60   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   11    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    20   20   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   42    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    20   60   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   11    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    21   20   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   42    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    21   60   21  A  U N             T        Y              
MADLSTH  DS    CL8                                                              
MADLST   DS    CL8     22    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   11    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    22   20   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   42    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   48   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    22   60   21  A  U N             T        Y              
MADPFKYH DS    CL8                                                              
MADPFKY  DS    CL79    24    2   79  A  P H             T        Y              
MADLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
MADWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2176 BYTES                            
