*          DATA SET ACCAPF2D   AT LEVEL 001 AS OF 10/28/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DF2D      DATE 10/28/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SHLDETLH DS    CL8                                                              
SHLDETL  DS    CL50     5    2   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      6    2    4  L  P N             T        Y              
SHLMOAH  DS    CL8                                                              
SHLMOA   DS    CL15     6   10   15  A  U N             T        Y    1         
SHLMOAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   28    7  L  P N             T        Y              
SHLMETHH DS    CL8                                                              
SHLMETH  DS    CL3      6   38    3  A  U N             T        Y              
SHLMNMEH DS    CL8                                                              
SHLMNME  DS    CL34     6   46   34  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  L  P H             T        Y  204         
         DS    CL8                                                              
SHLPERH  DS    CL8                                                              
SHLPER   DS    CL8      7   10    8  A  U N             T        Y              
SHLNAMEH DS    CL8                                                              
SHLNAME  DS    CL45     7   20   45  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8    2    6  L  P N             T        Y  201         
         DS    CL8                                                              
SHLOFFH  DS    CL8                                                              
SHLOFF   DS    CL2      8   10    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   20    4  L  P N             T        Y  202         
         DS    CL8                                                              
SHLDEPTH DS    CL8                                                              
SHLDEPT  DS    CL6      8   28    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   38    6  L  P N             T        Y  203         
         DS    CL8                                                              
SHLSDPTH DS    CL8                                                              
SHLSDPT  DS    CL6      8   46    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      9    9    8  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      9   19    8  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      9   30    8  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      9   42    8  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      9   53    8  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      9   70    8  L  P H             T        Y              
SHLSELH  DS    CL8                                                              
SHLSEL   DS    CL3     10    2    3  A  U N             T        Y    3         
SHLSELX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  P N             T        Y    3         
         DS    CL8                                                              
SHLTOTLH DS    CL8                                                              
SHLTOTL  DS    CL74    22    7   74  A  P N             T        Y              
SHLPFKYH DS    CL8                                                              
SHLPFKY  DS    CL79    24    2   79  A  P H             T        Y              
SHLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SHLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1888 BYTES                            
