*          DATA SET ACCAPE6D   AT LEVEL 005 AS OF 08/15/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DE6D      DATE 08/15/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  L  P N             T        Y  201         
         DS    CL8                                                              
OVLOFFH  DS    CL8                                                              
OVLOFF   DS    CL2      6   10    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      6   14    4  L  P N             T        Y  202         
         DS    CL8                                                              
OVLDEPTH DS    CL8                                                              
OVLDEPT  DS    CL6      6   20    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6   28    6  L  P N             T        Y  203         
         DS    CL8                                                              
OVLSDPTH DS    CL8                                                              
OVLSDPT  DS    CL6      6   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6   44    6  L  P N             T        Y              
OVLPERH  DS    CL8                                                              
OVLPER   DS    CL8      6   52    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      8    9    6  L  P H             T        Y  201         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      8   17    6  L  P H             T        Y  202         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      8   25    6  L  P H             T        Y  203         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      8   33    8  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL35     8   43   35  L  P H             T        Y              
OVLSELH  DS    CL8                                                              
OVLSEL   DS    CL3      9    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74     9    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
OVLPFKYH DS    CL8                                                              
OVLPFKY  DS    CL79    24    2   79  A  P H             T        Y              
OVLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
OVLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1672 BYTES                            
