*          DATA SET ACCAPECD   AT LEVEL 007 AS OF 12/11/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DECD      DATE 12/11/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL20     6    2   20  L  P H             T        Y              
DLYPCTH  DS    XL8                                                              
DLYPCT   DS    CL6      6   25    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      7    2    3  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL14     7    9   14  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      7   25    6  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL30     7   33   30  L  P H             T        Y              
DLYSELH  DS    XL8                                                              
DLYSEL   DS    CL3      9    2    3  A  U N             T        Y    1         
DLYSELX  DS    XL8                                                              
DLYDAYH  DS    XL8                                                              
DLYDAY   DS    CL14     9    9   14  L  P N             T        Y              
DLYHRSH  DS    XL8                                                              
DLYHRS   DS    CL6      9   25    6  A  U N             T        Y    2         
DLYHRSX  DS    XL8                                                              
DLYEXCH  DS    XL8                                                              
DLYEXC   DS    CL6      9   40    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    11    9   14  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     11   25    6  A  U N             T        Y    2         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     11   40    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    13    9   14  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     13   25    6  A  U N             T        Y    2         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     13   40    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    15    9   14  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     15   25    6  A  U N             T        Y    2         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     15   40    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    17    9   14  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     17   25    6  A  U N             T        Y    2         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     17   40    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    19    9   14  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     19   25    6  A  U N             T        Y    2         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     19   40    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    1         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    21    9   14  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     21   25    6  A  U N             T        Y    2         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     21   40    6  A  P N             T        Y              
DLYPFKYH DS    XL8                                                              
DLYPFKY  DS    CL70    24    2   70  A  P H             T        Y              
DLYTAGH  DS    XL8                                                              
DLYTAG   DS    CL1     24   78    1  A  P N             T        Y              
DLYLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DLYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 760  BYTES                            
