*          DATA SET ACCAPD3D   AT LEVEL 001 AS OF 12/12/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DD3D      DATE 12/12/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
REPLOCSH DS    XL8                                                              
REPLOCS  DS    CL55     5   20   55  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  L  P H             T        Y              
REPPERH  DS    XL8                                                              
REPPER   DS    CL9      6   10    9  A  U H             T    I   Y              
REPPDESH DS    XL8                                                              
REPPDES  DS    CL30     6   20   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7    2    6  L  P H             T        Y  204         
         DS    XL8                                                              
REPCODEH DS    XL8                                                              
REPCODE  DS    CL8      7   10    8  A  U H             T        Y              
REPNAMEH DS    XL8                                                              
REPNAME  DS    CL21     7   20   21  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      8    2    6  L  P N             T        Y  201         
         DS    XL8                                                              
REPOFFCH DS    XL8                                                              
REPOFFC  DS    CL6      8   10    6  A  P N             T        Y              
REPOFNMH DS    XL8                                                              
REPOFNM  DS    CL16     8   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      9    2    4  L  P N             T        Y  202         
         DS    XL8                                                              
REPDEPTH DS    XL8                                                              
REPDEPT  DS    CL6      9   10    6  A  P N             T        Y              
REPDPNMH DS    XL8                                                              
REPDPNM  DS    CL16     9   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     10    2    6  L  P N             T        Y  203         
         DS    XL8                                                              
REPSDPTH DS    XL8                                                              
REPSDPT  DS    CL6     10   10    6  A  P N             T        Y              
REPSDNMH DS    XL8                                                              
REPSDNM  DS    CL16    10   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     10   79    1  A  P N             T        Y              
REPPFKYH DS    XL8                                                              
REPPFKY  DS    CL78    24    2   78  A  P N             T        Y              
REPLAST  DS    XL1                                                              
         DS    XL2    INDICS=11                                                 
REPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 480  BYTES                            
