*          DATA SET ACCAPD1D   AT LEVEL 002 AS OF 04/28/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DD1D      DATE 04/28/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL2      5    2    2  A  P H             T        Y  199         
         DS    CL8                                                              
CLLYEARH DS    CL8                                                              
CLLYEAR  DS    CL4      5    7    4  A  U N             T        Y    1         
CLLYEARX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      6    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      6    7    4  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      6   13    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      6   38    6  A  P H             T        Y  201         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      7    7    4  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL23     7   13   23  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      7   38    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
CLLACTH  DS    CL8                                                              
CLLACT   DS    CL3      8    2    3  A  U N             T    I   Y              
CLLLINEH DS    CL8                                                              
CLLLINE  DS    CL33     8    7   33  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL33     9    7   33  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL33    10    7   33  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL33    11    7   33  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL33    12    7   33  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL33    13    7   33  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL33    14    7   33  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL33    15    7   33  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL33    16    7   33  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL33    17    7   33  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL33    18    7   33  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL33    19    7   33  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL33    20    7   33  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL33    21    7   33  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL33    22    7   33  A  P N             T        Y              
CLLPFKYH DS    CL8                                                              
CLLPFKY  DS    CL78    24    2   78  A  P H             T        Y              
CLLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CLLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1048 BYTES                            
