*          DATA SET ACCAPDISTB AT LEVEL 022 AS OF 07/05/20                      
*                                                                               
* COBLOCK DISPLACEMENT TABLE FOR GETCAP COVERED BY CODISPD                      
*                                                                               
         DS    0D                                                               
CDISTAB  DS    0CL(CODSLEN)                                                     
*                                                                               
         DC    AL1(CORUN#),AL1(L'CORUN)                                         
         DC    Y(CORUN-COPTIONS)                                                
*                                                                               
         DC    AL1(COSTD#),AL1(L'COSTD)                                         
         DC    Y(COSTD-COPTIONS)                                                
*                                                                               
         DC    AL1(COCON#),AL1(L'COCON)                                         
         DC    Y(COCON-COPTIONS)                                                
*                                                                               
         DC    AL1(COLOK#),AL1(L'COLOK)                                         
         DC    Y(COLOK-COPTIONS)                                                
*                                                                               
         DC    AL1(COINC#),AL1(L'COINC)                                         
         DC    Y(COINC-COPTIONS)                                                
*                                                                               
         DC    AL1(COEXEC#),AL1(L'COEXEC)                                       
         DC    Y(COEXEC-COPTIONS)                                               
*                                                                               
         DC    AL1(COHRRAT#),AL1(L'COHRRAT)                                     
         DC    Y(COHRRAT-COPTIONS)                                              
*                                                                               
         DC    AL1(COONUPD#),AL1(L'COONUPD)                                     
         DC    Y(COONUPD-COPTIONS)                                              
*                                                                               
         DC    AL1(COUBK#),AL1(L'COUBK)                                         
         DC    Y(COUBK-COPTIONS)                                                
*                                                                               
         DC    AL1(COPCT#),AL1(L'COPCT)                                         
         DC    Y(COPCT-COPTIONS)                                                
*                                                                               
         DC    AL1(COPC1#),AL1(L'COPC1)                                         
         DC    Y(COPC1-COPTIONS)                                                
*                                                                               
         DC    AL1(COPC2#),AL1(L'COPC2)                                         
         DC    Y(COPC2-COPTIONS)                                                
*                                                                               
         DC    AL1(PIDREQ#),AL1(L'PIDREQ)                                       
         DC    Y(PIDREQ-COPTIONS)                                               
*                                                                               
         DC    AL1(CODTS#),AL1(L'CODTS)                                         
         DC    Y(CODTS-COPTIONS)                                                
*                                                                               
         DC    AL1(CNFTMS#),AL1(L'CNFTMS)                                       
         DC    Y(CNFTMS-COPTIONS)                                               
*                                                                               
         DC    AL1(CODTMS#),AL1(L'CODTMS)                                       
         DC    Y(CODTMS-COPTIONS)                                               
*                                                                               
         DC    AL1(COBRTE#),AL1(L'COBRTE)                                       
         DC    Y(COBRTE-COPTIONS)                                               
*                                                                               
         DC    AL1(CORRTE#),AL1(L'CORRTE)                                       
         DC    Y(CORRTE-COPTIONS)                                               
*                                                                               
         DC    AL1(COTBTL#),AL1(L'COTBTL)                                       
         DC    Y(COTBTL-COPTIONS)                                               
*                                                                               
         DC    AL1(COTDLK#),AL1(L'COTDLK)                                       
         DC    Y(COTDLK-COPTIONS)                                               
*                                                                               
         DC    AL1(CODTM#),AL1(L'CODTM)                                         
         DC    Y(CODTM-COPTIONS)                                                
*                                                                               
         DC    AL1(COATM#),AL1(L'COATM)                                         
         DC    Y(COATM-COPTIONS)                                                
*                                                                               
         DC    AL1(COIPER#),AL1(L'COIPER)                                       
         DC    Y(COIPER-COPTIONS)                                               
*                                                                               
         DC    AL1(CODONLY#),AL1(L'CODONLY)                                     
         DC    Y(CODONLY-COPTIONS)                                              
*                                                                               
         DC    AL1(CODBASE#),AL1(L'CODBASE)                                     
         DC    Y(CODBASE-COPTIONS)                                              
*                                                                               
         DC    AL1(CODIR#),AL1(L'CODIR)                                         
         DC    Y(CODIR-COPTIONS)                                                
*                                                                               
         DC    AL1(COIND#),AL1(L'COIND)                                         
         DC    Y(COIND-COPTIONS)                                                
*                                                                               
         DC    AL1(COIBASE#),AL1(L'COIBASE)                                     
         DC    Y(COIBASE-COPTIONS)                                              
*                                                                               
         DC    AL1(COIOFFL#),AL1(L'COIOFFL)                                     
         DC    Y(COIOFFL-COPTIONS)                                              
*                                                                               
         DC    AL1(COINOH#),AL1(L'COINOH)                                       
         DC    Y(COINOH-COPTIONS)                                               
*                                                                               
         DC    AL1(COIEXC#),AL1(L'COIEXC)                                       
         DC    Y(COIEXC-COPTIONS)                                               
*                                                                               
         DC    AL1(COIALLD#),AL1(L'COIALLD)                                     
         DC    Y(COIALLD-COPTIONS)                                              
*                                                                               
         DC    AL1(COIALLO#),AL1(L'COIALLO)                                     
         DC    Y(COIALLO-COPTIONS)                                              
*                                                                               
         DC    AL1(COOCIND#),AL1(L'COOCIND)                                     
         DC    Y(COOCIND-COPTIONS)                                              
*                                                                               
         DC    AL1(COIALLC#),AL1(L'COIALLC)                                     
         DC    Y(COIALLC-COPTIONS)                                              
*                                                                               
         DC    AL1(COACIND#),AL1(L'COACIND)                                     
         DC    Y(COACIND-COPTIONS)                                              
*                                                                               
         DC    AL1(CONBAB#),AL1(L'CONBAB)                                       
         DC    Y(CONBAB-COPTIONS)                                               
*                                                                               
         DC    AL1(CONBAL#),AL1(L'CONBAL)                                       
         DC    Y(CONBAL-COPTIONS)                                               
*                                                                               
         DC    AL1(CONBOFF#),AL1(L'CONBOFF)                                     
         DC    Y(CONBOFF-COPTIONS)                                              
*                                                                               
         DC    AL1(CONBOUT#),AL1(L'CONBOUT)                                     
         DC    Y(CONBOUT-COPTIONS)                                              
*                                                                               
         DC    AL1(CONBIN#),AL1(L'CONBIN)                                       
         DC    Y(CONBIN-COPTIONS)                                               
*                                                                               
         DC    AL1(COPBAB#),AL1(L'COPBAB)                                       
         DC    Y(COPBAB-COPTIONS)                                               
*                                                                               
         DC    AL1(COPBAL#),AL1(L'COPBAL)                                       
         DC    Y(COPBAL-COPTIONS)                                               
*                                                                               
         DC    AL1(COPBOFF#),AL1(L'COPBOFF)                                     
         DC    Y(COPBOFF-COPTIONS)                                              
*                                                                               
         DC    AL1(COPBOUT#),AL1(L'COPBOUT)                                     
         DC    Y(COPBOUT-COPTIONS)                                              
*                                                                               
         DC    AL1(COPBIN#),AL1(L'COPBIN)                                       
         DC    Y(COPBIN-COPTIONS)                                               
*                                                                               
         DC    AL1(COVAB#),AL1(L'COVAB)                                         
         DC    Y(COVAB-COPTIONS)                                                
*                                                                               
         DC    AL1(COVBASE#),AL1(L'COVBASE)                                     
         DC    Y(COVBASE-COPTIONS)                                              
*                                                                               
         DC    AL1(COVINC#),AL1(L'COVINC)                                       
         DC    Y(COVINC-COPTIONS)                                               
*                                                                               
         DC    AL1(COVALLD#),AL1(L'COVALLD)                                     
         DC    Y(COVALLD-COPTIONS)                                              
*                                                                               
         DC    AL1(COVALLO#),AL1(L'COVALLO)                                     
         DC    Y(COVALLO-COPTIONS)                                              
*                                                                               
         DC    AL1(COVALLC#),AL1(L'COVALLC)                                     
         DC    Y(COVALLC-COPTIONS)                                              
*                                                                               
         DC    AL1(COINDX#),AL1(L'COINDX)                                       
         DC    Y(COINDX-COPTIONS)                                               
*                                                                               
         DC    AL1(COISOFL#),AL1(L'COISOFL)                                     
         DC    Y(COISOFL-COPTIONS)                                              
*                                                                               
         DC    AL1(COISALL#),AL1(L'COISALL)                                     
         DC    Y(COISALL-COPTIONS)                                              
*                                                                               
         DC    AL1(COHOAB#),AL1(L'COHOAB)                                       
         DC    Y(COHOAB-COPTIONS)                                               
*                                                                               
         DC    AL1(COHOAL#),AL1(L'COHOAL)                                       
         DC    Y(COHOAL-COPTIONS)                                               
*                                                                               
         DC    AL1(COHOOFF#),AL1(L'COHOOFF)                                     
         DC    Y(COHOOFF-COPTIONS)                                              
*                                                                               
         DC    AL1(COHOOUT#),AL1(L'COHOOUT)                                     
         DC    Y(COHOOUT-COPTIONS)                                              
*                                                                               
         DC    AL1(COHOIN#),AL1(L'COHOIN)                                       
         DC    Y(COHOIN-COPTIONS)                                               
*                                                                               
         DC    AL1(COMCT#),AL1(L'COMCT)                                         
         DC    Y(COMCT-COPTIONS)                                                
*                                                                               
         DC    AL1(COTYT#),AL1(L'COTYT)                                         
         DC    Y(COTYT-COPTIONS)                                                
*                                                                               
         DC    AL1(COORC#),AL1(L'COORC)                                         
         DC    Y(COORC-COPTIONS)                                                
*                                                                               
         DC    AL1(COIRC#),AL1(L'COIRC)                                         
         DC    Y(COIRC-COPTIONS)                                                
*                                                                               
         DC    AL1(COCLC#),AL1(L'COCLC)                                         
         DC    Y(COCLC-COPTIONS)                                                
*                                                                               
         DC    AL1(COPRC#),AL1(L'COPRC)                                         
         DC    Y(COPRC-COPTIONS)                                                
*                                                                               
         DC    AL1(COJOC#),AL1(L'COJOC)                                         
         DC    Y(COJOC-COPTIONS)                                                
*                                                                               
         DC    AL1(COTSK#),AL1(L'COTSK)                                         
         DC    Y(COTSK-COPTIONS)                                                
*                                                                               
         DC    AL1(CONCC#),AL1(L'CONCC)                                         
         DC    Y(CONCC-COPTIONS)                                                
*                                                                               
         DC    AL1(COTOT#),AL1(L'COTOT)                                         
         DC    Y(COTOT-COPTIONS)                                                
*                                                                               
         DC    AL1(COCNM#),AL1(L'COCNM)                                         
         DC    Y(COCNM-COPTIONS)                                                
*                                                                               
         DC    AL1(COPNM#),AL1(L'COPNM)                                         
         DC    Y(COPNM-COPTIONS)                                                
*                                                                               
         DC    AL1(COJNM#),AL1(L'COJNM)                                         
         DC    Y(COJNM-COPTIONS)                                                
*                                                                               
         DC    AL1(CONCN#),AL1(L'CONCN)                                         
         DC    Y(CONCN-COPTIONS)                                                
*                                                                               
         DC    AL1(COBHR#),AL1(L'COBHR)                                         
         DC    Y(COBHR-COPTIONS)                                                
*                                                                               
         DC    AL1(COCHR#),AL1(L'COCHR)                                         
         DC    Y(COCHR-COPTIONS)                                                
*                                                                               
         DC    AL1(CONBH#),AL1(L'CONBH)                                         
         DC    Y(CONBH-COPTIONS)                                                
*                                                                               
         DC    AL1(CONCH#),AL1(L'CONCH)                                         
         DC    Y(CONCH-COPTIONS)                                                
*                                                                               
         DC    AL1(COTSD#),AL1(L'COTSD)                                         
         DC    Y(COTSD-COPTIONS)                                                
*                                                                               
         DC    AL1(COCTS#),AL1(L'COCTS)                                         
         DC    Y(COCTS-COPTIONS)                                                
*                                                                               
*        DC    AL1(COTMO#),AL1(L'COTMO)                                         
*        DC    Y(COTMO-COPTIONS)                                                
*                                                                               
         DC    AL1(CONDO#),AL1(L'CONDO)                                         
         DC    Y(CONDO-COPTIONS)                                                
*                                                                               
         DC    AL1(CONBL#),AL1(L'CONBL)                                         
         DC    Y(CONBL-COPTIONS)                                                
*                                                                               
         DC    AL1(CODMO#),AL1(L'CODMO)                                         
         DC    Y(CODMO-COPTIONS)                                                
*                                                                               
         DC    AL1(CODTU#),AL1(L'CODTU)                                         
         DC    Y(CODTU-COPTIONS)                                                
*                                                                               
         DC    AL1(CODWE#),AL1(L'CODWE)                                         
         DC    Y(CODWE-COPTIONS)                                                
*                                                                               
         DC    AL1(CODTH#),AL1(L'CODTH)                                         
         DC    Y(CODTH-COPTIONS)                                                
*                                                                               
         DC    AL1(CODFR#),AL1(L'CODFR)                                         
         DC    Y(CODFR-COPTIONS)                                                
*                                                                               
         DC    AL1(CODSA#),AL1(L'CODSA)                                         
         DC    Y(CODSA-COPTIONS)                                                
*                                                                               
         DC    AL1(CODSU#),AL1(L'CODSU)                                         
         DC    Y(CODSU-COPTIONS)                                                
*                                                                               
         DC    AL1(COACS#),AL1(L'COACS)                                         
         DC    Y(COACS-COPTIONS)                                                
*                                                                               
         DC    AL1(COPHA#),AL1(L'COPHA)                                         
         DC    Y(COPHA-COPTIONS)                                                
*                                                                               
         DC    AL1(COSHA#),AL1(L'COSHA)                                         
         DC    Y(COSHA-COPTIONS)                                                
*                                                                               
         DC    AL1(COBCA#),AL1(L'COBCA)                                         
         DC    Y(COBCA-COPTIONS)                                                
*                                                                               
         DC    AL1(COTUP#),AL1(L'COTUP)                                         
         DC    Y(COTUP-COPTIONS)                                                
*                                                                               
         DC    AL1(COTNB#),AL1(L'COTNB)                                         
         DC    Y(COTNB-COPTIONS)                                                
*                                                                               
         DC    AL1(COLMA#),AL1(L'COLMA)                                         
         DC    Y(COLMA-COPTIONS)                                                
*                                                                               
         DC    AL1(COTBV#),AL1(L'COTBV)                                         
         DC    Y(COTBV-COPTIONS)                                                
*                                                                               
         DC    AL1(COEBV#),AL1(L'COEBV)                                         
         DC    Y(COEBV-COPTIONS)                                                
*                                                                               
         DC    AL1(COEML#),AL1(L'COEML)                                         
         DC    Y(COEML-COPTIONS)                                                
*                                                                               
         DC    AL1(COMAT#),AL1(L'COMAT)                                         
         DC    Y(COMAT-COPTIONS)                                                
*                                                                               
         DC    AL1(COD2E#),AL1(L'COD2E)                                         
         DC    Y(COD2E-COPTIONS)                                                
*                                                                               
         DC    AL1(COORD#),AL1(L'COORD)                                         
         DC    Y(COORD-COPTIONS)                                                
*                                                                               
         DC    AL1(COINR#),AL1(L'COINR)                                         
         DC    Y(COINR-COPTIONS)                                                
*                                                                               
         DC    AL1(COPHL#),AL1(L'COPHL)                                         
         DC    Y(COPHL-COPTIONS)                                                
*                                                                               
         DC    AL1(COCLA#),AL1(L'COCLA)                                         
         DC    Y(COCLA-COPTIONS)                                                
*                                                                               
         DC    AL1(COFNR#),AL1(L'COFNR)                                         
         DC    Y(COFNR-COPTIONS)                                                
*                                                                               
         DC    AL1(COURS#),AL1(L'COURS)                                         
         DC    Y(COURS-COPTIONS)                                                
*                                                                               
         DC    AL1(COENR#),AL1(L'COENR)                                         
         DC    Y(COENR-COPTIONS)                                                
*                                                                               
         DC    AL1(CONJB#),AL1(L'CONJB)                                         
         DC    Y(CONJB-COPTIONS)                                                
*                                                                               
         DC    AL1(COCNR#),AL1(L'COCNR)                                         
         DC    Y(COCNR-COPTIONS)                                                
*                                                                               
         DC    AL1(COLTP#),AL1(L'COLTP)                                         
         DC    Y(COLTP-COPTIONS)                                                
*                                                                               
         DC    AL1(COCVA#),AL1(L'COCVA)                                         
         DC    Y(COCVA-COPTIONS)                                                
*                                                                               
         DC    AL1(COTTU#),AL1(L'COTTU)                                         
         DC    Y(COTTU-COPTIONS)                                                
*                                                                               
         DC    AL1(COFAR#),AL1(L'COFAR)                                         
         DC    Y(COFAR-COPTIONS)                                                
*                                                                               
         DC    AL1(COEST#),AL1(L'COEST)                                         
         DC    Y(COEST-COPTIONS)                                                
*                                                                               
         DC    AL1(COESC#),AL1(L'COESC)                                         
         DC    Y(COESC-COPTIONS)                                                
*                                                                               
         DC    AL1(COECL#),AL1(L'COECL)                                         
         DC    Y(COECL-COPTIONS)                                                
*                                                                               
         DC    AL1(CONMX#),AL1(L'CONMX)                                         
         DC    Y(CONMX-COPTIONS)                                                
*                                                                               
         DC    AL1(COACM#),AL1(L'COACM)                                         
         DC    Y(COACM-COPTIONS)                                                
*                                                                               
         DC    AL1(COCCM#),AL1(L'COCCM)                                         
         DC    Y(COCCM-COPTIONS)                                                
*                                                                               
         DC    AL1(COBDT#),AL1(L'COBDT)                                         
         DC    Y(COBDT-COPTIONS)                                                
*                                                                               
         DC    AL1(CORCP#),AL1(L'CORCP)                                         
         DC    Y(CORCP-COPTIONS)                                                
*                                                                               
         DC    AL1(CONCM#),AL1(L'CONCM)                                         
         DC    Y(CONCM-COPTIONS)                                                
*                                                                               
         DC    AL1(CONCL#),AL1(L'CONCL)                                         
         DC    Y(CONCL-COPTIONS)                                                
*                                                                               
         DC    AL1(CONCA#),AL1(L'CONCA)                                         
         DC    Y(CONCA-COPTIONS)                                                
*                                                                               
         DC    AL1(CONLA#),AL1(L'CONLA)                                         
         DC    Y(CONLA-COPTIONS)                                                
*                                                                               
         DC    AL1(COPTA#),AL1(L'COPTA)                                         
         DC    Y(COPTA-COPTIONS)                                                
*                                                                               
         DC    AL1(COFTA#),AL1(L'COFTA)                                         
         DC    Y(COFTA-COPTIONS)                                                
*                                                                               
         DC    AL1(COFAP#),AL1(L'COFAP)                                         
         DC    Y(COFAP-COPTIONS)                                                
*                                                                               
         DC    AL1(CONDA#),AL1(L'CONDA)                                         
         DC    Y(CONDA-COPTIONS)                                                
*                                                                               
         DC    AL1(CODIA#),AL1(L'CODIA)                                         
         DC    Y(CODIA-COPTIONS)                                                
*                                                                               
         DC    AL1(COCAE#),AL1(L'COCAE)                                         
         DC    Y(COCAE-COPTIONS)                                                
*                                                                               
         DC    AL1(COMIL#),AL1(L'COMIL)                                         
         DC    Y(COMIL-COPTIONS)                                                
*                                                                               
         DC    AL1(COMTS#),AL1(L'COMTS)                                         
         DC    Y(COMTS-COPTIONS)                                                
*                                                                               
         DC    AL1(COFNM#),AL1(L'COFNM)                                         
         DC    Y(COFNM-COPTIONS)                                                
*                                                                               
         DC    AL1(COTHR#),AL1(L'COTHR)                                         
         DC    Y(COTHR-COPTIONS)                                                
*                                                                               
         DC    AL1(CODEF#),AL1(L'CODEF)                                         
         DC    Y(CODEF-COPTIONS)                                                
*                                                                               
         DC    AL1(COOVT#),AL1(L'COOVT)                                         
         DC    Y(COOVT-COPTIONS)                                                
*                                                                               
         DC    X'00'               EOT                                          
