*          DATA SET ACCAPFBD   AT LEVEL 004 AS OF 05/08/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DFBD      DATE 05/08/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      6    2    6  L  P H             T        Y  204         
         DS    XL8                                                              
PESCODEH DS    XL8                                                              
PESCODE  DS    CL8      6   10    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      6   23    4  L  P H             T        Y              
PESNAMEH DS    XL8                                                              
PESNAME  DS    CL36     6   30   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      7    2    3  L  P H             T        Y  201         
         DS    XL8                                                              
PESOFFH  DS    XL8                                                              
PESOFF   DS    CL2      7    6    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      7   10    4  L  P H             T        Y  202         
         DS    XL8                                                              
PESDEPTH DS    XL8                                                              
PESDEPT  DS    CL6      7   15    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   23    6  L  P H             T        Y  203         
         DS    XL8                                                              
PESSDPTH DS    XL8                                                              
PESSDPT  DS    CL6      7   30    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      7   40    8  L  P H             T        Y              
PESSTDTH DS    XL8                                                              
PESSTDT  DS    CL8      7   49    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      7   59    8  L  P H             T        Y              
PESENDTH DS    XL8                                                              
PESENDT  DS    CL8      7   68    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  L  P N             T        Y              
PESADR1H DS    XL8                                                              
PESADR1  DS    CL26     8   10   26  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30     8   40   30  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL7      9    2    7  L  P N             T        Y              
PESADR2H DS    XL8                                                              
PESADR2  DS    CL26     9   10   26  A  U N             T        Y              
PESBOS1H DS    XL8                                                              
PESBOS1  DS    CL8      9   40    8  A  U N             T        Y              
PESLVL1H DS    XL8                                                              
PESLVL1  DS    CL3      9   49    3  A  P N             T        Y              
PESDAS1H DS    XL8                                                              
PESDAS1  DS    CL1      9   53    1  A  P N             T        Y              
PESBOS2H DS    XL8                                                              
PESBOS2  DS    CL8      9   56    8  A  U N             T        Y              
PESLVL2H DS    XL8                                                              
PESLVL2  DS    CL3      9   65    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10    2    7  L  P N             T        Y              
PESADR3H DS    XL8                                                              
PESADR3  DS    CL26    10   10   26  A  U N             T        Y              
PESBOS3H DS    XL8                                                              
PESBOS3  DS    CL8     10   40    8  A  U N             T        Y              
PESLVL3H DS    XL8                                                              
PESLVL3  DS    CL3     10   49    3  A  P N             T        Y              
PESDAS2H DS    XL8                                                              
PESDAS2  DS    CL1     10   53    1  A  P N             T        Y              
PESBOS4H DS    XL8                                                              
PESBOS4  DS    CL8     10   56    8  A  U N             T        Y              
PESLVL4H DS    XL8                                                              
PESLVL4  DS    CL3     10   65    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     11    2    7  L  P N             T        Y              
PESADR4H DS    XL8                                                              
PESADR4  DS    CL26    11   10   26  A  U N             T        Y              
PESBOS5H DS    XL8                                                              
PESBOS5  DS    CL8     11   40    8  A  U N             T        Y              
PESLVL5H DS    XL8                                                              
PESLVL5  DS    CL3     11   49    3  A  P N             T        Y              
PESDAS3H DS    XL8                                                              
PESDAS3  DS    CL1     11   53    1  A  P N             T        Y              
PESBOS6H DS    XL8                                                              
PESBOS6  DS    CL8     11   56    8  A  U N             T        Y              
PESLVL6H DS    XL8                                                              
PESLVL6  DS    CL3     11   65    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     13    2    6  L  P N             T        Y              
PESSTATH DS    XL8                                                              
PESSTAT  DS    CL8     13   10    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL40    13   23   40  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     14    2    6  L  P N             T        Y              
PESMEMOH DS    XL8                                                              
PESMEMO  DS    CL65    14   10   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     15    2    6  L  P N             T        Y              
PESTSLDH DS    XL8                                                              
PESTSLD  DS    CL8     15   10    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL40    15   23   40  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     17    2    4  L  P N             T        Y              
PESEXECH DS    XL8                                                              
PESEXEC  DS    CL1     17    8    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    17   11   25  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   40    4  L  P N             T        Y              
PESLOCKH DS    XL8                                                              
PESLOCK  DS    CL1     17   46    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    17   49   25  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     18    2    4  L  P N             T        Y              
PESPRODH DS    XL8                                                              
PESPROD  DS    CL1     18    8    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    18   11   25  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   40    4  L  P N             T        Y              
PESJOBH  DS    XL8                                                              
PESJOB   DS    CL1     18   46    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    18   49   25  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     19    2    4  L  P N             T        Y              
PESACTH  DS    XL8                                                              
PESACT   DS    CL1     19    8    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    19   11   25  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   40    4  L  P N             T        Y              
PESPCH   DS    XL8                                                              
PESPC    DS    CL1     19   46    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    19   49   25  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     20    2    4  L  P N             T        Y              
PESFREEH DS    XL8                                                              
PESFREE  DS    CL1     20    8    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL25    20   11   25  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    21    2   20  L  P N             T        Y              
PESANALH DS    XL8                                                              
PESANAL  DS    CL14    21   23   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL21    21   40   21  L  P N             T        Y              
PESDTSKH DS    XL8                                                              
PESDTSK  DS    CL2     21   63    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL20    22    2   20  L  P N             T        Y              
PESOINH  DS    XL8                                                              
PESOIN   DS    CL14    22   23   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL21    22   40   21  L  P N             T        Y              
PESOWOH  DS    XL8                                                              
PESOWO   DS    CL14    22   63   14  A  U N             T        Y              
PESPFKYH DS    XL8                                                              
PESPFKY  DS    CL79    24    2   79  L  P H             T        Y              
PESLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PESWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1592 BYTES                            
