*          DATA SET ACCATCALLD AT LEVEL 003 AS OF 12/09/91                      
CATD     DSECT                     DSECT FOR GET CATEGORY BLOCK                 
CATDMGR  DS    A                   A(DATAMGR)                                   
*                                                                               
CATLDG   DS    A                   A(SE LEDGER RECORD)                          
CATLVA   DS    A                   A(LEVEL A RECORD)                            
CATLVB   DS    A                   A(LEVEL B RECORD)                            
CATLVC   DS    A                   A(LEVEL C RECORD)                            
CATLVD   DS    A                   A(LEVEL D RECORD)                            
CATLDG3  DS    A                   A(13 LEDGER RECORD)                          
*                                                                               
CATSEAC  DS    CL15                SE ACCOUNT                                   
CATOFF   DS    CL2                 OFFICE                                       
CATDPT   DS    CL3                 DEPT                                         
*                                                                               
CATRTN   DS    0C                  RETURN VALUES AT ALL LEVELS                  
CATACCL  DS    CL5                 CATEGORY CODE - LEDGER                       
CATPSTL  DS    CL1                 COST POSTING FLAG (Y/N) - LEDGER             
CATACCA  DS    CL5                 CATEGORY CODE - LEVEL A                      
CATPSTA  DS    CL1                 COST POSTING FLAG (Y/N) - LEVEL A            
CATACCB  DS    CL5                 CATEGORY CODE - LEVEL B                      
CATPSTB  DS    CL1                 COST POSTING FLAG (Y/N) - LEVEL B            
CATACCC  DS    CL5                 CATEGORY CODE - LEVEL C                      
CATPSTC  DS    CL1                 COST POSTING FLAG (Y/N) - LEVEL C            
CATACCD  DS    CL5                 CATEGORY CODE - LEVEL D                      
CATPSTD  DS    CL1                 COST POSTING FLAG (Y/N) - LEVEL D            
*                                                                               
CATCDE   DS    CL5                 CATEGORY CODE - MERGED                       
CATPST   DS    CL1                 COST POSTING FLAG (Y/N)                      
*                                                                               
CATACC3  DS    CL15                13 ACCOUNT                                   
*                                                                               
CATERR   DS    XL1                 ERROR CONDITION                              
CATINV   EQU   1                   CATEGORY (ANALYSIS=) IS INVALID              
CATRTNL  EQU   *-CATRTN                                                         
*                                                                               
CATLNQ   EQU   (*-CATD)            BLOCK LENGTH                                 
