*          DATA SET ACCAPF3D   AT LEVEL 001 AS OF 02/19/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DF3D      DATE 02/19/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SHMDETLH DS    CL8                                                              
SHMDETL  DS    CL50     5    2   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      6    2    4  L  P H             T        Y              
SHMMOAH  DS    CL8                                                              
SHMMOA   DS    CL15     6   10   15  A  U N             T        Y    1         
SHMMOAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   28    7  L  P H             T        Y              
SHMMETHH DS    CL8                                                              
SHMMETH  DS    CL3      6   38    3  A  U N             T        Y              
SHMMNMEH DS    CL8                                                              
SHMMNME  DS    CL34     6   46   34  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  L  P H             T        Y  204         
         DS    CL8                                                              
SHMPERH  DS    CL8                                                              
SHMPER   DS    CL8      7   10    8  A  U N             T        Y              
SHMNAMEH DS    CL8                                                              
SHMNAME  DS    CL45     7   20   45  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8    2    6  L  P N             T        Y  201         
         DS    CL8                                                              
SHMOFFH  DS    CL8                                                              
SHMOFF   DS    CL2      8   10    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   20    4  L  P N             T        Y  202         
         DS    CL8                                                              
SHMDEPTH DS    CL8                                                              
SHMDEPT  DS    CL6      8   28    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   38    6  L  P N             T        Y  203         
         DS    CL8                                                              
SHMSDPTH DS    CL8                                                              
SHMSDPT  DS    CL6      8   46    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      9    2    8  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL5      9   12    5  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL1      9   18    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     9   22   11  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL11     9   34   11  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL11     9   46   11  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL21     9   58   21  L  P H             T        Y              
SHMLIN1H DS    CL8                                                              
SHMLIN1  DS    CL8     10    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     10   12    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   18    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    10   22   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    10   34   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    10   46   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL21    10   58   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     11   12    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   18    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   22   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   34   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   46   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL21    11   58   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   12    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   18    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   22   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   34   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   46   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL21    12   58   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   12    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   18    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   22   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   34   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   46   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL21    13   58   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   12    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   18    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   22   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   34   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   46   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL21    14   58   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   12    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   18    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   22   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   34   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   46   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL21    15   58   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   12    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   18    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   22   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   34   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   46   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL21    16   58   21  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   12    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   18    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   22   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   34   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   46   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL21    17   58   21  A  U N             T        Y              
SHMWORDH DS    CL8                                                              
SHMWORD  DS    CL6     18   62    6  A  P N             T        Y              
SHMUPDTH DS    CL8                                                              
SHMUPDT  DS    CL1     18   70    1  A  U N             T        Y              
SHMSTOPH DS    CL8                                                              
SHMSTOP  DS    CL8     19   13    8  L  P N             T        Y              
SHMSALH  DS    CL8                                                              
SHMSAL   DS    CL36    19   22   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   13    8  L  P N             T        Y              
SHMPENH  DS    CL8                                                              
SHMPEN   DS    CL36    20   22   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   13    8  L  P N             T        Y              
SHMBENH  DS    CL8                                                              
SHMBEN   DS    CL36    21   22   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   13    8  L  P N             T        Y              
SHMINDH  DS    CL8                                                              
SHMIND   DS    CL36    22   22   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     23   13    8  L  P N             T        Y              
SHMTTOTH DS    CL8                                                              
SHMTTOT  DS    CL36    23   22   36  A  P N             T        Y              
SHMPFKYH DS    CL8                                                              
SHMPFKY  DS    CL79    24    2   79  A  P H             T        Y              
SHMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SHMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1904 BYTES                            
