*          DATA SET ACCAPCBD   AT LEVEL 004 AS OF 04/02/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DCBD      DATE 04/02/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  L  P H             T        Y              
TCMPERH  DS    XL8                                                              
TCMPER   DS    CL9      5   11    9  A  U H             T    I   Y              
TCMPDESH DS    XL8                                                              
TCMPDES  DS    CL30     5   21   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  L  P H             T        Y  204         
         DS    XL8                                                              
TCMCODEH DS    XL8                                                              
TCMCODE  DS    CL8      6   11    8  A  U H             T        Y              
TCMNAMEH DS    XL8                                                              
TCMNAME  DS    CL30     6   21   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   52    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      7    2    4  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      7    7    4  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      7   12    9  L  P N             T        Y              
TCMDAYH  DS    XL8                                                              
TCMDAY   DS    CL2      8    2    2  A  U N             T        Y              
TCMCDEH  DS    XL8                                                              
TCMCDE   DS    CL3      8    7    3  A  U N             T        Y              
TCMNARH  DS    XL8                                                              
TCMNAR   DS    CL65     8   12   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2      9    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65     9   12   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     10    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    10   12   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     11    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    11   12   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     12    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    12   12   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     13    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    13   12   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     14    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    14   12   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     15    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    15   12   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    16   12   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     17    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    17   12   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     18    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    18   12   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     19    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    19   12   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     20    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    20   12   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     21    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    21   12   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL2     22    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    7    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL65    22   12   65  A  U N             T        Y              
TCMDAYLH DS    XL8                                                              
TCMDAYL  DS    CL2     23    2    2  A  U N             T        Y              
TCMCDELH DS    XL8                                                              
TCMCDEL  DS    CL3     23    7    3  A  U N             T        Y              
TCMNARLH DS    XL8                                                              
TCMNARL  DS    CL65    23   12   65  A  U N             T        Y              
TCMPFKYH DS    XL8                                                              
TCMPFKY  DS    CL78    24    2   78  A  P N             T        Y              
TCMLAST  DS    XL1                                                              
         DS    XL2    INDICS=11                                                 
TCMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1792 BYTES                            
