*          DATA SET ACCAPF0D   AT LEVEL 002 AS OF 01/05/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DF0D      DATE 01/05/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      6    2    7  L  P H             T        Y              
CRAMETHH DS    XL8                                                              
CRAMETH  DS    CL3      6   15    3  A  U N             T        Y              
CRAMENMH DS    XL8                                                              
CRAMENM  DS    CL36     6   25   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7    2    6  L  P H             T        Y  204         
         DS    XL8                                                              
CRACODEH DS    XL8                                                              
CRACODE  DS    CL8      7   15    8  A  U N             T        Y              
CRANAMEH DS    XL8                                                              
CRANAME  DS    CL50     7   25   50  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     8    2   12  L  P N             T        Y  201         
         DS    XL8                                                              
CRAOFFH  DS    XL8                                                              
CRAOFF   DS    CL2      8   15    2  A  U N             T        Y              
CRAOFNMH DS    XL8                                                              
CRAOFNM  DS    CL36     8   25   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     9    2   12  L  P N             T        Y  202         
         DS    XL8                                                              
CRADEPTH DS    XL8                                                              
CRADEPT  DS    CL6      9   15    6  A  U N             T        Y              
CRADPNMH DS    XL8                                                              
CRADPNM  DS    CL36     9   25   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    10    2   12  L  P N             T        Y  203         
         DS    XL8                                                              
CRASDPTH DS    XL8                                                              
CRASDPT  DS    CL6     10   15    6  A  U N             T        Y              
CRASDNMH DS    XL8                                                              
CRASDNM  DS    CL36    10   25   36  A  P N             T        Y              
CRAHDLNH DS    XL8                                                              
CRAHDLN  DS    CL78    12    2   78  A  P N             T        Y              
CRALIN1H DS    XL8                                                              
CRALIN1  DS    CL78    13    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    14    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    15    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
CRAENDH  DS    XL8                                                              
CRAEND   DS    CL78    21    2   78  A  P N             T        Y              
CRAPFKYH DS    XL8                                                              
CRAPFKY  DS    CL78    24    2   78  A  P H             T        Y              
CRALAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
CRAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1384 BYTES                            
