*          DATA SET ACCAPEAD   AT LEVEL 001 AS OF 12/12/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DEAD      DATE 12/12/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  L  P H             T        Y              
DAYYEARH DS    XL8                                                              
DAYYEAR  DS    CL4      5    9    4  A  U N             T        Y    2         
DAYYEARX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   14    6  L  P N             T        Y  201         
         DS    XL8                                                              
DAYOFFH  DS    XL8                                                              
DAYOFF   DS    CL2      5   21    2  A  U N             T        Y    3         
DAYOFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      5   24    4  L  P N             T        Y  202         
         DS    XL8                                                              
DAYDEPTH DS    XL8                                                              
DAYDEPT  DS    CL2      5   29    2  A  U N             T        Y    4         
DAYDEPTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   32    6  L  P N             T        Y  203         
         DS    XL8                                                              
DAYSDPTH DS    XL8                                                              
DAYSDPT  DS    CL2      5   39    2  A  U N             T        Y    5         
DAYSDPTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   42    6  L  P N             T        Y  204         
         DS    XL8                                                              
DAYPERH  DS    XL8                                                              
DAYPER   DS    CL7      5   49    7  A  U N             T        Y    6         
DAYPERX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   58    6  L  P N             T        Y  206         
         DS    XL8                                                              
DAYDAYH  DS    XL8                                                              
DAYDAY   DS    CL10     5   65   10  A  U N             T        Y    8         
DAYDAYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      5   76    1  A  P N             T        Y              
DAYMTH1H DS    XL8                                                              
DAYMTH1  DS    CL3      6    2    3  L  P H             T        Y              
DAYNUM1H DS    XL8                                                              
DAYNUM1  DS    CL2      6    6    2  A  P H             T        Y              
DAYDTE1H DS    XL8                                                              
DAYDTE1  DS    CL5      6    9    5  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      6   15    5  L  P H             T        Y              
DAYMTH2H DS    XL8                                                              
DAYMTH2  DS    CL3      6   21    3  L  P H             T        Y              
DAYNUM2H DS    XL8                                                              
DAYNUM2  DS    CL2      6   25    2  A  P H             T        Y              
DAYDTE2H DS    XL8                                                              
DAYDTE2  DS    CL5      6   28    5  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      6   34    5  L  P H             T        Y              
DAYMTH3H DS    XL8                                                              
DAYMTH3  DS    CL3      6   40    3  L  P H             T        Y              
DAYNUM3H DS    XL8                                                              
DAYNUM3  DS    CL2      6   44    2  A  P H             T        Y              
DAYDTE3H DS    XL8                                                              
DAYDTE3  DS    CL5      6   47    5  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      6   53    5  L  P H             T        Y              
DAYMTH4H DS    XL8                                                              
DAYMTH4  DS    CL3      6   59    3  L  P H             T        Y              
DAYNUM4H DS    XL8                                                              
DAYNUM4  DS    CL2      6   63    2  A  P H             T        Y              
DAYDTE4H DS    XL8                                                              
DAYDTE4  DS    CL5      6   66    5  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL5      6   72    5  L  P H             T        Y              
DAYCOL1H DS    XL8                                                              
DAYCOL1  DS    CL12     7    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      7   15    5  A  U N             T        Y              
DAYCOL2H DS    XL8                                                              
DAYCOL2  DS    CL12     7   21   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      7   34    5  A  U N             T        Y              
DAYCOL3H DS    XL8                                                              
DAYCOL3  DS    CL12     7   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      7   53    5  A  U N             T        Y              
DAYCOL4H DS    XL8                                                              
DAYCOL4  DS    CL12     7   59   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      7   72    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     8    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   15    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     8   21   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   34    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     8   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   53    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     8   59   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   72    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     9    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      9   15    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     9   21   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      9   34    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     9   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      9   53    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12     9   59   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      9   72    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    10    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     10   15    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    10   21   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     10   34    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    10   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     10   53    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    10   59   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     10   72    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    11    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   15    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    11   21   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   34    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    11   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   53    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    11   59   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   72    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    12    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   15    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    12   21   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   34    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    12   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   53    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    12   59   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   72    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    13    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   15    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    13   21   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   34    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    13   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   53    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    13   59   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   72    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    14    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14   15    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    14   21   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14   34    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    14   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14   53    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    14   59   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     14   72    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    15    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   15    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    15   21   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   34    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    15   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   53    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    15   59   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   72    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    16    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   15    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    16   21   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   34    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    16   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   53    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    16   59   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   72    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    17    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   15    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   21   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   34    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   53    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   59   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   72    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    18    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   15    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   21   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   34    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   53    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   59   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   72    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    19    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   15    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    19   21   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   34    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    19   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   53    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    19   59   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   72    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    20    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   15    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    20   21   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   34    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    20   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   53    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    20   59   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   72    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    21    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   15    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    21   21   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   34    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    21   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   53    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    21   59   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   72    5  A  U N             T        Y              
DAYEND1H DS    XL8                                                              
DAYEND1  DS    CL12    22    2   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     22   15    5  A  U N             T        Y              
DAYEND2H DS    XL8                                                              
DAYEND2  DS    CL12    22   21   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     22   34    5  A  U N             T        Y              
DAYEND3H DS    XL8                                                              
DAYEND3  DS    CL12    22   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     22   53    5  A  U N             T        Y              
DAYEND4H DS    XL8                                                              
DAYEND4  DS    CL12    22   59   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     22   72    5  A  U N             T        Y              
DAYTOTH  DS    XL8                                                              
DAYTOT   DS    CL70    23    2   70  A  P N             T        Y              
DAYPFKYH DS    XL8                                                              
DAYPFKY  DS    CL70    24    2   70  A  P H             T        Y              
DAYTAGH  DS    XL8                                                              
DAYTAG   DS    CL1     24   78    1  A  P N             T        Y              
DAYLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DAYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2728 BYTES                            
