*          DATA SET ACCAPC6D   AT LEVEL 003 AS OF 08/20/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DC6D      DATE 08/20/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
TAXDSECH DS    CL8                                                              
TAXDSEC  DS    CL3     13    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13    6    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   13    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   21    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   26    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   33    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   37    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     13   43    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   48    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   56    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    13   65   14  A  P N             T        Y              
TAXLIN1H DS    CL8                                                              
TAXLIN1  DS    CL2     14    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     14   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   65    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    14   68   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     15    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     15   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   65    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   68   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     16   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   65    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    16   68   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     17   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     17   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   65    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    17   68   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     18   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   65    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    18   68   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     19   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     19   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   65    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    19   68   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     20   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   65    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    20   68   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     21   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     21   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   65    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    21   68   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     22    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     22   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   65    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    22   68   12  A  P N             T        Y              
TAXLSTH  DS    CL8                                                              
TAXLST   DS    CL2     23    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     23    5    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   13    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     23   21    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   26    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     23   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   36    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     23   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     23   46    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     23   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     23   65    2  A  U N             T        Y              
TAXENDH  DS    CL8                                                              
TAXEND   DS    CL12    23   68   12  A  P N             T        Y              
TAXPFKYH DS    CL8                                                              
TAXPFKY  DS    CL78    24    2   78  A  P N             T        Y              
TAXLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
TAXWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1872 BYTES                            
