*          DATA SET ACCAPD2DS  AT LEVEL 005 AS OF 08/20/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DD2D      DATE 08/20/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
TSLCODEH DS    CL8                                                              
TSLCODE  DS    CL8      5   10    8  A  U N             T        Y              
TSLNAMEH DS    CL8                                                              
TSLNAME  DS    CL24     5   20   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   47    5  A  P N             T        Y              
TSLSDTEH DS    CL8                                                              
TSLSDTE  DS    CL8      5   53    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      5   65    3  A  P N             T        Y              
TSLEDTEH DS    CL8                                                              
TSLEDTE  DS    CL8      5   70    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      6    2    4  A  P H             T        Y              
TSLYEARH DS    CL8                                                              
TSLYEAR  DS    CL3      6   10    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6   20    6  A  P N             T        Y              
TSLCLNTH DS    CL8                                                              
TSLCLNT  DS    CL7      6   27    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      6   35    4  A  P N             T        Y              
TSLPRODH DS    CL8                                                              
TSLPROD  DS    CL4      6   40    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      6   47    3  A  P N             T        Y              
TSLJOBH  DS    CL8                                                              
TSLJOB   DS    CL6      6   53    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      6   65    4  A  P N             T        Y              
TSLTASKH DS    CL8                                                              
TSLTASK  DS    CL2      6   70    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      7    7    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      7   20    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      7   27    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      7   35    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1      7   47    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1      7   56    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1      7   65    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5      7   71    5  A  P H             T        Y              
TSLACTNH DS    CL8                                                              
TSLACTN  DS    CL3      8    2    3  A  U N             T        Y              
TSLLST1H DS    CL8                                                              
TSLLST1  DS    CL73     8    6   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL73     9    6   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL73    10    6   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL73    11    6   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL73    12    6   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL73    13    6   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL73    14    6   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL73    15    6   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL73    16    6   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL73    17    6   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL73    18    6   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL73    19    6   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL73    20    6   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
TSLLLSTH DS    CL8                                                              
TSLLLST  DS    CL73    21    6   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  P N             T        Y              
TSLSCRTH DS    CL8                                                              
TSLSCRT  DS    CL73    22    7   73  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  P N             T        Y              
TSLTTOTH DS    CL8                                                              
TSLTTOT  DS    CL73    23    7   73  A  P H             T        Y              
TSLPFKYH DS    CL8                                                              
TSLPFKY  DS    CL78    24    2   78  A  P N             T        Y              
TSLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TSLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1920 BYTES                            
