*          DATA SET ACCAPCAD   AT LEVEL 021 AS OF 04/02/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DCAD      DATE 04/02/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  L  P H             T        Y              
TDTPERH  DS    XL8                                                              
TDTPER   DS    CL9      5   11    9  A  U H             T    I   Y              
TDTPDESH DS    XL8                                                              
TDTPDES  DS    CL30     5   21   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  L  P H             T        Y  204         
         DS    XL8                                                              
TDTCODEH DS    XL8                                                              
TDTCODE  DS    CL8      6   11    8  A  U H             T        Y              
TDTNAMEH DS    XL8                                                              
TDTNAME  DS    CL30     6   21   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   52    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      7    2    4  L  P H             T        Y              
TDTLN#H  DS    XL8                                                              
TDTLN#   DS    CL5      7    7    5  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      7   15    6  L  P N             T        Y    1         
         DS    XL8                                                              
TDTHRSH  DS    XL8                                                              
TDTHRS   DS    CL7      7   22    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      7   35    4  L  P N             T        Y    1         
         DS    XL8                                                              
TDTTYPH  DS    XL8                                                              
TDTTYP   DS    CL2      7   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5      7   45    5  L  P N             T        Y    1         
         DS    XL8                                                              
TDTFLGH  DS    XL8                                                              
TDTFLG   DS    CL8      7   51    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      8    2    9  L  P N             T        Y    1         
         DS    XL8                                                              
TDTNRTH  DS    XL8                                                              
TDTNRT   DS    CL60     9    2   60  A  U N             T        Y              
TDTNRT2H DS    XL8                                                              
TDTNRT2  DS    CL60    10    2   60  A  U N             T        Y              
TDTNRT3H DS    XL8                                                              
TDTNRT3  DS    CL60    11    2   60  A  U N             T        Y              
TDTNRT4H DS    XL8                                                              
TDTNRT4  DS    CL60    12    2   60  A  U N             T        Y              
TDTPFKYH DS    XL8                                                              
TDTPFKY  DS    CL78    24    2   78  A  P N             T        Y              
TDTLAST  DS    XL1                                                              
         DS    XL2    INDICS=11                                                 
TDTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 672  BYTES                            
