*          DATA SET ACCAPC1D   AT LEVEL 001 AS OF 12/12/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DC1D      DATE 12/12/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
CHALOCSH DS    XL8                                                              
CHALOCS  DS    CL42     5   20   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      5   64    9  L  P H             T        Y              
CHASCRLH DS    XL8                                                              
CHASCRL  DS    CL4      5   74    4  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  L  P H             T        Y              
CHAPERH  DS    XL8                                                              
CHAPER   DS    CL9      6   10    9  A  U H             T    I   Y              
CHAPDESH DS    XL8                                                              
CHAPDES  DS    CL30     6   20   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   64    3  L  P N             T        Y              
CHAMOAH  DS    XL8                                                              
CHAMOA   DS    CL6      6   72    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7    2    6  L  P H             T        Y  204         
         DS    XL8                                                              
CHACODEH DS    XL8                                                              
CHACODE  DS    CL8      7   10    8  A  U H             T        Y              
CHANAMEH DS    XL8                                                              
CHANAME  DS    CL21     7   20   21  A  P N             T        Y              
CHAHED1H DS    XL8                                                              
CHAHED1  DS    CL8      7   43    8  L  P N             T        Y              
CHAHED2H DS    XL8                                                              
CHAHED2  DS    CL7      7   53    7  L  P N             T        Y              
CHAHED3H DS    XL8                                                              
CHAHED3  DS    CL5      7   64    5  L  P N             T        Y              
CHAHED4H DS    XL8                                                              
CHAHED4  DS    CL5      7   73    5  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      7   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      8    2    6  L  P N             T        Y  201         
         DS    XL8                                                              
CHAOFFH  DS    XL8                                                              
CHAOFF   DS    CL2      8   10    2  A  P N             T        Y              
CHAOFNMH DS    XL8                                                              
CHAOFNM  DS    CL16     8   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      8   37    5  L  P N             T        Y              
CHANON1H DS    XL8                                                              
CHANON1  DS    CL7      8   44    7  A  P N             T        Y              
CHANON2H DS    XL8                                                              
CHANON2  DS    CL7      8   53    7  A  P N             T        Y              
CHANON3H DS    XL8                                                              
CHANON3  DS    CL7      8   62    7  A  P N             T        Y              
CHANON4H DS    XL8                                                              
CHANON4  DS    CL7      8   71    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      9    2    4  L  P N             T        Y  202         
         DS    XL8                                                              
CHADEPTH DS    XL8                                                              
CHADEPT  DS    CL6      9   10    6  A  P N             T        Y              
CHADPNMH DS    XL8                                                              
CHADPNM  DS    CL16     9   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      9   37    5  L  P N             T        Y              
CHABIL1H DS    XL8                                                              
CHABIL1  DS    CL7      9   44    7  A  P N             T        Y              
CHABIL2H DS    XL8                                                              
CHABIL2  DS    CL7      9   53    7  A  P N             T        Y              
CHABIL3H DS    XL8                                                              
CHABIL3  DS    CL7      9   62    7  A  P N             T        Y              
CHABIL4H DS    XL8                                                              
CHABIL4  DS    CL7      9   71    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     10    2    6  L  P N             T        Y  203         
         DS    XL8                                                              
CHASDPTH DS    XL8                                                              
CHASDPT  DS    CL6     10   10    6  A  P N             T        Y              
CHASDNMH DS    XL8                                                              
CHASDNM  DS    CL16    10   20   16  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     10   37    5  L  P N             T        Y              
CHARTM1H DS    XL8                                                              
CHARTM1  DS    CL7     10   44    7  A  P N             T        Y              
CHARTM2H DS    XL8                                                              
CHARTM2  DS    CL7     10   53    7  A  P N             T        Y              
CHARTM3H DS    XL8                                                              
CHARTM3  DS    CL7     10   62    7  A  P N             T        Y              
CHARTM4H DS    XL8                                                              
CHARTM4  DS    CL7     10   71    7  A  P N             T        Y              
CHATSTSH DS    XL8                                                              
CHATSTS  DS    CL14    11    2   14  L  P N             T        Y              
CHATSTDH DS    XL8                                                              
CHATSTD  DS    CL16    11   20   16  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   37    5  L  P N             T        Y              
CHATOT1H DS    XL8                                                              
CHATOT1  DS    CL7     11   44    7  A  P N             T        Y              
CHATOT2H DS    XL8                                                              
CHATOT2  DS    CL7     11   53    7  A  P N             T        Y              
CHATOT3H DS    XL8                                                              
CHATOT3  DS    CL7     11   62    7  A  P N             T        Y              
CHATOT4H DS    XL8                                                              
CHATOT4  DS    CL7     11   71    7  A  P N             T        Y              
CHACUPNH DS    XL8                                                              
CHACUPN  DS    CL14    12   37   14  L  P N             T        Y              
CHACUPDH DS    XL8                                                              
CHACUPD  DS    CL1     12   53    1  A  U N             T        Y              
CHALAST  DS    XL1                                                              
         DS    XL2    INDICS=11                                                 
CHAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 856  BYTES                            
