*          DATA SET ACCAPE5D   AT LEVEL 006 AS OF 11/10/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DE5D      DATE 11/10/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  L  P H             T        Y              
PROMETHH DS    CL8                                                              
PROMETH  DS    CL3      6   10    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6   15    6  L  P N             T        Y  201         
         DS    CL8                                                              
PROOFFH  DS    CL8                                                              
PROOFF   DS    CL2      6   23    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      6   28    4  L  P N             T        Y  202         
         DS    CL8                                                              
PRODEPTH DS    CL8                                                              
PRODEPT  DS    CL6      6   34    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6   42    6  L  P N             T        Y  203         
         DS    CL8                                                              
PROSDPTH DS    CL8                                                              
PROSDPT  DS    CL6      6   50    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6   58    6  L  P N             T        Y  204         
         DS    CL8                                                              
PROPERH  DS    CL8                                                              
PROPER   DS    CL8      6   66    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24     7    2   24  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      7   31    8  L  P H             T        Y              
PROHEADH DS    CL8                                                              
PROHEAD  DS    CL36     7   40   36  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      7   77    4  L  P H             T        Y              
PROLIN1H DS    CL8                                                              
PROLIN1  DS    CL28     8    2   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      8   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL37     8   40   37  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2      8   78    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL28     9    2   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      9   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL37     9   40   37  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2      9   78    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL28    10    2   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL37    10   40   37  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     10   78    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL28    11    2   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL37    11   40   37  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   78    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL28    12    2   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL37    12   40   37  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   78    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL28    13    2   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL37    13   40   37  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   78    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL28    14    2   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL37    14   40   37  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   78    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL28    15    2   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL37    15   40   37  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   78    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL28    16    2   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL37    16   40   37  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   78    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL28    17    2   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL37    17   40   37  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   78    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL28    18    2   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL37    18   40   37  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   78    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL28    19    2   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL37    19   40   37  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   78    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL28    20    2   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL37    20   40   37  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   78    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL28    21    2   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL37    21   40   37  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   78    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL28    22    2   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL37    22   40   37  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   78    2  A  P N             T        Y              
PRODONEH DS    CL8                                                              
PRODONE  DS    CL28    23    2   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     23   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL37    23   40   37  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     23   78    2  A  P N             T        Y              
PROPFKYH DS    CL8                                                              
PROPFKY  DS    CL79    24    2   79  A  P H             T        Y              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2088 BYTES                            
