*          DATA SET ACCAPWRKDS AT LEVEL 101 AS OF 01/05/01                      
***********************************************************************         
*        WORKING STORAGE                                              *         
***********************************************************************         
*                                                                               
SYSD     DSECT                                                                  
SYSV     DS    0V                  * EXTERNAL ADDRESSES *                       
VBMONVAL DS    V                   BMONVAL                                      
VHELLO   DS    V                   HELLO                                        
VHELEN   DS    V                   HELEN                                        
VRECUP   DS    V                   RECUP                                        
VDUMMY   DS    V                   DUMMY                                        
         DS    5V                                                               
*                                                                               
COREFACS DS    0V                  * CORE-RESIDENT PHASES *                     
GENCON   DS    V                   GENCON                                       
VCHOPPER DS    V                   CHOPPER                                      
VOFFVAL  DS    V                   OFFVAL                                       
VGTBROAD DS    V                   GETBROAD                                     
VGETOPT  DS    V                   GETOPT                                       
VTSAR    DS    V                   TSAR                                         
VPARSNIP DS    V                   PARSNIP                                      
VQSORT   DS    V                   QSORT                                        
VGETCAP  DS    V                   GETCAP                                       
         DS    4V                  SPARE                                        
*                                                                               
PRGCOMM  DS    0A                  * PROGRAM COMMON ROUTINES *                  
VALUSER  DS    A                   VALIDATE USER ID                             
INITIAL  DS    A                   PROGRAM INITIALIZATION                       
GETTWA   DS    A                   READ/WRITE TEMPSTR PAGES                     
GETLDG   DS    A                   GET LEDGER LEVELS LENGTHS/NAMES              
GTLEVNM  DS    A                   GET ACCOUNT LEVEL NAME                       
GETNME   DS    A                   GET NAME AND PUT IN SCREEN FIELD             
MYERR    DS    A                   ROUTINE TO PROCESS ERROR MESSAGES            
TSTSEC   DS    A                   ROUTINE TO TEST ACCOUNT SECURITY             
ELM20    DS    A                   ROUTINE TO ADD X'20' ELEM TO A REC           
NPRGCOMM EQU   (*-PRGCOMM)/4                                                    
         DS    6A                                                               
*                                                                               
COMAREAS DS    0A                  * PROGRAM COMMON AREAS *                     
ADISPBLK DS    A                   DIPLAY TABLE BLOCK                           
*                                                                               
         EJECT                                                                  
***********************************************************************         
*        RESET BY BASE                                                *         
***********************************************************************         
*                                                                               
LDGC     DS    CL2                 LEDGER CODE                                  
LDGLEL   DS    XL(ACLLN1Q+(L'ACLVALS*4)) LENGTHS ELEMENT                        
         ORG   LDGLEL+(ACLLN1Q)                                                 
LDGLN1   DS    XL(L'ACLVLEN)       LEVEL 1 LENGTH                               
LDGNM1   DS    XL(L'ACLVDESC)      LEVEL 1 DESCRIPTION                          
LDGLN2   DS    XL(L'ACLVLEN)       LEVEL 2 LENGTH                               
LDGNM2   DS    XL(L'ACLVDESC)      LEVEL 3 DESCRIPTION                          
LDGLN3   DS    XL(L'ACLVLEN)       LEVEL 3 LENGTH                               
LDGNM3   DS    XL(L'ACLVDESC)      LEVEL 3 DESCRIPTION                          
LDGLN4   DS    XL(L'ACLVLEN)       LEVEL 4 LENGTH                               
LDGNM4   DS    XL(L'ACLVDESC)      LEVEL 4 DESCRIPTION                          
         ORG   LDGLEL+L'LDGLEL                                                  
ABCDLEN  DS    CL4                 LENGTHS OF EACH LEVEL                        
NUMLEVS  DS    CL1                 NUMBER OF LEVELS                             
*                                                                               
AOFFBLK  DS    A                   A(OFFBLK)                                    
*                                                                               
LDGRSEC  DS    XL1                 LEDGER SECURITY LEVEL                        
LDGROFP  DS    XL1                 LEDGER OFFICE POSITION                       
ACCSECR  DS    XL1                 ACCOUNT SECURITY LEVEL                       
ACOFFC   DS    CL2                 ACCOUNT OFFICE CODE                          
         DS    CL35                N/D                                          
         EJECT                                                                  
***********************************************************************         
*        MAINTAINED BY BASE                                           *         
***********************************************************************         
*                                                                               
GBLOCK   DS    0XL8                GETTXT PARAMETER AREA                        
GINDEX   DS    X                   INDEX FOR GETTXT                             
GERROR   DS    XL2                 ERROR NUMBER FOR GETTXT                      
         ORG   *-1                                                              
GERROR1  DS    X                   1-BYTE ERROR NUMBER                          
GMSGTYPE DS    X                   MESSAGE TYPE (0 = ERROR)                     
GLTXT    DS    X                   L'INSERTION TEXT                             
GATXT    DS    AL3                 A(INSERTION TEXT)                            
GMSYS    DS    CL1                 MESSAGE SYSTEM                               
*                                                                               
TRANSTAT DS    X                   STATUS FOR THIS TRANSACTION                  
RETURNED EQU   X'80'               REPROG HAS BEEN CALLED (POP)                 
OKINTPFK EQU   X'20'               OK TO RECOGNIZE INTERNAL PFKEYS              
FRSTMODE EQU   X'10'               FIRST MODE GENCON PASSED TO APPL             
USERCHA  EQU   X'08'               USER CAUSED ACTION TO BE CHANGE              
RCHANG   EQU   X'04'               RECORD FIELD HAS CHANGED                     
ACHANG   EQU   X'02'               ACTION FIELD HAS CHANGED                     
RACHANG  EQU   RCHANG+ACHANG       RECORD AND/OR ACTION FIELD CHANGED           
TRNABEND EQU   X'01'               ABEND                                        
*                                                                               
GOAGAIN  DS    C                   CONTROL INTERNAL CALLS TO GENCON             
*                                                                               
ATIOB    DS    A                   A(TRANSLATOR I/O BLOCK)                      
CURDISP  DS    H                   DISPLACEMENT TO CURSOR POSITION              
PFKEY    DS    X                   0 = ENTER, OTHERWISE ADJUSTED 1..12          
*                                                                               
SCRSTAT  DS    CL1                 SCREEN STATUS BYTE                           
SCRCHG   EQU   X'80'               SCREEN CHANGED                               
RECCHG   EQU   X'40'               RECORD CHANGED                               
ACTCHG   EQU   X'20'               ACTION CHANGED                               
*                                                                               
LINEID   DS    CL4                 TERMINAL LINE ID                             
ADDR     DS    CL4                      AND ADDRESS                             
*                                                                               
RECADDR  DS    A                   A(RECACT ENTRY TO PUSH TO)                   
TMPKEYH  DS    CL8                 DUMMY KEY FIELD HEADER FOR GENCON            
TMPKEY   DS    CL50                DUMMY KEY FIELD                              
ERRDISP  DS    XL1                 DISP. INTO FIELD FOR ERRORS                  
DALPTR   DS    F                   POINTER TO CAST D/A LIST ENTRY               
CASTDA   DS    XL4                 DISK ADDRESS OF SELECTED CAST RECORD         
APFTENT  DS    A                   A(PFTAB ENTRY)                               
INITBYTE DS    CL1                 PARAMETER BYTE FOR INITIAL ROUTINE           
*                                                                               
* THE FOLLOWING FLDS WERE MOVED FROM THE BASE WHEN IT WAS PUT IN CORE           
*                                                                               
*BASER7   DS    A                   SAVED ARE FOR BASE R7                       
*BASERELO DS    F                   BASE RELO                                   
*SAVEDKEY DS    CL(L'BIGKEY)                                                    
         EJECT                                                                  
***********************************************************************         
*        SAVED STORAGE                                                *         
***********************************************************************         
*                                                                               
         ORG   SYSD+X'400'                                                      
STARTSV  DS    0C                                                               
SVOFFAL  DS    XL8                 OFFAL SAVE AREA                              
*                                                                               
CMPY     DS    XL1                 COMPANY CODE                                 
ALPHA    DS    CL2                 AGENCY ALPHA                                 
USRNME   DS    CL33                USER NAME                                    
USRADD   DS    CL33                ADDRESS                                      
         SPACE 1                                                                
SVSCR    DS    XL1                 SAVED LAST SCREEN                            
SVREC    DS    XL1                            RECORD                            
SVACT    DS    XL1                            ACTION                            
         SPACE 1                                                                
PRGSTAT  DS    XL1                 PROGRAM STATUS                               
TESTSYS  EQU   X'80'               CONNECTED TO TEST SYSTEM                     
CTSTEREO EQU   X'40'               CONNECTED TO STEREO                          
PGMCALL  EQU   X'20'               CALLING PROGRAM FROM AN OVERLAY              
*                                                                               
SVLSTTMP DS    CL2                 SAVED AREA FOR PREVIOUS TEMPO LINE           
*                                                                               
CALLSTCK DS    XL1                 STACK OF OVERLAY CALLS (SCR NUMBERS)         
CALLAGN  DS    X                   CALL AGAIN                                   
CALLSP   DS    X                   POINTER TO STACK OF OVERLAY CALLS            
*                                                                               
SVACTION DS    CL8                 SAVED ACTION FOR CAST SCREEN                 
*                                                                               
TOPSCR   DS    XL1                 USED FOR TIMESHEETS                          
BOTSCR   DS    XL1                                                              
TSARSTAT DS    XL1                                                              
TSAREST  EQU   X'80'               RESTORE TSAR                                 
TSARSAVE EQU   X'40'               SAVE TSAR                                    
*                                                                               
LANGCODE DS    XL1                 LANGUAGE CODE                                
GFACTST6 DS    XL1                 GETFACT STAT 6                               
CTRYCODE DS    XL1                 COUNTRY CODE                                 
*                                                                               
PFXSTAT  DS    XL1                 PFKEY LINE STATUS                            
PFXS2ND  EQU   X'80'               2ND PFKEY LINE DISPLAYED                     
*                                                                               
SECALPHA DS    CL2                 SECURITY ALPHA ID                            
SECPID#  DS    XL2                 USER'S PID NUMBER (SECRET)                   
         DS    CL1                 N/D                                          
SVPERIOD DS    XL1                 SAVED AREA FOR PERIOD                        
*                                                                               
TSARBLK  DS    CL40                TSAR BLOCK                                   
         EJECT                                                                  
***********************************************************************         
*        DATA DICTIONARY LIST                                         *         
***********************************************************************         
*                                                                               
DICLIST  DS    0C                                                               
AC@ACTY  DS    CL8                 ACTIVITY                                     
AC@ADJ   DS    CL6                 ADJUST                                       
AC@ALL   DS    CL3                 ALL                                          
AC@BEN   DS    CL7                 BENEFIT                                      
AC@CHA   DS    CL6                 CHANGE                                       
AC@CRAT  DS    CL6                 CRATES                                       
AC@DATE  DS    CL4                 DATE                                         
AC@DEL   DS    CL6                 DELETE                                       
AC@DOWN  DS    CL4                 DOWN                                         
AC@FIRST DS    CL5                 FIRST                                        
AC@HIST  DS    CL7                 HISTORY                                      
AC@IND   DS    CL8                 INDIRECT                                     
AC@LAST  DS    CL4                 LAST                                         
AC@MONTH DS    CL5                 MONTH                                        
AC@NO    DS    CL3                 NO                                           
AC@PC    DS    CL4                 PC                                           
AC@PEN   DS    CL7                 PENSION                                      
AC@REM   DS    CL6                 REMOVE                                       
AC@REV   DS    CL8                 REVERSAL                                     
AC@SAL   DS    CL6                 SALARY                                       
AC@START DS    CL5                 START                                        
AC@STDHR DS    CL8                 STD HOUR                                     
AC@TOTAL DS    CL5                 TOTAL                                        
AC@TOTLS DS    CL6                 TOTALS                                       
AC@TYPE  DS    CL4                 TYPE                                         
AC@UP    DS    CL3                 UP                                           
AC@UPD   DS    CL6                 UPDATE                                       
AC@VALOP DS    CL13                VALID OPTIONS                                
AC@YES   DS    CL3                 YES                                          
AC@CYR   DS    CL2                 YR                                           
AC@SVNUM DS    CL25                NUMBER OF SAVED ITEMS =                      
DICLISTX EQU   *                                                                
         DS    XL323               SPARE                                        
         EJECT                                                                  
*                                                                               
DICLISTU DS    0C                  UPPER CASE                                   
AC@ALLU  DS    CL3                 ALL                                          
AC@BENU  DS    CL7                 BENEFIT                                      
AC@CHAU  DS    CL6                 CHANGE                                       
AC@CRATU DS    CL6                 CRATES                                       
AC@DELU  DS    CL6                 DELETE                                       
AC@DISPU DS    CL7                 DISPLAY                                      
AC@FRSTU DS    CL5                 FIRST                                        
AC@HISTU DS    CL7                 HISTORY                                      
AC@HOURU DS    CL5                 HOURS                                        
AC@HRSU  DS    CL3                 HRS                                          
AC@INDU  DS    CL8                 INDIRECT                                     
AC@LASTU DS    CL4                 LAST                                         
AC@MNTHU DS    CL5                 MONTH                                        
AC@DNMSU DS    CL21                MONTUEWEDTHUFRISATSUN                        
AC@NOU   DS    CL3                 NO                                           
AC@PCU   DS    CL4                 PC                                           
AC@PENU  DS    CL7                 PENSION                                      
AC@REMU  DS    CL6                 REMOVE                                       
AC@REVU  DS    CL8                 REVERSAL                                     
AC@SALU  DS    CL6                 SALARY                                       
AC@STRTU DS    CL5                 START                                        
AC@TOTU  DS    CL5                 TOTAL                                        
AC@TOTSU DS    CL6                 TOTALS                                       
AC@TYPEU DS    CL4                 TYPE                                         
AC@UNASU DS    CL10                UNASSIGNED                                   
AC@UPDU  DS    CL6                 UPDATE                                       
AC@YESU  DS    CL3                 YES                                          
AC@STDHU DS    CL8                 STD HOUR                                     
AC@ANNU  DS    CL6                 ANNUAL                                       
AC@HRATE DS    CL5                 HRATE                                        
AC@PERHR DS    CL3                 /HR                                          
AC@HALF  DS    CL4                 HALF                                         
AC@PAGE  DS    CL4                 PAGE                                         
AC@SORT  DS    CL4                 SORT                                         
AC@PRSN  DS    CL6                 PERSON                                       
AC@PERD  DS    CL6                 PERIOD                                       
AC@OFFC  DS    CL6                 OFFICE                                       
AC@DEPT  DS    CL6                 DEPT                                         
AC@CSUB  DS    CL6                 SUBDPT                                       
AC@AMT   DS    CL6                 AMOUNT                                       
AC@ADDU  DS    CL6                 ADD                                          
AC@ONLYU DS    CL4                 ONLY                                         
AC@LCKDU DS    CL9                 LOCKED                                       
AC@OPT   DS    CL6                 OPTION                                       
AC@METH  DS    CL6                 METHOD                                       
AC@PRFL  DS    CL7                 PROFILE                                      
AC@ADJU  DS    CL6                 ADJUST                                       
DICLSTUX EQU   *                                                                
         DS    XL236               SPARE                                        
*                                                                               
         EJECT                                                                  
***********************************************************************         
*        SECURITY BLOCK FOR SECRET                                    *         
***********************************************************************         
*                                                                               
SECBLK   DS    CL1024              SECRET BLOCK                                 
         EJECT                                                                  
***********************************************************************         
*        SAVE STORAGE AREA 2                                          *         
***********************************************************************         
*                                                                               
STARTSV2 DS    0C                                                               
COMPYST1 DS    XL1                 COMPANY EL STAT BYTE 1                       
COMPYST2 DS    XL1                 COMPANY EL STAT BYTE 2                       
COMPYST3 DS    XL1                 COMPANY EL STAT BYTE 3                       
COMPYST4 DS    XL1                 COMPANY EL STAT BYTE 4                       
COMPYST5 DS    XL1                 COMPANY EL STAT BYTE 5                       
COMPYST6 DS    XL1                 COMPANY EL STAT BYTE 6                       
COMPYST7 DS    XL1                 COMPANY EL STAT BYTE 7                       
COMPYSEC DS    XL1                 COMPANY EL SECURITY BYTE                     
         DS    CL150               N/D                                          
         EJECT                                                                  
***********************************************************************         
*        OFFAL BLOCK                                                  *         
***********************************************************************         
*                                                                               
OFFBLK   DS    CL670               OFFAL BLOCK                                  
         EJECT                                                                  
***********************************************************************         
*        APPLICATION SAVED STORAGE IN SYSSPARE                        *         
***********************************************************************         
*                                                                               
         ORG   SYSD+X'FF0'                                                      
SYSSPARE DS    CL(MAXLTWA0-(*-STARTSV))  APPLICATION SAVED STORAGE              
SYSDEND  DS    0C                  END OF SYSTEM STORAGE                        
         EJECT                                                                  
***********************************************************************         
*        RANDOM DISPLAY BLOCK                                         *         
***********************************************************************         
         SPACE 1                                                                
DISBLKLN EQU   5*1024              5 K DISPLAY BLOCK AREA                       
DISPBLK  DS    CL(DISBLKLN)                                                     
         EJECT                                                                  
***********************************************************************         
*        EQUATED VALUES                                                         
***********************************************************************         
*                                                                               
ALL      EQU   X'FF'                                                            
NULL     EQU   0                                                                
YES      EQU   C'Y'                                                             
NO       EQU   C'N'                                                             
ACSYSN   EQU   6                                                                
NIOS     EQU   3                   3 IO AREAS                                   
LIOS     EQU   2000                2000 BYTE IO AREA                            
LENIOAS  EQU   NIOS*(LIOS+8)                                                    
*                                                                               
*        RECORD TYPE EQUATES                                                    
*                                                                               
RTMAD    EQU   1                   MULTIPLE ADJUSTMENTS (SAL HISTORY)           
RTPRO    EQU   2                   ALLOCAION PROFILES                           
RTPER    EQU   3                   PERSON                                       
RTCAL    EQU   4                   TIMESHEET PERIODS                            
RTMTH    EQU   5                   METHOD                                       
RTRAT    EQU   6                   RATES                                        
RTPAY    EQU   7                   PAYROLL                                      
RTSTD    EQU   8                   STANDARD HOURS                               
RTHIS    EQU   9                   SALARY HISTORY                               
RTTST    EQU   10                  TEST                                         
RTTIM    EQU   11                  TIMESHEETS                                   
RTPR2    EQU   12                  PERSON2                                      
RTEDT    EQU   14                  EDIT HOURS                                   
RTOVH    EQU   15                  OVERHEAD                                     
RTTHD    EQU   16                  TEMPO HEADER                                 
RTTDT    EQU   17                  TEMPO DETAIL                                 
RTTCM    EQU   18                  TEMPO COMMUTER CODE                          
*                                                                               
         EJECT                                                                  
***********************************************************************         
*        SYSTEM ACCOUNT TYPE INFORMATION                              *         
***********************************************************************         
*                                                                               
ACIPLSE  EQU   0002                PLEASE INPUT REQUIRED FIELDS                 
ACICHNG  EQU   0004                ENTER CHANGES                                
ACIUPD   EQU   0005                RECORD WAS UPDATED                           
ACIACTN  EQU   0057                ACTION COMPLETE - ENTER NEXT                 
ACIEVAL  EQU   0600                ENTER DATA & HIT ENTER TO VALIDATE           
ACIPFUPD EQU   0601                NO ERRORS-HIT PF6 TO UPDATE                  
ACIRECUP EQU   0602                RECORDS HAVE BEEN UPDATED                    
ACIEREPD EQU   1422                ENTER REP DATA & ENTER TO PROC REQST         
ACEINIRP EQU   1151                ENTER YOUR INITIALS FOR REPORT-ID            
ACISAVE  EQU   2045                RECORD SAVED - ENTER NEXT                    
ACIDISUP EQU   2046                RECORD DISPLAYED - PF6 TO UPDATE             
ACIY2CFM EQU   2048                ENTER Y TO CONFIRM UPDATE                    
*                                                                               
*&&US                                                                           
ACIRADD  EQU   0132                RECORD WAS ADDED                             
ACIRDIS  EQU   0133                RECORD DISPLAYED                             
*&&                                                                             
*&&UK                                                                           
ACIRADD  EQU   0039                RECORD WAS ADDED                             
ACIRDIS  EQU   0040                RECORD DISPLAYED                             
*&&                                                                             
*                                                                               
***********************************************************************         
*        SYSTEM ACCOUNT TYPE ERROR                                    *         
***********************************************************************         
*                                                                               
ACEMISS  EQU   0001                MISSING INPUT FIELD                          
ACEINV   EQU   0002                INVALID INPUT FIELD                          
ACEINVNM EQU   0003                INVALID NUMERIC                              
ACELEDG  EQU   0009                INVALID LEDGER                               
ACEUNIT  EQU   0010                INVALID UNIT                                 
ACEIVDT  EQU   0013                INVALID DATE FORMAT                          
ACECLI   EQU   0014                INVALID CLIENT                               
ACEPROD  EQU   0015                INVALID PRODUCT                              
ACEJOB   EQU   0016                INVALID JOB                                  
ACEACCT  EQU   0017                INVALID ACCOUNT                              
ACEINACP EQU   0018                INVALID ACCOUNT FOR POSTING                  
ACEACTCL EQU   0023                ACCOUNT IS CLOSED                            
ACEAMNT  EQU   0025                INVALID AMOUNT                               
ACEACTLK EQU   0028                ACCOUNT IS LOCKED                            
ACEDUPLN EQU   0035                TEMPO LINE IS DUPLICATED                     
ACELSHO  EQU   0036                INPUT LENGTH TOO SHORT                       
ACELLONG EQU   0037                INPUT LENGTH TOO LONG                        
ACERECNF EQU   0053                RECORD NOT FOUND                             
ACSELOCK EQU   0055                SECURITY LOCKOUT                             
ACEMSCLI EQU   0057                MISSING CLIENT CODE                          
ACERECEX EQU   0059                RECORD ALREADY EXISTS                        
ACEHIGH  EQU   0061                HIGHER LEVEL ACCOUNT MISSING                 
ACENO255 EQU   0062                NUMBER MUST BE 1-255                         
ACREC2BG EQU   0066                RECORD TOO BIG CALL DDS                      
ACCANTCH EQU   0078                CANNOT CHANGE KEY FIELD                      
ACEINVOP EQU   0079                INVALID OPTION                               
ACEBUD   EQU   0100                INVALID BUDGET TYPE                          
ACEBUDA  EQU   0101                INVALID BUDGET FOR ACCOUNT                   
ACEINVYR EQU   0104                INVALID YEAR                                 
ACESPAN  EQU   0111                DATE OUTSIDE PERMINTTED SPAN                 
ACEMOAL  EQU   0114                MONTH OF ACTIVITY LOCKED                     
ACETSKCD EQU   0150                INVALID TASK CODE                            
ACETERM  EQU   0182                TERM DATE BEFORE HIRE DATE                   
ACEMSINC EQU   0183                MISSING INCOME ACCOUNT                       
ACEMSRAT EQU   0186                MISSING BILLING RATE                         
ACERIGHT EQU   0207                MISSING RIGHT SIDE OF OPTION/FILTER          
ACEENDST EQU   0224                END DATE AFTER START DATE                    
ACEFLDRQ EQU   0242                INPUT IS REQUIRED FOR THIS FIELD             
ACEPFK   EQU   0273                INVALID PFKEY USED                           
ACE2FEW  EQU   1400                TOO FEW PARAMETERS                           
ACE2MANY EQU   1401                TOO MANY PARAMETERS                          
ACEPRM   EQU   1402                INVALID PARAMETER                            
ACECNPR  EQU   1404                INVALID CODE/NAME PARAMETER                  
ACEDUPR  EQU   1405                DUPLICATE PARAMETER                          
ACEIVTYP EQU   1406                INVALID TYPE                                 
ACEDUSN  EQU   1414                DUPLICATE SORT NUMBER                        
ACEIVUL  EQU   1419                INVALID UNIT/LEDGER                          
ACEIVOF  EQU   1427                INVALID OFFICE                               
ACESIANL EQU   1610                SI ACCOUNT NOT FLAGGED FOR ANALYSIS          
ACEIVMET EQU   1650                INVALID METHOD                               
ACECDXST EQU   1651                CODE ALREADY EXISTS                          
ACENOREV EQU   1652                REVERSAL CODE DOES NOT EXIST                 
ACEIVPER EQU   1653                INVALID PERSON CODE                          
ACEIVHRS EQU   1654                INVALID HOURS                                
ACENOMET EQU   1655                METHOD DOES NOT EXIST                        
ACESTDHR EQU   1656                STANDARD HOURS RECORD ALREADY EXISTS         
ACEACTHR EQU   1657                PERSON SET UP FOR ACTUAL HOURS               
ACEQTRHR EQU   1658                QUARTER HOURS ONLY                           
ACEIVLOC EQU   1659                INVALID LOCATION FOR THIS PERSON             
ACETABDN EQU   1660                ...TAB DOWN TO ADD NEW ENTRY                 
ACEDUPEN EQU   1661                DUPLICATE ENTRY                              
ACEPERDF EQU   1662                INVALID PERIOD DEFINITION                    
ACEIVDAY EQU   1663                INVALID DAY                                  
ACEIVMON EQU   1664                INVALID MONTH                                
ACEPERCT EQU   1665                PERIODS MUST BE CONTIGUOUS                   
ACENOCAL EQU   1666                CALENDAR RECORD DOES NOT EXIST               
ACEIVPRO EQU   1668                INVALID PROFILE                              
ACENODOL EQU   1669                CANNOT DELETE OFFICE LIST                    
ACEIVOFL EQU   1670                INVALID OFFICE LIST                          
ACEINVST EQU   1671                INVALID SETTING                              
ACENOOFL EQU   1672                OFFC LIST PROFILE MUST BE SET FIRST          
ACECDREV EQU   1674                CANNOT CHANGE CODE USED FOR REVERSAL         
ACEPREND EQU   1675                PLEASE ENTER PREVIOUS END DATE               
ACEDEFOP EQU   1676                DEFAULT OPT ONLY VALID WITH DISPLAY          
ACECDDEL EQU   1677                CANNOT DELETE EXISTING CODE -                
ACEDESC1 EQU   1678                DESCRIPTION OF 1 INVALID                     
ACEMETH9 EQU   1679                CAN ONLY HAVE UP TO 9 METHODS                
ACESTHRD EQU   1680                START DATE AFTER HIRE DATE                   
ACESTPND EQU   1681                START DATE AFTER PREVIOUS END DATE           
ACESTDEF EQU   1682                MISSING DEFAULT STD HOURS REC                
ACECALST EQU   1683                STD HOURS ALREADY SET UP FOR CAL             
ACEREMCH EQU   1684                REMOVE ONLY VALID WTIH CHANGE                
ACEREMLW EQU   1685                MUST REMOVE HOURS FROM LOWER RECS            
ACEDUP15 EQU   1686                DUPLICATE '15' ACCOUNTS                      
ACENOUPD EQU   1687                NOT AUTHORIZED FOR UPDATE                    
ACENOHED EQU   1688                CAN NOT ADD OVERHEADS TO PERSON              
ACEDPOST EQU   1689                UNABLE TO DELETE - POSTINGS EXIST            
ACEDSALS EQU   1690                UNABLE TO DELETE - SALARY EXISTS             
ACEDLOCS EQU   1691                UNABLE TO DELETE - DELETE LOCATIONS          
ACEPERDT EQU   1692                INVALID DATE FOR THIS PERSON                 
ACEIDEPT EQU   1693                INVALID DEPARTMENT                           
ACEISDPT EQU   1694                INVALID SUBDEPARTMENT                        
ACEITASK EQU   1695                INVALID TASK                                 
ACEIMOA  EQU   1696                INVALID MOA RANGE                            
ACEIPERD EQU   1697                INVALID PERIOD                               
ACEILOCD EQU   1698                INVALID LOCATION FOR DATE                    
ACEENTDT EQU   1699                PERIOD NUMBER NOT VALID - ENTER DTE          
ACEENAST EQU   1700                END AFTER NEXT START DATE                    
ACEFUTSL EQU   1701                CANNOT END LOCATION - FUTURE SALARY          
ACERQPRD EQU   1702                OPT/MAINT PROFILE REQUIRES PRODUCT           
ACERQJOB EQU   1703                OPT/MAINT PROFILE REQUIRES JOB               
ACENATMS EQU   1704                NOT AUTHORISED FOR TMS                       
ACEFUTMT EQU   1705                CANNOT BE > 4 MONTHS INTO FUTURE             
ACEOPNMT EQU   1706                TIME MUST BE INPUT INTO AN OPEN MNTH         
ACETIMER EQU   1707                TIME SHEET CONTAINS ERRORS                   
ACEBXJOB EQU   1708                CANNOT ADD B TIME TO AN EXPENSE JOB          
ACEIINCM EQU   1709                INVALID INCOME ACCOUNT                       
ACEIANAL EQU   1710                INVALID ANALYSIS ACCOUNT                     
ACEDTTRM EQU   1711                DATE IS AFTER TERMINATION DATE               
ACEVALCH EQU   1712                ONLY VALID WITH ACTION CAHNGE                
ACEONLY1 EQU   1713                CAN ONLY UPDATE DATES FOR 1 LOCATION         
ACEEDTHR EQU   1714                MUST REMOVE EDIT HOURS FOR YEAR              
ACEFATAL EQU   1715                FATAL ERROR - TIMESHEET NOT UPDATED          
ACEDBEND EQU   1716                DATE CAN NOT BE BEFORE END DATE              
ACENEGCK EQU   1717                TOTAL HOURS ON JOB MAY NOT BE NEGTVE         
ACECOSTG EQU   1718                MISSING COSTING GROUP                        
ACEMAX#  EQU   1719                MAXIMUM NUMBER ITEMS EXCEEDED                
ACENOLOW EQU   1720                CAN ONLY ADD SALARY TO LOW LEVEL ACC         
ACEENDRQ EQU   1721                END DATE REQUIRED FOR YTD                    
ACERT99  EQU   1722                RATE CAN NOT EXCEED 99%                      
ACEINVBA EQU   1723                INVALID BASIS FOR THIS TYPE                  
ACEDCONF EQU   1724                CONFLICTING DATES                            
ACENOMAT EQU   1725                HOURS DONT MATCH - PLEASE CORRECT            
ACESALBE EQU   1726                SALARY LOCK DATE IS BEFORE END DATE          
ACEITXWC EQU   1727                INVALID TAX WORKCODE                         
ACEYUPD  EQU   1728                ENTER Y TO UPDATE                            
ACEDBPRE EQU   1729                DATE IS BEFORE PREV LOCATION'S START         
ACEITAX  EQU   1730                INVALID TAX INFORMATION                      
ACEIPID  EQU   1731                PID ALREADY EXISTS ON PERSON #####           
ACEUPDTE EQU   1734                CANNOT SAVE - MUST PRESS UPDATE              
ACEMSPRD EQU   1735                MISSING PRODUCT CODE                         
ACEMSJOB EQU   1736                MISSING JOB CODE                             
ACEMSTSK EQU   1737                MISSING TASK CODE                            
ACEMSMOA EQU   1738                MISSING MOA                                  
ACEMSHRS EQU   1739                MISSING HOURS                                
ACELOCDT EQU   1744                DATE OUTSIDE LOC START/END RANGE             
ACEOOENT EQU   1752                ONLY ONE ENTRY ALLOWED                       
ACETASK  EQU   1755                INVALID TASK                                 
ACENCRAT EQU   1756                NO COSTING RATE DEFINED                      
ACEOVRRD EQU   1757                NO OVERRIDE ALLOWED                          
ACEINCAC EQU   1760                PF TO BILLABLE SCREEN AND ENTER INC          
ACEUSINP EQU   1761                MUST USE INPUT PROGRAM TYPE 49               
ACENDBST EQU   1762                END DATE IS BEFORE START DATE                
ACEOPTDT EQU   1763                MUST USE MONTH OPT WITH A DATE RANGE         
ACERECIV EQU   1764                REC/ACT COMBO INVALID USING STEREO           
ACEOPDIS EQU   1765                OPTION VALID ONLY W/ ACTION DISPLAY          
ACEONLOC EQU   1766                MUST ADD LOCATION TO FIRST PAGE              
ACEILOCE EQU   1768                INV LOC FOR DATE-PLEASE ENTER A LOC          
ACEIADJO EQU   1769                SAL OUTSIDE LOC DATE-ADJ PCODE ONLY          
ACEADJSL EQU   1770                UNABLE TO CHANGE-ADJ SAL OUTSIDE LOC         
ACEFADJS EQU   1771                CANNOT END LOC-FUTURE ADJ SAL EXISTS         
ACETMSDT EQU   1772                MON MUST START ON SAME DAY AS TMS ST         
ACEYTDMA EQU   1773                CANNOT USE YTDADJ PCODE W/ MON/ANN           
ACELSTOP EQU   1774                NO VALID OPTIONS FOR LIST SCREEN             
ACEHIRE  EQU   1775                HIRE DTE CANNOT BE AFTER 1ST STRT DT         
ACESPOST EQU   1776                CANNOT DEL-ALLOCATED $$'S EXIST              
ACEACBAL EQU   1777                CANNOT DEL-ACCOUNT BALANCE EXISTS            
ACEDELOC EQU   1778                CAN ONLY DELETE 1 LOC PER TRANSCTION         
ACEHSTLM EQU   1779                TOO MANY HIST RECS-MANUALLY DELETE           
ACERCACT EQU   1780                REC/ACT VALID ONLY FROM PERSON PRGM          
ACESETLV EQU   1781                SETTING INVALID AT THIS LEVEL                
ACESVTMS EQU   1782                UNABLE TO CHANGE-SAVED TIME EXITS            
ACEDRTIM EQU   1783                CANNOT CHA-DRAFT TRANS EXIST                 
ACEOFFL  EQU   1784                INVALID OFFICE/OFFICE LIST                   
ACERTEHI EQU   1785                RATE CANNOT EXCEED 1000%                     
ACEXREF  EQU   1786                CANNOT CHA IN COST. USE SECURITY PGM         
ACEMOLCK EQU   1787                SAL MONTHS ARE LOCKED. MANUALLY DEL          
ACETSLCK EQU   1792                CANNOT ADD/CHANGE A TMS LOCK DATE            
ACESNAME EQU   1795                NAMES DO NOT MATCH W/ PERSON REC IN.         
ACEIVDTE EQU   1800                INVALID DATE                                 
