*          DATA SET ACCAPDFREC AT LEVEL 026 AS OF 07/05/20                      
*              COSTING PROFILE DEFAULT RECORD                                   
         SPACE 3                                                                
DEFREC   DC    49X'00'                  KEY ETC                                 
*                                       DEFAULT ELS COVERD BY OPDELD            
         DC    AL1(OPDELQ,17,CORUN#)    RUN PERIOD                              
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'M'                     MONTHLY                                 
*                                                                               
         DC    AL1(OPDELQ,17,COSTD#)    USING STANDARD HOURS                    
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'N'                     NO                                      
*                                                                               
         DC    AL1(OPDELQ,17,COCON#)    CONTRA LEVEL                            
         DC    CL8'DDS',X'941222'                                               
         DC    X'0000'                                                          
         DC    C'2'                     2  (2,3)                                
*                                                                               
         DC    AL1(OPDELQ,17,COLOK#)    LOCK TIMESHEET INPUT WHEN RUN           
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'N'                     NO                                      
*                                                                               
         DC    AL1(OPDELQ,17,COINC#)    INCLUDE IN ALLOCATION                   
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,COEXEC#)   INCLUDE EXECUTIVES                      
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,COHRRAT#)  INCLUDE HOURLY RATES                    
         DC    CL8'DDS',X'941207'                                               
         DC    X'0000'                                                          
         DC    C'N'                     NO                                      
*                                                                               
         DC    AL1(OPDELQ,17,COONUPD#)  ONLINE UPDATE                           
         DC    CL8'DDS',X'030129'                                               
         DC    X'0000'                                                          
         DC    C'N'                     NO                                      
*                                                                               
DFUBK    DC    AL1(OPDELQ,DFUBKL,COUBK#) MCS T/S: TIME UPDTES BUCKT WHN         
         DC    CL8'DDS',X'080401'                                               
         DC    X'0000'                                                          
         DC    CL1'5'                   1/2/3/4/5 = SAVED/SUBMITTED/CLI         
*                                       APPR/LINE MGR APPR/FULLY APPRVD         
DFUBKL   EQU   *-DFUBK                                                          
*                                                                               
         DC    AL1(OPDELQ,20,COPCT#)    PCT OF SALARY INCLUDED  (4DP)           
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    PL4'1000000'             100%                                    
*                                                                               
         DC    AL1(OPDELQ,20,COPC1#)    PCT #1 FOR PAY CALCS    (4DP)           
         DC    CL8'DDS',X'940209'                                               
         DC    X'0000'                                                          
         DC    PL4'0000000'             0%                                      
*                                                                               
         DC    AL1(OPDELQ,20,COPC2#)    PCT #2 FOR PAY CALCS    (4DP)           
         DC    CL8'DDS',X'940209'                                               
         DC    X'0000'                                                          
         DC    PL4'0000000'             0%                                      
*                                                                               
         DC    AL1(OPDELQ,17,PIDREQ#)   PID REQRD                               
         DC    CL8'DDS',X'941222'                                               
         DC    X'0000'                                                          
         DC    C'N'                     NO                                      
*                                                                               
         DC    AL1(OPDELQ,17,CODTS#)    DEFAULT TAX SCREEN                      
         DC    CL8'DDS',X'940920'                                               
         DC    X'0000'                                                          
         DC    X'C2'                    NB                                      
*                                                                               
         DC    AL1(OPDELQ,17,CNFTMS#)   CONFIRM UPDATE FOR TMS                  
         DC    CL8'DDS',X'950425'                                               
         DC    X'0000'                                                          
         DC    C'N'                     NO                                      
*                                                                               
         DC    AL1(OPDELQ,17,CODTMS#)   DAILY TIME FOR TMS                      
         DC    CL8'DDS',X'040713'                                               
         DC    X'0000'                                                          
         DC    C'N'                     NO                                      
*                                                                               
         DC    AL1(OPDELQ,17,COBRTE#)   POST SALES RATE NOT COST BTIME          
         DC    CL8'DDS',X'951228'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,CORRTE#)   POST SALES RATE NOT COST RTIME          
         DC    CL8'DDS',X'951228'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,COTBTL#)   INC/SUSP ACCT FOR B-TIME                
         DC    CL8'DDS',X'951021'                                               
         DC    X'0000'                                                          
         DC    C'I'                     INCOME                                  
*                                                                               
         DC    AL1(OPDELQ,17,COTDLK#)   USE DEFAULT INC/SUSP ACCT               
         DC    CL8'DDS',X'951021'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,CODTM#)    DEFAULT TYPE OF TIME                    
         DC    CL8'DDS',X'981208'                                               
         DC    X'0000'                                                          
         DC    C'X'                     NO DEFAULT                              
*                                                                               
         DC    AL1(OPDELQ,21,COATM#)    ALLOWABLE TYPE OF TIME                  
         DC    CL8'DDS',X'981208'                                               
         DC    X'0000'                                                          
         DC    CL5'B,N,R'               ALL TYPES                               
*                                                                               
         DC    AL1(OPDELQ,17,COIPER#)   LEVEL FOR PERSONAL HOURS                
         DC    CL8'DDS',X'950906'                                               
         DC    X'0000'                                                          
         DC    C'P'                     PERSON                                  
*                                                                               
         DC    AL1(OPDELQ,17,CODONLY#)  POST ONLY DIRECT COSTS                  
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'N'                     NO                                      
*                                                                               
         DC    AL1(OPDELQ,17,CODBASE#)  DIRECT ALLOC BASIS                      
         DC    CL8'DDS',X'930826'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YTD                                     
*                                                                               
         DC    AL1(OPDELQ,17,CODIR#)    DEFAULT DIRECT ACCOUNT                  
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'Z'                     Z                                       
*                                                                               
         DC    AL1(OPDELQ,17,COIND#)    ACCOUNT IN 15 FOR INDIRECT              
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'Z'                     Z                                       
*                                                                               
         DC    AL1(OPDELQ,17,COIBASE#)  INDIRECT ALLOC BASIS                    
         DC    CL8'DDS',X'940209'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YTD                                     
*                                                                               
         DC    AL1(OPDELQ,18,COIOFFL#)  INDIRECT OFFICE LIST                    
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    X'0000'                  BINARY ZEROS(NOT USED)                  
*                                                                               
         DC    AL1(OPDELQ,17,COINOH#)   INDIRECT LEVEL NO HOURS                 
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'O'                     OFFICE                                  
*                                                                               
         DC    AL1(OPDELQ,17,COIEXC#)   INDIRECT LEVEL FOR EXECS                
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'O'                     OFFICE                                  
*                                                                               
         DC    AL1(OPDELQ,17,COIALLD#)  LEVEL FOR DEPT INDIRECT ALLOC           
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'D'                     DEPT                                    
*                                                                               
         DC    AL1(OPDELQ,17,COIALLO#)  LEVEL FOR OFFC INDIRECT ALLOC           
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'O'                     OFFICE                                  
*                                                                               
         DC    AL1(OPDELQ,17,COOCIND#)  BASIS FOR OFFC INDIRECT ALLOC           
         DC    CL8'DDS',X'970626'                                               
         DC    X'0000'                                                          
         DC    C'C'                     COST                                    
*                                                                               
         DC    AL1(OPDELQ,17,COIALLC#)  LEVEL FOR CORP INDIRECT ALLOC           
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'C'                     CORP                                    
*                                                                               
         DC    AL1(OPDELQ,17,COACIND#)  BASIS FOR AGY INDIRECT ALLOC            
         DC    CL8'DDS',X'970626'                                               
         DC    X'0000'                                                          
         DC    C'C'                   COST                                      
*                                                                               
         DC    AL1(OPDELQ,17,CONBAB#)   NEW BUSINESS ALLOC COST/INCOME          
         DC    CL8'DDS',X'941111'                                               
         DC    X'0000'                                                          
         DC    C'C'                     COST                                    
*                                                                               
         DC    AL1(OPDELQ,17,CONBAL#)   LEVEL FOR NEW BUSINESS ALLOC            
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'O'                     OFFICE                                  
*                                                                               
         DC    AL1(OPDELQ,17,CONBOFF#)  N.B ALLOC BASED ON CLT/STAFF OF         
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'S'                     STAFF (1R)                              
*                                                                               
         DC    AL1(OPDELQ,17,CONBOUT#)  ACCOUNT IN 15 FOR NB BACKOUT            
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     15Y                                     
*                                                                               
         DC    AL1(OPDELQ,17,CONBIN#)   ACCOUNT IN 15 FOR NB SPREADBACK         
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'X'                     15X                                     
*                                                                               
         DC    AL1(OPDELQ,17,COPBAB#)   PRO BONO ALLOC COST/INCOME              
         DC    CL8'DDS',X'941111'                                               
         DC    X'0000'                                                          
         DC    C'C'                     COST                                    
*                                                                               
         DC    AL1(OPDELQ,17,COPBAL#)   LEVEL FOR PRO BONO ALLOC                
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'O'                     OFFICE                                  
*                                                                               
         DC    AL1(OPDELQ,17,COPBOFF#)  P.B ALLOC BASED ON CLT/STAFF OF         
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'S'                     STAFF (1R)                              
*                                                                               
         DC    AL1(OPDELQ,17,COPBOUT#)  ACCOUNT IN 15 FOR PB BACKOUT            
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'W'                     15W                                     
*                                                                               
         DC    AL1(OPDELQ,17,COPBIN#)   ACCOUNT IN 15 FOR PB SPREADBACK         
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'V'                     15V                                     
*                                                                               
         DC    AL1(OPDELQ,17,COHOAB#)   HOUSE ALLOC COST/INCOME                 
         DC    CL8'DDS',X'941111'                                               
         DC    X'0000'                                                          
         DC    C'C'                     COST                                    
*                                                                               
         DC    AL1(OPDELQ,17,COHOAL#)   LEVEL FOR HOUSE ALLOC                   
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'O'                     OFFICE                                  
*                                                                               
         DC    AL1(OPDELQ,17,COHOOFF#)  HOUSE ALC BASED ON CLT/STAFF OF         
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'S'                     STAFF (1R)                              
*                                                                               
         DC    AL1(OPDELQ,17,COHOOUT#)  ACCOUNT IN 15 FOR HO BACKOUT            
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'U'                     15W                                     
*                                                                               
         DC    AL1(OPDELQ,17,COHOIN#)   ACCOUNT IN 15 FOR HO SPREADBACK         
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'T'                     15V                                     
*                                                                               
         DC    AL1(OPDELQ,17,COVAB#)    OVH ALLOC COST/INCOME/HOURS             
         DC    CL8'DDS',X'941111'                                               
         DC    X'0000'                                                          
         DC    C'C'                     COST                                    
*                                                                               
         DC    AL1(OPDELQ,17,COVBASE#)  ALLOC OVERHEAD YTD                      
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'N'                     NO                                      
*                                                                               
         DC    AL1(OPDELQ,17,COVINC#)   INCLUDE OVERHEAD                        
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,COVALLD#)  LEVEL FOR DEPT OVERHEAD ALLOC           
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'D'                     DEPT                                    
*                                                                               
         DC    AL1(OPDELQ,17,COVALLO#)  LEVEL FOR OFFC OVERHEAD ALLOC           
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'O'                     OFFICE                                  
*                                                                               
         DC    AL1(OPDELQ,17,COVALLC#)  LEVEL FOR CORP OVERHEAD ALLOC           
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'C'                     CORP                                    
*                                                                               
         DC    AL1(OPDELQ,17,COINDX#)   INCLUDE IND PAY TYPE                    
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,18,COISOFL#)  IND PAY TYPE OFFICE LIST                
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    X'0000'                  BINARY ZEROS(NOT USED)                  
*                                                                               
         DC    AL1(OPDELQ,17,COISALL#)  LEVEL FOR IND PAY TYPE ALLOC            
         DC    CL8'DDS',X'921101'                                               
         DC    X'0000'                                                          
         DC    C'O'                     OFFICE                                  
*                                                                               
         DC    AL1(OPDELQ,17,COMCT#)    MCS TIMESHEETS IN USE                   
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'N'                     NO                                      
*                                                                               
         DC    AL1(OPDELQ,17,COTYT#)    MCS T/S: DISPLAY TIME TYPE              
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,COORC#)    MCS T/S: DISPLAY ORDER NUMBER           
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'N'                     NO                                      
*                                                                               
         DC    AL1(OPDELQ,17,COESC#)    MCS T/S: DISPLAY ESTIMATE NUM           
         DC    CL8'DDS',X'080820'                                               
         DC    X'0000'                                                          
         DC    C'N'                     NO                                      
*                                                                               
         DC    AL1(OPDELQ,17,COIRC#)    MCS T/S: DISPLAY INTERNAL REF           
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'N'                     NO                                      
*                                                                               
         DC    AL1(OPDELQ,17,COCLC#)    MCS T/S: DISPLAY CLIENT CODE            
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,COPRC#)    MCS T/S: DISPLAY PRODUCT CODE           
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,COJOC#)    MCS T/S: DISPLAY JOB CODE               
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,COTSK#)    MCS T/S: DISPLAY TASK CODE              
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,CONCC#)    MCS T/S: DISP NON-CL TIME ACOD          
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,COTOT#)    MCS T/S: DISPLAY TOTAL                  
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,COCNM#)    MCS T/S: DISPLAY CLIENT NAME            
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,COPNM#)    MCS T/S: DISPLAY PRODUCT NAME           
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,COJNM#)    MCS T/S: DISPLAY JOB NAME               
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,CONCN#)    MCS T/S: DISP NON-CL TIME ACNM          
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,COBHR#)    MCS T/S: DISPLAY BILLABLE HOURS         
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,COCHR#)    MCS T/S: DISPLAY CHARGBLE HOURS         
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,CONBH#)    MCS T/S: DISP NON-BILLBLE HOURS         
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,CONCH#)    MCS T/S: DISP NON-CHARGBL HOURS         
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,COTSD#)    MCS T/S: DEFAULT T/S DISP               
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'M'                     MOST RECENT                             
*                                                                               
         DC    AL1(OPDELQ,17,COCTS#)    MCS T/S: CREATE T/S FROM PRIOR          
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
*        DC    AL1(OPDELQ,17,COTMO#)    MCS T/S: USE CAL MOA/TIME MOA           
*        DC    CL8'DDS',X'060215'                                               
*        DC    X'0000'                                                          
*        DC    C'C'                     CALENDAR MOA                            
*                                                                               
DFNDO    DC    AL1(OPDELQ,DFNDOL,CONDO#) MCS T/S: DAYS B4 T/S OVERDUE           
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    PL4'14'                  14 DAYS - OK? MUST BE PL4               
DFNDOL   EQU   *-DFNDO                                                          
*                                                                               
DFNBL    DC    AL1(OPDELQ,DFNBLL,CONBL#) MCS T/S: N'BLANK T/S LINES             
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    PL4'20'                  20 LINES - OK? MUST BE PL4              
DFNBLL   EQU   *-DFNBL                                                          
*                                                                               
         DC    AL1(OPDELQ,17,CODMO#)    MCS T/S: T/SHEET DAY - MONDAY           
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,CODTU#)    MCS T/S: T/SHEET DAY - TUESDAY          
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,CODWE#)    MCS T/S: T/SHEET DAY - WEDNSDAY         
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,CODTH#)    MCS T/S: T/SHEET DAY - THURSDAY         
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,CODFR#)    MCS T/S: T/SHEET DAY - FRIDAY           
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
*                                                                               
         DC    AL1(OPDELQ,17,CODSA#)    MCS T/S: T/SHEET DAY - SATURDAY         
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'N'                     NO                                      
*                                                                               
         DC    AL1(OPDELQ,17,CODSU#)    MCS T/S: T/SHEET DAY - SUNDAY           
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'N'                     NO                                      
*                                                                               
         DC    AL1(OPDELQ,17,COACS#)    MCS T/S: T/SHEET APPROVAL               
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'C'                     CONCURRENT OR SEQUENTIAL                
*                                                                               
DFPHA    DC    AL1(OPDELQ,DFPHAL,COPHA#)  MCS T/S: PUBLIC HOLS 1N ACC           
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    CL8'            '        A/C CODE                                
DFPHAL   EQU   *-DFPHA                                                          
*                                                                               
DFSHA    DC    AL1(OPDELQ,DFSHAL,COSHA#)  MCS T/S: STAFF HOLS 1N ACC            
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    CL8'            '        A/C CODE                                
DFSHAL   EQU   *-DFSHA                                                          
*                                                                               
DFBCA    DC    AL1(OPDELQ,DFBCAL,COBCA#) MCS T/S: SKIP CLI APRVL 4 EXPS         
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    C'Y'                     YES                                     
DFBCAL   EQU   *-DFBCA                                                          
*                                                                               
DFTBV    DC    AL1(OPDELQ,DFTBVL,COTBV#) MCS T/S: VIEW N'MTHS BACK DATA         
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    PL4'1'                   1/2/3                                   
DFTBVL   EQU   *-DFTBV                                                          
*                                                                               
DFTUP    DC    AL1(OPDELQ,DFTUPL,COTUP#) MCS T/S: TIME UPDTES PSTGS WHN         
         DC    CL8'DDS',X'060922'                                               
         DC    X'0000'                                                          
         DC    CL1'5'                   1/2/3/4/5 = SAVED/SUBMITTED/CLI         
*                                       APPR/LINE MGR APPR/FULLY APPRVD         
DFTUPL   EQU   *-DFTUP                                                          
*                                                                               
DFEML    DC    AL1(OPDELQ,DFEMLL,COEML#) MCS T/S: EMAIL REMINDERS               
         DC    CL8'DDS',X'071207'                                               
         DC    X'0000'                                                          
         DC    PL4'0'                   0/1/2/3                                 
DFEMLL   EQU   *-DFEML                                                          
*                                                                               
DFMAT    DC    AL1(OPDELQ,DFMATL,COMAT#) MCS T/S: MATERIALS IN USE              
         DC    CL8'DDS',X'060525'                                               
         DC    X'0000'                                                          
         DC    CL1'N'                   NO/YES                                  
DFMATL   EQU   *-DFMAT                                                          
*                                                                               
DFD2E    DC    AL1(OPDELQ,DFD2EL,COD2E#) DAYS BEFORE EXTRA REMINDER             
         DC    CL8'DDS',X'080228'                                               
         DC    X'0000'                                                          
         DC    PL4'1'                   1 DAY                                   
DFD2EL   EQU   *-DFD2E                                                          
*                                                                               
DFORD    DC    AL1(OPDELQ,DFORDL,COORD#) ORDER IN EDIT PANEL                    
         DC    CL8'DDS',X'080228'                                               
         DC    X'0000'                                                          
         DC    CL1'N'                   NO/YES/COMPULSORY                       
DFORDL   EQU   *-DFORD                                                          
*                                                                               
DFEST    DC    AL1(OPDELQ,DFESTL,COEST#) ESTIMATE IN EDIT PANEL                 
         DC    CL8'DDS',X'080820'                                               
         DC    X'0000'                                                          
         DC    CL1'N'                   NO/YES/COMPULSORY                       
DFESTL   EQU   *-DFEST                                                          
*                                                                               
DFINR    DC    AL1(OPDELQ,DFINRL,COINR#) INTERNAL REFERENCE IN EDIT             
         DC    CL8'DDS',X'080228'                                               
         DC    X'0000'                                                          
         DC    CL1'N'                   NO/YES                                  
DFINRL   EQU   *-DFINR                                                          
*                                                                               
DFPHL    DC    AL1(OPDELQ,DFPHLL,COPHL#) MCS T/S: PUB HOL.DATES HELD AT         
         DC    CL8'DDS',X'060525'                                               
         DC    X'0000'                                                          
         DC    CL1'A'                   (A)GENCY,(P)EROFF,(D)EPT,(S)UBD         
DFPHLL   EQU   *-DFPHL                                                          
*                                                                               
DFCLA    DC    AL1(OPDELQ,DFMATL,COCLA#) MCS T/S: CLIENT LINE APPROVAL          
         DC    CL8'DDS',X'060525'                                               
         DC    X'0000'                                                          
         DC    CL1'Y'                   NO/YES                                  
DFCLAL   EQU   *-DFMAT                                                          
*                                                                               
DFFNR    DC    AL1(OPDELQ,DFFNRL,COFNR#) MCS T/S: FORCE NARRATIVE               
         DC    CL8'DDS',X'060525'                                               
         DC    X'0000'                                                          
         DC    CL1'N'                   NO/YES                                  
DFFNRL   EQU   *-DFFNR                                                          
*                                                                               
DFURS    DC    AL1(OPDELQ,DFURSL,COURS#) MCS T/S: USE RESOURCES                 
         DC    CL8'DDS',X'080401'                                               
         DC    X'0000'                                                          
         DC    CL1'N'                   NO/YES                                  
DFURSL   EQU   *-DFURS                                                          
*                                                                               
DFNJB    DC    AL1(OPDELQ,DFNJBL,CONJB#) MCS T/S: NO JOB INPUT ALLOWED          
         DC    CL8'DDS',X'080520'                                               
         DC    X'0000'                                                          
         DC    CL1'N'                   NO/YES                                  
DFNJBL   EQU   *-DFNJB                                                          
*                                                                               
DFCNR    DC    AL1(OPDELQ,DFCNRL,COCNR#)  MCS T/S: COPY NARRATIVE               
         DC    CL8'DDS',X'080620'                                               
         DC    X'0000'                                                          
         DC    C'N'                     NO                                      
DFCNRL   EQU   *-DFCNR                                                          
*                                                                               
DFTTU    DC    AL1(OPDELQ,DFTTUL,COTTU#)  MCS T/S: T/S TARGET UTILISE           
         DC    CL8'DDS',X'080601'                                               
         DC    X'0000'                                                          
         DC    C'N'                     NO                                      
DFTTUL   EQU   *-DFTTU                                                          
*                                                                               
DFFAR    DC    AL1(OPDELQ,DFFARL,COFAR#)  MCS T/S: T/S TARGET UTILISE           
         DC    CL8'DDS',X'080601'                                               
         DC    X'0000'                                                          
         DC    C'N'                     NO                                      
DFFARL   EQU   *-DFFAR                                                          
*                                                                               
DFTNB    DC    AL1(OPDELQ,DFTNBL,COTNB#) MCS EXP: THRESHOLD NON-BILLBLE         
         DC    CL8'DDS',X'060215'       CLIENT EXPENSES                         
         DC    X'0000'                                                          
         DC    PL4'0'                   NUMERIC TO 2DP                          
DFTNBL   EQU   *-DFTNB                                                          
*                                                                               
DFLMA    DC    AL1(OPDELQ,DFLMAL,COLMA#) MCS EXP: LINE MGR APPROVAL             
         DC    CL8'DDS',X'060215'       REQ'D WHEN ALL CLIENT APPROVED          
         DC    X'0000'                                                          
         DC    C'Y'                                                             
DFLMAL   EQU   *-DFLMA                                                          
*                                                                               
DFEBV    DC    AL1(OPDELQ,DFEBVL,COEBV#) MCS EXP: VIEW N'MTHS BACK DATA         
         DC    CL8'DDS',X'060215'                                               
         DC    X'0000'                                                          
         DC    PL4'1'                   1/2/3                                   
DFEBVL   EQU   *-DFEBV                                                          
*                                                                               
DFENR    DC    AL1(OPDELQ,DFENRL,COENR#) MCS EXP: NARRATIVE REQUIRED            
         DC    CL8'DDS',X'080414'                                               
         DC    X'0000'                                                          
         DC    C'N'                                                             
DFENRL   EQU   *-DFENR                                                          
*                                                                               
DFLTP    DC    AL1(OPDELQ,DFLTPL,COLTP#) MCS EXP: LINES TO PRINT                
         DC    CL8'DDS',X'080601'                                               
         DC    X'0000'                                                          
         DC    PL4'50'                                                          
DFLTPL   EQU   *-DFLTP                                                          
*                                                                               
DFCVA    DC    AL1(OPDELQ,DFCVAL,COCVA#) MCS EXP: CLIENT VALIDATION             
         DC    CL8'DDS',X'080601'                                               
         DC    X'0000'                                                          
         DC    C'N'                                                             
DFCVAL   EQU   *-DFCVA                                                          
*                                                                               
DFECL    DC    AL1(OPDELQ,DFECLL,COECL#) MCS EXP: ESTIMATE ON CLAIM             
         DC    CL8'DDS',X'080601'                                               
         DC    X'0000'                                                          
         DC    C'N'                                                             
DFECLL   EQU   *-DFECL                                                          
*                                                                               
DFNMX    DC    AL1(OPDELQ,DFNMXL,CONMX#) MCS EXP: NO MIXIN OF CLAIM TYP         
         DC    CL8'DDS',X'090705'                                               
         DC    X'0000'                                                          
         DC    C'Y'                                                             
DFNMXL   EQU   *-DFNMX                                                          
*                                                                               
DFAPC    DC    AL1(OPDELQ,DFAPCL,COACM#) MCS EXP: APPROVER COMMENTS             
         DC    CL8'DDS',X'090705'                                               
         DC    X'0000'                                                          
         DC    C'N'                                                             
DFAPCL   EQU   *-DFAPC                                                          
*                                                                               
DFCCO    DC    AL1(OPDELQ,DFCCOL,COCCM#) MCS EXP: CLAIMER COMMENTS              
         DC    CL8'DDS',X'090705'                                               
         DC    X'0000'                                                          
         DC    C'N'                                                             
DFCCOL   EQU   *-DFCCO                                                          
*                                                                               
DFCBD    DC    AL1(OPDELQ,DFCBDL,COBDT#) MCS EXP: CLAIM BACK DATE               
         DC    CL8'DDS',X'090705'                                               
         DC    X'0000'                                                          
         DC    PL4'1'                                                           
DFCBDL   EQU   *-DFCBD                                                          
*                                                                               
DFRCP    DC    AL1(OPDELQ,DFRCPL,CORCP#) RECEIPT BOX TICKED BY DEF              
         DC    CL8'DDS',X'090923'                                               
         DC    X'0000'                                                          
         DC    C'N'                                                             
DFRCPL   EQU   *-DFRCP                                                          
*                                                                               
DFNCM    DC    AL1(OPDELQ,DFNCML,CONCM#) NON-COMPLIANT DAYS BEFORE NOT          
         DC    CL8'DDS',X'090923'        SUBMITTER                              
         DC    X'0000'                                                          
         DC    CL4' '                                                           
DFNCML   EQU   *-DFNCM                                                          
*                                                                               
DFNCL    DC    AL1(OPDELQ,DFNCLL,CONCL#) NON-COMPLIANT DAYS BEFORE LOCK         
         DC    CL8'DDS',X'090923'        SUBMITTER                              
         DC    X'0000'                                                          
         DC    CL4' '                                                           
DFNCLL   EQU   *-DFNCL                                                          
*                                                                               
DFNCA    DC    AL1(OPDELQ,DFNCAL,CONCA#) NON-COMPLIANT DAYS BEFORE NOT          
         DC    CL8'DDS',X'090923'        APPROVER                               
         DC    X'0000'                                                          
         DC    CL4' '                                                           
DFNCAL   EQU   *-DFNCA                                                          
*                                                                               
DFNLA    DC    AL1(OPDELQ,DFNLAL,CONLA#) NON-COMPLIANT DAYS BEFORE LOCK         
         DC    CL8'DDS',X'090923'        APPROVER                               
         DC    X'0000'                                                          
         DC    CL4' '                                                           
DFNLAL   EQU   *-DFNLA                                                          
*                                                                               
DFPTA    DC    AL1(OPDELQ,DFPTAL,COPTA#) PREVENT T/S ADD IF PREVIOUS            
         DC    CL8'DDS',X'090923'        NOT SUBMITTED                          
         DC    X'0000'                                                          
         DC    C'N'                                                             
DFPTAL   EQU   *-DFPTA                                                          
*                                                                               
DFFTA    DC    AL1(OPDELQ,DFFTAL,COFTA#) FUTURE TIME ALLOWED?                   
         DC    CL8'DDS',X'091026'                                               
         DC    X'0000'                                                          
         DC    CL7'B,R,N,C'                                                     
DFFTAL   EQU   *-DFFTA                                                          
*                                                                               
DFFPA    DC    AL1(OPDELQ,DFFPAL,COFAP#) USE ACCOUNT SETTINGS IF Y/N            
         DC    CL8'DDS',X'091026'        FOR ABOVE                              
         DC    X'0000'                                                          
         DC    C'N'                                                             
DFFPAL   EQU   *-DFFPA                                                          
*                                                                               
DFNDA    DC    AL1(OPDELQ,DFNDAL,CONDA#) NUMBER OF DAYS OF FUTURE TIME          
         DC    CL8'DDS',X'091026'        ALLOWED                                
         DC    X'0000'                                                          
         DC    PL4'365'                                                         
DFNDAL   EQU   *-DFNDA                                                          
*                                                                               
DFDIA    DC    AL1(OPDELQ,DFDIAL,CODIA#) USE DIALOGUE FOR TIME INPUT            
         DC    CL8'DDS',X'100512'                                               
         DC    X'0000'                                                          
         DC    C'N'                                                             
DFDIAL   EQU   *-DFDIA                                                          
*                                                                               
DFCAE    DC    AL1(OPDELQ,DFCAEL,COCAE#) CHOOSE CLAIM APPROVERS IN EXP          
         DC    CL8'DDS',X'110501'                                               
         DC    X'0000'                                                          
         DC    C'N'                                                             
DFCAEL   EQU   *-DFCAE                                                          
*                                                                               
DFMIL    DC    AL1(OPDELQ,DFMILL,COMIL#) NEW MILEAGE SYSTEM IN USE              
         DC    CL8'DDS',X'110601'                                               
         DC    X'0000'                                                          
         DC    C'N'                                                             
DFMILL   EQU   *-DFMIL                                                          
*                                                                               
DFMTS    DC    AL1(OPDELQ,DFMTSL,COMTS#) MISSING TIMESHEET STATUS               
         DC    CL8'DDS',X'110331'                                               
         DC    X'0000'                                                          
         DC    X'02'                                                            
DFMTSL   EQU   *-DFMTS                                                          
*                                                                               
DFFNM    DC    AL1(OPDELQ,DFFNML,COFNM#) FORCE NARRACTIVE ON TIME MOVE          
         DC    CL8'DDS',X'110331'                                               
         DC    X'0000'                                                          
         DC    C'N'                                                             
DFFNML   EQU   *-DFFNM                                                          
*                                                                               
DFTHR    DC    AL1(OPDELQ,DFTHRL,COTHR#) AVAILABLE FOR THIRD PARTY USE          
         DC    CL8'DDS',X'122301'                                               
         DC    X'0000'                                                          
         DC    C'N'                                                             
DFTHRL   EQU   *-DFTHR                                                          
*                                                                               
DFDEF    DC    AL1(OPDELQ,DFDEFL,CODEF#) DEFAULT ACCOUNT LEVEL                  
         DC    CL8'DDS',X'181207'                                               
         DC    X'0000'                                                          
         DC    C'J'                                                             
DFDEFL   EQU   *-DFDEF                                                          
*                                                                               
DFOVT    DC    AL1(OPDELQ,DFOVTL,COOVT#) CONFIRM OVERTIME APPROVAL              
         DC    CL8'DDS',X'200706'                                               
         DC    X'0000'                                                          
         DC    C'N'                                                             
DFOVTL   EQU   *-DFOVT                                                          
*                                                                               
         DC    X'00'                    END OF RECORD                           
DEFRECL  EQU   *-DEFREC                                                         
