*          DATA SET ACCAPE9D   AT LEVEL 002 AS OF 07/09/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61DE9D      DATE 07/09/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
RTLDETLH DS    CL8                                                              
RTLDETL  DS    CL50     5    2   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      6    2    4  L  P N             T        Y              
RTLMOAH  DS    CL8                                                              
RTLMOA   DS    CL15     6   10   15  A  U N             T        Y    1         
RTLMOAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   28    7  L  P N             T        Y              
RTLMETHH DS    CL8                                                              
RTLMETH  DS    CL3      6   38    3  A  U N             T        Y              
RTLMNMEH DS    CL8                                                              
RTLMNME  DS    CL34     6   46   34  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  L  P N             T        Y  201         
         DS    CL8                                                              
RTLOFFH  DS    CL8                                                              
RTLOFF   DS    CL2      7   10    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      7   20    4  L  P N             T        Y  202         
         DS    CL8                                                              
RTLDEPTH DS    CL8                                                              
RTLDEPT  DS    CL6      7   28    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7   38    6  L  P N             T        Y  203         
         DS    CL8                                                              
RTLSDPTH DS    CL8                                                              
RTLSDPT  DS    CL6      7   46    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      8    2    6  L  P N             T        Y  204         
         DS    CL8                                                              
RTLPERH  DS    CL8                                                              
RTLPER   DS    CL8      8   10    8  A  U N             T        Y              
RTLNAMEH DS    CL8                                                              
RTLNAME  DS    CL30     8   19   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      8   50    7  L  P N             T        Y              
RTLTASKH DS    CL8                                                              
RTLTASK  DS    CL3      8   58    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      9    9    6  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      9   19    4  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      9   30    6  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      9   42    6  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      9   53    7  L  P H             T        Y              
RTLSELH  DS    CL8                                                              
RTLSEL   DS    CL3     10    2    3  A  U N             T        Y    3         
RTLSELX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  P N             T        Y    3         
         DS    CL8                                                              
RTLTOTLH DS    CL8                                                              
RTLTOTL  DS    CL74    22    7   74  A  P N             T        Y              
RTLPFKYH DS    CL8                                                              
RTLPFKY  DS    CL79    24    2   79  A  P H             T        Y              
RTLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
RTLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1872 BYTES                            
