*          DATA SET ACCLBE4D   AT LEVEL 002 AS OF 12/29/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T621E4D      DATE 12/29/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL13     4    2   13  L  P H             T        Y              
SDFFNOH  DS    CL8                                                              
SDFFNO   DS    CL3      4   22    3  A  U N             T        Y    1         
SDFFNOX  DS    CL8                                                              
SDFFNMH  DS    CL8                                                              
SDFFNM   DS    CL36     4   31   36  L  U N             T        Y              
SDFLNGWH DS    CL8                                                              
SDFLNGW  DS    CL12     5    2   12  L  P H             T        Y              
SDFLNGH  DS    CL8                                                              
SDFLNG   DS    CL13     5   22   13  A  U H             T        Y    2         
SDFLNGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     6    2   14  L  P H             T        Y              
SDFSNOH  DS    CL8                                                              
SDFSNO   DS    CL2      6   22    2  A  U N             T        Y    3         
SDFSNOX  DS    CL8                                                              
SDFSNMH  DS    CL8                                                              
SDFSNM   DS    CL6      6   31    6  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      8    2    6  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   31    4  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      9   31    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    10    2   17  L  P N             T        Y              
SDFALLH  DS    CL8                                                              
SDFALL   DS    CL36    10   31   36  A  U N             T        Y    4         
SDFALLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    11    2   14  L  P N             T        Y              
SDFWCTH  DS    CL8                                                              
SDFWCT   DS    CL36    11   31   36  A  U N             T        Y    5         
SDFWCTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    12    2   14  L  P N             T        Y              
SDFWCGH  DS    CL8                                                              
SDFWCG   DS    CL36    12   31   36  A  U N             T        Y    6         
SDFWCGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     13    2    9  L  P N             T        Y              
SDFWCH   DS    CL8                                                              
SDFWC    DS    CL36    13   31   36  A  U N             T        Y    7         
SDFWCX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    14    2   16  L  P N             T        Y              
SDFTRNH  DS    CL8                                                              
SDFTRN   DS    CL36    14   31   36  A  U N             T        Y    8         
SDFTRNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    15    2   14  L  P N             T        Y              
SDFCACH  DS    CL8                                                              
SDFCAC   DS    CL36    15   31   36  A  U N             T        Y    9         
SDFCACX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    16    2   17  L  P N             T        Y              
SDFSCHH  DS    CL8                                                              
SDFSCH   DS    CL8     16   31    8  A  U N             T        Y   10         
SDFSCHX  DS    CL8                                                              
SDFCATH  DS    CL8                                                              
SDFCAT   DS    CL27    16   40   27  A  U N             T        Y   11         
SDFCATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    19    2   14  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     19   31    4  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    20    2   14  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   31    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL22    21    2   22  L  P N             T        Y              
SDFSECH  DS    CL8                                                              
SDFSEC   DS    CL36    21   31   36  L  U N             T        Y   12         
SDFSECX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL24    22    2   24  L  P N             T        Y              
SDFSUBH  DS    CL8                                                              
SDFSUB   DS    CL36    22   31   36  L  U N             T        Y   13         
SDFSUBX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL79    24    2   79  L  P H             T        Y  255         
         DS    CL8                                                              
SDFLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
SDFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1112 BYTES                            
