*          DATA SET ACCLBF5D   AT LEVEL 004 AS OF 12/31/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T621F5D      DATE 12/31/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      4    2    6  L  P H             T        Y              
EDTBILNH DS    CL8                                                              
EDTBILN  DS    CL6      4   11    6  A  P N             T        Y    1         
EDTBILNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      4   31    4  L  P H             T        Y              
EDTPARAH DS    CL8                                                              
EDTPARA  DS    CL10     4   42   10  A  U N             T        Y    1         
EDTPARAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      4   57    3  L  P H             T        Y              
EDTNETH  DS    CL8                                                              
EDTNET   DS    CL13     4   62   13  A  U N             T        Y    1         
EDTNETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      5    2    4  L  P H             T        Y              
EDTJOBH  DS    CL8                                                              
EDTJOB   DS    CL12     5   11   12  A  P N             T        Y    1         
EDTJOBX  DS    CL8                                                              
EDTLTXTH DS    CL8                                                              
EDTLTXT  DS    CL5      5   31    5  L  P H             T        Y              
EDTLNUMH DS    CL8                                                              
EDTLNUM  DS    CL14     5   42   14  A  P N             T        Y    1         
EDTLNUMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      5   57    4  L  P H             T        Y              
EDTCOMNH DS    CL8                                                              
EDTCOMN  DS    CL13     5   62   13  A  U N             T        Y    1         
EDTCOMNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      6    2    6  L  P H             T        Y              
EDTDESCH DS    CL8                                                              
EDTDESC  DS    CL36     6   11   36  L  U N             T        Y    1         
EDTDESCX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6   57    4  L  P H             T        Y              
EDTTYPEH DS    CL8                                                              
EDTTYPE  DS    CL10     6   62   10  A  U N             T        Y    1         
EDTTYPEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7    2    3  L  P H             T        Y              
EDTBANH  DS    CL8                                                              
EDTBAN   DS    CL69     7    6   69  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      7   76    4  L  P H             T        Y              
EDTLCM1H DS    CL8                                                              
EDTLCM1  DS    CL3      8    2    3  A  U H             T        Y    1         
EDTLCM1X DS    CL8                                                              
EDTTXT1H DS    CL8                                                              
EDTTXT1  DS    CL69     8    6   69  L  U N             T        Y    1         
EDTTXT1X DS    CL8                                                              
EDTLIN1H DS    CL8                                                              
EDTLIN1  DS    CL3      8   77    3  A  P H             T        Y    1         
EDTLIN1X DS    CL8                                                              
EDTLCM2H DS    CL8                                                              
EDTLCM2  DS    CL3      9    2    3  A  U H             T        Y    1         
EDTLCM2X DS    CL8                                                              
EDTTXT2H DS    CL8                                                              
EDTTXT2  DS    CL69     9    6   69  L  U N             T        Y    1         
EDTTXT2X DS    CL8                                                              
EDTLIN2H DS    CL8                                                              
EDTLIN2  DS    CL3      9   77    3  A  P H             T        Y    1         
EDTLIN2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL69    10    6   69  L  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     10   77    3  A  P H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL69    11    6   69  L  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     11   77    3  A  P H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL69    12    6   69  L  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     12   77    3  A  P H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL69    13    6   69  L  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     13   77    3  A  P H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL69    14    6   69  L  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     14   77    3  A  P H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL69    15    6   69  L  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     15   77    3  A  P H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL69    16    6   69  L  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     16   77    3  A  P H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL69    17    6   69  L  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     17   77    3  A  P H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL69    18    6   69  L  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     18   77    3  A  P H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL69    19    6   69  L  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     19   77    3  A  P H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL69    20    6   69  L  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     20   77    3  A  P H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL69    21    6   69  L  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     21   77    3  A  P H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL69    22    6   69  L  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     22   77    3  A  P H             T        Y    1         
         DS    CL8                                                              
EDTLCMLH DS    CL8                                                              
EDTLCML  DS    CL3     23    2    3  A  U H             T        Y    1         
EDTLCMLX DS    CL8                                                              
EDTTXTLH DS    CL8                                                              
EDTTXTL  DS    CL69    23    6   69  L  U N             T        Y    1         
EDTTXTLX DS    CL8                                                              
EDTLINLH DS    CL8                                                              
EDTLINL  DS    CL3     23   77    3  A  P H             T        Y    1         
EDTLINLX DS    CL8                                                              
EDTPFKH  DS    CL8                                                              
EDTPFK   DS    CL78    24    2   78  A  P N             T        Y  255         
EDTPFKX  DS    CL8                                                              
EDTLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
EDTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2512 BYTES                            
