*          DATA SET ACCLBFFD   AT LEVEL 017 AS OF 08/25/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T621FFD      DATE 08/25/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
BASMSGH  DS    CL8                                                              
BASMSG   DS    CL60     1    2   60  L  P H             T        Y              
BASSRVH  DS    CL8                                                              
BASSRV   DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      2    2    8  L  P H             T        Y              
BASACTH  DS    CL8                                                              
BASACT   DS    CL8      2   11    8  A  U N             T    I   Y    0         
BASACTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      2   22    8  L  P N             T        Y              
BASSCRH  DS    CL8                                                              
BASSCR   DS    CL8      2   31    8  A  U H             T        Y    2         
BASSCRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      2   42    8  L  P N             T        Y              
BASREPH  DS    CL8                                                              
BASREP   DS    CL3      2   51    3  A  U H             T        Y    3         
BASREPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      2   62    8  L  P N             T        Y              
BASDSTH  DS    CL8                                                              
BASDST   DS    CL8      2   72    8  A  U H             T        Y    3         
BASDSTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      3    2    8  L  P N             T        Y              
BASOPTH  DS    CL8                                                              
BASOPT   DS    CL69     3   11   69  A  U H             T        Y    4         
BASOPTX  DS    CL8                                                              
BASOLAYH DS    CL8                                                              
BASOLAY  DS    CL1      4    2    1  A  P N             T        Y              
BASPFKH  DS    CL8                                                              
BASPFK   DS    CL78    24    2   78  A  P N             T        Y  255         
BASPFKX  DS    CL8                                                              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 456  BYTES                            
