*          DATA SET ACCLBCLM   AT LEVEL 055 AS OF 03/22/95                      
***********************************************************************         
* COLUMN TABLE                                                        *         
***********************************************************************         
         SPACE 1                                                                
         PUSH  USING                                                            
         USING PRORATAD,R0                                                      
CLMTAB   DS    0X                                                               
         SPACE 1                                                                
***********************************************************************         
* ALLOCATE / WRITE-OFF                                                *         
***********************************************************************         
         SPACE 1                                                                
CLMALC   DC    AL1(CLMALCQ)                                                     
         DC    AL2(CLMALCX+1-CLMALC)                                            
         DC    AL2(CLM#TKY+CLM#PRO+CLM#BIL+CLM#TRN),AL1(0)                      
*                                                                               
         DC    AL1(PRO#NET)        * NET AVAILABLE *                            
         DC    AL1(1,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIAMT+CLMIHEAD,CLMIEOL+CLMIPROR)                           
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(14,14,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PM$ANVBL,PM$FNVBL)                                    
         DC    XL6'00'                                                          
*&&UK*&& DCDDL AC#NETAV,14,L       DCDD FOR HEADING 1                           
*&&UK*&& DCDDL AC#NETAV,14,LU      DCDD FOR HEADING 2                           
*&&US*&& DCDDL AC#NET,14,L         DCDD FOR HEADING 1                           
*&&US*&& DCDDL AC#AVAIL,14,L       DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRO#WTF)        * WRITTEN-OFF *                              
         DC    AL1(2,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIAMT+CLMIHEAD,CLMIPROR)                                   
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(14,14,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PP$AWOFF,PP$FWOFF)                                    
         DC    XL6'00'                                                          
         DCDDL AC#WRTAM,14,L       DCDD FOR HEADING 1                           
         DCDDL AC#WRTAM,14,LU      DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRO#ALC)        * ALLOCATED AMOUNT *                         
         DC    AL1(03,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIAMT+CLMIHEAD,CLMIPROR)                                   
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(14,14,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PP$AALLO,PP$FALLO)                                    
         DC    XL6'00'                                                          
         DCDDL AC#ALCTD,14,L       DCDD FOR HEADING 1                           
         DCDDL AC#ALCTD,14,LU      DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRO#COM)        * COMMISSION *                               
         DC    AL1(04,0,0)         RTN/HELP/SEC                                 
*&&UK*&& DC    AL1(CLMIAMT+CLMIHEAD,CLMIPROR)                                   
*&&US*&& DC    AL1(CLMIPRO+CLMIAMT+CLMIHEAD,CLMIPROR)                           
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(14,14,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PM$ACVBL,PM$FCVBL)                                    
         DC    XL6'00'                                                          
         DCDDL AC#CMN,14,L         DCDD FOR HEADING 1                           
         DCDDL AC#CMN,14,LU        DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRO#HRS)        * HOURS *                                    
         DC    AL1(05,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIAMT,CLMIPROR)                                            
         DC    AL1(7,7,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(7,7,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PM$HRVBL,0)                                           
         DC    XL6'00'                                                          
         DCDDL AC#HOURS,7,L        DCDD FOR HEADING 1                           
         DCDDL AC#HOURS,7,LU       DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(BIL#WOA)        * WRITE-OFF ACCOUNT *                        
         DC    AL1(06,0,0)         RTN/HELP/SEC                                 
         DC    AL1(0,0)            INDS1/INDS2                                  
         DC    AL1(15,15,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(15,15,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL5'00'                                                   
         DC    AL1(BIL@WOA),XL4'00' OVERRIDE DISPLAY ROUTINE                    
         DCDDL AC#WRTFA,15,L       DCDD FOR HEADING 1                           
         DCDDL AC#WRTFA,15,LU      DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(BIL#OFF)        OFFICE CODE                                  
         DC    AL1(07,0,0)         RTN/HELP/SEC                                 
*&&UK*&& DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
*&&US*&& DC    AL1(0,0)            INDS1/INDS2                                  
         DC    AL1(6,2,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(6,2,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL5'00'                                                   
         DC    AL1(BIL@OFF),XL4'00' OVERRIDE DISPLAY ROUTINE                    
         DCDDL AC#OFF,6,L          DCDD FOR HEADING 1                           
         DCDDL AC#OFF,6,LU         DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(BIL#PAR)        * PARAGRAPH CODE *                           
         DC    AL1(08,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(4,3,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(4,3,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL5'00'                                                   
         DC    AL1(BIL@PAR),XL4'00' OVERRIDE DISPLAY ROUTINE                    
         DCDDL AC#PRGRP,4,R        DCDD FOR HEADING 1                           
         DCDDL AC#PRGRP,4,RU       DCDD FOR HEADING 2                           
*                                                                               
CLMALCX  DC    AL1(EOT)                                                         
         SPACE 1                                                                
***********************************************************************         
* FORMAT LIST                                                         *         
***********************************************************************         
         SPACE 1                                                                
CLMLFT   DC    AL1(CLMLFTQ)                                                     
         DC    AL2(CLMLFTX+1-CLMLFT)                                            
         DC    AL1(0,0,0)                                                       
*                                                                               
         DC    C' '                * FORMAT *                                   
         DC    AL1(64,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIKEY+CLMIPRO,0) INDS1/INDS2                               
         DC    AL1(7,7,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#FRMAT,7,L        DCDD FOR HEADING 1                           
         DCDDL AC#FRMAT,7,LU       DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(LFT#GRB)        * GROUPING BASIS *                           
         DC    AL1(65,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(24,24,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#GRPNG,24,L       DCDD FOR HEADING 1                           
         DCDDL AC#GRPNG,24,LU      DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(LFT#NAM)        * NAME *                                     
         DC    AL1(66,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(36,36,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#NAME,36,L        DCDD FOR HEADING 1                           
         DCDDL AC#NAME,36,LU       DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(LFT#01)         * FORMAT OPTION 01 **                        
         DC    AL1(01,0,0)         RTN/HELP/SEC                                 
         DC    AL1(0,CLMIDEFO)     INDS1/INDS2                                  
         DC    AL1(16,01,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#FOP01,32,H       DCDD FOR HEADING 1                           
         DC    XL4'00'             DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(LFT#02)         * FORMAT OPTION 02 **                        
         DC    AL1(02,0,0)         RTN/HELP/SEC                                 
         DC    AL1(0,CLMIDEFO)     INDS1/INDS2                                  
         DC    AL1(16,03,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#FOP02,32,H       DCDD FOR HEADING 1                           
         DC    4X'00'                                                           
*                                                                               
         DC    AL1(LFT#03)         * FORMAT OPTION 03 **                        
         DC    AL1(03,0,0)         RTN/HELP/SEC                                 
         DC    AL1(0,CLMIDEFO)     INDS1/INDS2                                  
         DC    AL1(16,03,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#FOP03,32,H       DCDD FOR HEADING 1                           
         DC    4X'00'                                                           
*                                                                               
         DC    AL1(LFT#04)         * FORMAT OPTION 04 **                        
         DC    AL1(04,0,0)         RTN/HELP/SEC                                 
         DC    AL1(0,CLMIDEFO)     INDS1/INDS2                                  
         DC    AL1(16,10,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#FOP04,32,H       DCDD FOR HEADING 1                           
         DC    4X'00'                                                           
*                                                                               
         DC    AL1(LFT#05)         * FORMAT OPTION 05 **                        
         DC    AL1(05,0,0)         RTN/HELP/SEC                                 
         DC    AL1(0,CLMIDEFO)     INDS1/INDS2                                  
         DC    AL1(16,02,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#FOP05,32,H       DCDD FOR HEADING 1                           
         DC    4X'00'                                                           
*                                                                               
         DC    AL1(LFT#06)         * FORMAT OPTION 06 **                        
         DC    AL1(06,0,0)         RTN/HELP/SEC                                 
         DC    AL1(0,CLMIDEFO)     INDS1/INDS2                                  
         DC    AL1(16,05,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#FOP06,32,H       DCDD FOR HEADING 1                           
         DC    4X'00'                                                           
*                                                                               
         DC    AL1(LFT#07)         * FORMAT OPTION 07 **                        
         DC    AL1(07,0,0)         RTN/HELP/SEC                                 
         DC    AL1(0,CLMIDEFO)     INDS1/INDS2                                  
         DC    AL1(16,05,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#FOP07,32,H       DCDD FOR HEADING 1                           
         DC    4X'00'                                                           
*                                                                               
         DC    AL1(LFT#23)         * FORMAT OPTION 07 **                        
         DC    AL1(23,0,0)         RTN/HELP/SEC                                 
         DC    AL1(0,CLMIDEFO)     INDS1/INDS2                                  
         DC    AL1(16,08,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0,0,0)          MASK                                         
         DC    AL1(CTRYGER)        GERMANY ONLY                                 
         DC    XL5'00'                                                          
         DCDDL AC#FOP23,32,H       DCDD FOR HEADING 1                           
         DC    4X'00'                                                           
*                                                                               
         DC    AL1(LFT#08)         * FORMAT OPTION 08 **                        
         DC    AL1(08,0,0)         RTN/HELP/SEC                                 
         DC    AL1(0,CLMIDEFO)     INDS1/INDS2                                  
         DC    AL1(16,05,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#FOP08,32,H       DCDD FOR HEADING 1                           
         DC    4X'00'                                                           
*                                                                               
         DC    AL1(LFT#09)         * FORMAT OPTION 09 **                        
         DC    AL1(09,0,0)         RTN/HELP/SEC                                 
         DC    AL1(0,CLMIDEFO)     INDS1/INDS2                                  
         DC    AL1(16,08,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#FOP09,32,H       DCDD FOR HEADING 1                           
         DC    4X'00'                                                           
*                                                                               
         DC    AL1(LFT#10)         * FORMAT OPTION 10 **                        
         DC    AL1(10,0,0)         RTN/HELP/SEC                                 
         DC    AL1(0,CLMIDEFO)     INDS1/INDS2                                  
         DC    AL1(16,05,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#FOP10,32,H       DCDD FOR HEADING 1                           
         DC    4X'00'                                                           
*                                                                               
         DC    AL1(LFT#11)         * FORMAT OPTION 11 **                        
         DC    AL1(11,0,0)         RTN/HELP/SEC                                 
         DC    AL1(0,CLMIDEFO)     INDS1/INDS2                                  
         DC    AL1(16,05,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#FOP11,32,H                                                    
         DC    4X'00'                                                           
*                                                                               
         DC    AL1(LFT#12)         * FORMAT OPTION 12 **                        
         DC    AL1(12,0,0)         RTN/HELP/SEC                                 
         DC    AL1(0,CLMIDEFO)     INDS1/INDS2                                  
         DC    AL1(16,05,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#FOP12,32,H                                                    
         DC    4X'00'                                                           
*                                                                               
         DC    AL1(LFT#18)         * FORMAT OPTION 18 **                        
         DC    AL1(18,0,0)         RTN/HELP/SEC                                 
         DC    AL1(0,CLMIDEFO)     INDS1/INDS2                                  
         DC    AL1(16,05,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#FOP18,32,H       DCDD FOR HEADING 1                           
         DC    4X'00'                                                           
*                                                                               
         DC    AL1(LFT#19)         * FORMAT OPTION 19 **                        
         DC    AL1(19,0,0)         RTN/HELP/SEC                                 
         DC    AL1(0,CLMIDEFO)     INDS1/INDS2                                  
         DC    AL1(16,05,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#FOP19,32,H       DCDD FOR HEADING 1                           
         DC    4X'00'                                                           
*                                                                               
         DC    AL1(LFT#22)         * FORMAT OPTION 22 **                        
         DC    AL1(22,0,0)         RTN/HELP/SEC                                 
         DC    AL1(0,CLMIDEFO)     INDS1/INDS2                                  
         DC    AL1(16,05,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#FOP22,32,H       DCDD FOR HEADING 1                           
         DC    4X'00'                                                           
*                                                                               
         DC    AL1(LFT#13)         * FORMAT OPTION 13 **                        
         DC    AL1(13,0,0)         RTN/HELP/SEC                                 
         DC    AL1(0,CLMIDEFO)     INDS1/INDS2                                  
         DC    AL1(20,20,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#FOP13,40,H       DCDD FOR HEADING 1                           
         DC    4X'00'                                                           
*                                                                               
         DC    AL1(LFT#14)         * FORMAT OPTION 14 **                        
         DC    AL1(14,0,0)         RTN/HELP/SEC                                 
         DC    AL1(0,CLMIDEFO)     INDS1/INDS2                                  
         DC    AL1(20,20,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#FOP14,40,H       DCDD FOR HEADING 1                           
         DC    4X'00'                                                           
*                                                                               
         DC    AL1(LFT#15)         * FORMAT OPTION 15 **                        
         DC    AL1(15,0,0)         RTN/HELP/SEC                                 
         DC    AL1(0,CLMIDEFO)     INDS1/INDS2                                  
         DC    AL1(20,20,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#FOP15,40,H       DCDD FOR HEADING 1                           
         DC    4X'00'                                                           
*                                                                               
         DC    AL1(LFT#16)         * FORMAT OPTION 16 **                        
         DC    AL1(16,0,0)         RTN/HELP/SEC                                 
         DC    AL1(0,CLMIDEFO)     INDS1/INDS2                                  
         DC    AL1(20,20,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#FOP16,40,H       DCDD FOR HEADING 1                           
         DC    4X'00'                                                           
*                                                                               
         DC    AL1(LFT#17)         * FORMAT OPTION 17 **                        
         DC    AL1(17,0,0)         RTN/HELP/SEC                                 
         DC    AL1(0,CLMIDEFO)     INDS1/INDS2                                  
         DC    AL1(20,20,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#FOP17,40,H       DCDD FOR HEADING 1                           
         DC    4X'00'                                                           
*                                                                               
         DC    AL1(LFT#20)         * FORMAT OPTION 20 **                        
         DC    AL1(20,0,0)         RTN/HELP/SEC                                 
         DC    AL1(0,CLMIDEFO)     INDS1/INDS2                                  
         DC    AL1(20,20,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#FOP20,40,H       DCDD FOR HEADING 1                           
         DC    4X'00'                                                           
*                                                                               
         DC    AL1(LFT#21)         * FORMAT OPTION 21 **                        
         DC    AL1(21,0,0)         RTN/HELP/SEC                                 
         DC    AL1(0,CLMIDEFO)     INDS1/INDS2                                  
         DC    AL1(20,20,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#FOP21,40,H       DCDD FOR HEADING 1                           
         DC    4X'00'                                                           
*                                                                               
CLMLFTX  DC    AL1(EOT)                                                         
         SPACE 1                                                                
***********************************************************************         
* BILL LIST                                                           *         
***********************************************************************         
         SPACE 1                                                                
CLMLST   DC    AL1(CLMLSTQ)                                                     
         DC    AL2(CLMLSTX+1-CLMLST)                                            
         DC    AL1(0,0,0)                                                       
*                                                                               
         DC    C' '                * KEY *                                      
         DC    AL1(0,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIKEY+CLMIPRO+CLMIHEAD,0)                                  
         DC    AL1(19,19,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DC    4X'00'              DCDD FOR HEADING 1                           
         DC    4X'00'              DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(LST#BIL)        * DATE BILLED *                              
         DC    AL1(1,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(8,8,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#BLD,8,L          DCDD FOR HEADING 1                           
         DCDDL AC#BLD,8,LU         DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(LST#NET)        * NET *                                      
         DC    AL1(2,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(13,13,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#NET,12,R         DCDD FOR HEADING 1                           
         DCDDL AC#NET,12,RU        DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(LST#COM)        * COMMISSION *                               
         DC    AL1(3,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(13,13,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#CMN,12,R         DCDD FOR HEADING 1                           
         DCDDL AC#CMN,12,RU        DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(LST#CRT)        * DATE CREATED *                             
         DC    AL1(4,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(8,8,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#CRTD,8,L         DCDD FOR HEADING 1                           
         DCDDL AC#CRTD,8,LU        DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(LST#EXP)        * DATE EXPIRES *                             
         DC    AL1(5,0,0)          RTN/HELP/SEC                                 
         DC    AL1(0,0)            INDS1/INDS2                                  
         DC    AL1(8,8,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#EXPIR,8,L        DCDD FOR HEADING 1                           
         DCDDL AC#EXPIR,8,LU       DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(LST#CUR)        * CURRENCY *                                 
         DC    AL1(6,0,0)          RTN/HELP/SEC                                 
         DC    AL1(0,0)            INDS1/INDS2                                  
         DC    AL1(3,3,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#CURRY,3,L        DCDD FOR HEADING 1                           
         DC    X'00'                                                            
         DCDDL AC#CURRY,3,LU       DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(LST#FMT)        * FORMAT *                                   
         DC    AL1(7,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(6,3,2)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#FRMAT,6,R        DCDD FOR HEADING 1                           
         DCDDL AC#FRMAT,6,RU       DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(LST#LPR)        * DATE/TIME LAST PRINTED *                   
         DC    AL1(8,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(22,22,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#LSTPR,17,L       DCDD FOR HEADING 1                           
         DCDDL AC#LSTPR,17,LU      DCDD FOR HEADING 2                           
*                                                                               
CLMLSTX  DC    AL1(EOT)                                                         
         SPACE 1                                                                
***********************************************************************         
* PREVBILL LIST                                                       *         
***********************************************************************         
         SPACE 1                                                                
CLMPRB   DC    AL1(CLMPRBQ)                                                     
         DC    AL2(CLMPRBX+1-CLMPRB)                                            
         DC    AL1(0,0,0)                                                       
*                                                                               
         DC    C' '                * BILL NUMBER *                              
         DC    AL1(0,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIKEY+CLMIPRO,0)                                           
         DC    AL1(6,6,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#BILC,6,L         DCDD FOR HEADING 1                           
         DCDDL AC#BILC,6,LU        DCDD FOR HEADING 2                           
*                                                                               
         DC    C' '                * DATE *                                     
         DC    AL1(1,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIKEY+CLMIPRO,0) INDS1/INDS2                               
         DC    AL1(8,8,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#DATE,8,L         DCDD FOR HEADING 1                           
         DCDDL AC#DATE,8,LU        DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRB#NET)        * NET *                                      
         DC    AL1(2,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(13,13,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#NET,12,R         DCDD FOR HEADING 1                           
         DCDDL AC#NET,12,RU        DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRB#COM)        * COMMISSION *                               
         DC    AL1(3,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(13,13,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#CMN,12,R         DCDD FOR HEADING 1                           
         DCDDL AC#CMN,12,RU        DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRB#CUR)        * CURRENCY *                                 
         DC    AL1(4,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(3,3,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#CURRY,3,L        DCDD FOR HEADING 1                           
         DC    X'00'                                                            
         DCDDL AC#CURRY,3,LU       DCDD FOR HEADING 2                           
*                                                                               
CLMPRBX  DC    AL1(EOT)                                                         
         SPACE 1                                                                
***********************************************************************         
* REVALUE LIST                                                        *         
***********************************************************************         
         SPACE 1                                                                
CLMRVL   DC    AL1(CLMRVLQ)                                                     
         DC    AL2(CLMRVLX+1-CLMRVL)                                            
         DC    AL1(0,0,0)                                                       
*                                                                               
         DC    C' '                * WORKCODE *                                 
         DC    AL1(0,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIKEY+CLMIPRO,0) INDS1/INDS2                               
         DC    AL1(2,2,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(2,2,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#WC,2,L           DCDD FOR HEADING 1                           
         DC    XL1'00'                                                          
         DCDDL AC#WC,2,LU          DCDD FOR HEADING 2                           
*                                                                               
         DC    C' '                * SUPPLIER (CONTRA) *                        
         DC    AL1(1,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIKEY+CLMIPRO,0) INDS1/INDS2                               
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(14,14,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
*&&UK*&& DCDDL AC#SUP,14,L         DCDD FOR HEADING 1                           
*&&UK*&& DCDDL AC#SUP,14,LU        DCDD FOR HEADING 2                           
*&&US*&& DCDDL AC#CTR,14,L         DCDD FOR HEADING 1                           
*&&US*&& DCDDL AC#CTR,14,LU        DCDD FOR HEADING 2                           
*                                                                               
         DC    C' '                * REFERENCE *                                
         DC    AL1(2,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIKEY+CLMIPRO,0) INDS1/INDS2                               
         DC    AL1(6,6,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(6,6,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#REF,6,L          DCDD FOR HEADING 1                           
         DCDDL AC#REF,6,LU         DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(RVL#CUR)        * CURRENCY *                                 
         DC    AL1(3,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(3,3,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#CURRY,3,L        DCDD FOR HEADING 1                           
         DC    X'00'                                                            
         DCDDL AC#CURRY,3,LU       DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(RVL#CAMT)       * CURRENCY AMOUNT *                          
         DC    AL1(4,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)                                                   
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#CURRY,13,R       DCDD FOR HEADING 1                           
         DCDDL AC#AMT,13,R         DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(RVL#NRAT)       * NEW RATE *                                 
         DC    AL1(5,0,0)          RTN/HELP/SEC                                 
         DC    AL1(0,CLMIEOP+CLMIEOL+CLMIDEFO)                                  
         DC    AL1(12,12,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#NEWRT,12,L       DCDD FOR HEADING 1                           
         DCDDL AC#NEWRT,12,LU      DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(RVL#NAMT)       * NEW AMOUNT *                               
         DC    AL1(6,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMIHEAD+CLMISCR,0)                                  
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#NEWAM,13,R       DCDD FOR HEADING 1                           
         DCDDL AC#NEWAM,13,RU      DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(RVL#ORAT)       * OLD RATE *                                 
         DC    AL1(7,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(11,11,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#OLDRT,11,C       DCDD FOR HEADING 1                           
         DCDDL AC#OLDRT,11,CU      DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(RVL#OAMT)       * OLD AMOUNT *                               
         DC    AL1(8,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMIHEAD,0)                                          
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#OLDAM,13,R       DCDD FOR HEADING 1                           
         DCDDL AC#OLDAM,13,RU      DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(RVL#EXD)        * EXCHANGE DIFFERENCE *                      
         DC    AL1(9,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMIHEAD+CLMISCR,0)                                  
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#EXDIF,13,R       DCDD FOR HEADING 1                           
         DCDDL AC#EXDIF,13,RU      DCDD FOR HEADING 2                           
*                                                                               
CLMRVLX  DC    AL1(EOT)                                                         
         SPACE 1                                                                
***********************************************************************         
* MATCH 1 LIST                                                        *         
***********************************************************************         
         SPACE 1                                                                
CLMMT1   DC    AL1(CLMMT1Q)                                                     
         DC    AL2(CLMMT1X+1-CLMMT1)                                            
         DC    AL1(0,0,0)                                                       
*                                                                               
         DC    C' '                * WORKCODE *                                 
         DC    AL1(0,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIKEY+CLMIPRO,0) INDS1/INDS2                               
         DC    AL1(2,2,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(2,2,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#WC,2,L           DCDD FOR HEADING 1                           
         DC    XL1'00'                                                          
         DCDDL AC#WC,2,LU          DCDD FOR HEADING 2                           
*                                                                               
         DC    C' '                * SUPPLIER (CONTRA) *                        
         DC    AL1(1,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIKEY+CLMIPRO,0) INDS1/INDS2                               
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(14,14,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
*&&UK*&& DCDDL AC#SUP,14,L         DCDD FOR HEADING 1                           
*&&UK*&& DCDDL AC#SUP,14,LU        DCDD FOR HEADING 2                           
*&&US*&& DCDDL AC#CTR,14,L         DCDD FOR HEADING 1                           
*&&US*&& DCDDL AC#CTR,14,LU        DCDD FOR HEADING 2                           
*                                                                               
         DC    C' '                * REFERENCE *                                
         DC    AL1(2,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIKEY+CLMIPRO,0) INDS1/INDS2                               
         DC    AL1(6,6,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(6,6,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#REF,6,L          DCDD FOR HEADING 1                           
         DCDDL AC#REF,6,LU         DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(MT1#BIL)        * BILL NUMBER *                              
         DC    AL1(3,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(6,6,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#BILC,6,L         DCDD FOR HEADING 1                           
         DCDDL AC#BILC,6,LU        DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(MT1#CUR)        * CURRENCY *                                 
         DC    AL1(4,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(3,3,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#CURRY,3,L        DCDD FOR HEADING 1                           
         DC    X'00'                                                            
         DCDDL AC#CURRY,3,LU       DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(MT1#NET)        * NET *                                      
         DC    AL1(5,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#NET,13,R         DCDD FOR HEADING 1                           
         DCDDL AC#NET,13,RU        DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(MT1#COM)        * COMMISSION *                               
         DC    AL1(6,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#CMN,13,R         DCDD FOR HEADING 1                           
         DCDDL AC#CMN,13,RU        DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(MT1#EXC)        * EXCHANGE RATE *                            
         DC    AL1(7,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(10,10,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#EXCHR,10,L       DCDD FOR HEADING 1                           
         DCDDL AC#EXCHR,10,LU      DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(MT1#NETA)       * NET (AGENCY CURRENCY) *                    
         DC    AL1(8,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMIHEAD,0)                                          
         DC    AL1(14,14,0)        HEAD WIDTH/FI LD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#NET,13,R         DCDD FOR HEADING 1                           
         DCDDL AC#NET,13,RU        DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(MT1#COMA)       * COMMISSION (AGENCY CURRENCY) *             
         DC    AL1(9,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMIHEAD,0)                                          
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#CMN,13,R         DCDD FOR HEADING 1                           
         DCDDL AC#CMN,13,RU        DCDD FOR HEADING 2                           
*                                                                               
CLMMT1X  DC    AL1(EOT)                                                         
         SPACE 1                                                                
***********************************************************************         
* MATCH 2 LIST (INVOICE)                                              *         
***********************************************************************         
         SPACE 1                                                                
CLMMT2   DC    AL1(CLMMT2Q)                                                     
         DC    AL2(CLMMT2X+1-CLMMT2)                                            
         DC    AL1(0,0,0)                                                       
*                                                                               
         DC    C' '                * WORKCODE *                                 
         DC    AL1(0,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIKEY+CLMIPRO+CLMISCR,0)                                   
         DC    AL1(2,2,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(2,2,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#WC,2,L           DCDD FOR HEADING 1                           
         DC    XL1'00'                                                          
         DCDDL AC#WC,2,LU          DCDD FOR HEADING 2                           
*                                                                               
         DC    C' '                * SUPPLIER (CONTRA) *                        
         DC    AL1(1,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIKEY+CLMIPRO+CLMISCR,0)                                   
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(14,14,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
*&&UK*&& DCDDL AC#SUP,14,L         DCDD FOR HEADING 1                           
*&&UK*&& DCDDL AC#SUP,14,LU        DCDD FOR HEADING 2                           
*&&US*&& DCDDL AC#CTR,14,L         DCDD FOR HEADING 1                           
*&&US*&& DCDDL AC#CTR,14,LU        DCDD FOR HEADING 2                           
*                                                                               
         DC    C' '                * REFERENCE *                                
         DC    AL1(2,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIKEY+CLMIPRO+CLMISCR,0)                                   
         DC    AL1(6,6,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(6,6,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#REF,6,L          DCDD FOR HEADING 1                           
         DCDDL AC#REF,6,LU         DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(MT2#NMB)        * NET MATCHED (BILL CURRENCY) *              
         DC    AL1(3,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMISCR+CLMIHEAD,CLMIDEFO)                                   
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#NETMT,14,L       DCDD FOR HEADING 1                           
         DCDDL AC#NETMT,14,LU      DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(MT2#NAB)        * NET AVAILABLE (BILL CURRENCY) *            
         DC    AL1(4,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMIHEAD,0)                                          
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#NETAV,13,R       DCDD FOR HEADING 1                           
         DCDDL AC#NETAV,13,RU      DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(MT2#CMB)        * COMMISSION MATCHED (BILL) *                
         DC    AL1(5,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMISCR+CLMIHEAD,CLMIDEFO)                                   
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#CMNMT,14,L       DCDD FOR HEADING 1                           
         DCDDL AC#CMNMT,14,LU      DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(MT2#NMA)        * NET MATCHED (AGENCY CURRENCY) *            
         DC    AL1(6,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMISCR+CLMIHEAD,0)                                  
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(CSMMAC),XL10'00' MASK                                        
         DCDDL AC#NETMT,13,R       DCDD FOR HEADING 1                           
         DCDDL AC#NETMT,13,RU      DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(MT2#NAA)        * NET AVAILAVLE (AGENCY CURRENCY) *          
         DC    AL1(7,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMIHEAD,0)                                          
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(CSMMAC),XL10'00' MASK                                        
         DCDDL AC#NETAV,13,R       DCDD FOR HEADING 1                           
         DCDDL AC#NETAV,13,RU      DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(MT2#CMA)        * COMMISSION MATCHED (AGENCY) *              
         DC    AL1(8,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMISCR+CLMIHEAD,0)                                          
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(CSMMAC),XL10'00' MASK                                        
         DCDDL AC#CMNMT,13,R       DCDD FOR HEADING 1                           
         DCDDL AC#CMNMT,13,RU      DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(MT2#COMR)       * COMMISSION RATE *                          
         DC    AL1(9,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(7,7,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(7,7,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#CMN,7,C          DCDD FOR HEADING 1                           
         DCDDL AC#RATE,7,C         DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(MT2#MEXC)       * MATCH EXCHANGE RATE *                      
         DC    AL1(10,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(11,11,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(CSMMAC),XL10'00' MASK                                        
         DCDDL AC#MCH,11,C         DCDD FOR HEADING 1                           
         DCDDL AC#EXCHR,11,C       DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(MT2#IEXC)       * INVIOCE EXCHANGE RATE *                    
         DC    AL1(11,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(11,11,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(CSMMAC),XL10'00' MASK                                        
         DCDDL AC#INV,11,C         DCDD FOR HEADING 1                           
         DCDDL AC#EXCHR,11,C       DCDD FOR HEADING 2                           
*                                                                               
CLMMT2X  DC    AL1(EOT)                                                         
         SPACE 1                                                                
***********************************************************************         
* AUTO ALLOCATION LIST                                                *         
***********************************************************************         
         SPACE 1                                                                
CLMAALC  DC    AL1(CLMAALCQ)                                                    
         DC    AL2(CLMAALCX+1-CLMAALC)                                          
         DC    AL1(0,0,0)                                                       
*                                                                               
         DC    C' '                * JOB CODE *                                 
         DC    AL1(0,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIKEY+CLMIPRO,0) INDS1/INDS2                               
         DC    AL1(12,12,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(12,12,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#JOB,3,L          DCDD FOR HEADING 1                           
         DC    X'00'                                                            
         DCDDL AC#JOB,3,LU         DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(AAL#JBN)        * JOB NAME *                                 
         DC    AL1(1,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(20,20,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#JOBN,8,L         DCDD FOR HEADING 1                           
         DCDDL AC#JOBN,8,LU        DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(AAL#UNA)        * NET AVAILABLE *                            
         DC    AL1(2,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMISCR,0)  INDS1/INDS2                              
         DC    AL1(13,13,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#NET,12,R         DCDD FOR HEADING 1                           
         DCDDL AC#AVAIL,12,R       DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(AAL#ANT)        * ALLOCATED NET *                            
         DC    AL1(3,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMISCR,0)  INDS1/INDS2                              
         DC    AL1(13,13,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#ALCTD,12,R       DCDD FOR HEADING 1                           
         DCDDL AC#NET,12,R         DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(AAL#ACO)        * ALLOCATED COMMISSION *                     
         DC    AL1(4,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMISCR,0)  INDS1/INDS2                              
         DC    AL1(13,13,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#ALCTD,12,R       DCDD FOR HEADING 1                           
         DCDDL AC#CMN,12,R         DCDD FOR HEADING 2                           
*                                                                               
*&&UK                                                                           
         DC    AL1(AAL#EXR)        * EXCHANGE RATE *                            
         DC    AL1(5,0,0)          RTN/HELP/SEC                                 
         DC    AL1(0,0)            INDS1/INDS2                                  
         DC    AL1(10,10,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#EXCHR,10,L       DCDD FOR HEADING 1                           
         DCDDL AC#EXCHR,10,LU      DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(AAL#GRP)        * GROUP *                                    
         DC    AL1(6,0,0)          RTN/HELP/SEC                                 
         DC    AL1(0,0)            INDS1/INDS2                                  
         DC    AL1(6,6,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#GROUP,6,R        DCDD FOR HEADING 1                           
         DCDDL AC#GROUP,6,RU       DCDD FOR HEADING 2                           
*&&                                                                             
*                                                                               
CLMAALCX DC    AL1(EOT)                                                         
         SPACE 1                                                                
***********************************************************************         
* SUMMARY SCREEN                                                      *         
***********************************************************************         
         SPACE 1                                                                
CLMSUMM  DC    AL1(CLMSUMMQ)                                                    
         DC    AL2(CLMSUMMX+1-CLMSUMM)                                          
         DC    AL1(0,0,0)                                                       
*                                  ORIGINAL ESTIMATE GROSS                      
         DC    AL1(SUM#OEG)        CHARACTER CODE                               
         DC    AL1(20,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIENQ+CLMIPRO,0)      INDS1/INDS2                          
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(8,8,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#ORGLE,13,L       DCDD FOR HEADING 1                           
         DCDDL AC#GROSS,6,L        DCDD FOR HEADING 2                           
*                                  ORIGINAL ESTIMATE NET                        
         DC    AL1(SUM#OEN)        CHARACTER CODE                               
         DC    AL1(21,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIENQ+CLMIPRO,0)      INDS1/INDS2                          
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(8,8,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#ORGLE,13,L       DCDD FOR HEADING 1                           
         DCDDL AC#NET,6,L          DCDD FOR HEADING 2                           
*                                  CURRENT ESTIMATE GROSS                       
         DC    AL1(SUM#CEG)        CHARACTER CODE                               
         DC    AL1(22,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIENQ+CLMIPRO,0)      INDS1/INDS2                          
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(8,8,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#CEST,13,L        DCDD FOR HEADING 1                           
         DCDDL AC#GROSS,6,L        DCDD FOR HEADING 2                           
*                                  CURRENT ESTIMATE NET                         
         DC    AL1(SUM#CEN)        CHARACTER CODE                               
         DC    AL1(23,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIENQ+CLMIPRO,0)      INDS1/INDS2                          
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(8,8,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#CEST,13,L        DCDD FOR HEADING 1                           
         DCDDL AC#NET,6,L          DCDD FOR HEADING 2                           
*                                  CHARGES                                      
         DC    AL1(SUM#CHA)        CHARACTER CODE                               
         DC    AL1(24,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIENQ+CLMIPRO,0)      INDS1/INDS2                          
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(8,8,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#CHGS,7,L         DCDD FOR HEADING 1                           
         DCDDL AC#CHGS,7,LU        DCDD FOR HEADING 2                           
*                                  ORDERS                                       
         DC    AL1(SUM#ODS)        CHARACTER CODE                               
         DC    AL1(25,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIENQ+CLMIPRO,0)      INDS1/INDS2                          
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(8,8,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#ORDS,6,L         DCDD FOR HEADING 1                           
         DCDDL AC#ORDS,6,LU        DCDD FOR HEADING 2                           
*                                  BILLED GROSS (TOTAL BILLING)                 
         DC    AL1(SUM#BIG)        CHARACTER CODE                               
         DC    AL1(26,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIENQ+CLMIPRO,0)      INDS1/INDS2                          
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(8,8,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#TBLNG,13,L       DCDD FOR HEADING 1                           
         DCDDL AC#TBLNG,13,LU      DCDD FOR HEADING 2                           
*                                  BILLED NET (PRIOR BILLS)                     
         DC    AL1(SUM#BIN)        CHARACTER CODE                               
         DC    AL1(27,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIENQ+CLMIPRO,0)      INDS1/INDS2                          
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(8,8,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#PRBIL,11,L       DCDD FOR HEADING 1                           
         DCDDL AC#PRBIL,11,LU      DCDD FOR HEADING 2                           
*                                  ALLOCATED COMMISSION                         
         DC    AL1(SUM#ACO)        CHARACTER CODE                               
         DC    AL1(28,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIENQ+CLMIPRO,0)      INDS1/INDS2                          
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(8,8,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#ALCTD,9,L        DCDD FOR HEADING 1                           
         DCDDL AC#CMN,10,L         DCDD FOR HEADING 2                           
*                                  ALLOCATED NET                                
         DC    AL1(SUM#ANT)        CHARACTER CODE                               
         DC    AL1(29,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIENQ+CLMIPRO,0)      INDS1/INDS2                          
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(8,8,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#ALCTD,9,L        DCDD FOR HEADING 1                           
         DCDDL AC#NET,6,L          DCDD FOR HEADING 2                           
*                                  UNBILLED GROSS                               
         DC    AL1(SUM#UNG)        CHARACTER CODE                               
         DC    AL1(30,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIENQ+CLMIPRO,0)      INDS1/INDS2                          
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(8,8,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#UBLD,8,L         DCDD FOR HEADING 1                           
         DCDDL AC#GROSS,6,L        DCDD FOR HEADING 2                           
*                                  UNBILLED NET (UNBILLED)                      
         DC    AL1(SUM#UNN)        CHARACTER CODE                               
         DC    AL1(31,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIENQ+CLMIPRO,0)      INDS1/INDS2                          
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(8,8,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#UBLD,8,L         DCDD FOR HEADING 1                           
         DCDDL AC#NET,6,L          DCDD FOR HEADING 2                           
*                                  BILLED COMMISSION                            
         DC    AL1(SUM#BIC)        CHARACTER CODE                               
         DC    AL1(32,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIENQ+CLMIPRO,0)      INDS1/INDS2                          
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(8,8,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#BLD,6,L          DCDD FOR HEADING 1                           
         DCDDL AC#CMN,10,L         DCDD FOR HEADING 2                           
*                                  UNBILLED COMMISSION                          
         DC    AL1(SUM#UNC)        CHARACTER CODE                               
         DC    AL1(33,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIENQ+CLMIPRO,0)      INDS1/INDS2                          
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(8,8,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#UBLD,8,L         DCDD FOR HEADING 1                           
         DCDDL AC#CMN,10,L         DCDD FOR HEADING 2                           
*                                  INCOME VARIANCE                              
         DC    AL1(SUM#IVA)        CHARACTER CODE                               
         DC    AL1(34,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIENQ+CLMIPRO,0)      INDS1/INDS2                          
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(8,8,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#INCM,6,L         DCDD FOR HEADING 1                           
         DCDDL AC#VAR,8,L          DCDD FOR HEADING 2                           
*                                  % INCOME VARIANCE                            
         DC    AL1(SUM#IVP)        CHARACTER CODE                               
         DC    AL1(35,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIENQ+CLMIPRO,0)      INDS1/INDS2                          
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(8,8,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#INCPC,8,L        DCDD FOR HEADING 1                           
         DCDDL AC#VAR,8,L          DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(SUM#UWO)        CHARACTER CODE                               
         DC    AL1(36,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIENQ+CLMIPRO,0)      INDS1/INDS2                          
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(8,8,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#UPDTD,7,L        DCDD FOR HEADING 1                           
         DCDDL AC#WRTFS,10,L       DCDD FOR HEADING 2                           
*                                                                               
CLMSUMMX DC    AL1(EOT)                                                         
         SPACE 1                                                                
***********************************************************************         
* TRANSFER LIST                                                       *         
***********************************************************************         
         SPACE 1                                                                
CLMXFR   DC    AL1(CLMXFRQ)                                                     
         DC    AL2(CLMXFRX+1-CLMXFR)                                            
         DC    AL2(CLM#PRO+CLM#BIL+CLM#TRN),AL1(0)                              
*                                                                               
         DC    AL1(TKY#WC)         * WORK-CODE *                                
         DC    AL1(TKY@WC,0,0)     RTN/HELP/SEC                                 
         DC    AL1(CLMIKEY+CLMIPRO,0) INDS1/INDS2                               
         DC    AL1(2,2,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(2,2,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#WC,2,L           DCDD FOR HEADING 1                           
         DC    XL1'00'                                                          
         DCDDL AC#WC,2,LU          DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(TKY#CTA)        * CONTRA-ACCOUNT (SUPPLIER) *                
         DC    AL1(TKY@CTA,0,0)    RTN/HELP/SEC                                 
         DC    AL1(CLMIKEY+CLMIPRO,0) INDS1/INDS2                               
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(14,14,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
*&&UK*&& DCDDL AC#SUP,14,L         DCDD FOR HEADING 1                           
*&&UK*&& DCDDL AC#SUP,14,LU        DCDD FOR HEADING 2                           
*&&US*&& DCDDL AC#CTR,14,L         DCDD FOR HEADING 1                           
*&&US*&& DCDDL AC#CTR,14,LU        DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(TKY#REF)        * REFERENCE *                                
         DC    AL1(TKY@REF,0,0)    RTN/HELP/SEC                                 
         DC    AL1(CLMIKEY+CLMIPRO,0) INDS1/INDS2                               
         DC    AL1(6,6,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(6,6,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#REF,6,L          DCDD FOR HEADING 1                           
         DCDDL AC#REF,6,LU         DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(BIL#CST)        * COMMISSIONABLE STATUS *                    
         DC    AL1(BIL@CST,0,0)    RTN/HELP/SEC                                 
         DC    AL1(CLMIKEY+CLMIPRO,0) INDS1/INDS2                               
         DC    AL1(1,1,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(1,1,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#CMNBL,2,L        DCDD FOR HEADING 1                           
         DC    XL1'00'                                                          
         DCDDL AC#CMNBL,2,LU       DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRO#NET)        * NET AVAILABLE *                            
         DC    AL1(1,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIKEY+CLMIAMT+CLMIHEAD+CLMITOT+CLMIPRO,CLMIPROR)           
         DC    AL1(11,11,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(11,11,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PM$ANVBL,PM$FNVBL)                                    
         DC    XL6'00'                                                          
         DCDDL AC#NET,11,L         DCDD FOR HEADING 1                           
         DCDDL AC#AVAIL,11,L       DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRO#XAMT)       * TRANSFER AMOUNT *                          
         DC    AL1(2,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIKEY+CLMIAMT+CLMIHEAD+CLMITOT,CLMIEOL+CLMIPROR)           
         DC    AL1(11,11,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(11,11,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PP$AXFER,PP$FXFER)                                    
         DC    XL6'00'                                                          
         DCDDL AC#XFR,11,L         DCDD FOR HEADING 1                           
         DCDDL AC#AMT,11,L         DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(XFR#TFT)        * TRANSFER TO WORKCODE/JOB *                 
         DC    AL1(3,0,0)          RTN/HELP/SEC                                 
         DC    AL1(0,0)            INDS1/INDS2                                  
         DC    AL1(15,15,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(15,15,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#XFERT,15,L       DCDD FOR HEADING 1                           
         DCDDL AC#XFERT,15,LU      DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(XFR#OVR)        * OVERRIDE COMMN/SKACCOUNT *                 
         DC    AL1(4,0,0)          RTN/HELP/SEC                                 
         DC    AL1(0,0)            INDS1/INDS2                                  
         DC    AL1(15,15,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(15,15,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#XFERD,15,L       DCDD FOR HEADING 1                           
         DCDDL AC#XFERD,15,LU      DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRO#HRS)        * HOURS AVAILABLE *                          
         DC    AL1(5,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIAMT+CLMITOT+CLMIPRO,CLMIPROR)                            
         DC    AL1(7,7,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(7,7,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PM$HRVBL,PM$HRVBL)                                    
         DC    XL6'00'                                                          
         DCDDL AC#HOURS,7,L        DCDD FOR HEADING 1                           
         DCDDL AC#HOURS,7,LU       DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRO#COM)        * COMMISSION AVAILABLE *                     
         DC    AL1(6,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIAMT+CLMITOT+CLMIPRO,CLMIPROR)                            
         DC    AL1(11,11,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(11,11,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PM$ACVBL,PM$FCVBL)                                    
         DC    XL6'00'                                                          
         DCDDL AC#CMN,11,L         DCDD FOR HEADING 1                           
         DCDDL AC#AVAIL,11,L       DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(XFR#CMNX)       * COMMISSION TRANSFERRED *                   
         DC    AL1(07,0,0)         RTN/HELP/SEC                                 
         DC    AL1(CLMIAMT+CLMITOT+CLMIPRO,0)  INDS1/INDS2                      
         DC    AL1(11,11,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(11,11,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#CMN,11,L         DCDD FOR HEADING 1                           
         DCDDL AC#XFRD,11,L        DCDD FOR HEADING 2                           
*                                                                               
CLMXFRX  DC    AL1(EOT)                                                         
         SPACE 1                                                                
***********************************************************************         
* WRITE-OFF RECOVERY LIST                                             *         
***********************************************************************         
         SPACE 1                                                                
CLMRCVR  DC    AL1(CLMRCVRQ)                                                    
         DC    AL2(CLMRCVRX+1-CLMRCVR)                                          
         DC    AL2(CLM#TKY+CLM#PRO+CLM#BIL+CLM#TRN),AL1(0)                      
*                                                                               
         DC    AL1(PRO#HRS)        * HOURS PENDING RECOVERY *                   
         DC    AL1(0,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMIAMT,CLMIPROR)                                    
         DC    AL1(8,8,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(8,8,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PP$HRSR,0)                                            
         DC    XL6'00'                                                          
         DCDDL AC#PENDG,8,L        DCDD FOR HEADING 1                           
         DCDDL AC#HOURS,8,L        DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(RCV#NWO)        * NUMBER OF WRITE OFFS *                     
         DC    AL1(1,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(3,3,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(3,3,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#NUM,3,L          DCDD FOR HEADING 1                           
         DC    X'00'                                                            
         DCDDL AC#WRTF,3,L         DCDD FOR HEADING 2                           
         DC    X'00'                                                            
*                                                                               
CLMRCVRX DC    AL1(EOT)                                                         
         SPACE 1                                                                
***********************************************************************         
* REVERSE LIST                                                        *         
***********************************************************************         
         SPACE 1                                                                
CLMREV   DC    AL1(CLMREVQ)                                                     
         DC    AL2(CLMREVX+1-CLMREV)                                            
         DC    AL2(CLM#TKY+CLM#PRO+CLM#BIL+CLM#TRN),AL1(0)                      
*                                                                               
         DC    AL1(PRO#NET)        * NET AVAILABLE *                            
         DC    AL1(1,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMIAMT+CLMIHEAD,CLMIEOL+CLMIPROR)                   
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(14,14,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PM$ANVBL,PM$FNVBL)                                    
         DC    XL6'00'                                                          
*&&UK*&& DCDDL AC#NETAV,14,L       DCDD FOR HEADING 1                           
*&&UK*&& DCDDL AC#NETAV,14,LU      DCDD FOR HEADING 2                           
*&&US*&& DCDDL AC#NET,14,L         DCDD FOR HEADING 1                           
*&&US*&& DCDDL AC#AVAIL,14,L       DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRO#ALC)        * ALLOCATED AMOUNT *                         
         DC    AL1(2,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMIAMT+CLMIHEAD,CLMIPROR)                           
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(14,14,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PP$AALLO,PP$FALLO)                                    
         DC    XL6'00'                                                          
         DCDDL AC#ALCTD,14,L       DCDD FOR HEADING 1                           
         DCDDL AC#ALCTD,14,LU      DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRO#COM)        * COMMISSION *                               
         DC    AL1(3,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMIAMT+CLMIHEAD,CLMIPROR)                           
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(14,14,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PM$ACVBL,PM$FCVBL)                                    
         DC    XL6'00'                                                          
         DCDDL AC#CMN,14,L         DCDD FOR HEADING 1                           
         DCDDL AC#CMN,14,LU        DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRO#HRS)        * HOURS *                                    
         DC    AL1(4,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMIAMT,CLMIPROR)                                    
         DC    AL1(7,7,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(7,7,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PM$HRVBL,0)                                           
         DC    XL6'00'                                                          
         DCDDL AC#HOURS,7,L        DCDD FOR HEADING 1                           
         DCDDL AC#HOURS,7,LU       DCDD FOR HEADING 2                           
*                                                                               
CLMREVX  DC    AL1(EOT)                                                         
         SPACE 1                                                                
***********************************************************************         
* FEE ADJUSTMENT LIST                                                 *         
***********************************************************************         
         SPACE 1                                                                
CLMFLI   DC    AL1(CLMFLIQ)                                                     
         DC    AL2(CLMFLIX+1-CLMFLI)                                            
         DC    AL2(CLM#TKY+CLM#BIL+CLM#TRN),AL1(0)                              
*                                                                               
         DC    AL1(PRO#NET)        * NET AMOUNT *                               
         DC    AL1(1,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIAMT+CLMIHEAD,CLMIPROR)                                   
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(14,14,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PA$NET,PA$NET)                                        
         DC    XL6'00'                                                          
         DCDDL AC#NET,14,L       DCDD FOR HEADING 1                             
         DCDDL AC#NET,14,LU      DCDD FOR HEADING 2                             
*                                                                               
         DC    AL1(BIL#CST)        * COMMISSIONABLE STATUS *                    
         DC    AL1(2,0,0)          RTN/HELP/SEC                                 
         DC    AL1(0,0)            INDS1/INDS2                                  
         DC    AL1(5,5,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,1)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(5,5,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#CMN,5,L          DCDD FOR HEADING 1                           
         DCDDL AC#CMN,5,LU         DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRO#ALC)        * ALLOCATED STATUS *                         
         DC    AL1(3,0,0)          RTN/HELP/SEC                                 
         DC    AL1(0,0)            INDS1/INDS2                                  
         DC    AL1(5,5,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,1)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(5,5,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#ALCTD,5,L        DCDD FOR HEADING 1                           
         DCDDL AC#ALCTD,5,LU       DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(BIL#OFF)        * OFFICE CODE *                              
         DC    AL1(4,0,0)          RTN/HELP/SEC                                 
         DC    AL1(0,0)            INDS1/INDS2                                  
         DC    AL1(6,2,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,0,0,0)        HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(6,2,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#OFF,6,L          DCDD FOR HEADING 1                           
         DCDDL AC#OFF,6,LU         DCDD FOR HEADING 2                           
*                                                                               
CLMFLIX  DC    AL1(EOT)                                                         
*                                                                               
CLMTABX  DC    AL1(EOT)                                                         
         SPACE 1                                                                
***********************************************************************         
* COLUMNS AVAILABLE TO ALL LISTS                                      *         
***********************************************************************         
         SPACE 1                                                                
CLMGEN   DS    0X                                                               
         SPACE 1                                                                
***********************************************************************         
* TRANSACTION LIST KEY COLUMNS                                        *         
***********************************************************************         
         SPACE 1                                                                
CLMTKY   DC    AL1(CLMGENQ)        ** GENERAL TRANSACTION COLUMNS **            
         DC    AL2(CLMTKYX+1-CLMTKY)                                            
         DC    AL2(CLM#TKY),AL1(0)                                              
*                                                                               
         DC    AL1(TKY#WC)         * WORKCODE *                                 
         DC    AL1(TKY@WC,0,0)     RTN/HELP/SEC                                 
         DC    AL1(CLMIKEY+CLMIPRO,0) INDS1/INDS2                               
         DC    AL1(2,2,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(2,2,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#WC,2,L           DCDD FOR HEADING 1                           
         DC    XL1'00'                                                          
         DCDDL AC#WC,2,LU          DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(TKY#CTA)        * CONTR-ACCOUNT (SUPPLIER) *                 
         DC    AL1(TKY@CTA,0,0)    RTN/HELP/SEC                                 
         DC    AL1(CLMIKEY+CLMIPRO,0) INDS1/INDS2                               
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(14,14,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
*&&UK*&& DCDDL AC#SUP,14,L         DCDD FOR HEADING 1                           
*&&UK*&& DCDDL AC#SUP,14,LU        DCDD FOR HEADING 2                           
*&&US*&& DCDDL AC#CTR,14,L         DCDD FOR HEADING 1                           
*&&US*&& DCDDL AC#CTR,14,LU        DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(TKY#REF)        * REFERENCE *                                
         DC    AL1(TKY@REF,0,0)    RTN/HELP/SEC                                 
         DC    AL1(CLMIKEY+CLMIPRO,0) INDS1/INDS2                               
         DC    AL1(6,6,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(6,6,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#REF,6,L          DCDD FOR HEADING 1                           
         DCDDL AC#REF,6,LU         DCDD FOR HEADING 2                           
*                                                                               
CLMTKYX  DC    AL1(EOT)                                                         
         SPACE 1                                                                
***********************************************************************         
* PRO-RATA AMOUNT COLUMNS                                             *         
***********************************************************************         
         SPACE 1                                                                
CLMPRO   DC    AL1(CLMGENQ)                                                     
         DC    AL2(CLMPROX+1-CLMPRO)                                            
         DC    AL2(CLM#PRO),AL1(0)                                              
*                                                                               
         DC    AL1(PRO#NET)        * NET AVAILABLE *                            
         DC    AL1(0,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMIAMT+CLMIHEAD,CLMIEOL+CLMIPROR)                   
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(14,14,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PM$ANVBL,PM$FNVBL)                                    
         DC    XL6'00'                                                          
*&&UK*&& DCDDL AC#NETAV,14,L       DCDD FOR HEADING 1                           
*&&UK*&& DCDDL AC#NETAV,14,LU      DCDD FOR HEADING 2                           
*&&US*&& DCDDL AC#NET,14,L         DCDD FOR HEADING 1                           
*&&US*&& DCDDL AC#AVAIL,14,L       DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRO#WTF)        * WRITTEN-OFF *                              
         DC    AL1(0,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMIAMT+CLMIHEAD,CLMIPROR)                           
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(14,14,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PP$AWOFF,PP$FWOFF)                                    
         DC    XL6'00'                                                          
         DCDDL AC#WRTAM,14,L       DCDD FOR HEADING 1                           
         DCDDL AC#WRTAM,14,LU      DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRO#ALC)        * ALLOCATED AMOUNT *                         
         DC    AL1(0,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMIAMT+CLMIHEAD,CLMIPROR)                           
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(14,14,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PP$AALLO,PP$FALLO)                                    
         DC    XL6'00'                                                          
         DCDDL AC#ALCTD,14,L       DCDD FOR HEADING 1                           
         DCDDL AC#ALCTD,14,LU      DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRO#COM)        * COMMISSION *                               
         DC    AL1(0,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIAMT+CLMIPRO+CLMIHEAD,CLMIPROR)                           
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(14,14,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PM$ACVBL,PM$FCVBL)                                    
         DC    XL6'00'                                                          
         DCDDL AC#CMN,14,L         DCDD FOR HEADING 1                           
         DCDDL AC#CMN,14,LU        DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRO#HRS)        * HOURS *                                    
         DC    AL1(0,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMIAMT,CLMIPROR)                                    
         DC    AL1(7,7,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(7,7,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PM$HRVBL,0)                                           
         DC    XL6'00'                                                          
         DCDDL AC#HOURS,7,L        DCDD FOR HEADING 1                           
         DCDDL AC#HOURS,7,LU       DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRO#BLD)        * BILLED AMOUNT *                            
         DC    AL1(0,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIAMT+CLMIPRO+CLMIHEAD,CLMIPROR)                           
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(14,14,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PA$NETBL,PB$NETBL)                                    
         DC    XL6'00'                                                          
         DCDDL AC#BLDN,14,L        DCDD FOR HEADING 1                           
         DCDDL AC#BLDN,14,LU       DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRO#DSC)        * CASH DISCOUNT *                            
         DC    AL1(0,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,CLMIPROR)                                            
         DC    AL1(9,9,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(9,9,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PA$DSC,PA$DSC)                                        
         DC    XL6'00'                                                          
         DCDDL AC#CASH,9,C         DCDD FOR HEADING 1                           
         DCDDL AC#DISS,9,C         DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRO#ACM)        * ALLOCATED COMMISSION *                     
         DC    AL1(0,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIAMT+CLMIPRO+CLMIHEAD,CLMIPROR)                           
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(14,14,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PP$ACOMM,PP$FCOMM)                                    
         DC    XL6'00'                                                          
         DCDDL AC#ALCOM,14,L       DCDD FOR HEADING 1                           
         DCDDL AC#ALCOM,14,LU      DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRO#AHR)        * ALLOCATED HOURS *                          
         DC    AL1(0,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIAMT+CLMIPRO,CLMIPROR)                                    
         DC    AL1(7,7,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(7,7,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PP$HRSB,0)                                            
         DC    XL6'00'                                                          
         DCDDL AC#ALCTD,7,L        DCDD FOR HEADING 1                           
         DCDDL AC#HOURS,7,L        DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRO#BCM)        * COMMISSION BILLED *                        
         DC    AL1(0,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIAMT+CLMIPRO+CLMIHEAD,CLMIPROR)                           
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(14,14,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PA$COMBL,PB$COMBL)                                    
         DC    XL6'00'                                                          
         DCDDL AC#BLCOM,14,L       DCDD FOR HEADING 1                           
         DCDDL AC#BLCOM,14,LU      DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRO#BHR)        * HOURS BILLED *                             
         DC    AL1(0,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIAMT+CLMIPRO,CLMIPROR)                                    
         DC    AL1(7,7,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(7,7,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PA$HRSB,0)                                            
         DC    XL6'00'                                                          
         DCDDL AC#HOURS,7,L        DCDD FOR HEADING 1                           
         DCDDL AC#BLD,7,L          DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRO#PRCV)       * PENDING RECOVERY AMOUNT *                  
         DC    AL1(0,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMIAMT+CLMIHEAD+CLMITOT,CLMIPROR)                   
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(14,14,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PP$AWOFR,PP$FWOFR)                                    
         DC    XL6'00'                                                          
         DCDDL AC#PENDG,14,L       DCDD FOR HEADING 1                           
         DCDDL AC#RCVR,14,L        DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(PRO#UWO)        * UPDATED WRITE-OFFS *                       
         DC    AL1(0,0,0)          RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMIAMT+CLMIHEAD+CLMITOT,CLMIPROR)                   
         DC    AL1(14,14,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(14,14,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),SL2(PA$WOFAM,PA$WOFAM)  ?? PB$WOFAM ??                    
         DC    XL6'00'                                                          
         DCDDL AC#UPDWO,14,L       DCDD FOR HEADING 1                           
         DCDDL AC#UPDWO,14,LU      DCDD FOR HEADING 2                           
*                                                                               
CLMPROX  DC    AL1(EOT)                                                         
         SPACE 1                                                                
***********************************************************************         
* GENERAL TRANSACTION BILLING COLUMNS                                 *         
***********************************************************************         
         SPACE 1                                                                
CLMBIL   DC    AL1(CLMGENQ)                                                     
         DC    AL2(CLMBILX+1-CLMBIL)                                            
         DC    AL2(CLM#BIL),AL1(0)                                              
*                                                                               
         DC    AL1(BIL#STA)        * STATUS *                                   
         DC    AL1(BIL@STA,0,0)    RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(4,4,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(4,4,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#STT,4,L          DCDD FOR HEADING 1                           
         DCDDL AC#STT,4,LU         DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(BIL#CMR)        * COMMISSION RATE *                          
         DC    AL1(BIL@CMR,0,0)    RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)                                                   
         DC    AL1(7,7,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(7,7,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#CMN,7,C          DCDD FOR HEADING 1                           
         DCDDL AC#RATE,7,C         DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(BIL#WOA)        * WRITE-OFF ACCOUNT *                        
         DC    AL1(BIL@WOA,0,0)    RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)                                                   
         DC    AL1(15,15,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(15,15,0)        NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#WRTFA,15,L       DCDD FOR HEADING 1                           
         DCDDL AC#WRTFA,15,LU      DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(BIL#OFF)        * OFFICE CODE *                              
         DC    AL1(BIL@OFF,0,0)    RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(6,2,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(6,2,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#OFF,6,L          DCDD FOR HEADING 1                           
         DCDDL AC#OFF,6,LU         DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(BIL#PAR)        * PARAGRAPH CODE *                           
         DC    AL1(BIL@PAR,0,0)    RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(4,3,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,0)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(4,3,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#PRGRP,4,R        DCDD FOR HEADING 1                           
         DCDDL AC#PRGRP,4,RU       DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(BIL#CST)        * COMMISSIONABLE STATUS *                    
         DC    AL1(BIL@CST,0,0)    RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(1,1,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(1,1,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#CMNBL,2,L        DCDD FOR HEADING 1                           
         DC    XL1'00'                                                          
         DCDDL AC#CMNBL,2,LU       DCDD FOR HEADING 2                           
*                                                                               
CLMBILX  DC    AL1(EOT)                                                         
         SPACE 1                                                                
***********************************************************************         
* GENERAL TRANSACTION COLUMNS                                         *         
***********************************************************************         
         SPACE 1                                                                
CLMTRN   DC    AL1(CLMGENQ)        ** GENERAL TRANSACTION COLUMNS **            
         DC    AL2(CLMTRNX+1-CLMTRN)                                            
         DC    AL2(CLM#TRN),AL1(0)                                              
*                                                                               
         DC    AL1(TRN#DAT)        * TRANSACTION DATE *                         
         DC    AL1(TRN@DAT,0,0)    RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(8,8,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(8,8,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#DATE,8,L         DCDD FOR HEADING 1                           
         DCDDL AC#DATE,8,LU        DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(TRN#MOA)        * MONTH OF ACTIVITY *                        
         DC    AL1(TRN@MOA,0,0)    RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(5,5,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(5,5,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#MOA,5,L          DCDD FOR HEADING 1                           
         DCDDL AC#MOA,5,LU         DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(TRN#BRF)        * BATCH REFERENCE *                          
         DC    AL1(TRN@BRF,0,0)    RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(4,4,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(4,4,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#BATRF,4,L        DCDD FOR HEADING 1                           
         DCDDL AC#BATRF,4,LU       DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(TRN#INP)        * INPUT TYPE *                               
         DC    AL1(TRN@INP,0,0)    RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(3,3,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(3,3,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#INPTY,3,L        DCDD FOR HEADING 1                           
         DC    X'00'                                                            
         DCDDL AC#INPTY,3,LU       DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(TRN#ORD)        * ORDER NUMBER *                             
         DC    AL1(TRN@ORD,0,0)    RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(6,6,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(6,6,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#ORDC,6,L         DCDD FOR HEADING 1                           
         DCDDL AC#ORDC,6,LU        DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(TRN#SBR)        * SUBREF *                                   
         DC    AL1(TRN@SBR,0,0)    RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(9,9,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(9,9,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#SUBR,9,L         DCDD FOR HEADING 1                           
         DCDDL AC#SUBR,9,LU        DCDD FOR HEADING 2                           
*                                                                               
         DC    AL1(TRN#CTN)        * CONTRA ACCOUNT NAME *                      
         DC    AL1(TRN@CTN,0,0)    RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO,0)      INDS1/INDS2                                  
         DC    AL1(36,36,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(0,0,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DCDDL AC#CTRAN,36,L       DCDD FOR HEADING 1                           
         DCDDL AC#CTRAN,36,LU      DCDD FOR HEADING 2                           
*                                                                               
CLMTRNX  DC    AL1(EOT)                                                         
         SPACE 1                                                                
***********************************************************************         
* GENERAL TRANSACTION BILLING COLUMNS (DDS ONLY)                      *         
***********************************************************************         
         SPACE 1                                                                
CLMBIL2  DC    AL1(CLMGENQ)                                                     
         DC    AL2(CLMBIL2X+1-CLMBIL2)                                          
         DC    AL2(CLM#BIL),AL1(0)                                              
*                                                                               
         DC    AL1(BIL#PTA)        * PTA RECORD DISK ADDRESS *                  
         DC    AL1(BIL@PTA,0,0)    RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMIDDS+CLMIHEAD,0)                                  
         DC    AL1(8,8,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(8,8,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DC    XL4'00'                                                          
         DC    XL4'00'                                                          
*                                                                               
         DC    AL1(BIL#DTA)        * TSAR RECORD DATA *                         
         DC    AL1(BIL@DTA,0,0)    RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMIDDS+CLMIHEAD,0)                                  
         DC    AL1(6,6,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(6,6,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DC    XL4'00'                                                          
         DC    XL4'00'                                                          
*                                                                               
CLMBIL2X DC    AL1(EOT)                                                         
         SPACE 1                                                                
***********************************************************************         
* COLUMNS AVAILABLE TO ALL LISTS                                      *         
***********************************************************************         
         SPACE 1                                                                
CLMALL   DC    AL1(CLMGENQ)        ** ALL LISTS  **                             
         DC    AL2(CLMALLX+1-CLMALL)                                            
         DC    AL2(0),AL1(0)                                                    
*                                                                               
         DC    AL1(ALL#DA)         * DISK ADDRESS *                             
         DC    AL1(ALL@DA,0,0)     RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMIDDS+CLMITOT+CLMIHEAD+CLMISCR,0)                  
         DC    AL1(8,8,0)          HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(8,8,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DC    XL4'00'                                                          
         DC    XL4'00'                                                          
*                                                                               
         DC    AL1(ALL#TSR)        * TSAR RECORD INFO *                         
         DC    AL1(ALL@TSR,0,0)    RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMIDDS+CLMITOT+CLMIHEAD+CLMISCR,0)                  
         DC    AL1(20,20,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(4,4,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DC    XL4'00'                                                          
         DC    XL4'00'                                                          
*                                                                               
         DC    AL1(ALL#KEY)        * TSAR RECORD KEY *                          
         DC    AL1(ALL@KEY,0,0)    RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMIDDS+CLMITOT+CLMIHEAD+CLMISCR,0)                  
         DC    AL1(36,36,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(4,4,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DC    XL4'00'                                                          
         DC    XL4'00'                                                          
*                                                                               
         DC    AL1(ALL#DTA)        * TSAR RECORD DATA *                         
         DC    AL1(ALL@DTA,0,0)    RTN/HELP/SEC                                 
         DC    AL1(CLMIPRO+CLMIDDS+CLMITOT+CLMIHEAD+CLMISCR,0)                  
         DC    AL1(34,34,0)        HEAD WIDTH/FIELD WIDTH/DISP(FIELD)           
         DC    AL1(0,FHATLC,0,1)   HEAD FHXT/FIELD FHAT/FIELD FHXT/MINL         
         DC    AL1(4,4,0)          NARROW H/WIDTH F/WIDTH F/DISP                
         DC    AL2(0),XL10'00'     MASK                                         
         DC    XL4'00'                                                          
         DC    XL4'00'                                                          
*                                                                               
CLMALLX  DC    AL1(EOT)                                                         
*                                                                               
CLMGENX  DC    AL1(EOT)                                                         
         POP   USING                                                            
