*          DATA SET ACCLBF6D   AT LEVEL 013 AS OF 06/08/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T621F6D      DATE 06/08/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL24    10    2   24  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL22    10   27   22  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    10   50   30  L  P H             T        Y              
REGUPD1H DS    CL8                                                              
REGUPD1  DS    CL79    11    2   79  L  P N             T        Y              
REGUPD2H DS    CL8                                                              
REGUPD2  DS    CL79    12    2   79  L  P N             T        Y              
REGUPD3H DS    CL8                                                              
REGUPD3  DS    CL79    13    2   79  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    15   18   14  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL14    15   34   14  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL7     15   50    7  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL3     15   60    3  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL15    15   66   15  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL15    16    2   15  L  P H             T        Y              
REGAVNTH DS    CL8                                                              
REGAVNT  DS    CL14    16   18   14  A  P N             T        Y              
REGAVCMH DS    CL8                                                              
REGAVCM  DS    CL14    16   34   14  A  P N             T        Y              
REGAVHRH DS    CL8                                                              
REGAVHR  DS    CL7     16   50    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    17    2   15  L  P H             T        Y              
REGALNTH DS    CL8                                                              
REGALNT  DS    CL14    17   18   14  A  U H             T        Y              
REGALCMH DS    CL8                                                              
REGALCM  DS    CL14    17   34   14  A  P N             T        Y              
REGALHRH DS    CL8                                                              
REGALHR  DS    CL7     17   50    7  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL15    18    2   15  L  P H             T        Y              
REGWONTH DS    CL8                                                              
REGWONT  DS    CL14    18   18   14  A  U H             T        Y              
REGWOHRH DS    CL8                                                              
REGWOHR  DS    CL7     18   50    7  A  U H             T        Y              
REGWOACH DS    CL8                                                              
REGWOAC  DS    CL15    18   66   15  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL15    19    2   15  L  P H             T        Y              
REGXFNTH DS    CL8                                                              
REGXFNT  DS    CL14    19   18   14  A  U H             T        Y              
REGXFHRH DS    CL8                                                              
REGXFHR  DS    CL7     19   50    7  A  U H             T        Y              
REGXFWCH DS    CL8                                                              
REGXFWC  DS    CL2     19   60    2  A  U H             T        Y              
REGXFACH DS    CL8                                                              
REGXFAC  DS    CL12    19   66   12  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL15    20   18   15  L  P H             T        Y              
REGXFCMH DS    CL8                                                              
REGXFCM  DS    CL4     20   34    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL15    20   50   15  L  P H             T        Y              
REGXFSKH DS    CL8                                                              
REGXFSK  DS    CL12    20   66   12  A  U H             T        Y              
REGNARWH DS    CL8                                                              
REGNARW  DS    CL15    22    2   15  L  P H             T        Y              
REGNAR1H DS    CL8                                                              
REGNAR1  DS    CL49    22   18   49  A  U N             T        Y              
REGNAR2H DS    CL8                                                              
REGNAR2  DS    CL49    23   18   49  A  U N             T        Y              
REGPFKH  DS    CL8                                                              
REGPFK   DS    CL79    24    2   79  A  P N             T        Y  255         
REGPFKX  DS    CL8                                                              
REGLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
REGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1104 BYTES                            
