*          DATA SET ACCLBF7D   AT LEVEL 011 AS OF 06/29/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T621F7D      DATE 06/29/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      4    2    8  L  P H             T        Y              
BASJOBCH DS    CL8                                                              
BASJOBC  DS    CL12     4   11   12  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      4   42    8  L  P H             T        Y              
BASBILLH DS    CL8                                                              
BASBILL  DS    CL6      4   51    6  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5    2    8  L  P N             T        Y              
BASREFH  DS    CL8                                                              
BASREF   DS    CL4      5   11    4  A  U H             T        Y    2         
BASREFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      5   22    8  L  P N             T        Y              
BASMONH  DS    CL8                                                              
BASMON   DS    CL5      5   31    5  A  U H             T        Y    3         
BASMONX  DS    CL8                                                              
BASLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
BASWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 144  BYTES                            
