*          DATA SET ACCLBEED   AT LEVEL 003 AS OF 12/29/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T621EED      DATE 12/29/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      5    2    8  L  P N             T        Y              
BASREFH  DS    CL8                                                              
BASREF   DS    CL4      5   11    4  A  U H             T        Y    1         
BASREFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      5   22    8  L  P N             T        Y              
BASMONH  DS    CL8                                                              
BASMON   DS    CL5      5   31    5  A  U H             T        Y    2         
BASMONX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19     5   42   19  L  P N             T        Y              
BASINCH  DS    CL8                                                              
BASINC   DS    CL15     5   62   15  A  U H             T        Y    3         
BASINCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6    2    1  A  P N             T        Y              
BASLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
BASWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 144  BYTES                            
