*          DATA SET ACCLBE6D   AT LEVEL 001 AS OF 08/30/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T621E6D      DATE 08/30/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      4    2    8  L  P H             T        Y              
BASCLIH  DS    CL8                                                              
BASCLI   DS    CL5      4   11    5  A  U N             T        Y    1         
BASCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      4   22    8  L  P H             T        Y              
BASPROH  DS    CL8                                                              
BASPRO   DS    CL7      4   31    7  A  U N             T        Y    2         
BASPROX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      4   42    8  L  P H             T        Y              
BASJOBH  DS    CL8                                                              
BASJOB   DS    CL21     4   51   21  A  U N             T        Y    3         
BASJOBX  DS    CL8                                                              
BASLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
BASWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 136  BYTES                            
