*          DATA SET ACCLBEAD   AT LEVEL 002 AS OF 06/29/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T621EAD      DATE 06/29/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      4    2    8  L  P H             T        Y              
COLACTH  DS    CL8                                                              
COLACT   DS    CL8      4   11    8  A  U H             T        Y              
COLLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
COLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 40   BYTES                            
