*          DATA SET ACCLBF3BD  AT LEVEL 004 AS OF 12/22/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T621F3D      DATE 12/22/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
CONFMTWH DS    CL8                                                              
CONFMTW  DS    CL19     4    2   19  L  P H             T        Y              
CONFMTH  DS    CL8                                                              
CONFMT   DS    CL3      4   22    3  A  U H             T        Y    1         
CONFMTX  DS    CL8                                                              
CONNAMWH DS    CL8                                                              
CONNAMW  DS    CL10     4   31   10  L  P N             T        Y              
CONNAMH  DS    CL8                                                              
CONNAM   DS    CL36     4   42   36  L  U N             T        Y    2         
CONNAMX  DS    CL8                                                              
CONLNGWH DS    CL8                                                              
CONLNGW  DS    CL12     5    2   12  L  P H             T        Y              
CONLNGH  DS    CL8                                                              
CONLNG   DS    CL13     5   22   13  A  U H             T        Y    3         
CONLNGX  DS    CL8                                                              
CONDUMH  DS    CL8                                                              
CONDUM   DS    CL1      6    2    1  A  P H             T        Y    4         
CONDUMX  DS    CL8                                                              
CONLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
CONWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 192  BYTES                            
