*          DATA SET ACCLBF8D   AT LEVEL 011 AS OF 06/08/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T621F8D      DATE 06/08/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL22    10    2   22  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL24    10   25   24  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    10   50   30  L  P H             T        Y              
WOFUPD1H DS    CL8                                                              
WOFUPD1  DS    CL79    11    2   79  L  P N             T        Y              
WOFUPD2H DS    CL8                                                              
WOFUPD2  DS    CL79    12    2   79  L  P N             T        Y              
WOFUPD3H DS    CL8                                                              
WOFUPD3  DS    CL79    13    2   79  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    15    2   15  L  P N             T        Y              
WOFAVNTH DS    CL8                                                              
WOFAVNT  DS    CL14    15   18   14  A  P N             T        Y              
WOFAVHRH DS    CL8                                                              
WOFAVHR  DS    CL7     15   41    7  A  P N             T        Y              
WOFSEQWH DS    CL8                                                              
WOFSEQW  DS    CL6     15   50    6  L  P N             T        Y              
WOFSEQH  DS    CL8                                                              
WOFSEQ   DS    CL4     15   57    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    16    2   15  L  P H             T        Y              
WOFNETH  DS    CL8                                                              
WOFNET   DS    CL14    16   18   14  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     16   34    6  L  P H             T        Y              
WOFHRSH  DS    CL8                                                              
WOFHRS   DS    CL7     16   41    7  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     16   50    6  L  P H             T        Y              
WOFREFH  DS    CL8                                                              
WOFREF   DS    CL6     16   57    6  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6     16   66    6  L  P H             T        Y              
WOFDATH  DS    CL8                                                              
WOFDAT   DS    CL8     16   73    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL15    17    2   15  L  P H             T        Y              
WOFEXPCH DS    CL8                                                              
WOFEXPC  DS    CL15    17   18   15  A  U H             T        Y              
WOFEXPNH DS    CL8                                                              
WOFEXPN  DS    CL36    17   34   36  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    18    2   15  L  P H             T        Y              
WOFDPTCH DS    CL8                                                              
WOFDPTC  DS    CL12    18   18   12  A  U H             T        Y              
WOFDPTNH DS    CL8                                                              
WOFDPTN  DS    CL36    18   34   36  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    19    2   15  L  P H             T        Y              
WOFSTFCH DS    CL8                                                              
WOFSTFC  DS    CL12    19   18   12  A  U H             T        Y              
WOFSTFNH DS    CL8                                                              
WOFSTFN  DS    CL36    19   34   36  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    20    2   15  L  P H             T        Y              
WOFWOACH DS    CL8                                                              
WOFWOAC  DS    CL15    20   18   15  A  U H             T        Y              
WOFWOANH DS    CL8                                                              
WOFWOAN  DS    CL36    20   34   36  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    21    2   15  L  P H             T        Y              
WOFOFFCH DS    CL8                                                              
WOFOFFC  DS    CL2     21   18    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL15    21   34   15  L  P H             T        Y              
WOFANALH DS    CL8                                                              
WOFANAL  DS    CL2     21   50    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL15    22    2   15  L  P H             T        Y              
WOFNAR1H DS    CL8                                                              
WOFNAR1  DS    CL49    22   18   49  A  U N             T        Y              
WOFNAR2H DS    CL8                                                              
WOFNAR2  DS    CL49    23   18   49  A  U N             T        Y              
WOFPFKH  DS    CL8                                                              
WOFPFK   DS    CL79    24    2   79  A  P N             T        Y  255         
WOFPFKX  DS    CL8                                                              
WOFLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
WOFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1240 BYTES                            
