*          DATA SET ACCLBFDBD  AT LEVEL 008 AS OF 12/22/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T621FDD      DATE 12/22/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL19     4    2   19  L  P H             T        Y              
USCCLIH  DS    CL8                                                              
USCCLI   DS    CL57     4   22   57  A  U N             T    I   Y    1         
USCCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19     5    2   19  L  P H             T        Y              
USCPROH  DS    CL8                                                              
USCPRO   DS    CL57     5   22   57  A  U N             T        Y    2         
USCPROX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19     6    2   19  L  P H             T        Y              
USCJOBH  DS    CL8                                                              
USCJOB   DS    CL57     6   22   57  A  U N             T        Y    3         
USCJOBX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19     7    2   19  L  P N             T        Y              
USCBLDTH DS    CL8                                                              
USCBLDT  DS    CL17     7   22   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19     8    2   19  L  P N             T        Y              
USCBLDFH DS    CL8                                                              
USCBLDF  DS    CL6      8   22    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19     8   42   19  L  P N             T        Y              
USCBLLVH DS    CL8                                                              
USCBLLV  DS    CL6      8   62    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19     9    2   19  L  P N             T        Y              
USCBLDDH DS    CL8                                                              
USCBLDD  DS    CL8      9   22    8  A  U N             T        Y              
USCLANPH DS    CL8                                                              
USCLANP  DS    CL19     9   42   19  L  P N             T        Y              
USCLANGH DS    CL8                                                              
USCLANG  DS    CL19     9   62   19  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    10    2   19  L  P N             T        Y              
USCBLBRH DS    CL8                                                              
USCBLBR  DS    CL4     10   22    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    10   42   19  L  P N             T        Y              
USCBLMOH DS    CL8                                                              
USCBLMO  DS    CL6     10   62    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    11    2   19  L  P N             T        Y              
USCWOBRH DS    CL8                                                              
USCWOBR  DS    CL4     11   22    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    11   42   19  L  P N             T        Y              
USCWOMOH DS    CL8                                                              
USCWOMO  DS    CL6     11   62    6  A  U N             T        Y              
USCRVBHH DS    CL8                                                              
USCRVBH  DS    CL19    12    2   19  L  P N             T        Y              
USCRVBRH DS    CL8                                                              
USCRVBR  DS    CL4     12   22    4  A  U N             T        Y              
USCRVMHH DS    CL8                                                              
USCRVMH  DS    CL19    12   42   19  L  P N             T        Y              
USCRVMOH DS    CL8                                                              
USCRVMO  DS    CL6     12   62    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    13    2   19  L  P N             T        Y              
USCXFBRH DS    CL8                                                              
USCXFBR  DS    CL4     13   22    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    13   42   19  L  P N             T        Y              
USCXFMOH DS    CL8                                                              
USCXFMO  DS    CL6     13   62    6  A  U N             T        Y              
USCINBHH DS    CL8                                                              
USCINBH  DS    CL19    14    2   19  L  P N             T        Y              
USCINBRH DS    CL8                                                              
USCINBR  DS    CL4     14   22    4  A  U N             T        Y              
USCINMHH DS    CL8                                                              
USCINMH  DS    CL19    14   42   19  L  P N             T        Y              
USCINMOH DS    CL8                                                              
USCINMO  DS    CL6     14   62    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    15    2   19  L  P H             T        Y              
USCDEBH  DS    CL8                                                              
USCDEB   DS    CL15    15   22   15  A  U N             T        Y              
USCDEBNH DS    CL8                                                              
USCDEBN  DS    CL36    15   42   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL19    16    2   19  L  P N             T        Y              
USCSRCAH DS    CL8                                                              
USCSRCA  DS    CL10    16   22   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    17    2   19  L  P N             T        Y              
USCSRCH  DS    CL8                                                              
USCSRC   DS    CL14    17   22   14  A  U N             T        Y              
USCSRCNH DS    CL8                                                              
USCSRCN  DS    CL36    17   42   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL19    18    2   19  L  P N             T        Y              
USCDSCAH DS    CL8                                                              
USCDSCA  DS    CL10    18   22   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    19    2   19  L  P N             T        Y              
USCDSCH  DS    CL8                                                              
USCDSC   DS    CL14    19   22   14  A  U N             T        Y              
USCDSCNH DS    CL8                                                              
USCDSCN  DS    CL36    19   42   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL19    20    2   19  L  P N             T        Y              
USCACCH  DS    CL8                                                              
USCACC   DS    CL14    20   22   14  A  U N             T        Y              
USCACCNH DS    CL8                                                              
USCACCN  DS    CL36    20   42   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL19    21    2   19  L  P N             T        Y              
USCACC1H DS    CL8                                                              
USCACC1  DS    CL13    21   22   13  A  U N             T        Y              
USCACC2H DS    CL8                                                              
USCACC2  DS    CL13    21   36   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    21   50   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    21   64   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    22   22   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    22   36   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    22   50   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    22   64   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    23   22   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    23   36   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    23   50   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    23   64   13  A  U N             T        Y              
USCPFKH  DS    CL8                                                              
USCPFK   DS    CL78    24    2   78  A  P N             T        Y  255         
USCPFKX  DS    CL8                                                              
USCLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
USCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1776 BYTES                            
