*          DATA SET ACCLBF9D   AT LEVEL 006 AS OF 12/29/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T621F9D      DATE 12/29/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
INSTRNH  DS    CL8                                                              
INSTRN   DS    CL15     4    2   15  L  P H             T        Y   64         
INSTRNX  DS    CL8                                                              
INSCLICH DS    CL8                                                              
INSCLIC  DS    CL12     4   18   12  L  P N             T        Y              
INSCLINH DS    CL8                                                              
INSCLIN  DS    CL36     4   34   36  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL15     5    2   15  L  P H             T        Y              
INSPROCH DS    CL8                                                              
INSPROC  DS    CL12     5   18   12  L  P N             T        Y              
INSPRONH DS    CL8                                                              
INSPRON  DS    CL36     5   34   36  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL15     6    2   15  L  P H             T        Y              
INSJOBCH DS    CL8                                                              
INSJOBC  DS    CL12     6   18   12  L  P N             T        Y              
INSJOBNH DS    CL8                                                              
INSJOBN  DS    CL36     6   34   36  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL15     9    2   15  L  P H             T        Y              
INSSUPCH DS    CL8                                                              
INSSUPC  DS    CL14     9   18   14  A  U N             T        Y              
INSSUPNH DS    CL8                                                              
INSSUPN  DS    CL36     9   34   36  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL15    10    2   15  L  P H             T        Y              
INSWCH   DS    CL8                                                              
INSWC    DS    CL2     10   18    2  A  U N             T        Y              
INSWCNH  DS    CL8                                                              
INSWCN   DS    CL15    10   34   15  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL6     11    2    6  L  P H             T        Y              
INSREFH  DS    CL8                                                              
INSREF   DS    CL6     11   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12    2    6  L  P H             T        Y              
INSDATEH DS    CL8                                                              
INSDATE  DS    CL8     12   18    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    16   18   14  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL14    16   34   14  L  P H             T        Y              
INSALLH  DS    CL8                                                              
INSALL   DS    CL15    17    2   15  L  P N             T        Y   68         
INSALLX  DS    CL8                                                              
INSALNTH DS    CL8                                                              
INSALNT  DS    CL14    17   18   14  A  U H             T        Y              
INSALCMH DS    CL8                                                              
INSALCM  DS    CL14    17   34   14  A  U H             T        Y              
INSNARH  DS    CL8                                                              
INSNAR   DS    CL15    21    2   15  L  P N             T        Y   70         
INSNARX  DS    CL8                                                              
INSNAR1H DS    CL8                                                              
INSNAR1  DS    CL49    21   18   49  L  U N             T        Y              
INSNAR2H DS    CL8                                                              
INSNAR2  DS    CL49    22   18   49  L  U N             T        Y              
INSPFKH  DS    CL8                                                              
INSPFK   DS    CL79    24    2   79  A  P N             T        Y  255         
INSPFKX  DS    CL8                                                              
INSLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
INSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 840  BYTES                            
