*          DATA SET ACCLBECD   AT LEVEL 002 AS OF 02/23/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T621ECD      DATE 02/23/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
FOSFMTWH DS    CL8                                                              
FOSFMTW  DS    CL19     4    2   19  L  P H             T        Y              
FOSFMTH  DS    CL8                                                              
FOSFMT   DS    CL3      4   22    3  A  U H             T        Y    1         
FOSFMTX  DS    CL8                                                              
FOSLNGWH DS    CL8                                                              
FOSLNGW  DS    CL12     4   42   12  L  P H             T        Y              
FOSLNGH  DS    CL8                                                              
FOSLNG   DS    CL13     4   62   13  A  U H             T        Y    2         
FOSLNGX  DS    CL8                                                              
FOSLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
FOSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 104  BYTES                            
