*          DATA SET ACCLBF2D   AT LEVEL 004 AS OF 12/31/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T621F2D      DATE 12/31/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
CLTFMTWH DS    CL8                                                              
CLTFMTW  DS    CL19     5    2   19  L  P N             T        Y              
CLTFMTH  DS    CL8                                                              
CLTFMT   DS    CL3      5   22    3  A  U N             T        Y    1         
CLTFMTX  DS    CL8                                                              
CLTLNGWH DS    CL8                                                              
CLTLNGW  DS    CL12     5   42   12  L  P N             T        Y              
CLTLNGH  DS    CL8                                                              
CLTLNG   DS    CL13     5   62   13  A  U N             T        Y    2         
CLTLNGX  DS    CL8                                                              
CLTGRBWH DS    CL8                                                              
CLTGRBW  DS    CL19     6    2   19  L  P N             T        Y              
CLTGRBH  DS    CL8                                                              
CLTGRB   DS    CL3      6   22    3  A  U N             T        Y    3         
CLTGRBX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
CLTLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
CLTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 160  BYTES                            
