*          DATA SET ACCLBFDD   AT LEVEL 006 AS OF 12/31/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T621FDD      DATE 12/31/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL19     4    2   19  L  P H             T        Y              
UPDCLIH  DS    CL8                                                              
UPDCLI   DS    CL57     4   22   57  A  U N             T    I   Y    1         
UPDCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19     5    2   19  L  P H             T        Y              
UPDPROH  DS    CL8                                                              
UPDPRO   DS    CL57     5   22   57  A  U N             T        Y    2         
UPDPROX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19     6    2   19  L  P H             T        Y              
UPDJOBH  DS    CL8                                                              
UPDJOB   DS    CL57     6   22   57  A  U N             T        Y    3         
UPDJOBX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL19     7    2   19  L  P N             T        Y              
UPDBLDTH DS    CL8                                                              
UPDBLDT  DS    CL8      7   22    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19     8    2   19  L  P N             T        Y              
UPDBLDFH DS    CL8                                                              
UPDBLDF  DS    CL6      8   22    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19     8   42   19  L  P N             T        Y              
UPDBLLVH DS    CL8                                                              
UPDBLLV  DS    CL6      8   62    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19     9    2   19  L  P N             T        Y              
UPDBLDDH DS    CL8                                                              
UPDBLDD  DS    CL8      9   22    8  A  U N             T        Y              
UPDLANPH DS    CL8                                                              
UPDLANP  DS    CL19     9   42   19  L  P N             T        Y              
UPDLANGH DS    CL8                                                              
UPDLANG  DS    CL19     9   62   19  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    10    2   19  L  P N             T        Y              
UPDBLBRH DS    CL8                                                              
UPDBLBR  DS    CL4     10   22    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    10   42   19  L  P N             T        Y              
UPDBLMOH DS    CL8                                                              
UPDBLMO  DS    CL6     10   62    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    11    2   19  L  P N             T        Y              
UPDWOBRH DS    CL8                                                              
UPDWOBR  DS    CL4     11   22    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    11   42   19  L  P N             T        Y              
UPDWOMOH DS    CL8                                                              
UPDWOMO  DS    CL6     11   62    6  A  U N             T        Y              
UPDRVBHH DS    CL8                                                              
UPDRVBH  DS    CL19    12    2   19  L  P N             T        Y              
UPDRVBRH DS    CL8                                                              
UPDRVBR  DS    CL4     12   22    4  A  U N             T        Y              
UPDRVMHH DS    CL8                                                              
UPDRVMH  DS    CL19    12   42   19  L  P N             T        Y              
UPDRVMOH DS    CL8                                                              
UPDRVMO  DS    CL6     12   62    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    13    2   19  L  P N             T        Y              
UPDXFBRH DS    CL8                                                              
UPDXFBR  DS    CL4     13   22    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    13   42   19  L  P N             T        Y              
UPDXFMOH DS    CL8                                                              
UPDXFMO  DS    CL6     13   62    6  A  U N             T        Y              
UPDINBHH DS    CL8                                                              
UPDINBH  DS    CL19    14    2   19  L  P N             T        Y              
UPDINBRH DS    CL8                                                              
UPDINBR  DS    CL4     14   22    4  A  U N             T        Y              
UPDINMHH DS    CL8                                                              
UPDINMH  DS    CL19    14   42   19  L  P N             T        Y              
UPDINMOH DS    CL8                                                              
UPDINMO  DS    CL6     14   62    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    15    2   19  L  P H             T        Y              
UPDDEBH  DS    CL8                                                              
UPDDEB   DS    CL14    15   22   14  A  U N             T        Y              
UPDDEBNH DS    CL8                                                              
UPDDEBN  DS    CL36    15   42   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL19    16    2   19  L  P N             T        Y              
UPDSRCAH DS    CL8                                                              
UPDSRCA  DS    CL10    16   22   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    17    2   19  L  P N             T        Y              
UPDSRCH  DS    CL8                                                              
UPDSRC   DS    CL14    17   22   14  A  U N             T        Y              
UPDSRCNH DS    CL8                                                              
UPDSRCN  DS    CL36    17   42   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL19    18    2   19  L  P N             T        Y              
UPDDSCAH DS    CL8                                                              
UPDDSCA  DS    CL10    18   22   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL19    19    2   19  L  P N             T        Y              
UPDDSCH  DS    CL8                                                              
UPDDSC   DS    CL14    19   22   14  A  U N             T        Y              
UPDDSCNH DS    CL8                                                              
UPDDSCN  DS    CL36    19   42   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL19    20    2   19  L  P N             T        Y              
UPDACCH  DS    CL8                                                              
UPDACC   DS    CL14    20   22   14  A  U N             T        Y              
UPDACCNH DS    CL8                                                              
UPDACCN  DS    CL36    20   42   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL19    21    2   19  L  P N             T        Y              
UPDACC1H DS    CL8                                                              
UPDACC1  DS    CL13    21   22   13  A  U N             T        Y              
UPDACC2H DS    CL8                                                              
UPDACC2  DS    CL13    21   36   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    21   50   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    21   64   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    22   22   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    22   36   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    22   50   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    22   64   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    23   22   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    23   36   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    23   50   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    23   64   13  A  U N             T        Y              
UPDPFKH  DS    CL8                                                              
UPDPFK   DS    CL78    24    2   78  A  P N             T        Y  255         
UPDPFKX  DS    CL8                                                              
UPDLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
UPDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1760 BYTES                            
