*          DATA SET ACCLBE3D   AT LEVEL 001 AS OF 12/29/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T621E3D      DATE 12/29/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
DWNRIDH  DS    CL8                                                              
DWNRID   DS    CL3      4    2    3  A  U N             T        Y    1         
DWNRIDX  DS    CL8                                                              
DWNKEYH  DS    CL8                                                              
DWNKEY   DS    CL70     4    6   70  L  U N             T        Y    2         
DWNKEYX  DS    CL8                                                              
DWNSTAH  DS    CL8                                                              
DWNSTA   DS    CL3      4   77    3  A  U N             T        Y    3         
DWNSTAX  DS    CL8                                                              
DWNLN1H  DS    CL8                                                              
DWNLN1   DS    CL78     5    2   78  L  P N             T        N    4         
DWNLN1X  DS    CL8                                                              
DWNLN2H  DS    CL8                                                              
DWNLN2   DS    CL78     6    2   78  L  P N             T        N    4         
DWNLN2X  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78     7    2   78  L  P N             T        N    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78     8    2   78  L  P N             T        N    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78     9    2   78  L  P N             T        N    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    10    2   78  L  P N             T        N    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    11    2   78  L  P N             T        N    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    12    2   78  L  P N             T        N    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    13    2   78  L  P N             T        N    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    14    2   78  L  P N             T        N    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    15    2   78  L  P N             T        N    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    16    2   78  L  P N             T        N    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    17    2   78  L  P N             T        N    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    18    2   78  L  P N             T        N    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    19    2   78  L  P N             T        N    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    20    2   78  L  P N             T        N    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    21    2   78  L  P N             T        N    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    22    2   78  L  P N             T        N    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    23    2   78  L  P N             T        N    4         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    24    2   78  L  P N             T        N    4         
         DS    CL8                                                              
DWNLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
DWNWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2008 BYTES                            
