*          DATA SET ACCLBE5D   AT LEVEL 001 AS OF 10/28/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T621E5D      DATE 10/28/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL13     4    2   13  L  P H             T        Y              
SNMFNOH  DS    CL8                                                              
SNMFNO   DS    CL3      4   22    3  A  U N             T        Y    1         
SNMFNOX  DS    CL8                                                              
SNMFNMH  DS    CL8                                                              
SNMFNM   DS    CL36     4   31   36  L  U N             T        Y              
SNMLNGWH DS    CL8                                                              
SNMLNGW  DS    CL12     5    2   12  L  P H             T        Y              
SNMLNGH  DS    CL8                                                              
SNMLNG   DS    CL13     5   22   13  A  U H             T        Y    2         
SNMLNGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     6    2   14  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      6   22    4  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL14     7    2   14  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      7   22    4  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      8    2    1  L  P N             T        Y              
SNM1H    DS    CL8                                                              
SNM1     DS    CL6      8   22    6  L  U N             T    I   Y    3         
SNM1X    DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     10    2    1  L  P N             T        Y              
SNM2H    DS    CL8                                                              
SNM2     DS    CL6     10   22    6  L  U N             T        Y    4         
SNM2X    DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     12    2    1  L  P N             T        Y              
SNM3H    DS    CL8                                                              
SNM3     DS    CL6     12   22    6  L  U N             T        Y    5         
SNM3X    DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     14    2    1  L  P N             T        Y              
SNM4H    DS    CL8                                                              
SNM4     DS    CL6     14   22    6  L  U N             T        Y    6         
SNM4X    DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16    2    1  L  P N             T        Y              
SNM5H    DS    CL8                                                              
SNM5     DS    CL6     16   22    6  L  U N             T        Y    7         
SNM5X    DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18    2    1  L  P N             T        Y              
SNM6H    DS    CL8                                                              
SNM6     DS    CL6     18   22    6  L  U N             T        Y    8         
SNM6X    DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20    2    1  L  P N             T        Y              
SNM7H    DS    CL8                                                              
SNM7     DS    CL6     20   22    6  L  U N             T        Y    9         
SNM7X    DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     22    2    1  L  P N             T        Y              
SNM8H    DS    CL8                                                              
SNM8     DS    CL6     22   22    6  L  U N             T        Y   10         
SNM8X    DS    CL8                                                              
         DS    CL8                                                              
         DS    CL79    24    2   79  L  P H             T        Y  255         
         DS    CL8                                                              
SNMLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
SNMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 552  BYTES                            
