*          DATA SET ACCLBEFD   AT LEVEL 001 AS OF 08/25/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T621EFD      DATE 08/25/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      4    2    8  L  P H             T        Y              
BASJOBCH DS    CL8                                                              
BASJOBC  DS    CL12     4   11   12  L  P N             T        Y              
BASJOBNH DS    CL8                                                              
BASJOBN  DS    CL36     4   24   36  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      5    2    8  L  P N             T        Y              
BASDATH  DS    CL8                                                              
BASDAT   DS    CL9      5   11    9  A  U H             T        Y    1         
BASDATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      5   22    8  L  P N             T        Y              
BASREFH  DS    CL8                                                              
BASREF   DS    CL4      5   31    4  A  U H             T        Y    2         
BASREFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      5   42    8  L  P N             T        Y              
BASMONH  DS    CL8                                                              
BASMON   DS    CL5      5   51    5  A  U H             T        Y    2         
BASMONX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6    2    1  A  P N             T        Y              
BASLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
BASWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 208  BYTES                            
