*          DATA SET ACCLBWORKC AT LEVEL 096 AS OF 04/29/98                      
       ++INCLUDE ACGENWORK                                                      
         EJECT                                                                  
***********************************************************************         
* GLOBAL EQUATES                                                      *         
***********************************************************************         
         SPACE 1                                                                
HELPSCRN EQU   X'FB'               HELP SCREEN NUMBER                           
         SPACE 1                                                                
SYSUK    EQU   1                   UK SYSTEM EQUATE                             
SYSUS    EQU   2                   US SYSTEM EQUATE                             
         SPACE 1                                                                
CSINDSET EQU   X'80'               SETUP SCREEN PROCESSED                       
CSWARNED EQU   X'20'               WARNING SENT                                 
MIXISETP EQU   MIXIAPL1            SETUP MUST HAVE BEEN PROCESSED               
MIXIJCLB EQU   MIXIAPL2            JOB BILLING TYPE MUST BE CLIENT              
MIXIFMTC EQU   MIXIAPL3            FORMAT CODE REQUIRED                         
BCAPICHR EQU   X'80'               COMMISSION SCIEL IS CHARGE, NOT COST         
BCAPIBAU EQU   X'40'               BILL RECORD AMOUNTS NEED UPDATING            
ACTNOT   EQU   X'80'               'NOT' ACTION FILTER                          
         SPACE 1                                                                
PFKFLDNO EQU   255                 FIELD NUMBER FOR PFKEY DISPLAY               
MAXLLNQ  EQU   117                 MAX LENGTH OF DATA IN LINE                   
NUMCOLSQ EQU   80                  NUMBER OF COLUMNS ON SCREEN                  
NUMROWSQ EQU   24                  NUMBER OF ROWS ON SCREEN                     
         SPACE 1                                                                
O#BILSET EQU   X'01'               SETUP OVERLAY                                
O#BILALC EQU   X'02'               ALLOCATION OVERLAY                           
O#BILZOO EQU   X'03'               ZOOM/ZOOMWO                                  
O#BILFRM EQU   X'04'               FORMAT OVERLAY                               
O#BILENQ EQU   X'05'               ENQUIRY OVERLAY                              
O#BILUPD EQU   X'06'               UPDATE OVERLAY                               
O#BILLST EQU   X'07'               LIST OVERLAY                                 
O#BILDIS EQU   X'08'               DISPLAY OVERLAY                              
O#BILINS EQU   X'09'               INSERT OVERLAY                               
O#BILEDT EQU   X'0A'               EDIT OVERLAY                                 
O#BILPRT EQU   X'0B'               PRINTING                                     
O#BILCON EQU   X'0C'               CONTROL                                      
O#BILCLT EQU   X'0D'               CONTROL LIST                                 
O#BILUTP EQU   X'0E'               UPDATE TRANSACTIONS AND POST                 
O#BILPRB EQU   X'0F'               PREVBILL                                     
O#BILRVL EQU   X'10'               REVALUE                                      
O#BILMT1 EQU   X'11'               MATCH 1                                      
O#BILMT2 EQU   X'12'               MATCH 2                                      
O#BILAAL EQU   X'13'               AUTO ALLOCATION                              
O#BILFOP EQU   X'14'               FORMAT OPTIONS                               
O#BILXFR EQU   X'15'               TRANSFER LIST                                
O#BILRCV EQU   X'16'               WRITE OFF RECOVERY LIST                      
O#BILFEE EQU   X'17'               FEE ADJUSTMENT                               
O#BILREV EQU   X'18'               REVERSE                                      
O#BILARV EQU   X'19'               AUTO REVERSE                                 
O#BILFLI EQU   X'1A'               FEE LIST                                     
O#BILCOL EQU   X'1B'               COLUMNS LIST                                 
O#BILHLP EQU   X'1C'               ACTION HELP                                  
O#BILJLI EQU   X'1D'               JOB/LIST                                     
O#VALBIL EQU   X'1E'               VALIDATE BILLING FIELDS                      
O#UPDBIL EQU   X'1F'               UPDATE BILLING                               
O#UPDWOF EQU   X'20'               UPDATE WRITE-OFFS/RECOVERIES                 
O#UPDXFR EQU   X'21'               UPDATE TRANSFERS                             
O#UPDFEE EQU   X'22'               UPDATE FEE-ADJUSTMENTS                       
O#LIST   EQU   X'30'               LIST SUB-CONTROLLER OVERLAY                  
O#ROUTS  EQU   X'40'               BILL PROGRAM ROUTINES 1                      
O#ROUTS2 EQU   X'41'               BILL PROGRAM ROUTINES 2                      
O#OPTS   EQU   X'42'               BILL PROGRAM OPTION ROUTINES                 
O#XFRTMS EQU   X'43'               BILL PROGRAM TRANSFER TMS ROUTINE            
O#UPDATE EQU   X'44'               ROUTINES FOR DRAFT/UPDATE                    
         SPACE 1                                                                
S#BILSET EQU   X'FE'               SETUP SCREEN                                 
S#BILUPD EQU   X'FD'               UPDATE SCREEN                                
S#BILZOO EQU   X'FC'               ZOOM SCREEN (ROOT)                           
S#BILHLP EQU   X'FB'               ACTION HELP                                  
S#BILENQ EQU   X'FA'               ENQUIRY SCREEN                               
S#BILINS EQU   X'F9'               INSERT SCREEN                                
S#BILZWO EQU   X'F8'               ZOOM WRITE-OFF SCREEN (EXTENSION)            
S#BILMT2 EQU   X'F7'               MATCH 2 (INVOICE) SCREEN                     
S#BILZRG EQU   X'F6'               ZOOM REGULAR SCREEN (EXTENSION)              
S#BILEDT EQU   X'F5'               EDIT SCREEN                                  
S#BILDIS EQU   X'F4'               DISPLAY SCREEN                               
S#BILCON EQU   X'F3'               CONTROL SCREEN (FORMAT)                      
S#BILCLT EQU   X'F2'               CONTROL LIST SCREEN                          
S#BILALC EQU   X'F1'               ALLOCATION SCREEN                            
S#BILFEE EQU   X'F0'               FEE ADJUSTMENT SCREEN                        
S#BILRVL EQU   X'EF'               REVALUE SCREEN                               
S#BILMT1 EQU   X'EE'               MATCH 1 SCREEN                               
S#BILAAL EQU   X'ED'               AUTO ALLOCATION SCREEN                       
S#BILFOP EQU   X'EC'               FORMAT OPTIONS SCREEN                        
S#BILRCV EQU   X'EB'               WRITE OFF RECOVERY SCREEN                    
S#BILCOL EQU   X'EA'               COLUMNS SCREEN                               
S#BILCO1 EQU   X'E9'               CONTROL 2 SCREEN (FORMAT)                    
S#BILCO2 EQU   X'E8'               CONTROL 2 SCREEN (FORMAT)                    
S#BILBAT EQU   X'E7'               BATCH INPUT SCREEN (FOR LISTS)               
         SPACE 1                                                                
***********************************************************************         
* PFKEY EQUATES                                                       *         
***********************************************************************         
         SPACE 1                                                                
PFKCCLRQ EQU   PFK01               CONTROL/CLEAR                                
PFKRDFTQ EQU   PFK01               REVALUE/DRAFT                                
PFKRLIVQ EQU   PFK02               REVALUE/LIVE                                 
PFKCPRTQ EQU   PFK05               CONTROL/PRINT                                
PFKCSAVQ EQU   PFK06               CONTROL/SAVE                                 
PFKMDFTQ EQU   PFK03               MATCH/DRAFT                                  
PFKMUPDQ EQU   PFK06               MATCH/UPDATE                                 
*&&UK                                                                           
PFKSAFMQ EQU   PFK05               SETUP/AUTOFORMAT                             
*&&                                                                             
*&&US                                                                           
PFKSAFMQ EQU   PFK21               SETUP/AUTOFORMAT                             
*&&                                                                             
*                                                                               
PFKAALCQ EQU   PFK01               AUTOALL/ALLOCATE                             
PFKACFMQ EQU   PFK02               AUTOALL/CONFIRM                              
PFKAGRPQ EQU   PFK03               AUTOALL/GROUP                                
PFKAFLTQ EQU   PFK04               AUTOALL/FILTER                               
*                                                                               
PFKBKWDQ EQU   PFK07               SCROLL BACK                                  
PFKFRWDQ EQU   PFK08               SCROLL FORWARD                               
PFKLEFTQ EQU   PFK09               SCROLL LEFT                                  
PFKRGHTQ EQU   PFK10               SCROLL RIGHT                                 
PFKNEXTQ EQU   PFK11               NEXT                                         
PFKQUITQ EQU   PFK12               QUIT (RETURN)                                
PFKALTPQ EQU   PFK13               ALT PFS                                      
PFKMOREQ EQU   PFK13               MORE PFS                                     
PFKRFSHQ EQU   PFK14               LIST REFRESH                                 
         SPACE 1                                                                
TWAISETC EQU   X'80'               SETUP COMPLETE (TWAINDS1)                    
         SPACE 1                                                                
***********************************************************************         
* RECORD/ACTION EQUATES                                               *         
***********************************************************************         
         SPACE 1                                                                
RECBIL   EQU   1                   BILL                                         
*                                                                               
ACTSET   EQU   1                   SETUP                                        
ACTUPD   EQU   2                   UPDATE                                       
ACTALC   EQU   3                   ALLOCATE                                     
*CTCHA   EQU   4                   CHANGE (TO SETUP)                            
ACTWOF   EQU   5                   WRITE-OFF (LIST)                             
ACTXFR   EQU   6                   TRANSFER (LIST)                              
ACTEDT   EQU   7                   EDIT                                         
ACTZOO   EQU   8                   ZOOM                                         
ACTAFRM  EQU   9                   AUTOFORMAT                                   
ACTSUM   EQU   10                  SUMMARY                                      
ACTLST   EQU   11                  LIST                                         
ACTZWO   EQU   12                  ZOOM WRITE OFF                               
ACTFFRM  EQU   13                  FREEFORMAT (ADD BLANK)                       
ACTINS   EQU   14                  INSERT (EXTRA BILLING ITEM)                  
ACTLPAR  EQU   15                  LISTPARAS                                    
ACTFT1   EQU   16                  FORMAT1 (FORMAT CONTROL RECORD)              
ACTLFT   EQU   17                  LIST FORMAT CONTROL RECORDS                  
ACTDRA   EQU   18                  UPDATE (DRAFT)                               
ACTFEE   EQU   19                  FEE ADJUSTMENT                               
*CTINT   EQU   20                  INTERNAL INV (VIA ADVANCE SCREEN)            
ACTFOP   EQU   21                  FORMAT OPTIONS                               
ACTPRB   EQU   22                  PREVBILL LIST                                
ACTREV   EQU   23                  REVERSE                                      
ACTRVL   EQU   24                  REVALUE                                      
ACTMT1   EQU   25                  MATCH 1                                      
ACTMT2   EQU   26                  MATCH 2                                      
ACTAALC  EQU   27                  AUTO ALLOCATE                                
ACTZWR   EQU   28                  ZOOM WRITE OFF RECOVERY                      
ACTAULC  EQU   29                  AUTO UNALLOCATE                              
ACTRCVR  EQU   30                  WRITE OFF RECOVERY LIST                      
ACTARV   EQU   31                  AUTO REVERSE                                 
ACTFLI   EQU   32                  FEE ADJUSTMENT LIST                          
ACTCOL   EQU   33                  COLUMNS LIST                                 
ACTHELP  EQU   34                  ACTION HELP                                  
ACTJLI   EQU   35                  JOB LIST                                     
ACTAPF   EQU   250                 ALTPF                                        
ACTQUI   EQU   251                 QUIT                                         
ACTNXT   EQU   252                 NEXT                                         
ACTRFS   EQU   253                 REFRESH                                      
         SPACE 1                                                                
*                                  * SELECT TABLE HEADER EQUATES *              
SELALCQ  EQU   001                 ALLOCATE                                     
SELLFTQ  EQU   002                 LIST FORMAT CONTROL RECORDS                  
SELLSTQ  EQU   003                 BILL LIST                                    
SELPRBQ  EQU   004                 PREVBILL LIST                                
SELREVQ  EQU   005                 REVERSE                                      
SELRVLQ  EQU   006                 REVALUE                                      
SELMT1Q  EQU   007                 MATCH 1                                      
SELMT2Q  EQU   008                 MATCH 2                                      
SELAALCQ EQU   009                 AUTO ALLOCATE                                
SELXFRQ  EQU   010                 TRANSFER LIST                                
SELRCVRQ EQU   011                 WRITE OFF RECOVERY LIST                      
SELFLIQ  EQU   012                 FEE ADJUSTMENT LIST                          
SELCOLQ  EQU   013                 COLUMNS LIST                                 
SELJLIQ  EQU   014                 JOB LIST                                     
         SPACE 1                                                                
*                                  * COLUMN TABLE HEADER EQUATES *              
CLMALCQ  EQU   001                 ALLOCATE                                     
CLMLFTQ  EQU   002                 LIST FORMAT CONTROL RECORDS                  
CLMLSTQ  EQU   003                 BILL LIST                                    
CLMPRBQ  EQU   004                 PREVBILL LIST                                
CLMRVLQ  EQU   005                 REVALUE                                      
CLMMT1Q  EQU   006                 MATCH 1                                      
CLMMT2Q  EQU   007                 MATCH 2                                      
CLMAALCQ EQU   008                 AUTO ALLOCATE                                
CLMSUMMQ EQU   009                 SUMMARY LIST                                 
CLMXFRQ  EQU   010                 TRANSFER LIST                                
CLMRCVRQ EQU   011                 WRITE OFF RECOVERY LIST                      
CLMREVQ  EQU   012                 REVERSE                                      
CLMFLIQ  EQU   013                 FEE ADJUSTMENT LIST                          
CLMCOLQ  EQU   014                 COLUMNS LIST                                 
CLMJLIQ  EQU   015                 JOB LIST                                     
CLMFOPQ  EQU   016                 JOB LIST                                     
*                                                                               
CLMGENQ  EQU   255                 FOR ALL LISTS                                
         SPACE 1                                                                
*                                  * SUB-ACTION FIELD HELP PANELS *             
SUB#ALC  EQU   250                 ALLOCATE                                     
SUB#XFR  EQU   249                 TRANSFER                                     
SUB#LST  EQU   248                 LIST                                         
SUB#PRB  EQU   247                 PREVBILL                                     
SUB#REV  EQU   246                 REVERSE                                      
SUB#RVL  EQU   245                 REVALUE                                      
SUB#MT1  EQU   244                 MATCH                                        
SUB#MT2  EQU   243                 INVOICE                                      
SUB#AALC EQU   242                 AUTOALLOCATE                                 
SUB#AULC EQU   241                 AUTOUNALLOCATE                               
SUB#WOF  EQU   240                 WRITE-OFF                                    
SUB#LFT  EQU   239                 FORMLIST                                     
SUB#RCVR EQU   238                 RECOVER                                      
SUB#FLI  EQU   237                 FEE ADJUSTMENT LIST                          
SUB#COL  EQU   236                 COLUMNS                                      
SUB#JLI  EQU   235                 JOB LIST                                     
         SPACE 1                                                                
*                                  * SUB-ACTION FIELD HELP PANELS *             
OPT#ALC  EQU   005                 ALLOCATE                                     
OPT#XFR  EQU   006                 TRANSFER                                     
OPT#LST  EQU   007                 LIST                                         
OPT#PRB  EQU   008                 PREVBILL                                     
OPT#REV  EQU   009                 REVERSE                                      
OPT#RVL  EQU   010                 REVALUE                                      
OPT#MT1  EQU   011                 MATCH                                        
OPT#MT2  EQU   012                 INVOICE                                      
OPT#AALC EQU   013                 AUTOALLOCATE                                 
OPT#AULC EQU   014                 AUTOUNALLOCATE                               
OPT#WOF  EQU   015                 WRITE-OFF                                    
OPT#LFT  EQU   016                 FORMLIST                                     
OPT#RCVR EQU   017                 RECOVER                                      
OPT#FLI  EQU   018                 FEE ADJUSTMENT LIST                          
OPT#JLI  EQU   019                 JOB LIST                                     
OPT#EDT  EQU   020                 EDIT                                         
         SPACE 1                                                                
***********************************************************************         
* GENERAL OPTION VALIDATION ROUTINE EQUATES                           *         
***********************************************************************         
         SPACE 1                                                                
OPTDISQ  EQU   X'FF00'+01          DIS=                                         
OPTYNOQ  EQU   X'FF00'+02          YES/NO/ONLY                                  
OPTYNQ   EQU   X'FF00'+03          YES/NO                                       
OPTWCQ   EQU   X'FF00'+04          WORK-CODE                                    
OPTTYPQ  EQU   X'FF00'+05          INPUT TYPE                                   
OPTSTRQ  EQU   X'FF00'+06          STRING TEXT RANGE                            
OPTDATQ  EQU   X'FF00'+07          DATE RANGE                                   
OPTMOAQ  EQU   X'FF00'+08          MOA RANGE                                    
OPTAMTQ  EQU   X'FF00'+09          AMOUNT INPUT                                 
OPTCMOQ  EQU   X'FF00'+10          COMMISSION OVERRIDE                          
OPTNYQ   EQU   X'FF00'+11          NO/YES ('Y'=NO, 'N'=YES)                     
OPTWCTQ  EQU   X'FF00'+12          WCTYPE=O/P/R/T                               
OPTYNOPQ EQU   X'FF00'+13          ALLOC=Y/N/O/P                                
OPTPERDQ EQU   X'FF00'+14          PERIOD=(START)(-)(END)                       
OPTTXTQ  EQU   X'FF00'+15          TEXT (INPUT=OUTPUT)                          
OPTWTOTQ EQU   X'FF00'+16          WCTOTAL=YES/NO                               
         SPACE 1                                                                
***********************************************************************         
* GENERAL OPTION LISTS (SUBSTITUTED IN OPTNAME)                       *         
***********************************************************************         
         SPACE 1                                                                
TRNOPTQ  EQU   X'FFFF'             TRANSACTION OPTIONS                          
         SPACE 1                                                                
***********************************************************************         
* SPECIAL OPTDVAL EQUATE                                              *         
***********************************************************************         
         SPACE 1                                                                
OPTDEFQ  EQU   X'42'               'INPUT' TO SET DEFAULT                       
         SPACE 1                                                                
***********************************************************************         
* OPTFILT VALUES                                                      *         
***********************************************************************         
         SPACE 1                                                                
OPTFORD  EQU   X'8000'             ORDERS INCLUDED IN LIST                      
OPTFBLDY EQU   X'4000'             INCLUDE BILLED FILTER (DEFAULT YES)          
OPTFBLDN EQU   X'2000'             INCLUDE BILLED FILTER (DEFAULT NO)           
OPTFUNAV EQU   X'1000'             INCLUDE UNAVAILABLE FILTER                   
OPTFCOMM EQU   X'0800'             INCLUDE COMMISSION OPTION                    
OPTFWCT  EQU   X'0400'             INCLUDE W/C TOTAL OPTION                     
         SPACE 1                                                                
***********************************************************************         
* GENERAL DISPLAY COLUMN ROUTINE EQUATES                              *         
***********************************************************************         
         SPACE 1                                                                
*                                  * CLMGENM VALUES *                           
CLM#ALL  EQU   X'0000'             COLUMNS VALID FOR ALL LISTS                  
CLM#TKY  EQU   X'8000'             TRANSACTION LIST KEY COLUMNS                 
CLM#PRO  EQU   X'4000'             PRO-RATA AMOUNT COLUMNS                      
CLM#BIL  EQU   X'2000'             BILLING TRANSACTION LIST COLUMNS             
CLM#TRN  EQU   X'1000'             TRANSACTION LIST COLUMNS                     
*                                                                               
ALL@DA   EQU   X'80'+001           DISK ADDRESS                                 
ALL@TSR  EQU   X'80'+002           TSAR INFO                                    
ALL@KEY  EQU   X'80'+003           TSAR KEY                                     
TKY@WC   EQU   X'80'+004           TRANSACTION WORK-CODE                        
TKY@CTA  EQU   X'80'+005           TRANSACTION CONTRA-ACCOUNT                   
TKY@REF  EQU   X'80'+006           TRANSACTION REFERENCE #                      
TRN@DAT  EQU   X'80'+007           TRANSACTION DATE                             
TRN@MOA  EQU   X'80'+008           TRANSACTION MONTH OF ACTIVITY                
TRN@BRF  EQU   X'80'+009           TRANSACTION BATCH REFERENCE                  
TRN@INP  EQU   X'80'+010           TRANSACTION INPUT TYPE                       
BIL@STA  EQU   X'80'+011           TRANSACTION STATUS                           
TRN@ORD  EQU   X'80'+012           TRANSACTION ORDER NUMBER                     
BIL@CMR  EQU   X'80'+013           TRANSACTION COMMISSION RATE                  
BIL@WOA  EQU   X'80'+014           TRANSACTION WRITE-OFF ACCOUNT                
BIL@OFF  EQU   X'80'+015           TRANSACTION OFFICE CODE                      
BIL@PAR  EQU   X'80'+016           TRANSACTION PARAGRAPH CODE                   
BIL@PTA  EQU   X'80'+017           TRANSACTION PTA RECORD D/A                   
TRN@SBR  EQU   X'80'+018           TRANSACTION SUB-REFERENCE                    
TRN@CTN  EQU   X'80'+019           TRANSACTION CONTRA-ACCOUNT NAME              
BIL@CST  EQU   X'80'+020           TRANSACTION COMMISIONABLE STATUS             
ALL@DTA  EQU   X'80'+021           TSAR DATA                                    
BIL@DTA  EQU   X'80'+022           TSAR DATA FOR TRANSACTION RECORD             
         SPACE 1                                                                
***********************************************************************         
* BRANCH CONDITION EQUATES                                            *         
***********************************************************************         
         SPACE 1                                                                
BEQ      EQU   X'80'               EQUAL                                        
BLQ      EQU   X'40'               LOW                                          
BHQ      EQU   X'20'               HIGH                                         
BPQ      EQU   X'20'               PLUS                                         
BOQ      EQU   X'10'               ONES       /  OVERFLOW                       
BMQ      EQU   X'40'               MIXED      /  MINUS                          
BZQ      EQU   X'80'               ZEROES     /  ZERO                           
BNEQ     EQU   X'70'               NOT EQUAL                                    
BNLQ     EQU   X'B0'               NOT LOW                                      
BNHQ     EQU   X'D0'               NOT HIGH                                     
BNPQ     EQU   X'D0'               NOT PLUS                                     
BNOQ     EQU   X'E0'               NOT ONES   /  NOT OVERFLOW                   
BNMQ     EQU   X'B0'               NOT MIXED  /  NOT MINUS                      
BNZQ     EQU   X'70'               NOT ZEROES /  NOT ZERO                       
         EJECT                                                                  
***********************************************************************         
* LIST LINE TABLE                                                     *         
***********************************************************************         
         SPACE 1                                                                
LINTABD  DSECT                                                                  
LINHCOL  DS    XL1                 COLUMN HEADING POSITION (0-79)               
LINFCOL  DS    XL1                 COLUMN FIELD POSITION (0-79)                 
LINHDR   DS    XL1                 DISPLACEMENT TO HEADER ON LINE               
LINDSP   DS    XL1                 DISPLACEMENT WITHIN FIELD                    
LINCLM   DS    H                   DISPLACEMENT TO COLUMN TABLE ENTRY           
LININDS  DS    XL1                 * INDICATORS BYTE *                          
LINIINP  EQU   X'80'               COLUMN IS INPUT FIELD                        
         DS    XL1                 N/D                                          
LINTABL  EQU   8                                                                
         ORG   LINTABD+LINTABL                                                  
         SPACE 1                                                                
***********************************************************************         
* POST ROUTINE BLOCK                                                  *         
***********************************************************************         
         SPACE 1                                                                
PBLKD    DSECT                                                                  
*                                                                               
PBPARMS  DS    0XL256              ** VALUES PASSED BY CALLER **                
PBMODE   DS    XL1                 POSTING MODE                                 
PBDISQ   EQU   01                  DISPLAY DEFAULT BILLING DETAILS              
PBVALQ   EQU   02                  VALIDATE BATCH DETAILS                       
PBDRAFTQ EQU   03                  DRAFT                                        
PBLIVEQ  EQU   04                  LIVE                                         
*                                                                               
PBTYPES  DS    XL1                 TYPES OF ACTIVITY BEING UPDATED              
PBBILQ   EQU   X'80'               UPDATE BILL ALLOCATION                       
PBWOFQ   EQU   X'40'               UPDATE WRITE-OFFS                            
PBRECQ   EQU   X'20'               UPDATE WRITE-OFF RECOVERIES                  
PBXFRQ   EQU   X'10'               UPDATE TRANSFERS                             
PBFEEQ   EQU   X'08'               UPDATE FEE ADJUSTMENTS                       
*                                                                               
PBINDS1  DS    XL1                 INIDCATOR BYTE                               
PBIWOFC  EQU   X'80'               WRITE-OFFS COST UPDATED                      
PBIWOFT  EQU   X'40'               WRITE-OFFS TIME UPDATED                      
PBIRECC  EQU   X'20'               RECOVERIES COST UPDATED                      
PBIRECT  EQU   X'10'               RECOVERIES TIME UPDATED                      
PBINDRA  EQU   X'08'               NEW DRAFT BILL NUMBER INPUT                  
PBIAUTO  EQU   X'04'               AUTO LIVE BILL NUMBER SET                    
         DS    XL3                 N/D                                          
*                                                                               
PBATWAX  DS    AL4                 A(END TWA TO PRINT IN HEADER SCREEN)         
*                                                                               
PBDRAFT# DS    CL6                 DRAFT BILL NUMBER                            
PBLIVE#  DS    CL6                 LIVE BILL NUMBER                             
*                                                                               
         DS    XL18                N/D                                          
*                                                                               
PBBILBAT DS    0XL(PBBATCHL)       BILLING BATCH VALUES                         
PBBILREF DS    CL4                 REFERENCE NUMBER                             
PBBILMP  DS    PL2                 MOA PACKED                                   
PBBILMC  DS    CL2                 MOA CHARACTER                                
         ORG   PBBILBAT+PBBATCHL                                                
*                                                                               
PBWOFBAT DS    0XL(PBBATCHL)       WRITE OFF BATCH VALUES                       
PBWOFREF DS    CL4                 REFERENCE NUMBER                             
PBWOFMP  DS    PL2                 MOA PACKED                                   
PBWOFMC  DS    CL2                 MOA CHARACTER                                
         ORG   PBWOFBAT+PBBATCHL                                                
*                                                                               
PBRECBAT DS    0XL(PBBATCHL)       RECOVERY BATCH VALUES                        
PBRECREF DS    CL4                 REFERENCE NUMBER                             
PBRECMP  DS    PL2                 MOA PACKED                                   
PBRECMC  DS    CL2                 MOA CHARACTER                                
         ORG   PBRECBAT+PBBATCHL                                                
*                                                                               
PBXFRBAT DS    0XL(PBBATCHL)       TRANSFER BATCH VALUES                        
PBXFRREF DS    CL4                 REFERENCE NUMBER                             
PBXFRMP  DS    PL2                 MOA PACKED                                   
PBXFRMC  DS    CL2                 MOA CHARACTER                                
         ORG   PBXFRBAT+PBBATCHL                                                
*                                                                               
PBFEEBAT DS    0XL(PBBATCHL)       TRANSFER BATCH VALUES                        
PBFEEREF DS    CL4                 REFERENCE NUMBER                             
PBFEEMP  DS    PL2                 MOA PACKED                                   
PBFEEMC  DS    CL2                 MOA CHARACTER                                
         ORG   PBFEEBAT+PBBATCHL                                                
*                                                                               
         DS    XL40                N/D                                          
*                                                                               
PBADRAH  DS    AL4                 A(DRAFT BILL# FIELD)                         
PBALIVH  DS    AL4                 A(LIVE BILL# FIELD)                          
PBADATH  DS    AL4                 A(BILL DATE FIELD)                           
PBADUEH  DS    AL4                 A(DUE DATE FIELD)                            
PBALANH  DS    AL4                 A(LANGUAGE FIELD)                            
PBADEBH  DS    AL4                 A(DEBTORS ACCOUNT FIELD)                     
PBADEBNH DS    AL4                 A(DEBTORS ACCOUNT NAME FIELD)                
PBASRCPH DS    AL4                 A(SURCHARGE PERCENT FIELD)                   
PBASRCH  DS    AL4                 A(SURCHARGE ACCOUNT FIELD)                   
PBASRCNH DS    AL4                 A(SURCHARGE ACCOUNT NAME FIELD)              
PBADSCPH DS    AL4                 A(DISCOUNT PERCENT FIELD)                    
PBADSCH  DS    AL4                 A(DISCOUNT ACCOUNT FIELD)                    
PBADSCNH DS    AL4                 A(DISCOUNT ACCOUNT NAME FIELD)               
PBAACCH  DS    AL4                 A(ACCRUAL ACCOUNT FIELD)                     
PBAACCNH DS    AL4                 A(ACCRUAL ACCOUNT NAME FIELD)                
PBAMNTHH DS    AL4                 A(1ST MOONTHS FIELD)                         
*                                                                               
         DS    (L'PBPARMS-(*-PBPARMS))X                                         
PBPARMSL EQU   *-PBPARMS                                                        
*                                                                               
PBAPARMS DS    AL4                 A(CALLERS PBPARMS)                           
PBACURS  DS    AL4                 A(CURSOR ON SUCCESSFUL COMPLETION)           
         DS    XL20                N/D                                          
*                                                                               
PBDATC   DS    XL2                 BILL DATE (COMPRESSED)                       
PBDATP   DS    PL3                 BILL DATE (PWOS)                             
PBDUE    DS    XL2                 DUE DATE                                     
PBDEBULA DS    0CL14               DEBTORS U/L/ACCOUNT                          
PBDEBUL  DS    CL2                 DEBTORS LEDGER                               
PBDEBACT DS    CL12                DEBTORS ACCOUNT CODE                         
PBSRCPC  DS    PL6                 SURCHARGE PERCENT                            
PBSRCULA DS    CL14                SURCHARGE U/L/ACCOUNT                        
PBSRCAN  DS    CL12                SURCHARGE ACCOUNT COSTING CODE               
PBDSCPC  DS    PL6                 DISCOUNT PERCENT                             
PBDSCULA DS    CL14                DISCOUNT U/L/ACCOUNT                         
PBACCULA DS    CL14                ACCRUAL U/L/ACCOUNT                          
PBMNTHSN DS    XL1                 NUMBER OF MONTH/AMOUNTS                      
PBMNTHS  DS    12XL(PBMNTHSL)      MONTH/AMOUNTS (SEE PBMNTHSD)                 
PBMNTHSX DS    XL1                                                              
         DS    XL32                N/D                                          
*                                                                               
PBAMTS   DS    0PL8                JOB AMOUNTS                                  
PBDSCPT  DS    PL8                 DISCOUNT PERCENT                             
PBSCHPT  DS    PL8                 SURCHARGE PERCENT                            
PBCBAPN  DS    PL8                 PENDING ALLOCATION (NET)                     
PBCBAPC  DS    PL8                 PENDING ALLOCATION (COMMISSION)              
PBCBALN  DS    PL8                 PENDING ALLOCATION (NET) BILLCURR            
PBCBALC  DS    PL8                 PENDING ALLOCATION (COMM) BILLCURR           
PBCBAPD  DS    PL8                 PENDING ALLOCATION (DISCOUNT)                
PBCBWP   DS    PL8                 PENDING WRITE-OFF                            
PBCBWPT  DS    PL8                 PENDING WRITE-OFF (TIME)                     
PBCBWPC  DS    PL8                 PENDING WRITE-OFF (COST)                     
PBCBRP   DS    PL8                 PENDING RECOVERY                             
PBCBRPT  DS    PL8                 PENDING RECOVERY (TIME)                      
PBCBRPC  DS    PL8                 PENDING RECOVERY (COST)                      
PBCBTP   DS    PL8                 PENDING TRANSFER                             
PBCBFP   DS    PL8                 PENDING FEE ADJUSTMENT                       
PBBLBL   DS    PL8                 TOTAL BILLABLE ON JOB                        
PBBHAPN  DS    PL8                 BILL HEADER ALLOCATION (NET)                 
PBBHAPC  DS    PL8                 BILL HEADER ALLOCATION (COMMISSION)          
*                                                                               
PBACCAC  DS    PL8                 INCOME A/C AGYCURR COMMISSION                
PBACCFC  DS    PL8                 INCOME A/C FOREIGN COMMISSION                
PBACCAN  DS    PL8                 INCOME A/C AGYCURR NET                       
PBACCFN  DS    PL8                 INCOME A/C FOREIGN NET                       
PBTOTAC  DS    PL8                 BILL TOTAL AGYCURR COMMISSION                
PBTOTFC  DS    PL8                 BILL TOTAL FOREIGN COMMISSION                
PBTOTAN  DS    PL8                 BILL TOTAL AGYCURR NET                       
PBTOTFN  DS    PL8                 BILL TOTAL FOREIGN COMMISSION                
PBTOTAV  DS    PL8                 BILL TOTAL VAT AGYCURR                       
PBTOTFV  DS    PL8                 BILL TOTAL VAT FOREIGN                       
PBTOTAP  DS    PL8                 BILL TOTAL PST AGYCURR                       
PBTOTAD  DS    PL8                 BILL TOTAL DISCOUNT  (AGYCURR)               
PBTOTFD  DS    PL8                 BILL TOTAL DISCOUNT  (FOREIGN)               
PBTOTAS  DS    PL8                 BILL TOTAL SURCHARGE (AGYCURR)               
PBTOTFS  DS    PL8                 BILL TOTAL SURCHARGE (FOREIGN)               
PBTOTSK  DS    PL8                 BILL TOTAL SK POSTING AMOUNT                 
PBVATT   DS    PL8                 BILL VAT TOTAL                               
*                                                                               
PBAMTSN  EQU   (*-PBAMTS)/L'PBAMTS                                              
*                                                                               
         DS    XL64                N/D                                          
*                                                                               
PBJCBEL  DS    XL(JCBLNQ)          COPY OF JCBEL ELEMENT                        
*                                                                               
PBPOSTV  DS    XL(POSTVALL)        POSTVALS BLOCK                               
PBXTRA   DS    XL500               LIST OF EXTRA ELEMENTS                       
PBPTRS   DS    XL500               LIST OF ANALYSIS POINTERS                    
*                                                                               
PBADATAB DS    A                   A(PBDATAB)                                   
PBAACTAB DS    A                   A(PBACTAB)                                   
PBLSTDA  DS    A                   A(CURRENT PBDATAB ENTRY)                     
*                                                                               
PBMAXDA  EQU   400                                                              
PBDATAB  DS    (PBMAXDA)XL5        TABLE OF TRANSACTION D/AS                    
*                                                                               
PBMAXAC  EQU   18                  TABLE OF SAVED CONTRA ACCOUNTS               
PBACTAB  DS    (PBMAXAC)XL(PBACTABL)                                            
*                                                                               
         DS    0D                                                               
PBLKL    EQU   *-PBLKD                                                          
         SPACE 1                                                                
PBBATCHD DSECT                     BATCH VALUES                                 
PBREF    DS    CL4                 REFERENCE NUMBER                             
PBMP     DS    PL2                 MOA PACKED                                   
PBMC     DS    CL2                 MOA CHARACTER                                
PBAREFH  DS    AL4                 A(REFERENCE NUMBER FIELD)                    
PBAMOAH  DS    AL4                 A(MOA FIELD)                                 
PBSECL   DS    XL1                 BATCH SECURITY LEVEL                         
         DS    XL3                 N/D                                          
PBBATCHL EQU   *-PBBATCHD                                                       
         SPACE 1                                                                
PBMNTHSD DSECT                                                                  
PBMREF   DS    CL4                 BATCH REFERENCE                              
PBMMP    DS    PL2                 MOA PWOS                                     
PBMMC    DS    CL2                 MOA CHARACTER FORMAT                         
PBMPCT   DS    PL4                 THIS MONTH PERCENT OF TOTAL                  
PBMAMT   DS    PL6                 AMOUNT (FOR SUMMARY)                         
PBMNTHSL EQU   *-PBMNTHSD                                                       
         SPACE 1                                                                
PBACTABD DSECT                                                                  
PBACKEY  DS    CL14                ACCOUNT KEY                                  
PBACNAM  DS    CL(L'NAMEREC)       ACCOUNT NAME                                 
PBACANC  DS    CL14                SI=ANALYSIS CODE  SJ=COSTING CODE            
PBACOFF  DS    CL2                 CLI/PRO/JOB OFFICE CODE                      
PBACTABL EQU   *-PBACTABD                                                       
         SPACE 1                                                                
***********************************************************************         
* BATCH TYPE LIST                                                     *         
***********************************************************************         
         SPACE 1                                                                
TYPLSTD  DSECT                                                                  
TYPTYPES DS    XL1                 PBTYPES EQUATE                               
TYPSTA2  DS    XL1                 TRNKSTA2 EQUATE                              
TYPSFEE  EQU   X'08'               DUMMY VALUE FOR FEE ADJUSTMENT               
TYPSCIT  DS    XL1                 SCITYPE EQUATE                               
TYPOLY   DS    XL1                 UPDATE OVERLAY NUMBER                        
TYPBTYP  DS    XL1                 BATCH TYPE EQUATE                            
TYPBTYP2 DS    XL1                 BATCH TYPE EQUATE 2 (EG - W/O TIME)          
TYPPBLK  DS    AL2                 DISP. TO BATCH VALUES IN PBLKD               
TYPJCB   DS    AL2                 DISP. TO COUNTER IN JCBELD                   
         DS    XL10                N/D                                          
TYPLSTL  EQU   *-TYPLSTD                                                        
         SPACE 1                                                                
***********************************************************************         
* TRANSACTION POSTINGS VALUE BLOCK                                    *         
***********************************************************************         
         SPACE 1                                                                
POSTVALS DSECT                     TRANSACTION POSTING VALUES BLOCK             
POSTXTRA DS    A                   A(LIST OF EXTRA ELEMENTS)                    
POSTPTRS DS    A                   A(LIST OF ANALYSIS POINTERS)                 
POSTACT  DS    0XL(L'TRNKCULA-1)   ACCOUNT CODE                                 
POSTAUL  DS    XL(L'TRNKUNT+L'TRNKLDG)                                          
POSTAACT DS    XL(L'TRNKACT)                                                    
POSTACTN DS    CL(L'NAMEREC)       ACCOUNT NAME                                 
POSTOFFC DS    CL(L'TRNOFFC)       OFFICE CODE                                  
POSTDATE DS    PL(L'TRNKDATE)      DATE                                         
POSTREF  DS    CL(L'TRNKREF)       BILL NUMBER/REFERENCE                        
POSTAMNT DS    PL6                 AMOUNT                                       
POSTSTAT DS    XL(L'TRNSTAT)       TRANSACTION STATUS                           
POSTTYPE DS    XL(L'TRNTYPE)       TRANSACTION TYPE                             
POSTBILL EQU   7                   CLIENT BILL                                  
POSTFEEA EQU   8                   FEE-ADJUSTMENT                               
POSTWOFF EQU   14                  WRITE-OFF                                    
POSTWOFC EQU   14                  WRITE-OFF (COST - US ONLY)                   
POSTWOFT EQU   57                  WRITE-OFF (TIME - US ONLY)                   
POSTTRNF EQU   34                  JOB TRANSFER                                 
POSTRVAL EQU   79                  REVALUE                                      
POSTMADJ EQU   96                  MATCHING ADJUSTMENT                          
POSTCAC  DS    0XL(L'TRNKCULC)     CONTRA-ACCOUNT                               
POSTCCPY DS    XL(L'TRNKCCPY)                                                   
POSTCUL  DS    XL(L'TRNKCUNT+L'TRNKCLDG)                                        
POSTCACT DS    XL(L'TRNKCACT)                                                   
POSTCACN DS    CL(L'NAMEREC)       CONTRA-ACCOUNT NAME                          
POSTNARR DS    CL(255-TRNLN1Q)                                                  
POSTMODE DS    CL1                 POSTING MODE                                 
POSTLVQ  EQU   C'L'                LIVE                                         
POSTDFQ  EQU   C'D'                DRAFT                                        
POSTBTRF DS    CL4                 BATCH REFERENCE                              
POSTBTMC DS    CL2                 BATCH MONTH - CHARACTER                      
POSTDUED DS    XL2                 DERIVED DUE DATE (COMPRESSED)                
POSTNARL DS    XL1                 LENGTH OF POSTNARR (0 TO CALCULATE)          
POSTIND1 DS    XL(L'TRNINDS1)      ADDTRN CALLER'S INDICATOR BYTE 1             
POSTIND2 DS    XL(L'TRNINDS2)      ADDTRN CALLER'S INDICATOR BYTE 2             
POSTDR   DS    PL8                 TOTAL DEBITS FOR REQUEST                     
POSTCR   DS    PL8                 TOTAL CREDITS FOR REQUEST                    
POSTSTA2 DS    XL1                 EXTRA STATUS FOR BLDTRN                      
POSTALCQ EQU   X'80'               ITEM IS ALLOCATED                            
POSTNALQ EQU   X'40'               ITEM IS NOT ALLOCATED (CLIENT LOK)           
         DS    XL3                 N/D                                          
POSTVALL EQU   *-POSTVALS                                                       
         SPACE 1                                                                
***********************************************************************         
* JOURNAL PRINT LINE DSECT                                            *         
***********************************************************************         
         SPACE 1                                                                
JRNLINED DSECT                                                                  
JRNACT   DS    CL(L'TRNKCULA-1)    ACCOUNT                                      
         DS    CL1                                                              
JRNCAC   DS    CL(L'TRNKCULA-1)    CONTRA-ACCOUNT                               
         DS    CL1                                                              
JRNOFFC  DS    CL(L'TRNOFFC)       OFFICE CODE                                  
         DS    CL2                                                              
JRNDATE  DS    CL8                 TRANSACTION DATE                             
         DS    CL1                                                              
JRNREF   DS    CL(L'TRNKREF)       REFERENCE NUMBER                             
         DS    CL1                                                              
JRNMOA   DS    CL5                 MONTH OF ACTIVITY                            
         DS    CL1                                                              
JRNDR    DS    CL11                DEBIT AMOUNT                                 
         DS    CL1                                                              
JRNCR    DS    CL11                CREDIT AMOUNT                                
         DS    CL1                                                              
JRNSTT   DS    CL12                STATUS                                       
JRNLINEL EQU   *-JRNLINED                                                       
         ORG   JRNDATE                                                          
JRNSUM   DS    CL45                                                             
         ORG   JRNSUM                                                           
JRNDESC  DS    CL20                                                             
         DS    CL1                                                              
JRNLEDG  DS    CL2                                                              
         DS    CL3                                                              
         DS    CL9                                                              
JRNAMNT  DS    CL11                                                             
         EJECT                                                                  
***********************************************************************         
* PARAGRAPH FORMAT TABLE                                              *         
***********************************************************************         
         SPACE 1                                                                
FMTTABD  DSECT                                                                  
FMTFLD   DS    XL1                 DATA/COLUMN CODE                             
FMTSYS   DS    AL1                 SYSTEM CODE FILTER                           
FMTCTRY  DS    AL1                 COUNTRY CODE FILTER                          
FMTINDS1 DS    XL1                 INDICATORS BYTE 1                            
FMTINUM  EQU   X'80'               NUMBER TYPE FIELD                            
FMTIDAT  EQU   X'40'               DATA TYPE FIELD                              
FMTITFP  EQU   X'20'               TOTAL FOR PARAGRAPH FIELD                    
FMTNDECP DS    XL1                 NO. OF DECIMAL PLACES (IF FMTINUM)           
FMTNCURQ EQU   X'FF'               NUMBER IS CURRENCY AMOUNT                    
FMTDIC   DS    AL2                 DICTIONARY REFERENCE NUMBER                  
FMTLINF  DS    AL1                 DEFAULT FIRST LINE NUMBER                    
FMTLINN  DS    AL1                 DEFAULT NUMBER OF LINES                      
FMTLINMN DS    AL1                 MINIMUM NUMBER OF LINES                      
FMTLINMX DS    AL1                 MAXIMUM NUMBER OF LINES                      
FMTCOLF  DS    AL1                 DEFAULT FIRST COLUMN NUMBER                  
FMTCOLN  DS    AL1                 DEFAULT NUMBER OF COLUMNS                    
FMTCOLMN DS    AL1                 MINIMUM NUMBER OF COLUMNS                    
FMTCOLMX DS    AL1                 MAXIMUM NUMBER OF COLUMNS                    
         DS    AL4                 N/D                                          
FMTTABL  EQU   *-FMTTABD                                                        
         SPACE 1                                                                
***********************************************************************         
* FORMAT OPTIONS TABLE                                                *         
***********************************************************************         
         SPACE 1                                                                
FOPTABD  DSECT                                                                  
FOPNUM   DS    AL1                 FORMAT NUMBER                                
FOPDIC   DS    XL2                 DICTIONARY REF#                              
FOPTYPE  DS    XL1                 TYPE OF DATA                                 
FOPTNUM  EQU   X'01'               NUMBER                                       
FOPTKWRD EQU   X'02'               KEYWORD                                      
FOPTFREE EQU   X'03'               FREE FORM TEXT                               
FOPDISP  DS    AL1                 DISP. IN BOFELD (OR 0)                       
FOPDEF   DS    AL1                 DEFAULT VALUE                                
         DS    AL3                 N/D                                          
FOTINF   DS    0XL24               TYPE INFORMATION                             
*                                                                               
         ORG   FOTINF              * FOPTYPE=FOPTNUM *                          
FOPNMIN  DS    XL1                 MINIMUM VALUE OF NUMBER                      
FOPNMAX  DS    XL1                 MAXINUM VALUE OF NUMBER                      
         ORG   FOTINF+L'FOTINF                                                  
*                                                                               
         ORG   FOTINF              * FOPTYPE=FOPTKWRD *                         
FOPKLIST DS    0XL5                LIST OF KEYWORDS/VALUES                      
FOPKWRD  DS    XL2                 DISP. TO KEYWORD                             
FOPKLEN  DS    AL1                 LENGTH OF KEYWORD                            
FOPKTYPE DS    AL1                 TYPE OF VALUE                                
FOPKON   EQU   X'01'               FOPKVAL MUST BE 'ON'                         
FOPKOFF  EQU   X'02'               FOPKVAL MUST BE 'OFF'                        
FOPKEQU  EQU   X'03'               FOPKVAL MUST BE EQUAL                        
FOPKVAL  DS    AL1                 VALUE OF KEYWORD                             
         ORG   FOTINF+L'FOTINF                                                  
*                                                                               
         ORG   FOTINF              * FOPTYPE=FOPTFREE *                         
FOPFTYPE DS    XL1                 FFTELD ELEMENT TYPE                          
FOPFDEF  DS    AL2                 DISP. TO DEFAULT VALUE                       
FOPFBLK  DS    AL2                 DISP. TO FIELD IN FMTBLKD                    
FOPFLEN  DS    XL1                 LENGTH OF FIELD                              
         ORG   FOTINF+L'FOTINF                                                  
*                                                                               
FOPTABL  EQU   48                                                               
         ORG   FOPTABD+FOPTABL                                                  
FOPTABN  EQU   64                  MAXIMUM NUMBER OF TABLE ENTRIES              
         SPACE 1                                                                
***********************************************************************         
* FMTBLK ROUTINE ACTION EQUATES                                       *         
***********************************************************************         
         SPACE 1                                                                
FBGET    EQU   X'01'               GET FBLK FROM RECORD                         
FBPUT    EQU   X'02'               PUT FBLK DETAILS INTO RECORD                 
FBVAL    EQU   X'03'               VALIDATE FORMAT OPTION                       
FBDIS    EQU   X'04'               DISPLAY FORMAT OPTION                        
FBFOP    EQU   X'05'               GET FORMAT OPTION TABLE ENTRY                
         SPACE 1                                                                
***********************************************************************         
* FORMAT BLOCK (USED BY FMTBLK ROUTINE)                               *         
***********************************************************************         
         SPACE 1                                                                
FBLKD    DSECT                                                                  
FBLK     DS    0XL512                                                           
FBNUMB   DS    XL1                 FORMAT NUMBER                                
FBLANG   DS    XL1                 LANGUAGE CODE                                
FBGRPB   DS    XL1                 GROUPING BASIS                               
         DS    XL6                 N/D                                          
FBNAME   DS    CL36                NAME                                         
FBBOFEL  DS    XL(BOFLNQ)          COPY OF BOFELD ELEMENT                       
         DS    XL40                N/D                                          
FBDEFLQ  EQU   20                  LENGTH OF DEFAULT HEADLINES                  
FBPNET   DS    CL20                PRINT NAME FOR NET                           
FBPCMN   DS    CL20                PRINT NAME FOR COMMISSION                    
FBPGRS   DS    CL20                PRINT NAME FOR GROSS                         
FBPDIS   DS    CL20                PRINT NAME FOR DISCOUNT                      
FBPSUR   DS    CL20                PRINT NAME FOR SURCHARGE                     
FBTHED   DS    CL36                TIME HEADING                                 
FBCHED   DS    CL36                COST HEADING                                 
FBPVAT   DS    CL36                PRINT NAME FOR VAT                           
FBPINT   DS    CL36                PRINT NAME FOR INVOICE TOTAL                 
FBPCST   DS    CL36                PRINT NAME FOR COST SUB-TOTAL                
FBPTIM   DS    CL36                PRINT NAME FOR TIME SUB-TOTAL                
FBPBST   DS    CL36                PRINT NAME FOR BILL SUB-TOTAL                
FBPPRV   DS    CL36                PRINT NAME FOR PREVIOUS BILLING              
         DS    XL19                N/D                                          
         ORG   FBLK+L'FBLK                                                      
FBLKX    DS    0X                                                               
FBLKL    EQU   *-FBLKD                                                          
         EJECT                                                                  
***********************************************************************         
* COLUMN TABLE                                                        *         
***********************************************************************         
         SPACE 1                                                                
CLMTABD  DSECT                                                                  
CLMHEAD  DS    0X                  ** TABLE HEADER **                           
CLMNUMB  DS    XL1                 TABLE NUMBER                                 
CLMLEN   DS    XL2                 LENGTH OF SUB-TABLE                          
CLMGENM  DS    XL2                 GENERAL COLUMN MASK (SEE MIXLGEN)            
CLMGALLQ EQU   X'0000'             VALID FOR ALL LISTS                          
CLMGTRNQ EQU   X'0001'             VALID FOR TRANSACTION LISTS ONLY             
         DS    XL1                 N/D                                          
CLMHEADL EQU   *-CLMHEAD                                                        
*                                                                               
         ORG   CLMTABD                                                          
CLMDATA  DS    0X                  ** DATA ENTRY **                             
CLMCHAR  DS    XL1                 CHARACTER CODE FOR DIS= OPTION               
CLMRTN   DS    XL1                 VALIDATE/DISPLAY ROUTINE NUMBER              
CLMRGEN  EQU   X'80'               ON IF GENERAL DISPLAY ROUTINE                
CLMHLP   DS    XL1                 HELP PANEL NO.                               
CLMSEC   DS    XL1                 SECURITY REFERENCE NO.                       
CLMINDS1 DS    XL1                 * INDICATORS BYTE 1 *                        
CLMIDDS  EQU   X'80'               DDS ONLY                                     
CLMIKEY  EQU   X'40'               KEY TYPE COLUMN - ALWAYS ON SCEEN            
CLMIPRO  EQU   X'20'               COLUMN IS ALWAYS PROTECTED                   
CLMIAMT  EQU   X'10'               AMOUNT TYPE COLUMN                           
CLMIHEAD EQU   X'08'               OVERLAY CAN SET HEADLINE                     
CLMIENQ  EQU   X'04'               ENQUIRY COLUMN                               
CLMITOT  EQU   X'02'               COLUMN IS VALID FOR TOTAL LINE               
CLMISCR  EQU   X'01'               COLUMN IS VALID FOR SCREEN TOTAL             
CLMINDS2 DS    XL1                 * INDICATORS BYTE 2 *                        
CLMIEOP  EQU   X'80'               MULTI INPUTABLE TO END OF PAGE               
CLMIEOL  EQU   X'40'               MULTI INPUTABLE TO END OF LIST               
CLMIDEFO EQU   X'20'               COLUMN DEFAULTS TO BE OPEN                   
CLMIPROR EQU   X'10'               USE PRORATA DISPLAY ROUTINE                  
CLMINONE EQU   X'08'               NO INPUT IS A VALID INPUT                    
CLMIAGYC EQU   X'04'               SHOW AGY CUR COL IF IN FOREIGN CUR           
CLMHWDTH DS    XL1                 COLUMN HEADING WIDTH                         
CLMFWDTH DS    XL1                 COLUMN FIELD WIDTH                           
CLMFDSP  DS    XL1                 DISPLACEMENT TO FIELD WITHIN HEADING         
CLMHFHXT DS    XL1                 HEADING EXTENDED ATTRIBUTE BYTE              
CLMFFHAT DS    XL1                 INPUT FIELD ATTRIBUTE BYTE                   
CLMFFHXA DS    XL1                 INPUT FIELD EXTENDED ATTRIBUTE BYTE          
CLMFMINL DS    XL1                 MINUMUM INPUT FIELD LENGTH                   
CLMNHWDH DS    XL1                 NARROW COLUMN HEADING WIDTH                  
CLMNFWDH DS    XL1                 NARROW COLUMN FIELD WIDTH                    
CLMNFDSP DS    XL1                 DISP TO FIELD WITHIN NARROW HEADING          
CLMMASK  DS    XL2                 INVALID MASK VALUES (SEE CSMASK)             
CLMAPROR DS    XL2                 DISP TO AGENCY PRORATA AMOUNT                
CLMFPROR DS    XL2                 DISP TO FOREIGN AMOUNT (CLMIPROR ON)         
CLMCTRY  DS    XL1                 COUNTRY FILTER                               
CLMDRTN  DS    XL1                 DISPLAY ROUTINE (IF NOT CLMRTN)              
CLMVORD  DS    XL1                 VALIDATION ORDER # (255 1ST, 0 LAST)         
         DS    XL3                 N/D                                          
CLMHEAD1 DS    XL4                 DCDD FOR COLUMN HEADING 1                    
CLMHEAD2 DS    XL4                 DCDD FOR COLUMN HEADING 2                    
CLMDATAL EQU   *-CLMDATA                                                        
         SPACE 1                                                                
***********************************************************************         
* MULTI-INPUT FIELD ELEMENT                                           *         
***********************************************************************         
         SPACE 1                                                                
MIFELD   DSECT                                                                  
MIFEL    DS    XL1                 ELEMENT CODE=COLUMN CHARACTER                
MIFLN    DS    XL1                 ELEMENT LENGTH                               
MIF#LO   DS    XL2                 LOW RECORD NUMBER                            
MIF#HI   DS    XL2                 HIGH RECORD NUMBER                           
MIFQUALN DS    XL1                 LENGTH OF DATA QUALIFIER                     
MIFFLDLN DS    XL1                 LENGTH OF FIELD QUALIFIER                    
MIFLNQ   EQU   *-MIFELD                                                         
MIFQUA   DS    0X                  DATA QUALIFIER                               
MIFFLD   DS    0X                  FIELD VALUE                                  
         SPACE 1                                                                
***********************************************************************         
* FIELD DSECTS                                                        *         
***********************************************************************         
         SPACE 1                                                                
FOOTLIND DSECT                     ** FOOTLINE FIELD **                         
FOOTLINH DS    XL8                 FIELD HEADER                                 
FOOTLIN  DS    CL79                OUTPUT FIELD                                 
FOOTLINX DS    XL8                 EXTENDED HEADER                              
FOOTLINL EQU   *-FOOTLIND                                                       
         SPACE 1                                                                
SUBINPD  DSECT                     ** SUB-ACTION INPUT FIELD **                 
SUBINPH  DS    XL8                 FIELD HEADER                                 
SUBINP   DS    CL3                 INPUT FIELD                                  
SUBINPX  DS    XL8                 EXTENDED HEADER                              
SUBINPL  EQU   *-SUBINPD                                                        
         EJECT                                                                  
***********************************************************************         
* TERMINAL WORK AREA DSECT                                            *         
***********************************************************************         
         SPACE 1                                                                
TWAD     DSECT                                                                  
         ORG   TWAPPLIC                                                         
         ORG   TWASCR                                                           
       ++INCLUDE ACCLBFFD                                                       
TWAOVER  DS    0X                                                               
*                                                                               
         ORG   BSDICT                                                           
BSDICTU  DS    0CL1024             ** UPPER CASE EXPRESSIONS **                 
UC@PFKEY DS    CL2,C               PF                                           
UC@ALTPF DS    CL8                 ALTPFS                                       
UC@HELP  DS    CL4                 HELP                                         
UC@PAGE  DS    CL(ACTNAMLQ)        PAGE                                         
UC@HALF  DS    CL(ACTNAMLQ)        HALF                                         
UC@MAX   DS    CL(ACTNAMLQ)        MAX                                          
UC@SETUP DS    CL(ACTNAMLQ)        SETUP                                        
UC@UPDT  DS    CL(ACTNAMLQ)        UPDATE                                       
UC@ALLOC DS    CL(ACTNAMLQ)        ALLOCATE                                     
UC@CHG   DS    CL(ACTNAMLQ)        CHANGE                                       
UC@EDIT  DS    CL(ACTNAMLQ)        EDIT                                         
UC@XFR   DS    CL(ACTNAMLQ)        TRANSFER                                     
UC@WRTF  DS    CL(ACTNAMLQ)        WRITEOFF                                     
UC@ZOOM  DS    CL(ACTNAMLQ)        ZOOM                                         
*                                                                               
UC3DSP   DS    CL3                 DIS                                          
UC8DSP   DS    CL(ACTNAMLQ)        DISPLAY                                      
UC@RETRN DS    CL(ACTNAMLQ)        QUIT (RETURN)                                
UC@NEXT  DS    CL(ACTNAMLQ)        NEXT                                         
UC@FRMAT DS    CL(ACTNAMLQ)        FORMAT                                       
UC@ENQ   DS    CL(ACTNAMLQ)        ENQUIRE                                      
UC@LIST  DS    CL(ACTNAMLQ)        LIST                                         
UC@ZMWO  DS    CL(ACTNAMLQ)        ZOOM/WO                                      
UC@AUTO  DS    CL6                 AUTO (FOR UPDATE SCREEN)                     
UC@ADD   DS    CL(ACTNAMLQ)        ADD                                          
UC@YES   DS    CL3                 YES                                          
UC@NO    DS    CL3                 NO                                           
UC@DEL   DS    CL(ACTNAMLQ)        DELETE                                       
UC@FIND  DS    CL8                 FIND                                         
UC@COLS  DS    CL8                 COLUMNS                                      
UC@ALL   DS    CL8                 ALL                                          
UC@PREFX DS    CL8                 PREFFIX                                      
UC@SUFFX DS    CL8                 SUFFIX                                       
UC@WORD  DS    CL8                 WORD                                         
UC@FIRST DS    CL8                 FIRST                                        
UC@LAST  DS    CL8                 LAST                                         
UC@RESET DS    CL8                 RESET                                        
UC@PRV   DS    CL8                 PREVIOUS                                     
UC@CLEAR DS    CL6                 CLEAR                                        
UC@PRGRP DS    CL9                 PARAGRAPH                                    
UC@ONLY  DS    CL4                 ONLY                                         
UC3AUTHD DS    CL3                 AUTHD                                        
UC8AUTHD DS    CL8                 AUTHD                                        
UC3HELD  DS    CL3                 HELD                                         
UC8HELD  DS    CL8                 HELD                                         
UC3ZMWO  DS    CL3                 ZOOM/WO                                      
UC2WC    DS    CL2,CL1             WC                                           
UC8WC    DS    CL8                 WC                                           
UC3TYPE  DS    CL3                 TYPE                                         
UC8TYPE  DS    CL8                 TYPE                                         
UC3REF   DS    CL3                 REF                                          
UC8REF   DS    CL8                 REF                                          
UC3DATE  DS    CL3                 DATE                                         
UC8DATE  DS    CL8                 DATE                                         
UC3BAT   DS    CL3                 BATCH                                        
UC8BAT   DS    CL8                 BATCH                                        
UC3MOA   DS    CL3                 MOA                                          
UC8MOA   DS    CL8                 MOA                                          
UC3AMT   DS    CL3                 AMT                                          
UC8AMT   DS    CL8                 AMOUNT                                       
UC3SWCH  DS    CL3                 SWITCH                                       
UC8SWCH  DS    CL8                 SWITCH                                       
UC3CMN   DS    CL3                 COMMISSION                                   
UC8CMN   DS    CL8                 COMMISSION                                   
UC@ADVNC DS    CL8                 ADVANCE                                      
UC@CNTRL DS    CL8                 CONTROL                                      
UC3WHOLE DS    CL3                 WHOLE                                        
UC8WHOLE DS    CL8                 WHOLE                                        
UC@LEFT  DS    CL8                 LEFT                                         
UC@CENTR DS    CL8                 CENTRE                                       
UC@RIGHT DS    CL8                 RIGHT                                        
UC@MMIZE DS    CL8                 MAXIMIZE                                     
UC@SEL   DS    CL8                 SELECT                                       
UC@RSR   DS    CL8                 RESTORE                                      
UC@JOB   DS    CL8                 JOB                                          
UC@BIL   DS    CL8                 BILL                                         
UC@DRAFT DS    CL8                 DRAFT                                        
UC@LIVE  DS    CL8                 LIVE                                         
UC@RFRSH DS    CL(ACTNAMLQ)        REFRESH                                      
UC3WCTOT DS    CL3                 WCT                                          
UC8WCTOT DS    CL8                 WCTOT                                        
UC@PRINT DS    CL(ACTNAMLQ)        PRINT                                        
UC@HEADR DS    CL(ACTNAMLQ)        HEADER                                       
UC@TIME  DS    CL8                 TIME                                         
UC@COST  DS    CL8                 COST                                         
UC8BLD   DS    CL8                 BILLED                                       
UC3BLD   DS    CL3                 BILLED                                       
UC@FEE   DS    CL8                 FEE                                          
UC@AUFRM DS    CL8                 AUTOFORM                                     
UC@SMY   DS    CL8                 SUMMARY                                      
UC@FRFRM DS    CL8                 FREEFORM                                     
UC@LSPAR DS    CL8                 LISTPARA                                     
UC@FMLST DS    CL8                 FORMLIST                                     
UC@PRBL  DS    CL8                 PREVBILL                                     
UC@RVRS  DS    CL8                 REVERSE                                      
UC@REVLU DS    CL8                 REVALUE                                      
UC@CURRY DS    CL8                 CURRENCY                                     
UC@MCH   DS    CL8                 MATCH                                        
UC@INV   DS    CL8                 INVOICE                                      
UC@AUTAL DS    CL(ACTNAMLQ)        AUTO ALLOCATE                                
UC@ZMWR  DS    CL(ACTNAMLQ)        ZOOMWR                                       
UC@EXCD1 DS    CL8                 EXCLUDED                                     
UC@EXCD2 DS    CL4                 X                                            
UC@AUTUL DS    CL(ACTNAMLQ)        AUTO UNALLOCATE                              
UC3CURRY DS    CL3                 CURRENCY                                     
UC@RATE  DS    CL4                 RATE                                         
UC@ALPHA DS    CL8                 ALPHA(NUMERICAL)                             
UC@BOTH  DS    CL8                 BOTH                                         
UC@FRN   DS    CL8                 FOREIGN                                      
UC@GROUP DS    CL8                 GROUP                                        
UC@RPRNT DS    CL8                 REPRINT                                      
UC@NONE  DS    CL8                 NONE                                         
UC@CLIBG DS    CL15                CLIENT BILLING                               
UC@LABOR DS    CL8                 LABOR                                        
UC@WKTYP DS    CL8                 WKTYPE                                       
UC@TOJOB DS    CL5                 TO JOB                                       
UC@RCVR  DS    CL(ACTNAMLQ)        RECOVERY                                     
UC3ZMWR  DS    CL3                 ZOOM WRITE OFF RECOVERY                      
UC@UNAV  DS    CL8                 UNAVAILABLE                                  
UC@PART  DS    CL3                 PARTIAL                                      
UC3ACTYD DS    CL3                 ACTDATE                                      
UC8ACTYD DS    CL8                 ACTDATE                                      
UC3CTR   DS    CL3                 CONTRA                                       
UC8CTR   DS    CL8                 CONTRA                                       
UC@TOWC  DS    CL4                 TO WC                                        
UC@INT   DS    CL8                 INTERNAL                                     
UC@EXT   DS    CL8                 EXTERNAL                                     
UC3AUREV DS    CL3                 AR (AUTOREV)                                 
UC8AUREV DS    CL8                 AUTOREV                                      
UC@FEEL  DS    CL(ACTNAMLQ)        FEE LIST                                     
UC@WRTB  DS    CL(ACTNAMLQ)        WRITE-BACK                                   
UC8HELP  DS    CL(ACTNAMLQ)        HELP                                         
UC@INTIV DS    CL(ACTNAMLQ)        INTINV                                       
UC@INTLS DS    CL(ACTNAMLQ)        INTLIST                                      
UC@JOBLI DS    CL(ACTNAMLQ)        JOBLIST                                      
UC@FOPTS DS    CL(ACTNAMLQ)        FORMOPTS                                     
UC@OPTS  DS    CL8                 OPTIONS                                      
         ORG   BSDICTU+L'BSDICTU                                                
*                                                                               
BSDICTL  DS    0CL2560             ** MIXED CASE EXPRESSIONS **                 
LC@SETUP DS    CL(ACTNAMLQ)        SETUP                                        
LC@UPDT  DS    CL(ACTNAMLQ)        UPDATE                                       
LC@ALLOC DS    CL(ACTNAMLQ)        ALLOCATE                                     
LC@CHG   DS    CL(ACTNAMLQ)        CHANGE                                       
LC@EDIT  DS    CL(ACTNAMLQ)        EDIT                                         
LC@XFR   DS    CL(ACTNAMLQ)        TRANSFER                                     
LC@WRTF  DS    CL(ACTNAMLQ)        WRITEOFF                                     
LC@ZOOM  DS    CL(ACTNAMLQ)        ZOOM                                         
LC@UP    DS    CL(ACTNAMLQ)        UP                                           
LC@DOWN  DS    CL(ACTNAMLQ)        DOWN                                         
LC@LEFT  DS    CL(ACTNAMLQ)        LEFT                                         
LC@RIGHT DS    CL(ACTNAMLQ)        RIGHT                                        
LC@ALTPF DS    CL(ACTNAMLQ)        ALTPF                                        
LC@RETRN DS    CL(ACTNAMLQ)        QUIT (RETRN)                                 
LC@NEXT  DS    CL(ACTNAMLQ)        NEXT                                         
LC@FRMAT DS    CL(ACTNAMLQ)        FORMAT                                       
LC@ENQ   DS    CL(ACTNAMLQ)        ENQUIRE                                      
LC@LIST  DS    CL(ACTNAMLQ)        LIST                                         
LC@ZMWO  DS    CL(ACTNAMLQ)        ZOOM/WO                                      
LC@FIND  DS    CL(ACTNAMLQ)        FIND                                         
LC@PRV   DS    CL(ACTNAMLQ)        PREVIOUS                                     
LC@PRGRP DS    CL(ACTNAMLQ)        PARAGRAPH                                    
LC@ADD   DS    CL(ACTNAMLQ)        ADD                                          
LC@LINE  DS    CL5                 LINE                                         
LC@LINES DS    CL5                 LINES                                        
LC@OF    DS    CL2,CL1             OF                                           
LC@ALCTD DS    CL10                ALLOCATED                                    
LC@CHGS  DS    CL8                 CHARGES                                      
LC@BLD   DS    CL8                 BILLED                                       
LC@WRTFS DS    CL8                 WRITE-OFFS                                   
LC@YES   DS    CL3                 YES                                          
LC@CLEAR DS    CL6                 CLEAR                                        
LC3ZMWO  DS    CL3                 ZOOM/WO                                      
LC@ADVNC DS    CL8                 ADVANCE                                      
LC@DSP   DS    CL(ACTNAMLQ)        DISPLAY                                      
LC@CNTRL DS    CL8                 CONTROL                                      
LC@RFRSH DS    CL(ACTNAMLQ)        REFRESH                                      
LC8CLEAR DS    CL8                 CLEAR                                        
LC@PRINT DS    CL8                 PRINT                                        
LC@TOTAL DS    CL5                 TOTAL                                        
LC@SAVE  DS    CL8                 SAVE                                         
LC@SEL   DS    CL8                 SELECT                                       
LC@DRAFT DS    CL8                 DRAFT                                        
LC@FEE   DS    CL8                 FEE                                          
LC@AUFRM DS    CL8                 AUTOFORM                                     
LC@SMY   DS    CL8                 SUMMARY                                      
LC@FRFRM DS    CL8                 FREEFORM                                     
LC@LSPAR DS    CL8                 LISTPARA                                     
LC@FMLST DS    CL8                 FORMLIST                                     
LC@PRBL  DS    CL8                 PREVBILL                                     
LC@RVRS  DS    CL8                 REVERSE                                      
LC@REVLU DS    CL8                 REVALUE                                      
LC@LIVE  DS    CL8                 LIVE                                         
LC@BILC  DS    CL7                 BILL NO                                      
LC@CLIBG DS    CL15                CLIENT BILLING                               
LC@TIME  DS    CL8                 TIME                                         
LC@COST  DS    CL8                 COST                                         
LC@MCH   DS    CL8                 MATCH                                        
LC@INV   DS    CL8                 INVOICE                                      
LC@DFLST DS    CL11                DRAFT LIST                                   
LC@LVLST DS    CL11                LIVE LIST                                    
LC@AUTAL DS    CL(ACTNAMLQ)        AUTO ALLOCATE                                
LC@ZMWR  DS    CL(ACTNAMLQ)        ZOOMWR                                       
LC@EXCD1 DS    CL8                 EXCLUDED                                     
LC@EXCD2 DS    CL4                 X                                            
LC@AUTUL DS    CL(ACTNAMLQ)        AUTO UNALLOCATE                              
HD@NET   DS    CL(FBDEFLQ)         NET                                          
HD@CMN   DS    CL(FBDEFLQ)         COMMISSION                                   
HD@GROSS DS    CL(FBDEFLQ)         GROSS                                        
HD@SRCRG DS    CL(FBDEFLQ)         SURCHARGE                                    
HD@DISS  DS    CL(FBDEFLQ)         DISCOUNT                                     
HD@TIME  DS    CL(FBDEFLQ)         TIME                                         
HD@COST  DS    CL(FBDEFLQ)         COST                                         
LC@BIL   DS    CL8                 BILL                                         
LC@MORE  DS    CL8                 MORE                                         
LC@CNFRM DS    CL8                 CONFIRM                                      
LC@GROUP DS    CL8                 GROUP                                        
LC@RPRNT DS    CL8                 REPRINT                                      
LC@BLB   DS    CL8                 BILLABLE                                     
LC@PF7ZW DS    CL16                PF7 TO ZOOMWO                                
LC@RCVR  DS    CL(ACTNAMLQ)        RECOVERY                                     
LC3ZMWR  DS    CL3                 ZOOM WRITE OFF RECOVERY                      
LC@NRTV  DS    CL15                NARRATIVE                                    
LC@WRTN  DS    CL15                WRITE-OFF NARRATIVE                          
LC@FLT   DS    CL8                 FILTER                                       
LC@TLST  DS    CL15                TOTAL FOR LIST                               
LC@TTIME DS    CL15                TOTAL TIME                                   
LC@TOOPS DS    CL15                TOTAL OOPS                                   
LC@PF4FL DS    CL16                PF4 TO FILTER                                
LC@AUREV DS    CL8                 AUTOREV                                      
LC@FEEL  DS    CL(ACTNAMLQ)        FEE LIST                                     
HD@VAT   DS    CL(FBDEFLQ)         VAT                                          
HD@STTIM DS    CL(FBDEFLQ)         TIME SUBTOTAL                                
HD@STCST DS    CL(FBDEFLQ)         COST SUBTOTAL                                
HD@INVT2 DS    CL(FBDEFLQ)         INVOICE TOTAL                                
LC@TSCR  DS    CL20                TOTAL FOR SCREEN                             
LC@NALLC DS    CL12                *NOTALLOC*                                   
LC@COLS  DS    CL(ACTNAMLQ)        COLUMNS                                      
LC@NO    DS    CL3                 NO                                           
LC@ALL   DS    CL5                 ALL                                          
LC@ONLY  DS    CL4                 ONLY                                         
LC@ACT   DS    CL3                 ACT                                          
LC4LINE  DS    CL4                 LINE                                         
LC4OF    DS    CL4                 OF                                           
LC@WRTB  DS    CL(ACTNAMLQ)        WRITE-BACK                                   
LC@PAGE  DS    CL(ACTNAMLQ)        PAGE                                         
LC@HALF  DS    CL(ACTNAMLQ)        HALF                                         
LC@MAX   DS    CL(ACTNAMLQ)        MAX                                          
LC8HELP  DS    CL(ACTNAMLQ)        HELP                                         
LC@TEXT  DS    CL12                TEXT                                         
LC@ENPAR DS    CL20                END OF PARAGRAPH                             
LC@INTIV DS    CL(ACTNAMLQ)        INTINV                                       
LC@INTLS DS    CL(ACTNAMLQ)        INTLIST                                      
LC@JOBB  DS    CL11                JOB BALANCE                                  
LC@JOBLI DS    CL(ACTNAMLQ)        JOBLIST                                      
PS@PSTGU DS    CL45                POSTING SUMMARY                              
PS@INCCR DS    CL20                INCOME ACCRUALS                              
PS@INCM  DS    CL20                BILLING                                      
PS@BLG   DS    CL20                INCOME                                       
PS@XFRS  DS    CL20                TRANSFERS                                    
PS@WRTFS DS    CL20                WRITE-OFFS                                   
PS@SRCRG DS    CL20                SURCHARGE                                    
PS@DISS  DS    CL20                DISCOUNT                                     
PS@VAT1  DS    CL20                VAT                                          
LC@FOPTS DS    CL(ACTNAMLQ)        FORMOPTS                                     
LC@OPTS  DS    CL8                 OPTIONS                                      
HD@STBIL DS    CL(FBDEFLQ)         BILL SUB-TOTAL                               
HD@PRVBL DS    CL(FBDEFLQ)         PREVIOUS BILLING                             
         ORG   BSDICTL+L'BSDICTL                                                
BSDICTX  DS    0C                  ** END OF DICTIONARY WORDS **                
         SPACE 1                                                                
***********************************************************************         
* USED BY OVERLAYS                                                    *         
***********************************************************************         
         SPACE 1                                                                
         ORG   OSVALS2                                                          
         ORG   OSVALS2+OSVALS2L                                                 
         SPACE 1                                                                
***********************************************************************         
* SECURITY BLOCK                                                      *         
***********************************************************************         
         SPACE 1                                                                
         ORG   SECBLK                                                           
         ORG   SECBLK+SECBLKL                                                   
         SPACE 1                                                                
***********************************************************************         
* LIST SUB-CONTROLLER SAVED VALUES                                    *         
***********************************************************************         
         SPACE 1                                                                
LSSAVE   DS    XL1536                                                           
LSSAVEL  EQU   *-LSSAVE                                                         
         SPACE 1                                                                
         ORG   TWAD+X'4000'        END OF USABLE TWA                            
         SPACE 1                                                                
***********************************************************************         
* GLOBAL W/S REDEFINITIONS                                            *         
***********************************************************************         
         SPACE 1                                                                
WORKD    DSECT                                                                  
         ORG   BCBPROF1                                                         
BCP101   DS    CL1                                                              
BCP102   DS    CL1                                                              
BCP103   DS    CL1                                                              
BCP104   DS    CL1                                                              
BCP105   DS    CL1                                                              
BCP106   DS    CL1                                                              
BCP107   DS    CL1                                                              
BCP108   DS    CL1                                                              
BCP109   DS    CL1                                                              
BCP110   DS    CL1                                                              
BCP111   DS    CL1                                                              
BCP112   DS    CL1                                                              
BCP113   DS    CL1                                                              
BCP114   DS    CL1                                                              
BCP115   DS    CL1                                                              
BCP116   DS    CL1                                                              
         ORG   BCBPROF2                                                         
BCP201   DS    CL1                                                              
BCP202   DS    CL1                                                              
BCP203   DS    CL1                                                              
BCP204   DS    CL1                                                              
BCP205   DS    CL1                                                              
BCP206   DS    CL1                                                              
BCP207   DS    CL1                                                              
BCP208   DS    CL1                                                              
BCP209   DS    CL1                                                              
BCP210   DS    CL1                                                              
BCP211   DS    CL1                                                              
BCP212   DS    CL1                                                              
BCP213   DS    CL1                                                              
BCP214   DS    CL1                                                              
BCP215   DS    CL1                                                              
BCP216   DS    CL1                                                              
*                                                                               
*                                  ** UK PROFILES **                            
P#RETDAY EQU   BCP101              NON-STANDARD RETENTION DAYS                  
P#RESETM EQU   BCP102              RESET BILL# AT MONTH END                     
P#MANBIL EQU   BCP103              DISALLOW MANUAL BILL NUMBERS                 
P#BACKDT EQU   BCP104              BACKDATED BILLS - MAXIMUM DAYS               
P#DISORD EQU   BCP105              DISPLAY ORDERS - NO,**,MERGE                 
P#LOKJOB EQU   BCP106              WARN/PREVENT BILL ON LOCK JOB                
P#UNAUTH EQU   BCP107              PREVENT ALLOC OF UNAUTH ITEMS                
P#VATSCH EQU   BCP108              VAT ON SURCHARGE                             
P#DQU    EQU   BCP109              DQU FROM DRAFT/LIVE                          
P#FREVFI EQU   BCP110              FORCE REVALUATION OF FOREIGN INVOICE         
P#DUPEOK EQU   BCP115              ALLOW DUPLICATE BILL NUMBERS                 
*                                                                               
*                                  ** US PROFILES **                            
P#SKLABR EQU   BCP101              TREAT SK AS LABOUR                           
*                                                                               
         ORG   BCLSTLV1            ** USING LIST ENTRIES HERE **                
BCLSTMAT DS    XL(TLMT1LNQ)        TSAR ENTRY FOR MATCH RECORD                  
*                                                                               
         ORG   BCLSTLV3                                                         
*                                                                               
BCCLI    DS    0X                  ** CLIENT VALUES **                          
BCCLICOD DS    CL12                CLIENT CODE                                  
BCCLINAM DS    CL36                CLIENT NAME                                  
BCCLIOFF DS    CL2                 CLIENT OFFICE CODE                           
         DS    XL1                 N/D                                          
BCCLIDA  DS    XL4                 CLIENT RECORD DISK ADDRESS                   
BCCLIL   EQU   *-BCCLI                                                          
*                                                                               
BCPRO    DS    0X                  ** PRODUCT VALUES **                         
BCPROCOD DS    CL12                PRODUCT CODE (CLIENT+PRODUCT)                
BCPRONAM DS    CL36                PRODUCT NAME                                 
BCPROOFF DS    CL2                 PRODUCT OFFICE CODE                          
         DS    XL1                 N/D                                          
BCPRODA  DS    XL4                 PRODUCT RECORD DISK ADDRESS                  
BCPROL   EQU   *-BCPRO                                                          
*                                                                               
BCJOB    DS    0X                  ** JOB VALUES **                             
BCJOBCOD DS    CL12                JOB CODE (CLIENT+PRODUCT+JOB)                
BCJOBNAM DS    CL36                JOB NAME                                     
BCJOBOFF DS    CL2                 JOB OFFICE CODE                              
BCJOBSTA DS    XL1                 JOB STATUS                                   
BCJOBSCB EQU   X'80'               ON=CLIENT BILLING                            
BCJOBBNO EQU   X'40'               ON=BILL NUMBER FROM OFFICE RECORD            
BCJOBBNL EQU   X'20'               ON=BILL NUMBER FROM LEDGER RECORD            
BCJOBBNM EQU   X'10'               ON=BILL NUMBER FROM MEDIA RECORD             
BCJOBBNA EQU   X'08'               ON=BILL NUMBER MUST BE INPUT                 
BCJOBPEN EQU   X'04'               ON=AMOUNT PENDING ON JOB                     
         DS    XL2                 N/D                                          
BCJOBDA  DS    XL4                 JOB RECORD DISK ADDRESS                      
BCJOBL   EQU   *-BCJOB                                                          
*                                                                               
BCPRFS   DS    0CL(PPRUWRK-PPREL)  * PRODUCTION PROFILES *                      
*                                                                               
BCCLIPRF DS    CL(PPRUWRK-PPREL)   CLIENT PROFILE ELEMENT                       
*                                                                               
BCPROPRF DS    CL(PPRUWRK-PPREL)   PRODUCT PROFILE ELEMENT                      
*                                                                               
BCJOBPRF DS    CL(PPRUWRK-PPREL)   JOB PROFILE ELEMENT                          
*                                                                               
BCCMPPRF DS    CL(PPRUWRK-PPREL)   COMPOSITE PROFILE ELEMENT                    
*                                                                               
BCPRFSL  EQU   *-BCPRFS                                                         
*                                                                               
         ORG   WORKX                                                            
WORKREP  DS    XL(REPX-REPD)       FAREPORT WORK AREA                           
*                                                                               
WCDATA   DS    0XL128              ** WORK-CODE DATA **                         
WCCODE   DS    CL2                 WORK-CODE                                    
WCEL     DS    XL(WCOLNQ)          WORK CODE ELEMENT (WCOEL)                    
WCNAME   DS    CL36                EXTRA NAME                                   
WCTYPE   DS    CL1                 WORK CODE TYPE (FROM GETOPT CALL)            
         ORG   WCDATA+L'WCDATA                                                  
         DS    0D                                                               
*                                                                               
LSVALS   DS    XL(LSVALSL)         LIST SUB-CONTROLLER VALUES                   
         DS    0D                                                               
WORKL    EQU   *-WORKD                                                          
         EJECT                                                                  
GOBBLCKD DSECT                                                                  
       ++INCLUDE ACGOBBLOCK                                                     
         EJECT                                                                  
PRORATAD DSECT                                                                  
       ++INCLUDE ACPRORATAD                                                     
         EJECT                                                                  
***********************************************************************         
* LIST SUB-CONTROLLER SAVE VALUES                                     *         
***********************************************************************         
         SPACE 1                                                                
LSVALSD  DSECT                                                                  
*                                                                               
LSTLST   DS    XL(L'TLST)          TSAR LIST RECORD DATA                        
*                                                                               
LSDIS    DS    0XL65               ** DIS= INFORMATION **                       
LSDISN   DS    XL1                 NO. OF COLUMNS IN DIS= LIST                  
LSDISLST DS    XL64                DIS= COLUMN LIST                             
LSDISDEF EQU   01                  DEFAULT COLUMNS                              
LSDISALL EQU   02                  ALL COLUMNS                                  
LSDISPRO EQU   X'40'               ON IF COLUMN TO PE PROTECTED                 
*                                                                               
         DS    0H                                                               
LSLIN    DS    25XL(LINTABL)       LIST LINE TABLE                              
LSLINX   DS    XL1                 EXTRA END OF TABLE BYTE                      
LSLINS   EQU   *-LSLIN                                                          
*                                                                               
LSMAXSCR DS    H                   MAX MEMORY AVAILABLE FOR LIST SCREEN         
LSMAXLEN DS    H                   MAX MEMORY AVAILABLE PER LIST LINE           
LSKEYLEN DS    H                   LENGTH OF KEY FIELDS ON LIST LINE            
LSNUMKEY DS    XL1                 NUMBER OF KEY TYPE COLUMNS                   
LSRECCOL DS    XL1                 POSITION OF 1ST RECORD COLUMN                
*                                                                               
LSOPS    DS    0XL(256)                                                         
*                                                                               
LSAUTH   DS    CL1                 AUTH STATUS - Y/N/O                          
*                                                                               
LSTDAT   DS    0CL7                TRANSACTION DATE                             
LSTDATFI DS    CL1                 POSITIVE/NEGATIVE                            
LSTDATST DS    XL3                 START                                        
LSTDATEN DS    XL3                 END                                          
*                                                                               
LSHELD   DS    CL1                 HELD STATUS - Y/N/O                          
*                                                                               
LSMOA    DS    0CL7                MONTH OF ACTIVITY                            
LSMOAFI  DS    CL1                 POSITIVE/NEGATIVE                            
LSMOAST  DS    XL3                 START                                        
LSMOAEN  DS    XL3                 END                                          
*                                                                               
LSREF    DS    0CL15               TRANSACTION REF/ORDER NUMBER                 
LSREFFI  DS    CL1                 POSITIVE/NEGATIVE                            
LSREFSTL DS    XL1                 START CODE LENGTH                            
LSREFST  DS    CL6                 START CODE                                   
LSREFENL DS    XL1                 END CODE LENGTH                              
LSREFEN  DS    CL6                 END CODE                                     
*                                                                               
LSDATE   DS    0CL7                TRANSACTION DATE                             
LSDATFI  DS    CL1                 POSITIVE/NEGATIVE                            
LSDATST  DS    XL3                 START DATE                                   
LSDATEN  DS    XL3                 END DATE                                     
*                                                                               
LSBAT    DS    0CL11               BATCH REFERENCE                              
LSBATFI  DS    CL1                 POSITIVE/NEGATIVE                            
LSBATSTL DS    XL1                 START CODE LENGTH                            
LSBATST  DS    CL4                 START CODE                                   
LSBATENL DS    XL1                 END CODE LENGTH                              
LSBATEN  DS    CL4                 END CODE                                     
*                                                                               
LSTYP    DS    0CL2                INPUT TYPE                                   
LSTYPFI  DS    CL1                 POSITIVE/NEGATIVE                            
LSTYPE   DS    CL1                 TYPE CODE                                    
*                                                                               
LSWC     DS    0CL3                WORKCODE                                     
LSWCFI   DS    CL1                 POSITIVE/NEGATIVE                            
LSWCODE  DS    CL2                 CODE                                         
*                                                                               
LSAMT    DS    0CL7                TRANSACTION/ORDER AMOUNT                     
LSAMTFI  DS    CL1                 RANGE INDICATOR/NEGATIVE FILTER              
LSAMOUNT DS    PL6                 AMOUNT                                       
*                                                                               
LSWCTOT  DS    CL1                 Y=WORKCODE TOTAL LINES REQUIRED              
*                                                                               
LSBILD   DS    CL1                 BILLED  - Y/N/O                              
*                                                                               
LSALLOC  DS    CL1                 ALLOCATED - Y/N/O                            
*                                                                               
LSLABOR  DS    CL1                 LABOUR - Y/N/O                               
*                                                                               
LSWCTYPE DS    0CL2                WORKCODE TYPE FILTER                         
LSWCTFI  DS    CL1                 POSITIVE/NEGATIVE                            
LSWCTCOD DS    CL1                 CODE                                         
*                                                                               
LSREVERS DS    CL1                 REVERSE - Y/N/O                              
LSUNAV   DS    CL1                 UNAVAILABLE - Y/N/O                          
*                                                                               
LSACTDAT DS    0XL4                ACTIVITY DATE FILTER                         
LSACTDST DS    XL2                 START DATE                                   
LSACTDND DS    XL2                 END DATE                                     
*                                                                               
LSULC    DS    0CL16               TRANSACTION REF/ORDER NUMBER                 
LSULCFI  DS    CL1                 POSITIVE/NEGATIVE                            
LSULCLN  DS    XL1                 LENGTH OF CODE                               
LSULCACC DS    CL14                START CODE LENGTH                            
*                                                                               
         DS    XL46                N/D                                          
*                                                                               
LSOVER   DS    XL40                DEFINED BY OVERLAY                           
*                                                                               
LSFLTOPL EQU   *-LSOPS                                                          
*                                                                               
LSOTHOPS DS    0CL81               NON-FILTER OPTIONS                           
LSSWITCH DS    CL1                 SWITCH OPTION                                
*                                                                               
LSCOM    DS    CL30                5 OVERRIDE COMMISSION RATES                  
*                                                                               
LSTOJOB  DS    CL12                TO-JOB FOR TRANSFER LIST                     
LSTOWC   DS    CL2                 TO-WC FOR TRANSFER LIST                      
*                                                                               
         DS    CL36                N/D                                          
*                                                                               
         ORG   LSOTHOPS+L'LSOTHOPS                                              
LSOTHOPL EQU   *-LSOTHOPS                                                       
*                                                                               
         ORG   LSOPS+L'LSOPS                                                    
LSOPL    EQU   *-LSOPS                                                          
*                                                                               
LSPASS   DS    XL1                 PASS OPTIONS TO NEW SESSION                  
*                                                                               
LSMIXLST DS    XL(L'MIXLST)        LIST ACTION TABLE ENTRY                      
*                                                                               
LSSTAT1  DS    XL1                 STATUS BYTE 1                                
LSSORDER EQU   X'80'               LIST CAN CONTAIN ORDER RECORDS               
LSSSEPTY EQU   X'40'               SEPERATE TIME/OOPS BY WORKCODE TYPE          
LSSTAT2  DS    XL1                 STATUS BYTE 2                                
         DS    XL1                 N/D                                          
LSDEFCUR DS    H                   DISP. TO DEFAULT CURSOR POSITION             
         DS    XL61                N/D                                          
*                                                                               
*                                  * SAVED VALUES FOR UPDATE *                  
LSUGODUE DS    XL(L'GOIDUE)        DUE DATE EXPRESSION FROM GOBLOCK             
LSUBILDC DS    XL2                 BILL DATE (COMPRESSED)                       
LSUBILDP DS    PL3                 BILL DATE (PWOS)                             
LSUBILDF DS    CL6                 DRAFT BILL NUMBER                            
LSUBILLV DS    CL6                 LIVE BILL NUMBER                             
LSUDUEDT DS    XL2                 DERIVED DUE DATE (COMPRESSED)                
LSUBILRF DS    CL4                 BILL BATCH REFERENCE                         
LSUBILMO DS    PL2                 BILL BATCH MONTH - PWOS                      
LSUBILMC DS    CL2                 BILL BATCH MONTH - CHARACTER                 
LSUWOFRF DS    CL4                 WRITE-OFF BATCH REFERENCE                    
LSUWOFMO DS    PL2                 WRITE-OFF BATCH MONTH - PWOS                 
LSUWOFMC DS    CL2                 WRITE-OFF BATCH MONTH - CHARACTER            
LSUTRFRF DS    CL4                 TRANSFER BATCH REFERENCE                     
LSUTRFMO DS    PL2                 TRANSFER BATCH MONTH - PWOS                  
LSUTRFMC DS    CL2                 TRANSFER BATCH MONTH - CHARACTER             
LSUVATT  DS    PL8                 BILL VAT TOTAL                               
LSUMEDNM DS    CL(L'PMDDESC)       MEDIA NAME FOR BILLING SOURCE                
LSUMEDIN DS    XL(L'PMDCOM1)       MEDIA RECORD INCOME ACCOUNT                  
         DS    XL32                N/D                                          
*                                                                               
         ORG   LSVALSD+LSSAVEL     END OF SAVED AREA                            
*                                                                               
LSINDS1  DS    XL1                 INDICATOR BYTE 1                             
LSIUPREC EQU   X'80'               UPDATE RECORD (SET BY OVERLAY)               
LSICLMIN EQU   X'40'               COLUMN ON LINE HAS BEEN INPUT TO             
LSILINUP EQU   X'20'               LINE HAS BEEN UPDATED                        
LSIBLST  EQU   X'10'               CURRENTLY BUILDING LIST                      
LSIWOPTA EQU   X'08'               PTA RECORD READ FOR PENDING W/O              
LSIUPPTA EQU   X'04'               UPDATE PTA RECORD (SET BY OVERLAY)           
LSITEMP  EQU   X'02'               TEMPORARY TSAR RECORD ADDED                  
LSILINER EQU   X'01'               LINE HAS BEEN FLAGGED FOR ERROR              
LSINDS2  DS    XL2                 INDICATOR BYTE 2                             
LSIXMIT  EQU   X'80'               ENTIRE SCREEN TO BE RE-TRANSMITTED           
LSFOOT#  DS    XL1                 FOOTLINE # (USED BY DISSCR ROUTINES)         
LSAMIFEL DS    AL4                 PASSED TO VALCLM FIELD                       
LSGOJOB  DS    CL12                LAST JOB FOR GETOPT CALL                     
LSGOWC   DS    CL2                 LAST WORK-CODE FOR GETOPT CALL               
LSGENM   DS    CL2                 GENERAL COLUMN LIST MASK                     
         DS    XL104               N/D                                          
*                                                                               
UPROUTS  DS    0A                  * UPDATE ROUTINES *                          
APOSTIT  DS    A                   GENERAL POST ROUTINE                         
AINIPBLK DS    A                   INITIALIZE PBLKD                             
AVALBREF DS    A                   VALIDATE BATCH REFERENCE                     
AVALBMOA DS    A                   VALIDATE BATCH MONTH                         
ABLDDAL  DS    A                   BUILD DISK/ADDRESS LIST OF XACTIONS          
AOPNJRN  DS    A                   OPEN JOURNAL (POSTINGS REPORT)               
ACLOJRN  DS    A                   CLOSE JOURNAL                                
ASETACTN DS    A                   SET ACCOUNT NAME                             
AADDXTRA DS    A                   ADD EXTRA ELEMENT                            
AXTRAELS DS    A                   ADD EXTRA ELS FOR TRANSFER / W/O             
AADDWMDT DS    A                   ADD MEDIA TRANSFER EL (NON BILLING)          
AADDBMDT DS    A                   ADD MEDIA TRANSFER ELEMENT (BILLING)         
AADDRFL  DS    A                   ADD R. L. FILTER ELEMENT FOR W/C             
UPROUTSN EQU   32                                                               
         ORG   UPROUTS+(L'UPROUTS*UPROUTSN)                                     
*                                                                               
LSPRATA  DS    XL(PR$LNQ)          PRO-RATA AREA                                
LSPRATAS DS    XL(PR$LNQ)          SAVED ORIGINAL PRO-RATA AREA                 
LSTMSBLK DS    XL165               TMSUPD BLOCK                                 
*                                                                               
LSVALSL  EQU   *-LSVALSD                                                        
         EJECT                                                                  
***********************************************************************         
* TSAR LIST RECORD DATA                                               *         
***********************************************************************         
         SPACE 1                                                                
TLSTD    DSECT                                                                  
TLST     DS    0XL768                                                           
TLNUM    DS    XL2                 TSAR LIST RECORD NUMBER                      
*                                                                               
TLREC    DS    0XL766              ** TSAR LIST RECORD **                       
TLRLEN   DS    XL2                 RECORD LENGTH                                
*                                                                               
TLKEY    DS    0XL32               * RECORD KEY *                               
TLKSES   DS    XL1                 SESSION NESTING LEVEL / RECORD TYPE          
TLKSSTOT EQU   X'10'               SCREEN TOTAL RECORD                          
TLKSWS   EQU   X'20'               USED TO SAVE/RESTORE W/S                     
TLKSTEMP EQU   X'F0' +             TEMPORARY TSAR RECORDS                       
TLKSRT   DS    XL29                SORT PART                                    
TLKSEQ   DS    XL2                 SEQUENCE NUMBER                              
*                                                                               
TLDATA   DS    0XL732              * RECORD DATA *                              
TLDA     DS    XL4                 DISK ADDRESS                                 
TLSTA    DS    XL8                 RECORD STATUS                                
TLRECACT DS    0XL2                RECORD/ACTION                                
TLRECTYP DS    XL1                 RECORD TYPE                                  
TLACT    DS    AL1                 ACTION CODE                                  
TLMASK   DS    XL2                 VALID ACTIONS MASK                           
TLINDS1  DS    XL1                 INDICATOR BYTE 1                             
TLITOTL  EQU   X'80'               TOTAL RECORD                                 
TLIHIGH  EQU   X'40'               HIGHLIGHT DISPLAY LINE                       
         DS    XL4                 N/D                                          
TLMINLNQ EQU   *-TLREC             MINUMUM LENGTH OF TSAR RECORD                
*                                                                               
TLOVR    DS    XL711               * DEFINED BY OVERLAYS *                      
         ORG   TLST                                                             
TLST1    DS    XL256               1ST PART OF DATA                             
TLST2    DS    XL256               2ND PART OF DATA                             
TLST3    DS    XL256               3RD PART OF DATA                             
         ORG   TLST+L'TLST                                                      
TLMAXLNQ EQU   *-TLREC             MAXIMUM LENGTH OF TSAR RECORD                
         SPACE 1                                                                
         ORG   TLKSRT              ** ALL TRANSACTION RECORD LISTS **           
TLKSTYP1 DS    XL1                 SORT TYPE BYTE 1                             
TLKSTIME EQU   X'10'               TIME WORK-CODE (USA ONLY)                    
TLKSTTOT EQU   X'11'               TIME TOTAL LINE                              
TLKSOOPS EQU   X'20'               OOPS WORK-CODE (USA ONLY)                    
TLKSOTOT EQU   X'21'               OOPS TOTAL LINE                              
TLKSORDN EQU   X'80'               NOT AN ORDER (UK, NOT MERGING)               
TLKSLTOT EQU   X'FF'               LIST TOTAL LINE                              
TLKWC    DS    CL2                 WORK-CODE (OR ORDER WORK-CODE)               
TLKSTYP2 DS    XL1                 SORT TYPE BYTE 2                             
TLKSWTOT EQU   X'FF'               WORK-CODE TOTAL LINE                         
TLKULC   DS    CL14                CONTRA-ACCOUNT                               
TLKDATE  DS    PL3                 TRANSACTION DATE                             
TLKREF   DS    CL6                 TRANSACTION REFERENCE NUMBER                 
TLKSBR   DS    XL1                 TRANSACTION SUB-REFERENCE NUMBER             
         ORG   TLKSRT+L'TLKSRT                                                  
         ORG   TLOVR                                                            
TLXSTAT  DS    XL1                 * STATUS BYTE *                              
TLXSORD  EQU   X'80'               ITEM IS AN ORDER                             
TLXSNOCM EQU   X'40'               NON-COMMISSIONABLE ITEM                      
TLXSHOUR EQU   X'20'               HOURLY/LABOUR ITEM                           
TLXSCOST EQU   X'10'               COST/OOP ITEM                                
TLXSULSI EQU   X'08'               DEFAULT W/O UNIT LEDGER IS SI                
TLXSULSE EQU   X'04'               DEFAULT W/O UNIT LEDGER IS SE                
TLXSFEEA EQU   X'02'               ITEM IS A FEE ADJUSTMENT                     
TLXSRVAL EQU   X'01'               REVALUE REQUIRED TO ALLOCATE ETC.            
TLXVAL   DS    XL1                 * VALID STATUS BYTE *                        
TLXVALL  EQU   X'80'               VALID TO ALLOCATE                            
TLXVWOF  EQU   X'40'               VALID TO WRITE-OFF                           
TLXVXFR  EQU   X'20'               VALID TO TRANSFER                            
TLXVRCV  EQU   X'10'               VALID TO RECOVER WRITE-OFFS                  
TLXVDEL  EQU   X'08'               VALID FOR ITEM TO BE DELETED                 
TLXVHOUR EQU   X'04'               VALID FOR HOURS TO BE PENDING                
TLXPEND  DS    XL1                 * PENDING INICATOR BYTE *                    
TLXPALL  EQU   X'80'               ALLOCATION PENDING                           
TLXPWOF  EQU   X'40'               WRITE-OFF PENDING                            
TLXPXFR  EQU   X'20'               TRANSFER PENDING                             
TLXPRCV  EQU   X'10'               WRITE-OFF RECOVERY PENDING                   
TLXPREV  EQU   X'08'               REVERSE ALLOCATION PENDING                   
TLXPAVL  EQU   X'04'               AMOUNT AVAILABLE FOR PENDING                 
TLXMINLQ EQU   *-TLREC             MINIMUM LENGTH OF TSAR RECORD                
TLXOVR   DS    0X                  DEFINED BY OVERLAYS                          
         SPACE 1                                                                
         ORG   TLXOVR              ** WRITE OFF RECOVERY **                     
TLRNWOF  DS    XL1                 NUMBER OF WRITE OFFS                         
TLRCVLNQ EQU   *-TLREC                                                          
         SPACE 1                                                                
         ORG   TLOVR               ** BILL LIST **                              
TLBNET   DS    PL8                 NET AMOUNT                                   
TLBCOM   DS    PL8                 COMMISSION AMOUNT                            
TLBCUR   DS    XL(CURTABL)         CURRENCY TABLE ENTRY                         
TLBPAS   DS    0XL(L'PBRPAS+L'PBRKSTA)                                          
TLBPKEY  DS    XL(L'PBRPAS)        PASSIVE KEY                                  
TLBPSTA  DS    XL(L'PBRKSTA)       RECORD 'STATUS                               
TLLSTLNQ EQU   *-TLREC                                                          
         SPACE 1                                                                
         ORG   TLOVR               ** CONTROL LIST **                           
TLCDIR   DS    XL(ACCKLEN)         CONTROL DIRECTORY RECORD                     
TLCONLNQ EQU   *-TLREC                                                          
         SPACE 1                                                                
         ORG   TLOVR               ** PREVBILL LIST **                          
TLPPBIL  DS    CL6                 BILL NUMBER                                  
TLPPCOD  DS    CL3                 CURRENCY CODE                                
TLPPTAB  DS    XL(CURTABL)         CURRENCY TABLE ENTRY                         
TLPPEXC  DS    XL(L'CSEXCVAL)      EXCHANGE RATE                                
TLPRBLNQ EQU   *-TLREC                                                          
         SPACE 1                                                                
         ORG   TLXOVR              ** REVALUE LIST **                           
TLRINDS  DS    XL1                 INDICATOR BYTE                               
TLRIREV  EQU   X'80'               RECORD IS RE-VALUABLE                        
TLRWC    DS    CL2                 WORK-CODE                                    
TLRSUP   DS    XL15                SUPPLIER                                     
TLRREF#  DS    CL6                 REFERENCE #                                  
TLRDATE  DS    PL3                 DATE                                         
TLRCUR   DS    CL3                 CURRENCY CODE                                
TLRCTAB  DS    XL(CURTABL)         CURRENCY TABLE ENTRY                         
TLRCAMT  DS    PL6                 CURRENCY AMOUNT                              
TLRNVAL  DS    0XL7                NEW EXCHANGE RATE VALUES                     
TLRNIND  DS    XL1                 NEW EXCHANGE STATUS                          
TLRNEXC  DS    PL5                 NEW EXCHANGE RATE                            
TLRNSHF  DS    XL1                 NEW EXCHANGE SHIFT                           
TLROVAL  DS    0XL7                OLD EXCHANGE RATE VALUES                     
TLROIND  DS    XL1                 OLD EXCHANGE STATUS                          
TLROEXC  DS    PL5                 OLD EXCHANGE RATE                            
TLROSHF  DS    XL1                 OLD EXCHANGE SHIFT                           
TLRNAMT  DS    PL6                 NEW AMOUNT                                   
TLROAMT  DS    PL6                 OLD AMOUNT                                   
TLRVLLNQ EQU   *-TLREC                                                          
         SPACE 1                                                                
         ORG   TLXOVR              ** MATCH 1 LIST **                           
TLMINDS  DS    XL1                 INDICATOR BYTE                               
TLMIMAT  EQU   X'80'               THERE IS AN AMOUNT TO MATCH                  
TLMIADV  EQU   X'40'               ITEM IS FOR AN ADVANCE                       
TLMIORD  EQU   X'20'               ITEM IS FOR AN ORDER                         
TLMBILL  DS    CL6                 BILL NUMBER                                  
TLMCUR   DS    XL3                 CURRENCY CODE                                
TLMCTAB  DS    XL(CURTABL)         CURRENCY CODE TABLE ENTRY                    
TLMX     DS    0XL7                EXCHANGE RATE VALUES                         
TLMXIND  DS    XL1                 EXCHANGE STATUS                              
TLMXEXC  DS    PL5                 EXCHANGE RATE                                
TLMXSHF  DS    XL1                 EXCHANGE SHIFT                               
TLMDATP  DS    PL3                 BILL DATE (PWOS)                             
TLMDATC  DS    XL2                 BILL DATE (COMPRESSED)                       
TLMINCAC DS    CL15                INCOME ACCOUNT                               
TLMT1LNQ EQU   *-TLREC                                                          
         SPACE 1                                                                
         ORG   TLXOVR              ** MATCH 2 LIST (INVOICES) **                
TLIINDS  DS    XL1                 INDICATOR BYTE                               
TLIISFC  EQU   X'80'               SAME FOREIGN CURRENCY AS LSTMCUR             
TLIIDEX  EQU   X'40'               DIFFERENT EXCHANGE RATE TO LSTMX             
TLIIREV  EQU   X'20'               RE-VALUE REQUIRED BEFORE MATCHING            
TLINAB   DS    PL8                 NET AVAILABLE (BILLING CURRENCY)             
TLINAA   DS    PL8                 NET AVAILABLE (AGENCY CURRENCY)              
TLINMB   DS    PL8                 NET MATCHED (BILLING CURRENCY)               
TLINMA   DS    PL8                 NET MATCHED (AGENCY CURRENCY)                
TLICMB   DS    PL8                 COMMISSION MATCHED (BILL CURRENCY)           
TLICMA   DS    PL8                 COMMISSION MATCHED (AGENCY CURRENCY)         
TLIHRA   DS    PL8                 HOURS AVAILABLE                              
TLIHRM   DS    PL8                 HOURS MATCHED                                
TLICOMR  DS    PL8                 DEFAULT COMMISSION RATE (4 DP)               
TLIX     DS    0XL7                EXCHANGE RATE (IF TLISFC)                    
TLIXIND  DS    XL1                 EXCHANGE STATUS                              
TLIXEXC  DS    PL5                 EXCHANGE RATE                                
TLIXSHF  DS    XL1                 EXCHANGE SHIFT                               
TLIINCAC DS    CL15                INCOME ACCOUNT                               
TLMT2LNQ EQU   *-TLREC                                                          
         SPACE 1                                                                
         ORG   TLOVR               ** AUTO ALLOCATE/UNALLOCATE **               
TLAJOB   DS    XL12                JOB CODE                                     
TLAUNA   DS    PL8                 UNALLOCATED                                  
TLAANT   DS    PL8                 ALLOCATED NET                                
TLAACO   DS    PL8                 ALLOCATED COMMISSION                         
TLACUR   DS    CL3                 CURRENCY CODE                                
TLACTAB  DS    XL(CURTABL)         CURRENCY TABLE ENTRY                         
TLAXVAL  DS    0XL7                EXCHANGE RATE VALUES                         
TLAXIND  DS    XL1                 EXCHANGE STATUS                              
TLAXRAT  DS    PL5                 EXCHANGE RATE                                
TLAXSHF  DS    XL1                 EXCHANGE SHIFT                               
TLAAGN   DS    XL2                 ALLOCATION GROUP NUMBER                      
TLASEQ   DS    XL2                 JOB ACTIVITY SEQUENCE NO. (JCBSEQ)           
TLAINDS  DS    XL1                 INDICATOR BYTE                               
TLAIJOB  EQU   X'80'               AMOUNTS SET FOR WHOLE JOB                    
TLAIUPD  EQU   X'40'               JOB AMOUNTS ARE UP TO DATE                   
TLAIALL  EQU   X'20'               JOB HAS BEEN FULLY ALLOCATED                 
TLAICLR  EQU   X'10'               JOB HAS BEEN FULLY CLEARED                   
TLAALLNQ EQU   *-TLREC                                                          
         SPACE 1                                                                
         ORG   TLOVR               ** COLUMNS **                                
TLCDATA  DS    XL(CLMDATAL)        COLUMN TABLE ENTRY                           
TLCH1    DS    CL20                HEADING 1                                    
TLCH2    DS    CL20                HEADING2                                     
TLCOLLNQ EQU   *-TLREC                                                          
         SPACE 1                                                                
         ORG   TLXOVR              ** JOB LIST **                               
TLJCODE  DS    CL12                JOB CODE                                     
TLJOBLNQ EQU   *-TLREC                                                          
         SPACE 1                                                                
         ORG   TLOVR               ** FORMAT OPTIONS **                         
TLFOPT#  DS    XL1                 OPTION NUMBER                                
TLFHED   DS    CL32                OPTION HEADING                               
TLFMAXL  DS    XL1                 MAXIMUM LENGTH OF INPUT                      
TLFFHAT  DS    XL1                 FIELD ATTRIBUTE BYTE                         
TLFOPLNQ EQU   *-TLREC                                                          
         SPACE 1                                                                
         ORG   TLOVR               ** SUB-TOTAL LINE **                         
TLTDSC   DS    CL24                TOTAL DESCRIPTION                            
TLTPRATA DS    XL(PR$LNQ)          PRO-RATA BLOCK                               
TLTOTLNQ EQU   *-TLREC                                                          
         EJECT                                                                  
***********************************************************************         
* TEMPORARY TSAR RECORDS USED BY UPDATE                               *         
***********************************************************************         
         SPACE 1                                                                
TLSTD    DSECT                                                                  
         ORG   TLDATA                                                           
TLDU     DS    XL120               DATA PART                                    
TLUPDLNQ EQU   *-TLREC                                                          
*                                                                               
         ORG   TLKSES              ** WORKCODE/INCOME AC TOTALS **              
TLKUWCQ  EQU   X'F1'                                                            
         ORG   TLKSRT                                                           
TLKUACT  DS    CL(L'ACTKULA)       INCOME ACCOUNT FOR POSTING                   
TLKUWC   DS    CL(L'WCOKWRK)       WORKCODE                                     
         ORG   TLDU                                                             
TLDUANAL DS    CL(L'ACTKACT)       COSTING GROUP                                
TLDUACOM DS    PL8                 AGENCY CURRENCY COMMISSION                   
TLDUFCOM DS    PL8                 FOREIGN CURRENCY COMMISSION                  
TLDUANET DS    PL8                 AGENCY CURRENCY NET                          
TLDUFNET DS    PL8                 FOREIGN CURRENCY NET                         
*                                                                               
TLDUVT1  DS    CL1                 VAT TYPE CODE 1                              
TLDUVAM1 DS    PL8                 VATABLE AMOUNT 1                             
TLDUVT2  DS    CL1                 VAT TYPE CODE 2                              
TLDUVAM2 DS    PL8                 VATABLE AMOUNT 2                             
TLDUVT3  DS    CL1                 VAT TYPE CODE 3                              
TLDUVAM3 DS    PL8                 VATABLE AMOUNT 3                             
TLDUVT4  DS    CL1                 VAT TYPE CODE 4                              
TLDUVAM4 DS    PL8                 VATABLE AMOUNT 4                             
TLDUVT5  DS    CL1                 VAT TYPE CODE 5                              
TLDUVAM5 DS    PL8                 VATABLE AMOUNT 5                             
TLDUVT6  DS    CL1                 VAT TYPE CODE 6                              
TLDUVAM6 DS    PL8                 VATABLE AMOUNT 6                             
TLDUVT7  DS    CL1                 VAT TYPE CODE 7                              
TLDUVAM7 DS    PL8                 VATABLE AMOUNT 7                             
TLDUVTMX EQU   7                   MAXIMUM VAT TYPES                            
         SPACE 1                                                                
         ORG   TLKSES              ** VAT RECORD **                             
TLKUVATQ EQU   X'F2'                                                            
         ORG   TLKSRT                                                           
TLKUVATT DS    CL(L'TAXCODE)       VAT TYPE                                     
         ORG   TLDU                                                             
TLDUVATA DS    PL8                 VATABLE AMOUNT                               
TLDUVAT  DS    PL8                 VAT AMOUNT                                   
TLDUVRAT DS    XL2                 VAT RATE           - VTCRATE                 
TLDUVACT DS    XL15                VAT ACCOUNT        - VTCACT                  
TLDUVIND DS    XL1                 VATICAN INDICATORS - VTCINDS                 
TLDUVANM DS    CL36                VAT ACCOUNT NAME   - VTCACTNM                
TLDUVTNM DS    CL10                VAT TYPE NAME      - VTCTTYPE                
TLDUVEFF DS    PL3                 VAT EFFECTIVE DATE - VTCEFFD                 
TLDUVCOM DS    PL8                 VATABLE COMMISSION                           
*                                                                               
TLDUVVSG DS    PL8                 SURCHARGABLE/SURCHARGE AMOUNT                
         SPACE 1                                                                
         ORG   TLKSES              ** SK/SI TRANSFER RECORD **                  
TLKUTRFQ EQU   X'F3'                                                            
         ORG   TLKSRT                                                           
TLKUTACT DS    CL(L'TRNKULA)       SK ACCOUNT                                   
TLKUTWRK DS    CL(L'TRNKWORK)      WORKCODE                                     
TLKUTDAT DS    CL(L'TRNKDATE)      TRANSACTION DATE                             
TLKUTREF DS    CL(L'TRNKREF)       TRANSACTION DATE                             
         ORG   TLDU                                                             
TLDUTRFA DS    PL8                 TRANSFER AMOUNT                              
TLDUTPER DS    CL(L'TRNKULA)       1R ACCOUNT CODE                              
         SPACE 1                                                                
         ORG   TLKSES              ** COSTING GROUP RECORD **                   
TLKUCSTQ EQU   X'F4'                                                            
         ORG   TLKSRT                                                           
TLKUCOST DS    CL(L'ACTKACT)       COSTING GROUP                                
         ORG   TLDU                                                             
TLDUCNET DS    PL8                 NET AMOUNT                                   
TLDUCCOM DS    PL8                 COMMISSION AMOUNT                            
         SPACE 1                                                                
         ORG   TLKSES              ** PST RECORD **                             
TLKUPSTQ EQU   X'F5'                                                            
         ORG   TLKSRT                                                           
*&&US                                                                           
TLKUPSTP DS    CL(L'GOPSTPRV)      PROVINCE CODE                                
TLKUPSTT DS    CL(L'GOPSTCOD)      PST TYPE                                     
*&&                                                                             
         ORG   TLDU                                                             
TLDUPSTA DS    PL8                 PSTABLE AMOUNT (NET + COMM)                  
TLDUPST  DS    PL8                 PST AMOUNT                                   
TLDUPCOM DS    PL8                 PSTABLE COMMISSION                           
TLDUPRAT DS    XL2                 PST RATE           - VTCRATE                 
TLDUPACT DS    XL15                PST ACCOUNT        - VTCACT                  
TLDUPIND DS    XL1                 VATICAN INDICATORS - VTCINDS                 
TLDUPTNM DS    CL10                PST TYPE NAME      - VTCTTYPE                
TLDUPEFF DS    PL3                 PST EFFECTIVE DATE - VTCEFFD                 
*                                  PSTABLE INCLUDES GST - HENCE                 
TLDUGT1  DS    CL1                 GST TYPE CODE 1                              
TLDUGAM1 DS    PL8                 GSTABLE AMOUNT 1                             
TLDUGT2  DS    CL1                 GST TYPE CODE 2                              
TLDUGAM2 DS    PL8                 GSTABLE AMOUNT 2                             
TLDUGT3  DS    CL1                 GST TYPE CODE 3                              
TLDUGAM3 DS    PL8                 GSTABLE AMOUNT 3                             
TLDUGT4  DS    CL1                 GST TYPE CODE 4                              
TLDUGAM4 DS    PL8                 GSTABLE AMOUNT 4                             
TLDUGT5  DS    CL1                 GST TYPE CODE 5                              
TLDUGAM5 DS    PL8                 GSTABLE AMOUNT 5                             
TLDUGT6  DS    CL1                 GST TYPE CODE 6                              
TLDUGAM6 DS    PL8                 GSTABLE AMOUNT 6                             
TLDUGT7  DS    CL1                 GST TYPE CODE 7                              
TLDUGAM7 DS    PL8                 GSTABLE AMOUNT 7                             
TLDUGTMX EQU   7                   MAXIMUM GST TYPES                            
         SPACE 1                                                                
         ORG   TLKSES              ** REVERSE E.P. RECORD **                    
TLKUREPQ EQU   X'F6'                                                            
         ORG   TLKSRT                                                           
TLKURWRK DS    CL(L'TRNKWORK)      WORKCODE                                     
TLKURCON DS    CL(L'TRNKULA)       E.P. CONTRA ACCOUNT                          
TLKURDAT DS    CL(L'TRNKDATE)      TRANSACTION DATE                             
TLKURREF DS    CL(L'TRNKREF)       TRANSACTION REF                              
         ORG   TLDU                                                             
TLDURCRC DS    CL(L'TRNKULA)       CREDIT POSTING CONTRA                        
TLDUREPA DS    PL8                 REVERSE AMOUNT                               
         SPACE 1                                                                
         ORG   TLKSES                                                           
TLKUWUPQ EQU   X'F7'               ** WRITE-UP HOURS RECORD **                  
         ORG   TLKSRT                                                           
TLKUPERS DS    CL(L'ACTKULA)       PERSON RECORD FOR ZERO POSTING               
         ORG   TLDU                                                             
TLDUWAMT DS    PL8                 WRITE-UP AMOUNT                              
TLDUWHRS DS    PL8                 WRITE-UP HOURS                               
         EJECT                                                                  
***********************************************************************         
* TEMPORARY TSAR RECORD USED BY AUTOFORM                              *         
***********************************************************************         
         SPACE 1                                                                
TLSTD    DSECT                                                                  
         ORG   TLKSES                                                           
TLKALINQ EQU   X'F8'               ** LINE RECORD **                            
         ORG   TLKSRT                                                           
TLKAPARA DS    0XL3                PARAGRAPH KEY                                
TLKATYPE DS    XL1                 PARAGRAPH/WORKCODE TYPE                      
TLKAWORK DS    CL2                 WORKCODE OR NULL                             
TLKAREST DS    0C                  REMAINDER OF KEY (VARIABLE)                  
         ORG   TLDATA                                                           
TLDALINE DS    CL132                                                            
TLDANET  DS    PL6                 NET AMOUNT                                   
TLDACOM  DS    PL6                 COMMISSION AMOUNT                            
TLDAOAC  DS    PL6                 OVERALLOCATION                               
TLDACDSC DS    PL6                 CASH DISCOUNT                                
TLDAFWT  DS    CL(5*FWTLNQ)                                                     
TLAFMLNQ EQU   *-TLREC                                                          
