*          DATA SET ACCLBEDD   AT LEVEL 002 AS OF 01/17/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T621EDD      DATE 01/17/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      4    2    8  L  P N             T        Y              
AALJBOH  DS    CL8                                                              
AALJBO   DS    CL66     4   11   66  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1      4   78    1  A  P N             T        Y              
AALLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
AALWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 104  BYTES                            
