*          DATA SET ACCLBF9BD  AT LEVEL 002 AS OF 12/22/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T621F9D      DATE 12/22/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
INSTRNH  DS    CL8                                                              
INSTRN   DS    CL15     4    2   15  L  P H             T        Y   64         
INSTRNX  DS    CL8                                                              
INSCLIH  DS    CL8                                                              
INSCLI   DS    CL57     4   18   57  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL15     5    2   15  L  P H             T        Y              
INSPROH  DS    CL8                                                              
INSPRO   DS    CL57     5   18   57  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL15     6    2   15  L  P H             T        Y              
INSJOBH  DS    CL8                                                              
INSJOB   DS    CL57     6   18   57  L  U N             T        Y              
INSCURNH DS    CL8                                                              
INSCURN  DS    CL15     7    2   15  L  P H             T        Y              
INSCURH  DS    CL8                                                              
INSCUR   DS    CL3      7   18    3  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL15     9    2   15  L  P H             T        Y              
INSSUPCH DS    CL8                                                              
INSSUPC  DS    CL57     9   18   57  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    10    2   15  L  P H             T        Y              
INSWCH   DS    CL8                                                              
INSWC    DS    CL57    10   18   57  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11    2    6  L  P H             T        Y              
INSREFH  DS    CL8                                                              
INSREF   DS    CL6     11   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12    2    6  L  P H             T        Y              
INSDATEH DS    CL8                                                              
INSDATE  DS    CL8     12   18    8  A  U N             T        Y              
INSRATNH DS    CL8                                                              
INSRATN  DS    CL6     13    2    6  L  P H             T        Y              
INSRATEH DS    CL8                                                              
INSRATE  DS    CL8     13   18    8  A  U N             T        Y              
INSDRFNH DS    CL8                                                              
INSDRFN  DS    CL15    14    2   15  L  P H             T        Y              
INSDRFTH DS    CL8                                                              
INSDRFT  DS    CL4     14   18    4  A  U N             T        Y              
INSFRMNH DS    CL8                                                              
INSFRMN  DS    CL6     14   27    6  L  P H             T        Y              
INSFRMTH DS    CL8                                                              
INSFRMT  DS    CL3     14   34    3  A  U N             T        Y              
INSFRMDH DS    CL8                                                              
INSFRMD  DS    CL36    14   38   36  L  P H             T        Y              
INSFHRNH DS    CL8                                                              
INSFHRN  DS    CL8     15    2    8  L  P H             T        Y              
INSFHRSH DS    CL8                                                              
INSFHRS  DS    CL6     15   18    6  A  U H             T        Y              
INSRA2NH DS    CL8                                                              
INSRA2N  DS    CL6     15   34    6  L  P H             T        Y              
INSRAT2H DS    CL8                                                              
INSRAT2  DS    CL8     15   42    8  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL14    16   18   14  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL14    16   34   14  L  P H             T        Y              
INSHRSNH DS    CL8                                                              
INSHRSN  DS    CL6     16   50    6  L  P H             T        Y              
INSWUCNH DS    CL8                                                              
INSWUCN  DS    CL14    16   58   14  L  P H             T        Y              
INSWUHNH DS    CL8                                                              
INSWUHN  DS    CL6     16   74    6  L  P H             T        Y              
INSALLH  DS    CL8                                                              
INSALL   DS    CL15    17    2   15  L  P N             T        Y   68         
INSALLX  DS    CL8                                                              
INSALNTH DS    CL8                                                              
INSALNT  DS    CL14    17   18   14  A  U H             T        Y              
INSALCMH DS    CL8                                                              
INSALCM  DS    CL14    17   34   14  A  U H             T        Y              
INSALHRH DS    CL8                                                              
INSALHR  DS    CL6     17   50    6  A  U H             T        Y              
INSWUCMH DS    CL8                                                              
INSWUCM  DS    CL14    17   58   14  A  U H             T        Y              
INSWUHRH DS    CL8                                                              
INSWUHR  DS    CL6     17   74    6  A  U H             T        Y              
INSNARH  DS    CL8                                                              
INSNAR   DS    CL15    19    2   15  L  P N             T        Y   70         
INSNARX  DS    CL8                                                              
INSNAR1H DS    CL8                                                              
INSNAR1  DS    CL49    19   18   49  L  U N             T        Y              
INSNAR2H DS    CL8                                                              
INSNAR2  DS    CL49    20   18   49  L  U N             T        Y              
INSNAR3H DS    CL8                                                              
INSNAR3  DS    CL49    21   18   49  L  U N             T        Y              
INSNAR4H DS    CL8                                                              
INSNAR4  DS    CL49    22   18   49  L  U N             T        Y              
INSPFKH  DS    CL8                                                              
INSPFK   DS    CL79    24    2   79  A  P N             T        Y  255         
INSPFKX  DS    CL8                                                              
INSLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
INSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1312 BYTES                            
