*          DATA SET ACCSTRCVDS AT LEVEL 007 AS OF 04/20/98                      
CSTRCVD  DSECT                     ** COSTING RECOVERY FILE RECORD **           
CSTRLEN  DS    XL2                 RECORD LENGTH                                
         DS    XL2                 N/D                                          
CSTRECTY DS    XL1                 RECOVERY RECORD TYPE                         
CSTRCPYQ EQU   1                   COPY RECORD                                  
CSTRADDQ EQU   3                   ADD RECORD                                   
         DS    XL1                 N/D                                          
CSTHDLN  EQU   *-CSTRCVD           LENGTH OF HEADER INFO                        
CSTRECRD DS    0X                  COSTING RECOVERY RECORD STARTS HERE          
*                                                                               
*                                                                               
*                                                                               
IOSIZE   EQU   2008                SIZE OF I/O AREAS                            
RCVSIZE  EQU   IOSIZE+CSTHDLN      SIZE OF RECOVERY RECORD                      
