*          DATA SET ACCSHFFD   AT LEVEL 002 AS OF 09/30/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T607FFD      DATE 09/30/83                 
         SPACE 1                                                                
T607FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
CSHMSGH  DS    CL8                                                              
CSHMSG   DS    CL60     1    2   60   A    P    N         T         Y           
CSHSERVH DS    CL8                                                              
CSHSERV  DS    CL17     1   63   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6      2    2    6   A    P    N         T         Y           
CSHSYH   DS    CL8                                                              
CSHSY    DS    CL12     2   12   12   A    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL5      3    2    5   A    P    N         T         Y           
CSHACH   DS    CL8                                                              
CSHAC    DS    CL19     3   12   19   A    U    N         T         Y           
CSHACNMH DS    CL8                                                              
CSHACNM  DS    CL30     3   32   30   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL4      3   63    4   A    P    N         T         Y           
CSHMOH   DS    CL8                                                              
CSHMO    DS    CL9      3   70    9   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      4    2    7   A    P    N         T         Y           
CSHF1H   DS    CL8                                                              
CSHF1    DS    CL50     4   12   50   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6      4   63    6   A    P    N         T         Y           
CSHOPH   DS    CL8                                                              
CSHOP    DS    CL1      4   70    1   A    U    N         T         Y           
CSHNXTH  DS    CL8                                                              
CSHNXT   DS    CL1      4   78    1   A    U    N         T         Y           
CSHHDGH  DS    CL8                                                              
CSHHDG   DS    CL11     6    2   11   A    P    N         T         Y           
CSHHDG2H DS    CL8                                                              
CSHHDG2  DS    CL34     6   17   34   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL17     6   56   17   A    P    N         T         Y           
CSHLNEH  DS    CL8                                                              
CSHLNE   DS    CL75     8    2   75   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL75     9    2   75   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL75    10    2   75   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL75    11    2   75   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL75    12    2   75   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL75    13    2   75   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL75    14    2   75   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL75    15    2   75   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL75    16    2   75   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL75    17    2   75   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL75    18    2   75   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL75    19    2   75   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL75    20    2   75   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL75    21    2   75   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL75    22    2   75   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL9     24    2    9   A    P    N         T         Y           
CSHTOTH  DS    CL8                                                              
CSHTOT   DS    CL25    24   36   25   A    P    N         T         Y           
CSHTABH  DS    CL8                                                              
CSHTAB   DS    CL1     24   74    1   A    P    N         T         Y           
CSHLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
CSHWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1732 BYTES                            
