*          DATA SET ACCTAF7D   AT LEVEL 004 AS OF 01/15/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61EF7D      DATE 01/15/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      6    2    5  L  P H             T        Y              
FIRMEDH  DS    CL8                                                              
FIRMED   DS    CL5      6   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     6   20   10  L  P H             T        Y              
FIRCNTRH DS    CL8                                                              
FIRCNTR  DS    CL6      6   32    6  A  U N             T        Y              
FIRCNMEH DS    CL8                                                              
FIRCNME  DS    CL25     6   40   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  L  P N             T        Y              
FIRCONTH DS    CL8                                                              
FIRCONT  DS    CL5      7   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL45     9    2   45  L  P N             T        Y              
FIRCLSDH DS    CL8                                                              
FIRCLSD  DS    CL1      9   50    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL45    10    2   45  L  P N             T        Y              
FIRCOSTH DS    CL8                                                              
FIRCOST  DS    CL1     10   50    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL45    11    2   45  L  P N             T        Y              
FIRSORTH DS    CL8                                                              
FIRSORT  DS    CL1     11   50    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL45    12    2   45  L  P N             T        Y              
FIRINVH  DS    CL8                                                              
FIRINV   DS    CL1     12   50    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL45    13    2   45  L  P N             T        Y              
FIRSUMMH DS    CL8                                                              
FIRSUMM  DS    CL1     13   50    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL45    14    2   45  L  P N             T        Y              
FIRNDTEH DS    CL8                                                              
FIRNDTE  DS    CL8     14   50    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL45    15    2   45  L  P N             T        Y              
FIRIATVH DS    CL8                                                              
FIRIATV  DS    CL1     15   50    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   78    1  A  P N             T        Y              
FIRPFKYH DS    CL8                                                              
FIRPFKY  DS    CL79    24    2   79  A  P H             T        Y              
FIRLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
FIRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 664  BYTES                            
