*          DATA SET ACCTAF2SD  AT LEVEL 016 AS OF 10/23/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61EF2D      DATE 10/23/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      6    2    5  L  P H             T        Y              
CTAMEDH  DS    CL8                                                              
CTAMED   DS    CL5      6   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      6   20    8  L  P H             T        Y              
CTACONTH DS    CL8                                                              
CTACONT  DS    CL5      6   31    5  A  U N             T        Y              
CTACNTRH DS    CL8                                                              
CTACNTR  DS    CL6      6   38    6  A  P N             T        Y              
CTASTNSH DS    CL8                                                              
CTASTNS  DS    CL30     6   46   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      7    2    5  A  P N             T        Y              
CTATGCIH DS    CL8                                                              
CTATGCI  DS    CL11     7    8   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      7   20    5  A  P N             T        Y              
CTATNCIH DS    CL8                                                              
CTATNCI  DS    CL11     7   26   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12     7   38   12  A  P N             T        Y              
CTACOMMH DS    CL8                                                              
CTACOMM  DS    CL6      7   52    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      7   60    7  A  P N             T        Y              
CTASTATH DS    CL8                                                              
CTASTAT  DS    CL8      7   68    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18     8   56   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      9    2    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     9   12   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     9   24   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     9   36   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   48    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     9   56   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   68    6  A  P N             T        Y              
CTAMDSEH DS    CL8                                                              
CTAMDSE  DS    CL8     11    2    8  L  P N             T        Y              
CTAFRSTH DS    CL8                                                              
CTAFRST  DS    CL11    11   12   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   24   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   36   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   48    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   56   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   68    6  A  P N             T        Y              
CTAAMEXH DS    CL8                                                              
CTAAMEX  DS    CL8     12    2    8  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   12   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   24   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   36   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   48    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   56   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   68    6  A  P N             T        Y              
CTACASHH DS    CL8                                                              
CTACASH  DS    CL8     13    2    8  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   12   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   24   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   36   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   48    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   56   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   68    6  A  P N             T        Y              
CTAHOTLH DS    CL8                                                              
CTAHOTL  DS    CL8     14    2    8  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   12   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   24   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   36   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   48    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   56   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   68    6  A  P N             T        Y              
CTASCPTH DS    CL8                                                              
CTASCPT  DS    CL8     15    2    8  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   12   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   24   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   36   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   48    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   56   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   68    6  A  P N             T        Y              
CTAOTHRH DS    CL8                                                              
CTAOTHR  DS    CL8     16    2    8  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   12   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   24   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   36   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   48    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   56   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   68    6  A  P N             T        Y              
CTATOTSH DS    CL8                                                              
CTATOTS  DS    CL8     17    2    8  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   12   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   24   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   36   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   48    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   56   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   68    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19    2    8  L  P N             T        Y              
CTACOM1H DS    CL8                                                              
CTACOM1  DS    CL65    19   12   65  A  U N             T        Y              
CTACOM2H DS    CL8                                                              
CTACOM2  DS    CL65    20   12   65  A  U N             T        Y              
CTACOM3H DS    CL8                                                              
CTACOM3  DS    CL65    21   12   65  A  U N             T        Y              
CTACOM4H DS    CL8                                                              
CTACOM4  DS    CL65    22   12   65  A  U N             T        Y              
CTAPFKYH DS    CL8                                                              
CTAPFKY  DS    CL79    24    2   79  A  P H             T        Y              
CTALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CTAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1632 BYTES                            
