*          DATA SET ACCTAF6D   AT LEVEL 005 AS OF 05/07/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61EF6D      DATE 05/07/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL12     6    2   12  L  P H             T        Y              
ODTORDNH DS    CL8                                                              
ODTORDN  DS    CL6      6   20    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   30    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     6   38   10  L  P H             T        Y              
ODTCONTH DS    CL8                                                              
ODTCONT  DS    CL5      6   51    5  A  U N             T        Y              
ODTTT1AH DS    CL8                                                              
ODTTT1A  DS    CL9      8   32    9  A  P N             T        Y              
ODTTT1BH DS    CL8                                                              
ODTTT1B  DS    CL9      8   42    9  A  P N             T        Y              
ODTTT1CH DS    CL8                                                              
ODTTT1C  DS    CL5      8   51    5  A  P N             T        Y              
ODTTT1DH DS    CL8                                                              
ODTTT1D  DS    CL11     8   57   11  A  P N             T        Y              
ODTTT1EH DS    CL8                                                              
ODTTT1E  DS    CL11     8   69   11  A  P N             T        Y              
ODTTTL2H DS    CL8                                                              
ODTTTL2  DS    CL3      9    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL25     9    6   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9      9   32    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9      9   42    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      9   52    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     9   57   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     9   69   11  A  P N             T        Y              
ODTLIN1H DS    CL8                                                              
ODTLIN1  DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL25    10    6   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     10   32    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     10   42    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   52    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    10   57   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    10   69   11  A  P N             T        Y              
ODTLIN2H DS    CL8                                                              
ODTLIN2  DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL25    11    6   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     11   32    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     11   42    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     11   52    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   57   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    11   69   11  A  P N             T        Y              
ODTLIN3H DS    CL8                                                              
ODTLIN3  DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL25    12    6   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     12   32    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     12   42    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   52    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   57   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   69   11  A  P N             T        Y              
ODTLIN4H DS    CL8                                                              
ODTLIN4  DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL25    13    6   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     13   32    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     13   42    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     13   52    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   57   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   69   11  A  P N             T        Y              
ODTLIN5H DS    CL8                                                              
ODTLIN5  DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL25    14    6   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     14   32    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     14   42    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   52    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   57   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   69   11  A  P N             T        Y              
ODTLIN6H DS    CL8                                                              
ODTLIN6  DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL25    15    6   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     15   32    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     15   42    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   52    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   57   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   69   11  A  P N             T        Y              
ODTLIN7H DS    CL8                                                              
ODTLIN7  DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL25    16    6   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     16   32    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     16   42    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   52    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   57   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   69   11  A  P N             T        Y              
ODTLIN8H DS    CL8                                                              
ODTLIN8  DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL25    17    6   25  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     17   32    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     17   42    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     17   52    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   57   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   69   11  A  P N             T        Y              
ODTTOTSH DS    CL8                                                              
ODTTOTS  DS    CL6     18    2    6  A  P N             T        Y              
ODTCTOTH DS    CL8                                                              
ODTCTOT  DS    CL11    18   57   11  A  P N             T        Y              
ODTRTOTH DS    CL8                                                              
ODTRTOT  DS    CL11    18   69   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     20    2    5  A  P N             T        Y              
ODTNAR1H DS    CL8                                                              
ODTNAR1  DS    CL70    20   10   70  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21    2    5  A  P N             T        Y              
ODTNAR2H DS    CL8                                                              
ODTNAR2  DS    CL70    21   10   70  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22    2    5  A  P N             T        Y              
ODTNAR3H DS    CL8                                                              
ODTNAR3  DS    CL70    22   10   70  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23    2    5  A  P N             T        Y              
ODTFOOTH DS    CL8                                                              
ODTFOOT  DS    CL70    23   10   70  A  U N             T        Y              
ODTPFKYH DS    CL8                                                              
ODTPFKY  DS    CL79    24    2   79  A  P H             T        Y              
ODTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
ODTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1824 BYTES                            
