*          DATA SET ACCTAF8D   AT LEVEL 007 AS OF 08/05/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61EF8D      DATE 08/05/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      6    2    5  L  P H             T        Y              
ORLMEDH  DS    CL8                                                              
ORLMED   DS    CL5      6   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     6   20   10  L  P H             T        Y              
ORLCNTRH DS    CL8                                                              
ORLCNTR  DS    CL6      6   32    6  A  U N             T        Y              
ORLCNMEH DS    CL8                                                              
ORLCNME  DS    CL25     6   40   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  L  P N             T        Y              
ORLCONTH DS    CL8                                                              
ORLCONT  DS    CL5      7   10    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      7   20    8  L  P N             T        Y              
ORLCATGH DS    CL8                                                              
ORLCATG  DS    CL10     7   32   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      7   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      9    7    6  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      9   15    8  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL12     9   25   12  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   38    6  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   46    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      9   51    8  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      9   62    4  L  P N             T        Y              
ORLSELH  DS    CL8                                                              
ORLSEL   DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    23    7   74  A  P N             T        Y              
ORLPFKYH DS    CL8                                                              
ORLPFKY  DS    CL79    24    2   79  A  P H             T        Y              
ORLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
ORLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1672 BYTES                            
