*          DATA SET ACCTAFFD   AT LEVEL 004 AS OF 09/09/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61EFFD      DATE 09/09/96                 
         SPACE 1                                                                
T61EFFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
CONHEADH DS    CL8                                                              
CONHEAD  DS    CL60     1    2   60  L  P N             T        Y              
CONSERVH DS    CL8                                                              
CONSERV  DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      2    2    6  L  P H             T        Y              
CONRECH  DS    CL8                                                              
CONREC   DS    CL8      2   10    8  A  U N             T    I   Y    2         
CONRECX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      2   20    7  L  P H             T        Y              
CONACTH  DS    CL8                                                              
CONACT   DS    CL8      2   28    8  A  U N             T        Y    4         
CONACTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      2   38    3  L  P N             T        Y              
CONKEYH  DS    CL8                                                              
CONKEY   DS    CL34     2   46   34  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      3    2    6  L  P N             T        Y              
CONWHENH DS    CL8                                                              
CONWHEN  DS    CL8      3   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      3   20    7  L  P N             T        Y              
CONOUTH  DS    CL8                                                              
CONOUT   DS    CL8      3   28    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      3   38    5  L  P N             T        Y              
CONDESTH DS    CL8                                                              
CONDEST  DS    CL8      3   46    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      3   56    7  L  P N             T        Y              
CONOTHH  DS    CL8                                                              
CONOTH   DS    CL13     3   64   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      4    2    7  L  P N             T        Y              
CONOPTH  DS    CL8                                                              
CONOPT   DS    CL65     4   10   65  A  U N             T        Y    9         
CONOPTX  DS    CL8                                                              
CONTAGH  DS    CL8                                                              
CONTAG   DS    CL1      4   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      6   38    7  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL25     8    2   25  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      8   28    8  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL15     8   38   15  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL25     9    2   25  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      9   28    8  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL27     9   38   27  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL25    10    2   25  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   28    8  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    10   38   23  L  P N             T        Y              
CONPFKYH DS    CL8                                                              
CONPFKY  DS    CL79    24    2   79  A  P N             T        Y              
CONLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CONWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 880  BYTES                            
