*          DATA SET ACCURTAB   AT LEVEL 001 AS OF 10/13/93                      
* COUNTRY / CURRENCY CODE TABLE                                                 
         DC    AL1(CTRYGBR),C'GBP'                                              
         DC    AL1(CTRYUSA),C'USD'                                              
         DC    AL1(CTRYGER),C'DEM'                                              
         DC    AL1(CTRYFRA),C'FRF'                                              
         DC    AL1(CTRYSPA),C'ESP'                                              
         DC    AL1(CTRYITA),C'ITL'                                              
         DC    AL1(CTRYHOL),C'NLG'                                              
         DC    AL1(CTRYCAN),C'CAD'                                              
         DC    AL1(CTRYIRE),C'IEP'                                              
*&&UK*&& DC    AL1(CTRYDFL),C'GBP'                                              
*&&US*&& DC    AL1(CTRYDFL),C'USD'                                              
