*          DATA SET ACENQWORK  AT LEVEL 034 AS OF 02/01/18                      
***********************************************************************         
*        GLOBAL WORKING STORAGE                                       *         
***********************************************************************         
WORKD    DSECT                                                                  
DUB      DS    D                                                                
*                                                                               
DMCB     DS    7F                                                               
PARM     DS    6F                                                               
RELO     DS    F         X         RELOCATION FACTOR                            
RECOUNT  DS    F                                                                
FULL     DS    F                                                                
         DS    2F                  N/D                                          
*                                                                               
ADEBIT   DS    A                   ADDRESS OF DEBIT FIELD                       
ACREDIT  DS    A                   ADDRESS OF CREDIT FIELD                      
ADEFCOL  DS    A                   A(DEFAULT COULMN ENTRY IN DCLTAB)            
ADISENT  DS    A                   A(DISTAB TABLE ENTRY)                        
FVADDR   DS    A                   A(INPUT FIELD HEADER) SET BY FLDVAL          
AACTINF  DS    A                   A(ACCOUNT EXTRA INFO.)                       
*                                                                               
HALF     DS    H                                                                
TERMINAL DS    H                                                                
         DS    2H                  N/D                                          
*                                                                               
SPACES   DS    CL100                                                            
WORK     DS    CL100                                                            
TEMP     DS    CL200                                                            
         DS    CL52                N/D                                          
*                                                                               
BUCKDR   DS    PL(L'BUKDR)         BUCKET DEBIT                                 
BUCKCR   DS    PL(L'BUKCR)         BUCKET CREDIT                                
PZERO    DS    PL1                 P'0'                                         
*                                                                               
CHAR     DS    C                                                                
BYTE     DS    X                                                                
BYTE1    DS    X                                                                
BYTE2    DS    X                                                                
LINSUSED DS    X                   NUM OF LINES USED BY DATA ITEM               
OFFLEN   DS    X                   SET TO LENGTH OF OFFICES (1 OR 2)            
TERMAUTH DS    CL2                 TWA AUTHORISATION CODE                       
TERMACCS DS    CL2       C         TWAACCS(2)                                   
LANG     DS    CL1                 LANGUAGE                                     
CTRY     DS    CL1                 COUNTRY                                      
*                                                                               
OPTFLAG  DS    X                   OPTION FLAG                                  
OPTFSTP  EQU   X'80'               FIRST PASS THROUGH OPTION TABLE              
OPTINLDG EQU   X'40'               INVALID LEDGER                               
OPTSVAL  EQU   X'20'               SET OPTVALUE                                 
OPTPRNT  EQU   X'10'               ENABLE PRINT OPT. IF ACTION CHANGED          
*                                                                               
SCRLFLAG DS    X                   SCROLL FLAG                                  
SCRLAMT  DS    X                   SCROLL AMOUNT                                
PFKEY    DS    X                   PFKEY PRESSED                                
TEMPCOMP DS    CL3                 TEMP SAVE OF COMP OVERRIDE INPUT             
DATEFORM DS    X                   DATE FORMAT INDICATOR                        
*                                                                               
SYSCTRY  DS    XL1                 SYSTEM COUNTRY CODE                          
SYSCEUR  EQU   1                   EUROPE                                       
SYSCNAM  EQU   2                   NORTH AMERICA                                
SYSCANY  EQU   0                   ALL CONTINENTS VALID                         
SYSCNOT  EQU   X'80'               NOT BIT (FOR TABLES)                         
*                                                                               
OFFLFLAG DS    X                   OFFAL ROUTINE RETURN FLAGS                   
OFFLFILT EQU   1                   REJECTED BY USER FILTER                      
OFFLSEC  EQU   2                   REJECTED BY SECURITY                         
*                                                                               
MYCO     DS    C                   COMPANY FOR THIS ENQUIRY                     
AGYCTRY  DS    XL1                 AGENCY COUNTRY                               
AGYLANG  DS    XL1                 AGENCY LANGUAGE                              
AGYCURR  DS    XL3                 AGENCY CURRENCY                              
TEMPASSM DS    XL1                 TEMP DATE ASSUMPTION FLAG                    
*                                                                               
DISATRIB DS    X                   DISPLAY ATTRIBUTES                           
HILIGHTQ EQU   1                   HILIGHT DISPLAY LINES                        
*                                                                               
SRCWORK  DS    CL(L'ACTKCULA-1)    SOURCE ULACC WORK AREA                       
SRCWC    DS    CL(L'CPJWRK)        SOURCE WORK CODE                             
SRCFMMD  DS    XL3                 MEDIA/MONTH DATE                             
SRCPERD  DS    XL(L'XPYPER)        MEDIA PERIOD (US ONLY)                       
SRCFTAX  DS    PL6                 GST/GST BASIS                                
*                                                                               
SRCIND   DS    X                   SOURCE INDICATOR                             
SRCJEST  EQU   1                   SOURCE ACCOUNT IS A GENUINE JOB EST          
*                                                                               
PROF1    DS    0XL16               PROFILES -1                                  
PDISCOL1 DS    XL16                                                             
*                                                                               
PROF2    DS    0XL16               PROFILES -2                                  
PDISCOL2 DS    XL9                                                              
PDETAIL  DS    CL1                 SHOW ALL TRANSACTION DETAIL (DEF NO)         
PREVS    DS    CL1                 SHOW REVERSALS IN DEFAULT DISPLAY            
PHBGOVER DS    CL1                 HOURS,BASIS OR GST COLUMN OVERRIDE           
PBALBFWD DS    CL1                 BALANCE BROUGHT FORWARD LINE                 
PBALDFLT DS    CL1                 DEFAULT TO CURRENT FISCAL YEAR               
         DS    XL24                SPARE                                        
*                                                                               
AGYSEC   DS    XL2                 SECURITY AGENCY                              
SVAGY    DS    XL2                                                              
SHIPIND  DS    XL1                 SHIPIT INDICATOR                             
         DS    XL35                N/D                                          
*                                                                               
SCANBLK  DS    CL(MAXSCAN*SCANBLKL) SCAN BLOCK                                  
         ORG   SCANBLK                                                          
UNSCANBK DS    CL(MAXUNSCN+UNSCNLNQ) UNSCAN BLOCK                               
         ORG                                                                    
*                                                                               
***********************************************************************         
*        MESSAGE VARIABLES                                            *         
***********************************************************************         
FVFLAG   DS    XL1                 FLAG BYTE USED BY FLDVAL ROUTINE             
FVHELP   DS    XL1                 HELP INDEX (ZERO=NO HELP AVAILABLE)          
FVMINL   DS    XL1                 MINIMUM INPUT LENGTH (ZERO=OPTIONAL)         
FVMAXL   DS    XL1                 MAXIMUM INPUT LENGTH (ZERO=MAXIMUM)          
FVNUMER  DS    XL1                 TREAT AS NUMERIC IF FOUND AS NUMERIC         
FVOSYS   DS    XL1                 OVERRIDE SYSTEM FOR GETTXT CALLS             
FVOMTYP  DS    XL1                 OVERRIDE MESSAGE TYPE FOR GETTXT             
FVMSGNO  DS    XL2                 MESSAGE NUMBER                               
         ORG   *-1                                                              
FVFERN   DS    XL1                                                              
FVINDX   DS    XL1                 MULTIPLE FIELD INDEX NUMBER                  
FVSUBX   DS    XL1                 MULTIPLE FIELD SUB-INDEX NUMBER              
FVCURS   DS    XL1                 DISPLACEMENT TO CURSOR WITHIN FIELD          
FVXTRA   DS    CL40                TACKED ON TO ERROR MESSAGE IF ROOM           
*                                                                               
FVIHDR   DS    0XL8                ** EXTRACTED INPUT FIELD HEADER **           
FVTLEN   DS    XL1                 L'FIELD HEADER+L'FIELD                       
*                                                                               
FVATRB   DS    XL1                 FIELD ATTRIBUTE                              
FVAPROT  EQU   X'20'               PROTECTED FIELD                              
FVAZERO  EQU   X'0C'               ZERO INTENSITY                               
FVAHIGH  EQU   X'08'               HIGH INTENSITY                               
FVAXTND  EQU   X'02'               EXTENDED HEADER                              
FVAMODF  EQU   X'01'               MODIFIED INPUT FIELD                         
*                                                                               
FVABSA   DS    XL2                 SCREEN ABSOLUTE ADDRESS                      
*                                                                               
FVIIND   DS    XL1                 INPUT VALIDATION INDICATORS                  
FVITHIS  EQU   X'80'               FIELD INPUT THIS TIME                        
FVILAST  EQU   X'40'               FIELD HAS BEEN INPUT PREVIOUSLY              
FVIVAL   EQU   X'20'               FIELD HAS BEEN VALIDATED PREVIOUSLY          
FVIINV   EQU   X'10'               FIELD IS INVALID                             
FVINUM   EQU   X'08'               FIELD IS VALID NUMERIC                       
FVIALF   EQU   X'04'               FIELD IS VALID ALPHA                         
FVIHEX   EQU   X'02'               FIELD IS VALID HEXADECIMAL                   
*                                                                               
FVILEN   DS    XL1                 ACTUAL INPUT DATA LENGTH                     
*                                                                               
FVOIND   DS    XL1                 OUTPUT INDICATORS                            
FVOXMT   EQU   X'80'               TRANSMIT FIELD                               
FVOCUR   EQU   X'40'               INSERT CURSOR TO FIELD                       
*                                                                               
FVXLEN   DS    XL1                 ACTUAL INPUT DATA LENGTH-1                   
*                                  ******                                       
*                                                                               
FVIFLD   DS    CL80                EXTRACTED & SPACE FILLED INPUT FIELD         
FVOMSG   DS    CL60                OUTPUT MESSAGE MAY BE BUILT HERE             
         DS    XL16                N/D                                          
*                                                                               
***********************************************************************         
*        COMMON TABLE ADDRESSES                                       *         
***********************************************************************         
ATABLES  DS    0A                  COMMON TABLE ADDRESSES                       
ADICUPR  DS    A                   A(UPPER CASE DICTIONARY LIST)                
ADICMIX  DS    A                   A(MIXED CASE DICTIONARY LIST)                
AACTTAB  DS    A                   A(ACTION TABE)                               
AOPTTAB  DS    A                   A(OPTION TABLE)                              
AFILTAB  DS    A                   A(FILE TABLE)                                
ACMDTAB  DS    A                   A(COMMAND TABLE)                             
APFKTAB  DS    A                   A(PFKEY TABLE)                               
ABUKTAB  DS    A                   A(BUCKET TABLE)                              
AHLPTAB  DS    A                   A(HELP TABLE)                                
ALDGTAB  DS    A                   A(LEDGER TABLE)                              
ADISTAB  DS    A                   A(DISPLAY COLUMN TABLE)                      
ADFCTAB  DS    A                   A(DEFAULT CURRENCY TABLE)                    
AELETAB  DS    A                   A(ELEMENT TABLE)                             
ADCLTAB  DS    A                   A(DEFAULT COLUMN TABLE)                      
AEIDTAB  DS    A                   A(FIS TYPE ID TABLE)                         
         DS    7A                  N/D                                          
*                                                                               
***********************************************************************         
*        UNADDRESSABLE AREAS IN W/S                                   *         
***********************************************************************         
AIO1     DS    A                   A(IOAREA 1)                                  
AIO2     DS    A                   A(IOAREA 2)                                  
AIO3     DS    A                   A(IOAREA 3)                                  
AOFFBLK  DS    A                   A(OFFAL BLOCK)                               
AJOBLOCK DS    A                   A(JOBBER BLOCK)                              
AOPTBUFF DS    A                   A(OPTIMISATION BUFFER)                       
ACOLTAB  DS    A                   A(COLUMN TABLE)                              
ACOLIST  DS    A                   A(COLUMN LIST)                               
AOPTVTAB DS    A                   A(OPT VAL TABLE)                             
AGOBLOCK DS    A                   A(GOBLOCK)                                   
ATSARREC DS    A                   A(TSAR RECORD)                               
ADUMLINE DS    A                   A(DUMMY SCREEN LINES)                        
AOFFBLK2 DS    A                   A(SECOND OFFAL BLOCK)                        
ADLCB    DS    A                   A(DOWNLOAD CONTROL BLOCK)                    
         DS    8A                  N/D                                          
*                                                                               
***********************************************************************         
*        UNADDRESSABLE AREAS IN TWA                                   *         
***********************************************************************         
AOPTVALS DS    A                   A(OPTION VALUES IN TWA)                      
ATEMPBLK DS    A                   A(TEMP BLOCK IN TWA)                         
ATSARBLK DS    A                   A(TSAR BLOCK)                                
ATSARBKB DS    A                   A(TSAR BLOCK B)                              
ASVSCRN  DS    A                   A(SCREEN RESTORE AREA)                       
ACURTAB  DS    A                   A(CURRENCY TABLE)                            
ASECBLK  DS    A                   A(SECURITY BLOCK)                            
ASVSES   DS    A                   A(SAVE SESSIONS INFO)                        
ASVTSAR  DS    A                   A(SAVED TSAR RECORD)                         
         DS    3A                  N/D                                          
*                                                                               
***********************************************************************         
*        UNADDRESSABLE AREAS IN TIA                                   *         
***********************************************************************         
         DS    10A                 N/D                                          
*                                                                               
***********************************************************************         
*        ELEMENT ADDRESSESS                                           *         
***********************************************************************         
ELEADDS  DS    0A                  ELEMENT ADDRESSES                            
APRTELD  DS    A                   A(PERSONNEL RATE ELEMENT)                    
AMDTELD  DS    A                   A(MEDIA TRANSFER ELEMENT)                    
ACPJELD  DS    A                   A(CLI/PRO/JOB ELEMENT)                       
ASPAELD  DS    A                   A(SPECIAL POSTING ACCOUNT ELEMENT)           
AAPEELD  DS    A                   A(ANALYSIS POINTER ELEMENT)                  
AOTHELD  DS    A                   A(OTHERS ELEMENT)                            
AFFNELD  DS    A                   A(FREE FORM NUMBER ELEMENT)                  
ADUEELD  DS    A                   A(DUE DATE ELEMENT)                          
ASCIELD  DS    A                   A(SUBSIDIARY CASH ELEMENT)                   
AAFPELD  DS    A                   A(ARTISTE FEE PAYMENT ELEMENT)               
ANARELD  DS    A                   A(ARTISTE FEE PAYMENT ELEMENT)               
AMPYELD  DS    A                   A(MANUAL PAYMENT ELEMENT)                    
ARALELD  DS    A                   A(RECEIVABLE ALLOCATION ELEMENT)             
APCIELD  DS    A                   A(PROJECT CONTROL INFO ELEMENT)              
ANAMELD  DS    A                   A(NAME ELEMENT)                              
AJOBELD  DS    A                   A(PRODUCTION JOB ELEMENT)                    
AADRELD  DS    A                   A(ADDRESS ELEMENT)                           
AFFTELD  DS    A                   A(FREE FORM TEXT ELEMENT)                    
AAFCELD  DS    A                   A(ACCOUNT FOREIGN CURRENCY ELEMNT)           
ASORELD  DS    A                   A(SOURCE ELEMNT)                             
ARATELD  DS    A                   A(GENERAL RATE)                              
APXDELD  DS    A                   A(TRANSFER INFORMATION)                      
AVBIELD  DS    A                   A(VAT BILLED)                                
APBIELD  DS    A                   A(PST BILLED)                                
ATPRELD  DS    A                   A(PRICE LIST INFORMATION)                    
ATRNELD  DS    A                   A(TRANSACTION)                               
ATRSELD  DS    A                   A(TRANSACTION STATUS)                        
AUNPELD  DS    A                   A(UNIT PRICE)                                
ABNDELD  DS    A                   A(BILL NUMBER/DATE)                          
APTAELD  DS    A                   A(PRODUCTION TRANSACTION ACTIVITY)           
AMXPELD  DS    A                   A(MEDIA XTRA PAYMENT ELEMENT)                
AXPYELD  DS    A                   A(XTRA PAYMENT ELEMENT)                      
AGINELD  DS    A                   A(GROUP INVOICE ELEMENT)                     
AGDAELD  DS    A                   A(GENERAL DATE ELEMENT)                      
APIDELD  DS    A                   A(PERSON ID ELEMENT)                         
APAKELD  DS    A                   A(PAYABLE KEY ELEMENT)                       
AMBIELD  DS    A                   A(BILLING XFER ELEMENT)                      
ARACELD  DS    A                   A(RECORD ACTIVITY ELEMENT)                   
ACFVELD  DS    A                   A(VENDOR CASHFLOW ELEMENT)                   
ACFRELD  DS    A                   A(RECEIVABLE CASHFLOW ELEMENT)               
AMDPELD  DS    A                   A(MEDIA TRANSFER ELEMENT-PACKED)             
         DS    1A                  N/D                                          
ELEADLN  EQU   *-ELEADDS                                                        
*                                                                               
***********************************************************************         
*        GENERAL ADDRESSES                                            *         
***********************************************************************         
AINP     DS    A                   ADDRESS OF TRANSLATO I/O BLOCK               
ABASE1   DS    A                   A(1ST BASE REGISTER)                         
ABASE2   DS    A                   A(2ND BASE REGISTER)                         
ABASE3   DS    A                   A(3RD BASE REGISTER)                         
ABASE4   DS    A                   A(4TH BASE REGISTER)                         
ACOMFACS DS    A                   A(COMMON FACILITIES)                         
ATIA     DS    A                   A(TIA)                                       
ASSB     DS    A                   A(SSB)                                       
         DS    3A                  N/D                                          
*                                                                               
***********************************************************************         
*        GENERAL ENQUIRY ROUTINES                                     *         
***********************************************************************         
AROUTS1  DS    0A                  COMMON TABLE ADDRESSES                       
ABLDDIS  DS    A                   BUILD COL HEADINGS AND DISPLACEMENTS         
ADISPFK  DS    A                   DISPLAY PFKEY LINE                           
AIO      DS    A                   I/O ROUTINE                                  
ATSARADD DS    A                   ADD A RECORD TO TSAR                         
ATSARGET DS    A                   GET A RECORD FROM TSAR                       
ADISPLAY DS    A                   DISPLAY DUMMY SCREEN LINES                   
ASCRNCLR DS    A                   CLEAR DATA LINES ON SCREEN                   
AUNITLDG DS    A                   GET UNIT/LEDGER ATTRIBUTES                   
ADISUL   DS    A                   DISPLAY UNIT/LEDGER NAMES                    
AGETJOB  DS    A                   GET A JOB RECORD                             
ACNAME   DS    A                   GET CONTRA ACCOUNT NAME                      
ASCOMP   DS    A                   STRING COMPARE                               
ADCOMP   DS    A                   DATE COMPARE                                 
AXDETDIS DS    A                   DISPLAY XTRA DETAIL LINE                     
AOFFACC  DS    A                   CHECK ACCOUNT SECURITY                       
AOFFTRN  DS    A                   CHECK TRANSACTION SECURITY                   
ABUKMAKE DS    A                   GET BUCKET AMOUNT FROM TRANSACTION           
ABLDSRC  DS    A                   GET SOURCE ACCOUNT                           
ABLOVDIS DS    A                   VALIDATE DISPLAY COLUMNS                     
AXDFCURR DS    A                   XTRA DETAIL FOREIGN CURRENCY                 
AGETCURR DS    A                   GET CURRENCY TABLE ENTRY                     
AREADUP  DS    A                   READ FILE UP FRONT                           
ANXTREC  DS    A                   GET NEXT RECORD                              
ASETELE  DS    A                   SET ELEMENT ADDRESSSES                       
AGETACC  DS    A                   GET ACCOUNT RECORD                           
ADISACC  DS    A                   DISPLAY ACCOUNT/CONTRA NAMES                 
ASCRNDIM DS    A                   GET SCREEN DIMENSIONS                        
ADEFMTH  DS    A                   GET DEFAULT MONTH RANGE                      
APERDIS  DS    A                   PERIOD DISPLAY                               
AOFFOFF  DS    A                   CHECK OFFICE/ACCOUNT RECORD                  
ASETFIS  DS    A                   SET FISCAL YEAR AND BBF OPTION               
ADISMOS  DS    A                   DISPLAY MOS AND BBF DATES                    
ADISGRD  DS    A                   DISPLAY GRID LINES                           
ADWNL    DS    A                   DOWNLOAD ROUTINE                             
AOVRSCR  DS    A                   LOAD THE PROPER SCREEN                       
ACHKACT  DS    A                   CHECK ACTION                                 
ACHKKEY  DS    A                   CHECK NEW KEY                                
*TSTOPT  DS    A                   TEST OPTIONS                                 
ATSTUL   DS    A                   TEST UNIT AND LEDGER                         
AGETEID  DS    A                   GET FIS TYPE ID NUMBER                       
ABLDDOR  DS    A                   BUILD GRID DETAIL OF REQUEST                 
AROUTS1N EQU   (*-AROUTS1)/(L'AROUTS1) NUMBER OF ENTRIES                        
*                                                                               
***********************************************************************         
*        GENERAL ROUTINE ADDRESSES                                    *         
***********************************************************************         
VACCEMU  DS    V                                                                
VDATAMGR DS    V                                                                
VCALLOV  DS    V                                                                
VDATCON  DS    V                                                                
VSCANNER DS    V                                                                
VUNSCAN  DS    V                                                                
VGETMSG  DS    V                                                                
VCASHVAL DS    V                                                                
VHEXIN   DS    V                                                                
VHEXOUT  DS    V                                                                
VGETPROF DS    V                                                                
VGETTXT  DS    V                                                                
VGETFACT DS    V                                                                
VCHOPPER DS    V                                                                
VSQASHER DS    V                                                                
VEDITOR  DS    V                                                                
CUREDIT  DS    V                                                                
VGETOPT  DS    V                                                                
VJOBBER  DS    V                                                                
VPERVAL  DS    V                                                                
VDICTATE DS    V                                                                
VADDAY   DS    V                                                                
VGETHELP DS    V                                                                
VTSAR    DS    V                                                                
VOFFAL   DS    V                                                                
VSECRET  DS    V                                                                
VPRORATA DS    V                                                                
VBLDCUR  DS    V                                                                
VXSORT   DS    V                   SORT                                         
VGETBRD  DS    V                   GET BROADCAST MONTH                          
VDLFLD   DS    V                   CONVERT DATA TO DOWNLOAD FORMAT              
VSWITCH  DS    V                   FASWITCH                                     
SHIPIT   DS    V                   SHIP IT                                      
         DS    3A                  N/D                                          
*                                                                               
***********************************************************************         
*        COMMON ROUTINES                                              *         
***********************************************************************         
ACOMMON  DS    0A                                                               
AROUT1   DS    A                   GENERAL ROUTINES                             
VJOBCOL  DS    V                   GET ESTIMATE INFO                            
VACSPLIT DS    V                   SPLIT ACCOUNT KEY                            
VPUBVAL  DS    V                   PUBVAL                                       
VACSRCHC DS    V                   SEARCH FOR ACCOUNTS                          
         DS   10A                  SPARE                                        
*                                                                               
***********************************************************************         
* I/O CONTROLLER WORK AREA                                            *         
***********************************************************************         
IOWS     DS    0X                                                               
IOADDR   DS    A                   I/O AREA ADDRESS                             
IOFILE   DS    CL7                 FILE NAME                                    
IOCMND   DS    CL7                 DATAMGR COMMAND                              
*                                                                               
IOFLAG   DS    XL1                 FLAG BYTE USED BY IO ROUTINE                 
IOFSWTCH EQU   X'80'               SYSTEM SWITCH OCCURRED FOR I/O               
*                                                                               
IOERR    DS    XL1                 I/O ERROR RETURN BYTE                        
IOEEOF   EQU   X'80'               END-OF-FILE                                  
IOEDSK   EQU   X'40'               NON-RECOVERABLE DISK ERROR                   
IOEDUP   EQU   X'20'               DUPLICATE KEY ON ADD                         
IOERNF   EQU   X'10'               RECORD NOT FOUND                             
IOEDEL   EQU   X'02'               RECORD IS DELETED                            
IOMAX    EQU   X'01'               MAX IOS COMPLETED                            
IOESWS   EQU   X'FF'               SYSTEM SWITCH ERROR OCCURRED                 
IOERRS   EQU   X'FF'               RESERVED FOR CONTROLLER USE                  
*                                                                               
IOKEY    DS    XL64                ACTUAL KEY VALUE                             
IOKEYSAV DS    XL64                SAVED ACTUAL KEY VALUE (BEFORE I/O)          
IODA     DS    XL4                 DISK ADDRESS OF D/A RECORD                   
IOWORK   DS    XL44                D/A LINKED FILES WORK AREA                   
*                                                                               
IOINDS1  DS    XL1                 INDICATOR BYTE 1                             
IOISWAUT EQU   X'80'               AUTO SWITCH BACK AFTER I/O                   
*                                                                               
IOINDS2  DS    XL1                 INDICATOR BYTE 2                             
IODAOVER DS    XL4                 OVERRIDE D/A (ALWAYS USED AND XC'D)          
         DS    XL8                 N/D                                          
IOWSX    DS    0X                                                               
*                                                                               
***********************************************************************         
* SHIPIT SAVED AREA                                                             
***********************************************************************         
SAVESHIP DS    10F                 SHIPIT SAVED AREA                            
*                                                                               
***********************************************************************         
* SPACE FOR ADDITIONAL VARIABLES                                      *         
***********************************************************************         
         DS    0F                                                               
         DS    XL54                N/D                                          
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        GLOBAL MIXED CASE DICTIONARY                                 *         
***********************************************************************         
DSMIXG   DS    0C                                                               
LC@ACC   DS    CL10                ACCOUNT                                      
LC@AMT   DS    CL7                 AMOUNT                                       
LC@CTR   DS    CL10                CONTRA                                       
LC@DOWN  DS    CL7                 DOWN                                         
LC@XJOB  DS    CL11                EXPENSE JOB                                  
LC@LGR   DS    CL10                LEDGER                                       
LC@LEFT  DS    CL7                 LEFT                                         
LC@MEMO  DS    CL5                 MEMO                                         
LC@PFK   DS    CL2                 PF, PFKEY                                    
LC@RIGHT DS    CL7                 RIGHT                                        
LC@SPLIT DS    CL7                 SPLIT                                        
LC@UNIT  DS    CL5                 UNIT                                         
LC@UP    DS    CL7                 UP                                           
LC@EXCHR DS    CL7                 XRATE, EXCHANGE RATE                         
LC@ENQRY DS    CL8                 ENQUIRY                                      
LC@KEY   DS    CL3                 KEY                                          
LC@OPTS  DS    CL8                 OPTIONS                                      
LC@NONE  DS    CL4                 NONE                                         
LC@NXT   DS    CL7                 NEXT                                         
LC@RETRN DS    CL7                 RETURN                                       
LC@DRS   DS    CL6                 DEBITS                                       
LC@CRS   DS    CL7                 CREDITS                                      
LC@OFFC  DS    CL6                 OFFICE                                       
LC@MOS   DS    CL5                 MONTH                                        
LC@CTRA  DS    CL14                CONTRA ACCOUNT                               
LC@DATE  DS    CL4                 DATE                                         
LC@STT   DS    CL6                 STATUS                                       
LC@RSNAR DS    CL9                 NARRATIVE                                    
LC@REF   DS    CL4                 REF#                                         
LC@BATS  DS    CL5                 BATCH                                        
LC@WC2   DS    CL3                 W/C                                          
LC@TOTAL DS    CL5                 TOTAL                                        
LC@INPUT DS    CL7                 INPUT                                        
LC@ON    DS    CL3                 ON                                           
LC@AND   DS    CL3                 AND                                          
LC@WITH  DS    CL4                 WITH                                         
LC@ORDER DS    CL8                 ORDER                                        
         DS    XL8                 N/D                                          
*                                                                               
***********************************************************************         
*        GLOBAL UPPER CASE DICTIONARY                                 *         
***********************************************************************         
DSUPG    DS    0C                                                               
UP@AGY   DS    CL6                 AGENCY                                       
UP@BEN   DS    CL7                 BENEFIT                                      
UP@BIL   DS    CL10                BILL                                         
UP@BOTH  DS    CL6                 BOTH                                         
UP@CHGS  DS    CL8                 CHARGES                                      
UP@DELD  DS    CL9                 DELETED                                      
UP@DUE   DS    CL10                DUE                                          
UP@EST   DS    CL7                 ESTIMATE                                     
UP@EXP   DS    CL10                EXPENSE                                      
UP@FLYMO DS    CL2                 FU, FULLY MATCHED ORDER                      
UP@HALF  DS    CL7                 HALF                                         
UP@HELP  DS    CL5                 HELP                                         
UP@IDR   DS    CL8                 INDIRECT                                     
UP@LCLCU DS    CL6                 LOCAL, LOCAL CURRENCY                        
UP@MAX   DS    CL7                 MAXIMUM                                      
UP@MOA   DS    CL5                 MONTH - MOA                                  
UP@MOS   DS    CL5                 MONTH - MOS                                  
UP@MOS3  DS    CL3                 MOS                                          
UP@NO    DS    CL4                 NO                                           
UP@ONLY  DS    CL9                 ONLY                                         
UP@OUT   DS    CL9                 OUT                                          
UP@OVEST DS    CL8                 OVEREST                                      
UP@PAGE  DS    CL7                 PAGE                                         
UP@PENSN DS    CL7                 PENSION                                      
UP@PRD   DS    CL10                PRODUCTION                                   
UP@PUR   DS    CL9                 PURCHASE                                     
UP@SLRY  DS    CL7                 SALARY                                       
UP@SRC   DS    CL9                 SOURCE                                       
UP@THRU  DS    CL5                 THRU                                         
UP@TO    DS    CL3                 TO                                           
UP@UBLD  DS    CL11                UNBILLED                                     
UP@UNEST DS    CL8                 UNDEREST                                     
UP@WC    DS    CL8                 WORKCODE                                     
UP@YES   DS    CL5                 YES                                          
UP@ZERO  DS    CL5                 ZERO                                         
*                                                                               
*                                  OPTIONS THAT MUST BE ADDRESSABLE             
UP@BALL  DS    CL(OPTLOLNQ)        BALANCE                                      
UP@CLINL DS    CL(OPTLOLNQ)        CLIENT                                       
UP@FULDS DS    CL(OPTSHLNQ)        FD, FULLDEL                                  
UP@MOA2L DS    CL(OPTLOLNQ)        MOA                                          
UP@MTHL  DS    CL(OPTLOLNQ)        MONTH                                        
UP@WCS   DS    CL(OPTSHLNQ+1)      WC, WORK CODE                                
*                                                                               
UP@BGTS  DS    CL(ACTSHLNQ)        BU, BUDGET                                   
UP@CTRLS DS    CL(ACTSHLNQ)        CL, CONTRA LIST                              
UP@CROS  DS    CL(ACTSHLNQ)        CR, CREDITOR(UK) / VE VENDOR(US)             
UP@DTLS  DS    CL(ACTSHLNQ)        DE, DETAIL                                   
UP@DTOFS DS    CL(ACTSHLNQ)        DF, DETAIL BY OFFICE                         
UP@RCVS  DS    CL(ACTSHLNQ)        DR, DEBTOR(UK) / RE RECEIVABLE(US)           
UP@DDSTS DS    CL(ACTSHLNQ)        DS, DDS STATEMENT                            
UP@JBESS DS    CL(ACTSHLNQ)        ES, JOB ESTIMATES                            
UP@ESTMS DS    CL(ACTSHLNQ)        ET, ESTIMATED TIME                           
UP@OFFMS DS    CL(ACTSHLNQ)        FM, OFFICE BY MONTH                          
UP@JBBLS DS    CL(ACTSHLNQ)        JB, JOB BILLING                              
UP@JBDTS DS    CL(ACTSHLNQ)        JD, JOB DETAIL                               
UP@JBSTS DS    CL(ACTSHLNQ)        JS, JOB STATEMENT                            
UP@LISTS DS    CL(ACTSHLNQ)        LI, LIST                                     
UP@LISEL DS    CL(ACTSHLNQ)        LS, LIST AND SELECT                          
UP@MNOFS DS    CL(ACTSHLNQ)        MF, MONTH BY OFFICE                          
UP@MNTHS DS    CL(ACTSHLNQ)        MO, MONTHLY                                  
UP@ODDES DS    CL(ACTSHLNQ)        OD, ORDER DETAIL                             
UP@ODLIS DS    CL(ACTSHLNQ)        OL, ORDER LIST                               
UP@ODSMS DS    CL(ACTSHLNQ)        OS, ORDER SUMMARY                            
UP@PFTLS DS    CL(ACTSHLNQ)        PL, PROFIT/LOSS                              
UP@REF   DS    CL(ACTSHLNQ)        RE REFERENCE (FOR REF NO SEARCH)             
UP@STOFS DS    CL(ACTSHLNQ)        SF, STATEMENT BY OFFICE                      
UP@STMTS DS    CL(ACTSHLNQ)        ST, STATEMENT                                
UP@BGTL  DS    CL(ACTLOLNQ)        BUDGET                                       
UP@CTRLL DS    CL(ACTLOLNQ)        CLIST, CONTRA LIST                           
UP@CROL  DS    CL(ACTLOLNQ)        CREDITOR(UK) / VENDOR(US)                    
UP@RCVL  DS    CL(ACTLOLNQ)        DEBTOR(UK)/RECEIVAB, RECEIVABLE(US)          
UP@DTLL  DS    CL(ACTLOLNQ)        DETAIL                                       
UP@DTOFL DS    CL(ACTLOLNQ)        DETOFF, DETAIL BY OFFICE                     
UP@DDSTL DS    CL(ACTLOLNQ)        DS, DDS STATEMENT                            
UP@ESTML DS    CL(ACTLOLNQ)        ESTTIME, ESTIMATED TIME                      
UP@JBBLL DS    CL(ACTLOLNQ)        JOBBILL, JOB BILLING                         
UP@JBDTL DS    CL(ACTLOLNQ)        JOBDET, JOB DETAIL                           
UP@JBESL DS    CL(ACTLOLNQ)        JOBEST, JOB ESTIMATES                        
UP@JBSTL DS    CL(ACTLOLNQ)        JOBSTAT, JOB STATEMENT                       
UP@LISTL DS    CL(ACTLOLNQ)        LIST                                         
UP@MNTHL DS    CL(ACTLOLNQ)        MONTHLY                                      
UP@MNOFL DS    CL(ACTLOLNQ)        MONTHOFF, MONTH BY OFFICE                    
UP@OFFML DS    CL(ACTLOLNQ)        OFFMONTH, OFFICE BY MONTH                    
UP@ODDEL DS    CL(ACTLOLNQ)        ORDDET, ORDER DETAIL                         
UP@ODLIL DS    CL(ACTLOLNQ)        ORDLIST, ORDER LIST                          
UP@ODSML DS    CL(ACTLOLNQ)        ORDSUMM, ORDER SUMMARY                       
UP@STMTL DS    CL(ACTLOLNQ)        STATMNT, STATEMENT                           
UP@STOFL DS    CL(ACTLOLNQ)        STATOFF, STATEMENT BY OFFICE                 
*                                                                               
UP@ACTS  DS    CL(OPTSHLNQ)        AD, ACTDATE, ACTIVITY DATE                   
UP@ADDS  DS    CL(OPTSHLNQ)        AD, ADDED                                    
UP@AGEIS DS    CL(OPTSHLNQ)        AG, AGEING                                   
UP@ALLS  DS    CL(OPTSHLNQ)        AL, ALL                                      
UP@ALLDS DS    CL(OPTSHLNQ)        AL, ALLDET                                   
UP@AMTS  DS    CL(OPTSHLNQ)        AM, AMOUNT                                   
UP@APRVS DS    CL(OPTSHLNQ)        AP, APPROVED                                 
UP@ATTRS DS    CL(OPTSHLNQ)        AT, ATTRIBUTE                                
UP@ATHS  DS    CL(OPTSHLNQ)        AU, AUTHORISE                                
*                                                                               
UP@BALS  DS    CL(OPTSHLNQ)        BA, BALANCE                                  
UP@BASIS DS    CL(OPTSHLNQ)        BA, BASIS                                    
UP@BATS  DS    CL(OPTSHLNQ)        BA, BATCH                                    
UP@BFWDS DS    CL(OPTSHLNQ)        BF, BFWD, BROUGHT FORWARD                    
UP@BLDS  DS    CL(OPTSHLNQ)        BI, BILLED                                   
UP@BILNS DS    CL(OPTSHLNQ)        BN, BILLNUM                                  
UP@BUCKS DS    CL(OPTSHLNQ)        BU, BUCKTYPE                                 
*                                                                               
UP@CHQDS DS    CL(OPTSHLNQ)        CD, CDATE                                    
UP@CFYS  DS    CL(OPTSHLNQ)        CF, CURRENT FISCAL YEAR                      
UP@CHGSS DS    CL(OPTSHLNQ)        CH, CHARGES                                  
UP@CHKS  DS    CL(OPTSHLNQ)        CH, CHEQUE(UK), CHECK(US)                    
UP@CLINS DS    CL(OPTSHLNQ)        CL, CLIENT                                   
UP@CLSDS DS    CL(OPTSHLNQ)        CL, CLOSED                                   
UP@CHKCS DS    CL(OPTSHLNQ)        CN, CNUM(UK), CK CKNO(US)                    
UP@CTRDS DS    CL(OPTSHLNQ)        CO, CONTRA'D(UK), OF OFFSET(US)              
UP@CRS   DS    CL(OPTSHLNQ)        CR, CREDIT                                   
UP@CURRS DS    CL(OPTSHLNQ)        CU, CURRENCY                                 
*                                                                               
UP@DATES DS    CL(OPTSHLNQ)        DA, DATE                                     
UP@DPSDS DS    CL(OPTSHLNQ)        DD, DDATE                                    
UP@DDSS  DS    CL(OPTSHLNQ)        DD, DDS                                      
UP@DENDS DS    CL(OPTSHLNQ)        DE, DEND                                     
UP@DELDS DS    CL(OPTSHLNQ)        DE, DELETED                                  
UP@DELSS DS    CL(OPTSHLNQ)        DE, DELETES                                  
UP@DETLS DS    CL(OPTSHLNQ)        DE, DETAIL                                   
UP@DRFTS DS    CL(OPTSHLNQ)        DF, DRAFT                                    
UP@DISBS DS    CL(OPTSHLNQ)        DI, DISBURSED                                
UP@DISSS DS    CL(OPTSHLNQ)        DI, DISCOUNT                                 
UP@DSPS  DS    CL(OPTSHLNQ)        DI, DISPLAY                                  
UP@DRS   DS    CL(OPTSHLNQ)        DR, DEBIT                                    
UP@DSTRS DS    CL(OPTSHLNQ)        DS, DSTART                                   
UP@DUES  DS    CL(OPTSHLNQ)        DU, DUE                                      
*                                                                               
UP@ENDS  DS    CL(OPTSHLNQ)        EN, END                                      
UP@ESTS  DS    CL(OPTSHLNQ)        ES, ESTIMATE                                 
UP@EXPAS DS    CL(OPTSHLNQ)        EX, EXPAND                                   
*                                                                               
UP@FMTCS DS    CL(OPTSHLNQ)        FM, FMATCHED                                 
UP@FXDRS DS    CL(OPTSHLNQ)        FR, FIXED REF#                               
*                                                                               
UP@GROSS DS    CL(OPTSHLNQ)        GR, GROSS                                    
*                                                                               
UP@HELDS DS    CL(OPTSHLNQ)        HE, HELD                                     
UP@HOURS DS    CL(OPTSHLNQ)        HO, HOUR                                     
*                                                                               
UP@INCMS DS    CL(OPTSHLNQ)        IN, INCREMENT                                
UP@INVS  DS    CL(OPTSHLNQ)        IN, INVOICE                                  
*                                                                               
UP@JOBS  DS    CL(OPTSHLNQ)        JB, JOB                                      
*                                                                               
UP@LEVES DS    CL(OPTSHLNQ)        LE, LEVEL                                    
UP@LCKES DS    CL(OPTSHLNQ)        LO, LOCKED                                   
*                                                                               
UP@MANUS DS    CL(OPTSHLNQ)        MA, MANUAL                                   
UP@MEDS  DS    CL(OPTSHLNQ)        ME, MEDIA                                    
UP@MEMOS DS    CL(OPTSHLNQ)        ME, MEMO                                     
UP@MERGS DS    CL(OPTSHLNQ)        ME, MERGE                                    
UP@METHS DS    CL(OPTSHLNQ)        ME, METHOD                                   
UP@MOA2S DS    CL(OPTSHLNQ)        MO, MOA                                      
UP@MTHS  DS    CL(OPTSHLNQ)        MO, MONTH                                    
*                                                                               
UP@NETS  DS    CL(OPTSHLNQ)        NE, NET                                      
UP@NEGS  DS    CL(OPTSHLNQ)        NG, NEGATIVE                                 
*                                                                               
UP@ORDDS DS    CL(OPTSHLNQ)        OD, ODATE                                    
UP@OFFDS DS    CL(OPTSHLNQ)        OD, OFFICE DETAIL                            
UP@OFFS  DS    CL(OPTSHLNQ)        OF, OFFICE                                   
UP@OPNDS DS    CL(OPTSHLNQ)        OP, OPEN DATE                                
UP@ORDES DS    CL(OPTSHLNQ)        OR, ORDER                                    
UP@ORDSS DS    CL(OPTSHLNQ)        OR, ORDERS                                   
UP@OVRIS DS    CL(OPTSHLNQ)        OV, OVERRIDE                                 
*                                                                               
UP@PAIDS DS    CL(OPTSHLNQ)        PA, PAID                                     
UP@PARDS DS    CL(OPTSHLNQ)        PD, PARTDEL                                  
UP@PAYDS DS    CL(OPTSHLNQ)        PD, PAYDATE                                  
UP@PELDS DS    CL(OPTSHLNQ)        PD, PEELDATE                                 
UP@PELES DS    CL(OPTSHLNQ)        PE, PEELED                                   
UP@PROJS DS    CL(OPTSHLNQ)        PJ, PROJOB                                   
UP@PTYMS DS    CL(OPTSHLNQ)        PM, PMATCHED                                 
UP@PAYRS DS    CL(OPTSHLNQ)        PR, PAYREF                                   
UP@PROS  DS    CL(OPTSHLNQ)        PR, PRODUCT                                  
UP@PSTS  DS    CL(OPTSHLNQ)        PS, PST                                      
UP@PAYTS DS    CL(OPTSHLNQ)        PT, PAY TYPE                                 
*                                                                               
UP@RCNDS DS    CL(OPTSHLNQ)        RC, RECONCILED                               
UP@REFS  DS    CL(OPTSHLNQ)        RE, REFERENCE                                
UP@RUNNS DS    CL(OPTSHLNQ)        RU, RUN NUMBER                               
UP@RVRSS DS    CL(OPTSHLNQ)        RV, REVERSALS                                
*                                                                               
UP@SELS  DS    CL(OPTSHLNQ)        SE, SELECT                                   
UP@SERNS DS    CL(OPTSHLNQ)        SE, SERIAL NUMBER                            
UP@SHOWS DS    CL(OPTSHLNQ)        SH, SHOW                                     
UP@SRCS  DS    CL(OPTSHLNQ)        SO, SOURCE                                   
UP@STMDS DS    CL(OPTSHLNQ)        ST, STADATE                                  
UP@STRTS DS    CL(OPTSHLNQ)        ST, START                                    
UP@SUBRS DS    CL(OPTSHLNQ)        SU, SUB-REFERENCE                            
UP@SMYS  DS    CL(OPTSHLNQ)        SU, SUMMARY                                  
UP@SUPS  DS    CL(OPTSHLNQ)        SU, SUPPLIER(UK), VE VENDOR(US)              
*                                                                               
UP@TAXS  DS    CL(OPTSHLNQ)        TA, TAX                                      
UP@TIMES DS    CL(OPTSHLNQ)        TI, TIME                                     
UP@TTYPS DS    CL(OPTSHLNQ)        TT, TIME TYPE                                
UP@TYPES DS    CL(OPTSHLNQ)        TY, TYPE                                     
*                                                                               
UP@USEDS DS    CL(OPTSHLNQ)        UD, USEDATE                                  
UP@UBLDS DS    CL(OPTSHLNQ)        UN, UNBILLED                                 
UP@URGS  DS    CL(OPTSHLNQ)        UR, URGENT                                   
*                                                                               
UP@VALUS DS    CL(OPTSHLNQ)        VA, VALUE                                    
UP@VATS  DS    CL(OPTSHLNQ)        VA, VAT RATE(UK), GS GST(UK)                 
UP@VOIDS DS    CL(OPTSHLNQ)        VO, VOID                                     
*                                                                               
UP@XDS   DS    CL(OPTSHLNQ)        XD, XDETAIL                                  
*                                                                               
UP@11DES DS    CL(OPTSHLNQ)        11, 11DET                                    
UP@12DES DS    CL(OPTSHLNQ)        12, 12DET                                    
UP@13DES DS    CL(OPTSHLNQ)        13, 13DET                                    
UP@14DES DS    CL(OPTSHLNQ)        14, 14DET                                    
UP@15DES DS    CL(OPTSHLNQ)        15, 15DET                                    
UP@16DES DS    CL(OPTSHLNQ)        16, 16DET                                    
*                                                                               
UP@ACTL  DS    CL(OPTLOLNQ)        ACTDATE (ACTIVITY DATE)                      
UP@ADDL  DS    CL(OPTLOLNQ)        ADDED                                        
UP@AGEIL DS    CL(OPTLOLNQ)        AGEING                                       
UP@ALLL  DS    CL(OPTLOLNQ)        ALL                                          
UP@ALLDL DS    CL(OPTLOLNQ)        ALLDET                                       
UP@AMTL  DS    CL(OPTLOLNQ)        AMOUNT                                       
UP@APRVL DS    CL(OPTLOLNQ)        APPROVED                                     
UP@ATTRL DS    CL(OPTLOLNQ)        ATTRIBUTE                                    
UP@ATHL  DS    CL(OPTLOLNQ)        AUTHORISE                                    
*                                                                               
UP@BASIL DS    CL(OPTLOLNQ)        BASIS                                        
UP@BATL  DS    CL(OPTLOLNQ)        BATCH                                        
UP@BFWDL DS    CL(OPTLOLNQ)        BFWD, BROUGHT FORWARD                        
UP@BLDL  DS    CL(OPTLOLNQ)        BILLED                                       
UP@BILNL DS    CL(OPTLOLNQ)        BILLNUM                                      
UP@BUCKL DS    CL(OPTLOLNQ)        BUCKTYPE                                     
*                                                                               
UP@CHQDL DS    CL(OPTLOLNQ)        CDATE                                        
UP@CFYL  DS    CL(OPTLOLNQ)        CF, CURRENT FISCAL YEAR                      
UP@CHGSL DS    CL(OPTLOLNQ)        CHARGES                                      
UP@CHKL  DS    CL(OPTLOLNQ)        CHEQUE(UK), CHECK(US)                        
UP@CHKCL DS    CL(OPTLOLNQ)        CNUM(UK), CKNO(US)                           
UP@CLSDL DS    CL(OPTLOLNQ)        CLOSED                                       
UP@CTRDL DS    CL(OPTLOLNQ)        CONTRA'D(UK), OFFSET(US)                     
UP@CRL   DS    CL(OPTLOLNQ)        CREDIT                                       
UP@CURRL DS    CL(OPTLOLNQ)        CURRENCY                                     
*                                                                               
UP@DATEL DS    CL(OPTLOLNQ)        DATE                                         
UP@DPSDL DS    CL(OPTLOLNQ)        DDATE                                        
UP@DDSL  DS    CL(OPTLOLNQ)        DDS                                          
UP@DRL   DS    CL(OPTLOLNQ)        DEBIT                                        
UP@DELDL DS    CL(OPTLOLNQ)        DELETED                                      
UP@DELSL DS    CL(OPTLOLNQ)        DELETES                                      
UP@DENDL DS    CL(OPTLOLNQ)        DEND                                         
UP@DETLL DS    CL(OPTLOLNQ)        DETAIL                                       
UP@DISBL DS    CL(OPTLOLNQ)        DISBURSED                                    
UP@DISSL DS    CL(OPTLOLNQ)        DISCOUNT                                     
UP@DSPL  DS    CL(OPTLOLNQ)        DISPLAY                                      
UP@DRFTL DS    CL(OPTLOLNQ)        DRAFT                                        
UP@DSTRL DS    CL(OPTLOLNQ)        DSTART                                       
UP@DUEL  DS    CL(OPTLOLNQ)        DUE                                          
*                                                                               
UP@ENDL  DS    CL(OPTLOLNQ)        END                                          
UP@ESTL  DS    CL(OPTLOLNQ)        ESTIMATE                                     
UP@EXPAL DS    CL(OPTLOLNQ)        EXPAND                                       
*                                                                               
UP@FXDRL DS    CL(OPTLOLNQ)        FIXED REF#                                   
UP@FMTCL DS    CL(OPTLOLNQ)        FMATCHED                                     
UP@FULDL DS    CL(OPTLOLNQ)        FULLDEL                                      
*                                                                               
UP@GROSL DS    CL(OPTLOLNQ)        GROSS                                        
*                                                                               
UP@HELDL DS    CL(OPTLOLNQ)        HELD                                         
UP@HOURL DS    CL(OPTLOLNQ)        HOUR                                         
*                                                                               
UP@INCML DS    CL(OPTLOLNQ)        INCREMENT                                    
UP@INVL  DS    CL(OPTLOLNQ)        INVOICE                                      
*                                                                               
UP@JOBL  DS    CL(OPTLOLNQ)        JOB                                          
*                                                                               
UP@LEVEL DS    CL(OPTLOLNQ)        LEVEL                                        
UP@LCKEL DS    CL(OPTLOLNQ)        LOCKED                                       
*                                                                               
UP@MANUL DS    CL(OPTLOLNQ)        MANUAL                                       
UP@MEDL  DS    CL(OPTLOLNQ)        MEDIA                                        
UP@MEMOL DS    CL(OPTLOLNQ)        MEMO                                         
UP@MERGL DS    CL(OPTLOLNQ)        MERGE                                        
UP@METHL DS    CL(OPTLOLNQ)        METHOD                                       
*                                                                               
UP@NEGL  DS    CL(OPTLOLNQ)        NEGATIVE                                     
UP@NETL  DS    CL(OPTLOLNQ)        NET                                          
*                                                                               
UP@OFFDL DS    CL(OPTLOLNQ)        OD, OFFICE DETAIL                            
UP@ORDDL DS    CL(OPTLOLNQ)        ODATE                                        
UP@OFFL  DS    CL(OPTLOLNQ)        OFFICE                                       
UP@OPNDL DS    CL(OPTLOLNQ)        OPEN DATE                                    
UP@ORDEL DS    CL(OPTLOLNQ)        ORDER                                        
UP@ORDSL DS    CL(OPTLOLNQ)        ORDERS                                       
UP@OVRIL DS    CL(OPTLOLNQ)        OVERRIDE                                     
*                                                                               
UP@PAIDL DS    CL(OPTLOLNQ)        PAID                                         
UP@PARDL DS    CL(OPTLOLNQ)        PARTDEL                                      
UP@PAYTL DS    CL(OPTLOLNQ)        PAY TYPE                                     
UP@PAYDL DS    CL(OPTLOLNQ)        PAYDATE                                      
UP@PAYRL DS    CL(OPTLOLNQ)        PAYREF                                       
UP@PELDL DS    CL(OPTLOLNQ)        PEELDATE                                     
UP@PELEL DS    CL(OPTLOLNQ)        PEELED                                       
UP@PTYML DS    CL(OPTLOLNQ)        PMATCHED                                     
UP@PROL  DS    CL(OPTLOLNQ)        PRODUCT                                      
UP@PROJL DS    CL(OPTLOLNQ)        PROJOB                                       
UP@PSTL  DS    CL(OPTLOLNQ)        PST                                          
*                                                                               
UP@RCNDL DS    CL(OPTLOLNQ)        RECONCILED                                   
UP@REFL  DS    CL(OPTLOLNQ)        REFERENCE                                    
UP@RVRSL DS    CL(OPTLOLNQ)        REVERSALS                                    
UP@RUNNL DS    CL(OPTLOLNQ)        RUN NUMBER                                   
*                                                                               
UP@SELL  DS    CL(OPTLOLNQ)        SELECT                                       
UP@SERNL DS    CL(OPTLOLNQ)        SERIAL#                                      
UP@SHOWL DS    CL(OPTLOLNQ)        SHOW                                         
UP@SRCL  DS    CL(OPTLOLNQ)        SOURCE                                       
UP@STMDL DS    CL(OPTLOLNQ)        STADATE                                      
UP@STRTL DS    CL(OPTLOLNQ)        START                                        
UP@SUBRL DS    CL(OPTLOLNQ)        SUBREF                                       
UP@SMYL  DS    CL(OPTLOLNQ)        SUMMARY                                      
UP@SUPL  DS    CL(OPTLOLNQ)        SUPPLIER(UK), VENDOR(US)                     
*                                                                               
UP@TAXL  DS    CL(OPTLOLNQ)        TAX                                          
UP@TIMEL DS    CL(OPTLOLNQ)        TIME                                         
UP@TTYPL DS    CL(OPTLOLNQ)        TTYPE                                        
UP@TYPEL DS    CL(OPTLOLNQ)        TYPE                                         
*                                                                               
UP@UBLDL DS    CL(OPTLOLNQ)        UNBILLED                                     
UP@URGL  DS    CL(OPTLOLNQ)        URGENT                                       
UP@USEDL DS    CL(OPTLOLNQ)        USEDATE                                      
*                                                                               
UP@VATL  DS    CL(OPTLOLNQ)        VAT(UK), GST(US)                             
UP@VALUL DS    CL(OPTLOLNQ)        VALUE                                        
UP@VOIDL DS    CL(OPTLOLNQ)        VOID                                         
*                                                                               
UP@WCL   DS    CL(OPTLOLNQ)        WORK CODE                                    
*                                                                               
UP@XDL   DS    CL(OPTLOLNQ)        XDETAIL                                      
*                                                                               
UP@11DEL DS    CL(OPTLOLNQ)        11DET                                        
UP@12DEL DS    CL(OPTLOLNQ)        12DET                                        
UP@13DEL DS    CL(OPTLOLNQ)        13DET                                        
UP@14DEL DS    CL(OPTLOLNQ)        14DET                                        
UP@15DEL DS    CL(OPTLOLNQ)        15DET                                        
UP@16DEL DS    CL(OPTLOLNQ)        16DET                                        
*                                                                               
UP@CLRDS DS    CL(OPTSHLNQ)        CE, CLEARED                                  
UP@CLRDL DS    CL(OPTLOLNQ)        CE, CLEARED                                  
UP@STMNL DS    CL(OPTLOLNQ)        ST, STATEMENT                                
UP@TRNOS DS    CL(OPTSHLNQ)        TF, TOFFICE                                  
UP@TRNOL DS    CL(OPTLOLNQ)        TF, TOFFICE                                  
*                                                                               
UP@VNDCF DS    CL(ACTSHLNQ)        VC, VENDOR CASHFLOW                          
UP@VNDCL DS    CL(ACTLOLNQ)        VC, VENDOR CASHFLOW                          
UP@JOBCF DS    CL(ACTSHLNQ)        JC, JOB CASHFLOW                             
UP@JOBCL DS    CL(ACTLOLNQ)        JC, JOB CASHFLOW                             
*                                                                               
UP@KEYRS DS    CL(OPTSHLNQ)        KR, KEY REFERENCE                            
UP@KEYRL DS    CL(OPTLOLNQ)        KR, KEYREF                                   
*                                                                               
UP@PAPPL DS    CL(OPTLOLNQ)        PA, PAPPROVED                                
UP@REJEL DS    CL(OPTLOLNQ)        RE, REJECTED                                 
UP@SUBML DS    CL(OPTLOLNQ)        SU, SUBMITTED                                
UP@INPRS DS    CL(OPTSHLNQ)        IP, IN PROGRESS                              
UP@INPRL DS    CL(OPTLOLNQ)        INPROGRESS                                   
*                                                                               
**UP@RCVDS DS    CL(OPTSHLNQ)        RC, RECEIVED AC#RCVE                       
**UP@RCVDL DS    CL(OPTLOLNQ)        RC, RECEIVED AC#RCVE                       
*                                                                               
UP@STT   DS    CL(OPTSHLNQ)        STATUS= OPTION                               
UP@STTL  DS    CL(OPTLOLNQ)        STATUS= OPTION / LONG                        
UP@ENQEL DS    CL(ACTSHLNQ)        MCS ESTIMATES LIST                           
UP@ENQED DS    CL(ACTSHLNQ)        MCS ESTIMATES DETAILS                        
UP@EXCLS DS    CL(ACTSHLNQ)        EC, EXPENSE CLAIMS                           
UP@EXCLL DS    CL(ACTLOLNQ)        EXPENSE CLAIMS                               
*                                                                               
         DS    XL5                 N/D                                          
*                                                                               
***********************************************************************         
*        LOCAL WORKING STORAGE FOR OVERLAYS                           *         
***********************************************************************         
         DS    0D                                                               
OVERWORK DS    XL2048              AVAILABLE TO OVERLAY                         
*                                                                               
***********************************************************************         
*        UNADDRESSABLE WORK AREAS                                     *         
***********************************************************************         
OFFBLK   DS    XL(OFFALLEN)        OFFAL BLOCK                                  
JOBLOCK  DS    (JBLOCKL)X          JOBBER BLOCK                                 
OPTBUFF  DS    XL3000              OPTIMISATION BUFFER                          
COLTAB   DS    XL3600                                                           
COLIST   DS    XL200                                                            
OPTVTAB  DS    XL3600                                                           
MYGOBLCK DS    XL(L'GOBLOCK)                                                    
IOAREALN EQU   2000+L'IODA+L'IOWORK ** I/O AREAS **                             
IOAREA1  DS    (IOAREALN)X                                                      
IOAREA2  DS    (IOAREALN)X                                                      
IOAREA3  DS    (IOAREALN)X                                                      
IOAREAS  EQU   (*-IOAREA1)/IOAREALN                                             
TSARREC  DS    CL(TSARRECL)        TSAR RECORD BLOCK                            
DUMLINE  DS    CL(DUMLINLN)        DUMMY SCREEN LINE BLOCK                      
OFFBLK2  DS    XL(OFFALLEN)        SECOND OFFAL BLOCK                           
DLCB     DS    XL(DLCBXLX)         DOWNLOAD CONTROL BLOCK                       
WORKX    DS    0H                                                               
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        WORKING STORAGE FOR BUILD COL HEADS AND DISPLACEMENTS        *         
***********************************************************************         
BDWORKD  DSECT                     ** IOEX S/R LOCAL W/S **                     
BDFULL   DS    F                                                                
BDTEMP   DS    XL64                                                             
BDWORK   DS    XL64                                                             
BDSAVE   DS    XL64                                                             
BDFLAG   DS    XL1                                                              
BDFPASS2 EQU   X'80'               SECOND PASS                                  
BDFINVRT EQU   X'40'               INVERTED LIST                                
BDCOLS   DS    XL1                                                              
BDWORKX  EQU   *                                                                
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        WORKING STORAGE FOR IO MODULE                                *         
***********************************************************************         
IOWORKD  DSECT                     ** IOEX S/R LOCAL W/S **                     
IODUB    DS    D                   GENERAL WORK AREA                            
IOAREAD  DS    A                   I/O AREA ADDRESS                             
IOCTRL   DS    F                   I/O COMMAND WORD                             
IOBYTE   DS    X                   I/O BYTE                                     
IOQ      DS    X                   I/O COMMAND QUALIFIER (RFU/DELETES)          
*                                                                               
IOFILV   DS    0XL15               EXTRACTED FILE VALUES (THIS I/O)             
IOFILNO  DS    X                   FILE NUMBER                                  
IOFILNM  DS    CL7                 FILE NAME                                    
IOFILI   DS    X                   FILE INDICATORS - 1                          
IOFILI2  DS    X                   FILE INDICATORS - 2                          
IOFILN2  DS    X                   FILE NUMBER 2 (I/S D/A PAIR)                 
IOFILKL  DS    X                   KEY LENGTH                                   
*                                                                               
IOFILCL  DS    X                   CONTROL LENGTH                               
IOFILDE  EQU   IOFILCL             DISPLACEMENT TO FIRST ELEMENT                
*                                                                               
IOFILML  DS    XL2                 MAXIMUM RECORD LENGTH                        
*                                                                               
IOCMDV   DS    0XL10               EXTRACTED COMMAND VALUES (THIS I/O)          
IOCMDNM  DS    CL7                 COMMAND NAME                                 
IOCMDNO  DS    X                   COMMAND NUMBER                               
IOCMDI   DS    X                   COMMAND INDICATORS - 1                       
IOCMDI2  DS    X                   COMMAND INDICATORS - 2                       
*                                                                               
IOSWSYS  DS    XL1                 SWITCH SYSTEM NUMBER                         
IOSWFIL  DS    XL1                 SWITCH FILE NUMBER                           
IOSWSYSN DS    CL3                 SWITCH SYSTEM NAME                           
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        I/O CONTROLLER EQUATES *                                               
***********************************************************************         
IOFILES  EQU   X'0F00'             RESERVED FOR CONTROLLER USE                  
IOGENDIR EQU   X'0100'             I/O TO GENERAL DIRECTORY                     
IOGENFIL EQU   X'0200'             I/O TO GENERAL FILE                          
IOCONFIL EQU   X'0300'             I/O TO CONTROL FILE (CONTROL SYSTEM)         
IOACCFIL EQU   X'0100'             I/O TO ACCOUNT FILE                          
IOACCDIR EQU   X'0200'             I/O TO ACCDIR                                
IOACCMST EQU   X'0300'             I/O TO ACCMST                                
IOACCARC EQU   X'0400'             I/O TO ACCARC                                
IOCTFILE EQU   X'0F00'             I/O TO CONTROL FILE (OTHER SYSTEMS)          
*                                                                               
*                                  ** I/O AREA EQUATES **                       
IO1      EQU   X'0040'             I/O AREA 1 TO BE USED FOR I/O                
IO2      EQU   X'0080'             I/O AREA 2 TO BE USED FOR I/O                
IO3      EQU   X'00C0'             I/O AREA 3 TO BE USED FOR I/O                
*                                                                               
*                                  ** I/O COMMAND EQUATES **                    
IOCMNDS  EQU   X'000F'             RESERVED FOR CONTROLLER USE                  
IOLOCK   EQU   X'0010'             READ FOR UPDATE                              
IORDEL   EQU   X'0020'             READ DELETED RECORDS                         
IOHIGH   EQU   X'0001'             DMRDHI                                       
IOHI     EQU   IOHIGH              DMRDHI                                       
IOHID    EQU   IOHI+IORDEL         DMRDHI (FOR DELETES)                         
IOHIUP   EQU   IOHI+IOLOCK         DMRDHI (FOR UPDATE)                          
IOHIUPD  EQU   IOHI+IOLOCK+IORDEL  DMRDHI (FOR UPDATE & DELETES)                
IOREAD   EQU   X'0002'             DMREAD                                       
IORD     EQU   IOREAD              DMREAD                                       
IORDD    EQU   IORD+IORDEL         DMREAD (FOR DELETES)                         
IORDUP   EQU   IORD+IOLOCK         DMREAD (FOR UPDATE)                          
IORDUPD  EQU   IORD+IOLOCK+IORDEL  DMREAD (FOR UPDATE & DELETES)                
IOSEQ    EQU   X'0003'             DMRSEQ                                       
IOSQ     EQU   IOSEQ               DMRSEQ                                       
IOSQD    EQU   IOSQ+IORDEL         DMRSEQ (FOR DELETES)                         
IOSQUP   EQU   IOSQ+IOLOCK         DMRSEQ (FOR UPDATE)                          
IOSQUPD  EQU   IOSQ+IOLOCK+IORDEL  DMRSEQ (FOR UPDATE & DELETES)                
IOGET    EQU   X'0004'             GETREC                                       
IOGETRUP EQU   IOGET+IOLOCK        GETREC (FOR UPDATE)                          
IOADD    EQU   X'0005'             DMADD                                        
IOADDREC EQU   X'0005'             ADDREC                                       
IOWRITE  EQU   X'0006'             DMWRT                                        
IOPUT    EQU   X'0006'             PUTREC                                       
IOPUTREC EQU   IOPUT               PUTREC                                       
IOUNLOCK EQU   X'0007'             DMUNLK                                       
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        ACTION EQUATES                                               *         
***********************************************************************         
ACTNNBUD EQU   1                   BUDGET                                       
ACTNCONT EQU   2                   CONTRA LIST                                  
ACTNCRED EQU   3                   CREDITORS (UK)                               
ACTNDETL EQU   4                   DETAIL                                       
ACTNDEBT EQU   5                   DEBTORS (UK)                                 
ACTNJBES EQU   6                   JOB ESTIMATE                                 
ACTNETIM EQU   7                   ESTIMATED TIME                               
ACTNJBBL EQU   8                   JOB BILLING                                  
ACTNJBDE EQU   9                   JOB DETAIL                                   
ACTNJBST EQU   10                  JOB STATEMENT                                
ACTNLIST EQU   11                  LIST                                         
ACTNMNTH EQU   12                  MONTHLY                                      
ACTNODDE EQU   13                  ORDER DETAIL                                 
ACTNODLI EQU   14                  ORDER LIST                                   
ACTNODSM EQU   15                  ORDER SUMMARY                                
ACTNRECV EQU   16                  RECEIVABLES (US)                             
ACTNSTMT EQU   17                  STATEMENT                                    
ACTNVEND EQU   18                  VENDORS (US)                                 
ACTNDTOF EQU   19                  DETAIL BY OFFICE (US)                        
ACTNOFMN EQU   20                  OFFICE BY MONTH (US)                         
ACTNMNOF EQU   21                  MONTH BY OFFICE (US)                         
ACTNSTOF EQU   22                  STATEMENT BY OFFICE (US)                     
ACTNPFLS EQU   23                  PROFIT AND LOSS                              
ACTNRAGE EQU   24                  AGING (US)                                   
ACTNLSLT EQU   25                  LIST AND SELECT                              
ACTNVICF EQU   26                  CASHFLOW VENDOR INVOICE                      
ACTNJBCF EQU   27                  CASHFLOW JOB DETAIL                          
ACTNRNSU EQU   28                  REFERENCE NUMBER SEARCH UTILITY              
ACTNAGPL EQU   29                  AGENCY PROFIT AND LOSS                       
ACTNESTL EQU   30                  MCS ESTIMATES - LIST                         
ACTNESTD EQU   31                  MCS ESTIMATES - DETAILS                      
ACTNCLMS EQU   32                  EXPENSE CLAIMS                               
ACTNALLX EQU   255                 INDICATES 'ALL EXCEPT' ACTION LIST           
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        COLUMN EQUATES                                               *         
***********************************************************************         
COLOFFQ  EQU   C'1'                OFFICE                                       
COLCONQ  EQU   C'3'                U/L/CONTRA                                   
COLDATQ  EQU   C'4'                DATE                                         
COLREFQ  EQU   C'5'                REFERENCE                                    
COLMOSQ  EQU   C'6'                MONTH OF SERVICE                             
COLBATQ  EQU   C'7'                BATCH REFERENCE                              
COLNETQ  EQU   C'8'                AMOUNT                                       
COLCRSQ  EQU   C'A'                CREDIT                                       
COLJOBQ  EQU   C'C'                JOB                                          
COLSRCQ  EQU   C'D'                SOURCE ACCOUNT                               
COLPYMQ  EQU   C'E'                PAYMENT REF                                  
COLFWKQ  EQU   C'G'                FREEFORM WORKCODE IN CPJEL (CA)              
COLFOTQ  EQU   C'H'                FREEFORM NUMBER IN OTHEL (CA)                
COLNUMQ  EQU   C'I'                TSAR RECORD NUMBER                           
COLDSCQ  EQU   C'J'                DISCOUNT AMOUNT (CD,BV)                      
COLGSTQ  EQU   C'K'                CANADIAN GST                                 
COLBALQ  EQU   C'L'                BALANCE                                      
COLADAQ  EQU   C'M'                ACTIVITY DATE                                
COLBTYQ  EQU   C'N'                BATCH TYPE                                   
COLPSTQ  EQU   C'P'                CANADIAN PST                                 
COLXSTQ  EQU   C'Q'                EXTRA STATUS DETAIL                          
COLUSEQ  EQU   C'R'                USED DATE                                    
COLMIVQ  EQU   C'S'                MEDIA SERIAL NUMBER                          
COLMINQ  EQU   C'S'                MEDIA INVOICE NUMBER                         
COLPERDQ EQU   C'T'                MEDIA PERIOD                                 
COLNARRQ EQU   C'U'                NARRATIVE                                    
COLMMOSQ EQU   C'V'                MEDIA MOS                                    
COLPDUEQ EQU   C'W'                PAYMENT DUE DATE                             
COLPDATQ EQU   C'Y'                CHEQUE DATE                                  
COLTSTAQ EQU   C'#'                TRANSACTION STATUS                           
COLATYQ  EQU   C'%'                APPROVAL METHOD                              
COLTSRFQ EQU   C'<'                TRANSACTION SUB REF                          
COLDAQ   EQU   C'('                DISK ADDRESS                                 
*                                                                               
PL#CAC   EQU   C'3'                CONTRA ACCOUNT                               
PL#CACN  EQU   C'4'                CONTRA ACCOUNT NAME                          
PL#AAMT  EQU   C'5'                ACTUAL AMOUNT                                
PL#PAMT  EQU   C'6'                PREVIOUS ACTUAL AMOUNT                       
PL#ASAL  EQU   C'7'                SALARY PAYMENT TYPE                          
PL#APEN  EQU   C'8'                PENSION PAYMENT TYPE                         
PL#ABEN  EQU   C'9'                BENEFITS PAYMENT TYPE                        
PL#AIND  EQU   C'A'                INDIRECT                                     
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        PFKEY EQUATES                                                *         
***********************************************************************         
PF1      EQU   1                                                                
PF2      EQU   2                                                                
PF3      EQU   3                                                                
PF4      EQU   4                                                                
PF5      EQU   5                                                                
PF6      EQU   6                                                                
PF7      EQU   7                                                                
PF8      EQU   8                                                                
PF9      EQU   9                                                                
PF10     EQU   10                                                               
PF11     EQU   11                                                               
PF12     EQU   12                                                               
PF13     EQU   13                                                               
PF14     EQU   14                                                               
PF15     EQU   15                                                               
PF16     EQU   16                                                               
PF17     EQU   17                                                               
PF18     EQU   18                                                               
PF19     EQU   19                                                               
PF20     EQU   20                                                               
PF21     EQU   21                                                               
PF22     EQU   22                                                               
PF23     EQU   23                                                               
PF24     EQU   24                                                               
*                                                                               
DEFLTPF  EQU   PF8                 DEFAULT SCROLL ACTION                        
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        ERROR AND INFORMATION SCREEN MESSAGE EQUATES                 *         
***********************************************************************         
ERRORMSG EQU   C'E'                ERROR MESSAGE                                
INFOMSG  EQU   C'I'                INFORMATION MESSAGE                          
*                                                                               
EAWRNGLV EQU   0065                WRONG LEVEL ACCOUNT FOR THIS ENQUIRY         
EABUDNF  EQU   0100                BUDGET TYPE DOES NOT EXIST                   
EAIFNTFN EQU   0169                ACCOUNT NOT FOUND                            
EAPLSTR  EQU   0175                START DATE NEEDED FOR P&L LEDGERS            
EAAGEMO  EQU   0279                MOS AGE CANNOT BE DONE WITH COL INC          
EALDGINV EQU   1000                INVALID LEDGER                               
EAACCINV EQU   1001                INVALID ACCOUNT                              
EAAMTINV EQU   1003                INVALID AMOUNT                               
EASECLOC EQU   1005                SECURITY LOCKOUT                             
EASCRINV EQU   1006                INVALID SCROLL FIELD                         
EATRNMAX EQU   1008                TOO MANY TRANSACTIONS                        
EARNGINV EQU   1009                RANGE INVALID - START GT END                 
EAACCDUP EQU   1012                DUPLICATED ACCOUNT CODE                      
EAMNYTRN EQU   1092                TO MANY TRANSACTIONS - REDUCE MOA            
EANOJOBS EQU   1101                NO MORE JOBS                                 
EANOACCS EQU   1102                NO MORE ACCOUNTS                             
EAMIXOF1 EQU   1103                MIXED OFFICES                                
EAMIXOF2 EQU   1104                MIXED OFFICES - TRY OFFICE OPTION            
EAMUMTNZ EQU   1105                MATCHED/UNMATCHED TOTALS NOT ZERO            
EAMINECH EQU   1106                MATCHED INVOICE TOTAL NOT EQUAL CHQ          
EAWIOFCH EQU   1107                WRONG INVOICE OFFICE FOR CHEQUE              
EARDIFNZ EQU   1108                REVERSAL DIFFERENCE NOT ZERO                 
EATUNSEL EQU   1109                TRANSACTION IS SELECTED FOR PAYMENT          
EATRNSEL EQU   1110                TRANSACTION NOT SELECTED FOR PAYMENT         
EASELMIX EQU   1111                MIXED SELECT STATUS - TRY SEL OPTION         
EANOTLOW EQU   1112                NOT A LOW LEVEL ACCOUNT                      
EALOCKED EQU   1113                ACCOUNT IS LOCKED                            
EACLOSED EQU   1114                ACCOUNT IS CLOSED                            
EACLOJOB EQU   1115                JOB IS CLOSED                                
EASTTMIX EQU   1116                TRANSACTION STATUS MISMATCHED                
EARVPEND EQU   1117                REVERSING/UNREVERSING INCOMPLETE             
EATRNMX2 EQU   1118                TOO MANY PENDING TRANSACTIONS                
EAMCHNEI EQU   1119                MATCHED CHEQUES NEQ INVOICE                  
EACHQMAX EQU   1120                ONLY SIX CHEQUES PER INVOICE                 
EAPARMAX EQU   1121                ONLY ONE CHEQUE PART MATCHED PER INV         
EACHQMKD EQU   1122                CHEQUE IS ALREADY MATCHED                    
EAWCHOFI EQU   1123                WRONG CHEQUE OFFICE FOR INVOICE              
EABALXPT EQU   1124                BALANCE > AMOUNT FOR PART MATCHING           
EAOVKILL EQU   1125                BALANCE NEGATIVE - CAN'T PART MATCH          
EAUNMPAR EQU   1126                UNMATCH PART UNMATCHED CHEQUE(S)             
EAMATPAR EQU   1127                MATCH PART MATCHED CHEQUES                   
EANOMULT EQU   1128                CAN'T UNMATCH MULTIPLE MPYEL INVOICE         
EACHQMUL EQU   1129                CAN'T UNMATCH MULTIPLE INV. CHEQUE           
EAREMOFF EQU   1141                REMOVE OFFICE FOR CROSS-OFFICE CHQS          
EACLIBIL EQU   1142                CLIENT BILLING TYPE                          
EAFUSTDT EQU   1143                STATEMENT DATE CAN'T BE IN FUTURE            
EATOOMNY EQU   1320                TOO MANY ITEMS RESET KEY TO CONTINUE         
EA2MNYVE EQU   1322                TOO MANY ITEMS TRY DIS= OR MERGE=Y           
*                                                                               
EGIFMISS EQU   200+X'FF00'         NO DATA INPUT                                
EGIFSHRT EQU   201+X'FF00'         NOT ENOUGH DATA INPUT                        
EGIFLONG EQU   202+X'FF00'         TOO MUCH DATA INPUT                          
EGIFNOTV EQU   203+X'FF00'         INVALID INPUT FIELD                          
EGOPTDUP EQU   208+X'FF00'         DUPLICATED OPTION KEYWORD                    
EGINVASQ EQU   212+X'FF00'         INVALID ACTION SEQUENCE                      
EGRECNOF EQU   213+X'FF00'         RECORD NOT ON FILE                           
EGRECAOF EQU   214+X'FF00'         RECORD ALREADY ON FILE                       
EGDATINV EQU   233+X'FF00'         INVALID DATE                                 
*                                                                               
IAOFFWRN EQU   0021                WARNING - SOME OFFICE DETAIL DROPPED         
IAWCWRN  EQU   0030                WARNING - TOO MANY WORKCODES TO DISP         
IANOMORE EQU   0091                NO MORE DATA TO BE DISPLAYED                 
IAMAXIO  EQU   0115                2000 RECORDS READ HIT ENTER FOR NXT          
IATRNWRN EQU   1100                WARNING  - SOME TRANSACTIONS DROPPED         
IANOTRAN EQU   1101                NO TRANSACTIONS SELECTED                     
IAUPDCUT EQU   1102                UPDATE CUT SHORT RECD. BEING AMENDED         
IAUPCUTR EQU   1103                UPDATE CUT SHORT (REPORT &T SPOOLED)         
IAMKTEPA EQU   1104                MARK TRANSACTIONS - ENTER TO PAGE            
IATRNUPS EQU   1105                TRANSACTIONS UPDATED SUCCESSFULLY            
IATRNUPR EQU   1106                TRANS UPDATED - REPORT &T SPOOLED            
IAHDRECH EQU   1107                HEADER RESTORED - NOW ENTER CHANGES          
IAENTHDD EQU   1108                ENTER HEADER DETAILS                         
IAMKTNOM EQU   1109                MARK TRANSACTIONS - NO MORE TO COME          
IAEPAP1N EQU   1110                ENTER TO PROCESS A/C OR PF1 FOR NEXT         
IAEPJP1N EQU   1111                ENTER TO PROCESS JOB OR PF1 FOR NEXT         
IANOINVS EQU   1112                NO INVOICES SELECTED                         
IANOCHQS EQU   1113                NO CHEQUES SELECTED                          
IAMINECH EQU   1114                WARNING MATCHED INVOICES NEQ CHEQUE          
IAMCHNEI EQU   1115                WARNING MATCHED CHEQUES NEQ INVOICE          
IAINVDIS EQU   1116                INVOICES DISPLAYED - ENTER TO PAGE           
IAINVMIS EQU   1117                CANNOT DISPLAY ALL INVOICES                  
IAINVNOM EQU   1118                INVOICES DISPLAYED - NO MORE                 
IAIDINX  EQU   1513                ITEMS DISPLAYED HIT ENTER                    
IAINOITF EQU   1515                NO ITEMS FOUND ENTER NEXT REQUEST            
IASTART  EQU   1526                START OF DISPLAY HAS BEEN REACHED            
IAAGEVAL EQU   2001                AGEING VAL MUST BE 1-999 OR 'MONTH'          
         EJECT                                                                  
***********************************************************************         
*        GRID DOWNLOAD EQUATES                                        *         
***********************************************************************         
DWNINIT  EQU   1               DOWN-LOAD INITIALIZATION                         
DWNEOL   EQU   2               MARK END OF LINE                                 
DWNEOR   EQU   3               MARK END OF REPORT                               
DWNTEXT  EQU   4               DOWN-LOAD TEXT                                   
DWNNUM   EQU   5               DOWN-LOAD NUMBER                                 
DWNPACK  EQU   6               DOWN-LOAD NUMBER (PACKED)                        
DWN2ND   EQU   7               USE SECONDARY GRID COLUMNS                       
DWNSUB   EQU   8               SUBTOTAL LINE-(GRID TABLE STANDARD DISP)         
DWNEOW   EQU   9               MARK END OF ROW (NO LINE JUMP)                   
DWNDNB   EQU   10              DO NOT BACK UP WITH DUMMY SCREENS                
DWNSBT   EQU   11              SUBTOTAL LINE-(GRID TABLE TOTAL DISP)            
***********************************************************************         
*        GENERAL EQUATES                                              *         
***********************************************************************         
TIALENQ  EQU   14*K                TIA LENGTH                                   
K        EQU   1024                ONE KILOBYTE                                 
MAXLINSQ EQU   ((ENQPFAH-ENQDAT1H)/(L'ENQDAT1H+L'ENQDAT1))+1 MAX LINES          
CTRYALLQ EQU   X'FF'               EVERY COUNTRY IN THE KNOWN UNIVERSE          
CTRYNOTQ EQU   X'80'               NOT THIS COUNTRY                             
NULLACTQ EQU   X'FF'               NULL ACTION                                  
PLUS     EQU   C'+'                PLUS SIGN                                    
MINUS    EQU   C'-'                MINUS SIGN                                   
NEGFILTR EQU   C'*'                NEGATIVE FILTER                              
MAXSCROL EQU   100                 MAX SCROLL AMOUNT                            
PRODUCTN EQU   C'P'                PRODUCTION                                   
EXPENSE  EQU   C'E'                EXPENSE                                      
DDSLTD   EQU   X'E7'               DDS LIMITED                                  
EOT      EQU   0                   END OF TABLE                                 
EOTFF    EQU   X'FF'               END OF TABLE                                 
EOR      EQU   0                   END OF RECORD                                
EBCCOMLN EQU   1                   EBCDIC                                       
HEXCOMLN EQU   2                   HEX                                          
MAXVATQ  EQU   5                   MAX NUMBER OF OLD VAT RATES                  
MAXNVATQ EQU   7                   MAX NUMBER OF NEW VAT RATES                  
MAXWCQ   EQU   40                  MAX NUMBER OF WORKCODES                      
MAXOFFQ  EQU   256                 MAX NUMBER OF OFFICES                        
DEFINTQ  EQU   29                  DEFAULT DATE INTERVAL FOR RECEIVABLE         
DATPRLNQ EQU   21                                                               
MAXCORDQ EQU   (18*K/(L'TRNKOFF+L'TRNKCULC)) MAX CONTRA ORDER NTRIES            
COLKEYQ  EQU   C'/'                                                             
TURNOFF  EQU   X'FF'                                                            
MAXWCS   EQU   14                                                               
         EJECT                                                                  
***********************************************************************         
*        SPECIFIC RECORD EQUATES NEEDED ALSO BY THE ROOT PHASE        *         
***********************************************************************         
VECXSTQ  EQU   20                  VE RECORD - STATUS    COLUMN WIDTH           
VECNARRQ EQU   45                  VE RECORD - NARRATIVE COLUMN WIDTH           
         EJECT                                                                  
***********************************************************************         
* TSAR RECORD                                                                   
***********************************************************************         
TSARRECD DSECT                     ** TSAR RECORD **                            
TSARLEN  DS    XL2                 RECORD LENGTH                                
TSARKEY  DS    0X                  RECORD KEY                                   
TSARKYNO DS    XL2                 RECORD NUMBER                                
         DS    XL12                                                             
TSARKEYL EQU   *-TSARKEY                                                        
*                                                                               
TSARDATA DS    0C                  RECORD DATA                                  
TSARLINE DS    XL1                 NUMBER OF SCREEN LINES USED BY REC           
TSARFMT  DS    XL1                 TSAR FORMAT                                  
TSAROVER DS    CL800               COVERED BY OVERLAY                           
TSARRECL EQU   *-TSARRECD          TSAR RECORD LENGTH                           
         EJECT                                                                  
***********************************************************************         
*        DUMMY SCREEN LINES                                           *         
***********************************************************************         
DUMLINED DSECT                                                                  
DUMLIN1  DS    CL(L'ENQDAT1)       DUMMY SCREEN LINES                           
DUMLIN2  DS    CL(L'ENQDAT1)                                                    
DUMLIN3  DS    CL(L'ENQDAT1)                                                    
DUMLIN4  DS    CL(L'ENQDAT1)                                                    
DUMLIN5  DS    CL(L'ENQDAT1)                                                    
DUMLIN6  DS    CL(L'ENQDAT1)                                                    
DUMLIN7  DS    CL(L'ENQDAT1)                                                    
DUMLIN8  DS    CL(L'ENQDAT1)                                                    
DUMLIN9  DS    CL(L'ENQDAT1)                                                    
DUMLIN10 DS    CL(L'ENQDAT1)                                                    
DUMLIN11 DS    CL(L'ENQDAT1)       DUMMY SCREEN LINES                           
DUMLIN12 DS    CL(L'ENQDAT1)                                                    
DUMLIN13 DS    CL(L'ENQDAT1)                                                    
DUMLIN14 DS    CL(L'ENQDAT1)                                                    
DUMLIN15 DS    CL(L'ENQDAT1)                                                    
DUMLIN16 DS    CL(L'ENQDAT1)                                                    
DUMLIN17 DS    CL(L'ENQDAT1)                                                    
DUMLIN18 DS    CL(L'ENQDAT1)                                                    
DUMLIN19 DS    CL(L'ENQDAT1)                                                    
DUMLIN20 DS    CL(L'ENQDAT1)                                                    
NDUMLINE EQU   (*-DUMLINED)/L'DUMLIN1                                           
DUMLINLN EQU   *-DUMLINED                                                       
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        ACTION TABLE 'ACTTAB'                                        *         
***********************************************************************         
ACTTABD  DSECT                                                                  
ACTNUM   DS    AL1                 ACTION NUMBER                                
ACTCTRY  DS    AL1                 VALID COUNTRY                                
ACTSHNAM DS    AL2                 DISPLACEMENT TO 2 CHAR ACTION NAME           
ACTLONAM DS    AL2                 DISPLACEMENT TO FULL ACTION NAME             
ACTND    DS    4AL2                N/D                                          
ACTOLAY  DS    X                   OVERLAY PHASE NUMBER                         
*                                                                               
ACTAUTH  DS    XL1                 AUTHORIZATION BYTE                           
ACTDDSQ  EQU   X'80'               . BYTE 0 A DDS-ONLY ACTION                   
ACTCORDQ EQU   X'40'               . CNTRA ORD ON 2 CH OFFS(ALL LOGONS)         
ACTCOROQ EQU   X'20'               . CNTRA ORD 2 CH OFFS+RESTRICT LOGON         
ACTC2CHQ EQU   X'10'               . ONLY FOR TWO CHAR OFFICE AGENCIES          
ACTGRIDQ EQU   X'08'               . ALLOWED FOR PC GRID                        
ACTGRONQ EQU   X'04'+ACTGRIDQ      . ALLOWED FOR PC GRID ONLY                   
ACTXTSKQ EQU   X'02'               . ACTION USES EXTENDED TSAR KEY              
*                                                                               
ACTAUTH2 DS    XL1                 AUTHORIZATION BYTE                           
ACT2ALLQ EQU   ACT2NSJQ+ACT2PROQ   . ALL LEDGERS                                
ACT2NSJQ EQU   ACT2CRDQ+ACT2RECQ+ACT2CSTQ   ALL LEDGERS EXCEPT SJ               
ACT2CRDQ EQU   X'80'               . CREDITORS LEDGER                           
ACT2PROQ EQU   X'40'               . PROD LEDGER                                
ACT2RECQ EQU   X'20'               . DEBTORS LEDGER                             
ACT2CSTQ EQU   X'10'               . COST LEDGER                                
ACT2EXPQ EQU   X'01'               . EXPENSE LEDGER                             
ACT2LSTQ EQU   X'08'               . LISTING ENQUIRY                            
ACT2LOWQ EQU   X'04'               . ALL LOWEST LEVEL ACCOUNT ONLY              
ACT2NULQ EQU   X'02'               . NO UNIT/LEDGER REQUIRED IN KEY             
ACT2ULTQ EQU   X'01'               . SET U/L FROM TSAR NOT KEY                  
ACTTABL  EQU   *-ACTTABD                                                        
ACTSHLNQ EQU   2                   LENGTH OF SHORT ACTION NAME                  
ACTLOLNQ EQU   8                   LENGTH OF FULL ACTION NAME                   
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        HELP TABLE 'HLPTAB'                                          *         
***********************************************************************         
HLPTABD  DSECT                                                                  
HLPACTN  DS    AL1                 ACTION (X'FF' FOR ACTION LIST)               
HLPLN    DS    X                   LENGTH OF THIS ACTION ENTRY                  
*                                                                               
HLPPANS  DS    0XL8                HELP PANELS BY HELP TYPE & COUNTRY           
*                                                                               
HLPTYPE  DS    X                   HELP TYPE                                    
HLPACT   EQU   1                   ACTION HELP LIST                             
HLPKEY   EQU   2                   KEY HELP LIST                                
HLPCONT  EQU   3                   CONTRA KEY HELP LIST                         
HLPOPT   EQU   4                   OPTION HELP LIST                             
HLPSCRL  EQU   5                   SCROLL HELP LIST                             
HLPLST   EQU   6                   LIST SUB-ACTION HELP LIST                    
*                                                                               
HLPCTRY  DS    X                   HELP COUNTRY                                 
*                                                                               
HLPSTAT  DS    X                   STATUS                                       
HLPDDSQ  EQU   X'80'               DDS-ONLY LIST                                
*                                                                               
*                                  LENGTH OF THIS TYPE & COUNTRY ENTRY          
HLPPANSL DS    X                   . HLPPANS THROUGH END OF LIST                
*                                                                               
*                                  LENGTH OF BASIC HELP PANEL LIST              
HLPPANSQ EQU   *-HLPPANS           . WITHOUT ANY PANELS                         
*                                                                               
HLPPAN   DS    0AL1                LIST OF PANELS FOR TYPE & COUNTRY            
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        LEDGER TABLE 'LDGTAB'                                        *         
***********************************************************************         
LEDGTABD DSECT                                                                  
LEDGTYPE DS    C                   ACTION (ZERO FOR ACTION LIST)                
*                                                                               
LEDGATTR DS    X                   LEDGER ATTRIBUTES                            
LEDGCRD  EQU   X'01'               CREDITORS LEDGER                             
LEDGDEB  EQU   X'02'               DEBTORS LEDGER                               
LEDGSPOT EQU   X'04'               SPOT                                         
LEDGNETW EQU   X'08'               NET WORK                                     
LEDGPRNT EQU   X'10'               PRINT                                        
LEDGPROD EQU   X'20'               PROD                                         
*                                                                               
LEDGLNQ  EQU   *-LEDGTABD                                                       
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        DISPLAY COLUMN TABLE 'DISTAB'                                *         
***********************************************************************         
DISTABD  DSECT                     ** DISPLAY COLUMN TABLE **                   
DISCHR   DS    XL1                 COLUMN CHARACTER                             
DISCOL   DS    AL1                 COLUMN NUMBER                                
DISWID   DS    AL1                 COLUMN WIDTH                                 
DISHWI   DS    AL1                 HEADING WIDTH OVERRIDE                       
*                                                                               
DISSTAT  DS    X                   STATUS BYTE                                  
DISDDSQ  EQU   X'80'               DDS-ONLY COLUMN                              
DISUPPRQ EQU   X'40'               UPPER CASE HEADINGS                          
*                                                                               
DISNAM1  DS    XL4                 DISPLACENT TO COLUMN NAME - 1                
DISNAM2  DS    XL4                 DISPLACENT TO COLUMN NAME - 2                
DISTABL  EQU   *-DISTABD                                                        
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        PFKEY TABLE 'PFKTAB'                                         *         
***********************************************************************         
PFKTABD  DSECT                                                                  
PFKNUM   DS    AL1                 PFKEY NUMBER                                 
PFKINDS  DS    XL1                 PFKEY INDICATOR                              
PFKNGRDQ EQU   X'80'               PFKEY NOT VALID FOR GRID                     
PFKSWACT EQU   X'40'               PFKEY TO SWITCH TO OTHER ACTION              
PFKRTNLI EQU   X'20'               PFKEY TO RETURN TO LI ENQUIRY                
PFKGRONQ EQU   X'10'               PFKEY ONLY VALID FOR GRIDS                   
PFKOFF2Q EQU   X'08'               PFKEY ONLY VALID FOR 2 CHAR OFF FILE         
PFKGLOBQ EQU   X'04'               PFKEY ONLY VALID WITH GLOBBER CALL           
PFKLDGN  DS    XL1                 SEE ACTAUTH2 FOR LEDGER EQU                  
PFKACTN  DS    XL1                 ACTION TO SWITCH TO                          
PFKKEYWD DS    AL2                 DISPLACEMENT TO PFKEY ACTION KEYWORD         
PFKLDGN2 DS    XL1                 SEE ACTAUTH2 FOR LEDGER EQU                  
PFKACTN2 DS    XL1                                                              
PFKKEYW2 DS    AL2                                                              
PFKACTNS DS    25AL1               LIST OF VALID ACTION NUMBERS FOR PFK         
PFKTABL  EQU   *-PFKTABD                                                        
PFKWDLEN EQU   7                   MAX LENGTH OF PFK KEY WORD                   
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        OPTION TABLE 'OPTTAB'                                        *         
***********************************************************************         
OPTTABD  DSECT                                                                  
OPTSHNAM DS    AL2       DISPLACEMENT TO 2 CHAR OPTION NAME                     
OPTLONAM DS    AL2       DISPLACEMENT TO FULL OPTION NAME                       
OPTLN    DS    XL1       LENGTH OF OPTION ENTRY                                 
OPTMAXL  DS    XL1       MAXIMUM LENGTH OF INPUT                                
*                                                                               
OPTSTAT  DS    XL1       STATUS BYTE -                                          
OPTDDSQ  EQU   X'80'     DDS ONLY                                               
OPT2CHQ  EQU   X'40'     ONLY ALLOWED FOR TWO CHAR OFFICE AGENCIES              
OPTNGRDQ EQU   X'20'     OPTION NOT VALID FOR GRID ENQUIRY                      
*                                                                               
OPTVAL   DS    AL2       DISPLACEMENT TO VALIDATE ROUTINE                       
OPTVALUE DS    AL2       DISPLACEMENT TO OPTION VALUE                           
OPTACTNS DS    20AL1     LIST OF ACTION NUMBERS WITH WHICH OPTION IS OK         
OPTTABL  EQU   *-OPTTABD LENGTH OF ENTRY WITH NO VALID ACT/LEDGER LIST          
OPTACT   DS    0AL1                                                             
OPTLEDG  DS    0CL(2*15)                                                        
*                                                                               
OPTSHLNQ EQU   2                   LENGTH OF SHORT OPTION NAME                  
OPTLOLNQ EQU   10                  LENGTH OF FULL OPTION NAME                   
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        BUCKET TABLE 'BUKTAB'                                        *         
***********************************************************************         
BUKTABD  DSECT                     ** CONTRA BUCKET TABLE DSECT **              
*                                                                               
BUKTSYSC DS    XL1                 SYSTEM COUNTRY CODE (SEE EQUATES)            
BUKTEOTQ EQU   255                 END OF TABLE INDICATOR                       
*                                                                               
BUKTITYP DS    CL1                 INPUT BUCKET TYPE (IN ELEMENT)               
BUKTOTYP DS    CL1                 OUTPUT BUCKET TYPE (IN RECORD)               
BUKTLEDG DS    CL2                 UNIT/LEDGER CODE (SPACES=ANY)                
BUKTROUT DS    AL2                 DISPLACEMENT TO ROUTINE                      
BUKTABL  EQU   *-BUKTABD                                                        
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        ELEMENT TABLE 'ELETAB'                                       *         
***********************************************************************         
ELETABD  DSECT                     ** ELEMENT TABLE DSECT **                    
*                                                                               
ELETYPE1 DS    X                   ELEMENT TYPE 1                               
ELETSARQ EQU   X'FF'               TSAR RECORD ELEMENT ONLY                     
*                                                                               
ELETYPE2 DS    X                   ELEMENT TYPE 1 (TSAR RECORDS ONLY)           
ELEADDR  DS    AL2                 ELEMENT ADDRESS IN GLOBAL W/S                
ELETABL  EQU   *-ELETABD                                                        
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        ENQUIRY ID TABLE FOR PC GRID 'EIDTAB'                        *         
***********************************************************************         
EIDTABD  DSECT                                                                  
EIDACT   DS    AL1                 ACTION NUMBER                                
EIDLN    DS    XL2                 EIDTAB LENGTH                                
EIDLN1Q  EQU   *-EIDTABD                                                        
EIDSUB   DS    0X                                                               
EIDREF   DS    CL3                 ENQUIRY ID NUMBER                            
EIDCTRY  DS    XL1                 COUNTRY CODE                                 
EIDNLDG  DS    XL1                 NUMBER OF LEDGERS IN LEDGER LIST             
EIDALDGQ EQU   X'00'               ALL LEDGERS                                  
EIDSLNQ  EQU   *-EIDSUB            LENGTH OF SUB-ELEM WITHOUT LDG LIST          
EIDLEDG  DS    0CL2                LIST OF LEDGERS                              
*                                                                               
***********************************************************************         
*        TSAR SPECIFIC ELEMENTS                                       *         
***********************************************************************         
*----------------------------------------                                       
* TRANSACTION NARRATIVE ELEMENTS                                                
*----------------------------------------                                       
NARELD   DSECT                     TRANSACTION NARRATIVE ELEMENT                
NAREL    DS    XL1                 ELETSARQ                                     
NARLN    DS    XL1                 NARRATIVE LENGTH                             
*                                                                               
NARELTP  DS    XL1                 ELEMENT TYPE                                 
NARELQ   EQU   X'01'               NARRATIVE                                    
*                                                                               
NARLN1Q  EQU   *-NARELD                                                         
NARREC   DS    0CL200              NARRATIVE                                    
         EJECT                                                                  
*----------------------------------------------------------------------         
* CASHFLOW ELEMENT DSECT                                                        
*----------------------------------------------------------------------         
CFWELD   DSECT                                                                  
CFWEL    DS    X                   X'99' INTERNAL ELEMENT - ELETSARQ            
CFWLN    DS    X                                                                
*                                                                               
CFWELTP  DS    XL1                 ELEMENT TYPE                                 
CFWVELQ  EQU   X'02'               VENDOR CASHFLOW ELEMENT                      
CFWRELQ  EQU   X'03'               RECEIVABLE CASHFLOW ELEMENT                  
*                                                                               
CFWVEL   DS    0X                                                               
CFWVIND  DS    XL1                 BILL DATE                                    
CFWIVIQ  EQU   X'80'               . INTERNAL VENDOR INVOICE                    
CFWIDBQ  EQU   X'40'               . ITEM DISBURSED                             
CFWVDIS  DS    PL6                 DISBURSED DOLLARS                            
CFWVUND  DS    PL6                 UNDISBURSED AMOUNT                           
CFWVNOC  DS    XL1                 NUMBER OF CHECKS                             
CFWVLNQ  EQU   *-CFWELD                                                         
*                                                                               
         ORG   CFWVEL                                                           
CFWREL   DS    0X                                                               
CFWAPPA  DS    PL6                                                              
CFWUNAA  DS    PL6                                                              
CFWRIND  DS    X                   CLIENT PAYMENT STATUS                        
CFWICPQ  EQU   X'80'               . ANY CLIENT PAYMENT                         
CFWIPCPQ EQU   X'40'               . PARTIAL PAYMENT                            
CFWRNOC  DS    XL1                 NUMBER OF CHECKS                             
*FWBLNO  DS    CL6                 BILL NUMBER                                  
*FWBLDT  DS    CL2                 BILL DATE                                    
*FWPAPP  DS    PL6                 PERCENT APPLIED                              
CFWRLNQ  EQU   *-CFWELD                                                         
*----------------------------------                                             
CFWVCD   DSECT                                                                  
CFWVCNO  DS    CL6                 VENDOR CHECK NUMBER                          
CFWVCDT  DS    XL2                 VENDOR CHECK DATE                            
CFWVSTA  DS    XL1                 VENDOR STATUS (TRNSTAT)                      
CFWVST2  DS    XL1                 VENDOR STATUS 2 (TRSSTAT)                    
CFWVCDI  DS    XL2                 INTERNAL VENDOR CHECK DATE                   
CFWVCLNQ EQU   *-CFWVCD                                                         
*----------------------------------                                             
CFWRCD   DSECT                                                                  
CFWCCNO  DS    CL6                 CLIENT CHECK NUMBER                          
CFWCCDT  DS    PL3                 CLIENT CHECK DATE                            
CFWCPDT  DS    PL3                 CLIENT DEPOSIT DATE                          
CFWCDDT  DS    PL2                 CLIENT DUE DATE                              
CFWRSTA  DS    XL1                 RECEIVABLE STATUS                            
*        EQU   X'80'               .  HELD      (X'80'-TRXSRHLD)                
*        EQU   X'40'               .  QUERIED   (X'40'-TRXSRQRD)                
*        EQU   X'20'               .  REVERSAL  (X'20'-TRNSREV)                 
CFWRSWO  EQU   X'08'               .  WRITE OFF                                 
CFWRSOF  EQU   X'04'               .  OFFSET                                    
CFWRSTR  EQU   X'02'               .  TRANSFER                                  
CFWRCLNQ EQU   *-CFWCCNO                                                        
*----------------------------------                                             
         EJECT                                                                  
***********************************************************************         
*        SCAN BLOCK                                                   *         
***********************************************************************         
SCANBLKD DSECT                     DSECT TO COVER SCANBLK                       
SCANINF  DS    CL12                                                             
         ORG   SCANINF                                                          
SCANLHSL DS    CL1                                                              
SCANRHSL DS    CL1                                                              
SCANLTYP DS    CL1                                                              
*                                                                               
SCANRTYP DS    CL1                                                              
SCNUMQ   EQU   X'80'               NUMERIC INPUT                                
         ORG                                                                    
SCANLHS  DS    CL10                                                             
SCANRHS  DS    CL41                                                             
SCANBLKL EQU   *-SCANBLKD                                                       
*                                                                               
MAXSCAN  EQU   10                                                               
MAXUNSCN EQU   16                  MAX UNSCAN                                   
*                                                                               
UNSCAND  DSECT                                                                  
UNSCNLHS DS    CL10                                                             
UNSCNRHS DS    CL20                                                             
UNSCNLNQ EQU   *-UNSCAND                                                        
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        DATE COMPARE PARM BLOCK                                      *         
***********************************************************************         
DCOMPD   DSECT                     COVER DATE COMPARE PARM BLOCK                
DCCOMLN  DS    0XL1                COMPARE DATE LENGTH                          
DCVAL    DS    A                   A(COMPARE DATE)                              
DCDATST  DS    A                   A(START DATE YYMMDD)                         
DCDATEN  DS    A                   A(END DATE YYMMDD)                           
DCFLAG   DS    A                   A(FILTER FLAG)                               
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        STRING COMPARE PARM BLOCK                                    *         
***********************************************************************         
SCOMPD   DSECT                     COVER STRING COMPARE PARM BLOCK              
SCVAL    DS    A                   A(COMPARE STING)                             
SCLSTLN  DS    0XL1                L'(LOW STRING)                               
SCLST    DS    A                   A(LOW STRING)                                
SCHSTLN  DS    0XL1                L'(HIGH STRING)                              
SCHST    DS    A                   A(HIGH STRING)                               
SCFLAG   DS    A                   A(FILTER FLAG)                               
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        I/O CONTROLLER FILE TABLE DSECT                              *         
***********************************************************************         
FILTABD  DSECT                                                                  
FILNUM   DS    XL1                 FILE NUMBER (IOFILES EQUATE)                 
FILNAME  DS    CL7                 FILE NAME                                    
*                                                                               
FILINDS  DS    XL1                 FILE INDICATORS - 1                          
FILIVL   EQU   X'80'               FILE RECORDS ARE VARIABLE LENGTH             
FILIDA   EQU   X'40'               FILE IS A DIRECT ACCESS FILE                 
FILIIS   EQU   X'20'               FILE IS AN INDEX SEQUENTIAL FILE             
*                                                                               
FILINDS2 DS    XL1                 FILE INDICATORS - 2                          
FILIDI   EQU   X'80'               FILE IS D/A WITH I/S INDEX                   
FILIID   EQU   FILIDI              FILE IS I/S INDEX TO A D/A FILE              
*                                                                               
FILNUM2  DS    XL1                 D/A OR I/S FILE NUMBER                       
FILKEYL  DS    XL1                 D/A OR I/S KEY LENGTH                        
*                                                                               
FILCTLL  DS    XL1                 FIXED LENGTH I/S CONTROL LENGTH              
FILDISP  EQU   FILCTLL             DISPLACEMENT TO FIRST RECORD ELEMENT         
*                                                                               
FILMAXL  DS    XL2                 MAXIMUM RECORD LENGTH                        
*                                  FOLLOWING FIELDS SET IF FILNAME=NULL         
FILSYSN  EQU   FILINDS             NATIVE SYSTEM NUMBER OF FILE                 
FILFILN  EQU   FILINDS2            NATIVE FILE NUMBER (WITHIN SYSTEM)           
*                                                                               
         DS    XL5                 N/D                                          
FILTABL  EQU   *-FILTABD                                                        
*                                                                               
*                                                                               
***********************************************************************         
*        I/O CONTROLLER COMMAND TABLE DSECT                           *         
***********************************************************************         
CMDTABD  DSECT                                                                  
CMDNAME  DS    CL7                 COMMAND NAME                                 
CMDNUMB  DS    XL1                 COMMAND NUMBER (SEE IOCMNDS)                 
*                                                                               
CMDINDS  DS    XL1                 COMMAND INDICATORS - 1                       
CMDIDARQ EQU   X'80'               DISK ADDRESS REQUIRED FOR I/O                
CMDIDAXC EQU   X'40'               CLEAR DISK ADDRESS BEFORE I/O                
CMDIDADD EQU   X'20'               DISK ADDRESS RETURNED FROM I/O               
*                                                                               
CMDINDS2 DS    XL1                 COMMAND INDICATORS - 2                       
CMDTABL  EQU   *-CMDTABD                                                        
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        DEFAULT COLUMN TABLE ENTRY                                   *         
***********************************************************************         
DCLTABD  DSECT                                                                  
DCLACTN  DS    AL1                 ACTION NUMBER                                
DCLLEN   DS    AL1                 LENGTH OF ENTRY FOR ACTION TYPE              
DCLACOL  DS    AL2                 DISPLACEMENT TO COLUMN TABLE                 
*                                                                               
DCLDATA  DS    0C                                                               
DCLLEDG  DS    CL2                                                              
DCLCOLS  DS    CL25                                                             
DCLDALNQ EQU   *-DCLDATA                                                        
DCLDEFQ  EQU   X'FF'               DEFAULT LEDGER ENTRY                         
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        BALANCE TABLE                                                *         
***********************************************************************         
BALTABD  DSECT                                                                  
BALOFF   DS    CL(L'OFAKOFF)       OFFICE                                       
BALBFWD  DS    PL(L'ABLFRWD)       BALANCE BROUGHT FORWARD                      
BALDR    DS    PL(L'ABLDR)         CURRENT DEBITS                               
BALCR    DS    PL(L'ABLCR)         CURRENT CREDITS                              
BALLNQ   EQU   *-BALTABD                                                        
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        CREDITOR INFO BLOCK                                          *         
***********************************************************************         
CRD      DSECT                                                                  
CRTKEY   DS    0CL(TRNKSBR-TRNKULC)                                             
CRULC    DS    CL(L'TRNKULC)       CONTRA ACCOUNT                               
CRTDATE  DS    CL(L'TRNKDATE)      TRANSACTION DATE                             
CRTREFK  DS    CL(L'TRNKREF)       TRANSACTION REFERENCE                        
*                                                                               
CRSTAT   DS    X                   STATUS FLAG                                  
CRVOIDQ  EQU   X'80'               TRANSACTION VOID                             
CROLDDRQ EQU   X'40'               OLD DEBIT                                    
CRCRPAYQ EQU   X'20'               CREDIT PAYMENT                               
CRMATCHQ EQU   X'10'               CURRENT CR MATCHES PREV CR DETAILS           
CRREVDQ  EQU   X'08'               REVERSED                                     
*                                                                               
CRSTAT2  DS    X                   STATUS FLAG 2                                
CRPAYQ   EQU   X'80'               PAYMENT                                      
CRSYSCHQ EQU   X'40'               SYSTEM CHEQUE                                
CRMANCHQ EQU   X'20'               MANUAL CHEQUE                                
CRCONCRQ EQU   X'10'               CONTRA'D CREDIT                              
*                                                                               
CROFFICE DS    CL(L'TRNKOFF)       OFFICE                                       
CRTREF   DS    CL(L'TRNKREF)       TRAN REFERENCE                               
CRMOS    DS    CL(L'TRNKSMOS)      TRANSACTION MOS                              
CRBREF   DS    CL(L'TRNBREF)       BATCH REFERENCE                              
CRNET    DS    PL(L'TRNAMNT)       NET AMOUNT                                   
CRDRAMT  DS    PL(L'TRNAMNT)       DEBIT AMOUNT                                 
CRCRAMT  DS    PL(L'TRNAMNT)       CREDIT AMOUNT                                
CRBAL    DS    PL(L'TRNAMNT)       BALANCE AMOUNT                               
CRJOB    DS    CL(L'TRNKCACT)      JOB                                          
CRSRC    DS    CL(L'TRNKULC)       SOURCE ACCOUNT                               
CRCHEQUE DS    CL(L'MPYNO)         CHEQUE NUMBER                                
CRTSARNO DS    XL(L'TSARKYNO)      TSAR KEY NUMBER                              
*                                                                               
CRDISPAY DS    0XL(L'CRDISC+L'CRPAYPER)                                         
CRDISC   DS    PL(L'SCIAMNT)       DISCOUNT AMOUNT                              
CRPAYPER DS    CL12                PAYMENT PERIOD US SPOT/NETW LEDGERS          
*                                                                               
CRACTDAT DS    XL(L'TRSDATE)       ACTIVITY DATE                                
CRBTYPE  DS    XL(L'TRNTYPE)       BATCH TYPE                                   
CRCONDAT DS    XL(L'RALODAT)       CONTRA'D/PAID DATE                           
CRUSEDAT DS    XL(L'TRSUDAT)       USED DATE                                    
*                                                                               
CRTSTAT  DS    0XL(L'TRNSTAT+L'TRNRSTAT)                                        
CRTESTAT DS    XL(L'TRNSTAT)       TRANSACTION ELEMENT STATUS                   
CRTRSTAT DS    XL(L'TRNRSTAT)      TRANSACTION RECORD  STATUS                   
*                                                                               
CRDA     DS    XL(L'TRNKDA)        TRANSACTION DISK ADDRESS                     
CRKSREF  DS    XL(L'TRNKSBR)       TRANSACTION KEY SUB REF                      
CRTNARLN DS    X                   TRANSACTION NARRATIVE LENGTH                 
CRTNARR  DS    XL(L'TRNNARR)       TRANSACTION NARRATIVE                        
CRPNAMLN DS    X                   PAYEE NAME LENGTH                            
CRPNAM   DS    XL(L'NAMEREC)       PAYEE NAME                                   
CRDRDAT  DS    XL(L'TRSDATE)       DEBIT DATE                                   
CRCHQDAT DS    XL(L'MPYDTE)        CHEQUE DATE                                  
CRBANK   DS    XL(L'MPYBNK)        BANK ACCOUNT                                 
CRMIN    DS    CL20                INVOICE NUMBER                               
*                                                                               
CRMMOS   DS    XL3                 MEDIA MOS/DATE                               
CRPERD   DS    CL(L'XPYPER)        PAY PERIOD US SPOT/NETW LDGRS                
CRDUDAT  DS    XL(L'DUEDATE)       DUE DATE                                     
CRGST    DS    XL(L'SCIAMNT)       CANADIAN GST AMOUNT                          
*                                                                               
CRPST    DS    XL(L'SCISUBPR+L'SCIAMNT)   CANADIAN PST TYPE AND AMOUNT          
*                                                                               
CRATYPE  DS    C                   M=MARKER, A=AUTO APPROVE                     
CRAUTO   EQU   C'A'                                                             
CRMARK   EQU   C'M'                                                             
CRLNQ    EQU   *-CRD                                                            
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        STRING RANGE PARM BLOCK                                      *         
***********************************************************************         
SRANGED  DSECT                     STRING RANGE DSECT                           
SRANGFI  DS    X                   NEGATIVE FILTER                              
SRANGLN1 DS    X                   START RANGE LENGTH                           
SRANGVL1 DS    CL12                START RANGE VALUE                            
SRANGLN2 DS    X                   END RANGE LENGTH                             
SRANGVL2 DS    CL12                END RANGE VALUE                              
*                                                                               
***********************************************************************         
*        STRING RANGE PARM BLOCK                                      *         
***********************************************************************         
LRANGED  DSECT                     STRING RANGE DSECT                           
LRANGFI  DS    X                   NEGATIVE FILTER                              
LRANGVL1 DS    CL1                 START RANGE VALUE                            
LRANGVL2 DS    CL1                 END RANGE VALUE                              
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        TWA                                                          *         
***********************************************************************         
       ++INCLUDE FATWA                                                          
         ORG   TWAUSER                                                          
TWAOFWK# DS    H                   SAVED OFFAWORK OFFICE LIST NUMBER            
*                                                                               
TWAMODE  DS    XL1                 CONTROL MODE INDICATORS                      
TWAMRST1 EQU   X'80'               . RESTORE 1ST TSAR BUFFER NEXT TIME          
TWAMGOT1 EQU   X'40'               . 1ST TSAR BUFFER WAS GOTTEN                 
TWAMRST2 EQU   X'20'               . RESTORE 2ND TSAR BUFFER NEXT TIME          
TWAMGOT2 EQU   X'10'               . 2ND TSAR BUFFER WAS GOTTEN                 
TWAMTIA  EQU   X'08'               . TIA RESTORE FROM DISK REQUIRED             
TWAMSAV1 EQU   X'04'               . 1ST TSAR BUFFER JUST SAVED                 
TWAMSAV2 EQU   X'02'               . 2ND TSAR BUFFER JUST SAVED                 
*                                                                               
TWATSAR1 DS    XL1                 SAVED TSAR INDICATORS 1                      
TWALOWP1 DS    XL1                 SAVED TSPAGL VALUE 1                         
TWANUMP1 DS    XL1                 SAVED TSPAGN VALUE 1                         
TWATSAR2 DS    XL1                 SAVED TSAR INDICATORS 2                      
TWALOWP2 DS    XL1                 SAVED TSPAGL VALUE 2                         
TWANUMP2 DS    XL1                 SAVED TSPAGN VALUE 2                         
TWAOFFSV DS    XL(OFFASAVL)        SAVED OFFAL VALUES                           
TWASCROV DS    X                   SCREEN NUMBER                                
TWASCRAL EQU   X'FE'               . ALL OTHER FIS OVERLAYS SCREEN              
TWASCRLI EQU   X'FD'               . LIST SCREEN                                
TWASCRGR EQU   X'FC'               . GRID SCREEN                                
*                                                                               
TWAFLG1  DS    XL1                 STATUS FLAG 1                                
TWAFRINP EQU   X'80'               CALLED FROM $INPUT VIA GLOBBER               
TWASESSR DS    CL1                 SAVE GLOBAL RETURN SESSION                   
*                                                                               
         ORG   TWAD+64                                                          
       ++INCLUDE ACENQFFD                                                       
         ORG   BASOLAYH                                                         
       ++INCLUDE ACENQFED                                                       
         ORG   BASOLAYH                                                         
       ++INCLUDE ACENQFDD                                                       
         ORG   BASOLAYH                                                         
       ++INCLUDE ACENQFCD                                                       
         ORG   TWAD+2424                                                        
*                                                                               
**********************************************************************          
* HELP INFORMATION                                                   *          
**********************************************************************          
HLPFLAG  DS    X                   HELP FLAG                                    
HLPSCRN  EQU   X'80'               SCREEN IS IN HELP FORMAT                     
HLPRES   EQU   X'40'               SCREEN RESTORED AFTER HELP                   
*                                                                               
HLPBLK   DS    0X                                                               
HLPFNO   DS    X                   FIELD NO FOR HELP CALL                       
*                                                                               
HLPSLEFT DS    X                   NUMBER  OF PAGES LEFT TO DISPLAY             
HLP@NPNL DS    AL4                 ADDRESS OF NEXT HELP PANEL ADDRESS           
HLPBLKL  EQU   *-HLPBLK                                                         
*                                                                               
*                                  SAVE FOR RESTORE AFTER HELP:                 
SVACTION DS    CL(L'BASACT)        .    ACTION INPUT                            
SVKEY    DS    CL(L'BASKEY)        .    KEY    INPUT                            
SVCONTRA DS    CL(L'BASCAC)        .    CONTRA INPUT                            
SVOPTION DS    CL(L'BASOPT)        .    OPTION INPUT                            
SVSCROLL DS    CL(L'ENQSCRL)       .    SCROLL INPUT                            
SVPHASE  DS    CL(L'PHASE)         .    PHASE  NUMBER                           
         DS    16X                 N/D                                          
*                                                                               
**********************************************************************          
* COMPANY INFORMATION                                                *          
**********************************************************************          
COMPSFST DS    CL(L'CPYSFST)       START MONTH OF FINANCIAL YEAR                
COMPCURR DS    CL(L'CPYCURR)       COMPANY CURRENCY CODE                        
*                                                                               
COMPFIN  DS    0PL2                YYMM OF START OF CURR FINANCIAL YEAR         
COMPFINY DS    X                   YY                                           
COMPFINM DS    X                   MM                                           
*                                                                               
COMPSTA1 DS    CL(L'CPYSTAT1)      1ST STATUS BYTE FOR COMPANY                  
COMPSTA2 DS    CL(L'CPYSTAT2)      2ND STATUS BYTE FOR COMPANY                  
COMPSTA3 DS    CL(L'CPYSTAT3)      3RD STATUS BYTE FOR COMPANY                  
COMPSTA4 DS    CL(L'CPYSTAT4)      4TH STATUS BYTE FOR COMPANY                  
COMPSTA5 DS    CL(L'CPYSTAT5)      5TH STATUS BYTE FOR COMPANY                  
COMPSTA6 DS    CL(L'CPYSTAT6)      6TH STATUS BYTE FOR COMPANY                  
COMPSTA7 DS    CL(L'CPYSTAT7)      7TH STATUS BYTE FOR COMPANY                  
COMPVATR DS    CL20                LIST OF VAT RULES (ACMPVATR)                 
COMPSTA8 DS    CL(L'CPYSTAT8)      8TH STATUS BYTE FOR COMPANY                  
COMPSTA9 DS    CL(L'CPYSTAT8)      9TH STATUS BYTE FOR COMPANY                  
COMPSTAA DS    CL(L'CPYSTAT8)      10TH STATUS BYTE FOR COMPANY                 
         DS    6X                  N/D                                          
*                                                                               
**********************************************************************          
* LEDGER INFORMATION                                                 *          
**********************************************************************          
LDGTUL   DS    CL2                 UNIT/LEDGER CODE                             
LDGTTYPE DS    CL(L'LDGTYPE)       LEDGER TYPE                                  
LDGTLIKE DS    CL(L'LDGLIKE)       LEDGER IS LIKE                               
LDGTOFFP DS    XL(L'LDGOPOS)       OFFICE POSITION                              
LDGTCLOS DS    XL(L'LDGCLOS)       LEDGER CLOSE-OUT TYPE                        
LDGTSEC  DS    XL1                 SECURITY NUMBER                              
LDGTDDL  DS    XL1                 DISPLACEMENT/LENGTH OF DEPARTMENT            
LEDGTLVA DS    X                   LEVEL A LENGTH                               
LEDGTLVB DS    X                   LEVEL B LENGTH                               
LEDGTLVC DS    X                   LEVEL C LENGTH                               
LEDGTLVD DS    X                   LEVEL D LENGTH                               
LDGTSTA3 DS    XL(L'RSTSTAT3)      LEDGER STATUS BYTE 3                         
LDGLEVS  DS    X                   NUMBER OF LEVELS IN LEDGER                   
         DS    8X                                                               
*                                                                               
**********************************************************************          
* UNIT/LEDGER CODES                                                  *          
**********************************************************************          
SPROUL   DS    0CL(L'SPROUNIT+L'SPROLEDG) PRODUCTION UNIT AND LEDGER            
SPROUNIT DS    C                   PRODUCTION UNIT CODE                         
SPROLEDG DS    C                   PRODUCTION LEDGER CODE                       
*                                                                               
SRECUL   DS    0CL(L'SRECUNIT+L'SRECLEDG) RECEIVALBLE UNIT AND LEDGER           
SRECUNIT DS    C                   RECEIVABLE UNIT CODE                         
SRECLEDG DS    C                   RECEIVABLE LEDGER CODE                       
*                                                                               
SEXPUL   DS    0CL(L'SEXPUNIT+L'SEXPLEDG) EXPENSE UNIT AND LEDGER               
SEXPUNIT DS    C                   RECEIVABLE UNIT CODE                         
SEXPLEDG DS    C                   RECEIVABLE LEDGER CODE                       
*                                                                               
SBNKUL   DS    0CL(L'SBNKUNIT+L'SBNKLEDG) BANK UNIT AND LEDGER                  
SBNKUNIT DS    C                   BANK UNIT CODE                               
SBNKLEDG DS    C                   BANK LEDGER CODE                             
*                                                                               
SFOLUL   DS    0CL(L'SFOLUNIT+L'SFOLLEDG) FOLIO UNIT AND LEDGER                 
SFOLUNIT DS    C                   FOILO UNIT CODE                              
SFOLLEDG DS    C                   FOLIO LEDGER CODE                            
*                                                                               
SSUPUL   DS    0CL(L'SSUPUNIT+L'SSUPLEDG) SUPPLIER UNIT AND LEDGER              
SSUPUNIT DS    C                   SUPPLIER UNIT CODE                           
SSUPLEDG DS    C                   SUPPLIER  LEDGER CODE                        
*                                                                               
SHSPUL   DS    0CL(L'SHSPUNIT+L'SHSPLEDG) HOUSE SUPP UNIT AND LEDGER            
SHSPUNIT DS    C                   HOUSE SUPPLIER UNIT CODE                     
SHSPLEDG DS    C                   HOUSE SUPPLIER LEDGER CODE                   
*                                                                               
STAXUL   DS    0CL(L'STAXUNIT+L'STAXLEDG) TAX UNIT AND LEDGER                   
STAXUNIT DS    C                   TAX UNIT CODE                                
STAXLEDG DS    C                   TAX  LEDGER CODE                             
*                                                                               
SARTUL   DS    0CL(L'SARTUNIT+L'SARTLEDG) ARTISTES UNIT AND LEDGER              
SARTUNIT DS    C                   ARTISTES UNIT CODE                           
SARTLEDG DS    C                   ARTISTES LEDGER CODE                         
*                                                                               
         DS    10X                 N/D                                          
*                                                                               
**********************************************************************          
* GENERAL GLOBAL                                                     *          
**********************************************************************          
AACTENT  DS    A                    ACTION TABLE ENTRY                          
*                                                                               
TSCOUNTA DS    0H                   MAINTAIN TSAR COUNTS AREA                   
TS2FIRST DS    H                    FIRST KEY ON 2ND TSAR BUFFER                
TSNEXTST DS    H                    TSAR REC NO FOR NEXT DISPLAY START          
TSCURRNO DS    H                    TSAR REC NO FOR NEXT DISPLAY LINE           
TSLSTLIN DS    H                    TSAR REC NO AT END OF SCREEN                
TSLSTREC DS    H                    LAST REC NO IN TSAR BLOCK                   
TEMPBLKN DS    H                    NUMBER OF TSAR IN TEMP BLOCK                
TSCOUNTQ EQU   *-TSCOUNTA           LENGTH OF TSAR COUNTS AREA                  
*                                                                               
LINE     DS    H                    LINE NUMBER (ENQDATA = 1)                   
*                                                                               
CONFILT  DS    0X                                                               
NEGCONT  DS    X                    NEGATIVE CONTRA FILTER                      
*                                                                               
CONTLEN  DS    X                    LENGTH OF CONTRA CODE                       
CONTRA   DS    CL(L'TRNKULC)        CONTRA ACCOUNT                              
CONFLNQ  EQU   *-CONFILT                                                        
*                                                                               
KEYSAVE  DS    CL(L'IOKEY)          SAVED KEY                                   
KEYSAVE2 DS    CL(L'IOKEY)          SAVED KEY                                   
ACNTKEY  DS    CL(L'IOKEY)          SAVED ACCOUNT KEY                           
DISSTART DS    X                    START POSITION FOR DATA DISPLAY             
DISEND   DS    X                    END POSITION FOR DATA DISPLAY               
MAXLINES DS    X                    MAX LINES ON SCREEN                         
DISLINE  DS    X                    NEXT POSITION AVAILABLE FOR DATA            
SCRLLADJ DS    X                    ADJUSTMENT FOR EXTRA INF LINE(S)            
*                                                                               
TEMPSPAG DS    X                    CURRENT TEMP STORE PAGE                     
*                                                                               
LINEMAX  DS    X                    MAX LINE NUMBER                             
PHASE    DS    X                    OVERLAY NUMBER                              
RECOFFC  DS    CL(L'TRNOFFC)        OFFICE CODE                                 
SVCO     DS    C                    COMPANY CODE OF LAST ENQUIRY                
SVBASMOA DS    CL(L'BASMOA)         SAVED MOA                                   
SVACTNUM DS    X                    SAVED ACTION NUMBER                         
SAVEACCN DS    CL(L'NAMEREC)        ACCOUNT NAME                                
SVCACN   DS    CL(L'NAMEREC)        CONTRA-ACCOUNT NAME                         
SAVEACC  DS    CL(L'ACTKCULA)       SAVED ACCOUNT CODE                          
SAVEUNIT DS    CL(L'NAMEREC)        UNIT NAME                                   
SAVELEDG DS    CL(L'NAMEREC)        LEDGER NAME                                 
SLEDGATR DS    X                    SAVED LEDG ATTRIBUTES(SEE LEDGATTR)         
CLEN     DS    X                    CLIENT LENGTH                               
CPLEN    DS    X                    CLIENT+PRODUCT LENGTH                       
CPJLEN   DS    X                    CLIENT+PRODUCT+JOB LENGTH                   
CURRLAST DS    CL(L'AFCCURR)        LAST CURRENCY CODE                          
*                                                                               
BLODOPT  DS    0X                   ** DISPLAY OPTIONS **                       
BLODISI  DS    XL1                                                              
BLODISIS EQU   X'80'                BLODIS SUFFIXES PROFILE COLUMNS             
BLODISIP EQU   X'40'                BLODIS PREFIXES PROFILE COLUMNS             
*                                                                               
BLOKEY   DS    XL5                  LIST OF COLUMNS IN KEY                      
BLODIS   DS    XL32                 DISPLACEMENT TO DISPLACEMENTS               
BLOCHR   DS    XL32                 COLUMN CHARACTERS                           
BLODISL  EQU   *-BLODIS                                                         
BLODOPTL EQU   *-BLODOPT                                                        
*                                                                               
BLOKEYN  DS    X                    NUMBER OF COLUMNS IN KEY                    
*                                                                               
HORNDIS  DS    X                    NUMBER OF DISPLAYED COLUMNS                 
HORIDIS  DS    X                    INDEX TO DISPLAYED COLUMNS                  
GRDNDOR  DS    X                    NUMBER OF DETAIL REQ. LINES                 
*                                                                               
SPECIAL  DS    C                    Y=DO SPECIAL COLUMNS                        
*                                                                               
         DS    30X                  N/D                                         
*                                                                               
OSIN     DS    XL4                  ORIGINAL SYSTEM INPUT NUMBER                
*                                                                               
GRXTLNS  DS    X                    # OF EXTRA GRID TITLE LINES                 
MAXGPAGE EQU   15                                                               
*                                                                               
LDGTNAME DS    CL25                 LEDGER NAME                                 
UNITNAME DS    CL25                 UNIT NAME                                   
UNITLEDG DS    CL(L'SPROUNIT+L'SPROLEDG) UNIT/LEDGER                            
*                                                                               
ENDBBF   DS    PL3                  END BBF DATE                                
*                                                                               
LSTINDS  DS    X                    INDICATOR FOR LI ENQUIRY TYPE               
LSTISUB  EQU   X'80'                . LIST SUB-ACT USED                         
LSTIMLT  EQU   X'40'                . MULTIPLE SUBACT USED                      
LSTINXT  EQU   X'20'                . NEXT PFKEY PRESSED                        
LSTIRTN  EQU   X'10'                . RETURN BACK TO LI SCREEN                  
LSTINCR  EQU   X'08'                . DON'T CLEAR SUB-ACTION FIELDS             
*                                                                               
PCDRIVEN DS    X                    PC ACCPAK FLAG                              
PCMODEQ  EQU   X'80'                . APPLICATION IN PC ACCPAK MODE             
PCGDATQ  EQU   X'40'                . PASS GRID DATA                            
PCGRIDQ  EQU   X'20'                . ALLOWED FOR GRID                          
PCGSCRQ  EQU   X'10'                . BUILD GRID SCREEN LINES                   
PCGRPFQ  EQU   X'08'                . GRIDS USING PFKEYS                        
PCGMSG1  EQU   X'04'                . SHOW GRID MESSAGE 1                       
PCBINTQ  EQU   X'02'                . PC SUPPORTS BINARY COMPRESSION            
PCGNEWF  EQU   X'01'                . NEW GRID FIELD NUMBER                     
*                                                                               
DISPFLAG DS    X                    DISPLAY FLAG                                
NOTFRSTQ EQU   X'80'                . NOT FIRST FOR DISPLAY                     
NORECQ   EQU   X'40'                . NO RECORDS TO DISPLAY                     
ALLREADQ EQU   X'20'                . ALL RECORDS READ                          
DOWNQ    EQU   X'10'                . SCROLLING DIRECTION IS DOWNWARDS          
DISIOMAX EQU   X'08'                . MAX IO                                    
TSARFULQ EQU   X'04'                . TSAR BLOCK IS FULL                        
BALANCEQ EQU   X'02'                . TOP BALNCE LINE XCEPT 1ST SCREEN          
TOTDONEQ EQU   X'01'                . TOTALS COMPLETED                          
*                                                                               
OVRSTAT  DS    X                    GENERAL OVERLAY STATUS                      
OVRREVQ  EQU   X'80'                . ACCOUNT HAS REVERSED TRANSACTIONS         
OVRGDONE EQU   X'40'                . GRID PROCESSING COMPLETE                  
OVRGINIT EQU   X'20'                . GRID PROCESSING STARTED                   
OVRGDILC EQU   X'10'                . DISPLAY LINE CHANGED FOR GRIDS            
OVRGNOD  EQU   X'08'                . NO DATA FOUND FOR GRID COLUMN             
*                                                                               
CORDFLAG DS    X                    CONTRA ORDER FLAG (2 CHAR OFF ONLY)         
CORDMODQ EQU   X'80'                                                            
CORDFSTQ EQU   X'40'                FIRST CONTRA ORDERED RECORD                 
*                                                                               
SECFFLAG DS    X                    SECURITY FIELD FLAG                         
SECFRATE EQU   X'80'                NOT ALLOWED TO VIEW 1P/1R/1J RATE           
*                                                                               
READFLAG DS    X                    RECORD READ TYPE FLAG                       
READCONT EQU   1                    READ CONTRA FOR DETAILS                     
READTRAN EQU   2                    READ TRANSACTION FOR DETAILS                
*                                                                               
CURRFLAG DS    X                    CURRENCY FLAG                               
CURRSRTQ EQU   X'80'                SUPPRESS REQUEST TOTAL                      
CURRSSTQ EQU   X'40'                SUPPRESS SUB TOTAL                          
CURRSFSQ EQU   X'20'                FIRST FOR SUB TOTAL                         
*                                                                               
NXTRMODE DS    X                                                                
NXTRCACQ EQU   X'80'                CONTRA ACCOUNT ONLY                         
*                                                                               
DISPFLG2 DS    X                    DISPLAY FLAG #2                             
DISMOMAX EQU   X'80'                MAXIMUM MONTHLY BUCKETS REACHED             
DISACTN  EQU   X'40'                ACTION ENTERED                              
DISWCOVF EQU   X'20'                WORKCODE OVERFLOW                           
*                                                                               
IOMAXSW  DS    X                    IOMAX SWITCHES                              
IOMRRDUP EQU   X'80'                . RESTART READUP                            
IOMRRD25 EQU   X'40'                . RESTART READU25                           
IOMRLOCL EQU   X'20'                . RESTART LOCAL ROUTINE                     
*                                                                               
GMSGFLG  DS    X                    GRIDS MESSAGE FLAG                          
GMSG     EQU   X'80'                . SHOW GRID MESSAGE                         
GMSG1    EQU   X'40'                . SHOW GRID MESSAGE 1                       
GMSGP    EQU   X'20'                . SHOW GRID NEXTP MESSAGE                   
*                                                                               
CURRACT  DS    X                    CURRENT ACTION ENQUIRIED                    
LASTACT  DS    X                    LAST ACTION ENQUIRIED                       
SHIPCNT  DS    X                    SHIPIT BUFFER COUNTER                       
**********************************************************************          
* COLUMN AREA                                                        *          
**********************************************************************          
*                           OPTION                                              
*                           ------                                              
BLDSDSP  DS    0X                  DISPLACEMENTS FOR SCREEN DISPLAY             
BLDSOFFC DS    XL1               1 DISPLACEMENT TO OFFICE CODE                  
BLDSCACT DS    XL1               3 DISPLACEMENT TO CONTRA ACCOUNT               
BLDSDATE DS    XL1               4 DISPLACEMENT TO TRANSACTION DATE             
BLDSREF  DS    XL1               5 DISPLACEMENT TO TRANSACTION REF              
BLDSMOS  DS    XL1               6 DISPLACEMENT TO TRANSACTION MOS              
BLDSBREF DS    XL1               7 DISPLACEMENT TO BATCH REFERENCE              
BLDSNET  DS    XL1               8 DISPLACEMENT TO NET AMOUNT                   
BLDSCRAM DS    XL1               A DISPLACEMENT TO CREDIT AMOUNT                
BLDSJOB  DS    XL1               C DISPLACEMENT TO JOB                          
BLDSSRCA DS    XL1               D DISPLACEMENT TO SOURCE ACCOUNT               
BLDSCHQ  DS    XL1               E DISPLACEMENT TO CHEQUE NUMBER                
BLDSFWK  DS    XL1            UK G DISPLACEMENT TO SORCE ACCOUNT WC             
BLDSSUBR DS    XL1            UK H DISPLACEMENT TO SUB REFERENCE                
BLDSRNUM DS    XL1               I DISPLACEMENT TO RECORD NUMBER                
BLDSDSCA DS    XL1               J DISPLACEMENT TO DISCOUNT AMOUNT              
BLDSGST  DS    XL1            US K DISPLACEMENT TO GST AMOUNT                   
BLDSBAL  DS    XL1               L DISPLACEMENT TO BAL AMOUNT                   
BLDSADAT DS    XL1               M DISPLACEMENT TO DATE ADDED TO FILE           
BLDSBTYP DS    XL1               N DISPLACEMENT TO BATCH TYPE                   
BLDSADDR DS    XL1            UK O DISPLACEMENT TO ADDRESS                      
BLDSPST  DS    XL1            US P DISPLACEMENT TO PST TYPE/AMOUNT              
BLDSXST  DS    XL1               Q DISPLACEMENT TO STATUS                       
BLDSCTRD DS    XL1               R DISPLACEMENT TO DATE CONTRA'D/PAID           
BLDSMINV DS    XL1            UK S DISPLACEMENT TO MEDIA SERIAL NUM             
BLDSMIN  DS    XL1            US S DISPLACEMENT TO MEDIA SERIAL NUM             
BLDSPERD DS    XL1            US T DISPLACEMENT TO MEDIA PERIOD                 
BLDSNARR DS    XL1               U DISPLACEMENT TO NARRATIVE                    
BLDSMMOS DS    XL1            US V DISPLACEMENT TO MEDIA MOS                    
BLDSOVUN DS    XL1            UK W DISPLACEMENT TO OVER/UNDER COL (SF)          
BLDSPDUE DS    XL1            US W DISPLACEMENT TO PAYMENT DUE DATE             
BLDSPNAM DS    XL1            UK Y DISPLACEMENT TO PAYEE NAME                   
BLDSCDAT DS    XL1            US Y DISPLACEMENT TO CHECK DATE                   
BLDSTSTA DS    XL1               # DISPLACEMENT TO TRANSACTION STATUS           
BLDSTSRF DS    XL1               < DISPLACEMENT TO TRANSACTION SUB REF          
BLDSDA   DS    XL1               ( DISPLACEMENT TO DISK ADDRESS                 
BLDSATYP DS    XL1               % DISPLACEMENT TO APPROVAL METHOD              
         DS    10X                 N/D                                          
BLDSDSPL EQU   *-BLDSDSP                                                        
*                                  PROFIT AND LOSS DISPLACEMENTS                
         ORG   BLDSDSP                                                          
BPLCAC   DS    XL1               3 DISPLACEMENT TO CONTRA ACCOUNT               
BPLCACN  DS    XL1               4 DISPLACEMENT TO CONTRA ACCOUNT NAME          
BPLAAMT  DS    XL1               5 DISPLACEMENT TO ACTUAL AMOUNT                
BPLPAMT  DS    XL1               6 DISPLACEMENT TO PREVIOUS ACTUAL AMT          
BPLASAL  DS    XL1               7 DISPLACEMENT TO SALARY AMOUNT                
BPLAPEN  DS    XL1               8 DISPLACEMENT TO PENSIONS AMOUNT              
BPLABEN  DS    XL1               9 DISPLACEMENT TO BENEFITS AMOUNT              
BPLAIND  DS    XL1               A DISPLACEMENT TO INDIRECT AMOUNT              
         ORG                                                                    
*                                                                               
OSSAVE   DS    XL800               OVERLAY SAVE AREA                            
ANDTWA   DS    XL(4096-(*-TWAD))   N/D (SPARE ADDRESSABLE TWA)                  
*                                                                               
***********************************************************************         
*        NON-ADDRESSABLE TWA AREAS                                    *         
***********************************************************************         
TEMPBLK  DS    XL6000              TEMP BLOCK- BUILDING TSAR AT START           
TSARBLK  DS    XL(TSARDL)          TSAR BLOCK                                   
TSARBLKB DS    XL(TSARDL)          TSAR BLOCK B                                 
OPTVALS  DS    XL(OPTVLLNQ)        OPTION VALUES                                
SECBLK   DS    XL(1*K)             SECURITY BLOCK                               
SVSCRN   DS    XL(ENQWORK-ENQDAT1H) SAVED SCREEN PORTION USED BY HELP           
CURTAB   DS    XL(1*K)             CURRENCY TABLE                               
SVSES    DS    XL(SESLNQ)          SAVE CURRENT SESSION                         
SVTSAR   DS    CL(TSARRECL)        SAVED TSAR RECORD                            
UNDTWA   DS    XL((16*K)-(*-TWAD)) N/D (SPARE UNADDRESSABLE TWA)                
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        OPTION VALUES DSECT                                          *         
***********************************************************************         
OPTVALSD DSECT                                                                  
*                                                                               
OBUKTYP  DS    0CL2                                                             
OBUKFI   DS    C                                                                
OBUKTYPE DS    C                   BUCKET TYPE VALUE                            
*                                                                               
OPAYTYPE DS    C                   SAL, BEN PEN OR IND (1,2,3,4)                
*                                                                               
ODRAFT   DS    C                   'Y' 'N' OR 'O'                               
*                                                                               
OAMOUNT  DS    0CL9                                                             
OAMTFI   DS    X                   FILTER POSITIVE/NEGATIVE                     
OAMTRNG  DS    X                   >/< MORE/LESS THAN RANGE                     
OAMTSIGN DS    X                   +/-                                          
OAMTVL   DS    PL6                                                              
*                                                                               
OATTRIB  DS    C                   'Y' 'N'                                      
*                                                                               
OAUTH    DS    C                   'Y' 'N'                                      
*                                                                               
OBATCH   DS    0CL15                                                            
OBATFI   DS    X                   FILTER POSITIVE/NEGATIVE                     
OBATLN1  DS    X                                                                
OBATVL1  DS    CL6                                                              
OBATLN2  DS    X                                                                
OBATVL2  DS    CL6                                                              
*                                                                               
OPAYREF  DS    0CL15               PAYMENT REFERNENCE FILTER                    
OPAYRFI  DS    X                   FILTER POSITIVE/NEGATIVE                     
OPAYRLN1 DS    X                   LENGTH OF VALUE 1                            
OPAYRVL1 DS    CL6                                                              
OPAYRLN2 DS    X                   LENGTH OF VALUE 2                            
OPAYRVL2 DS    CL6                                                              
*                                                                               
OPAYDATE DS    0XL7                PAYMENT DATE                                 
OPAYDFI  DS    X                   FILTER  POSITIVE/NEGATIVE                    
OPAYDST  DS    XL3                 START DATE                                   
OPAYDEN  DS    XL3                 END DATE                                     
*                                                                               
OCREDIT  DS    C                   'Y'/'N'  OR 'Z'/'N'                          
*                                                                               
ODATE    DS    0XL7                TRANSACTION DATE                             
ODATEFI  DS    X                   FILTER  POSITIVE/NEGATIVE                    
ODATEST  DS    XL3                 START DATE                                   
ODATEEN  DS    XL3                 END DATE                                     
*                                                                               
ODUE     DS    0XL7                DUE DATE                                     
ODUEFI   DS    X                   FILTER  POSITIVE/NEGATIVE                    
ODUEST   DS    XL3                 START DATE                                   
ODUEEN   DS    XL3                 END DATE                                     
*                                                                               
OACT     DS    0XL7                ACTIVITY DATE                                
OACTFI   DS    X                   FILTER  POSITIVE/NEGATIVE                    
OACTST   DS    XL3                 START DATE                                   
OACTEN   DS    XL3                 END DATE                                     
*                                                                               
OUSED    DS    0XL7                USED DATE                                    
OUSEFI   DS    X                   FILTER  POSITIVE/NEGATIVE                    
OUSEST   DS    XL3                 START DATE                                   
OUSEEN   DS    XL3                 END DATE                                     
*                                                                               
ODEBIT   DS    C                   'Y'/'N'  OR 'Z'/'N'                          
*                                                                               
OGROSS   DS    C                   'Y'/'N'                                      
*                                                                               
OHELD    DS    C                   'Y'/'N'                                      
*                                                                               
OMMOS    DS    0XL7                MEDIA MOS 'THIS IS REAL MOS'                 
OMMOSFI  DS    X                   FILTER  POSITIVE/NEGATIVE                    
OMMOSST  DS    XL3                 MEDIA MOS START                              
OMMOSEN  DS    XL3                 MEDIA MOS END                                
*                                                                               
OMOS     DS    0XL7                                                             
OMOSFI   DS    X                   FILTER  POSITIVE/NEGATIVE                    
OMOSST   DS    XL3                 MOS START                                    
OMOSEN   DS    XL3                 MOS END                                      
*                                                                               
         ORG   OMOS                                                             
OMOA     DS    0XL7                                                             
OMOAFI   DS    X                   FILTER  POSITIVE/NEGATIVE                    
OMOAST   DS    XL3                 MOA START                                    
OMOAEN   DS    XL3                 MOA END                                      
         ORG                                                                    
*                                                                               
OPMOS    DS    0XL7                                                             
OPMOSFI  DS    X                   FILTER  POSITIVE/NEGATIVE                    
OPMOSST  DS    XL3                 PREVIOUS MOS START                           
OPMOSEN  DS    XL3                 PREVIOUS MOS END                             
*                                                                               
OHOURS   DS    C                   'Y'/'N'                                      
*                                                                               
ONEGATIV DS    C                   'Y'/'N'                                      
*                                                                               
ONET     DS    C                   'Y'/'N'                                      
*                                                                               
OOFFICE  DS    0CL513                                                           
OOFFICFI DS    X                   FILTER  POSITIVE/NEGATIVE                    
OOFFICVL DS    0CL2                OFFICE VALUE                                 
OOFFICLS DS    CL(L'OFFAWORK)      LIST OF OFFICES                              
*                                                                               
OPEELED  DS    C                   'Y'/'N'                                      
*                                                                               
OREF     DS    0CL15                                                            
OREFFI   DS    X                   FILTER POSITIVE/NEGATIVE                     
OREFLN1  DS    X                   LENGTH OF VALUE 1                            
OREFVL1  DS    CL6                 REF VALUE 1                                  
OREFLN2  DS    X                   LENGTH OF VALUE 2                            
OREFVL2  DS    CL6                 REF VALUE 2                                  
*                                                                               
OTOFICE  DS    0CL3                TRANSACTION OFFICE                           
OTOFICFI DS    X                   FILTER  POSITIVE/NEGATIVE                    
OTOFICVL DS    CL2                 OFFICE VALUE                                 
*                                                                               
         DS    CL12                N/D                                          
*                                                                               
OREVERSE DS    C                   'Y'/'N'                                      
*                                                                               
OSELECT  DS    C                   'Y'/'N'                                      
*                                                                               
OTYPE    DS    0CL13                                                            
OTYPIN   DS    X                   OPTION INDEX                                 
OTYPLN   DS    X                   LENGTH OF VALUE                              
OTYPEFI  DS    C                   'FILTER POSITIVE/NEGATIVE                    
OTYPEVAL DS    CL10                CHARS                                        
*                                                                               
ODSP     DS    0C                  DISPLAY COL OVERRIDE                         
ODSPIN   DS    X                   OPTION INDEX                                 
ODSPLN   DS    X                   LENGTH OF VALUE                              
ODSPFI   DS    C                   DUMMY FILTER                                 
ODSPVAL  DS    CL32                DISPLAY COLUMN VALUES                        
*                                                                               
OTYPE1   DS    X                   ORDER TYPE 'P'(PROD) OR 'E'(EXPENSE)         
*                                                                               
OSHOW    DS    C                   SHOW (B)ALANCE/(E)ST-CHGS/(U)NBILLED         
*                                                                               
OCHARGE  DS    C                   CHRG=(E)STIMATE/(O)VEREST/(U)NDEREST         
*                                                                               
OXDETAIL DS    C                   'Y'/'N'                                      
*                                                                               
OCLOSED  DS    C                   'Y'/'N'                                      
*                                                                               
OLOCKED  DS    C                   'Y'/'N'                                      
*                                                                               
OWCODE   DS    0CL4                                                             
OWCODEIN DS    X                   OPTION INDEX                                 
OWCODELN DS    X                                                                
OWCODEFI DS    X                   FILTER  POSITIVE/NEGATIVE                    
OWCODEVL DS    CL2                 WORK CODE VALUE                              
*                                                                               
OBILLED  DS    C                   'Y'/'N' OR (E)ST/(O)VEREST/(U)NDREST         
*                                                                               
OUNBILL  DS    C                   'Y'/'N'                                      
*                                                                               
OEST     DS    C                   'Y'/'N'                                      
*                                                                               
OBILNO   DS    0CL15                                                            
OBILFI   DS    X                   FILTER  POSITIVE/NEGATIVE                    
OBILLN1  DS    X                   LENGTH OF VALUE 1                            
OBILVL1  DS    CL6                 BILL NUMBER VALUE 1                          
OBILLN2  DS    X                   LENGTH OF VALUE 2                            
OBILVL2  DS    CL6                 BILL NUMBER VALUE 2                          
*                                                                               
ODDS     DS    C                   'Y'/'N'                                      
*                                                                               
OORDNO   DS    0CL15                                                            
OORDFI   DS    X                   FILTER  POSITIVE/NEGATIVE                    
OORDLN1  DS    X                   LENGTH OF VALUE 1                            
OORDVL1  DS    CL6                 ORD NUMBER VALUE 1                           
OORDLN2  DS    X                   LENGTH OF VALUE 1                            
OORDVL2  DS    CL6                 ORD NUMBER VALUE 2                           
*                                                                               
OALL     DS    C                   'Z'/'N'                                      
*                                                                               
OOUT     DS    C                   'O'/'N'                                      
*                                                                               
OLEVEL   DS    0CL3                                                             
OLEVFI   DS    X                   FILTER  POSITIVE/NEGATIVE                    
OLEVVL1  DS    CL1                 VALUE 1                                      
OLEVVL2  DS    CL1                 VALUE 2                                      
*                                                                               
OMEDIA   DS    0CL2                                                             
OMEDIAFI DS    X                   FILTER  POSITIVE/NEGATIVE                    
OMEDIAVL DS    X                   MEDIA TYPE                                   
*                                                                               
         DS    C                   ** REMOVED ** OPEELDAT  'Y'/'N'              
*                                                                               
ODELETED DS    C                   'Y'/'N'                                      
*                                                                               
OFULLDEL DS    C                   'Y'/'N'                                      
*                                                                               
OCLIENT  DS    0XL15                                                            
OCLINFI  DS    X                   FILTER  POSITIVE/NEGATIVE                    
OCLINLN1 DS    X                   LENGTH OF VALUE 1                            
OCLINVL1 DS    CL6                 CLIENT CODE 1                                
OCLINLN2 DS    X                   LENGTH OF VALUE 2                            
OCLINVL2 DS    CL6                 CLIENT CODE 2                                
*                                                                               
OPROD    DS    0XL25                                                            
OPRODFI  DS    X                   FILTER  POSITIVE/NEGATIVE                    
OPRODLN1 DS    X                   LENGTH OF VALUE 1                            
OPRODVL1 DS    CL11                PRODUCT CODE 1                               
OPRODLN2 DS    X                   LENGTH OF VALUE 2                            
OPRODVL2 DS    CL11                PRODUCT CODE 2                               
*                                                                               
OJOB     DS    0XL27                                                            
OJOBFI   DS    X                   FILTER  POSITIVE/NEGATIVE                    
OJOBLN1  DS    X                   LENGTH OF VALUE 1                            
OJOBVL1  DS    CL12                JOB CODE 1                                   
OJOBLN2  DS    X                   LENGTH OF VALUE 2                            
OJOBVL2  DS    CL12                JOB CODE 2                                   
*                                                                               
OSRC     DS    0XL31                                                            
OSRCFI   DS    X                   FILTER  POSITIVE/NEGATIVE                    
OSRCLN1  DS    X                   LENGTH OF VALUE 1                            
OSRCVL1  DS    CL14                SOURCE CODE 1                                
OSRCLN2  DS    X                   LENGTH OF VALUE 2                            
OSRCVL2  DS    CL14                SOURCE CODE 2                                
*                                                                               
OSUPP    DS    0XL27                                                            
OSUPPFI  DS    X                   FILTER  POSITIVE/NEGATIVE                    
OSUPPLN1 DS    X                   LENGTH OF VALUE 1                            
OSUPPVL1 DS    CL12                SUPPLIER CODE 1                              
OSUPPLN2 DS    X                   LENGTH OF VALUE 2                            
OSUPPVL2 DS    CL12                SUPPLIER CODE 2                              
*                                                                               
OFMATCH  DS    C                   'Y'/'N'                                      
*                                                                               
OORDERS  DS    C                   'Y'/'N'                                      
*                                                                               
OINCRMT  DS    0XL3                COLUMN INCREMENT AMOUNT                      
OINCTYPE DS    X                   'N' NUMERIC, 'M' MONTHLY                     
OINCVL   DS    XL2                 AGEING VALUE 1-999 IF NUMERIC                
*                                                                               
OSUMM1   DS    C                   'W'/'C'/'S'                                  
*                                                                               
OOFFDET  DS    C                   'Y'/'N'                                      
*                                                                               
OFIXD    DS    0XL15                                                            
OFIXDFI  DS    X                   FILTER  POSITIVE/NEGATIVE                    
OFIXDLN1 DS    X                   LENGTH OF VALUE 1                            
OFIXDVL1 DS    CL6                 FIXED REF 1                                  
OFIXDLN2 DS    X                   LENGTH OF VALUE 2                            
OFIXDVL2 DS    CL6                 FIXED REF 2                                  
*                                                                               
OSTATDT  DS    0XL7                STATEMENT DATE                               
OSTATFI  DS    X                   FILTER  POSITIVE/NEGATIVE                    
OSTATST  DS    XL3                 START DATE                                   
OSTATEN  DS    XL3                 END DATE                                     
*                                                                               
OVOID    DS    C                   'Y'/'N'/'O'                                  
*                                                                               
OCONT    DS    C                   'Y'/'N'/'O'                                  
*                                                                               
ODISC    DS    C                   'Y'/'N'/'O'                                  
*                                                                               
OAGEBY   DS    C                   D/B/M DUE DATE/BILL DATE/MOS                 
*                                                                               
OSHREC   DS    C                   SHOW (D)UE DATE                              
*                                                                               
OMAN     DS    C                   'Y'/'N'/'O'                                  
*                                                                               
OEXP     DS    C                   'Y'/'N'                                      
*                                                                               
OPAID    DS    C                   'Y'/'N'                                      
*                                                                               
ORECDTE  DS    0XL7                'Y'/'N'/'O'/'D'=DATE RANGE                   
ORECON   DS    C                   FILTER  POSITIVE/NEGATIVE                    
ORECST   DS    XL3                 RECONCILED START                             
ORECEN   DS    XL3                 RECONCILED END                               
*                                                                               
OCLRDTE  DS    0XL7                'Y'/'N'/'O'/'D'=DATE RANGE                   
OCLRON   DS    C                   FILTER  POSITIVE/NEGATIVE                    
OCLRST   DS    XL3                 CLEARED START                                
OCLREN   DS    XL3                 CLEARED END                                  
*                                                                               
OOFFPOS  DS    0CL3                OFFICE FILTERING (BASED ON OFFPOS)           
OOFFPFI  DS    X                   FILTER  POSITIVE/NEGATIVE                    
OOFFPVL  DS    CL2                 OFFICE VALUE                                 
*                                                                               
OBTYPE   DS    0CL2                                                             
OBTYPEFI DS    X                   FILTER  POSITIVE/NEGATIVE                    
OBTYPEVL DS    X                   BATCH TYPE                                   
*                                                                               
ORUNNO   DS    0CL3                RUN NUMBER (ST LEDGER ONLY)                  
ORUNFI   DS    X                   FILTER  POSITIVE/NEGATIVE                    
ORUNVL   DS    XL2                 RUN NUMBER                                   
*                                                                               
OPJOB    DS    0XL25               PROJOB                                       
OPJFI    DS    X                   FILTER  POSITIVE/NEGATIVE                    
OPJLN1   DS    X                   LENGTH OF VALUE 1                            
OPJVL1   DS    CL11                JOB CODE 1                                   
OPJLN2   DS    X                   LENGTH OF VALUE 2                            
OPJVL2   DS    CL11                JOB CODE 2                                   
*                                                                               
OURGENT  DS    CL1                 YES/NO/ONLY                                  
*                                                                               
*                                                                               
OALLTRAN DS    CL1                 YES/NO                                       
*                                                                               
OTIME    DS    CL1                 B/N/R                                        
*                                                                               
OTTYPE   DS    CL1                 T/M/A                                        
*                                                                               
ODETAIL  DS    CL1                 YES/NO                                       
*                                                                               
OBASIS   DS    CL1                 YES/NO                                       
*                                                                               
OTAX     DS    CL1                 YES/NO                                       
*                                                                               
OODATE   DS    0XL7                ORDER DATE                                   
OODATEFI DS    X                   FILTER  POSITIVE/NEGATIVE                    
OODATEST DS    XL3                 START DATE                                   
OODATEEN DS    XL3                 END DATE                                     
*                                                                               
OPMATCH  DS    C                   'Y'/'N'/'O'                                  
*                                                                               
OPARTDEL DS    C                   'Y'/'N'/'O'                                  
*                                                                               
ODDATE   DS    0XL7                DEPOSIT DATE                                 
ODDATEFI DS    X                   FILTER  POSITIVE/NEGATIVE                    
ODDATEST DS    XL3                 START DATE                                   
ODDATEEN DS    XL3                 END DATE                                     
*                                                                               
OESTIMAT DS    0XL27                                                            
OESTFI   DS    X                   FILTER  POSITIVE/NEGATIVE                    
OESTLN1  DS    X                   LENGTH OF VALUE 1                            
OESTVL1  DS    CL12                EST CODE 1                                   
OESTLN2  DS    X                   LENGTH OF VALUE 2                            
OESTVL2  DS    CL12                EST CODE 2                                   
*                                                                               
*                                  NOTE: ONLY INITIALIZED IN THE UK             
OCURRY   DS    0CL4                CURRENCY FILTER                              
OCURRYFI DS    X                   FILTER  POSITIVE/NEGATIVE                    
OCURRYVL DS    CL3                 AAA (WHERE AAA IS A CURRENCY CODE)           
*                                                                               
*                                  NOTE: ONLY INITIALIZED IN THE UK             
OVALUE   DS    C                   A/L/B AGENCY/LOCAL/BOTH                      
*                                                                               
*                                  NOTE: NEVER INITIALIZED                      
OMEMOAFC DS    C                   Y/N/O                                        
*                                                                               
OBFWD    DS    C                   Y/N                                          
*                                                                               
OPST     DS    C                   YES/NO                                       
*                                                                               
OTAXALL  DS    C                   GST/PST                                      
*                                                                               
OMERGE   DS    C                   'Y'/'N'                                      
*                                                                               
*                                  NOTE: NEVER INITIALIZED                      
OSUBREF  DS    0CL17                                                            
OSUBRFI  DS    X                   FILTER POSITIVE/NEGATIVE                     
OSUBRLN1 DS    X                   LENGTH OF VALUE 1                            
OSUBRVL1 DS    CL7                 REF VALUE 1                                  
OSUBRLN2 DS    X                   LENGTH OF VALUE 2                            
OSUBRVL2 DS    CL7                 REF VALUE 2                                  
*                                                                               
O11DET   DS    C                   'Y'/'N'                                      
*                                                                               
O12DET   DS    C                   'Y'/'N'                                      
*                                                                               
O13DET   DS    C                   'Y'/'N'                                      
*                                                                               
O14DET   DS    C                   'Y'/'N'                                      
*                                                                               
O15DET   DS    C                   'Y'/'N'                                      
*                                                                               
O16DET   DS    C                   'Y'/'N'                                      
*                                                                               
OALLDET  DS    C                   'Y'/'N'                                      
*                                                                               
OCF      DS    C                   'Y'/'N'                                      
*                                                                               
OSERIAL  DS    0XL43               MEDIA SERIAL #/LONG INVOICE #                
OSERFI   DS    X                   FILTER  POSITIVE/NEGATIVE                    
OSERLN1  DS    X                   LENGTH OF VALUE 1                            
OSERVL1  DS    CL20                MEDIA SERIAL NUMBER 1                        
OSERLN2  DS    X                   LENGTH OF VALUE 2                            
OSERVL2  DS    CL20                MEDIA SERIAL NUMBER 2                        
*                                                                               
OKREF    DS    0CL15                                                            
OKREFFI  DS    X                   FILTER POSITIVE/NEGATIVE                     
OKREFLN1 DS    X                   LENGTH OF VALUE 1                            
OKREFVL1 DS    CL6                 KEY REF VALUE 1                              
OKREFLN2 DS    X                   LENGTH OF VALUE 2                            
OKREFVL2 DS    CL6                 KEY REF VALUE 2                              
*                                                                               
OPARTAPP DS    C                   'Y'/'N'/'O'                                  
OREJECT  DS    C                   'Y'/'N'/'O'                                  
OSUBMIT  DS    C                   'Y'/'N'/'O'                                  
OINPRGRS DS    C                   'Y'/'N'/'O'                                  
*ORECEIVE DS    C                   'Y'/'N'/'O'                                 
*                                                                               
         DS    0D                                                               
OOFF1    DS    0CL7                OFFICE FILTERING                             
OOFF1FI  DS    X                   FILTER POSITIVE/NEGATIVE                     
OOFF1LN1 DS    X                                                                
OOFF1VL1 DS    CL2                                                              
OOFF1LN2 DS    X                                                                
OOFF1VL2 DS    CL2                                                              
*                                                                               
OSTAT    DS    CL1                 STATUS                                       
         DS    CL21                                                             
OPTVLLNQ EQU   *-OPTVALSD                                                       
         EJECT                                                                  
***********************************************************************         
* DSECT TO COVER GRID COLUMN TABLE                                              
*       . IF GRID DATA IS TAKEN FROM AN ELEMENT, THEN GCTDADI HAS THE           
*         DISPL TO THE 1ST ELEM IN BYTE 1 AND DISPL TO DATA IN BYTE 2           
*       . IF A SPECIAL ROUTINE IS NEEDED, THEN GCTDADI IS THE DISPL TO          
*         A FIELD CONTAINING THE ADDRESS OF THAT ROUTINE FROM OVERWORK          
***********************************************************************         
GCTBLD   DSECT                                                                  
GCTLN    DS    XL1          +0  LENGTH OF TABLE ENTRY (0=END OF TAB)            
GCTCOID  DS    XL1          +1   COLUMN ID #(TWO DIGIT, 9N FOR 1ST COL)         
GCTNMLN  DS    AL1          +2    LENGTH OF COLUMN NAME                         
GCTDALN  DS    0AL1         +3     LENGTH OF COLUMN DATA                        
GCTDTYP  DS    0AL1         +3     + DATE TYPE (FOR DATCON)                     
GCTYONV  DS    AL1          +3     + BIT TO CHECK FOR YES OR NO                 
*                                                                               
GCTNADI  DS    AL2          +4,5   DISPLACEMENT TO COLUMN NAME                  
GCTDADI  DS    0AL2         +6,7     DISPLACEMENT TO COLUMN DATA                
GCTELCD  DS    XL1          +6       + ELEMENT CODE                             
GCTELDS  DS    AL1          +7        + DISPLACEMENT IN ELEMENT TO DATA         
*                                                                               
GCTIND1  DS    XL1          +8     GRID COLUMN INDICATOR                        
GCTIOVER EQU   X'80'               . NAME DISPLACEMENT FROM OVERWORK            
GCTIELEM EQU   X'40'               . DATA IN AN ELEMENT                         
GCTIROUT EQU   X'20'               . SPECIAL ROUTINE TO EXTRACT DATA            
GCTIXLDG EQU   X'10'               . EXCLUDE LEDGERS IN LEDGER LIST             
GCTITOT  EQU   X'08'               . TOTAL THIS COLUMN                          
GCTIELST EQU   X'04'               . ELEMENT SUBTYPE USED (EL CODE+2)           
GCTINOTO EQU   X'02'               . NO TOTAL LINE (ON IN 1ST ENTRY)            
GCTIRTOT EQU   X'01'               . TOTAL REQUIRES SPECIAL ROUTINE             
GCTIND2  DS    XL1          +9     GRID COLUMN INDICATOR                        
GCTIDR   EQU   X'80'               . DEBIT                                      
GCTICR   EQU   X'40'               . CREDIT                                     
GCTIBIN  EQU   X'20'               . BINARY/HEX NUMBER                          
GCTIHEX  EQU   X'10'               . BINARY/HEX NUMBER (HEXOUT)                 
GCTIYON  EQU   X'08'               . YES OR NO FLAG                             
GCTIMONO EQU   X'04'               . DATE SHOULD SHOW MONTH ONLY                
GCTIDDS  EQU   X'02'               . DDS ONLY COLUMN                            
GCTISPDA EQU   X'01'               . SPECIAL DATA FIELD IN WRKNG STRGE          
GCTFIND  DS    XL1          +10    FORMAT INDICATOR                             
GCTFTXT  EQU   X'00'               . FORMAT=TEXT                                
GCTFDAT  EQU   X'40'               . FORMAT=DATE                                
GCTFNUM  EQU   X'20'               . FORMAT=NUMERIC                             
GCTFLEFT EQU   X'00'               . ALIGN=LEFT                                 
GCTFRGHT EQU   X'08'               . ALIGN=RIGHT                                
GCTFCENT EQU   X'04'               . ALIGN=CENTER                               
GCTFSIZ  EQU   X'02'               . ALIGN=SIZED (2")                           
GCTFHIDE EQU   X'01'               . HIDE (DEFAULT)                             
GCTIND3  DS    X            +11    GRID COLUMN INDICATOR                        
GCTIEVL  EQU   X'80'               . VARIABLE LENGTH DATA IN ELEMENT            
GCTINDEC EQU   X'40'               . NO DECIMALS WANTED                         
GCTISPTO EQU   X'20'               . TOTAL VALUE IN WORKING STORAGE             
GCTIZAB  EQU   X'10'               . ZERO AMOUNTS ARE BLANK                     
GCTISPC  EQU   X'08'               . SPECIAL- ONLY IF THIS BIT SET              
GCTICAN  EQU   X'04'               . CANADA ONLY                                
GCTI2ND  EQU   X'02'               . SECONDARY GRID COLUMN ONLY                 
GCTI1ST  EQU   X'01'               . PRIMARY GRID COLUMN ONLY                   
*                                                                               
GCTDITRS DS    0XL1         +12    DISPL TO TRNSTAT (FOR DR OR CR)              
GCTELSCD DS    XL1          +12    + ELEMENT SUB-CODE IF USED                   
GCTLTOT  DS    AL1          +13    LENGTH OF TOTAL NAME                         
GCTDTOT  DS    AL2          +14,15 DISPLACEMENT TO TOTAL FIELD                  
*                                                                               
GCTLN1Q  EQU   *-GCTBLD            LENGTH OF ENTRY WITHOUT LEDGER LIST          
GCTLDG   DS    CL2                 LEDGER LIST (NONE=ALL LEDGERS)               
*                                                                               
GCTSEPQ  EQU   C'|'                                                             
GCTHLMXQ EQU   10                                                               
GCTDLMXQ EQU   L'DUMLIN1-2         MAXIMUM LENGTH OF DOWNLOAD FIELD             
         EJECT                                                                  
***********************************************************************         
*        SESSION SAVE DSECT                                           *         
***********************************************************************         
SESD     DSECT                                                                  
SESSUB   DS    CL(ACTSHLNQ)        SUB-ACTION USED BY NEXT PFKEY                
SESDISPL DS    XL1                 CURRENT POS. OF DISPLAY DATA LINE            
SESCURNO DS    H                   TSAR REC NO FOR NEXT DISPLAY LINE            
SESACTF  DS    CL(L'BASACT)        ACTION FIELD                                 
SESKEYF  DS    CL(L'BASKEY)        KEY FIELD                                    
SESKEYFL DS    XL(L'FLDILEN)       LENGTH OF KEY FIELD                          
SESOPTF  DS    CL(L'BASOPT)        OPTION FIELD                                 
SESOPTFL DS    XL(L'FLDILEN)       LENGTH OF OPTION FIELD                       
SESSUBF  DS    15CL(L'LSTACT2)     SUB-ACTION FIELD                             
SESLNQ   EQU   *-SESD                                                           
*                                                                               
***********************************************************************         
*        TIA                                                          *         
***********************************************************************         
TIAD     DSECT                                                                  
BALTAB   DS    (MAXOFFQ+1)XL(BALLNQ)                                            
         ORG   BALTAB                                                           
CRBLOCK  DS    XL((CRMAXQ+1)*CRLNQ) CREDITOR BLOCK                              
CRMAXQ   EQU   15                                                               
         ORG                                                                    
UNDTIA   DS    XL((18*K)-(*-TIAD)) N/D (SPARE TIA)                              
         DS    0H                                                               
         EJECT                                                                  
*                                                                               
***********************************************************************         
*        INCLUDED DSECTS                                              *         
***********************************************************************         
* ACGENFILE                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACGENFILE                                                      
         PRINT ON                                                               
* ACGENBOTH                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACGENBOTH                                                      
         PRINT ON                                                               
* ACDDEQUS                                                                      
         PRINT OFF                                                              
       ++INCLUDE ACDDEQUS                                                       
         PRINT ON                                                               
* ACJOBBERD                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACJOBBERD                                                      
         PRINT ON                                                               
* ACOFFALD                                                                      
         PRINT OFF                                                              
       ++INCLUDE ACOFFALD                                                       
         PRINT ON                                                               
* ACMSGEQUS                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACMSGEQUS                                                      
         PRINT ON                                                               
* ACPRORATAD                                                                    
PRORATAD DSECT                                                                  
         PRINT OFF                                                              
       ++INCLUDE ACPRORATAD                                                     
         PRINT ON                                                               
* ACVATICAND                                                                    
         PRINT OFF                                                              
       ++INCLUDE ACVATICAND                                                     
         PRINT ON                                                               
*                                                                               
* DDDLCB                                                                        
         PRINT OFF                                                              
       ++INCLUDE DDDLCB                                                         
         PRINT ON                                                               
*                                                                               
* FAFACTS                                                                       
         PRINT OFF                                                              
       ++INCLUDE FAFACTS                                                        
         PRINT ON                                                               
* FATIOB                                                                        
         PRINT OFF                                                              
       ++INCLUDE FATIOB                                                         
         PRINT ON                                                               
* FAGETTXTD                                                                     
         PRINT OFF                                                              
       ++INCLUDE FAGETTXTD                                                      
         PRINT ON                                                               
* FASECRETD                                                                     
         PRINT OFF                                                              
       ++INCLUDE FASECRETD                                                      
         PRINT ON                                                               
* DDCOMFACS                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDCOMFACS                                                      
         PRINT ON                                                               
* DDACCFACS                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDACCFACS                                                      
         PRINT ON                                                               
* DDOFFICED                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDOFFICED                                                      
         PRINT ON                                                               
* DDEBLOCK                                                                      
         PRINT OFF                                                              
       ++INCLUDE DDEBLOCK                                                       
         PRINT ON                                                               
* DDPERVALD                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDPERVALD                                                      
         PRINT ON                                                               
* DDFLDHDR                                                                      
         PRINT OFF                                                              
       ++INCLUDE DDFLDHDR                                                       
         PRINT ON                                                               
* DDTSARD                                                                       
         PRINT OFF                                                              
       ++INCLUDE DDTSARD                                                        
         PRINT ON                                                               
* DDCTRYEQUS                                                                    
         PRINT OFF                                                              
       ++INCLUDE DDCTRYEQUS                                                     
         PRINT ON                                                               
* DDLANGEQUS                                                                    
         PRINT OFF                                                              
       ++INCLUDE DDLANGEQUS                                                     
         PRINT ON                                                               
* DDGETHELPD                                                                    
         PRINT OFF                                                              
       ++INCLUDE DDGETHELPD                                                     
         PRINT ON                                                               
* DDCURTABD                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDCURTABD                                                      
         PRINT ON                                                               
JBLOCKD  DSECT                                                                  
* ACJOBBLOCK                                                                    
         PRINT OFF                                                              
       ++INCLUDE ACJOBBLOCK                                                     
         PRINT ON                                                               
*                                                                               
* ACGOBLOCK                                                                     
GOBLOCKD DSECT                                                                  
         PRINT OFF                                                              
       ++INCLUDE ACGOBLOCK                                                      
         PRINT ON                                                               
* ACGENRAC                                                                      
         PRINT OFF                                                              
       ++INCLUDE ACGENRAC                                                       
         PRINT ON                                                               
* CTGENFILE                                                                     
         PRINT OFF                                                              
       ++INCLUDE CTGENFILE                                                      
         PRINT ON                                                               
