*          DATA SET ACENQFED   AT LEVEL 002 AS OF 05/12/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T620FED      DATE 05/12/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL8      4    2    8  L  P H             T        Y              
ENQSCRLH DS    XL8                                                              
ENQSCRL  DS    CL8      4   11    8  A  U N        M    T        Y              
ENQDAT1H DS    XL8                                                              
ENQDAT1  DS    CL78     5    2   78  L  P N             T        Y              
ENQDAT2H DS    XL8                                                              
ENQDAT2  DS    CL78     6    2   78  L  P N             T        Y              
ENQDAT3H DS    XL8                                                              
ENQDAT3  DS    CL78     7    2   78  L  P N             T        Y              
ENQDAT4H DS    XL8                                                              
ENQDAT4  DS    CL78     8    2   78  L  P N             T        Y              
ENQDAT5H DS    XL8                                                              
ENQDAT5  DS    CL78     9    2   78  L  P N             T        Y              
ENQDAT6H DS    XL8                                                              
ENQDAT6  DS    CL78    10    2   78  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    11    2   78  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    12    2   78  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    13    2   78  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    14    2   78  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    15    2   78  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    16    2   78  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    17    2   78  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    18    2   78  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    19    2   78  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    20    2   78  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    21    2   78  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    22    2   78  L  P N             T        Y              
ENQDATLH DS    XL8                                                              
ENQDATL  DS    CL78    23    2   78  L  P N             T        Y              
ENQPFAH  DS    XL8                                                              
ENQPFA   DS    CL78    24    2   78  L  P H             T        Y              
ENQLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
ENQWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1760 BYTES                            
