*          DATA SET ACEQUTABD  AT LEVEL 007 AS OF 07/29/03                      
EQRULTBD DSECT                                                                  
EQRLSEQ  DS    XL1                 SEQUENCE NUMBER OF THIS RULE (0-4)           
EQRLLEN  DS    XL1                 TOT LENGTH OF THIS RULE (W/O COMMAS)         
EQRMVLN  DS    XL1                 MINIMUM VARIABLE LENGTH                      
EQNMLEN  DS    XL1                 LENGTH OF ACCT EQUIVALENCY NAME              
EQRLNLVS DS    XL1                 NUMBER OF LEVELS                             
EQRLNAME DS    CL10                ACCT EQUIVALENCY NAME FROM LEDGER            
EQRLRULE DS    XL30                ACCT EQUIVALENCY RULE                        
EQRLLNQ  EQU   *-EQRULTBD                                                       
