*          DATA SET ACEXPF9D   AT LEVEL 004 AS OF 12/31/85                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T615F9D      DATE 12/31/85                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A   P    H         T        Y              
LOGACNH  DS    CL8                                                              
LOGACN   DS    CL5      5   10    5  A   U    N         T        Y              
LOGACNNH DS    CL8                                                              
LOGACNN  DS    CL36     5   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    H         T        Y              
LOGAGYH  DS    CL8                                                              
LOGAGY   DS    CL3      6   10    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      6   20    7  A   P    H         T        Y              
LOGPRDH  DS    CL8                                                              
LOGPRD   DS    CL2      6   28    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5      6   38    5  A   P    N         T        Y              
LOGMEDH  DS    CL8                                                              
LOGMED   DS    CL2      6   46    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      6   56    6  A   P    N         T        Y              
LOGPERH  DS    CL8                                                              
LOGPER   DS    CL14     6   64   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      6   80    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16     8    2   16  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL40     8   38   40  A   P    H         T        Y              
LOGDATAH DS    CL8                                                              
LOGDATA  DS    CL65     9    2   65  A   P    N         T        Y              
LOGTRNH  DS    CL8                                                              
LOGTRN   DS    CL8      9   68    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    10    2   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     10   68    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    11    2   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     11   68    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    12    2   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     12   68    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    13    2   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     13   68    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    14    2   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     14   68    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    15    2   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     15   68    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    16    2   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     16   68    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    17    2   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     17   68    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    18    2   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     18   68    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    19    2   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     19   68    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    20    2   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     20   68    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    21    2   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     21   68    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    22    2   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     22   68    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    23    2   65  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     23   68    8  A   U    N         T        Y              
LOGTABH  DS    CL8                                                              
LOGTAB   DS    CL1     24   68    1  A   U    N         T        Y              
LOGLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LOGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1609 BYTES                            
