*          DATA SET ACEXPFCD   AT LEVEL 010 AS OF 02/13/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T615FCD      DATE 02/13/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL10     6    2   10  A  P H             T        Y              
LOGMEDH  DS    CL8                                                              
LOGMED   DS    CL2      6   20    2  A  U N             T        Y              
LOGMEDNH DS    CL8                                                              
LOGMEDN  DS    CL36     6   32   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13     7    2   13  A  P H             T        Y              
LOGVEHH  DS    CL8                                                              
LOGVEH   DS    CL8      7   20    8  A  U N             T        Y              
LOGVEHNH DS    CL8                                                              
LOGVEHN  DS    CL36     7   32   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16     8    2   16  A  P H             T        Y              
LOGACNH  DS    CL8                                                              
LOGACN   DS    CL5      8   20    5  A  U N             T        Y              
LOGACNNH DS    CL8                                                              
LOGACNN  DS    CL36     8   32   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     9    2   11  A  P H             T        Y              
LOGAGYH  DS    CL8                                                              
LOGAGY   DS    CL3      9   20    3  A  U N             T        Y              
LOGAGYNH DS    CL8                                                              
LOGAGYN  DS    CL36     9   32   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    10    2   12  A  P H             T        Y              
LOGPRDH  DS    CL8                                                              
LOGPRD   DS    CL2     10   20    2  A  U N             T        Y              
LOGPRDNH DS    CL8                                                              
LOGPRDN  DS    CL36    10   32   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    11    2   14  A  P H             T        Y              
LOGINVH  DS    CL8                                                              
LOGINV   DS    CL6     11   20    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    12    2   16  A  P H             T        Y              
LOGADTEH DS    CL8                                                              
LOGADTE  DS    CL8     12   20    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   32    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    13    2   12  A  P H             T        Y              
LOGGAMTH DS    CL8                                                              
LOGGAMT  DS    CL10    13   20   10  A  U N             T        Y              
LOGAPPH  DS    CL8                                                              
LOGAPP   DS    CL20    13   32   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    14    2   10  A  P N             T        Y              
LOGNAMTH DS    CL8                                                              
LOGNAMT  DS    CL10    14   20   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    15    2   14  A  P N             T        Y              
LOGCSHDH DS    CL8                                                              
LOGCSHD  DS    CL2     15   20    2  A  U N             T        Y              
LOGCDAMH DS    CL8                                                              
LOGCDAM  DS    CL10    15   32   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    16    2   14  A  P N             T        Y              
LOGCTGYH DS    CL8                                                              
LOGCTGY  DS    CL2     16   20    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17    2    8  A  P N             T        Y              
LOGCMTH  DS    CL8                                                              
LOGCMT   DS    CL50    17   20   50  A  U N             T        Y              
LOGCMT2H DS    CL8                                                              
LOGCMT2  DS    CL50    18   20   50  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    20    2   13  A  P N             T        Y              
LOGGYTDH DS    CL8                                                              
LOGGYTD  DS    CL10    20   23   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    21    2   16  A  P N             T        Y              
LOGBAMTH DS    CL8                                                              
LOGBAMT  DS    CL10    21   23   10  A  P N             T        Y              
LOGYEARH DS    CL8                                                              
LOGYEAR  DS    CL20    21   36   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    22    2   17  A  P N             T        Y              
LOGPBUDH DS    CL8                                                              
LOGPBUD  DS    CL10    22   23   10  A  P N             T        Y              
LOGTABH  DS    CL8                                                              
LOGTAB   DS    CL1     23   23    1  A  U N             T        Y              
LOGLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LOGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 952  BYTES                            
