*          DATA SET ACEXPFDD   AT LEVEL 003 AS OF 03/01/85                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T615FDD      DATE 03/01/85                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7   A    P    H         T         Y           
LOGUNTH  DS    CL8                                                              
LOGUNT   DS    CL1      5   10    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      5   20    7   A    P    H         T         Y           
LOGLEDH  DS    CL8                                                              
LOGLED   DS    CL1      5   28    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      5   38    7   A    P    N         T         Y           
LOGACCH  DS    CL8                                                              
LOGACC   DS    CL12     5   46   12   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1      5   62    1   A    P    N         T         Y           
LOGHED1H DS    CL8                                                              
LOGHED1  DS    CL77     6    2   77   A    P    H         T         Y           
LOGHED2H DS    CL8                                                              
LOGHED2  DS    CL77     7    2   77   A    P    H         T         Y           
         DS    CL8                                                              
         DS    CL1      7   80    1   A    P    N         T         Y           
LOGSELH  DS    CL8                                                              
LOGSEL   DS    CL3      8    2    3   A    U    N         T         Y           
LOGDATAH DS    CL8                                                              
LOGDATA  DS    CL74     8    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3      9    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74     9    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     10    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    10    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     11    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    11    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     12    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    12    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     13    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    13    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     14    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    14    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     15    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    15    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     16    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    16    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     17    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    17    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     18    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    18    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     19    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    19    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     20    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    20    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     21    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    21    6   74   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     22    2    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    22    6   74   A    P    N         T         Y           
LOGLSTH  DS    CL8                                                              
LOGLST   DS    CL1     23    2    1   A    U    N         T         Y           
LOGLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
LOGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1678 BYTES                            
