*          DATA SET ACEXPCED   AT LEVEL 001 AS OF 01/04/85                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T615CED      DATE 01/04/85                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL30     6    2   30   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL30     6   34   30   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL30     7    2   30   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL30     8    2   30   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL40     8   34   40   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL40     9   34   40   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL40    10   34   40   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL40    11   34   40   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL40    12   34   40   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL40    13   34   40   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL40    14   34   40   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL40    15   34   40   A    P    N         T         Y           
HLPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
HLPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 539  BYTES                            
