*          DATA SET ACEXPFED   AT LEVEL 002 AS OF 02/07/85                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T615FED      DATE 02/07/85                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7   A    P    H         T         Y           
LOGUNITH DS    CL8                                                              
LOGUNIT  DS    CL1      6   21    1   A    U    N         T    I    Y           
LOGUNAMH DS    CL8                                                              
LOGUNAM  DS    CL36     6   36   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7      7    2    7   A    P    H         T         Y           
LOGLEDGH DS    CL8                                                              
LOGLEDG  DS    CL1      7   21    1   A    U    N         T         Y           
LOGLNAMH DS    CL8                                                              
LOGLNAM  DS    CL36     7   36   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7      8    2    7   A    P    H         T         Y           
LOGACCH  DS    CL8                                                              
LOGACC   DS    CL12     8   21   12   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1      8   34    1   A    P    N         T         Y           
LOGNMDSH DS    CL8                                                              
LOGNMDS  DS    CL12    10    2   12   A    P    H         T         Y           
LOGANAMH DS    CL8                                                              
LOGANAM  DS    CL36    10   21   36   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    11    2   17   A    P    N         T         Y           
LOGADD1H DS    CL8                                                              
LOGADD1  DS    CL26    11   21   26   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    12    2   17   A    P    N         T         Y           
LOGADD2H DS    CL8                                                              
LOGADD2  DS    CL26    12   21   26   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    13    2   17   A    P    N         T         Y           
LOGADD3H DS    CL8                                                              
LOGADD3  DS    CL26    13   21   26   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL17    14    2   17   A    P    N         T         Y           
LOGADD4H DS    CL8                                                              
LOGADD4  DS    CL26    14   21   26   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL16    15    2   16   A    P    N         T         Y           
LOGFILTH DS    CL8                                                              
LOGFILT  DS    CL1     15   21    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL16    16    2   16   A    P    N         T         Y           
LOGFLT2H DS    CL8                                                              
LOGFLT2  DS    CL1     16   21    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL15    17    2   15   A    P    N         T         Y           
LOGANALH DS    CL8                                                              
LOGANAL  DS    CL1     17   21    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    18    2   10   A    P    N         T         Y           
LOGSUBH  DS    CL8                                                              
LOGSUB   DS    CL1     18   21    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL14    19    2   14   A    P    N         T         Y           
LOGSECH  DS    CL8                                                              
LOGSEC   DS    CL3     19   21    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL15    20    2   15   A    P    N         T         Y           
LOGPROFH DS    CL8                                                              
LOGPROF  DS    CL54    20   21   54   A    U    N         T         Y           
LOGPRO2H DS    CL8                                                              
LOGPRO2  DS    CL54    21   21   54   A    U    N         T         Y           
LOGPRO3H DS    CL8                                                              
LOGPRO3  DS    CL54    22   21   54   A    U    N         T         Y           
LOGTABH  DS    CL8                                                              
LOGTAB   DS    CL1     23   21    1   A    U    N         T         Y           
LOGLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LOGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 859  BYTES                            
