*          DATA SET ACEXPFAD   AT LEVEL 026 AS OF 03/02/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T615FAD      DATE 03/02/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
LOGACNH  DS    CL8                                                              
LOGACN   DS    CL5      5   10    5  A  U N             T        Y              
LOGACNNH DS    CL8                                                              
LOGACNN  DS    CL36     5   17   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   56    6  A  P N             T        Y              
LOGOPTH  DS    CL8                                                              
LOGOPT   DS    CL14     5   64   14  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
LOGAGYH  DS    CL8                                                              
LOGAGY   DS    CL3      6   10    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      6   20    7  A  P H             T        Y              
LOGPRDH  DS    CL8                                                              
LOGPRD   DS    CL2      6   28    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      6   38    5  A  P N             T        Y              
LOGMEDH  DS    CL8                                                              
LOGMED   DS    CL2      6   46    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6   56    6  A  P N             T        Y              
LOGPERH  DS    CL8                                                              
LOGPER   DS    CL14     6   64   14  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   80    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16     8    2   16  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL24     8   34   24  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL19     8   61   19  A  P H             T        Y              
LOGDATAH DS    CL8                                                              
LOGDATA  DS    CL75     9    2   75  A  P N             T        Y              
LOGAPPH  DS    CL8                                                              
LOGAPP   DS    CL2      9   78    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    10    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     10   78    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    11    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   78    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    12    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   78    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    13    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   78    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    14    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   78    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    15    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   78    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    16    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   78    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    17    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   78    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    18    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   78    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    19    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   78    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    20    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   78    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    21    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   78    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    22    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   78    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    23    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     23   78    2  A  U N             T        Y              
LOGTABH  DS    CL8                                                              
LOGTAB   DS    CL1     24   78    1  A  U N             T        Y              
LOGLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LOGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1720 BYTES                            
