*          DATA SET ACFILSCRND AT LEVEL 012 AS OF 12/22/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T623A1D      DATE 20/02/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL18     4    2   18  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      4   21    8  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     4   40   18  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      4   59    8  A  U N             T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     5    2   18  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL5      5   21    5  A  U N             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     5   40   18  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      5   59    8  A  U N             T        Y  141         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     7    2   18  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL58     7   21   58  A  U N             T        Y   33         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     8    2   18  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL12     8   21   12  A  U N             T        Y   34         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL36     8   40   36  A  P N             T        Y   46         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     9    2   18  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL58     9   21   58  A  U N             T        Y   35         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    10    2   18  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL58    10   21   58  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    11    2   18  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL3     11   21    3  A  U N             T        Y   36         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    11   26   18  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   45    3  A  U N             T        Y   37         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    11   52   18  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   71    3  A  U N             T        Y   38         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL30    13    2   30  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL18    14    2   18  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL3     14   21    3  A  U N             T        Y   39         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    14   40   18  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL3     14   59    3  A  U N             T        Y   40         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    15    2   18  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   21    3  A  U N             T        Y   41         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    16    2   18  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL12    16   21   12  A  U N             T        Y   42         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL36    16   40   36  A  P N             T        Y   47         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    17    2   18  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL12    17   21   12  A  U N             T        Y   43         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL36    17   40   36  A  P N             T        Y   48         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    18    2   18  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    18   21   12  A  U N             T        Y   44         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL36    18   40   36  A  P N             T        Y   49         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    19    2   18  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    19   21   12  A  U N             T        Y   45         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL36    19   40   36  A  P N             T        Y   50         
         DS    CL8                                                              
PROPFKH  DS    CL8                                                              
PROPFK   DS    CL78    24    2   78  L  P H R B 4       T        Y  255         
PROPFKX  DS    CL8                                                              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1432 BYTES                            
