*          DATA SET ACGENWORK  AT LEVEL 209 AS OF 05/28/13                      
         PUSH  PRINT                                                            
***********************************************************************         
* GLOBAL EQUATES                                                      *         
***********************************************************************         
         SPACE 1                                                                
EOT      EQU   0                   END-OF-TABLE INDICATOR                       
         SPACE 1                                                                
***********************************************************************         
* I/O CONTROLLER FILE TABLE DSECT                                     *         
***********************************************************************         
         SPACE 1                                                                
FILTABD  DSECT                                                                  
FILNUM   DS    XL1                 FILE NUMBER (IOFILES EQUATE)                 
FILNAME  DS    CL7                 FILE NAME                                    
FILINDS  DS    XL1                 FILE INDICATORS - 1                          
FILIVL   EQU   X'80'               FILE RECORDS ARE VARIABLE LENGTH             
FILIDA   EQU   X'40'               FILE IS A DIRECT ACCESS FILE                 
FILIIS   EQU   X'20'               FILE IS AN INDEX SEQUENTIAL FILE             
FILINDS2 DS    XL1                 FILE INDICATORS - 2                          
FILIDI   EQU   X'80'               FILE IS D/A WITH I/S INDEX                   
FILIID   EQU   FILIDI              FILE IS I/S INDEX TO A D/A FILE              
FILNUM2  DS    XL1                 D/A OR I/S FILE NUMBER                       
FILKEYL  DS    XL1                 D/A OR I/S KEY LENGTH                        
FILCTLL  DS    XL1                 FIXED LENGTH I/S CONTROL LENGTH              
FILDISP  EQU   FILCTLL             DISPLACEMENT TO FIRST RECORD ELEMENT         
FILMAXL  DS    XL2                 MAXIMUM RECORD LENGTH                        
*                                  FOLLOWING FIELDS SET IF FILNAME=NULL         
FILSYSN  EQU   FILINDS             NATIVE SYSTEM NUMBER OF FILE                 
FILFILN  EQU   FILINDS2            NATIVE FILE NUMBER (WITHIN SYSTEM)           
         DS    XL5                 N/D                                          
FILTABL  EQU   *-FILTABD                                                        
         SPACE 1                                                                
***********************************************************************         
* I/O CONTROLLER COMMAND TABLE DSECT                                  *         
***********************************************************************         
         SPACE 1                                                                
CMDTABD  DSECT                                                                  
CMDNAME  DS    CL7                 COMMAND NAME                                 
CMDNUMB  DS    XL1                 COMMAND NUMBER (SEE IOCMNDS)                 
CMDINDS  DS    XL1                 COMMAND INDICATORS - 1                       
CMDIDARQ EQU   X'80'               DISK ADDRESS REQUIRED FOR I/O                
CMDIDAXC EQU   X'40'               CLEAR DISK ADDRESS BEFORE I/O                
CMDIDADD EQU   X'20'               DISK ADDRESS RETURNED FROM I/O               
CMDINDS2 DS    XL1                 COMMAND INDICATORS - 2                       
CMDTABL  EQU   *-CMDTABD                                                        
         EJECT                                                                  
***********************************************************************         
* RECORD TYPE TABLE DSECT                                             *         
***********************************************************************         
         SPACE 1                                                                
RECTABD  DSECT                                                                  
RECNUMB  DS    XL1                 RECORD TYPE NUMBER                           
RECNAMLQ EQU   8                   MAXIMUM LENGTH OF RECORD TYPE NAME           
RECNAMEU DS    AL2                 DISPLACEMENT TO RECORD TYPE NAME             
RECNAMEL DS    AL2                 DISPLACEMENT TO LOWER CASE NAME              
RECINDS1 DS    XL1                 RECORD TYPE INDICATORS - 1                   
RECIDDS  EQU   X'80'               DDS ONLY RECORD TYPE                         
RECISEL  EQU   X'40'               SELECT RECORD TYPE ONLY                      
RECINOH  EQU   X'20'               DON'T DISPLAY ON HELP SCREEN                 
RECUPDT  EQU   X'10'               RECORD IS UPDATED ON PFKEY PRESS             
RECIHEIR EQU   X'08'               RECORD CAN BE INIT BY ANOTHER (ADD)          
RECIGEN  EQU   X'04'               RECORD ON GEN SYSTEM                         
RECIGLOB EQU   X'02'               RECORD IS GLOBAL RECORD (NEW FILE)           
RECINDS2 DS    XL1                 RECORD TYPE INDICATORS - 2                   
RECAUTH1 DS    XL1                 AUTHORISATION INDICATORS - 1                 
RECAUTH2 DS    XL1                 AUTHORISATION INDICATORS - 2                 
RECHELP  DS    AL2                 RECORD HELP DICTIONARY NUMBER                
RECHELPL EQU   60                  LENGTH OF RECORD HELP TEXT                   
RECCTRY  DS    XL1                 RECORD VALID FOR THIS COUNTRY                
         DS    XL7                 N/D                                          
RECTABL  EQU   *-RECTABD                                                        
         SPACE 1                                                                
***********************************************************************         
* ACTION TABLE DSECT                                                  *         
***********************************************************************         
         SPACE 1                                                                
ACTTABD  DSECT                                                                  
ACTNUMB  DS    XL1                 ACTION NUMBER                                
ACTNAMLQ EQU   8                   MAXIMUM LENGTH OF ACTION NAME                
ACTNAMEU DS    AL2                 DISPLACEMENT TO ACTION NAME                  
ACTNAMEL DS    AL2                 DISPLACEMENT TO LOWER CASE NAME              
ACTINDS1 DS    XL1                 ACTION INDICATORS - 1                        
ACTIDDS  EQU   X'80'               DDS ONLY ACTION                              
ACTIMNT  EQU   X'40'               MAINTENANCE TYPE ACTION                      
ACTILIST EQU   X'20'               LIST TYPE ACTION                             
ACTINOH  EQU   X'10'               DON'T DISPLAY ON HELP SCREEN                 
ACTIUPD  EQU   X'08'               ACTION IS UPDATIVE                           
ACTINDS2 DS    XL1                 ACTION INDICATORS - 2                        
ACTAUTH1 DS    XL1                 AUTHORISATION INDICATORS - 1                 
ACTAUTH2 DS    XL1                 AUTHORISATION INDICATORS - 2                 
ACTRECB  DS    XL1                 RECORD NUMBER (IF NO RECORD FIELD)           
ACTVERB  DS    0XL1                ACTION VERB (NFILE)                          
ACTSUBH# DS    XL1                 SUB-ACTION FIELD HELP # (CBILL)              
ACTOPTF  DS    XL2                 FILTER FOR VALID OPTIONS (CBILL)             
         DS    XL4                 N/D                                          
ACTTABL  EQU   *-ACTTABD                                                        
         EJECT                                                                  
***********************************************************************         
* RECORD/ACTION COMBO TABLE DSECT                                     *         
***********************************************************************         
         SPACE 1                                                                
MIXTABD  DSECT                                                                  
MIXKEY   DS    0XL2                TABLE KEY                                    
MIXRECB  DS    XL1                 RECORD NUMBER                                
MIXACTB  DS    XL1                 ACTION NUMBER                                
MIXINDS1 DS    XL1                 RECORD TYPE/ACTION INDICATORS - 1            
MIXIDDS  EQU   X'80'               DDS ONLY RECORD/ACTION                       
MIXISEL  EQU   X'40'               SELECT ACTION ONLY                           
MIXINOH  EQU   X'20'               NO HELP FOR THIS COMBO                       
MIXIDET  EQU   X'10'               DETAIL SCREEN REQUIRED                       
MIXILST  EQU   X'08'               LIST TYPE ACTION                             
MIXIBALL EQU   X'04'               BUILD ALL LIST IN ONE GO                     
MIXIEXIT EQU   X'02'               DON'T CLEAR OSVALS2 ON EXIT                  
MIXINTRY EQU   X'01'               DON'T CLEAR OSVALS2 ON ENTRY                 
MIXINDS2 DS    XL1                 RECORD TYPE/ACTION INDICATORS - 2            
MIXIMARK EQU   X'80'               MARKING RECORD TYPE/ACTION                   
MIXIUNDO EQU   X'40'               UNDOING RECORD TYPE/ACTION                   
MIXIRSET EQU   X'20'               RESET NTRSES LEVEL IF INPUT                  
MIXINOIN EQU   X'10'               NO MANUAL INPUT OF ACTION ALLOWED            
MIXIAPL1 EQU   X'08'               APPLICATION DEFINED                          
MIXIAPL2 EQU   X'04'               APPLICATION DEFINED                          
MIXIAPL3 EQU   X'02'               APPLICATION DEFINED                          
MIXIAPL4 EQU   X'01'               APPLICATION DEFINED                          
MIXAUTH1 DS    XL1                 AUTHORISATION INDICATORS - 1                 
MIXAUTH2 DS    XL1                 AUTHORISATION INDICATORS - 2                 
MIXSCRN  DS    XL1                 SCREEN NUMBER                                
MIXOVER  DS    XL1                 PHASE NUMBER                                 
MIXHELP  DS    AL2                 HELP FOR COMBO                               
MIXHELPL EQU   60                  LENGTH OF COMBO HELP TEXT                    
MIXDETL1 DS    XL2                 DETAIL LINE 1 TEXT NUMBER                    
MIXDETL2 DS    XL2                 DETAIL LINE 2 TEXT NUMBER                    
         ORG   MIXDETL1                                                         
MIXCLM#  DS    XL1       =BILL     COLUMN TABLE HEADER NUMBER                   
MIXSEL#  DS    XL1       =BILL     SELECT TABLE HEADER NUMBER                   
MIXNFTL  DS    XL1       =BILL     NUMBER OF FOOTLINES ON LIST SCREEN           
MIXRCTRY DS    XL1       =NF       RECORD/ACTION BY COUNTRY                     
         ORG   MIXDETL2+L'MIXDETL2                                              
MIXROUT  DS    XL1                 SUB-CONTROLLER ROUTINE NUMBER                
MIXNTREC DS    XL1                 CSLSTCUR RECORD TO PASS IN NTRSES            
MIXOHELP DS    XL1                 FRAME NUMBER FOR OPTION HELP OR ZERO         
MIXQRTN  DS    XL1                 RETURN ROUTINE NUMBER FOR QUIT               
MIXTABL  EQU   *-MIXTABD                                                        
*                        =BILL                                                  
MIXOPTH# DS    XL1                 OPTION FIELD HELP FIELD NUMBER               
         DS    XL5                 N/D                                          
MIXLST   DS    0XL24               LIST ACTION VALUES                           
MIXLIND1 DS    XL1                 INDICATOR BYTE 1                             
MIXLITRN EQU   X'80'               GENERAL TRANSACTION LIST                     
MIXLICUR EQU   X'40'               TRANSACTIONS TO MATCH BILLING CURR.          
MIXLISCT EQU   X'20'               SCREEN TOTAL TSAR RECORDS REQUIRED           
MIXLIJOB EQU   X'10'               UPDATE JOB IF TRANSACTION PROCESSED          
MIXLIDRA EQU   X'08'               INCLUDE DRAFT ITEMS IN LIST                  
MIXLINSA EQU   X'04'               LIST HAS NO-SUB-ACTION                       
MIXLINDA EQU   X'02'               NO DISK ADDRESS ON TSAR RECORDS              
MIXLIVPG EQU   X'01'               VALIDATE PAGE BEFORE RE-DISPLAYING           
MIXLIND2 DS    XL1                 INDICATOR BYTE 2                             
MIXLISUB EQU   X'80'               LIST INCLUDES SUB-TOTAL LINES                
MIXLIBPG EQU   X'40'               BUILD LIST PAGE BY PAGE, NOT IN 1 GO         
MIXLSUB# DS    XL1                 SUB-ACTION HELP FIELD NUMBER                 
MIXLCLM# DS    XL1                 COLUMN TABLE HEADER NUMBER                   
MIXLSEL# DS    XL1                 SELECT TABLE HEADER NUMBER                   
MIXLNFTL DS    XL1                 NUMBER OF FOOTLINES ON LIST SCREEN           
MIXLRECL DS    XL2                 DEFAULT TSAR RECORD LENGTH                   
MIXLOPTF DS    XL2                 FILTER FOR VALID OPTIONS                     
MIXLGENM DS    XL2                 GENERAL COLUMN MASKS FILTER                  
         DS    XL12                N/D                                          
         ORG   MIXLST+L'MIXLST                                                  
MIXTABL2 EQU   *-MIXTABD                                                        
         EJECT                                                                  
***********************************************************************         
* PROGRAM FUNCTION KEY TABLE                                          *         
***********************************************************************         
         SPACE 1                                                                
PFKTABD  DSECT                                                                  
PFKHEAD  DS    0X                  ** TABLE HEADER **                           
PFKKEY   DS    0XL2                TABLE KEY                                    
PFKRECB  DS    XL1                 CURRENT RECORD NUMBER                        
PFKACTB  DS    XL1                 CURRENT ACTION NUMBER                        
PFKLEN   DS    AL2                 LENGTH OF SUB-TABLE                          
         DS    XL4                 N/D                                          
PFKHEADL EQU   *-PFKHEAD                                                        
         ORG   PFKHEAD                                                          
*                                                                               
PFKDATA  DS    0X                  ** DATA ENTRY **                             
PFKNUMB  DS    XL1                 PFKEY NUMBER                                 
PFKINDS1 DS    XL1                 INDICATOR BYTE - 1                           
PFKIACTN EQU   X'80'               PFKEY FOR RECORD/ACTION COMBINATION          
PFKISCRL EQU   X'40'               PFKEY FOR SCROLLING                          
PFKIALTP EQU   X'20'               PFKEY FOR ALTERNATE PFKEY DISPLAY            
PFKIQUIT EQU   X'10'               PFKEY FOR QUIT TO PREVIOUS LEVEL             
PFKINEXT EQU   X'08'               PFKEY FOR QUIT & PROCESS NEXT                
PFKIAPPL EQU   X'04'               PFKEY FOR APPLICATION USE                    
PFKIKAPA EQU   X'02'               PFKEY FOR KNOWN APPLICATION ACTION           
PFKITSEC EQU   X'01'               TEST BATCH TYPE SECURITY                     
PFKIDUMY EQU   0                   DUMMY ENTRY FOR SUPPRESSING PF KEY           
PFKCTRY  DS    0X                  COUNTRY CODE, 'NOT' COUNTRY CODE OR          
*                                  ZERO IF PFKINDS1=PFKIAPPL                    
PFKINDS2 DS    XL1                 INDICATOR BYTE - 2                           
PFKIUPDN EQU   X'80'               OFF=SCROLL DOWN, ON=SCROLL UP                
PFKIMAXN EQU   X'40'               MAXIMUM                                      
PFKIPAGE EQU   X'20'               PAGE                                         
PFKIHALF EQU   X'10'               HALF PAGE                                    
PFKIHORZ EQU   X'08'               HORIZONTAL (NOT VERTICAL) SCROLL             
PFKINPFX EQU   X'04'               DON'T PREFIX SCROLL ACTION WITH +/-          
PFKILONG EQU   X'02'               LONG (16 BYTE) PFKEY DESCRIPTION             
PFKISAVS EQU   X'01'               FOR PFKIACTN ISSUE NTRSES                    
PFKSCRLQ EQU   8                   MAXIMUM LENGTH OF SCROLL WORD                
PFKSCRLL DS    0AL2                DISPLACEMENT TO SCROLL NAME                  
PFKRECA  DS    0XL2                RECORD/ACTION COMBO                          
PFKRECN  DS    XL1                 RECORD NUMBER IF PFKIACTN ON                 
PFKACTN  DS    XL1                 ACTION NUMBER IF PFKIACTN ON                 
PFKSUBA  DS    0XL1                SUB-ACTION OR 0 (IF PFKIKAPA ON)             
PFKBTYP  DS    0XL1                BATCH TYPE (IF PFKIAPPL/PFKIDUMY ON)         
PFKNEXT  DS    XL1                 NEXT TIME AUTO PFKEY VALUE                   
PFKCSIL  DS    0XL3                NEW SESSION LOCAL INDICATORS 1-3             
PFKCSIL1 DS    XL1                                                              
PFKCSIL2 DS    XL1                                                              
PFKCSIL3 DS    XL1                                                              
PFKSPROG DS    XL1                 OVERLAY SUB-PROGRAM (WITH PFKBTYP)           
PFKRTYPE DS    XL1                 RECORD TYPE                                  
PFKRMASK DS    XL2                 RECORD MASK                                  
         ORG   PFKRMASK                                                         
PFKOMASK DS    XL2                 OVERLAY MASK                                 
PFKDATAL EQU   *-PFKDATA                                                        
*                                  =BILL ONLY                                   
PFKINDS3 DS    XL1                 INDICATOR BYTE - 3                           
PFKIPOS  EQU   X'80'               POSITIONAL PFKEY ON LIST SCREEN              
PFKIRFSH EQU   X'40'               REFRESH PFKEY                                
PFKIRTN  EQU   X'20'               CALL APPLICATION ROUTINE                     
PFKISCH  EQU   X'10'               RETURN FROM SELECT WITH I/P SET              
PFKIUPD  EQU   X'08'               WRITE UPDATEABLE RECORD TO FILE              
PFKIBACK EQU   X'04'               MAINTENACE BACKWARDS SCROLL                  
PFKIFRWD EQU   X'02'               MAINTENACE FORWARDS SCROLL                   
PFKXRTN  DS    XL1                 XITSES RETURN ROUTINE NUMBER                 
         DS    XL2                 N/D                                          
PFKNAMEU DS    XL2                 DISPLACEMENT TO NAME (UPPER CASE)            
PFKNAMEL DS    XL2                 DISPLACEMENT TO NAME (MIXED CASE)            
PFKNAMLQ EQU   8                   LENGTH OF NAME                               
PFKDATBL EQU   *-PFKDATA                                                        
         EJECT                                                                  
***********************************************************************         
* PROGRAM FUNCTION KEY EQUATES                                        *         
***********************************************************************         
         SPACE 1                                                                
PFK01    EQU   01                                                               
PFK02    EQU   02                                                               
PFK03    EQU   03                                                               
PFK04    EQU   04                                                               
PFK05    EQU   05                                                               
PFK06    EQU   06                                                               
PFK07    EQU   07                                                               
PFK08    EQU   08                                                               
PFK09    EQU   09                                                               
PFK10    EQU   10                                                               
PFK11    EQU   11                                                               
PFK12    EQU   12                                                               
PFK13    EQU   13                                                               
PFK14    EQU   14                                                               
PFK15    EQU   15                                                               
PFK16    EQU   16                                                               
PFK17    EQU   17                                                               
PFK18    EQU   18                                                               
PFK19    EQU   19                                                               
PFK20    EQU   20                                                               
PFK21    EQU   21                                                               
PFK22    EQU   22                                                               
PFK23    EQU   23                                                               
PFK24    EQU   24                                                               
         EJECT                                                                  
***********************************************************************         
* SELECT ACTION MENU                                                  *         
***********************************************************************         
         SPACE 1                                                                
SELTABD  DSECT                                                                  
SELHEAD  DS    0X                  ** TABLE HEADER **                           
SELKEY   DS    0XL2                TABLE KEY                                    
SELRECB  DS    XL1                 CURRENT RECORD NUMBER                        
SELACTB  DS    XL1                 CURRENT ACTION NUMBER                        
SELLEN   DS    AL2                 LENGTH OF SUB-TABLE                          
SELHEADL EQU   *-SELHEAD           LENGTH OF TABLE HEADER                       
         ORG   SELTABD                                                          
*                                                                               
SELTDSPN DS    AL2                 DISPLACEMENT TO ACTION WORD                  
SELTDSPM DS    AL2                 DISPLACEMENT TO MIXED CASE ACTION            
SELTIND1 DS    XL1                 INDICATORS - 1                               
SELTIEOL EQU   X'80'               SELECT TO END OF LIST IS VALID               
SELTIEOP EQU   X'40'               SELECT TO END OF PAGE IS VALID               
SELTINTR EQU   X'20'               CREATE NEW SESSION VIA NTRSES                
SELTIYES EQU   X'10'               INCLUDE RECORD FOR ACTION SELECT             
SELTINO  EQU   X'08'               EXCLUDE RECORD FOR ACTION SELECT             
SELTIRED EQU   X'04'               RE-DISPLAY LINE AFTER ACTION ROUTINE         
SELTIPSI EQU   X'02'               PROTECT SUB-ACTION IF LINE INVALID           
SELTIEXC EQU   X'01'               EXCLUDE - REMOVE LINE FROM LIST              
SELTIND2 DS    XL1                 INDICATORS - 2                               
SELTISTP EQU   X'80'               STOP PROCESSING AFTER THIS LINE              
SELTIGET EQU   X'40'               GET LIST RECORD FOR SELTVRTN                 
SELTIUPD EQU   X'20'               SELTVRTN MAY UPDATE RECORD                   
SELTINUM EQU   X'10'               VALID TO INPUT NUMBER AFTER SUB-ACT          
SELTISEL EQU   X'08'               SELECT ITEM FROM LIST                        
SELTMASK DS    XL2                 RECORD/ACTION MASK                           
SELTHELP DS    0XL2      =FILE     HELP MESSAGE#                                
SELTVRTN DS    0XL1      =BILL     VALIDATION ROUTINE NUMBER                    
SELTRCI1 DS    XL1                 RECORD INDICATOR FILTER MASK - 1             
SELTRCI2 DS    XL1                 RECORD INDICATOR FILTER MASK - 2             
SELTPARM DS    0XL6                ** NTRSES PARAMETERS **                      
SELTRECA DS    0XL2                RECORD/ACTION COMBO                          
SELTREC  DS    XL1                 RECORD NUMBER (OR ZERO)                      
SELTACT  DS    XL1                 ACTION NUMBER (OR ZERO)                      
SELTRTN  DS    XL1                 RETURN ROUTINE NUMBER                        
SELTNXPF DS    XL1                 NEXT TIME AUTO PFKEY VALUE                   
SELTNSI1 DS    XL1                 NEXT SESSION INDICATORS - 1                  
SELTNSI2 DS    XL1                 NEXT SESSION INDICATORS - 2                  
SELTABL  EQU   *-SELTABD                                                        
         SPACE 2                                                                
***********************************************************************         
* SYSTEM SWITCH TABLE (LOCATED AT ASSWTAB)                            *         
***********************************************************************         
         SPACE 1                                                                
SYSSWTAB DSECT                     ** SYSTEM SWITCH TABLE **                    
SYSSWSYS DS    XL1                 SE NUMBER                                    
SYSSWSOV DS    XL1                 SYSTEM CALLOV NUMBER                         
SYSSWAGB DS    XL1                 AGENCY BINARY VALUE                          
SYSSWACS DS    XL4                 LIMIT ACCESS VALUE 1                         
SYSSWAC2 DS    XL4                 LIMIT ACCESS VALUE 2                         
         DS    XL1                 N/D                                          
SYSSWLEN EQU   *-SYSSWTAB                                                       
SYSSWMAX EQU   8                   MAXIMUM NUMBER OF ENTRIES IN TABLE           
         EJECT                                                                  
***********************************************************************         
* OPTION TABLE                                                        *         
***********************************************************************         
         SPACE 1                                                                
OPTTABD  DSECT                                                                  
OPTNAMLQ EQU   8                   MAXIMUM LENGTH OF OPTION NAME                
OPTSHTLQ EQU   3                   MAXIMUM LENGTH OF OPTION SHORT NAME          
OPTNAME  DS    AL2                 DISPLACEMENT TO OPTION NAME (LONG)           
OPTSHRT  DS    AL2                 DISPLACEMENT TO OPTION NAME (SHORT)          
OPTINDS  DS    XL1                 OPTION INDICATORS - 1                        
OPTIDDS  EQU   X'80'               DDS ONLY OPTION                              
OPTNRTN  EQU   X'40'               OPTIADDR=NUMBER OF ROUTINE                   
OPTATAB  EQU   X'20'               OPTIADDR=DISPLACEMENT TO TABLE               
OPTARTN  EQU   X'10'               OPTIADDR=DISPLACEMENT TO ROUTINE             
OPTBOOL  EQU   X'08'               OUTPUT IS A BIT VALUE (OC NOT MVC)           
OPTDFLTI EQU   X'04'               OPTION HAS A DEFAULT INPUT VALUE             
OPTDFLTO EQU   X'02'               OPTION HAS A DEFAULT OUTPUT VALUE            
OPTREQD  EQU   X'01'               OPTION IS REQUIRED (MUST BE INPUT)           
OPTINDS2 DS    XL1                 OPTION INDICATORS - 2                        
OPTGEQ   EQU   X'80'               GREATER THAN CHARACTER                       
OPTLEQ   EQU   X'40'               LESS THAN CHARACTER                          
OPTNEQ   EQU   X'20'               NOT EQUALS CHARACTER                         
OPTPLQ   EQU   X'10'               PLUS CHARACTER                               
OPTMIQ   EQU   X'08'               MINUS CHARACTER                              
OPTRALQ  EQU   X'04'               RECORD/ACT/LEDGER COMPATABILITY NTRY         
OPTFILT  DS    0XL2                OPTION FILTER MASK (CBILL)                   
OPTAUTH  DS    XL1                 AUTHORISATION INDICATORS - 1                 
OPTAUTH2 DS    XL1                 AUTHORISATION INDICATORS - 2                 
OPTRECB  DS    XL1                 RECORD NUMBER (OR ZERO)                      
OPTACTB  DS    XL1                 ACTION NUMBER (OR ZERO)                      
OPTMINKL DS    XL1                 MINIMUM L'OPTNAME ALLOWED                    
OPTMINDL DS    XL1                 MINIMUM L'DATA ALLOWED                       
OPTMAXDL DS    XL1                 MAXIMUM L'DATA ALLOWED                       
OPTOUTDL DS    XL1                 L'OUTPUT OPTION DATA VALUE                   
OPTOPTN  DS    XL1                 OPTION NUMBER (1-32)                         
OPTIADDR DS    AL2                 DISPL TO TABLE/RTN OR NUMBER RTN             
OPTOADDR DS    AL2                 DISPLACEMENT TO OPTION/FILTER                
OPTDVAL  DS    XL4                 DEFAULT OPTION VALUE (IF NOT INPUT)          
OPTHELP1 DS    XL2                 OPTION HELP 1                                
OPTHELP2 DS    XL2                 OPTION HELP 2                                
OPTSECN  DS    AL1                 OPTION SECURITY NUMBER (ZERO=NONE)           
OPTCTRY  DS    XL1                 OPTIONAL COUNTRY FILTER (0=ALL)              
         DS    XL2                 N/D                                          
OPTTABL  EQU   *-OPTTABD                                                        
         EJECT                                                                  
***********************************************************************         
* RECORD/ACTION/LEDGER OPTION  COMPATABILITY TABLE (FOR =CRED)        *         
***********************************************************************         
         SPACE 1                                                                
RALTABD  DSECT                                                                  
RALLEN   DS    XL1                 LENGTH OF ENTRY                              
RALHLNQ  EQU   *-RALTABD           LENGTH OF HEADER                             
RALNTRY  DS    0X                                                               
*                                                                               
RALREC   DS    X                   VALID RECORD NUMBER                          
RALACT   DS    X                   VALID ACTION NUMBER                          
RALSTAT1 DS    X                   STATUS                                       
RALLDALL EQU   X'80'               ALL LEDGERS (SHORT SUB ENTRY)                
RALS1LNQ EQU   *-RALNTRY           LENGTH OF SUB ENTRY                          
RALLDG   DS    25AL2               LIST OF VALID LEDGERS                        
RALLDGMX EQU   25                  MAX NUM OF LEDGERS                           
RALS2LNQ EQU   *-RALNTRY           LENGTH OF SUB ENTRY                          
         EJECT                                                                  
***********************************************************************         
* LIST/SELECT TABLE                                                   *         
***********************************************************************         
         SPACE 1                                                                
LSTTABD  DSECT                                                                  
LSTTEOTQ EQU   255                 END OF TABLE INDICATOR                       
LSTTRECN DS    XL2                 ABSOLUTE RECORD NUMBER                       
LSTTKEY  DS    XL88                LOGICAL RECORD KEY (NOT PHYSICAL)            
LSTTRTYP DS    XL1                 RECORD TYPE (SEE RECNUMB)                    
LSTTSTAT DS    XL1                 RECORD STATUS                                
LSTTDA   DS    XL4                 RECORD DISK ADDRESS                          
LSTTMASK DS    XL2                 SELECT RECORD/ACTION MASK                    
LSTTDATL EQU   *-LSTTKEY           RECORD DATA LENGTH                           
         DS    XL2                 N/D                                          
LSTTABL  EQU   *-LSTTABD           LENGTH OF TABLE ENTRY                        
         EJECT                                                                  
WORKD    DSECT                     ** GLOBAL WORKING STORAGE **                 
***********************************************************************         
* OVERLAY PROGRAM WORK AREA                                           *         
***********************************************************************         
         SPACE 1                                                                
BOWS     DS    0X                                                               
BODUB1   DS    D                                                                
BODUB2   DS    D                                                                
BODUB3   DS    D                                                                
BODUB4   DS    D                                                                
BOPARM   DS    6F                                                               
BODMCB   DS    6F                                                               
BOFULL1  DS    F                                                                
BOFULL2  DS    F                                                                
BOHALF1  DS    H                                                                
BOHALF2  DS    H                                                                
BOBYTE1  DS    XL1                                                              
BOBYTE2  DS    XL1                                                              
BOFLAG1  DS    XL1                                                              
BOFLAG2  DS    XL1                                                              
BOWORK1  DS    XL80                                                             
BOWORK2  DS    XL80                                                             
BOELEM   DS    XL256                                                            
BONTRYA  DS    A                   APPLICATION ENTRY POINT                      
BOALOCAL DS    A                   A(APPLICATION LOCAL W/S) APLOCAL             
BOWORKA  DS    A                   APPLICATION RD VALUE                         
BORELO   DS    A                   APPLICATION RELOCATION                       
BOBASE1  DS    A                   APPLICATION BASE REG1                        
BOBASE2  DS    A                   APPLICATION BASE REG2                        
BOBASE3  DS    A                   APPLICATION BASE REG3                        
BOCURSOR DS    A                   A(OUTPUT FIELD TO CONTAIN CURSOR)            
BOADDR1  DS    A                   ADDRESS FOR OVERLAY USE - 1                  
BOADDR2  DS    A                   ADDRESS FOR OVERLAY USE - 2                  
BOSVALS2 DS    A                   A(OSVALS2 IN TWA)                            
BORELOF  DS    A                   RELO FACTOR FOR FACILITIES USE               
BOACTN   DS    XL1                 ACTION NUMBER                                
BOMODE   DS    XL1                 APPLICATION MODE                             
BOINDS1  DS    XL1                 ** APPLICATION INDICATORS BYTE 1 **          
BOIREDIS EQU   X'80'               RE-DISPLAY FIELD AFTER VALIDATED             
BOIINFLD EQU   X'40'               FIELD IS INPUT FIELD                         
BOIUPSEL EQU   X'20'               SELECTED RECORDS TO BE UPDATED               
BOINAMCH EQU   X'10'               NAME FIELD HAS CHANGED                       
BOISUBNO EQU   X'08'               SUB-ACTION MEANING 'NO' INPUT                
BOIMSGOK EQU   X'04'               MESSAGE SET BY APPLICATION                   
BOINDS2  DS    XL1                 ** APPLICATION INDICATORS BYTE 2 **          
*                                  MISCELLANEOUS PACKED FIELDS                  
BOPL61   DS    PL6                                                              
BOPL62   DS    PL6                                                              
BOPL81   DS    PL8                                                              
BOPL82   DS    PL8                                                              
BOWSX    DS    0X                                                               
         EJECT                                                                  
***********************************************************************         
* APPLICATION SYSTEM VARIABLES                                        *         
***********************************************************************         
         SPACE 1                                                                
ASWS     DS    0F                                                               
ASONOFF  DS    XL1                 SYSTEM MODE                                  
ASON     EQU   0                   APPLICATION RUNNING ONLINE                   
ASOFF    EQU   1                   APPLICATION RUNNING OFFLINE                  
ASSYSN   DS    XL1                 DATAMGR SYSTEM NUMBER                        
ASSYSO   DS    XL1                 NATIVE SYSTEM NUMBER FOR CALLOV              
ASEDAT   DS    CL8                 SYSTEM DATE (MM/DD/YY OR DD/MM/YY)           
ASBDAT   DS    XL3                 SYSTEM DATE (BINARY YMD)                     
ASPDAT   DS    PL3                 SYSTEM DATE (PWOS YMD)                       
ASCDAT   DS    XL2                 SYSTEM DATE (COMPRESSED)                     
ASBMOS   DS    CL2                 BATCH MONTH OF SERVICE                       
ASTIME   DS    XL4                 SYSTEM TIME (STANDARD FORMAT)                
ASSIN    DS    XL4                 SYSTEM INPUT NUMBER                          
ASIOASTR DS    AL4                 A(START OF SYSTEM EXTRA AREA)                
ASIOALEN DS    XL4                 LENGTH OF SYSTEM EXTRA AREA                  
         DS    XL16                N/D                                          
ASWSX    DS    0X                                                               
         SPACE 2                                                                
***********************************************************************         
* CONNECTED USER VARIABLES                                            *         
***********************************************************************         
         SPACE 1                                                                
CUWS     DS    0X                                                               
CUABIN   DS    XL1                 AGENCY BINARY VALUE                          
CUAALF   DS    CL2                 AGENCY ALPHA VALUE                           
CUTSYM   DS    CL8                 TERMINAL SYMBOLIC ID                         
CUUSER   DS    XL2                 USER-ID NUMBER                               
CUAUTH   DS    XL2                 AUTHORISATION VALUE                          
CUACCS   DS    CL4                 LIMIT ACCESS VALUE                           
CUSTAT   DS    XL1                 TERMINAL STATUS INDICATORS                   
CUSDDS   EQU   X'80'               USER CONNECTED WITH A DDS TERMINAL           
CUSTRM   EQU   X'40'               CUPASS IS TERMINAL PASSWORD                  
CUSPER   EQU   X'20'               CUPASS IS PERSONAL PASSWORD NUMBER           
CUPASS   DS    XL2                 TERMINAL OR PERSONAL PASSWORD NUMBER         
CUCTRY   DS    XL1                 COUNTRY CODE                                 
CULANG   DS    XL1                 LANGUAGE CODE                                
CUTERM   DS    XL2                 TERMINAL NUMBER                              
CUASEC   DS    CL2                 AGENCY ALPHA VALUE FOR SECURITY              
CUCTRY2  DS    XL1                 COUNTRY CODE (UNCORRUPTED)                   
         DS    XL6                 N/D                                          
CUWSX    DS    0X                                                               
                                                                                
FACFLAG  DS    XL1                 CONNECT INFO FLAG                            
FACUPD   DS    CL4                 UPDATIVE FACPAK ID                           
         EJECT                                                                  
***********************************************************************         
* FIELD VALIDATION & ERROR HANDLING VARIABLES                         *         
***********************************************************************         
         SPACE 1                                                                
FVWS     DS    0F                                                               
FVADDR   DS    A                   A(INPUT FIELD HEADER) SET BY FVAL            
FVSAVE   DS    AL2                 DISP TO SAVED INPUT FOR HELP                 
FVFIELD  DS    XL1                 TYPE OF FIELD BEING VALIDATED                
FVFREC   EQU   1                   RECORD FIELD HELP                            
FVFACT   EQU   2                   ACTION FIELD HELP                            
FVFOPT   EQU   3                   OPTION FIELD HELP                            
FVFSEL   EQU   4                   SELECT FIELD HELP                            
FVINDS   DS    XL1                 FIELD INDICATORS                             
FVIHELP  EQU   X'80'               HELP REQUESTED FOR FIELD                     
FVFLAG   DS    XL1                 FLAG BYTE USED BY FVAL ROUTINE               
FVMINL   DS    XL1                 MINIMUM INPUT LENGTH (ZERO=OPTIONAL)         
FVMAXL   DS    XL1                 MAXIMUM INPUT LENGTH (ZERO=MAXIMUM)          
FVOSYS   DS    XL1                 OVERRIDE SYSTEM FOR GETTXT CALLS             
FVOMTYP  DS    XL1                 OVERRIDE MESSAGE TYPE FOR GETTXT             
FVMSGNO  DS    XL2                 MESSAGE NUMBER                               
FVINDX   DS    XL1                 MULTIPLE FIELD INDEX NUMBER                  
FVSUBX   DS    XL1                 MULTIPLE FIELD SUB-INDEX NUMBER              
FVCURS   DS    XL1                 DISPLACEMENT TO CURSOR WITHIN FIELD          
FVERRIND DS    XL1                 ERROR INDICATOR                              
FVEUNWND EQU   X'80'               UNWIND THE TRANSACTION WITH $ABEND           
FVXTRA   DS    CL16                TACKED ON TO ERROR MESSAGE IF ROOM           
FVPARMS  DS    XL32                MESSAGE SUBSTITUTION PARAMETERS              
FVERRNDX DS    XL1                 ERROR INDEX VALUE                            
FVCURIND DS    XL1                 CURSOR INDICATOR                             
FVCKEEP  EQU   X'80'               KEEP CURSOR WHERE IT WAS BEFORE              
         DS    XL7                 N/D                                          
FVIXHDR  DS    0XL8                ** EXTENDED FIELD HEADER **                  
FVIXNU   DS    XL1                 REFERENCE NUMBER                             
FVIXHE   DS    XL2                 DYNAMIC HELP INFO                            
         DS    XL1                                                              
FVIXSC   DS    XL1                 SCREEN NUMBER                                
FVIXXA   DS    XL1                 EXTENDED ATTRIBUTE                           
FVIXUS   DS    XL2                 APPLICATION DEFINED                          
FVIHDR   DS    0XL8                ** EXTRACTED INPUT FIELD HEADER **           
FVTLEN   DS    XL1                 L'FIELD HEADER+L'FIELD                       
FVATRB   DS    XL1                 FIELD ATTRIBUTE                              
FVADDTB  EQU   X'80'               DON'T DELETE TRAILING BLANKS                 
FVAPROT  EQU   X'20'               PROTECTED FIELD                              
FVAHIGH  EQU   X'08'               HIGH INTENSITY                               
FVAZERO  EQU   X'0C'               ZERO INTENSITY                               
FVAXTND  EQU   X'02'               EXTENDED HEADER                              
FVAMODF  EQU   X'01'               MODIFIED INPUT FIELD                         
FVABSA   DS    XL2                 SCREEN ABSOLUTE ADDRESS                      
FVIIND   DS    XL1                 INPUT VALIDATION INDICATORS                  
FVITHIS  EQU   X'80'               FIELD INPUT THIS TIME                        
FVILAST  EQU   X'40'               FIELD HAS BEEN INPUT PREVIOUSLY              
FVIVAL   EQU   X'20'               FIELD HAS BEEN VALIDATED PREVIOUSLY          
FVIINV   EQU   X'10'               FIELD IS INVALID                             
FVINUM   EQU   X'08'               FIELD IS VALID NUMERIC                       
FVIALF   EQU   X'04'               FIELD IS VALID ALPHA                         
FVIHEX   EQU   X'02'               FIELD IS VALID HEXADECIMAL                   
FVILEN   DS    XL1                 ACTUAL INPUT DATA LENGTH                     
FVOIND   DS    XL1                 OUTPUT INDICATORS                            
FVOXMT   EQU   X'80'               TRANSMIT FIELD                               
FVOCUR   EQU   X'40'               INSERT CURSOR TO FIELD                       
FVXLEN   DS    XL1                 ACTUAL INPUT DATA LENGTH-1                   
FVIFLD   DS    CL80                EXTRACTED & SPACE FILLED INPUT FIELD         
FVWSX    DS    0X                                                               
         EJECT                                                                  
***********************************************************************         
* STANDARD ERROR EQUATES  - X'FF00' IDENTIFIES CONTROLLER MSG         *         
***********************************************************************         
         SPACE 1                                                                
FVFIOER  EQU   0                   I/O ERROR HAS OCCURED                        
FVFNONE  EQU   200+X'FF00'         NO DATA INPUT                                
FVFSHRT  EQU   201+X'FF00'         NOT ENOUGH DATA INPUT                        
FVFLONG  EQU   202+X'FF00'         TOO MUCH DATA INPUT                          
FVFNOTV  EQU   203+X'FF00'         INVALID INPUT FIELD                          
FVFNOTN  EQU   204+X'FF00'         INPUT NOT NUMERIC                            
FVFMIXI  EQU   205+X'FF00'         RECORD/ACTION COMBO INVALID                  
FVFKINV  EQU   206+X'FF00'         INVALID OPTION KEYWORD                       
FVFIGLE  EQU   207+X'FF00'         INVALID DATA QUALIFIER                       
FVFKDUP  EQU   208+X'FF00'         DUPLICATED OPTION KEYWORD                    
FVFDINV  EQU   209+X'FF00'         INVALID OPTION DATA VALUE                    
FVFREQD  EQU   210+X'FF00'         REQUIRED OPTION IS MISSING                   
FVFEKEY  EQU   211+X'FF00'         ENTER KEY                                    
FVFIASQ  EQU   212+X'FF00'         INVALID ACTION SEQUENCE                      
FVFERNF  EQU   213+X'FF00'         RECORD NOT ON FILE                           
FVFERAE  EQU   214+X'FF00'         RECORD ALREADY ON FILE                       
FVFRDEL  EQU   215+X'FF00'         RECORD IS DELETED                            
FVFXDEL  EQU   216+X'FF00'         CAN'T DELETE RECORD                          
FVFXCHA  EQU   217+X'FF00'         CAN'T CHANGE RECORD                          
FVFXRES  EQU   218+X'FF00'         CAN'T RESTORE RECORD                         
FVFCCDR  EQU   219+X'FF00'         CAN'T CHANGE A DELETED RECORD                
FVFSKHC  EQU   220+X'FF00'         SELECTED RECORD KEY HAS CHANGED              
FVFESEL  EQU   221+X'FF00'         INVALID SELECTION CODE                       
FVFEWHN  EQU   222+X'FF00'         INVALID WHEN                                 
FVFEOUT  EQU   223+X'FF00'         INVALID OUTPUT TYPE                          
FVFEDST  EQU   224+X'FF00'         INVALID DESTINATION                          
FVFTFUL  EQU   225+X'FF00'         TERMINAL QUEUE FULL                          
FVFQFUL  EQU   226+X'FF00'         PRINT QUEUE FULL                             
FVFEJCL  EQU   227+X'FF00'         JCL BOOK NOT FOUND                           
FVFEOLY  EQU   228+X'FF00'         CAN'T LOAD OVERLAY PHASE                     
FVFEKEYD EQU   229+X'FF00'         ENTER KEY & DATA                             
FVFELANG EQU   230+X'FF00'         INVALID LANGUAGE CODE                        
FVFESYS  EQU   231+X'FF00'         INVALID SYSTEM                               
FVFEPGM  EQU   232+X'FF00'         INVALID PROGRAM                              
FVFINVDT EQU   233+X'FF00'         INVALID DATE                                 
FVFCRDR  EQU   234+X'FF00'         CAN'T COPY/RENAME A DELETED RECORD           
FVFENEW  EQU   235+X'FF00'         ENTER NEW KEY                                
FVFESEL2 EQU   236+X'FF00'         SELECT CODE NOT VALID FOR RECORD             
FVFDUPE  EQU   237+X'FF00'         DUPLICATED INPUT FIELD                       
FVFTOOM  EQU   238+X'FF00'         TOO MANY INPUT FIELDS                        
FVFISYS  EQU   239+X'FF00'         INCOMPATIBLE SYSTEM SPECIFICATION            
*                                                                               
FVFGTSET EQU   253+X'FF00'         GETTXT BLOCK BUILT BY APP IN APPARM          
FVFSET   EQU   254                 MESSAGE BUILT BY APPLICATION                 
FVFOK    EQU   255                 FIELD IS VALID                               
         EJECT                                                                  
***********************************************************************         
* I/O CONTROLLER WORK AREA                                            *         
***********************************************************************         
         SPACE 1                                                                
IOWS     DS    0X                                                               
IOADDR   DS    A                   I/O AREA ADDRESS                             
IOFILE   DS    CL7                 FILE NAME                                    
IOCMND   DS    CL7                 DATAMGR COMMAND                              
IOFLAG   DS    XL1                 FLAG BYTE USED BY IO ROUTINE                 
IOFSWTCH EQU   X'80'               SYSTEM SWITCH OCCURRED FOR I/O               
IOERR    DS    XL1                 I/O ERROR RETURN BYTE                        
IOEEOF   EQU   X'80'               END-OF-FILE                                  
IOEDSK   EQU   X'40'               NON-RECOVERABLE DISK ERROR                   
IOEDUP   EQU   X'20'               DUPLICATE KEY ON ADD                         
IOERNF   EQU   X'10'               RECORD NOT FOUND                             
IOEDEL   EQU   X'02'               RECORD IS DELETED                            
IOESWS   EQU   X'FF'               SYSTEM SWITCH ERROR OCCURRED                 
IOERRS   EQU   X'FF'               RESERVED FOR CONTROLLER USE                  
IOKEY    DS    XL64                ACTUAL KEY VALUE                             
IOKEYSAV DS    XL64                SAVED ACTUAL KEY VALUE (BEFORE I/O)          
IODA     DS    XL4                 DISK ADDRESS OF D/A RECORD                   
IOWORK   DS    XL44                D/A LINKED FILES WORK AREA                   
IOINDS1  DS    XL1                 INDICATOR BYTE 1                             
IOISWAUT EQU   X'80'               AUTO SWITCH BACK AFTER I/O                   
IOINDS2  DS    XL1                 INDICATOR BYTE 2                             
IODAOVER DS    XL4                 OVERRIDE D/A (ALWAYS USED AND XC'D)          
         DS    XL8                 N/D                                          
IOWSX    DS    0X                                                               
         EJECT                                                                  
***********************************************************************         
* I/O CONTROLLER EQUATES                                              *         
***********************************************************************         
         SPACE 1                                                                
*                                  ** I/O FILE EQUATES **                       
IOFILES  EQU   X'0F00'             RESERVED FOR CONTROLLER USE                  
IOGENDIR EQU   X'0100'             I/O TO GENERAL DIRECTORY                     
IOGENFIL EQU   X'0200'             I/O TO GENERAL FILE                          
IOCONFIL EQU   X'0300'             I/O TO CONTROL FILE (CONTROL SYSTEM)         
IOACCFIL EQU   X'0100'             I/O TO ACCOUNT FILE                          
IOACCDIR EQU   X'0200'             I/O TO ACCDIR                                
IOACCMST EQU   X'0300'             I/O TO ACCMST                                
IOACCARC EQU   X'0400'             I/O TO ACCARC                                
IOACCGND EQU   X'0500'             I/O TO GENDIR FROM ACC SYSTEM                
IOACCGNF EQU   X'0600'             I/O TO GENFILE FROM ACC SYSTEM               
IOCTFILE EQU   X'0F00'             I/O TO CONTROL FILE (OTHER SYSTEMS)          
*                                                                               
*              *** EQUATES FOR NEW FILE CONTROLLER ***                          
*                                                                               
IOMEDDIR EQU   X'0100'             I/O TO MEDIA DIRECTORY                       
IOMEDFIL EQU   X'0200'             I/O TO MEDIA FILE                            
IOMEDZDR EQU   X'0300'             I/O TO MEDDIRZ FROM MEDIA                    
IOMEDZFL EQU   X'0400'             I/O TO MEDFILZ FROM MEDIA                    
IOMPLDIR EQU   X'0100'             I/O TO MPL USER UPDATED DIRECTORY            
IOMPLFIL EQU   X'0200'             I/O TO MPL USER UPDATED FILE                 
IOMPRDRA EQU   X'0300'             I/O TO MPL STATIC DIRECTORY                  
IOMPRFLA EQU   X'0400'             I/O TO MPL STATIC FILE                       
IOMBADIR EQU   X'0100'             I/O TO MBASE DIRECTORY                       
IOMBANDX EQU   X'0200'             I/O TO MBASE INDEX                           
IOMBAFIL EQU   X'0300'             I/O TO MBASE FILE                            
IOMBUDIR EQU   X'0400'             I/O TO MBASE USER DIRECTORY                  
IOMBUFIL EQU   X'0500'             I/O TO MBASE USER FILE                       
IOMBAGDR EQU   X'0600'             I/O TO GENDIR FROM MBASE SYSTEM              
IOMBAGFL EQU   X'0700'             I/O TO GENFIL FROM MBASE SYSTEM              
         SPACE 1                                                                
*                                  ** I/O AREA EQUATES **                       
IO1      EQU   X'0040'             I/O AREA 1 TO BE USED FOR I/O                
IO2      EQU   X'0080'             I/O AREA 2 TO BE USED FOR I/O                
IO3      EQU   X'00C0'             I/O AREA 3 TO BE USED FOR I/O                
IO4      EQU   X'4000'             I/O AREA 4 TO BE USED FOR I/O                
IO5      EQU   X'5000'             I/O AREA 5 TO BE USED FOR I/O                
IO6      EQU   X'6000'             I/O AREA 6 TO BE USED FOR I/O                
IO7      EQU   X'7000'             I/O AREA 7 TO BE USED FOR I/O                
IO8      EQU   X'8000'             I/O AREA 8 TO BE USED FOR I/O                
IO9      EQU   X'9000'             I/O AREA 9 TO BE USED FOR I/O                
IOA      EQU   X'A000'             I/O AREA A TO BE USED FOR I/O                
IOREC    EQU   X'B000'             CONTROLLER I/O AREA USED FOR I/O             
         SPACE 1                                                                
*                                  ** I/O COMMAND EQUATES **                    
IOCMNDS  EQU   X'000F'             RESERVED FOR CONTROLLER USE                  
IOLOCK   EQU   X'0010'             READ FOR UPDATE                              
IORDEL   EQU   X'0020'             READ DELETED RECORDS                         
IOHIGH   EQU   X'0001'             DMRDHI                                       
IOHI     EQU   IOHIGH              DMRDHI                                       
IOHID    EQU   IOHI+IORDEL         DMRDHI (FOR DELETES)                         
IOHIUP   EQU   IOHI+IOLOCK         DMRDHI (FOR UPDATE)                          
IOHIUPD  EQU   IOHI+IOLOCK+IORDEL  DMRDHI (FOR UPDATE & DELETES)                
IOREAD   EQU   X'0002'             DMREAD                                       
IORD     EQU   IOREAD              DMREAD                                       
IORDD    EQU   IORD+IORDEL         DMREAD (FOR DELETES)                         
IORDUP   EQU   IORD+IOLOCK         DMREAD (FOR UPDATE)                          
IORDUPD  EQU   IORD+IOLOCK+IORDEL  DMREAD (FOR UPDATE & DELETES)                
IOSEQ    EQU   X'0003'             DMRSEQ                                       
IOSQ     EQU   IOSEQ               DMRSEQ                                       
IOSQD    EQU   IOSQ+IORDEL         DMRSEQ (FOR DELETES)                         
IOSQUP   EQU   IOSQ+IOLOCK         DMRSEQ (FOR UPDATE)                          
IOSQUPD  EQU   IOSQ+IOLOCK+IORDEL  DMRSEQ (FOR UPDATE & DELETES)                
IOGET    EQU   X'0004'             GETREC                                       
IOGETRUP EQU   IOGET+IOLOCK        GETREC (FOR UPDATE)                          
IOADD    EQU   X'0005'             DMADD                                        
IOADDREC EQU   X'0005'             ADDREC                                       
IOWRITE  EQU   X'0006'             DMWRT                                        
IOPUT    EQU   X'0006'             PUTREC                                       
IOPUTREC EQU   IOPUT               PUTREC                                       
IOUNLOCK EQU   X'0007'             DMUNLK                                       
         EJECT                                                                  
***********************************************************************         
* EXTRACTED ACCOUNT VALUES                                            *         
***********************************************************************         
         SPACE 1                                                                
AWS      DS    0X                                                               
ACALDG   DS    AL4                 A(LEDGER TABLE ENTRY)                        
*                                                                               
ACVALS   DS    0X                  ** EXTRACTED RECORD VALUES **                
ACAPPR   DS    AL4                 A(PRODUCTION PROFILE ELEMENT)                
ACASPA   DS    AL4                 A(FIRST SPECIAL POSTING A/C ELEMENT)         
ACCODE   DS    CL15                KEY                                          
ACNAME   DS    CL36                NAME                                         
ACNAMESH DS    CL12                SHORT NAME                                   
ACOFFC   DS    CL2                 OFFICE                                       
ACBSTAT  DS    XL1                 ACCOUNT STATUS BYTE                          
ACBSABAL EQU   X'80'               ACCOUNT HAS BALANCE ELEMENT                  
ACBSPERS EQU   X'40'               ACCOUNT GENERATES PERSONNEL POSTING          
ACBSCLSE EQU   X'20'               ACCOUNT IS CLOSED                            
ACBSLOCK EQU   X'10'               ACCOUNT IS LOCKED                            
ACBSDEPT EQU   X'08'               ACCOUNT GENERATES DEPT POSTING               
*&&US                                                                           
ACBSVEND EQU   X'04'               US VENDOR OPTION                             
*&&                                                                             
*&&UK                                                                           
ACBSIVAT EQU   X'04'               UK INPUT TAX (VAT) ACCOUNT                   
*&&                                                                             
*&&US                                                                           
ACBSPROV EQU   X'02'               ACCOUNT IS PROVISIONAL                       
*&&                                                                             
ACSTAT1  DS    XL1                 STATUS BYTE              (RSTSTAT)           
ACSTAT2  DS    XL1                 STATUS BYTE              (RSTSTAT2)          
ACSTAT3  DS    XL1                 STATUS BYTE              (RSTSTAT3)          
ACCOST   DS    CL1                 COSTING BYTE             (RSTCOST)           
ACSECY   DS    XL1                 SECURITY LEVEL           (RSTSECY+1)         
ACTAXR   DS    XL2                 TAX RATE (VAT/GST)                           
ACFLTS   DS    0CL8                FILTERS                                      
ACFLT1   DS    CL1                 FILTER 1                                     
ACFLT2   DS    CL1                 FILTER 2                                     
ACFLT3   DS    CL1                 FILTER 3                                     
ACFLT4   DS    CL1                 FILTER 4                                     
ACFLT5   DS    CL1                 FILTER 5                                     
ACFLT6   DS    CL1                 FILTER 6                                     
ACFLT7   DS    CL1                 FILTER 7                                     
ACFLT8   DS    CL1                 FILTER 8                                     
*                                                                               
ACDA     DS    XL4                 ACCOUNT RECORD DISK ADDRESS                  
*                                                                               
ACINDS1  DS    XL1                 ACCOUNT INDICATORS - ONE                     
ACIACTHI EQU   X'80'               HIGH LEVEL ACCOUNT                           
ACIACTLO EQU   X'40'               LOW LEVEL ACCOUNT                            
ACIPRCLI EQU   X'04'               PRODUCTION CLIENT                            
ACIPRPRO EQU   X'02'               PRODUCTION PRODUCT                           
ACIPRJOB EQU   X'01'               PRODUCTION JOB                               
*                                                                               
ACINDS2  DS    XL1                 ACCOUNT INDICATORS - TWO                     
*                                                                               
ACSTAT4  DS    XL1                 STATUS BYTE              (RSTSTAT4)          
ACSTAT5  DS    XL1                 STATUS BYTE              (RSTSTAT5)          
         DS    XL3                 N/D                                          
ACVATCOD DS    XL1                 VAT CODE OR NULLS        (FFTTVATC)          
ACKSVTYP DS    XL1                 KSV TYPE                 (ASTKSVTY)          
ACCURCOD DS    CL3                 ACCOUNT CURRENCY CODE    (ASTCUR)            
ACCOFF   DS    CL2                 GENERAL LEDGER OFFICE    (RSTOFF)            
         DS    XL30                N/D                                          
ACVALSL  EQU   *-ACVALS                                                         
*                                                                               
ACJOBFRM DS    CL1                 JOB FORMAT:-                                 
ACJOBOLD EQU   C'O'                OLD ESTIMATING SYSTEM                        
ACJOBNEW EQU   C'N'                NEW ESTIMATING SYSTEM                        
ACJOBMCS EQU   C'M'                MCS ESTIMATING SYSTEM                        
ACJOBEST DS    CL1                 TYPE OF JOB ESTIMATE CHECKING:-              
ACJOBZER EQU   C'Z'                NEW ESTIMATING CHECK FOR ZERO AMOUNT         
ACJOBMAX EQU   C'M'                NEW ESTIMATING CHECK AGAINST MAX             
ACJOBTOT EQU   C'T'                NEW ESTIMATING CHECK AGAINST TOTAL           
ACJOBNON EQU   C' '                NO CHECKING (ACJOBEST ONLY)                  
ACOPSTAT DS    XL1                 JOB STATUS:-                                 
ACOXJOB  EQU   X'80'               JOB IS AN X-JOB                              
ACOMCSE  EQU   X'40'               JOB USES MCS ESTIMATE?                       
         DS    XL15                N/D                                          
AWSX     EQU   *                                                                
         EJECT                                                                  
***********************************************************************         
* ADDRESS DIRECTORY                                                   *         
***********************************************************************         
         SPACE 1                                                                
AFAC     DS    0A                  ** ADDRESSES PASSED FROM FACPAK **           
AINP     DS    A                   A(TRANSLATOR I/O BLOCK)                      
ATWA     DS    A                   A(TERMINAL WORK AREA)                        
ATIA     DS    A                   A(TERMINAL INPUT AREA)                       
ASYS     DS    A                   A(SYSTEM FACILITY LIST)                      
ACOM     DS    A                   A(COMMON FACILITY LIST)                      
ASYSLST  DS    A                   A(GETFACT SYSTEM LIST)                       
         DS    3A                  N/D                                          
ASYSFAC  DS    A                   A(SYSFACS)                                   
         SPACE 1                                                                
AENTRIES DS    0A                  ** ADDRESSES OF TABLE ENTRIES **             
AFILNTRY DS    A                   A(FILE NAMES TABLE ENTRY)                    
ARECNTRY DS    A                   A(RECORD TYPE TABLE ENTRY)                   
AACTNTRY DS    A                   A(ACTION TABLE ENTRY)                        
AMIXNTRY DS    A                   A(RECORD/ACTION TABLE ENTRY)                 
APFKNTRY DS    A                   A(PFKEY TABLE ENTRY)                         
ACLMHEAD DS    A                   A(COLUMN TABLE ENTRY HEADER)                 
ACLMDATA DS    A                   A(COLUMN DATA TABLE ENTRY)                   
ALINNTRY DS    A                   A(LINE TABLE ENTRY)                          
         SPACE 1                                                                
COMFACS  DS    0F                  ** COMMON FACILITIES **                      
VDMGR    DS    V                                                                
VCOLY    DS    V                                                                
VGETMSG  DS    V                                                                
VGETTXT  DS    V                                                                
VHELLO   DS    V                                                                
VSCANNER DS    V                                                                
VUNSCAN  DS    V                                                                
VHEXIN   DS    V                                                                
VHEXOUT  DS    V                                                                
VCASHVAL DS    V                                                                
VDATVAL  DS    V                                                                
VDATCON  DS    V                                                                
VSCUNKEY DS    V                                                                
VADDAY   DS    V                                                                
VPERVERT DS    V                                                                
VGETFACT DS    V                                                                
VGETDAY  DS    V                                                                
VPERVAL  DS    V                                                                
VMINIO   DS    V                                                                
VPARSNIP DS    V                                                                
VSWITCH  DS    V                                                                
CUREDIT  DS    V                                                                
VDICTAT  DS    V                                                                
VGETPROF DS    V                                                                
VEDITOR  DS    V                                                                
VSECRET  DS    V                                                                
VGETHELP DS    V                                                                
VCONVERT DS    V                                                                
VPRORATA DS    V                                                                
VGETCUR  DS    V                                                                
VBLDCUR  DS    V                                                                
VPROTOFF DS    V                                                                
VPROTON  DS    V                                                                
COMFACN  EQU   (*-COMFACS)/L'COMFACS                                            
*                                                                               
AADDRESS DS    0A                  ** BATCH CONTROLLER ADDRESSES **             
AADDRS1  DS    0A                  ** FILE CONTROLLER ADDRESSES **              
VAMTVAL  DS    V                   RELOCATED V(AMTVAL)                          
VCONVMOS DS    V                   RELOCATED V(CONVMOS)                         
VBMONVAL DS    V                   RELOCATED V(BMONVAL)                         
VVATICAN DS    V                   RELOCATED V(VATICAN)                         
VJOBCOL  DS    V                   RELOCATED V(ACJOBCOL)                        
VCATCALL DS    V                   RELOCATED V(CATCALL)                         
VEXCEL   DS    V                   RELOCATED V(EXCEL)                           
VACSRCHC DS    V                   RELOCATED V(ACSRCHC)                         
ASYSTAB  DS    A                   SYSTEM FILES TABLE                           
ACMDTAB  DS    A                   DATAMGR COMMAND TABLE                        
AFILTAB  DS    A                   FILE TABLE                                   
ADDRS1N  EQU   (*-AADDRS1)/L'AADDRS1                                            
AADDRS2  DS    0A                  ** FILE CONTROLLER ADDRESSES **              
ARECTAB  DS    A                   RECORD TABLE                                 
AACTTAB  DS    A                   ACTION TABLE                                 
AMIXTAB  DS    A                   RECORD/ACTION COMBO TABLE                    
APFKTAB  DS    A                   PFKEY TABLE                                  
ASELTAB  DS    A                   SELECT TABLE                                 
ATYPTAB  DS    A                   BATCH TYPE TABLE                             
AFMTTAB  EQU   ATYPTAB   =BILL     PARAGRAPH FORMAT TABLE                       
ALEDTAB  EQU   ATYPTAB   =CRED     CREDITOR LEDGERS TABLE                       
ADICUPR  DS    A                   UPPER CASE DICTIONARY LIST                   
ADICMIX  DS    A                   MIXED CASE DICTIONARY LIST                   
ADICGEN  DS    A                   GENERAL DICTIONARY WORDS                     
AHDRTAB  DS    A                   DISPLAY HEADER TABLE                         
AFOPTAB  EQU   AHDRTAB   =BILL     FORMAT OPTIONS TABLE                         
ACLMGEN  DS    A                   COLUMN TABLE ENTRIES FOR ALL LISTS           
ADSCTAB  DS    A                   RECORD DESCRIPTION TABLE                     
ATYPLST  EQU   ADSCTAB   =BILL     BATCH TYPE LIST                              
ACLMTAB  DS    A                   COLUMN TABLE                                 
         DS    A                                                                
         DS    A                                                                
ADDRS2N  EQU   (*-AADDRS2)/L'AADDRS2                                            
*                                                                               
AROUTS1  DS    0A                  ** CONTROLLER ROUTINES - 1 **                
AAMTVAL  DS    A                   VALIDATE AMOUNT (OLD OVERLAYS)               
ABLDDET  DS    A                   BUILD BATCH DETAILS LINES                    
ATSTPFK  EQU   ABLDDET   =BILL     TEST PFKEY TABLE ENTRY                       
ABLDPFK  DS    A                   BUILD PFKEY LINE ROUTINE                     
ATSTACS  DS    A                   TEST AUTHORISATION ROUTINE                   
ATSTSEC  DS    A                   TEST ACCOUNT SECURITY                        
ATSTREC  DS    A                   LOOKUP RECORD & TEST AUTHORISATION           
ATSTACT  DS    A                   LOOKUP ACTION & TEST AUTHORISATION           
ATSTMIX  DS    A                   LOOKUP RECACT & TEST AUTHORISATION           
ATSTBMO  DS    A                   TEST BATCH MONTH(S) OK                       
ATSTCLM  EQU   ATSTBMO   =BILL     TEST COLUMN TABLE ENTRY                      
APERDIS  EQU   ATSTBMO   =CRED     OLD STYLE PERIOD DISPLAY                     
AVALOPT  DS    A                   OPTIONS FIELD VALIDATOR                      
AVALAMT  DS    A                   VALIDATE CASH AMOUNT                         
AVALBTY  DS    A                   VALIDATE BATCH TYPE                          
AFNDCLM  EQU   AVALBTY   =BILL     FIND COLUMN ON LIST SCREEN                   
ADCOMP   EQU   AVALBTY   =CRED     OLD STYLE PERIOD COMPARE                     
AVALBMO  DS    A                   VALIDATE BATCH MONTH(S)                      
ABUKMAKE EQU   AVALBMO   =CRED     OLD STYLE BUCKET CREATION                    
AVALBNA  DS    A                   VALIDATE BATCH NAME                          
AXFRTMS  EQU   AVALBNA   =BILL     TRANSFER TMS                                 
ABLDDIS  EQU   AVALBNA   =CRED     OLD STYLE BUILD COLUMN DISPLAY               
AVALBRF  DS    A                   VALIDATE BATCH REFERENCE                     
AGETWCD  EQU   AVALBRF   =BILL     GET WORK-CODE DATA                           
AVALCPJ  DS    A                   VALIDATE PRODUCTION ACCOUNT                  
AVALEFD  DS    A                   VALIDATE EFFECTIVE DATE                      
AEDTAMT  EQU   AVALEFD   =BILL     EDIT AGENCY/FOREIGN CURR. AMOUNT             
AVALITE  DS    A                   VALIDATE ITEM COUNT CONTROL                  
ASETUP   EQU   AVALITE   =BILL     SET UP VALUES FOR NEW JOB                    
ADISPLAY EQU   AVALITE   =CRED     OLD STYLE DISPLAY SCREEN                     
AVALCSH  DS    A                   VALIDATE CASH CONTROL                        
AUPDJOB  EQU   AVALCSH   =BILL     UPDATE JOB RECORD                            
AUNITLDG EQU   AVALCSH   =CRED     OLD STYLE UNIT/LEDGER VALIDATION             
AVALIUP  DS    A                   VALIDATE INSTANT UPDATE                      
ANXTREC  EQU   AVALIUP   =CRED     OLD STYLE GET NEXT RECORD                    
APRORATA EQU   AVALIUP   =BILL     CALL PRORATA/TOBACCO AS REQUIRED             
AVALOFF  DS    A                   VALIDATE OFFICE CODE                         
AVALULA  DS    A                   VALIDATE (UNIT/LEDGER)/ACCOUNT               
AVALNAR  DS    A                   VALIDATE NARRATIVE                           
ADISACC  EQU   AVALNAR   =CRED     OLD STYLE DISPLAY ACCOUNT NAME               
AVALGOB  DS    A                   CHECK GOBATCH & CALL JOBBER IF REQD          
ADISUL   EQU   AVALGOB   =CRED     OLD STYLE DISPLAY UNIT/LEDGER                
AVALWRK  DS    A                   VALIDATE WORK CODE ESTIMATE AMOUNT           
ABLOVDIS EQU   AVALWRK   =CRED     OLD STYLE COLUMN DISPLAY                     
AVALDAT  DS    A                   VALIDATE A SINGLE DATE                       
AVALPER  DS    A                   VALIDATE A DATE PERIOD                       
AVALMOS  DS    A                   VALIDATE MONTH OF SERVICE RANGE              
AGETBTY  DS    A                   GET BATCH TYPE VALUES                        
ASAVOWS  EQU   AGETBTY   =BILL     SAVE/RESTORE OVERLAY WORKING STORAGE         
ASCRNDIM EQU   AGETBTY   =CRED     OLD STYLE GET SCREEN DIMENSIONS              
AGETLDG  DS    A                   GET LEDGER VALUES                            
AGETACC  DS    A                   GET ACCOUNT FOR OLD OVERLAYS                 
AGETACT  DS    A                   GET ACCOUNT FOR NEW OVERLAYS                 
AGETELS  DS    A                   GET ELEMENTS & EXTRACT DATA                  
AGETGEN  DS    A                   GET GENERAL MESSAGES                         
AGETWRK  DS    A                   GET WORK CODE DESCRIPTION                    
AGETEST  DS    A                   GET ESTIMATE VALUE(S)                        
AGETJOB  DS    A                   GET JOB & SAVE FORMAT TYPE                   
AGETOPT  EQU   AGETJOB   =BILL     GET OPTIONS FOR A JOB                        
AMRGPRF  DS    A                   MERGE PROFILES FOR OLD OVERLAYS              
ASCOMP   EQU   AMRGPRF   =CRED     OLD STYLE STRING COMPARE                     
ASETSEL  DS    A                   SET A(SELECT TABLE) FOR REC/ACT              
AGETPID  DS    A                   GET BATCHER NAME                             
ATSTINP  DS    A                   TEST FOR INPUT                               
AVALPID  DS    A                   VALIDATE PERSONAL-ID                         
AGETUID  DS    A                   GET USER-ID CODE                             
ATSTBTY  DS    A                   TEST BATCH TYPE/ACTION COMBO VALID           
AVALBAT  EQU   ATSTBTY   =BILL     VALIDATE BATCH INPUT DETAILS                 
AXDETDIS EQU   ATSTBTY   =CRED     OLD STYLE EXTRA DETAIL DISPLAY               
AVALDST  DS    A                   VALIDATE DESTINATION FIELD                   
AFLDSEC  DS    A                   TEST FIELD SECURITY                          
AVALWEX  DS    A                   VALIDATE WRITE-OFF EXPENSE ACCOUNT           
ABLDSRC  EQU   AVALWEX   =CRED     OLD STYLE BUILD SOURCE DETAILS               
AVALWAN  DS    A                   VALIDATE WRITE-OFF ANALYSIS ACCOUNT          
AREADUP  EQU   AVALWAN   =CRED     OLD READ UP FRONT (2 CHAR OFF)               
AMCHORD  DS    A                   MATCH ORDER TO INVOICE FOR PTAELS            
AXDFCURR EQU   AMCHORD   =CRED     OLD STYLE FOREIGN CURRENCY EXTRA DET         
AROUTS1N EQU   (*-AROUTS1)/L'AROUTS1                                            
         SPACE 1                                                                
AROUTS2  DS    0A                  ** CONTROLLER ROUTINES - 2 **                
AADDHDR  DS    A                   VALIDATE AND ADD A BATCH HEADER              
ASETCLM  EQU   AADDHDR   =BILL     SET A(COLUMN TABLE ENTRIES)                  
ABLDBAK  DS    A                   BUILD A BATCH ACTIVE POINTER KEY             
AADDOBH  EQU   ABLDBAK   =BILL     ADD OLD BATCH HEADERS                        
ASETELE  EQU   ABLDBAK   =CRED     SET ELEMENT ADDRESSES                        
ABLDBAP  DS    A                   BUILD A BATCH PASSIVE POINTER KEY            
ADISHDR  DS    A                   DISPLAY A BATCH HEADER                       
ABLDTRN  EQU   ADISHDR   =BILL     BUILD TRANSACTION RECORD FOR ADDTRN          
ASCRNCLR EQU   ADISHDR   =CRED     OLD STYLE CLEAR SCREEN                       
APSTACR  DS    A                   POST AN ACCRUAL BATCH                        
ASETWCT  EQU   APSTACR   =BILL     SET WORKCODE TOTALS                          
ASUBTOT  EQU   APSTACR   =BILL     SET LIST SUB-TOTALS (NEW VERSION)            
AADDITE  DS    A                   ADD BATCH ITEM FROM AN ACCDAY RECORD         
ACMPPRF  EQU   AADDITE   =BILL     BUILD COMPOSITE PROFILE                      
AUPDBAT  DS    A                   UPDATE A BATCH                               
AALLTRN  EQU   AUPDBAT   =BILL     ALLOCATE AMOUNT ON TRANSACTION               
AVSCROLL EQU   AUPDBAT   =CRED     OLD STYLE VERTICAL SCROLL                    
AINIADT  DS    A                   INITIALISE ADDTRN CONTROL BLOCK              
ACLOBAT  DS    A                   CLOSE A BATCH                                
ASETTRN  EQU   ACLOBAT   =BILL     SET TRANSACTION LIST VALUES                  
AFLTTRN  EQU   ACLOBAT   =CRED     FILTER TRANSACTION RECORDS                   
ABLDACR  DS    A                   BUILD ENTRY FOR ACCRUAL BATCH                
AFMTHED  EQU   ABLDACR   =BILL     FORMAT PARAGRAPH HEADLINE                    
ADISSTA  DS    A                   DISPLAY BATCH STATUS                         
AGETGRB  EQU   ADISSTA   =BILL     GET GROUPING BASIS DESCRIPTION               
ARCLBAT  DS    A                   RECALL A BATCH                               
AFMTBLK  EQU   ARCLBAT   =BILL     FORMAT BLOCK ROUTINES                        
ASAVBAT  DS    A                   SAVE A BATCH                                 
AGETPTA  EQU   ASAVBAT   =BILL     READ/CREATE PTA RECORD                       
AGETBAT  DS    A                   VALIDATE BATCH & BUILD LSTTAB ENTRY          
APUTPTA  EQU   AGETBAT   =BILL     UPDATE & WRITE/ADD PTA RECORD                
ADELBAT  DS    A                   DELETE A BATCH                               
AWOPPTA  EQU   ADELBAT   =BILL     CREATE W/O POSTINGS ON PTA RECORD            
AADDMON  DS    A                   ADD ONE MONTH (SAME/LAST DAY)                
AGETCUR  DS    A                   GET CURRENCY CODE INFO                       
AVALHRS  DS    A                   VALIDATE HOURS ALLOCATED                     
AUPDORD  DS    A                   PROCESS ORDER RECORDS                        
ASAVFLD  DS    A                   CREATE SFS ELEMENTS FROM A TWA               
AVALXFR  EQU   ASAVFLD   =BILL     VALIDATE PENDING TRANSFER DATA               
ARESFLD  DS    A                   RESTORE SFS DATA TO A TWA                    
AGETGOP  EQU   ARESFLD   =BILL     GET TSAR RECORD GETOPT DATA                  
ARESVAT  DS    A                   RESOLVE VAT CODE                             
ACHKINV  DS    A                   CHECK FOR DUPLICATE INVOICE NUMBER           
AROUTS2N EQU   (*-AROUTS2)/L'AROUTS2                                            
         SPACE 1                                                                
AROUTS3  DS    0A                  ** CONTROLLER ROUTINES - 3 **                
AOVRSCR  DS    A                   SCREEN OVERLAY ROUTINE                       
AOVRPHS  DS    A                   OVERLAY A PHASE ROUTINE                      
AOVRBIT  DS    A                   OVERLAY A BATCH INPUT TYPE                   
AFVAL    DS    A                   FIELD VALIDATION ROUTINE                     
AIO      DS    A                   I/O EXECUTIVE ROUTINE                        
AREAD    DS    A                   READ ACCOUNT FILE RECORD                     
AREADL   DS    A                   READ & LOCK ACCOUNT FILE RECORD              
ARDHI    DS    A                   READ HIGH ACCOUNT FILE RECORD                
ARDHIL   DS    A                   READ HIGH & LOCK ACCOUNT FILE                
AWRITE   DS    A                   WRITE ACCOUNT FILE RECORD                    
AADD     DS    A                   ADD ACCOUNT FILE RECORD                      
ASEQ     DS    A                   READ SEQ ACCOUNT FILE                        
ASEQL    DS    A                   READ SEQ & LOCK ACCOUNT FILE                 
ANTRSES  DS    A                   SAVE A BATCH PROGRAM SESSION                 
AXITSES  DS    A                   RESTORE A BATCH PROGRAM SESSION              
ARECACT  DS    A                   SET NEW RECORD/ACTION WORDS                  
ATSARIO  DS    A                   INTERFACE TO TSAR                            
ASETMSK  DS    A                   SET VALID ACTION MASK FOR A RECORD           
APUTRAC  DS    A                   PUT RECORD ACTIVITY ELS. INTO RECORD         
AGETRAC  DS    A                   GET RECORD ACTIVITY ELS. FROM RECORD         
ATSTTAX  DS    A                   TEST DUTCH TAX FOR EXPENSE ACCOUNTS          
ACHKBMO  DS    A                   CHECK BATCH MONTH AGAINST PROFILE            
AEDTRAT  DS    A                   EDIT OUT EXCHANGE RATE(S)                    
ADELGIN  DS    A                   DELETE GROUP INVOICE RECORDS                 
AGETGIN  DS    A                   GET NEXT GROUP INVOICE NUMBER                
AORDAUD  DS    A                   UPDATE ORDER AUDIT RECORD                    
ATSTOFF  DS    A                   TEST OFFICE AGAINST LIMIT ACCESS             
AJOBMAX  DS    A                   TEST AMOUNT AGAINST JOB ESTIMATE             
AROUTS3N EQU   (*-AROUTS3)/L'AROUTS3                                            
         SPACE 1                                                                
APHASES  DS    0A                  ** CONTROLLER T00A PHASES **                 
VADDTRN  DS    V                                                                
VCHOPPER DS    V                                                                
VOFFAL   DS    V                                                                
VREPORT  DS    V                                                                
VREQTWA  DS    V                                                                
VSPOON   DS    V                                                                
VSQUASH  DS    V                                                                
VTSAR    DS    V                                                                
VJOBBER  DS    V                                                                
VGETOPT  DS    V                                                                
VROUT1   DS    V                   COMMON ROUTINES - 1                          
VROUT2   DS    V                   COMMON ROUTINES - 2                          
VROUT3   DS    V                   COMMON ROUTINES - 3                          
VQSORT   DS    V                                                                
VTIMVAL  DS    V                                                                
VGETIDS  DS    V                                                                
VROUT4   DS    V                   COMMON ROUTINES - 4                          
VFALINK  DS    V                                                                
VPADDLE  DS    V                   PADDLE                                       
         SPACE 1                                                                
*                                  ** MISCELLANEOUS ADDRESSES **                
AREP     DS    A                   A(REPORT MONITOR W/S)                        
ACTRY    DS    A                   A(COUNTRY TABLE)                             
ALANG    DS    A                   A(LANGUAGE TABLE)                            
         SPACE 1                                                                
AOVERLAY DS    A                   A(OVERLAY PHASE)                             
AOVERWRK DS    A                   A(OVERLAY WORKING STORAGE)                   
AOVERVAL DS    A                   A(OVERLAY VALIDATION ROUTINES)               
AOVEROUT DS    A                   A(OUTPUT FROM OVERLAY VALIDATION)            
AOVERSEL DS    A                   A(OVERLAY SELECT TABLE)                      
ALSVALS  DS    A                   A(LIST SUB-CONTROLLER AREA IN TWA)           
         SPACE 1                                                                
*                                  ** ADDRESSES OF I/O AREAS **                 
AIO1     DS    A                   A(I/O AREA 1)                                
AIO2     DS    A                   A(I/O AREA 2)                                
AIO3     DS    A                   A(I/O AREA 3)                                
AIO4     DS    A                   A(I/O AREA 4)                                
AIO5     DS    A                   A(I/O AREA 5)                                
AIO6     DS    A                   A(I/O AREA 6)                                
AIO7     DS    A                   A(I/O AREA 7)                                
AIO8     DS    A                   A(I/O AREA 8)                                
AIO9     DS    A                   A(I/O AREA 9)                                
AIOA     DS    A                   A(I/O AREA 10)                               
AIOREC   DS    A                   A(CONTROLLER I/O AREA)                       
         SPACE 1                                                                
ASECBLK  DS    A                   A(SECURITY ACCESS BLOCK)                     
ASWSTAB  DS    A                   A(SYSTEM SWITCH TABLE)                       
AGOPBLK  DS    A                   A(GETOPT BLOCK)                              
AOFFBLK  DS    A                   A(OFFAL BLOCK)                               
AVATBLK  DS    A                   A(VATICAN BLOCK)                             
AADTBLK  DS    A                   A(ADDTRN BLOCK)                              
AJOBBLK  DS    A                   A(JOBBER BLOCK)                              
ACOLTAB  DS    A                   A(COLUMN TABLE)                              
LCOLTAB  DS    F                   L'COLUMN TABLE                               
AOPVTAB  DS    A                   A(OUTPUT VALUES TABLE)                       
LOPVTAB  DS    F                   L'OUTPUT VALUES TABLE                        
ATSABLK  DS    A                   A(TSAR BLOCK)                                
AGOXBLK  DS    A                   A(EXTENDED GETOPT BLOCK)                     
AWORKX   DS    A                   A(END OF GENERAL W/S)                        
ALINK    DS    0A                  A(LINKD) =CBILL ONLY                         
ATMSUBLK DS    A                   N/D                                          
         EJECT                                                                  
***********************************************************************         
* BATCH CONTROLLER WORK AREA                                          *         
***********************************************************************         
         SPACE 2                                                                
BCWS     DS    0X                                                               
BCPARM   DS    6F                                                               
BCDMCB   DS    6F                                                               
BCDUB    DS    D                                                                
BCFULL   DS    F                                                                
BCHALF   DS    H                                                                
BCBYTE1  DS    X                                                                
BCBYTE2  DS    X                                                                
BCWORK   DS    XL64                                                             
BCSVRD   DS    A                   SAVED RD VALUE ON ENTRY                      
BCRELO   DS    A                   CONTROLLER RELOCATION                        
BCDSPOPT DS    XL2                 DISPLACEMENT TO OPTIONS FIELD                
BCDSPOVR DS    XL2                 DISPLACEMENT TO SCREEN LOAD POINT            
BCAUTL   DS    A                   A(UTL ENTRY)                                 
BCACUR   DS    A                   A(CURSOR AT TIME OF INPUT)                   
BCBASER1 DS    A                   CONTROLLER BASE REGISTER 1                   
BCBASER2 DS    A                   CONTROLLER BASE REGISTER 2                   
BCBASER3 DS    A                   CONTROLLER BASE REGISTER 3                   
BCBASER4 DS    A                   CONTROLLER BASE REGISTER 4                   
BCNTRYA  DS    A                   BATCH SUB-CONTROLLER ADDRESS                 
BCFLAG   DS    X                   CONTROLLER FLAG                              
BCPFKEY  DS    XL1                 PROGRAM FUNCTION KEY                         
BCPFXITS EQU   255                 XITSES PFKEY VALUE                           
BCINDS1  DS    XL1                 CONTROLLER INDICATORS - 1                    
BCIANYPF EQU   X'80'               USER PRESSED PF KEY THIS TIME                
BCINREC  EQU   X'40'               NEW RECORD INPUT THIS TIME                   
BCINACT  EQU   X'20'               NEW ACTION INPUT THIS TIME                   
BCIFRST  EQU   X'10'               ON=NOT FIRST TIME                            
BCIXERR  EQU   X'08'               XITSES TO EXIT WITH ERROR MESSAGE            
BCPCBILL EQU   X'04'               CURRENT BILL IS BEDRECD FORMAT               
BCINDS2  DS    XL1                 CONTROLLER INDICATORS - 2                    
BCINTRS  EQU   X'80'               NTRSES JUST ISSUED                           
BCIPFNTR EQU   X'40'               NTRSES TO BE ISSUED VIA PFKEY                
BCIACTCP EQU   X'20'               FILE MAINTENANCE ACTION COMPLETED            
BCIANYCH EQU   X'10'               AT LEAST ONE INPUT FIELD CHANGED             
BCIHLDLP EQU   X'08'               HOLD CURRENT LIST PAGE                       
BCIREBLS EQU   X'04'               RE-BUILD LIST SCREEN                         
BCISCH   EQU   X'02'               SEARCH FIELD SELECTED                        
BCIXITS  EQU   X'01'               XITSES JUST ISSUED (=CBILL)                  
BCSWSYSN DS    XL1                 NATIVE SYSTEM                                
BCSWSYSC DS    XL1                 CURRENT SWITCHED SYSTEM                      
BCSWSYSP DS    XL1                 PREVIOUS SWITCHED SYSTEM                     
BCSYSTEM DS    CL2                 C'US' OR C'UK'                               
BCCTRYAT DS    XL8                 COUNTRY GLOBAL ATTRIBUTES                    
         PUSH  PRINT                                                            
         PRINT OFF                                                              
         ORG   BCCTRYAT                                                         
         DFATB PREFIX=A2#,LENGTH=8,DC=Y  DEFINE 7-BYTE ATTRIBUTE MASK           
*                        E  A  G                                                
         DFATB 1,SWAP    0  0  1   SWAP COMMAS AND POINTS IN NUMBERS            
         DFATB 2,CLIR    0  0  1   CLEAR A SCREEN FIELD                         
         DFATB 3,1CHR    1  1  0   ONE CHARACTER INPUT                          
         DFATB 4,DATE    1  1  0   DATE INPUT REQUIRED                          
         DFATB 5,AC61    0  0  1   DUE DATE ELEMENT EXISTS  '61'                
         DFATB 6,INWC    0  0  1   INTERNAL W C  (BEGINS WITH A LETTER)         
         DFATB 7,CA11    0  0  1   CREDIT A/C IN MED CAT ELEMENT '11'           
         DFATB 8,CASI    1  1  0   CREDIT ACCOUNT IS SI (NOT SK)                
         DFATB 9,AC2D    0  0  1   PRICE LIST RECORD EXISTS  '2D'               
         DFATB 10,REFN   0  0  1   INTERNAL REF. NUMBER USED (7 DIGITS)         
         DFATB 11,OFFC   0  0  1   OFFICE CODE RELEVANT (ACPROFFC)              
         DFATB 12,INTC   0  0  1   INTERCOMPANY DETAILS                         
         DFATB 13,SCAN   0  0  1   ALTERNATIVE SCANNER DELIMITERS               
         DFATB 14,AMTT   0  0  1   AMOUNT TEST COMPULSORY                       
         DFATB 15,ITEM   1  1  0   ITEM AMOUNT VERSUS CHEQUE AMOUNT             
         DFATB 16,2YIR   0  1  0   2 YEAR PERIOD                                
         DFATB 17,ULGB   0  1  0   UL GB IS ACCEPTED AS INPUT                   
         DFATB 18,ULSQ   1  0  1   UL SQ IS ACCEPTED AS INPUT                   
         DFATB 19,KOFF   0  1  0   OFFICE CODE IN KEY                           
         DFATB 20,COMP   1  0  0   COMPANY TEST NECESSARY                       
         DFATB 21,UISA   1  0  0   UNIT A EXISTS                                
         DFATB 22,SECT   1  0  1   SECURITY CHECK                               
         DFATB 23,AC4B   0  0  1   BILL NUMBER/DATE ELEMENT '4B'                
         DFATB 24,COMM   0  1  0   COMMISSION OPTION INPUT                      
         DFATB 25,JBCA   1  0  0   JOB CONTRA ACCOUNT INPUT                     
         DFATB 26,ULSI   0  0  1   UL SI IS ACCEPTED AS INPUT                   
         DFATB 27,ANAL   1  0  1   ANALYSIS CODE IN INPUT                       
         DFATB 28,CHNO   0  1  0   CHEQUE NUMBER CHECK                          
         DFATB 29,DAUT   1  0  1   DAILY POSTING AUTHORISE BIT SET              
         POP   PRINT                                                            
BCEFFS   DS    CL8                 X'FFFFFFFFFFFFFFFF'                          
BCSPACES DS    CL132               CL132' '                                     
BCPZERO  DS    PL1                 P'0'                                         
BCHELPSO DS    XL1                 HELP SCREEN OVERLAY NUMBER                   
         DS    XL3                 N/D                                          
BCSCROLL DS    XL1                 SCROLL AMOUNT                                
BCDTADSP DS    H                   DISP. TO FIRST ELEMENT ON OLD FILE           
*                                                                               
BCCHARS  DS    0CL8                LANGUAGE DEPENDANT CHARACTERS                
BCCOMMA  DS    CL1                 COMMA                                        
BCEQUAL  DS    CL1                 EQUALS                                       
BCQUEST  DS    CL1                 QUESTION MARK                                
BCSLASH  DS    CL1                 SLASH                                        
BCHASH   DS    CL1                 HASH                                         
BCDECMAL DS    CL1                 DECIMAL POINT                                
         DS    CL2                 N/D                                          
*                                                                               
BCSYSPRG DS    0XL2                USED FOR MAINTENANCE CALLOV CALLS            
BCOVSYS  DS    XL1                 OVERLAY SYSTEM NUMBER                        
BCPRGNO  DS    XL1                 PROGRAM NUMBER                               
BCDSPREC DS    XL2                 DISPLACEMENT TO RECORD FIELD                 
BCDSPACT DS    XL2                 DISPLACEMENT TO ACTION FIELD                 
BCDSPSCR DS    XL2                 DISPLACEMENT TO SCROLL FIELD                 
BCDSPREP DS    XL2                 DISPLACEMENT TO REPORT-ID FIELD              
BCMIXLEN DS    XL1                 LENGTH OF MIXTAB ENTRIES                     
         DS    XL1                 N/D                                          
BCDSPSAV DS    XL2                 DISPLACEMENT TO START OF SAVE SCREEN         
         DS    XL2                 N/D                                          
*                                                                               
BCGLOBS  DS    0XL6                GLOBAL INDICATORS                            
BCGLOB1  DS    XL1                 GLOBAL INDICATORS 1                          
BCGLXGOB EQU   X'80'               CLEAR GOBLOCK DURING NTRSES                  
BCGLXOV2 EQU   X'40'               CLEAR OSVALS2 DURING NTRSES                  
BCGLNING EQU   X'20'               DON'T CLEAR CSINDSG DURING NTRSES            
BCGLVAT  EQU   X'10'               VAT (SALES TAX) POSTINGS REQUIRED            
BCGLPST  EQU   X'08'               PST POSTINGS REQUIRED                        
BCGLOB2  DS    XL1                 GLOBAL INDICATORS 2                          
BCGLOB3  DS    XL1                 GLOBAL INDICATORS 3                          
BCGLOB4  DS    XL1                 GLOBAL INDICATORS 4                          
BCGLOB5  DS    XL1                 GLOBAL INDICATORS 5                          
BCGLOB6  DS    XL1                 GLOBAL INDICATORS 6                          
*                                                                               
BCVALS   DS    0XL2048             ** FOLLOWING DATA SAVED IN BSVALS **         
*                                                                               
CSVALS   DS    0XL512              ** CURRENT SESSION VALUES **                 
*                                                                               
CSINDSL  DS    0XL3                LOCAL SESSION INDICATORS                     
CSINDSL1 DS    XL1                 LOCAL SESSION INDICATORS - 1                 
CSIUSELC EQU   X'80'               USE CSLSTCUR FOR NESTED CALL                 
CSIRDSPC EQU   X'40'               RECORD DISPLAYED FOR CHANGE                  
CSIUENTK EQU   X'20'               USER INVITED TO ENTER KEY                    
CSIKPASS EQU   X'10'               NESTED KEY RESOLVED                          
CSIK1REQ EQU   X'08'               KEY 1 REQUESTED                              
CSIK1VAL EQU   X'04'               KEY 1 VALID                                  
CSIK2REQ EQU   X'02'               KEY 2 REQUESTED                              
CSIK2VAL EQU   X'01'               KEY 2 VALID                                  
CSINDSL2 DS    XL1                 LOCAL SESSION INDICATORS - 2                 
CSIRETRY EQU   X'80'               RETRY BATCH ADD AFTER ERROR                  
CSIRDSPD EQU   X'40'               RECORD DISPLAYED FOR DELETE                  
CSIACFRM EQU   X'20'               APPLICATION AWAITING CONFIRMATION            
CSIDPFQN EQU   X'10'               DISABLE QUIT AND NEXT PF KEYS                
CSIOVKEP EQU   X'08'               KEEP OVERLAY VALUES AT NTRSES/XITSES         
CSIMSGOK EQU   X'04'               MESSAGE SET BY OVERLAY                       
CSIPFAPP EQU   X'02'               APPLICATION CONTROLS PFKEYS                  
CSINDSL3 DS    XL1                 LOCAL SESSION INDICATORS - 3                 
*                                                                               
CSINDSG  DS    0XL3                GLOBAL SESSION INDICATORS                    
CSINDSG1 DS    XL1                 GLOBAL SESSION INDICATORS - 1                
CSINDBHD EQU   X'80'               BATCH HEADER ADDED                           
CSINDUNW EQU   X'40'               UNWIND VIA $ABEND PENDING                    
CSINDIUP EQU   X'01'               INSTANT UPDATE BATCH                         
CSINDSG2 DS    XL1                 GLOBAL SESSION INDICATORS - 2                
CSINDSG3 DS    XL1                 GLOBAL SESSION INDICATORS - 3                
*                                                                               
CSLSTCUR DS    XL(LSTTABL)         CURRENT LIST TABLE ENTRY                     
CSCURT1  DS    XL7                 CURRENCY TABLE ENTRY - 1                     
CSCURT2  DS    XL7                 CURRENCY TABLE ENTRY - 2                     
CSCURT3  DS    XL7                 CURRENCY TABLE ENTRY - 3                     
CSCURULE DS    XL1                 CURRENT BATCH TYPE CURRENCY RULES            
CSCUXRAT EQU   X'E0'               IF NO BIT ON, NO CURRENCY ALLOWED            
CSCUXRFT EQU   X'80'               FT EXCHANGE RATES PERMITTED                  
CSCUXRDF EQU   X'40'               DEFAULT EXCHANGE RATES PERMITTED             
CSCUXRIP EQU   X'20'               USER INPUT EXCHANGE RATES PERMITTED          
CSCUFCUR EQU   X'1C'               IF NO BIT ON, NO CURRENCY ALLOWED            
CSCUFBIL EQU   X'10'               COMPANY USES FC BILLING                      
CSCUFMCR EQU   X'08'               COMPANY USES FC MEDIA SUPPLIERS              
CSCUFOCR EQU   X'04'               COMPANY USES FC ACCOUNTING SUPPLIERS         
CSAPFMSK DS    XL2                 APPLICATION PFKEY MASK                       
         DS    XL32                N/D                                          
CSBINDS2 DS    0XL4                BATCH TYPE INDICATORS EXTENSION AREA         
CSBIND5  DS    XL1                 BATCH TYPE INDICATORS - 5                    
CSBIND6  DS    XL1                 BATCH TYPE INDICATORS - 6                    
CSBIND7  DS    XL1                 BATCH TYPE INDICATORS - 7                    
CSBIND8  DS    XL1                 BATCH TYPE INDICATORS - 8                    
CSSQRECN DS    XL2                 SEQUENTIAL TSAR RECORD NUMBER                
CSRECNAM DS    CL(RECNAMLQ)        LAST RECORD NAME                             
CSACTNAM DS    CL(ACTNAMLQ)        LAST ACTION NAME                             
CSBMAXIT DS    XL2                 MAXIMUM ITEMS ALLOWED IN BATCH               
CSBTYP   DS    XL1                 BATCH TYPE                                   
CSBTYP2  DS    XL1                 SECOND BATCH TYPE                            
CSBTYPN  DS    CL15                BATCH TYPE NAME                              
CSBGRUP  DS    CL1                 BATCH GROUP CODE                             
CSBINDS  DS    0XL4                BATCH TYPE INDICATORS                        
CSBIND1  DS    XL1                 BATCH TYPE INDICATORS - 1                    
CSBIND2  DS    XL1                 BATCH TYPE INDICATORS - 2                    
CSBIND3  DS    XL1                 BATCH TYPE INDICATORS - 3                    
CSBIND4  DS    XL1                 BATCH TYPE INDICATORS - 4                    
CSBPID   DS    0CL8                BATCHER PUBLIC-ID                            
CSBCHR   DS    CL8                 INPUT BATCHER                                
CSORDNO  DS    CL6                 ORDER NUMBER                                 
CSRECACT DS    0XL2                RECORD/ACTION NUMBER                         
CSREC    DS    XL1                 RECORD NUMBER                                
CSACT    DS    XL1                 ACTION NUMBER                                
CSSCRN   DS    XL1                 SCREEN NUMBER                                
CSOVER   DS    XL1                 OVERLAY NUMBER                               
CSMIX1   DS    XL1                 RECORD/ACTION INDICATORS - 1                 
CSMIX2   DS    XL1                 RECORD/ACTION INDICATORS - 2                 
CSMSGNUM DS    XL2                 MESSAGE NUMBER                               
CSMSGTYP DS    XL1                 MESSAGE TYPE                                 
CSNEXTPF DS    XL1                 NEXT TIME AUTO PFKEY VALUE                   
CSBITS   DS    XL1                 BATCH INPUT TYPE SCREEN                      
CSBITO   DS    XL1                 BATCH INPUT TYPE OVERLAY                     
CSCURDSP DS    AL2                 DISPLACEMENT TO CURSOR POSITION              
CSHIRECN DS    XL2                 HIGH TSAR RECORD NUMBER                      
CSLTINDS DS    XL1                 LIST/SELECT INDICATORS                       
CSLTIFST EQU   X'80'               FIRST TIME FOR NEW LIST                      
CSLTIEOF EQU   X'40'               END OF FILE ENCOUNTERED                      
CSLTIHLD EQU   X'20'               HOLD LIST PAGE THIS TIME                     
CSLTIEOL EQU   X'10'               SELECT TO END OF LIST ACTIVE                 
CSLTIEOP EQU   X'08'               SELECT TO END OF PAGE ACTIVE                 
CSLTIANY EQU   X'04'               AT LEAST ONE LINE PROCESSED                  
CSLTICFM EQU   X'02'               CONFIRMATION SCREEN LOADED                   
CSLSTNUM DS    XL1                 NUMBER OF ENTRIES IN LIST PAGE               
CSPSRECN DS    XL2                 HIGH TSAR NUMBER PREVIOUS SESSION            
CSSEL#LO DS    XL2                 MULTI-SELECT LOW RECORD NUMBER               
CSSEL#HI DS    XL2                 MULTI-SELECT HIGH RECORD NUMBER              
CSSELCUR DS    AL2                 DISPLACEMENT TO CURRENT SELTAB ENTRY         
CSSELMUL DS    AL2                 DISPLACEMENT TO MULTI-SELECT ENTRY           
CSSELACT DS    AL2                 DISPLACEMENT TO TWA ACTION FIELD             
CSSELREM DS    XL1                 NUMBER OF LINES REMAINING ON SCREEN          
CSBMAXAM DS    PL8                 MAXIMUM INPUT AMOUNT ALLOWED                 
CSNXRECN DS    XL2                 HIGH TSAR NUMBER NEXT SESSION                
CSINITRA DS    XL2                 INITIATOR REC/ACT FOR SIDEWAYS CALLS         
CSPAG#LO DS    XL2                 LOW RECORD NUMBER FOR CURRENT PAGE           
CSPAG#HI DS    XL2                 HIGH RECORD NUMBER FOR CURRENT PAGE          
CSQRTN   DS    XL1                 RETURN ROUTINE FROM QUIT                     
CSSPROG  DS    XL1                 OVERLAY SUB-PROGRAM (SEE PFKSPROG)           
CSBSECL  DS    XL1                 BATCH SECURITY LEVEL                         
CSOMODE  DS    XL1                 OVERLAY MODE                                 
CSOMPCHA EQU   1                   PREPARE ITEM/CHANGE                          
CSOMDCHA EQU   2                   DO ITEM/CHANGE                               
CSOMPLIN EQU   3                   ERASE/PROTECT INPUT SCREEN LINE              
CSOMSSCR EQU   4                   SUB-SCREEN ACTIVE                            
CSOLINE  DS    XL1                 THIS TIME OVERLAY SCREEN LINE NUMBER         
*                                  SUB-SCREEN ORIGINAL HIGH RECORD NO.          
CSOLINEL DS    XL1                 LAST TIME OVERLAY SCREEN LINE NUMBER         
CSOIND1  DS    XL1                 INTERNAL INDICATOR - 1                       
CSOIND2  DS    XL1                 INTERNAL INDICATOR - 2                       
CSSUBACT DS    XL1                 SUB-ACTION NUMBER (SEE PFKSUBA)              
CSBMAXIU DS    XL2                 MAXIMUM ITEMS ALLOWED FOR UPDATE             
CSREPID  DS    CL3                 PRINT QUEUE REPORT-ID                        
CSDSTID  DS    XL2                 PRINT QUEUE USER-ID                          
CSOFFICE DS    CL2                 OFFICE CODE                                  
CSFORMAT DS    CL1                 BILL FORMAT CODE                             
CSCPYCUR DS    CL3                 COMPANY CURRENCY CODE                        
CSBILCUR DS    CL3                 BILLING CURRENCY CODE                        
CSEXCVAL DS    0XL7                EXCHANGE RATE VALUES                         
CSEXCIND DS    XL1                 EXCHANGE STATUS                              
CSEXCIFT EQU   X'80'               FT RATE                                      
CSEXCIFE EQU   X'08'               FROM CURRENCY IS EURO MEMBER                 
CSEXCITE EQU   X'04'               TO CURRENCY IS EURO MEMBER                   
CSEXCRAT DS    PL5                 EXCHANGE RATE                                
CSEXCSHF DS    XL1                 EXCHANGE SHIFT                               
CSCURCPY DS    XL(CURTABL+L'CURTSHRT)                                           
CSCURBIL DS    XL(CURTABL+L'CURTSHRT)                                           
CSLSTMAX DS    XL1                 MAX. NUMBER OF LIST LINES ON SCREEN          
CSLINLEN DS    H                   LENGTH OF LIST LINE                          
CSHEDAD  DS    H                   DATA SCREEN ADDRESS OF 1ST HEADLINE          
CSHEDDSP DS    H                   DISPLACEMENT IN TWA OF 1ST HEADLINE          
CS1STLIN DS    H                   DISPLACEMENT IN TWA OF 1ST LIST LINE         
CS1STFTL DS    H                   DISPLACEMENT IN TWA OF 1ST FOOTLINE          
CSNUMFTL DS    XL1                 NUMBER OF FOOTLINES                          
CSSEL#   DS    XL1                 SELECT TABLE HEADER NUMBER                   
CSCLM#   DS    XL1                 COLUMN TABLE HEADER NUMBER                   
CSLHSRHS DS    0XL2                                                             
CSLHSDIS DS    XL1                 LEFT HAND SIDE COLUMN NUMBER                 
CSRHSDIS DS    XL1                 RIGHT HAND SIDE COLUMN NUMBER                
CSBILNUM DS    CL6                 BILL NUMBER                                  
CSPAROFF DS    XL1                 PARAGRAPH OFFSET                             
CSMASK   DS    XL2                 (IN)VALID MASK VALUES                        
CSMORD   EQU   X'0001'             TRANSACTION IS AN ORDER                      
CSMEXT   EQU   X'0002'             TRANSACTION IS AN EXTRA BILLING              
CSMMAC   EQU   X'0004'             MATCHING IN AGENCY CURRENCY                  
CSPF#LIN DS    XL1                 NUMBER OF PFKEY LINES                        
CSPFLIN# DS    XL1                 CURRENT PFKEY LINE NUMBER DISPLAYED          
CSMINEXC DS    PL5                 MINIMUM EXCHANGE RATE (FOR CSEXCRAT)         
CSMAXEXC DS    PL5                 MAXIMUM EXCHANGE RATE (FOR CSEXCRAT)         
CSTYPEXC DS    XL1                 EXCHANGE RATE TYPE (SEE JCBXTYP)             
CSDATEXC DS    XL2                 DATE EXCHANGE RATE SET                       
CSAPLBLK DS    0XL135              APPLICATION SPECIFIC BLOCK                   
CSBATBLK DS    0XL(L'CSAPLBLK)     * BATCH PROGRAM *                            
         DS    XL2                 N/D                                          
CSGIN    DS    XL4                 GROUP INVOICE NUMBER                         
CSSLOPGE DS    XL1                 SUB-SCREEN LOW PAGE NUMBER                   
CSSHIREC DS    XL1                 SUB-SCREEN CURRENT HIGH RECORD NO.           
CSSDELS  DS    XL1                 SUB-SCREEN DELETED RECORDS                   
CSSITOT  DS    PL6                 SUB-SCREEN INPUT TOTAL                       
CSRFORM  DS    XL1                 REPORT FORMAT                                
         ORG   CSBATBLK+L'CSBATBLK                                              
         ORG   CSAPLBLK                                                         
CSBILBLK DS    0XL(L'CSAPLBLK)     * BILL PROGRAM *                             
CSAOPTF  DS    XL2                 ACTOPTF (EXTRACTED FROM ACTTABD)             
CSFMLANG DS    CL1                 BILL FORMAT LANGUAGE                         
CSFEECUR DS    CL3                 CURRENCY OF FEE ADJUSTMENTS                  
*                                                                               
CSBROUT  DS    0A                  EXTRA ROUTINE ADDRESSES                      
CSBROUTN EQU   16                  MAX NUMBER OF EXTRA ROUTINES                 
CSBROUTS EQU   L'CSBROUT*CSBROUTN                                               
AFMTTXT  DS    A    (ACCLB41)      FORMAT TEXT FOR BILL (PC BILLING)            
AADVANCE DS    A    (ACCLB41)      PROCESS ADVANCE (PC BILLING)                 
AUPDPAN  DS    A    (ACCLB67)      UPDATE PANELS (PC BILLING)                   
AREVTRN  DS    A    (ACCLB41)      REVERSE BILLING ALLOCATION                   
         DS    (CSBROUTS-(*-CSBROUT))X                                          
CSJRNRID DS    CL3                 JOURNAL REPORT SUB-ID                        
CSJRNRNO DS    XL2                 JOURNAL REPORT NUMBER                        
         ORG   CSBILBLK+L'CSBILBLK                                              
         ORG   CSAPLBLK                                                         
CSCRDBLK DS    0XL(L'CSAPLBLK)     * CRED PROGRAM *                             
         ORG   CSCRDBLK+L'CSCRDBLK                                              
*                                                                               
         ORG   CSVALS+L'CSVALS                                                  
CSVALSL  EQU   *-CSVALS                                                         
*                                                                               
BCBPROF1 DS    0XL16               BATCH PROGRAM PROFILE - 1                    
BCBP01   DS    XL1                                                              
BCBP02   DS    XL1                                                              
BCBP03   DS    XL1                                                              
BCBP04   DS    XL1                                                              
BCBP05   DS    XL1                                                              
BCBP06   DS    XL1                                                              
BCBP07   DS    XL1                                                              
BCBP08   DS    XL1                                                              
BCBP09   DS    XL1                                                              
BCBP10   DS    XL1                                                              
BCBP11   DS    XL1                                                              
BCBP12   DS    XL1                                                              
BCBP13   DS    XL1                                                              
BCBP14   DS    XL1                                                              
BCBP15   DS    XL1                                                              
BCBP16   DS    XL1                                                              
*                                                                               
         DS    XL11                N/D                                          
BCCPYGLM DS    PL2                 GL START MOA OF NEW RECORDS                  
BCAPINDS DS    XL1                 APPLICATION INDICATORS                       
BCOFFLEN DS    XL1                 LENGTH OF OFFICE CODE                        
BCDPTLEN DS    XL1                 LENGTH OF DEPARTMENT CODE                    
BCTDATL  DS    PL3                 LOWEST TRANSACTION DATE                      
BCTDATH  DS    PL3                 HIGHEST TRANSACTION DATE                     
BCTODAYP DS    PL3                 TODAY PWOS            P'YYMMDD'              
BCTODAYC DS    XL2                 TODAY COMPRESSED                             
BCTODAYB DS    XL3                 TODAY BINARY          X'YYMMDD'              
BCTMONP  DS    PL2                 TODAY'S PWOS YYMM     P'9104'=APR91          
BCTMON   DS    CL2                 TODAY'S CHARACTER YM  C'14'=APR91            
BCMONTHS DS    CL36                C'JANFEBMAR ETC.'                            
BC@YES   DS    CL4                 C'YES'                                       
BC@NO    DS    CL4                 C'NO '                                       
BC@DR    DS    CL3                 C'DR '                                       
BC@CR    DS    CL3                 C'CR '                                       
BCCPYEL  DS    XL96                COMPANY ELEMENT                              
         ORG   BCCPYEL+(CPYSTAT1-CPYELD)                                        
BCCPYST1 DS    XL1                 COMPANY STATUS BYTE 1                        
         ORG   BCCPYEL+(CPYSTAT2-CPYELD)                                        
BCCPYST2 DS    XL1                 COMPANY STATUS BYTE 2                        
         ORG   BCCPYEL+(CPYSTAT3-CPYELD)                                        
BCCPYST3 DS    XL1                 COMPANY STATUS BYTE 3                        
         ORG   BCCPYEL+(CPYSTAT4-CPYELD)                                        
BCCPYST4 DS    XL1                 COMPANY STATUS BYTE 4                        
         ORG   BCCPYEL+(CPYSTAT5-CPYELD)                                        
BCCPYST5 DS    XL1                 COMPANY STATUS BYTE 5                        
         ORG   BCCPYEL+(CPYSTAT6-CPYELD)                                        
BCCPYST6 DS    XL1                 COMPANY STATUS BYTE 6                        
         ORG   BCCPYEL+(CPYSTAT7-CPYELD)                                        
BCCPYST7 DS    XL1                 COMPANY STATUS BYTE 7                        
         ORG   BCCPYEL+(CPYSTAT8-CPYELD)                                        
BCCPYST8 DS    XL1                 COMPANY STATUS BYTE 8                        
         ORG   BCCPYEL+(CPYSTAT9-CPYELD)                                        
BCCPYST9 DS    XL1                 COMPANY STATUS BYTE 9                        
         ORG   BCCPYEL+(CPYSTATA-CPYELD)                                        
BCCPYSTA DS    XL1                 COMPANY STATUS BYTE 10                       
         ORG   BCCPYEL+(CPYSFST-CPYELD)                                         
BCCPYFST DS    XL(L'CPYSFST)       COMPANY FININCIAL YEAR START                 
         ORG   BCCPYEL+(CPYCURR-CPYELD)                                         
BCCPYCUR DS    XL3                 COMPANY CURRENCY CODE                        
         ORG   BCCPYEL+(CPYPROD-CPYELD)                                         
BCCPYPRD DS    CL(L'CPYPROD)       PRODUCTION UNIT/LEDGER                       
         ORG   BCCPYEL+(CPYRECV-CPYELD)                                         
BCCPYREC DS    CL(L'CPYRECV)       RECEIVABLE UNIT/LEDGER                       
         ORG   BCCPYEL+(CPYBANK-CPYELD)                                         
BCCPYBNK DS    CL(L'CPYBANK)       BANK UNIT/LEDGER                             
         ORG   BCCPYEL+(CPYSUPP-CPYELD)                                         
BCCPYSUP DS    CL(L'CPYSUPP)       SUPPLIER UNIT/LEDGER                         
         ORG   BCCPYEL+(CPYVATR-CPYELD)                                         
BCCPYVAT DS    CL(L'CPYVATR)       COMPANY VAT RATES (OLD VAT)                  
         ORG   BCCPYEL+(CPYCURRS-CPYELD)                                        
BCCPYSEC DS    XL3                 COMPANY SECONDARY CURRENCY CODE              
         ORG   BCCPYEL+(CPYSCMOA-CPYELD)                                        
BCCPYSCM DS    PL2                 COMPANY SECONDARY START MONTH                
         ORG   BCCPYEL+(CPYOFFC-CPYELD)                                         
BCCPYOFF DS    PL2                 COMPANY OFFICE CODE                          
         ORG                                                                    
BCOFFSAV DS    XL(OFFASAVL)        SAVED OFFAL VALUES                           
BCTSLOWP DS    XL1                 TEMPEST LOW PAGE NUMBER                      
BCTSNUMP DS    XL1                 NUMBER OF TEMPEST PAGES ALLOCATED            
BCTSINDS DS    XL1                 TSAR INDICATORS                              
BCTSIINI EQU   X'80'               TEMPEST BUFFER INITIALISED                   
BCTSIRES EQU   X'40'               TEMPEST BUFFER RESTORED                      
BCTSHIGH DS    XL2                 TSAR HIGHEST RECORD NUMBER ADDED             
*                                                                               
BCLSTCUR DS    6XL(LSTTABL)        CURRENT LIST/RECORD ENTRIES                  
         ORG   BCLSTCUR                                                         
BCLSTLV1 DS    XL(LSTTABL)         LEVEL 1 LIST ENTRY                           
BCLSTLV2 DS    XL(LSTTABL)         LEVEL 2 LIST ENTRY                           
BCLSTLV3 DS    XL(LSTTABL)         LEVEL 3 LIST ENTRY                           
BCLSTLV4 DS    XL(LSTTABL)         LEVEL 4 LIST ENTRY                           
BCLSTLV5 DS    XL(LSTTABL)         LEVEL 5 LIST ENTRY                           
BCLSTLV6 DS    XL(LSTTABL)         LEVEL 6 LIST ENTRY                           
         ORG                                                                    
BCUSERID DS    CL8                 CONNECTED USER-ID CODE                       
BCSCRNUM DS    XL1                 SCROLL AMOUNT (LOW ORDER NIBBLE)             
BCBPROF2 DS    0XL16               BATCH PROGRAM PROFILE - 2                    
BCBPDIS  DS    XL10                BATCH LIST DISPLAY COLUMNS                   
BCBP27   DS    XL1                                                              
                                                                                
*&&UK                                                                           
BCORGNAM DS    CL33                CONNECTED USER-ID ORIGIN NAME                
BCORGADD DS    CL33                CONNECTED USER-ID ORIGIN ADDRESS             
BCDSTNAM DS    CL33                CONNECTED USER-ID DESTINATION NAME           
BCDSTAD1 DS    CL33                CONNECTED USER-ID DEST. ADDRESS - 1          
BCDSTAD2 DS    CL33                CONNECTED USER-ID DEST. ADDRESS - 2          
BCDSTAD3 DS    CL33                CONNECTED USER-ID DEST. ADDRESS - 3          
*                                                                               
VTOBACCO DS    V                   V(TOBACCO)                                   
ATOBCHA  DS    A                   CHANGE RECORD VIA TOBACCO (ACGEN6F)          
TOBCUR   DS    0CL6                TOBACCO CURRENCY INPUT/OUTPUT                
TOBCURI  DS    CL3                 TOBACCO CURRENCY INPUT (COMPANY CUR)         
TOBCURO  DS    CL3                 TOBACCO CURRENCY OUTPUT (SECONDARY)          
         DS    XL2                 N/D                                          
*&&                                                                             
*                                                                               
BCINVREF DS    CL20                INVOICE REFERENCE                            
BCINVDTE DS    XL3                 INVOICE DATE                                 
BCPARTSW DS    CL1                 ORDER PART SWITCH                            
         EJECT                                                                  
***********************************************************************         
* DEFINE NEW GLOBAL SAVE VALUES BEFORE BCLDGTAB - BEWARE OVERFLOW     *         
***********************************************************************         
         SPACE 1                                                                
         ORG   WORKD+4096-LDGTABL                                               
BCLDGTAB DS    (LDGTLEN)X          ** LEDGER TABLE **                           
         ORG   BCLDGTAB+(LDGTLVA-LDGTABD)                                       
BCCLILEN DS    XL1                 LENGTH OF CLIENT                             
BCPROLEN DS    XL1                 LENGTH OF CLIENT+PRODUCT                     
BCJOBLEN DS    XL1                 LENGTH OF CLIENT+PRODUCT+JOB                 
         ORG                                                                    
*                                                                               
PALAREA  DS    XL20                P&L BUCKET AREA                              
*                                                                               
         ORG   BCVALS+L'BCVALS                                                  
BCVALSL  EQU   *-BCVALS                                                         
*                                                                               
BCWSX    DS    0X                                                               
         EJECT                                                                  
*                                  ** I/O AREAS **                              
IOAREALN EQU   2000+L'IODA+L'IOWORK                                             
IOAREA1  DS    (IOAREALN)X                                                      
IOAREA2  DS    (IOAREALN)X                                                      
IOAREA3  DS    (IOAREALN)X                                                      
IOAREA4  DS    (IOAREALN)X                                                      
IOAREA5  DS    (IOAREALN)X                                                      
IOAREA6  DS    (IOAREALN)X                                                      
IOAREA7  DS    (IOAREALN)X                                                      
IOAREA8  DS    (IOAREALN)X                                                      
IOAREA9  DS    (IOAREALN)X                                                      
IOAREAA  DS    (IOAREALN)X                                                      
IOAREAS  EQU   (*-IOAREA1)/IOAREALN                                             
         SPACE 1                                                                
SWSTAB   DS    (SYSSWMAX)XL(SYSSWLEN)                                           
         SPACE 1                                                                
GOPBLK   DS    0D                  GETOPT BLOCK                                 
         DS    (GOBLOCKX-GOBLOCK)X                                              
GOXBLK   DS    0D                  GETOPT EXTENSION BLOCK                       
         DS    (GOXBLKX-GOXBLOCK)X                                              
OFFBLK   DS    0D                  OFFAL BLOCK                                  
         DS    (OFFALLEN)X                                                      
VATBLK   DS    0D                  VATICAN BLOCK                                
         DS    (VTCLNQ)X                                                        
ADTBLK   DS    0D                  ADDTRN BLOCK                                 
         DS    (TRNBLKL)X                                                       
JOBBLK   DS    0D                  JOBBER BLOCK                                 
         DS    (JBLOCKL)X                                                       
COLTABL  EQU   2400                                                             
COLTAB   DS    0D                  COLUMN TABLE                                 
         DS    (COLTABL)X                                                       
OPVTABL  EQU   1200                                                             
OPVTAB   DS    0D                  OUTPUT VALUES TABLE                          
         DS    (OPVTABL)X                                                       
         DS    0F                  TSAR BLOCK                                   
TSABLK   DS    (TSPNEWL)X                                                       
         SPACE 1                                                                
OVERWRK  DS    (4*1024)X           OVERLAY WORKING STORAGE                      
OVERWRKL EQU   *-OVERWRK                                                        
         DS    0D                                                               
WORKX    EQU   *                                                                
         EJECT                                                                  
***********************************************************************         
* TERMINAL WORK AREA DSECT                                            *         
***********************************************************************         
         SPACE 1                                                                
       ++INCLUDE FATWA                                                          
         ORG   TWAUSER                                                          
TWAVALS  DS    0XL(L'TWAUSER)      ** CONTROLLER SAVE AREA **                   
TWAMODE  DS    XL1                 OVERLAY MODE                                 
TWAINDS1 DS    XL1                 CONTROLLER INDICATORS - 1                    
TWAIINIT EQU   X'80'               INITIALISATION COMPLETE                      
TWAIHELP EQU   X'40'               SESSION SAVED FOR HELP                       
TWAINTRS EQU   X'20'               NTRSES ISSUED - REVALIDATE HEADER            
TWAIXITS EQU   X'10'               XITSES ISSUED - EXIT TO CALLER               
TWAIUPID EQU   X'08'               CONNECTED USER-ID IS PRINCIPAL               
TWAIUGID EQU   X'04'               CONNECTED USER-ID IS A GROUPID               
TWAIOHIP EQU   X'02'               OPTION HELP IN PROGRESS                      
TWAIOHRE EQU   X'01'               OPTION HELP AUTO RECALL                      
TWAINDS2 DS    XL1                 CONTROLLER INDICATORS - 2                    
TWAIRDFR EQU   X'80'               RECORD DISPLAYED FOR RENAME                  
TWAIDISH EQU   X'40'               DIS= HELP IN PROGRESS                        
TWAIDISG EQU   X'20'               DIS= HELP FOR GENERAL COLUMNS                
TWAIDPFK EQU   X'10'               DISABLE PFKEYS                               
TWAIAPPF EQU   X'08'               ONLY APPLICATION PFKEYS ACTIVE               
TWAINDS3 DS    XL1                 CONTROLLER INDICATORS - 3                    
TWAIPFKD EQU   X'80'               OFF=ACTION PFKEYS, ON=SCROLL PFKEYS          
TWAIFTAB EQU   X'40'               OUTPUT FLASHPOINT TAB                        
TWAINDS4 DS    XL1                 CONTROLLER INDICATORS - 4                    
TWAIGRID EQU   X'80'               FIS W/GRIDS IN EFFECT                        
TWASESNL DS    XL1                 CURRENT NESTING LEVEL                        
TWASESMX EQU   8                   MAXIMIUM NESTING LEVELS PERMITTED            
TWASCRN  DS    XL1                 CURRENT LOADED SCREEN                        
TWASCRF  DS    XL1                 FLAVOUR OF CURRENT LOADED SCREEN             
TWAHELPV DS    0X                  ** SAVED HELP VALUES **                      
TWAHELPT DS    XL1                 TYPE OF HELP IN PROGRESS                     
TWAHELPD DS    AL2                 DISP TO NEXT HELP ENTRY OR EFFS              
TWAHELPF DS    AL2                 DISP TO HELP FIELD IN TWA                    
TWAHELPL EQU   *-TWAHELPV          LENGTH OF SAVED HELP VALUES                  
TWASESRA DS    (TWASESMX)XL(L'CSRECACT)                                         
TWASELCT DS    XL2                 NUMBER OF SELECTED RECORDS                   
TWAOSAVE DS    CL1                 SAVED FIRST BYTE OF OPTION FIELD             
TWAAIND1 DS    XL1                 APPLICATION INDICATOR BYTE 1                 
TWAAIND2 DS    XL1                 APPLICATION INDICATOR BYTE 2                 
TWAINPT  DS    0XL6                RESERVERD FOR $INPUT USE                     
TWATYPE  DS    XL1                 INPUT TYPE NUMBER                            
TWATYP10 EQU   10                  TYPE 10                                      
TWATSAR  DS    XL1                 TSAR STATUS                                  
TWATSINI EQU   X'80'               TSAR INITIALIZED                             
TWATSRES EQU   X'40'               TSAR RESTORED                                
TWATSPGL DS    XL1                 LOW PAGE                                     
TWATSPGN DS    XL1                 NUMBER OF PAGES                              
         DS    XL2                 N/D                                          
TWAPPLIC DS    0X                  AVAILABLE TO APPLICATION                     
         ORG   TWAVALS+L'TWAVALS                                                
TWASCR   DS    0X                                                               
TWAMSGH  DS    XL8                 MESSAGE FIELD HEADER                         
TWAMSG   DS    CL60                MESSAGE FIELD                                
TWASRVH  DS    XL8                 SERVICE FIELD HEADER                         
TWASRV   DS    CL17                SERVICE FIELD                                
TWAPOLY  DS    0X                  PROGRAM/OVERLAY SCREEN                       
         ORG   TWAD+(3*1024)                                                    
*                                                                               
OSVALS   DS    700X                AVAILABLE TO OVERLAYS                        
OSVALSL  EQU   *-OSVALS                                                         
*                                                                               
OSSAVE   DS    256X                AVAILABLE TO OVERLAYS                        
OSSAVEL  EQU   *-OSSAVE                                                         
*                                                                               
BSVALS   DS    XL(L'BCVALS)        SAVED GLOBAL VALUES                          
*                                                                               
BSDICT   DS    3584X               DICTIONARY                                   
*                                                                               
OSVALS2  DS    512X                AVAILABLE TO OVERLAYS AS WELL                
OSVALS2L EQU   *-OSVALS2                                                        
*                                                                               
SECBLK   DS    1024X               SECURITY ACCESS BLOCK (SEE SECD)             
SECBLKL  EQU   *-SECBLK                                                         
*                                                                               
         ORG   TWAD+TWAMAX-2048  ORG TO USER END OF TWA0                        
TWAX     EQU   *                                                                
         EJECT                                                                  
***********************************************************************         
* REPORT MONITOR WORK AREA DSECT                                      *         
***********************************************************************         
         SPACE 1                                                                
REPD     DSECT                                                                  
       ++INCLUDE FAREPBLK                                                       
         EJECT                                                                  
REPHS    DS    0CL132              ** REPORT HEAD LINES **                      
REPH1    DS    CL132                                                            
REPH2    DS    CL132                                                            
REPH3    DS    CL132                                                            
REPH4    DS    CL132                                                            
REPH5    DS    CL132                                                            
REPH6    DS    CL132                                                            
REPH7    DS    CL132                                                            
REPH8    DS    CL132                                                            
REPH9    DS    CL132                                                            
REPHA    DS    CL132                                                            
REPHB    DS    CL132                                                            
REPHC    DS    CL132                                                            
REPHD    DS    CL132                                                            
REPHE    DS    CL132                                                            
REPHN    EQU   (*-REPHS)/L'REPHS                                                
*                                                                               
REPMS    DS    0CL132              ** REPORT MID LINES **                       
REPM1    DS    CL132                                                            
REPM2    DS    CL132                                                            
REPM3    DS    CL132                                                            
REPM4    DS    CL132                                                            
REPMN    EQU   (*-REPMS)/L'REPMS                                                
*                                                                               
REPPS    DS    0CL132              ** REPORT PRINT LINES **                     
REPP1    DS    CL132                                                            
REPP2    DS    CL132                                                            
REPP3    DS    CL132                                                            
REPP4    DS    CL132                                                            
REPP5    DS    CL132                                                            
REPP6    DS    CL132                                                            
REPP7    DS    CL132                                                            
REPP8    DS    CL132                                                            
REPP9    DS    CL132                                                            
REPPA    DS    CL132                                                            
REPPB    DS    CL132                                                            
REPPC    DS    CL132                                                            
REPPD    DS    CL132                                                            
REPPE    DS    CL132                                                            
REPPN    EQU   (*-REPPS)/L'REPPS                                                
*                                                                               
REPFS    DS    0XL132              ** REPORT FOOT LINES **                      
REPF1    DS    CL132                                                            
REPF2    DS    CL132                                                            
REPFN    EQU   (*-REPFS)/L'REPFS                                                
*                                                                               
REPX     EQU   *                                                                
         EJECT                                                                  
SESD     DSECT                     ** SESSION SAVE DSECT **                     
SESROUT  DS    XL1                 SAVED ROUTINE NUMBER FOR RETURN              
SESSCRN  DS    XL1                 SAVED TWASCRN AREA                           
SESSCRF  DS    XL1                 SAVED TWASCRF AREA                           
SESOSSV  DS    XL(OSVALSL)         SAVED APPLICATION WORK AREA                  
SESOSSVL EQU   *-SESOSSV                                                        
SESO2SV  DS    XL(OSVALS2L)        SAVED APPLICATION WORK AREA                  
SESO2SVL EQU   *-SESO2SV                                                        
SESCSSV  DS    XL(CSVALSL)         SAVED CURRENT SESSION VALUES                 
SESCSSVL EQU   *-SESCSSV                                                        
SESSCRSV DS    XL10                SAVED UTL SCREEN MAP                         
SESLSSV  DS    XL(1536)            SAVED LIST SUB-CONTROLLER WORK AREA          
SESLSSVL EQU   *-SESLSSV                                                        
SESCPJ   DS    XL(4*LSTTABL)       SAVED CLIENT/PRODUCT/JOB INFO                
SESCPJL  EQU   *-SESCPJ =BILL                                                   
         ORG   SESD+4095                                                        
SESTWSV  DS    (3*1024)X           SAVED TWA                                    
SESTWSVL EQU   *-SESTWSV                                                        
         SPACE 1                                                                
* ACLDGTABD                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACLDGTABD                                                      
LDGTMAXN EQU   20                                                               
LDGTLEN  EQU   (LDGTMAXN*LDGTABL)+1                                             
         PRINT ON                                                               
         SPACE 1                                                                
* ACMSGEQUS                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACMSGEQUS                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* ACGENFILE                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACGENFILE                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* FAXTRAINF                                                                     
         PRINT OFF                                                              
       ++INCLUDE FAXTRAINF                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* ACGENRAC                                                                      
         PRINT OFF                                                              
       ++INCLUDE ACGENRAC                                                       
         PRINT ON                                                               
         SPACE 1                                                                
* ACOFFALD                                                                      
         PRINT OFF                                                              
       ++INCLUDE ACOFFALD                                                       
         PRINT ON                                                               
         SPACE 1                                                                
* ACGOBLOCK                                                                     
         PRINT OFF                                                              
GOBLOCKD DSECT                                                                  
       ++INCLUDE ACGOBLOCK                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* ACGOXBLOCK                                                                    
         PRINT OFF                                                              
GOXBLKD  DSECT                                                                  
       ++INCLUDE ACGOXBLOCK                                                     
         PRINT ON                                                               
         SPACE 1                                                                
* ACVATICAND                                                                    
         PRINT OFF                                                              
       ++INCLUDE ACVATICAND                                                     
         PRINT ON                                                               
         SPACE 1                                                                
* ACJOBBERD                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACJOBBERD                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* ACJOBBLOCK                                                                    
         PRINT OFF                                                              
JOBLOCKD DSECT                                                                  
       ++INCLUDE ACJOBBLOCK                                                     
         PRINT ON                                                               
         SPACE 1                                                                
* ACADDTRND                                                                     
         PRINT OFF                                                              
ADDTRND  DSECT                                                                  
       ++INCLUDE ACADDTRND                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* ACLDCPTRD                                                                     
         PRINT OFF                                                              
CPTRBLKD DSECT                                                                  
       ++INCLUDE ACLDCPTRD                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* DDTSARD                                                                       
         PRINT OFF                                                              
       ++INCLUDE DDTSARD                                                        
         PRINT ON                                                               
         SPACE 1                                                                
* ACBMONVALD                                                                    
         PRINT OFF                                                              
       ++INCLUDE ACBMONVALD                                                     
         PRINT ON                                                               
         SPACE 1                                                                
* TRNELD EXTENSION FOR BILLING                                                  
         PRINT OFF                                                              
TRNELD   DSECT                                                                  
         ORG   TRNNARR                                                          
TRNDESC  DS    CL15                DESCRIPTION (50% ESTIMATE ETC.)              
TRNLNDQ  EQU   *-TRNELD            LENGTH OF SHORT ELEMENT                      
TRNLACCS EQU   6                                                                
TRNCOMM  DS    PL(TRNLACCS)        COMMISSION BILLED                            
TRNGRSS  DS    0PL6                                                             
TRNGRSXR DS    PL(TRNLACCS)        GROSS BILLED AT VAT RATE EXEMPT              
TRNGRSZR DS    PL(TRNLACCS)        GROSS BILLED AT VAT RATE NIL                 
TRNGRSR1 DS    PL(TRNLACCS)        GROSS BILLED AT VAT RATE RATE 1              
TRNGRSR2 DS    PL(TRNLACCS)        GROSS BILLED AT VAT RATE RATE 2              
TRNGRSR3 DS    PL(TRNLACCS)        GROSS BILLED AT VAT RATE RATE 3              
TRNGRSR4 DS    PL(TRNLACCS)        GROSS BILLED AT VAT RATE RATE 4              
TRNGRSR5 DS    PL(TRNLACCS)        GROSS BILLED AT VAT RATE RATE 5              
TRNGRSN  EQU   (*-TRNGRSS)/L'TRNGRSS                                            
TRNVATS  DS    0PL6                                                             
TRNVATR1 DS    PL(TRNLACCS)        V.A.T BILLED AT VAT RATE RATE 1              
TRNVATR2 DS    PL(TRNLACCS)        V.A.T BILLED AT VAT RATE RATE 2              
TRNVATR3 DS    PL(TRNLACCS)        V.A.T BILLED AT VAT RATE RATE 3              
TRNVATR4 DS    PL(TRNLACCS)        V.A.T BILLED AT VAT RATE RATE 4              
TRNVATR5 DS    PL(TRNLACCS)        V.A.T BILLED AT VAT RATE RATE 5              
TRNVATN  EQU   (*-TRNVATS)/L'TRNVATS                                            
TRNLNBDQ EQU   *-TRNDESC           LENGTH OF BILLING DETAIL                     
TRNLNBQ  EQU   *-TRNELD            LENGTH OF BILLING ELEMENT                    
         PRINT ON                                                               
         SPACE 1                                                                
* DDCTRYEQUS                                                                    
         PRINT OFF                                                              
       ++INCLUDE DDCTRYEQUS                                                     
CTRYNOT  EQU   X'80'                                                            
CTRYALL  EQU   0                                                                
         PRINT ON                                                               
         SPACE 1                                                                
* DDCURTABD                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDCURTABD                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* DDLANGEQUS                                                                    
         PRINT OFF                                                              
       ++INCLUDE DDLANGEQUS                                                     
         PRINT ON                                                               
         SPACE 1                                                                
* FAGETTXTD                                                                     
         PRINT OFF                                                              
       ++INCLUDE FAGETTXTD                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* FATIOB                                                                        
         PRINT OFF                                                              
       ++INCLUDE FATIOB                                                         
         PRINT ON                                                               
         SPACE 1                                                                
* DDPERVALD                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDPERVALD                                                      
         PRINT ON                                                               
* ACTOBACCOD                                                                    
         PRINT OFF                                                              
       ++INCLUDE ACTOBACCOD                                                     
         PRINT ON                                                               
* DDEUREKAD                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDEUREKAD                                                      
         POP   PRINT                                                            
