*          DATA SET ACGETRATEC AT LEVEL 038 AS OF 06/19/08                      
RATESTRT DS    0A                                                               
RDATAMGR DS    A                   A(DATAMGR)                                   
RTOBACCO DS    A                   A(TOBACCO) - UK ONLY                         
RCASHVAL DS    A                   A(CASHVAL) - UK ONLY                         
RCOMFACS DS    A                   A(COMFACS) - UK ONLY                         
RAT1CMPY DS    XL1                 COMPANY CODE                                 
RAT1ROFF DS    CL2                 OFFICE CODE                                  
RAT1RDPT DS    CL3                 DEPARTMENT CODE                              
RAT1RSUB DS    CL2                 SUBDEPARTMENT CODE                           
RAT1RPER DS    CL7                 PERSON CODE                                  
RATSJCPJ DS    0CL12               SJ CLI/PRD/JOB                               
RATSJCLI DS    CL3                 CLIENT                                       
RATSJPRD DS    CL3                 PRODUCT                                      
RATSJJOB DS    CL6                 JOB                                          
RATSJOFF DS    CL2                 CLIENT OFFICE                                
RATSJTSK DS    CL2                 TASK CODE                                    
RATCRDTE DS    PL3                 CURRENT DATE YYMMDD                          
RATSTAT  DS    XL1                                                              
RATEADJ  EQU   X'01'               ELIGIBLE FOR ADJUSTMENT RATE                 
RATSCOST EQU   X'02'               FIND COST RATE ONLY                          
RAT1RACT DS    CL12                FULL 1R ACCOUNT CODE                         
RAT1RLVS DS    0XL4                1R LEVEL LENGTHS                             
RAT1RL1  DS    XL1                                                              
RAT1RL2  DS    XL1                                                              
RAT1RL3  DS    XL1                                                              
RAT1RL4  DS    XL1                                                              
RATSJLVS DS    0XL3                SJ LEVEL LENGTHS                             
RATSJL1  DS    XL1                                                              
RATSJL2  DS    XL1                                                              
RATSJL3  DS    XL1                                                              
RATCTRY  DS    XL1                 COUNTRY CODE                                 
RATCFLG  DS    XL1                 CURRENCY FLAG                                
RATCSTAT DS    XL1                 COMPANY STATUS          - UK ONLY            
RATCURS  DS    0CL9                                        - UK ONLY            
RATCUR1  DS    CL3                 INPUT CURRENCY CODE     - UK ONLY            
RATCUR2  DS    CL3                 PRIMARY CURRENCY CODE   - UK ONLY            
RATCUR3  DS    CL3                 SECONDARY CURRENCY CODE - UK ONLY            
         DS    XL3                 N/D                                          
*                                                                               
**** RETURN FIELDS (ALL) ****                                                   
*                                                                               
RATSTAT2 DS    XL1                                                              
RATEFND  EQU   X'80'               A CHARGE RATE WAS FOUND                      
RATEWADJ EQU   X'40'               RATE WAS ADJUSTED                            
RATEFNDC EQU   X'20'               A COST RATE WAS FOUND                        
RATEHIST EQU   X'10'               HISTORY FOUND BUT MAYBE NO HRLY COST         
RATEEFFD DS    PL3                 EFFECTIVE DATE                               
RATEAMNT DS    PL4                 RATE                                         
*                                                                               
**** RETURN FIELDS (UK) ****                                                    
*                                                                               
RATEEFFC DS    PL3                 EFFECTIVE DATE (COST RATE)                   
RATEAMTC DS    PL4                 RATE (COST)                                  
RAT2AMNT DS    PL4                 EURO RATE                                    
RAT2AMTC DS    PL4                 EURO RATE (COST)                             
         DS    XL4                 N/D                                          
RATEDQ   EQU   *-RATESTRT                                                       
