*          DATA SET ACGENBOTH  AT LEVEL 021 AS OF 07/17/14                      
*        <   > DSECT TO COVER KEY, STATUS, LENGTH & FIRST DATA                  
*                                                                               
ACKEYD   DSECT                                                                  
ACKEYACC DS    CL15                ACCOUNT                                      
ACKEYWRK DS    CL2                 WORK CODE OR SPACES                          
ACKEYCON DS    CL15                CONTRA ACCOUNT                               
ACKEYDTE DS    PL3                 DATE (TRANSACTIONS)                          
ACKEYREF DS    CL6                 REFERENCE (TRANSACTIONS)                     
ACKEYSBR DS    CL1                 SUB-REF. (TRANSACTIONS)                      
         SPACE 1                                                                
ACLENGTH DS    CL2                 RECORD LENGTH                                
ACSTATUS DS    CL1                 STATUS BYTE (X'80' = DELETED)                
*                                              (X'40' = DRAFT XACTION)          
*                                              (X'10' = DEACTIVATED)            
*                                              (X'01' = REVERSED ITEM)          
ACDTUSED DS    CL2                 USED DATE (COMPRESSED)                       
ACDTPEEL DS    CL2                 PEEL DATE (COMPRESSED)                       
ACRECORD DS    0C                  FIRST ELEMENT ADDRESS                        
         SPACE 1                                                                
*        DS    CL1       B         ELEMENT CODE                                 
*        DS    CL1       B         ELEMENT LENGTH                               
*        DS    VARIABLE            ELEMENT DATA                                 
*        DS    CL1       B         X'00' END OF RECORD                          
         SPACE 1                                                                
*        <   > PRODUCTION ORDER RECORD TYPE                                     
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACOKEY   DS    0CL42                                                            
ACOKCODE DS    CL1       B         RECORD TYPE X'1A'                            
ACOKCODQ EQU   X'1A'                                                            
ACOKCOMP DS    CL1       B         COMPANY CODE                                 
ACOKOFF  DS    CL1       B         NULL - SPARE FOR OFFICE                      
ACOKMED  DS    CL1       B         NULL - SPARE FOR MEDIA                       
ACOKNUM  DS    CL6       C         ORDER NUMBER (000000 = CONTROL REC)          
ACOKSEQ  DS    CL1       C         ORDER RECORD SEQUENCE NUMBER                 
         DS    CL31      B         NULLS                                        
ACORDMCH EQU   X'40'               ORDER IS FULLY MATCHED                       
ACORDDEL EQU   X'20'               ORDER IS LOGICALLY DELETED                   
ACORDPHS EQU   X'80'               ORDER TO BE PHYSICALLY DELETED               
         SPACE 1                                                                
*        <   > BUDGET RECORD TYPE                                               
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACBTKEY  DS    0CL42                                                            
ACBTKTYP DS    CL1       B         RECORD TYPE                                  
ACBTKTEQ EQU   X'1B'                                                            
*                                  BUDGET TYPE RECORDS                          
ACBTKCMP DS    CL1       B         COMPANY CODE                                 
         DS    CL1       B         BINARY ZERO                                  
ACBTKNO1 DS    CL2       B         BUDGET NUMBER OR ZERO                        
ACBTKCOD DS    CL10      C         BUDGET CODE                                  
ACBTKNO2 DS    CL2       B         BUDGET NUMBER OR ZERO                        
         DS    CL25      B         SPARE (BINARY ZEROES)                        
*                                  BUDGET RECORDS                               
         ORG   ACBTKCMP                                                         
ACBTKACC DS    CL15      C         ACCOUNT CODE                                 
ACBTKWRK DS    CL2       C         WORK CODE OR SPACES                          
ACBTKCON DS    CL15      C         CONTRA-ACCOUNT CODE                          
ACBTKBNO DS    CL2       B         BUDGET NUMBER                                
         DS    CL7       B         SPARE (BINARY ZEROES)                        
         SPACE 1                                                                
*        <   > LIST RECORD TYPE                                                 
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACLKEY   DS    0CL42                                                            
ACLKCODE DS    CL1       B         RECORD TYPE X'1D'                            
ACLKCEQU EQU   X'1D'                                                            
ACLKCOMP DS    CL1       B         COMPANY CODE.                                
ACLKLIST DS    CL5       C         LIST CODE.                                   
         DS    CL35                SPARE                                        
         SPACE 1                                                                
*        <   > CAST RECORD TYPE (TALENT)                                        
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACCAKEY  DS    0CL42                                                            
ACCACODE DS    CL1       B         RECORD TYPE X'22'                            
ACCAEQU  EQU   X'22'                                                            
ACCAAGNC DS    CL1       C         SIGN-ON CODE (IE. DPS X'7B')                 
ACCACOMP DS    CL1       C         COMPANY CODE(IE.WEC X'F6')                   
ACCAREF  DS    CL8       C         CAST LIST CODE                               
         DS    CL31                                                             
         SPACE 2                                                                
*        <   > CYCLE RECORD TYPE (TALENT)                                       
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACCYKEY  DS    0CL42                                                            
ACCYCODE DS    CL1       B         RECORD TYPE X'23'                            
ACCYEQU  EQU   X'23'                                                            
ACCYAGNC DS    CL1       C         SIGN-ON CODE (IE. DPS X'7B')                 
ACCYCOMP DS    CL1       B         COMPANY CODE(IE. WEC X'F6')                  
ACCYREF  DS    CL8       C         CYCLE CODE IF NOT ACTUAL COMMERCIAL          
         ORG   ACCYREF                                                          
ACCYCLI  DS    CL3       C         CLIENT CODE                                  
ACCYPRD  DS    CL3       C         PRODUCT CODE                                 
ACCYCOMM DS    CL6       C         COMMERCIAL CODE                              
ACCYREV  DS    CL8       C         CYCLE CODE                                   
ACCYLIFT DS    CL1       C         LIFT NUMBER OR SPACE                         
ACCYLNQ2 EQU   *-ACCYREF                                                        
         DS    CL18                                                             
         SPACE 2                                                                
*        <   > GUARANTEE RECORD TYPE (TALENT)                                   
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACGUKEY  DS    0CL42                                                            
ACGUCODE DS    CL1       B         RECORD TYPE X'24'                            
ACGUEQU  EQU   X'24'                                                            
ACGUAGNC DS    CL1       B         SIGN-ON CODE (IE. DPS X'7B')                 
ACGUCOMP DS    CL1       B         COMPANY CODE(IE. WEC X'F6')                  
ACGUEMP  DS    CL3       C         EMPLOYER CODE                                
ACGUSSN  DS    CL9       C         PERFORMER S/S                                
ACGUUL   DS    CL2       C         COMMERCIAL UNIT/LEDGER                       
ACGUCLI  DS    CL3       C         CLIENT CODE                                  
ACGUSEQ  DS    CL1       B         SEQUENCE NUMBER                              
         DS    CL21                                                             
         SPACE 1                                                                
*        <   > AGENT POINTER RECORD TYPE  (TALENT)                              
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACAPKEY  DS    0CL42                                                            
ACAPCODE DS    CL1       B         RECORD TYPE X'25'                            
ACAPEQU  EQU   X'25'                                                            
ACAPAGY  DS    CL1       B         SIGN-ON CODE (IE. DPS X'7B')                 
ACAPCDE  DS    CL12      C         ALPHA CODE                                   
         DS    CL28                                                             
         SPACE 2                                                                
*        <   > AGENT RECORD TYPE  (TALENT)                                      
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACAGKEY  DS    0CL42                                                            
ACAGCODE DS    CL1       B         RECORD TYPE X'26'                            
ACAGEQU  EQU   X'26'                                                            
ACAGAGY  DS    CL1       B         SIGN-ON CODE (IE. DPS X'7B')                 
ACAGCDE  DS    CL5       C         NUMERIC CODE                                 
         DS    CL35                                                             
         SPACE 2                                                                
*        <   > MISCELLANEOUS WITHOLDINGS RECORD TYPE  (TALENT)                  
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACMWKEY  DS    0CL42                                                            
ACMWCODE DS    CL1       B         RECORD TYPE X'28'                            
ACMWEQU  EQU   X'28'                                                            
ACMWAGY  DS    CL1       B         SIGN-ON CODE (IE. DPS X'7B')                 
ACMWEMP  DS    CL3       C         EMPLOYER CODE                                
ACMWSSN  DS    CL9       C         PERFORMER S/S                                
ACMWSEQ  DS    CL1       B         SEQUENCE NUMBER                              
         DS    CL27                                                             
         SPACE 2                                                                
*        <   > ALPHA LOOK-UP W4 RECORDS  (TALENT)                               
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACALKEY  DS    0CL42                                                            
ACALCODE DS    CL1       B         RECORD TYPE X'29'                            
ACALEQU  EQU   X'29'                                                            
ACALAGY  DS    CL1       B         SIGN-ON CODE (IE. DPS X'7B')                 
ACALLAST DS    CL16      C         LAST NAME                                    
ACALFRST DS    CL16      C         FIRST NAME                                   
ACALEMP  DS    CL3       C         EMPLOYER                                     
ACALSSN  DS    CL4       B         S/S NUMBER (BINARY)                          
         DS    CL1                 N/D                                          
         SPACE 2                                                                
*        <   > CHARGE RATE RECORDS (PRODUCTION)                                 
         SPACE 1                                                                
         ORG   ACKEYD                                                           
*&&US                                                                           
ACCHKEY  DS    0CL42                                                            
ACCHCODE DS    CL1       B         RECORD TYPE X'2A'                            
ACCHEQU  EQU   X'2A'                                                            
ACCHCMP  DS    CL1       B         COMPANY                                      
ACCHDEP  DS    CL3       C         DEPARTMENT                                   
         ORG   ACCHDEP                                                          
ACCHDOF  DS    CL1                                                              
ACCHDPT  DS    CL2                                                              
         DS    XL1                 SPARE                                        
ACCHSUB  DS    CL2       C         SUB-DEPT                                     
ACCHSTF  DS    CL7       C         STAFF                                        
ACCHTSK  DS    CL2       C         TASK CODE                                    
ACCHOFF  DS    CL2       C         OFFICE CODE                                  
ACCHCLI  DS    CL3       C         CLIENT                                       
ACCHPRO  DS    CL3       C         PRODUCT                                      
         DS    CL(L'ACCHKEY-(*-ACCHKEY))  NOT USED                              
*&&                                                                             
         SPACE 1                                                                
*&&UK                                                                           
ACCHKEY  DS    0CL42                                                            
ACCHCODE DS    CL1       B         RECORD TYPE X'2A'                            
ACCHEQU  EQU   X'2A'                                                            
ACCHCMP  DS    CL1       B         COMPANY                                      
ACCHPER  DS    0CL12     C         FULL PERSONNEL KEY                           
ACCHDEP  DS    CL3       C         DEPARTMENT                                   
ACCHSUB  DS    CL2       C         SUB-DEPT                                     
ACCHSTF  DS    CL7       C         STAFF                                        
ACCHOFF  DS    CL1       C         OFFICE CODE                                  
ACCHCLI  DS    CL3       C         CLIENT                                       
ACCHPRO  DS    CL3       C         PRODUCT                                      
ACCHTSK  DS    CL2       C         TASK CODE                                    
         DS    CL19                NOT USED                                     
*&&                                                                             
         SPACE 2                                                                
*        <   > ESTIMATE RECORDS  (TALENT)                                       
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACNEKEY  DS    0CL42                                                            
ACNECODE DS    CL1                 RECORD TYPE X'2B'                            
ACNEEQU  EQU   X'2B'                                                            
ACNEAGY  DS    CL1                 AGENCY HEXCOMP (I.E. DPS=7B)                 
ACNECMP  DS    CL1                 COMPANY HEXCOMP (I.E. WEC=F6)                
ACNEUL   DS    CL2                 COMMERCIAL UNIT/LEDGER                       
ACNEOFF  DS    CL1                 OFFICE                                       
ACNETYPE DS    CL1                 SUB-RECORD TYPE                              
ACNETYFI EQU   C' '                FILE (SET-UP) RECORD                         
ACNETYRE EQU   C'R'                RESULTS RECORD                               
ACNENO   DS    CL12                ESTIMATE NUMBER                              
ACNEREV  DS    CL3                 REVISION NUMBER FOR RESULTS RECORDS          
         DS    CL1                 N/D                                          
ACNESEQ  DS    CL1                 SEQUENCE NUMBER                              
         DS    CL18                N/D                                          
         SPACE 2                                                                
*        <   > OFFICE GROUP AND OFFICE RECORDS (PRODUCTION)                     
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACOGKEY  DS    0CL42                                                            
ACOGRTYP DS    XL1                 RECORD TYPE X'2C'                            
ACOGEQU  EQU   X'2C'                                                            
ACOGSREC DS    XL1                 SUB RECORD  X'02' GROUP X'04' OFFICE         
ACOGOG   EQU   X'02'                                                            
ACOGOFF  EQU   X'04'                                                            
ACOGCUL  DS    CL3                 COMPANY/UNIT/LEDGER                          
ACOGCODE DS    CL1                 GROUP CODE                                   
         ORG   ACOGCODE                                                         
ACOGOFC  DS    CL2                 OFFICE CODE (TWO BYTES)                      
         SPACE 2                                                                
*        <   > MEDIA GROUP RECORDS (PRODUCTION)                                 
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACMGKEY  DS    0CL42                                                            
ACMGRTYP DS    XL1                 RECORD TYPE X'2C'                            
ACMGEQU  EQU   X'2C'                                                            
ACMGSREC DS    XL1                 SUB RECORD  X'06'                            
ACMGSEQU EQU   X'06'                                                            
ACMGCUL  DS    CL3                 COMPANY/UNIT/LEDGER                          
ACMGCODE DS    CL1                 MEDIA GROUP CODE                             
         SPACE 2                                                                
*        <   > WORK GROUP RECORDS (PRODUCTION)                                  
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACWGKEY  DS    0CL42                                                            
ACWGRTYP DS    XL1                 RECORD TYPE X'2C'                            
ACWGEQU  EQU   X'2C'                                                            
ACWGSREC DS    XL1                 SUB RECORD  X'08'                            
ACWGSEQU EQU   X'08'                                                            
ACWGCUL  DS    CL3                 COMPANY/UNIT/LEDGER                          
ACWGCODE DS    CL1                 WORK GROUP CODE                              
         SPACE 2                                                                
*        <   > USER FIELD SELECT RECORDS (PRODUCTION)                           
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACUFKEY  DS    0CL42                                                            
ACUFRTYP DS    XL1                 RECORD TYPE X'2C'                            
ACUFEQU  EQU   X'2C'                                                            
ACUFSREC DS    XL1                 SUB RECORD  X'10'                            
ACUFSEQU EQU   X'10'                                                            
ACUFCUL  DS    CL3                 COMPANY/UNIT/LEDGER                          
ACUFOG   DS    CL1                 OFFICE GROUP OR X'00'                        
ACUFOFC  DS    CL2                 OFFICE       OR X'00'                        
ACUFCLI  DS    CL6                 CLIENT       OR X'00'                        
ACUFPRO  DS    CL6                 PRODUCT      OR X'00'                        
ACUFMG   DS    CL1                 MEDIA GROUP  OR X'00'                        
ACUFMED  DS    CL1                 MEDIA        OR X'00'                        
ACUFJOB  DS    CL6                 JOB NUMBER   OR X'00'                        
         SPACE 2                                                                
*        <   > OPTION RECORDS (PRODUCTION)                                      
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACOPKEY  DS    0CL42                                                            
ACOPRTYP DS    XL1                 RECORD TYPE X'2C'                            
ACOPEQU  EQU   X'2C'                                                            
ACOPSREC DS    XL1                 SUB RECORD  X'20'                            
ACOPSEQU EQU   X'20'                                                            
ACOPCUL  DS    CL3                 COMPANY/UNIT/LEDGER                          
ACOPOG   DS    CL1                 OFFICE GROUP OR X'00'                        
ACOPOFC  DS    CL2                 OFFICE       OR X'00'                        
ACOPCLI  DS    CL6                 CLIENT       OR X'00'                        
ACOPPRO  DS    CL6                 PRODUCT      OR X'00'                        
ACOPJOB  DS    CL6                 JOB NUMBER   OR X'00'                        
ACOPMG   DS    CL1                 MEDIA GROUP  OR X'00'                        
ACOPMED  DS    CL1                 MEDIA        OR X'00'                        
ACOPWG   DS    CL1                 WORK GROUP   OR X'00'                        
ACOPWORK DS    CL2                 WORK CODE    OR X'00'                        
         SPACE 2                                                                
*        <   > JOB NUMBER RECORDS (PRODUCTION)                                  
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACJNKEY  DS    0CL42                                                            
ACJNRTYP DS    XL1                 RECORD TYPE X'2C'                            
ACJNEQU  EQU   X'2C'                                                            
ACJNSREC DS    XL1                 SUB RECORD  X'22'                            
ACJNSEQU EQU   X'22'                                                            
ACJNCUL  DS    CL3                 COMPANY/UNIT/LEDGER                          
ACJNOG   DS    CL1                 OFFICE GROUP OR X'00'                        
ACJNOFC  DS    CL2                 OFFICE       OR X'00'                        
ACJNCLI  DS    CL6                 CLIENT       OR X'00'                        
ACJNPRO  DS    CL6                 PRODUCT      OR X'00'                        
ACJNMG   DS    CL1                 MEDIA GROUP  OR X'00'                        
ACJNMED  DS    CL1                 MEDIA        OR X'00'                        
ACJNEFF  DS    XL3                 COMPLEMENT OF PWOS EFFECTIVE DATE            
         ORG   ACJNKEY+L'ACJNKEY                                                
         DS    CL2                 RECORD LENGTH                                
ACJNSTAT DS    XL1                                                              
ACJNDACT EQU   X'10'               RECORD IS DEACTIVATED                        
         SPACE 2                                                                
*        <   > SCHEME HEADER RECORDS                                            
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACSHKEY  DS    0CL42                                                            
ACSHRTYP DS    XL1                 RECORD TYPE X'2C'                            
ACSHEQU  EQU   X'2C'                                                            
ACSHSREC DS    XL1                 SUB RECORD  X'30'                            
ACSHSEQU EQU   X'30'                                                            
ACSHCUL  DS    CL3                 COMPANY/UNIT/LEDGER                          
ACSHCODE DS    CL8                 SCHEME HEADER CODE                           
         SPACE 2                                                                
*        <   > CATEGORY RECORDS                                                 
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACCTKEY  DS    0CL42                                                            
ACCTRTYP DS    XL1                 RECORD TYPE X'2C'                            
ACCTEQU  EQU   X'2C'                                                            
ACCTSREC DS    XL1                 SUB RECORD  X'32'                            
ACCTSEQU EQU   X'32'                                                            
ACCTCUL  DS    CL3                 COMPANY/UNIT/LEDGER                          
ACCTSCH  DS    CL8                 SCHEME HEADER CODE                           
ACCTCODE DS    CL2                 CATEGORY CODE                                
         SPACE 2                                                                
*        <   > PANEL RECORDS                                                    
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACPNKEY  DS    0CL42                                                            
ACPNRTYP DS    XL1                 RECORD TYPE X'2C'                            
ACPNEQU  EQU   X'2C'                                                            
ACPNSREC DS    XL1                 SUB RECORD  X'34'                            
ACPNSEQU EQU   X'34'               PANELS                                       
ACPNCUL  DS    CL3                 COMPANY/UNIT/LEDGER                          
ACPNCODE DS    CL4                 PANEL CODE                                   
ACPNNUM  DS    XL1                 0=HEADER REC.,1-N=FIELD DATA REC.            
ACPNLANG DS    XL1                 LANGUAGE                                     
         SPACE 2                                                                
*        <   > ESTIMATE VERSION RECORDS                                         
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACEVKEY  DS    0CL42                                                            
ACEVRTYP DS    XL1                 RECORD TYPE X'2C'                            
ACEVEQU  EQU   X'2C'                                                            
ACEVSREC DS    XL1                 SUB RECORD  X'36'                            
ACEVSEQU EQU   X'36'                                                            
ACEVCUL  DS    CL3                 COMPANY/UNIT/LEDGER                          
ACEVCLI  DS    CL6                 CLIENT CODE  (SPACE FILLED)                  
ACEVPROD DS    CL6                 PRODUCT CODE (SPACE FILLED)                  
ACEVJOB  DS    CL6                 JOB NUMBER   (SPACE FILLED)                  
ACEVTYPE DS    C                   ESTIMATE TYPE                                
ACEVPLN  EQU   C'P'                PLANNING                                     
ACEVREV  EQU   C'R'                REVISION                                     
ACEVERS  DS    X                   VERSION NUMBER (1-255)                       
         SPACE 2                                                                
*        <   > TEXT RECORDS                                                     
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACTXKEY  DS    0CL42                                                            
ACTXRTYP DS    XL1                 RECORD TYPE X'2C'                            
ACTXEQU  EQU   X'2C'                                                            
ACTXSREC DS    XL1                 SUB RECORD  X'38'                            
ACTXSEQU EQU   X'38'               TEXT                                         
ACTXCUL  DS    CL3                 COMPANY/UNIT/LEDGER                          
ACTXOG   DS    CL1                 OFFICE GROUP OR X'00'                        
ACTXOFC  DS    CL2                 OFFICE (2 BYTES) OR X'0000'                  
ACTXCLI  DS    CL6                 CLIENT CODE (SPACE FILLED) OR 6X'00'         
ACTXPROD DS    CL6                 PRODUCT CODE(SPACE FILLED) OR 6X'00'         
ACTXJOB  DS    CL6                 JOB NUMBER  (SPACE FILLED) OR 6X'00'         
ACTXMG   DS    CL1                 MEDIA GROUP OR X'00'                         
ACTXMED  DS    CL1                 MEDIA OR X'00'                               
ACTXCAT  DS    CL2                 CATEGORY OR X'0000'                          
ACTXWORK DS    CL2                 WORK CODE OR X'0000'                         
ACTXSUFF DS    CL1                 WORK CODE SUFFIX (C,N OR X'00')              
ACTXFORM DS    CL1                 FORM (B=BILL,E=ESTIMATE,P=PO)                
ACTXWHER DS    CL2                 T=TITLE TS=SUB-TITLE H=HEADER                
*                                  HS=SUB-HEADER F=FOOTER FS=SUB-FOOTER         
ACTXLANG DS    CL1                 LANGUAGE                                     
         SPACE 2                                                                
*        <   > GROUP BILLING RECORDS                                            
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACGBKEY  DS    0CL42                                                            
ACGBRTYP DS    XL1                 RECORD TYPE X'2C'                            
ACGBEQU  EQU   X'2C'                                                            
ACGBSREC DS    XL1                 SUB-RECORD                                   
ACGBSEQU EQU   X'3A'               GROUP BILLING                                
ACGBCOMP DS    XL1                 COMPANY                                      
ACGBCLI  DS    CL6                 CLIENT                                       
ACGBBILN DS    CL6                 BILL NUMBER                                  
ACGBBILD DS    PL3                 BILL DATE (9'S COMPLEMENT PWO)               
         DS    XL(L'ACGBKEY-(*-ACGBKEY))  SPARE                                 
ACGBUNBQ EQU   X'40'               GROUP BILL HAS BEEN UNBILLED                 
ACGBPTSQ EQU   X'20'               CREATED BY AC27 (PTS) BILLING                
ACGBPROQ EQU   X'10'               CREATED BY AC21 (PRODUCTION) BILLING         
         SPACE 2                                                                
*        <   > SALES/USE TAX RECORDS                                            
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACUTKEY  DS    0CL42                                                            
ACUTTYPE DS    XL1                 RECORD TYPE X'2D'                            
ACUTEQU  EQU   X'2D'                                                            
ACUTSREC DS    XL1                 SUB RECORD  X'01'                            
ACUTSEQU EQU   X'01'                                                            
ACUTCMP  DS    CL1                 COMPANY CODE                                 
ACUTLOC  DS    CL8                 LOCALITY CODE                                
*                                  HS=SUB-HEADER F=FOOTER FS=SUB-FOOTER         
         SPACE 2                                                                
*        <   > CLIENT STATEMENT DEFINITION RECORDS                              
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACCSKEY  DS    0CL42                                                            
ACCSTYPE DS    XL1                 RECORD TYPE X'2D'                            
ACCSEQU  EQU   X'2D'                                                            
ACCSSREC DS    XL1                 SUB RECORD  X'02'                            
ACCSSEQU EQU   X'02'                                                            
ACCSCMP  DS    CL1                 COMPANY CODE                                 
ACCSCDE  DS    CL8                 FORMAT CODE                                  
         SPACE 2                                                                
*        <   > INTERAGENCY RECEIVABLE RECORDS                                   
         ORG   ACKEYD                                                           
ACINKEY  DS    0CL42                                                            
ACINCOD  DS    CL1                 RECORD TYPE X'2D'                            
ACINEQU  EQU   X'2D'                                                            
ACINSREC DS    XL1                 SUB RECORD X'03'                             
ACINSEQU EQU   X'03'                                                            
ACINCUL  DS    0CL3                CUL                                          
ACINCOMP DS    CL1                                                              
ACINUL   DS    CL2                                                              
ACINACC  DS    CL12                ACCOUNT                                      
ACINCLT  DS    CL3                 CLIENT                                       
ACINPRD  DS    CL3                 PRODUCT                                      
ACINMED  DS    CL2                 MEDIA                                        
ACINEST  DS    CL6                 ESTIMATE                                     
ACINSUBL EQU   *-ACINCUL                                                        
         DS    CL11                SPARE                                        
         SPACE 2                                                                
*        <   > INTERAGENCY RECEIVABLE DAILY JOURNAL POINTER RECORDS             
         ORG   ACKEYD                                                           
ACDAKEY  DS    0CL42                                                            
ACDACOD  DS    CL1                 RECORD TYPE X'2D'                            
ACDAEQU  EQU   X'2D'                                                            
ACDASREC DS    XL1                 SUB RECORD X'04'                             
ACDASEQU EQU   X'04'                                                            
ACDADATE DS    PL3                 POSTING DATE YYMMDD                          
ACDACUL  DS    0CL3                CUL                                          
ACDACOMP DS    CL1                                                              
ACDAUL   DS    CL2                                                              
ACDAACC  DS    CL12                ACCOUNT                                      
ACDACLT  DS    CL3                 CLIENT                                       
ACDAPRD  DS    CL3                 PRODUCT                                      
ACDAMED  DS    CL2                 MEDIA                                        
ACDAEST  DS    CL6                 ESTIMATE                                     
         DS    CL8                 SPARE                                        
         SPACE 2                                                                
         ORG   ACKEYD                                                           
*        <   > INTEREST RATE BY 'AS OF DATE'                                    
ACRTKEY  DS    0CL42                                                            
ACRTCODE DS    CL1                 RECORD TYPE X'2D'                            
ACRTEQU  EQU   X'2D'                                                            
ACRTSREC DS    XL1                 SUB RECORD X'05'                             
ACRTSEQU EQU   X'05'                                                            
ACRTCOMP DS    CL1                 COMPANY CODE                                 
         DS    CL39                                                             
         SPACE 2                                                                
*        <   > PRICELIST RECORD TYPE X'2D' (GERMANY)                            
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACPRKEY  DS    0CL42                                                            
ACPRCODE DS    CL1       B         RECORD TYPE X'2D'                            
ACPREQU  EQU   X'2D'                                                            
ACPRCOMP DS    CL1       B         COMPANY CODE                                 
ACPRNUM  DS    CL4       C         PRICELIST NUMBER                             
         DS    CL36                SPARE                                        
         SPACE 2                                                                
*        <   > SPLIT BILLING RECORD TYPE X'2E' (GERMANY)                        
         SPACE 1                                                                
         ORG   ACKEYD                                                           
ACSBKEY  DS    0CL42                                                            
ACSBCODE DS    CL1       B         RECORD TYPE X'2E'                            
ACSBEQU  EQU   X'2E'                                                            
ACSBCOMP DS    CL1       B         COMPANY CODE                                 
ACSBCLI  DS    CL6       C         CLIENT CODE                                  
ACSBSCHM DS    XL1       B         SCHEME NUMBER (0-255)                        
ACSBSR   DS    CL15      C         RECEIVABLE ACCOUNT                           
         DS    CL18                SPARE                                        
         EJECT                                                                  
*              THE FOLLOWING ELEMENTS MAKE UP A RECORD                          
         SPACE 1                                                                
*      DSECT   ELEMENT CODE   ELEMENT TYPE     REMARKS                          
*      -----   ------- -----  ------- -----    -- -----                         
         SPACE 1                                                                
*      ACCONTD   X'04'        CONTROL                                           
         SPACE 1                                                                
*      ACBTCHD   X'06'        BATCH DESC       ONE FOR BATCH RECORD             
         SPACE 1                                                                
*      ACPTEMD   X'07'        BATCH ITEM       (PACKED AMOUNT)                  
         SPACE 1                                                                
*      ACITEMD   X'08'        BATCH ITEM       (BINARY AMOUNT)                  
         SPACE 1                                                                
*      ACBRD     X'09'        BATCH REF        USER OVERRIDE FOR JRNL           
         SPACE 1                                                                
*      ACCOMPD   X'10'        COMPANY          COMPANY RECORD ONLY              
*                                              CONTAINS LEDGER USAGE            
         SPACE 1                                                                
*      ACMEDIAD  X'11'        MEDIA            DESCRIBES MEDIA CATEGORY         
*                                              CODES                            
         SPACE 1                                                                
*      ACANALD   X'12'        ANALYSIS         DESCRIBES ANALYSIS CODES         
         SPACE 1                                                                
*      ACGRUPD   X'13'        GROUP            DEFINES GROUP                    
         SPACE 1                                                                
*      ACLEDGD   X'14'        LEDGER           PEEL OFF CONTROL                 
         SPACE 1                                                                
*      ACGENLD   X'15'        GEN.             GENERAL LEDGER POSTING           
*                                              INSTRUCTION ELEMENT              
         SPACE 1                                                                
*      ACHEIRD   X'16'        HIERARCHY        DESCRIBES CONTROL BREAKS         
         SPACE 1                                                                
*      ACHOD     X'17'        HOURS            HOURS FOR TIME SHEET             
         SPACE 1                                                                
*      ACMOSD    X'18'        MOS LOCK         LATEST LOCKED MONTH              
*                                              AND SEC LEVEL                    
         SPACE 1                                                                
*      ACBCD     X'1B'        BUDGET TYPE      NAME FOR COLUMN HEADING          
         SPACE 1                                                                
*      ACBVD     X'1C'        BUDGET TYPE      VALIDATION RULES                 
         SPACE 1                                                                
*      ACBAD     X'1D'        BUDGET           MONTH AMOUNT                     
         SPACE 1                                                                
*      ACLISTD   X'1E'        LIST TYPE        LIST TYPE & EXPIRY DATE          
         SPACE 1                                                                
*      ACLDATAD  X'1F'        LIST DATA        LIST OF ACCTS OR LEDGERS         
         SPACE 1                                                                
*      ACNAMED   X'20'        NAME             ACCOUNT DETAILS                  
         SPACE 1                                                                
*      ACNUMD    X'21'        NUMBER           SUBSIDIARY NUMBERS               
         SPACE 1                                                                
*      ACADDD    X'22'        ADDRESS          UP TO 4 LINES ADDRESS            
         SPACE 1                                                                
*      ACOTHERD  X'23'        OTHERS           NUMBERS AND AC PROFILES          
         EJECT                                                                  
*      DSECT   ELEMENT CODE   ELEMENT TYPE     REMARKS                          
*      -----   ------------   ------------     -------                          
         SPACE 1                                                                
*      ACPROFD   X'24'        PROFILE          FOR CLIENT/PRODUCT JOB           
         SPACE 1                                                                
*      ACNOD     X'25'        EXTRA NUMBER                                      
         SPACE 1                                                                
*      ACJOBD    X'26'        JOB              ADDITIONAL JOB DATA              
         SPACE 1                                                                
*      ACABILLD  X'27'        ACCT BILLING     ACCOUNT BILLING INFO.            
         SPACE 1                                                                
*      ACBLPD    X'28'        BILLING PRINT    COMMENTS FOR BILLING             
         SPACE 1                                                                
*      ACPMSTD   X'29'        PLANMASTER       INTERFACE TO PLANMASTER          
         SPACE 1                                                                
*      ACFTD     X'2A'        UK ARTIST        FOREIGN TAX NUMBER               
         SPACE 1                                                                
*      ACRBD     X'2B'        US RETAIL BILLING                                 
         SPACE 1                                                                
*      ACBNKD    X'2B'        BANK ACCOUNT DETAILS (UK)                         
         SPACE 1                                                                
*      ACSPECD   X'2C'        SPECIAL POSTING ACCOUNT                           
         SPACE 1                                                                
*      ACICPD    X'2D'        INTERCOMPANY POSTING ELEMENT                      
         SPACE 1                                                                
*      ACSTATD   X'30'        STATUS           D/A, STATUS, DATES               
         SPACE 1                                                                
*      ACFEED    X'31'        ARTIST FEES                                       
         SPACE 1                                                                
*      ACBALD    X'32'        BALANCE          B/F DR CR URGENT                 
*                                              ONLY FOR RECORDS AT              
*                                              LOW HEIRARCHY LEVEL              
         SPACE 1                                                                
*      ACPEELD   X'33'        PEEL-OFF                                          
         SPACE 1                                                                
*      ACBUDGD   X'34'        BUDGET                                            
         SPACE 1                                                                
*      ACESTD    X'35'        JOB ESTIMATE                                      
         SPACE 1                                                                
*      ACVATD    X'36'        VAT                                               
*                X'37'        FREELANCE TAX PCT (GERMANY)                       
*                X'38'        DISCOUNT                                          
         SPACE 1                                                                
*      ACEXPD    X'39'        COKE EXPENDITURE ELEMENT                          
         SPACE 1                                                                
*      ACPOOLD   X'3A'        POOL             BRAND ALLOCATIONS                
         SPACE 1                                                                
*      ACCBILLD  X'3B'        BILLING          CREATIVE BILLING                 
         SPACE 1                                                                
*      ACXPROFD  X'3C'        EXTRA PROFILE    SUPPLEMENTS ACPROFD              
         SPACE 1                                                                
*      ACSAND    X'3D'        SALES ANALYSIS                                    
         SPACE 1                                                                
*      ACOMMD    X'3E'        COMMENTS                                          
         SPACE 1                                                                
*      ACOLMD    X'3F'        ON-LINE MEMO DETAILS                              
         SPACE 1                                                                
*      ACPERSD   X'40'        PERSONNEL                                         
         SPACE 1                                                                
*      ACRULED   X'42'        RULES            DEFINES COMMISSION AND           
*                                              VAT RULES                        
         EJECT                                                                  
*      DSECT     CODE         ELEMENT TYPE     REMARKS                          
*      -----     ----         ------------     -------                          
         SPACE 2                                                                
*      TRSUBHD   X'43'        SUB-ACCOUNT      NAME OF SUB (CONTRA) ACC         
*      TRANSD    X'44'        TRANSACTION                                       
         SPACE 1                                                                
*      TRHISTD   X'45'        HISTORY SUB-ACC  ONE FOR EACH ACTIVE MON.         
         SPACE 1                                                                
*      TRPAYD    X'46'        PAY (US)         EXTRA INFO FROM SPOT AND         
*                                              PRINT PAYING INTERFACE           
         SPACE 1                                                                
*      TRPUKD    X'47'        PAY (UK)         EXTRA INFO FROM MEDLINE          
*                                              PAYING INTERFACE                 
         SPACE 1                                                                
*      TRBILLD   X'48'        BILLING          EXTRA PRODUCTION BILLING         
*                                              INFORMATION                      
         SPACE 1                                                                
*      REVD      X'49'        BILLING          REVERSE BILLING INFO             
         SPACE 1                                                                
*      TRXBILLD  X'4A'        BILLING          EXTRA SPOT/PRINT RETAIL          
*                                              BILLING INFORMATION              
         SPACE 1                                                                
*      TRBDETD   X'4B'        BILLING          BILL NO/DATE                     
         SPACE 1                                                                
*      TRSDESCD  X'4C'        SUBSID. POSTINGS DESCRIPTIVE ONLY                 
         SPACE 1                                                                
*      TRAUTHD   X'4D'        ORDER AUTH                                        
         SPACE 1                                                                
*      TRTRANSD  X'4E'        POSTING TRANSFER DETAILS                          
         SPACE 1                                                                
*      TRCPJD    X'4F'        CASH             CLIENT/PROD/JOB FOR UK           
*                                              CASHPAK POSTINGS                 
         SPACE 1                                                                
*      TRCASHD   X'50'        CASH             SUBSIDIARY CASH                  
         EJECT                                                                  
*      DSECT     CODE         ELEMENT TYPE     REMARKS                          
*      -----     ----         ------------     -------                          
         SPACE 2                                                                
*      ACPCD     X'51'        PROJECT          PROJECT CONTROL ELEMENT          
         SPACE 1                                                                
*      ACSALRYD  X'52'        SALARY           MONTHLY SALARY ELEMENT           
         SPACE 1                                                                
*      ACCHRGD   X'53'        TIME CHARGE      CHARGE OUT RATE FOR              
*                                              BILLABLE TIME SHEETS             
         SPACE 1                                                                
*      ACOFFD    X'54'        NUMBER           CHECK NUMBER BY OFFICE           
         SPACE 1                                                                
*      ACPBKD    X'55'        PRIOR CONTRA BUCKETS                              
         SPACE 1                                                                
*      ACXNAMD   X'56'        EXTRA NAME                                        
         SPACE 1                                                                
*      ACEMPD    X'56'        EMPLOYEE HISTORY HIRE AND TERM DATES              
         SPACE 1                                                                
*      ACPTRD    X'57'        ACCOUNT POINTER                                   
         SPACE 1                                                                
*      AIAD      X'58'        INT'L CURRENCY   CURR CODE & RATE ETC             
*                                              FROM MEDLINE                     
         SPACE 1                                                                
*      TRPRICED  X'59'        PRICELIST        GERMAN PRICELIST DATA            
         SPACE 1                                                                
*      ACEMPD    X'5A'        EMPLOYEE         EMPLOYEE HISTORY HIRE/           
*                                              TERMINATION (GERMANY)            
         SPACE 1                                                                
*      TRBILLGD  X'5B'        BILLING          EXTRA PRODUCTION BILLING         
*                                              INFORMATION FOR GERMANY          
         SPACE 1                                                                
*      TRBUDETD  X'5C'        UNBILL           UNBILL FOR CLIENT BILLS          
         SPACE 1                                                                
*      ACBSALD   X'5D'        SALARY           BUDGETTED SALARY ELEMENT         
         SPACE 1                                                                
*      ACCLPCTD  X'5E'        ALLOCATION       PERCENT OF CLIENT TIME           
         SPACE 1                                                                
*      ACTAXD    X'5F'        USE TAX          SALES AND USE TAX                
         SPACE 1                                                                
*      TRSTATD   X'60'        STATUS                                            
         SPACE 1                                                                
*      TRDUED    X'61'        DATE             DUE DATE FOR RECVBL              
*                                              OR PAYMENT DATE FOR              
*                                              GERMAN PAYEES                    
         EJECT                                                                  
*      DSECT     CODE         ELEMENT TYPE     REMARKS                          
*      -----     ----         ------------     -------                          
         SPACE 2                                                                
*      ACDISTD   X'62'        DISTRIBUTION     FOR DISTRIBUTION                 
*                                              SCHEME DETAILS                   
         SPACE 1                                                                
*      ACHOMED   X'63'        HOMES                                             
         SPACE 1                                                                
*      TRMAPD    X'64'        MANUAL PAYMENT   CHEQUE NO ETC FOR                
*                                              MANUALLY PAID INVOICE            
         SPACE 1                                                                
*      ACONUMD   X'66'        ORDER NUMBER     PROD'N ORDER CONTROL REC         
         SPACE 1                                                                
*      ACORDRD   X'67'        ORDER            PROD'N ORDER                     
         SPACE 1                                                                
*      ACOAMTD   X'68'        ORDER AMOUNT     PROD'N ORDER AND                 
*                                              JOB TRANSACTION                  
         SPACE 1                                                                
*      ACRULD    X'69'        FEES             FEE ACCOUNTING RULES             
         SPACE 1                                                                
*      ACASSD    X'6A'        ASSET            ASSET DESCRIPTION                
         SPACE 1                                                                
*      ACADISD   X'6B'        ASSET            DISPOSAL DATA                    
         SPACE 1                                                                
*      ACADPD    X'6D'        ASSET            DEPRECIATION CONTROL             
         SPACE 1                                                                
*      ACRATED   X'6E'        INTEREST RATE    INT RATE BY DATE                 
         SPACE 1                                                                
*      ACFILED   X'90'        TRAILER          GENERATION NUMBER                
         SPACE 1                                                                
*      GFESD     X'9B'        INTERFACE        GEN. FOODS ESTIAMTES             
         SPACE 1                                                                
*                X'A0'-X'BF'  PRODUCTION       RESERVED FOR PRODUCTION          
*                                                                               
*      ACAPD     X'C0'        POINTERS         ANALYSIS POINTERS                
         SPACE 1                                                                
*      RSHD      X'C1'        HEADLINE         RECEIVABLE STATEMENT             
         SPACE 1                                                                
*      RSRD      X'C2'        ROW              RECEIVABLE STATEMENT             
         SPACE 1                                                                
*      RSCD      X'C3'        COLUMN           RECEIVABLE STATEMNET             
         SPACE 1                                                                
*      RSPD      X'C4'        PROFILE          RECEIVABLE STATEMNET             
         SPACE 1                                                                
*      ACINPRFD  X'C6'        INTERAGENCY      INTERAGENCY REVEIVABLE           
*                                              PROFILE ELEMENT                  
         SPACE 1                                                                
*      ACINESTD  X'C7'        INTERAGENCY      INTERAGENCY REVEIVABLE           
*                                              ESTIMATE ELEMENT                 
         EJECT                                                                  
*        <   > DSECT TO COVER CONTROL ELEMENT                                   
         SPACE 1                                                                
ACCONTD  DSECT                                                                  
ACCONTEL DS    CL1       B         ELEMENT CODE X'04'                           
ACCONTLN DS    CL1       B         ELEMENT LENGTH X'0E'                         
ACCONCOT DS    PL6       P         COUNT (GEN OR REC)                           
ACCONDTE DS    CL6       A         DATE DUMPED (HEADER ONLY)                    
         ORG   ACCONDTE                                                         
ACCONLOD DS    CL2       B         LAST FILE LOAD DATE                          
ACCONUPS DS    CL2       B         LAST UPDATE RUN DATE                         
ACCONUND DS    CL2       B         LAST SUCCESSFUL UPDATE DATE                  
         SPACE 2                                                                
*        <   > KEY FOR BATCH HEADER RECORDS                                     
         SPACE 1                                                                
ACBKEYD  DSECT                                                                  
ACBKEY   DS    0CL42                                                            
ACBKCODE DS    CL1       B         RECORD TYPE X'0B'                            
ACBKCOMP DS    CL1       X         COMPANY CODE                                 
         DS    CL1       X         SPARE (ZERO)                                 
ACBKOFF  DS    CL2       X         OFFICE ID CODE                               
         DS    CL1       X         SPARE (ZERO)                                 
ACBKGRUP DS    CL1       C         INPUT TYPE GROUP                             
         DS    CL1       X         SPARE (ZERO)                                 
ACBKTYPE DS    CL1       B         INPUT TYPE                                   
ACBKDATE DS    CL3       P         BATCH DATE                                   
ACBKREF  DS    CL6       X         BATCH REFERENCE                              
ACBKEYL  EQU   *-ACBKEY            LENGTH OF KEY ZERO PADDED DATA               
         SPACE 2                                                                
*        <   > DSECT TO COVER BATCH DESCRIPTION ELEMENT                         
         SPACE 1                                                                
ACBTCHD  DSECT                                                                  
ACBHEL   DS    CL1       B         ELEMENT CODE X'06'                           
ACBHELQ  EQU   X'06'                                                            
ACBHLEN  DS    CL1       B         ELEMENT LENGTH X'19'                         
ACBHNAME DS    CL15      X         BATCH NAME                                   
ACBHCASH DS    PL6       P         BATCH CASH                                   
ACBHITEM DS    PL2       P         BATCH ITEM COUNT                             
ACBHLNQ  EQU   *-ACBTCHD                                                        
         SPACE 2                                                                
*        <   > DSECT TO COVER BATCH ITEMS (PACKED AMOUNT)                       
         SPACE 1                                                                
ACPTEMD  DSECT                                                                  
ACPTEL   DS    CL1       B         ELEMENT CODE X'07'                           
ACPTELQ  EQU   X'07'                                                            
ACPTLEN  DS    CL1       B         ELEMENT LENGTH X'12'                         
ACPTREF  DS    CL6       X         ITEM REFERENCE                               
ACPTAMNT DS    PL6       P         ITEM AMOUNT                                  
ACPTDA   DS    XL4       B         ITEM DISK ADDRESS                            
ACPTLNQ  EQU   *-ACPTEMD                                                        
         SPACE 2                                                                
*        <   > DSECT TO COVER BATCH ITEMS                                       
         SPACE 1                                                                
ACITEMD  DSECT                                                                  
ACITEL   DS    CL1       B         ELEMENT CODE X'08'                           
ACITLEN  DS    CL1       B         ELEMENT LENGTH X'10'                         
ACITREF  DS    CL6       X         ITEM REFERENCE                               
ACITAMNT DS    CL4       B         ITEM AMOUNT                                  
ACITDA   DS    CL4       B         ITEM DISK ADDRESS                            
         SPACE 2                                                                
*        <   > DSECT TO COVER USER BATCH REF OVERRIDE                           
         SPACE 1                                                                
ACBRD    DSECT                                                                  
ACBREL   DS    CL1       B         ELEMENT CODE X'09'                           
ACBRLEN  DS    CL1       B         ELEMENT LENGTH X'06'                         
ACBRCODE DS    CL4       X         OVERRIDE FOR BATCH REF +2                    
         SPACE 2                                                                
*        <   > DSECT TO COVER COMPANY ELEMENT                                   
         SPACE 1                                                                
ACCOMPD  DSECT                                                                  
ACMPEL   DS    CL1       B         ELEMENT CODE X'10'                           
ACMPELQ  EQU   X'10'                                                            
ACMPLEN  DS    CL1       B         ELEMENT LENGTH X'40'                         
ACMPABBR DS    CL7       A         ABBREVIATION FOR LOZENGE                     
ACMPNOMN DS    0CL2      X         UNIT/LEDGER FOR NOMINAL                      
ACMPGL   DS    CL1       X         UNIT FOR GENERAL LEDGER                      
ACMPBAL  DS    CL1       X         LEDGER FOR BALANCE SHEET                     
ACMPBANK DS    CL2       X         UNIT/LEDGER FOR BANK ACCOUNTS                
ACMPPETY DS    CL2       X                         PETTY CASH                   
ACMPJOB  DS    CL2       X                         CLIENT/PRODUCT/JOBS          
ACMPRECV DS    CL2       X                         RECEIVABLES                  
ACMPSUPP DS    CL2       X                         SUPPLIERS                    
ACMPSUPX DS    CL1       X         LEDGER CODE FOR SUPPLIER EXPENSE             
ACMPPNL  DS    CL1       X         LEDGER CODE FOR PROFIT AND LOSS              
ACMPANAL DS    CL1       X         UNIT CODE FOR ANALYSIS LEDGERS               
ACMPWCEX DS    CL1       X         1ST BYTE OF WORK CODES                       
*                                  WHICH REQUIRE STAFF INPUT                    
ACMPVATR DS    CL20      B         LIST OF VAT RULES (5*4 BYTES)                
*                                  BYTES 1-2 = RATE, 3-4 = DATE                 
ACMPSTAT DS    CL1       X         STATUS BYTE                                  
*                                  X'80' INVOICE/ORDER MATCH REQUIRED           
*                                  X'40' CHECK INVOICE CASH VS ESTIMATE         
*                                  X'20' OFFICE REQUIRED ON EXPENSES            
*                                  X'10' MAKE COSTING POSTINGS                  
*                                  X'08' C/D ON EXPENSES TO INCOME ACCT         
*                                  X'04' COMPANY ON GENERAL ACCOUNTING          
*                                  X'02' NO JOB LABELS                          
*                                  X'01' NO ESTIMATE TURNAROUND                 
ACMPID   DS    CL2       B         PRINCIPAL ID NUMBER                          
ACMPCD   DS    CL1       C         N=NO CASH DISCOUNT TO CLIENTS                
ACMPSTA2 DS    CL1       X         SECOND STATUS BYTE                           
*                                  X'80' EST. TURNAROUND ON PLAIN PAPER         
*                                  X'40' EST. TURNAROUND ACTUAL CHARGES         
*                                  X'20' SHOW EST. AND BILL. AMT ON             
*                                        LFM ESTIMATE SCREEN                    
*                                  X'10' EST TURNAROUND-DIFFERENCE OPTN         
*                                  X'08' CHECK INV NO./DATE/AMOUNT              
*                                        FOR DUPLICATE PAYMENTS                 
*                                  X'04' DEMAND VENDOR FOR BATCH 3,22           
*                                  X'02' CONTRA A/C ON JOBS FROM TYPE 3         
*                                        IS ALWAYS CASH ACCOUNT                 
*                                  X'01' EST. REQUIRED FOR TALENT PAY           
ACMPMOSX DS    CL1       C         LATEST CLOSED MONTH OF SERVICE               
*                                  (1-9,A,B OR C)                               
ACMPTENO DS    CL1       C         NO. OF BYTES FOR T/E CONTRA-A/C TO           
*                                  TAKE FROM RH END OF EXPENSE ACCOUNT          
ACMPSTA3 DS    CL1       X         THIRD STATUS BYTE                            
*                                  X'80' SX CONTRA/ACC. IS CLIENT               
*                                  X'40' DEMAND-W/O ACCOUNT ON TYPE 14          
*                                  X'20' PROJECT CONTROL = 1C                   
*                                  X'10' OPEN BATCH MONTH (*YM INPUT)           
*                                  X'08' CONTRA-AC ON SE POSTING FOR            
*                                        TYPE 22 IS CASH ACCOUNT                
*                                  X'04' PROJECT CONTROL = SJ                   
*                                  X'02' DPS-TYPE COMPANY (TALENT)              
*                                  X'01' BATCH SECURITY FOR 5 AND 45            
ACMPSTM  DS    CL1       X         START MONTH OF FINANCIAL YEAR                
*                                  (1-9,A,B OR C)                               
ACMPBSL  DS    CL1       X         BATCH SECURITY                               
*                                  X'01' VALIDATE ACCESS CODE(OFFICE)           
*                                  X'02' VALIDATE SECURITY LEVEL                
ACMPREPC DS    CL2       B         REP CODE FOR COMMISSION ONLY                 
ACMPSTA4 DS    CL1       X         FOURTH STATUS BYTE                           
*                                  X'80' POST %EST JOBS TO SK                   
*                                  X'40' BATCH ENTRIES CAN BE BACKDATED         
*                                        BY MORE THAN ONE YEAR.                 
* UK                               X'20' COMPANY WANTS INTERCOMPANY             
*                                        POSTINGS                               
* US                               X'20' CONVERTED TO NEW PRODUCTION            
*                                  X'10' USING NEW MI RECORDS FOR               
*                                        MEDIA INTERFACE                        
*                                  X'04' NEW BILLABLE TIME RATES IN USE         
*                                  X'01' CONVERTED TO NEW OFFICES               
ACMPBNUM DS    PL3                 CLIENT(CREATIVE BILL NUMBER)                 
ACMPALFA DS    CL2                 AGENCY ALPHA CODE                            
ACMPDPTL DS    CL1                 LENGTH OF DEPARTMENT CODES                   
ACMPLNQX EQU   *-ACCOMPD                                                        
ACMPPCFY DS    PL2                 PREVIOUS CLOSED FINANCIAL YEAR (MOS)         
ACMPCCFY DS    PL2                 CURRENT CLOSED FINANCIAL YEAR (MOS)          
ACMPSTA5 DS    XL1                 STATUS BYTE FIVE                             
ACMPOFPL EQU   X'80'               COMPANY USES OFFICES FOR P&L ONLY            
*&&UK                                                                           
ACMPNEWF EQU   X'40'               NEW ARTISTE FEE SYSTEM IN USE                
*&&                                                                             
ACMPBAPR EQU   X'20'               REGULAR BATCH APPROVAL                       
ACMPBAPE EQU   X'10'               APPROVAL FOR EFFECTIVE BATCHES REQD.         
ACMPNCST EQU   X'08'               NEW COST SYSTEM IN USE                       
ACMPSTA6 DS    XL1                 STATUS BYTE SIX                              
ACMPSTA7 DS    XL1                 STATUS BYTE SEVEN                            
ACMPSTA8 DS    XL1                 STATUS BYTE EIGHT                            
ACMPTAC  DS    CL2                 UNIT/LEDGER FOR TAX ACCOUNTS                 
ACMPOFFC DS    XL2                 GENERAL LEDGER DEFAULT OFFICE CODE           
ACMPTSD  DS    XL1                 TIMESHEET DAY (IN GETDAY # FORMAT)           
ACMPCURR DS    CL3                 COMPANY CURRENCY CODE                        
ACMPTBIN DS    CL1                 DISPLACEMENT TO SPECIAL CHARACTER            
*                                  THAT IS INSERTED BY BILLING ON SR            
*                                  TAX ONLY POSTINGS IN THE UK                  
ACMPXSUP DS    CL1                 EXTRA PROD SUPPLIER LEDGER CODE              
ACMPCFIL DS    XL2                 ALPHA CODE FOR MEDIA BUYS                    
ACMPLNQ  EQU   *-ACCOMPD                                                        
ACMPTCPY DS    XL1                 HEX CMP CODE FOR CONVERSION USE              
         DS    CL9                 SPARE                                        
ACMPLNQ2 EQU   *-ACCOMPD                                                        
         SPACE 2                                                                
*        <   > DSECT TO COVER MEDIA CATEGORY ELEMENT                            
         SPACE 1                                                                
ACMEDIAD DSECT                                                                  
ACMDEL   DS    CL1       B         ELEMENT CODE X'11'                           
ACMDELQ  EQU   X'11'                                                            
ACMDLEN  DS    CL1       X         ELEMENT LENGTH                               
ACMDCODE DS    CL1       X         MEDIA CODE (FIRST CHARACTER IN JOB)          
ACMDDESC DS    CL15      A         MEDIA DESCRIPTION                            
ACMDCOMM DS    CL15      X         COMMISSION ACCOUNT FOR BILLS                 
ACMDVTAC DS    CL15      X         VAT ACCOUNT FOR BILLS                        
         ORG   ACMDVTAC                                                         
ACMDCSHD DS    CL15      X         ACCOUNT FOR CASH DISCOUNT                    
ACMDFBIL DS    CL6       X         FIRST BILL NUMBER                            
ACMDLBIL DS    CL6       X         LAST BILL NUMBER                             
ACMDRSET DS    CL4       N         RESET BILL NUMBER                            
ACMDANAL DS    CL1       X         ANALYSIS CODE                                
ACMDSTAT DS    CL1       X         X'80' PRINT MEDIA NAME IN                    
*                                        BILLING HEADLINES                      
ACMDSTV  EQU   ACJBSTV   X         MEDIA IS TALENT MEDIA TV X'08'               
ACMDSRAD EQU   ACJBSRAD  X         MEDIA IS TALENT MEDIA RADIO, X'04'           
*&&US                                                                           
ACMDGRP  DS    CL1       C         MEDIA GROUP                                  
         DS    CL3                 SPARE                                        
ACMDLENQ EQU   *-ACMEDIAD          ELEMENT LENGTH                               
ACMDPRCD DS    CL15      X         ACCOUNT FOR PRINT C.D.                       
ACMDTWO  DS    CL15                TIME WRITE-OFF ACCOUNT                       
ACMDCOST DS    CL12      C         COST ANALYSIS CODE                           
ACMDLNQ2 EQU   *-ACMEDIAD          EXPANDED ELEMENT LENGTH                      
ACMDTIN  DS    CL15                TIME INCOME ACCOUNT                          
         DS    CL45                SPARE                                        
ACMDLNQ3 EQU   *-ACMEDIAD          EXPANDED (AGAIN) ELEMENT LENGTH              
*&&                                                                             
*&&UK                                                                           
ACMDGRP  DS    CL1                 MEDIA GROUP                                  
         DS    CL3                 SPARE                                        
ACMDLNQ1 EQU   *-ACMDEL                                                         
*                                                                               
*                                  BELOW ARE FOR GERMANY                        
*                                                                               
ACMDVAT2 DS    CL15      C         SECOND VAT ACC FOR NON-VATABLE CL.           
ACMDCOM2 DS    CL15      C         SECOND(INTERNAL) INCOME ACCOUNT              
ACMDFRL1 DS    CL15      C         FREELANCE TAX ACCOUNT NO.1                   
ACMDFRL2 DS    CL15      C         FREELANCE TAX ACCOUNT NO.2                   
ACMDANL2 DS    CL1       X         SECOND ANALYSIS CODE (INTERNAL)              
ACMDLNQ2 EQU   *-ACMDEL                                                         
*&&                                                                             
         SPACE 2                                                                
*        <   > DSECT TO COVER ANALYSIS ELEMENT                                  
         SPACE 1                                                                
ACANALD  DSECT                                                                  
ACANEL   DS    CL1       B         ELEMENT CODE                                 
ACANELQ  EQU   X'12'                                                            
ACANLEN  DS    CL1       B         ELEMENT LENGTH X'18'                         
ACANCODE DS    CL2       X         ANALYSIS CODE                                
ACANDESC DS    CL15      A         ANALYSIS DESCRIPTION                         
ACANSTAT DS    CL1       X         X'80' SUPPRESS INVOICE DETAIL                
*                                  X'40' SUPPRESS DETAIL ON P1 REPORT           
* UK                               X'20' W/C IS INTERNAL                        
* UK                               X'10' W/C IS EXTERNAL                        
*                                  X'20' W/C IN 2P/29 IS TRAVEL                 
*                                  X'10' W/C IN 2P/29 IS ENTERTAINING           
*                                  X'08' HOURS CARRIED IN ORIG. EST.            
*                                  X'04' DON'T PRINT ON AC14 (UK).              
* UK                               X'03' EXP ANALYS REQ ON PROD.INPUT           
* UK                               X'02' AS ABOVE-BILLABLE JOBS ONLY            
* UK                               X'01' AS ABOVE-UNBILLABLE JOBS ONLY          
* US                               X'02' NON COMMISSIONABLE W/C                 
* US                               X'01' MEDIA TRANSFER WORK CODE               
ACANMED  DS    CL1       C         MEDIA FOR RETAIL SCHEMES                     
*&&UK                                                                           
ACANSTA2 DS    CL1       X         X'80' SUPPRESS INV. DETAIL UNLESS            
*                                        PROFILE SET.(GERMAN DB ONLY)           
ACANGRUP DS    CL1       C         WORK CODE GROUP (FOR OPTIONS)                
ACANTYPE DS    CL1       C         WORK CODE TYPE (T, O, P OR M)                
*&&                                                                             
*&&US                                                                           
ACANGRUP DS    CL1       C         WORK CODE GROUP (FOR OPTIONS)                
ACANTYPE DS    CL1       C         WORK CODE TYPE (T, O, P OR M)                
ACANSTA2 DS    CL1       X                                                      
ACANINA  EQU   X'80'               WORKCODE IS INACTIVE                         
ACANRTE  EQU   X'40'               QUALIFIES FOR RATE ADJUSTMENT                
ACANINC  EQU   X'20'               WORKCODE IS INTERNAL INCOME                  
*&&                                                                             
ACANLENQ EQU   *-ACANALD                                                        
         SPACE 2                                                                
*        <   > DSECT TO COVER GROUP ELEMENT                                     
         SPACE 1                                                                
ACGRUPD  DSECT                                                                  
ACGREL   DS    CL1       B         ELEMENT CODE X'13'                           
ACGRLEN  DS    CL1       B         ELEMENT LENGTH (LIST + 24)                   
ACGRCODE DS    CL2       X         C=COMPANY U=UNIT L=LEDGER PLUS CODE          
ACGRNAME DS    CL20      X         GROUP NAME                                   
ACGRLIST DS    0C        X         LIST OF COMPANY,UNIT,LEDGER IN GROUP         
         SPACE 2                                                                
*        <   > DSECT TO COVER LEDGER ELEMENT                                    
         SPACE 1                                                                
ACLEDGD  DSECT                                                                  
ACLTEL   DS    CL1       B         ELEMENT CODE                                 
ACLTELQ  EQU   X'14'                                                            
ACLTLEN  DS    CL1       B         ELEMENT LENGTH X'07' OR X'20'                
ACLTLIKE DS    CL1       C         LIKE R=RECEIVABLES, J=JOBS                   
ACLTPRNT DS    CL1       C         STATEMENT PRINTING CONTROL                   
ACLTSTAT DS    CL1       B         X'80' USE TODAYS DATE FOR BROUGHT            
*                                  FORWARD BALANCE ON PEEL-OFF (UK)             
*                                  X'40' CHECKS REQUESTED BY AND                
*                                        PRINTED IN AGENCY OFFICE (US)          
*                                  X'20' CANADIAN LEDGER (US)                   
*                                  X'10' VEHICLE NUMBER REQUIRED (US)           
*                                  X'08' COKE EXPENDITURE LEDGER (US)           
*                                  X'04' USING NEW TALENT PAYMENT (US)          
*                                  X'04' MAKE EXPENSE COST POSTINGS             
*                                  X'02' EST REQ FOR NEW TALENT PAY(US)         
ACLTTYPE DS    CL1       A         TYPE A=ANALYSIS S=SUBSID. G=GENERAL          
ACLTOFF  DS    CL1       X         DISPOSITION OF OFFICE CODE IN THIS           
*                                  LEDGER  0-12,C ,T OR F1,F2,F3,F4             
*                                  X'41'-X'4C' NEW OFF DISP IN KEY              
ACLTDPOS DS    CL1       B         DISPLACEMENT TO DEPT.CODE                    
ACLTDLEN DS    CL1       B         LENGTH OF DEPT. CODE                         
         ORG   ACLTDPOS                                                         
ACLTAGNT DS    CL2       B         LAST AGENT CODE USED (TALENT SN)             
*&&UK                                                                           
ACLTCDAC DS    CL15      C         A/C FOR CASH DISCOUNT                        
*&&                                                                             
*&&US                                                                           
ACLTCDAC DS    CL14      C         A/C FOR CASH DISCOUNT                        
         DS    XL1                 SPARE                                        
*&&                                                                             
ACLTCLI  DS    CL1       B         DISPLACEMENT TO CLIENT CODE                  
ACLTBUD  DS    CL1       X         DISPOSITION OF OFFICE CODE IN THIS           
*                                  LEDGER FOR BUDGETS (SEE ACLTOFF)             
*&&UK                                                                           
ACLTCLOS DS    CL1       X         LEDGER CLOSE TYPE                            
         DS    CL5       X         SPARE                                        
*&&                                                                             
*&&US                                                                           
ACLTWO   DS    CL2       B         NUMBER ASSIGNED TO EACH WRITEOFF             
*                                  IN CREATIVE BILLING                          
         ORG   ACLTWO                                                           
ACLTMSK  DS    CL2       B         12 BIT MASK - REPRESENTING CATEGORY          
*                                  FIELDS IN EXPENSE(SE) LEDGER                 
ACLTCLOS DS    CL1       B         LEDGER CLOSE TYPE                            
ACLTOFFC DS    CL2       X         DEFAULT OFFICE CODE FOR LEDGER               
ACLTSTT2 DS    CL1       X         LEDGER STATUS BYTE 2                         
ACLTSRCH EQU   X'80'               USE LEDGER FOR SEARCH                        
*&&                                                                             
ACLTLNQ  EQU   *-ACLEDGD                                                        
         SPACE 2                                                                
*        <   > DSECT TO COVER GENERAL LEDGER POSTING INSTRUCTION ELEM.          
         SPACE 1                                                                
ACGENLD  DSECT                                                                  
ACGLEL   DS    CL1       X         ELEMENT CODE X'15'                           
ACGLLEN  DS    CL1       X         ELEMENT LENGTH (26/40/54/68)                 
ACGLSUB  DS    CL10      C         SPACES=POST ALL ACCOUNTS ON LEDGER           
*                                         TO ACGLACC.                           
*                                  NON-SPACES=POST THIS SPECIFIC ACCT.          
*                                  FOR PRODUCTION THIS IS MEDIA CODE.           
         ORG   ACGLSUB                                                          
ACGLFLT  DS    CL5                 FILTERS FOR FINANCIAL REPORTING              
ACGLACT  DS    CL1                 ACTION FOR FINANCIAL                         
ACGLBTYP DS    CL1                 BUCKET TYPE                                  
         DS    CL3                 SPARE                                        
ACGLACC  DS    CL14      C         ACCOUNT CODE IN GENERAL LEDGER               
ACGLACC2 DS    CL14      C         OPTIONAL SECOND ACCOUNT FOR RANGE            
ACGLCON  DS    CL14      C         OPTIONAL CONTRA-ACCOUNT                      
ACGLCON2 DS    CL14      C         OPTIONAL SECOND CONTRA-ACCOUNT               
         SPACE 2                                                                
*        <   > DSECT TO COVER HIERARCHY ELEMENT                                 
         SPACE 1                                                                
ACHEIRD  DSECT                                                                  
ACHREL   DS    CL1       B         ELEMENT CODE                                 
ACHRELQ  EQU   X'16'                                                            
ACHRLEN  DS    CL1       B         ELEMENT LENGTH X'42'                         
ACHRLEVA DS    CL1       B         1-12 LENGTH OF ACCOUNT LEVEL 1               
ACHRDESA DS    CL15      A              DESCRIPTION                             
ACHRLEVB DS    CL1       B         0-12 LENGTH OF ACCOUNT LEVEL 2-1             
ACHRDESB DS    CL15      A              DESCRIPTION                             
ACHRLEVC DS    CL1       B         0-12 LENGTH OF ACCOUNT LEVEL 3-2             
ACHRDESC DS    CL15      A              DESCRIPTION                             
ACHRLEVD DS    CL1       B         0-12 LENGTH OF ACCOUNT LEVEL 4-3             
ACHRDESD DS    CL15      A              DESCRIPTION                             
ACHRLENQ EQU   *-ACHEIRD                                                        
         SPACE 2                                                                
*        <   > DSECT FOR STANDARD HOURS ELEMENT                                 
         SPACE 1                                                                
ACHOD    DSECT                                                                  
ACHOEL   DS    CL1       B         ELEMENT CODE X'17'                           
ACHOLEN  DS    CL1       B         ELEMENT LENGTH X'18'                         
ACHODATE DS    CL2       P         YEAR/MONTH                                   
ACHOURS  DS    5PL4      P         HOURS (UNITS) FOR PEROID                     
         SPACE 2                                                                
*        <   > DSECT FOR MONTH OF SERVICE LOCK/SECURITY LEVEL ELEMENT           
         SPACE 1                                                                
ACMOSD   DSECT                                                                  
ACMOSEL  DS    CL1       B         ELEMENT CODE X'18'                           
ACMOSLEN DS    CL1       B         ELEMENT LENGTH VARIABLE                      
ACMOSNUM DS    CL1       X         NUMBER OF MINI ELEMENTS                      
*                                  VARIABLE NUMBER OF 4 BYTE MINIS              
ACMOSTYP DS    CL1       X         BATCH TYPE                                   
ACMOSMTH DS    CL1       C         LATEST LOCKED MONTH FOR ABOVE TYPE           
ACMOSSEC DS    CL1       B         SECURITY LEVEL '00' '01' '02' '03'           
ACMOSNEX EQU   *-ACMOSTYP          NEXT MINI ELEMENT                            
         SPACE 2                                                                
*        <   > DSECT TO COVER MEDIA INTERFACE ELEMENT                           
         SPACE 1                                                                
ACMID    DSECT                                                                  
ACMIEL   DS    CL1       B         ELEMENT CODE X'19'                           
ACMIELQ  EQU   X'19'                                                            
ACMILEN  DS    CL1       X         ELEMENT LENGTH                               
ACMICODE DS    CL2       A         MEDIA CODE                                   
ACMIDESC DS    CL12      A         MEDIA DESCRIPTION                            
ACMICOMM DS    CL14      A         COMMISSION ACCOUNT                           
ACMICSHD DS    CL14      A         CASH DISCOUNT ACCOUNT                        
ACMICSHR DS    CL14      A         CASH RECEIPT ACCOUNT                         
ACMICCSR DS    CL14      A         CANADIAN CASH RECEIPT ACCOUNT                
ACMICNTL DS    CL14      A         MEDIA CONTROL ACCOUNT                        
ACMICOST DS    CL12      A         COST ANALYSIS (11 AND 12)                    
ACMILOST DS    CL14      A         LOST CASH DISCOUNT ACCOUNT                   
ACMICONL DS    CL14      A         COMMISSION ONLY CONTROL                      
         DS    CL12                SPARE                                        
ACMILNQ  EQU   *-ACMIEL                                                         
         SPACE 2                                                                
*        <   > DSECT TO COVER MEDIA TRANSFER ELEMENT                            
         SPACE 1                                                                
ACMTD    DSECT                                                                  
ACMTEL   DS    CL1       B         ELEMENT CODE X'1A'                           
ACMTELQ  EQU   X'1A'                                                            
ACMTLEN  DS    CL1       X         ELEMENT LENGTH                               
ACMTSYS  DS    CL1       C         SYSTEM (S=SPOT, P=PRINT, J=PROD)             
ACMTMED  DS    CL1       A         MEDIA CODE                                   
ACMTCLI  DS    CL3       A         CLIENT CODE                                  
ACMTPRD  DS    CL3       A         PRODUCT CODE                                 
ACMTJOB  DS    CL6       A         JOB CODE                                     
         ORG   ACMTJOB                                                          
ACMTEST  DS    CL6       N         ESTIMATE NUMBER                              
ACMTSTAT DS    CL1       B         STATUS BITS                                  
*                                  X'02' ACMTMED2 IS MI RECORD CODE             
ACMTMED2 DS    CL2       A         INTERAGENCY MEDIA CODE                       
ACMTMOS  DS    CL2       X         MONTH OF SERVICE (YYMM)                      
ACMTDSCP DS    CL36      A         ESTIMATE DESCRIPTION / JOB NAME              
ACMTGRS  DS    CL4       B         BILLING (GROSS)                              
ACMTNET  DS    CL4       B         PAYABLE (EXTERNAL)                           
ACMTCOM  DS    CL4       B         INCOME  (COMMISSION)                         
ACMTCD   DS    CL4       B         CASH DISCOUNT                                
ACMTINTL DS    CL4       B         INCOME (INTERNAL)                            
ACMTRECV DS    CL4       B         ACCOUNTS RECEIVABLE                          
ACMTFDTE DS    XL2       B         FROM MONTH/YR OR CURR (COMPRESSED)           
ACMTTDTE DS    XL2       B         TO MONTH/YR OR ZEROES (COMPRESSED)           
ACMTVAT  DS    CL4       B         VAT AMOUNT                                   
ACMTDTE  DS    CL2       B         TRANSFER DATE COMPRESSED                     
ACMTBTYP DS    CL2                 MEDIA BILLING TYPE                           
ACMTBREG EQU   C'G '               REGULAR                                      
ACMTBAOR EQU   C'AM'               AOR CLIENT (MAIN BILL)                       
ACMTBAA  EQU   C'AA'               AOR TRUE                                     
ACMTBAJ  EQU   C'AJ'               AOR ADJUSTMENT                               
ACMTBAC  EQU   C'AC'               AOR CASH DISCOUNT                            
ACMTBCD  EQU   C'CM'               CASH DISCOUNT (MAIN BILL)                    
ACMTBCDC EQU   C'CC'               CASH DISCOUNT BILL                           
ACMTBRET EQU   C'R '               GENERAL RETAIL                               
ACMTBRC  EQU   C'RC'               RETAIL CORPORATE OUTLET                      
ACMTBRP  EQU   C'RP'               RETAIL PARTICIPANT OUTLET                    
ACMTBADJ EQU   C'J '               COMMISSION ADJUSTMENT                        
ACMTBCOM EQU   C'O '               COMMISSION ONLY                              
ACMTBFIN EQU   C'FM'               FINANCIAL (MAIN BILL)                        
ACMTBFR  EQU   C'FR'               FINANCIAL (REBATE)                           
ACMTLNQ  EQU   *-ACMTEL                                                         
         SPACE 2                                                                
*        <   > DSECT TO COVER BUDGET TYPE COLUMN NAME ELEMENT                   
         SPACE 1                                                                
ACBCD    DSECT                                                                  
ACBCEL   DS    CL1       B         ELEMENT CODE                                 
ACBCELEQ EQU   X'1B'                                                            
ACBCLEN  DS    CL1       B         ELEMENT LENGTH                               
ACBCCOL1 DS    CL10      C         COLUMN NAME-1                                
ACBCCOL2 DS    CL10      C                    -2                                
ACBCLNEQ EQU   *-ACBCD             OLD LENGTH                                   
ACBCSTAT DS    CL1       X         STATUS - X'04' USE SJ CLI/PRD                
ACBCOFFC EQU   X'80'               BUDGET BY 2 BYTE OFFICE                      
ACBCPROD EQU   X'04'               PROD                                         
ACBCPREC DS    CL1       X         PRECISION                                    
         DS    CL5                 SPARE                                        
ACBCLNQ2 EQU   *-ACBCD             NEW LENGTH                                   
         SPACE 2                                                                
*        <   > DSECT TO COVER BUDGET INPUT VALIDATION ELEMENTS                  
         SPACE 1                                                                
ACBVD    DSECT                                                                  
ACBVEL   DS    CL1       B         ELEMENT CODE                                 
ACBVELEQ EQU   X'1C'                                                            
ACBVLEN  DS    CL1       B         ELEMENT LENGTH                               
ACBVACUL DS    CL2       C         ACCOUNT UNIT/LEDGER                          
ACBVACLV DS    CL1       B         ACCOUNT LEVEL                                
*                                  VARIABLE NUMBER OF 3 BYTE ENTRIES            
ACBVCAUN DS    CL1       V         CONTRA UNIT OR X'00' OR C'+'                 
ACBVCALE DS    CL1       V         CONTRA LEDGER OR X'00' OR DISP               
ACBVCALV DS    CL1       V         CONTRA LEVEL OR X'00' OR LENGTH              
         SPACE 2                                                                
*        <   > DSECT TO COVER BUDGET AMOUNT ELEMENTS                            
         SPACE 1                                                                
ACBAD    DSECT                                                                  
ACBAEL   DS    CL1       B         ELEMENT CODE                                 
ACBAELEQ EQU   X'1D'                                                            
ACBALEN  DS    CL1       B         ELEMENT LENGTH                               
ACBAMNTH DS    CL2       B         MONTH (PWOS YYMM)                            
ACBABUDG DS    CL8       P         BUDGET AMOUNT (PENNIES)                      
ACBALNEQ EQU   *-ACBAD                                                          
         SPACE 2                                                                
*        <   > DSECT TO COVER LIST TYPE ELEMENT                                 
         SPACE 1                                                                
ACLISTD  DSECT                                                                  
ACLIEL   DS    CL1       B         ELEMENT CODE X'1E'                           
ACLIELEQ EQU   X'1E'                                                            
ACLILEN  DS    CL1       B         ELEMENT LENGTH X'0B''                        
ACLITYPE DS    CL1       C         LIST TYPE (L=LEDGER, A=ACCOUNT)              
ACLIDATE DS    CL3       P         EXPIRY DATE                                  
ACLIUSE  DS    CL1       C         I=INCLUDE, E=EXCLUDE SET BY MONACC           
         DS    CL4                 SPARE                                        
ACLILNEQ EQU   *-ACLISTD                                                        
         SPACE 2                                                                
*        <   > DSECT TO COVER LIST DATA ELEMENT                                 
         SPACE 1                                                                
ACLDATAD DSECT                                                                  
ACLDEL   DS    CL1                 ELEMENT CODE X'1F'                           
ACLDELEQ EQU   X'1F'                                                            
ACLDLEN  DS    CL1                 ELEMENT LENGTH (VARIABLE)                    
ACLDITLN DS    CL1       B         LENGTH OF EACH ITEM                          
         DS    CL4                 SPARE                                        
ACLDATA  DS    0C                                                               
*                                  ACCOUNT LIST DATA.                           
ACLDAUNT DS    CL1                 UNIT CODE.                                   
ACLDALDG DS    CL1                 LEDGER CODE.                                 
ACLDALVL DS    CL1                 ACCOUNT LEVEL.                               
ACLDACCS DS    0C                  ACCOUNT CODES.                               
         ORG   ACLDATA                                                          
*                                  UNIT/LEDGER LIST DATA                        
ACLDUL   DS    0CL2                UNIT/LEDGER CODES                            
         SPACE 2                                                                
*        <   > DSECT TO COVER NAME ELEMENT                                      
         SPACE 1                                                                
ACNAMED  DSECT                                                                  
ACNMEL   DS    CL1       B         ELEMENT CODE X'20'                           
ACNMELQ  EQU   X'20'                                                            
ACNMLEN  DS    CL1       B         ELEMENTH LENGTH                              
ACNMNAME DS    0CL36     A         ACCOUNT NAME (1-36 BYTES)                    
*                                               LENGTH = ACNMLEN - 2            
         SPACE 2                                                                
*        <   > DSECT TO COVER NUMBER ELEMENT                                    
         SPACE 1                                                                
ACNUMD   DSECT                                                                  
ACNUMEL  DS    CL1       B         ELEMENT CODE X'21'                           
ACNUMLEN DS    CL1       B         ELEMENT LENGTH (14 OR 15)                    
ACNUMBEF DS    CL6       X         STARTING NUMBER (=END AFTER LOAD)            
ACNUMAFT DS    CL6       X         ENDING NUMBER                                
ACNUMTYP DS    CL1       X         OPTIONAL NUMBER TYPE                         
*                                                                               
         SPACE 2                                                                
*        <   > DSECT TO COVER ADDRESS ELEMENT                                   
         SPACE 1                                                                
ACADDD   DSECT                                                                  
ACADEL   DS    CL1       B         ELEMENT CODE X'22'                           
ACADELQ  EQU   X'22'                                                            
ACADLEN  DS    CL1       B         ELEMENT LENGTH X'1D 37 51 OR 6B'             
ACADLNES DS    CL1       B         NUMBER OF LINES 1-4                          
ACADADD  DS    CL26      A         ADDRESS LINES                                
         SPACE 2                                                                
*        <   > DSECT TO COVER OTHERS ELEMENT                                    
         SPACE 1                                                                
ACOTHERD DSECT                                                                  
ACOTEL   DS    CL1       B         ELEMENT CODE X'23'                           
ACOTELQ  EQU   X'23'                                                            
ACOTLEN  DS    CL1       B         ELEMENT LENGTH X'0F' OR X'19'                
ACOTNUM  DS    CL9       X         FREE FORM NUMBER                             
ACOTPROF DS    CL4       X         FREE FORM PROFILE                            
         ORG   ACOTPROF+2                                                       
ACOTDATE DS    CL2       X         MEDIA MONTH OF SERVICE                       
ACOTLNQ1 EQU   *-ACOTHERD                                                       
ACOTNET  DS    CL4       C         NETWORK(FROM BILLING TRANSFER)               
         DS    XL6       B         SPARE                                        
ACOTLNQ2 EQU   *-ACOTHERD                                                       
         SPACE 2                                                                
*        <   > DSECT TO COVER PROFILE ELEMENT                                   
         SPACE 1                                                                
ACPROFD  DSECT                                                                  
ACPREL   DS    CL1       B         ELEMENT CODE                                 
ACPRELQ  EQU   X'24'                                                            
ACPRLEN  DS    CL1       B         ELEMENT LENGTH                               
ACPRGRUP DS    CL3       X         BILLING GROUP                                
         ORG   ACPRGRUP                                                         
ACPRPROD DS    CL3                 PRODUCTION CLI/PRD (U.S. TALENT)             
ACPRRECV DS    CL15      X         RECEIVABLE CODE                              
ACPRCOST DS    CL15      X         COSTING CODE                                 
ACPROFFC DS    CL2       C         OFFICE CODE                                  
ACPRBILL DS    CL1       X         BILL TYPE      P=PROGRESSIVE                 
*                                                 T=TOTAL                       
*                                                 E=ESTIMATE                    
*                                                 S=SPECIAL                     
*                                                 U=UNBILLABLE                  
*                                                 1=ONE LINE                    
*                                                 C=CLIENT                      
ACPRBLAM DS    CL4       B         PERCENTAGE OF ESTIMATE (2PLACES)             
*                                  OR SPECIAL AMOUNT FOR BILLING                
ACPRUNIT DS    CL1       X         UNIT FOR ANALYSIS                            
ACPRUNBL DS    CL12      X         UP TO 6 UNBILLABLE WORK-TYPE CODES           
*                                  FILLED WITH SPACES                           
ACPRBLPR DS    CL50      X         ADDITIONAL BILLING PRINT                     
ACPRNARR DS    0CL150    X         ANY OTHER CHAT                               
         SPACE 2                                                                
*        <   > DSECT TO COVER FREE FORM NUMBER ELEMENT                          
         SPACE 1                                                                
ACNOD    DSECT                                                                  
ACNOEL   DS    CL1       B         ELEMENT CODE X'25'                           
ACNOLEN  DS    CL1       B         ELEMENT LENGTH (L'ACNO+2)                    
ACNO     DS    0CL10     A         FREE FORM NUMBER                             
ACNONUM  DS    CL6       C         ORDER NUMBER                                 
ACNOSTAT DS    CL1       X         ORDER STATUS  C'P'=PARTIAL ORDER             
         DS    CL3                 SPARE                                        
         SPACE 2                                                                
*        <   > DSECT TO COVER JOB ELEMENT                                       
         SPACE 1                                                                
ACJOBD   DSECT                                                                  
ACJBEL   DS    CL1       X         ELEMENT CODE                                 
ACJBELQ  EQU   X'26'                                                            
ACJBLEN  DS    CL1       X         ELEMENT LENGTH X'08', X'10' OR X'17'         
ACJBCLOS DS    PL3       P         ESTIMATED CLOSING DATE                       
ACJBSTRT DS    PL3       P         DATE ADDED TO FILE                           
ACJBLNQ  EQU   *-ACJOBD                                                         
ACJBREV  DS    CL2       B         REVISION NUMBER                              
ACJBOPND DS    PL3       P         JOB OPENING DATE                             
ACJBREVD DS    CL3       P         REVISION DATE                                
ACJBLNQ2 EQU   *-ACJOBD                                                         
ACJBFLT2 DS    CL1       C         FILTER 2 BEFORE LAST BILL                    
ACJBBILL DS    CL1       C         BILL TYPE BEFORE LAST BILL                   
ACJBBIST DS    CL1       X         %EST. BILLING STATUS                         
*                                  X'80'  1ST BILLING DONE                      
*                                  X'40'  2ND BILLING DONE                      
*                                  X'20'  3RD BILLING DONE                      
ACJBSTAT DS    CL1       X         JOB STATUS                                   
ACJBUNAQ EQU   X'80'               X'80' JOB HAS UNAPPROVED ESTIMATE            
ACJBNEWQ EQU   X'40'               X'40' JOB USES NEW ESTIMATING                
ACJBRATQ EQU   X'20'               X'20' QUALIFIES FOR RATE ADJUSTMENT          
ACJBXJOB EQU   X'10'               X'10' JOB IS AN X-JOB                        
ACJBSTV  EQU   X'08'               X'08' JOB IS TALENT MEDIA TV                 
ACJBSRAD EQU   X'04'               X'04' JOB IS TALENT MEDIA RADIO              
ACJBSTUD EQU   X'02'               X'02' JOB IS A STUDIO JOB                    
ACJBSTA2 DS    CL1                 JOB STATUS 2                                 
ACJBINC  EQU   X'80'               JOB IS INCOMPLETE                            
ACJBDFT  EQU   X'40'               JOB IS A DRAFT                               
ACJBFUN  EQU   X'20'               JOB HAS BEEN FUNDED                          
         DS    XL2                 N/D                                          
ACJBLNQ3 EQU   *-ACJOBD                                                         
         SPACE 2                                                                
*        <   > DSECT TO COVER ACCOUNT BILLING INFORMATION                       
         SPACE 1                                                                
ACABILLD DSECT                                                                  
ACABEL   DS    CL1       X         ELEMENT CODE X'27'                           
ACABLEN  DS    CL1       X         ELEMENT LENGTH:                              
*                             X'1E' WITH ACABEANO AND/OR ACABACNO ONLY          
*                             X'39' WITH ACABESNO AND/OR ACABBUNO               
*                             X'48' WITH ACABBINO                               
*                             X'57' WITH ACABBMEM                               
ACABEANO DS    CL14      C         EA NUMBER -(LJ) XXXXX-XX-X                   
ACABACNO DS    CL14      C         ACCT NUMBER (LJ)                             
*                                  SCHEME 1 XXXX-XXXX-XXX                       
*                                  SCHEME 2 XXXX-XXX-XXXX                       
*                                  SCHEME 3 NNNN(9 BLANKS)                      
ACABESNO DS    CL12      C         ESTIMATE NO. FOR INTERFACE TPS (LJ)          
ACABBUNO DS    CL15      N         BUD. NO. FOR INTERFACE TPS (RJ,PWZ)          
ACABBINO DS    CL15      C         BILLING NO., (A/N FREEFORM)                  
ACABBMEM DS    CL15      C         BUDGET MEMO FIGURE (A/N FREEFORM)            
         SPACE 2                                                                
*        <   > DSECT TO COVER ADDITIONAL BILLING PRINT                          
         SPACE 1                                                                
ACBLPD   DSECT                                                                  
ACBLPEL  DS    CL1       B         ELEMENT CODE X'28'                           
ACBLPLEN DS    CL1       B         ELEMENT LENGTH - ACBLPNAR+3                  
ACBLPTYP DS    CL1       B         COMMENT TYPE                                 
*                                  X'80' BILLING - REPLACES ACPRBLPR            
*                                  X'40' OTHER - REPLACES ACPRNARR              
ACBLPNAR DS    0CL150    C         NARRATIVE                                    
         SPACE 2                                                                
*        <   > DSECT TO COVER PLANMASTER ELEMENT                                
         SPACE 1                                                                
ACPMSTD  DSECT                                                                  
ACPMELC  DS    X                   ELEMENT CODE                                 
ACPMELQ  EQU   X'29'                                                            
ACPMEND  DS    X                   ELEMENT LENGTH                               
ACPMLND  DS    CL4                 PLANMASTER LINE NUMBER                       
ACPMIND  DS    X                   INDICATOR OF TYPE OF ELEMENT                 
ACPMDRQ  EQU   X'80'               DEBIT                                        
ACPMCRQ  EQU   X'40'               CREDIT                                       
ACPMGRQ  EQU   X'20'               GROSS FIGURE FROM X50 ELEMENT                
ACPMCFQ  EQU   X'10'               CLIENT FILTER                                
ACPMDXQ  EQU   X'08'               ALL DEBITS                                   
ACPMCXQ  EQU   X'04'               ALL CREDITS                                  
ACPMBLQ  EQU   X'02'               BALANCE                                      
         DS    CL2                 SPARE BYTES                                  
ACPMFIL  DS    CL6                 FILTER VALUES EG CLIENT NAME                 
ACPMOFF  DS    X                   OFFSET INTO BRANCH TABLE PROCESS             
ACPMLNQ  EQU   *-ACPMSTD                                                        
         SPACE 2                                                                
*        <   > DSECT TO COVER TAX NUMBER ELEMENT (UK FOREIGN TAX)               
         SPACE 1                                                                
ACFTD    DSECT                                                                  
ACFTEL   DS    CL1       B         ELEMENT CODE X'2A'                           
ACFTLEN  DS    CL1       B         ELEMENT LENGTH (L'ACFTNO+2)                  
ACFTNO   DS    0CL10     A         FREE FORM NUMBER                             
         SPACE 2                                                                
*        <   > DSECT TO COVER BANK ACCOUNT ELEMENT                              
         SPACE 1                                                                
ACBNKD   DSECT                                                                  
ACBNKEL  DS    CL1       B         ELEMENT CODE X'2B'                           
ACBNKLN  DS    CL1       B         ELEMENT LENGTH X'19'                         
         DS    CL1       A         SPARE                                        
ACBNKNO  DS    CL10      A         BANK SORTING CODE                            
ACBNKAC  DS    CL12      A         ACCOUNT CODE WITHIN BANK                     
ACBNKLNQ EQU   *-ACBNKEL           ELEMENT LENGTH                               
         SPACE 2                                                                
*        <   > DSECT TO RETAIL BILLING RECEIVABLE ELEMENT                       
         SPACE 1                                                                
ACRBD    DSECT                                                                  
ACRBEL   DS    CL1       B         ELEMENT CODE X'2B'                           
ACRBELQ  EQU   X'2B'                                                            
ACRBLEN  DS    CL1       B         ELEMENT LENGTH                               
ACRBRECV DS    CL14      C         RECEIVABLE ACCOUNT                           
ACRBCOST DS    CL14      C         COSTING ACCOUNT                              
         DS    CL10                SPACE                                        
ACRBLENQ EQU   *-ACRBD                                                          
         SPACE 2                                                                
*        <   > DSECT TO COVER SPECIAL POSTING ACCOUNT ELEMENT                   
         SPACE 1                                                                
ACSPECD  DSECT                                                                  
ACSPEL   DS    CL1       B         ELEMENT CODE X'2C'                           
ACSPELQ  EQU   X'2C'                                                            
ACSPLEN  DS    CL1       B         ELEMENT LENGTH                               
ACSPTYP  DS    X                   TYPE OF ACCOUNT                              
ACSPOIN  EQU   X'01'               INCOME ACCOUNT                               
ACSPOWO  EQU   X'02'               WRITE-OFF ACCOUNT                            
ACSPOAN  EQU   X'03'               ANALYSIS ACCOUNT                             
ACSPOCD  EQU   X'04'               CASH DISCOUNT                                
ACSPOMC  EQU   X'05'               MEDIA CONTROL (SZ)                           
ACSPFAC  EQU   X'06'               FACTORING ACCOUNT                            
         DS    CL4                 SPARE                                        
ACSPACCT DS    CL14      C         ACCOUNT CODE                                 
ACSPLENQ EQU   *-ACSPECD                                                        
         SPACE 2                                                                
*        <   > DSECT TO COVER INTERCOMPANY POSTING ELEMENT                      
         SPACE 1                                                                
ACICPD   DSECT                                                                  
ACICPEL  DS    CL1                 ELEMENT CODE X'2D'                           
ACICPELQ EQU   X'2D'                                                            
ACICPLEN DS    CL1                 ELEMENT LENGTH                               
ACICPSUB DS    0C                  SUB-ELEMENT                                  
ACICPSLN DS    XL1                 SUB-ELEMENT LENGTH                           
ACICPSOF DS    CL2                 SUB-ELEMENT OFFICE                           
ACICPSAC DS    0C                  SUB-ELEMENT ACCOUNT                          
         SPACE 2                                                                
         SPACE 1                                                                
ACSTATD  DSECT                                                                  
ACSTEL   DS    CL1       B         ELEMENT CODE                                 
ACSTELQ  EQU   X'30'                                                            
ACSTLEN  DS    CL1       B         ELEMENT LENGTH X'16'                         
ACSTSECY DS    CL2       B         SECURITY NUMBER                              
ACSTSUB  DS    CL1       X         SUB-COMPANY                                  
ACSTCNTR DS    CL3       X         COST CENTER                                  
ACSTSTX  DS    CL1       X         EXTRA STATUS BYTE                            
*                                  X'80' FOR TYPE 21 AND 22 CONTRA-ACC          
*                                        ON 29 POSTING IS VENDOR                
*                                  X'40' CASHPAK CASH ACCOUNT FOR PEEL          
*                                  X'20' PEELED RECONCILED DEBITS               
*                                  X'10' PROJECT REQ. ON TIME SHEETS            
*                                  X'08' INDIRECT DEPT.                         
*                                  X'04' LEDGER/ACCT IS PROFIT/LOSS             
*                                  X'02' LEDGER/ACCT IS BAL. SHEET              
*                                  X'01' CLIENT COSTING BY JOB                  
ACSTBLDT DS    CL2       X         ON SJ LAST BILLED DATE FOR JOB               
         ORG   ACSTBLDT                                                         
ACSTCPOS DS    CL1       B         COSTING CENTER REPLACE POSITION              
         DS    CL1                                                              
ACSTBFDT DS    PL3       P         DATE BALANCE B/FRWD                          
ACSTLAST DS    PL3       P         DATE OF LAST TRANSACTION                     
ACSTANAL DS    CL1       X         ANALYSIS CODE                                
ACSTSTAT DS    CL1       B         STATUS BYTE                                  
*                                  X'80' GENERATE PERSONAL EXPENSE ITEM         
*                                  X'40' ACCOUNT IS CLOSED                      
*                                  X'20' ACCOUNT IS LOCKED OUT                  
*                                  X'10' EXPENSE A/C DEMANDS DEPARTMENT         
*                                  X'08' OUTPUT FILE FOR BANK RECONCIL.         
*                                  X'04' PERSON IS ACCT EXEC (US COST)          
*                                  X'04' ACCOUNT IS ON HOLD (US TALENT)         
*                                  X'04' POST 2P/29 PLUS VAT (UK)               
*                                  X'02' FOR VENDOR BATCH 1,21 (AND             
*                                        OPTIONALLY 3,22) POST TO '2C'          
*                                        UK-VAT ACCOUNT IS INPUT A/C            
*                                  X'01' SALARY FIGURE IS ACTUAL AMOUNT         
*                                                                               
ACSTFILT DS    CL2       X         FILTER CHARACTERS                            
ACSTCOST DS    CL1       X         COSTING GROUP (OR SPACE)                     
ACSTLNQ1 EQU   *-ACSTATD           ORIGINAL ELEMENT LENGTH                      
ACSTSTA2 DS    CL1       X         ADDITIONAL STATUS                            
*                                  X'80' BILLABLE OPTION BILL=Y                 
*                                  X'40' BILLABLE OPTION BILL=N                 
*                                  X'20' PAYEE IS LOCKED FROM CHEQUE            
*                                        RUN (GERMAN DIRECT DEBIT)              
*                                  X'10' VAT ACCOUNT IS INPUT (US)              
*                                  X'10' SUPPLIER IS MEDIA PRINT (UK)           
*                                  X'08' SUPPLIER IS MEDIA BROADCAST            
*                                  X'04' MILAGE INPUT REQUIRED (UK)             
ACSTFLT5 DS    CL1       C         ACCOUNT FILTER 5                             
ACSTSNUM DS    XL2       B         TIME SHEET NUMBER (0-9999) 1R A/C            
ACSTOFFC DS    CL2       C         DEFAULT OFFICE CODE FOR ACCOUNT              
         DS    CL1                 SPARE                                        
ACSTLNQ2 EQU   *-ACSTATD           NEW ELEMENT LENGTH                           
ACST1099 DS    CL1                 1099 PAYMENT TYPE                            
ACSTNCMP EQU   X'00'               - NON EMPLOYEE COMPENSATION                  
ACSTRENT EQU   X'01'               - RENT                                       
ACSTPRIZ EQU   X'02'               - PRIZES/AWARDS                              
ACSTMEDC EQU   X'04'               - MEDICAL/HEALTH CARE PAYMENTS               
ACSTROYL EQU   X'08'               - ROYALITIES                                 
ACSTSTA5 DS    XL1                 STATUS BYTE 5                                
ACSTNBIZ EQU   X'80'               - NEW BUSINESS                               
ACSTBONO EQU   X'40'               - PROBONO                                    
ACSTPROD EQU   X'20'               - FORCE PRODUCT ON TIMESHEETS                
ACSTPRJB EQU   X'10'               - FORCE PROD/JOB ON TIMESHEETS               
ACSTHOUS EQU   X'08'               - HOUSE CLIENTS (1C)                         
ACSTDTSK DS    XL2                 DEFAULT TASK CODE FOR TMS                    
         DS    XL7                                                              
ACSTLNQ3 EQU   *-ACSTATD                                                        
         SPACE 2                                                                
*        <   > DSECT TO COVER ARTIST FEE ELEMENT                                
         SPACE 1                                                                
ACFEED   DSECT                                                                  
ACFEEL   DS    CL1       B         ELEMENT CODE X'31'                           
ACFELN   DS    CL1       B         ELEMENT LENGTH X'1B' OR X'46'                
ACFEST   DS    CL1       B         FEE STATUS/TYPE                              
*                                  X'80' BASIC FEE                              
*                                  X'40' REPEAT FEE                             
*                                  X'20' POSTINGS HAVE BEEN GENERATED           
*                                  X'10' BILLING BIT SET BY BILLS               
*                                  X'08' BILLING BIT SET BY LOAD                
ACFERF   DS    CL6       X         REFERENCE #                                  
ACFEJOB  DS    CL12      X         JOB CODE                                     
ACFEBSC  DS    PL6       P         BASIC FEE AMOUNT                             
ACFESTD  DS    CL5       B         STATION DEFINITION                           
ACFESRT  DS    5PL4      P         STATION GROUP RATES                          
ACFERTS  DS    CL18      B         REPEAT FEES                                  
         SPACE 2                                                                
*        <   > DSECT TO COVER BALANCE ELEMENT (LOW HEIRARCHY)                   
         SPACE 1                                                                
ACBALD   DSECT                                                                  
ACBLEL   DS    CL1       B         ELEMENT CODE X'32'                           
ACBLELQ  EQU   X'32'                                                            
ACBLLEN  DS    CL1       B         ELEMENT LENGTH X'1A'                         
ACBLFRWD DS    PL8       P         BALANCE BROUGHT FORWARD                      
ACBLDR   DS    PL8       P         DEBITS  SINCE BALANCE FORWARD                
ACBLCR   DS    PL8       P         CREDITS SINCE BALANCE FORWARD                
ACBLURG  DS    PL6       P         URGENT CREDITS                               
ACBLTXS  DS    XL4                 NUMBER OF TRANSACTIONS                       
         DS    XL4                 N/D                                          
ACBLLNQ  EQU   *-ACBALD                                                         
         SPACE 2                                                                
*        <   > DSECT TO COVER PEEL-OFF ELEMENT                                  
         SPACE 1                                                                
ACPEELD  DSECT                                                                  
ACPEEL   DS    CL1       B         ELEMENT CODE X'33'                           
ACPELEN  DS    CL1       B         ELEMENT LENGTH X'14'                         
ACPEPLDT DS    PL3       P         DATE OF THIS PEEL-OFF                        
ACPELBDT DS    PL3       P         DATE OF LAST BAL B/FRWD                      
ACPEDR   DS    PL6       P         DEBITS  B/F IN THIS PEEL                     
ACPECR   DS    PL6       P         CREDITS B/F IN THIS PEEL                     
         SPACE 2                                                                
*        <   > DSECT TO COVER BUDGET ELEMENT                                    
         SPACE 1                                                                
ACBUDGD  DSECT                                                                  
ACBDEL   DS    CL1       B         ELEMENT CODE X'34'                           
ACBDLEN  DS    CL1       B         ELEMENT LENGTH X'1C' OR X'24'                
ACBDTYPE DS    CL1       A         BUDGET OR ESTIMATE TYPE                      
*                                  D=DEBITS C=CREDITS O=ORDERS E=COMM           
ACBDSTRT DS    PL2       P         BUDGET START DATE                            
ACBDEND  DS    PL2       P         BUDGET END DATE                              
ACBDBUDG DS    PL6       P         BUDGET                                       
ACBDSBAC DS    CL15      X         OPTIONAL SUB-ACCOUNT OR SPACES               
*                                  FOR JOB ESTIMATE - WORK-CODE  NAME           
ACBDWORK DS    CL2       X         WORK-CODE                                    
ACBDORIG DS    PL6       P         ORIGINAL ESTIMATE                            
         SPACE 2                                                                
*        <   > DSECT TO COVER JOB ESTIMATE ELEMENT                              
         SPACE 1                                                                
ACESTD   DSECT                                                                  
ACESTEL  DS    CL1       B         ELEMENT CODE                                 
ACESTELQ EQU   X'35'                                                            
ACESTLEN DS    CL1       B         ELEMENT LENGTH X'10' OR X'16'                
ACESTWRK DS    CL2       C         WORK-CODE                                    
ACESTORG DS    PL6       P         ORIGINAL ESTIMATE                            
ACESTCUR DS    PL6       P         CURRENT ESTIMATE                             
ACESTPRV DS    PL6       P         PREVIOUS ESTIMATE                            
         SPACE 2                                                                
*        <   > DSECT TO COVER VAT ELEMENT OR DISCOUNT                           
         SPACE 1                                                                
ACVATD   DSECT                                                                  
ACVTEL   DS    CL1       B         ELEMENT CODE X'36',X'37' OR X'38'            
ACVTLEN  DS    CL1       B         ELEMENT LENGTH X'04'                         
ACVTRATE DS    CL2       B         VAT RATE (2 DEC PLACES)                      
*                                  OR FREELANCE TAX PCT (2 DECS)-X'37'          
*                                  OR DISCOUNT RATE (2 DECS)-X'38'              
         SPACE 2                                                                
*        <   > DSECT TO COVER COKE EXPENDITURE AREA ELEMENT                     
         SPACE 1                                                                
ACEXPD   DSECT                                                                  
ACEXPEL  DS    CL1       B         ELEMENT CODE X'39'                           
ACEXPLEN DS    CL1       B         ELEMENT LENGTH X'18'                         
ACEXPACC DS    CL15      C         AREA/REGION/DISTRICT                         
ACEXPDTE DS    CL3       P         EFFECTIVE DATE                               
         DS    CL4                 SPARE                                        
         SPACE 2                                                                
*        <   > DSECT TO COVER POOL ELEMENT                                      
         SPACE 1                                                                
ACPOOLD  DSECT                                                                  
ACPLEL   DS    CL1       B         ELEMENT CODE X'3A'                           
ACPLEN   DS    CL1       B         ELEMENT LENGTH X'29'                         
ACPLBRND DS    CL6       X         BRAND CODE                                   
ACPLPCNT DS    PL3       P         PERCENTAGE ALLOCATION (2 DEC PLACES)         
ACPLRECV DS    CL15      X         RECEIVABLE ACCOUNT                           
ACPLCOST DS    CL15      X         COSTING ACCOUNT                              
         SPACE 2                                                                
*        <   > DSECT FOR CREATIVE BILLING ELEMENT                               
         SPACE 1                                                                
ACCBILLD DSECT                                                                  
ACCBEL   DS    CL1       B         ELEMENT CODE X'3B'                           
ACCBLEN  DS    CL1       B         ELEMENT LENGTH X'21'                         
ACCBWORK DS    CL2       C         WORK CODE                                    
ACCBSOFA DS    PL6       P         BILLING SO FAR                               
ACCBTODA DS    PL6       P         BILLING TODAY                                
ACCBDATE DS    PL3       X         BILLING DATE                                 
ACCBGRSS DS    PL6       P         GROSS BILLED SO FAR                          
ACCBGRST DS    PL6       P         GROSS BILLED TODAY                           
         DS    CL2                 SPARE                                        
         SPACE 2                                                                
*        <   > DSECT TO COVER EXTRA PROFILE ELEMENT                             
         SPACE 1                                                                
ACXPROFD DSECT                                                                  
ACXPEL   DS    CL1       B         ELEMENT CODE                                 
ACXPELQ  EQU   X'3C'                                                            
ACXPLEN  DS    CL1       B         ELEMENT LENGTH X'18'                         
ACXPDUE  DS    PL2       P         NUMBER OF DAYS TO WORK OUT DUE DATE          
*                                  (DEFAULT = 10 DAYS)                          
ACXPOVER DS    PL3       P         PERCENT OF ESTIMATE WHICH, WHEN              
*                                  OVERSPENT, PROHIBITS BILLING.                
*                                  (2 DEC PLACES - DEFAULT = 100)               
ACXPLOW  DS    PL4       P         THE CASH LIMIT BELOW WHICH BILLS ARE         
*                                  NOT PRINTED (PENNIES - DEFAULT=$50)          
ACXPSUM  DS    CL1       X         OPTION TO PRINT SUMMARY Y(DEFAULT)/N         
ACXPNET  DS    CL1       X         PAY=NET OPTION Y OR N(DEFAULT)               
*                                  PAY=SNET 'S' PRESS COMMISSION                
ACXPDET  DS    CL1       X         OPTION NOT TO PRINT DETAIL LINES ON          
*                                  PROGRESSIVE BILLS (CLIENT LEVEL ONLY         
*                                  DEFAULT=Y)                                   
ACXPEDET DS    CL1       X         SHOW WORK-CODE LINES ON EST BILLING          
ACXPCD   DS    CL1       C         N=NO CASH DISCOUNT TO CLIENT                 
ACXPEST  DS    CL1       C         N=NO ESTIMATE REQUIRED FOR BILLING           
ACXPST1  DS    CL1       B         FIRST STATUS BYTE                            
*                                  X'80' NO AUTOMATIC ESTIMATES                 
*                                  X'40' ESTIMATE BILLS TAKE ZERO COMM.         
*                                  X'20' SUPPRESS SPOT/PRINT                    
*                                        BILLING TRANSFER                       
*                                  X'10' CLIENT/PRODUCT ARE NOT                 
*                                        FOR THE PRODUCTION SYSTEM              
*                                  X'08' POST GROSS+CD ON COSTING               
*                                        POSTINGS                               
*                                  X'04' JOB HAS UNAPPROVED ESTIMATE            
*                                  X'02' NEW JOBS FOR THIS CLIENT HAVE          
*                                        UNAPPROVED STATUS                      
*                                  X'01' PRINT W/CODE NO. ON AC21(UK)           
ACXPST2  DS    CL1       B         SECOND STATUS BYTE                           
*                                  X'80' AUTO UNHOLD WHEN BILLING               
*                                  X'40' BILL IN ALT LANG.(ENGLISH)             
*                                  X'20' COMMISSION ON NET LESS CD              
*                                  X'10' FREELANCE TAX NOT BILLED               
*                                   TO CLIENT                                   
*                                  X'08' SPLIT BILLING-ONLY 1                   
*                                   RECEIVABLE POSTING NOT MULTIPLES            
ACXPREP  DS    CL1       C         CODE FOR FILTER 2 WHEN AUTO                  
*                                  CHANGING %EST TO TOTAL BILL                  
ACXPBILL DS    CL1       C         NEW BILL TYPE FOR %EST JOB                   
ACXPINTC DS    XL2       B         COMMISSION RATE FOR INTERNAL WORK            
*                                  2 DEC PLACES                                 
         DS    CL1                 SPARE                                        
         SPACE 2                                                                
*        <   > DSECT TO COVER SALES ANALYSIS ELEMENT(PRODUCT ONLY)              
         SPACE 2                                                                
ACSAND   DSECT                                                                  
ACSAEL   DS    CL1       B         ELEMENT CODE X'3D'                           
ACSALN   DS    CL1       B         ELEMENT LENGTH X'35'                         
ACSACODE DS    CL15      C         ANALYSIS ACCOUNT (COMBINING CONTRA-          
*                                  ACCOUNT FOR INCOME POSTING)                  
ACSANAME DS    CL36      C         NAME OF THIS ACCOUNT                         
         SPACE 2                                                                
*        <   > DSECT TO COVER COMMENT ELEMENTS                                  
         SPACE 1                                                                
ACOMMD   DSECT                                                                  
ACOMEL   DS    CL1       B         ELEMENT CODE X'3E'                           
ACOMLEN  DS    CL1       B         ELEMENT LENGTH                               
ACOMSEQ  DS    CL1       B         COMMENT SEQUENCE NUMBER                      
ACOMTYPE DS    CL1       B         COMMENT TYPE BIT SETTINGS -                  
*                                  X'80' PRINT ON BILLS                         
*                                  X'40' PRINT ON ESTIMATES                     
*                                  X'08' PRINT BEFORE DATA                      
*                                  X'04' PRINT AFTER DATA                       
*                                  X'02' PROD ORDER FOOTLINE (NB X'06'          
*                                        MEANS NON-STANDARD, X'02' STD)         
*                                  X'00' SIGNIFIES STANDARD COMMENT             
ACOMMENT DS    0CL255    X         COMMENT                                      
*                                  OR 6-CHARACTER COMMENT CODE                  
         SPACE 2                                                                
*        <   > DSECT TO COVER ON-LINE MEMO ELEMENT                              
         SPACE 1                                                                
ACOLMD   DSECT                                                                  
ACOLEL   DS    CL1       B         ELEMENT CODE X'3F'                           
ACOLLEN  DS    CL1       B         ELEMENT LENGTH                               
ACOLMEM  DS    0CL255    X         COMMENT                                      
         SPACE 2                                                                
*        <   > DSECT TO COVER PERSONNEL ELEMENT                                 
         SPACE 1                                                                
ACPERSD  DSECT                                                                  
ACPSEL   DS    CL1       B         ELEMENT CODE X'40'                           
ACPSLEN  DS    CL1       B         ELEMENT LENGTH X'0B' OR X'0C'                
ACPSSTRT DS    PL3       P         HOURLY RATE EFFECTIVE START DATE             
ACPSRATE DS    PL4       P         HOURLY RATE (2 DEC PLACES)                   
*&&UK                                                                           
ACPSHOUR DS    PL2       P         HOURS/MONTH                                  
*&&                                                                             
*&&US                                                                           
ACPSHOUR DS    PL3       P         HOURS                                        
ACPSSTAT DS    CL1       X         STATUS                                       
ACPSBIL  EQU   X'80'               TYPE 'B' BILLED ITEM (DEBIT TO JOB)          
ACPSNOT  EQU   X'40'               TYPE 'N' NON-BILLED ITEM                     
ACPSRTE  EQU   X'20'               TYPE 'R' SPECIAL NON-BILLED ITEM             
ACPSADJ  EQU   X'01'               RATE WAS ADJUSTED                            
         DS    CL2                 SPARE                                        
ACPSLNQ  EQU   *-ACPERSD                                                        
*&&                                                                             
         SPACE 2                                                                
*        <   > DSECT TO COVER RULES ELEMENT                                     
         SPACE 1                                                                
ACRULED  DSECT                                                                  
ACRLEL   DS    CL1       B         ELEMENT CODE X'42'                           
ACRLELQ  EQU   X'42'                                                            
ACRLLEN  DS    CL1       B         ELEMENT LENGTH X'0A' OR X'0B'                
ACRLMED  DS    CL1       X         MEDIA CODE (X'00' = ALL)                     
ACRLWORK DS    CL2       X         WORK CODE  (X'00' = ALL)                     
ACRLCOMM DS    PL4       P       * COMMISSION RATE (2 DEC PLACES)               
ACRLTAX  DS    CL1       X       * TAX RATE CODE (Z=ZERO X=EXEMPT OR S)         
*                                * NOTE- IF ONLY ONE VALUE IS OVERRIDE,         
*                                  THE OTHER IS SET TO X'FF'                    
ACRLSTAT DS    CL1       X         STATUS X'80' ACRLCOMM 4 DEC PLACES           
         SPACE 2                                                                
*        <   > DSECT TO COVER SUB-ACCOUNT HEADER ELEMENT                        
         SPACE 1                                                                
TRSUBHD  DSECT                                                                  
TRSBEL   DS    CL1       B         ELEMENT CODE X'43'                           
TRSBLEN  DS    CL1       B         ELEMENT LENGTH                               
TRSBACNT DS    CL15      X         SUB ACCOUNT NUMBER                           
TRSBNAME DS    0CL36     A         0-36 BYTE SUB ACCOUNT NAME                   
*                                  LENGTH IS TRSBLEN - 17                       
         SPACE 2                                                                
*        <   > DSECT TO COVER TRANSACTION ELEMENT                               
         SPACE 1                                                                
TRANSD   DSECT                                                                  
TRNSEL   DS    CL1       B         ELEMENT CODE X'44'                           
TRNSELQ  EQU   X'44'                                                            
TRNSLEN  DS    CL1       B         ELEMENT LENGTH                               
TRNSDATE DS    CL3       P         DATE PACKED YMD                              
TRNSREF  DS    CL6       X         REFERENCE NUMBER                             
TRNSSBRF DS    CL1       B         SUB-REFERENCE (0-255)                        
TRNSTYPE DS    CL1       B         INPUT TYPE (1-N)                             
*                                  ACINPT IS A 15*N TABLE OF VALUES             
TRNSSTAT DS    CL1       B         STATUS BITS                                  
*                                  X'80'  1=DEBIT  0=CREDIT                     
*                                  X'40'  1=URGENT                              
*                                  X'20'  1=POSTING IS A REVERSAL               
*                                  X'10'  PEELED OFF (SET BY LOAD)              
*                                  X'08'  INVOICE AUTHORISED BIT (UK)           
*                                         CANADIAN $ PAYMENT (US TAL)           
*                                  X'08'  ADJUSTMENT TIME ON 1R                 
*                                  X'04'  TALENT-BILLED/PAID EX-SYSTEM          
*                                         HOLD FROM BILLING (UK/GE SJ)          
*                                         HOLD FROM CHEQUES (UK/GE VEN)         
*                                  X'02'  1=SELECTED FOR PAYMENT(VEN)           
*                                         OR BANK RECONCILIATION BIT            
*                                  X'01'  1=NON-COMMISSIONABLE ITEM             
TRNSBTCH DS    CL6       X         BATCH REFERENCE                              
TRNSAMNT DS    PL6       P         AMOUNT                                       
TRNSOFFC DS    0CL2                OFFICE                                       
TRNSWRKC DS    0CL2                WORK CODE                                    
TRNSANAL DS    CL2       X         ANALYSIS CODE (OR SPACES)                    
TRNSLNQ  EQU   *-TRANSD                                                         
TRNSNARR DS    0CL200              0-200 BYTE NARRATIVE                         
*                                  LENGTH OF NARRATIVE TRNSLEN - 28             
         SPACE 2                                                                
*        <   > DSECT TO COVER HISTORY ELEMENTS                                  
         SPACE 1                                                                
TRHISTD  DSECT                                                                  
TRHSEL   DS    CL1       B         ELEMENT CODE X'45'                           
TRHSLEN  DS    CL1       B         ELEMENT LENGTH X'10'                         
TRHSYEAR DS    PL1       P         PACKED YEAR                                  
TRHSMON  DS    PL1       P         PACKED MONTH                                 
TRHSDR   DS    PL6       P         DEBITS  IN MONTH                             
TRHSCR   DS    PL6       P         CREDITS IN MONTH                             
         SPACE 2                                                                
*        <   > DSECT TO COVER EXTRA PAYING INFORMATION (US)                     
         SPACE 1                                                                
TRPAYD   DSECT                                                                  
TRPYEL   DS    CL1       B         ELEMENT CODE X'46'                           
TRPYLEN  DS    CL1       B         ELEMENT LENGTH X'55'                         
TRPYCD   DS    PL6       P         CASH DISCOUNT                                
TRPYCLI  DS    CL20      X         CLIENT NAME                                  
TRPYPROD DS    CL20      X         PRODUCT NAME OR CODE                         
TRPYINV  DS    CL14      X         INVOICE NUMBER                               
TRPYPER  DS    CL17      X         PAY PERIOD                                   
TRPYTYPE DS    CL1       X         CODE                                         
TRPYEST  DS    CL2       B         PRINT EST. NUMBER (OR ZERO)                  
TRPYAGY  DS    CL2       C         MEDIA SYSTEM AGENCY CODE                     
TRPYSEQ  DS    XL1       B         CLEARANCE SEQUENCE NUMBER                    
TRPYLNQ  EQU   *-TRPAYD                                                         
TRPYMKT  DS    CL4                 SPOT MARKET NUMBER                           
TRPYCAT  DS    CL2                 SPOT ESTIMATE CATEGORY                       
         DS    XL6                 SPARE                                        
TRPYLN2Q EQU   *-TRPAYD                                                         
         SPACE 2                                                                
*        <   > DSECT TO COVER EXTRA PAYING INFORMATION (UK)                     
         SPACE 1                                                                
TRPUKD   DSECT                                                                  
TRPKEL   DS    CL1       B         ELEMENT CODE X'47'                           
TRPKELQ  EQU   X'47'                                                            
TRPKLEN  DS    CL1       B         ELEMENT LENGTH X'56'                         
TRPKSER  DS    CL4       V         SERIAL NUMBER (1 ALPHA/3 BINARY)             
TRPKIDAT DS    CL3       P         INSERTION/TRANSMISSION DATE (YMD)            
TRPKADAT DS    CL3       P         ACTIVITY DATE (YMD)                          
TRPKCLIC DS    CL5       C         CLIENT CODE                                  
TRPKCLI  DS    CL12      A         SHORT CLIENT NAME                            
TRPKPROD DS    CL12      A         SHORT PRODUCT NAME                           
TRPKREM  DS    CL15      A         SPACE/REMARKS                                
TRPKPOS  DS    CL3       A         POSITION CODE         * PRESS                
TRPKCOL  DS    CL3       A         COLOUR CODE           *                      
         ORG   TRPKPOS                                                          
TRPKSEC  DS    CL2       B         SECOND LENGTH         * TV/RADIO             
TRPKTIM  DS    CL4       V         TIME (SPECIAL FORMAT) *                      
TRPKGRSS DS    PL6       P         GROSS AMOUNT (+/-)                           
TRPKNETP DS    PL6       P         NET PAID (+/-)                               
TRPKVATP DS    PL6       P         VAT PAID (+/-)                               
TRPKSLSH DS    PL6       P         SLUSH (+=UNDER, -=OVERPAYMENT)               
TRPKLENQ EQU   *-TRPUKD            ELEMENT LENGTH                               
         SPACE 2                                                                
*        <   > DSECT TO COVER EXTRA BILLING INFORMATION                         
         SPACE 1                                                                
TRBILLD  DSECT                                                                  
TRBLEL   DS    CL1       X         ELEMENT CODE X'48'                           
TRBLLEN  DS    CL1       X         ELEMENT LENGTH X'50'                         
TRBLCOMM DS    PL6       P         COMMISSION BILLED                            
TRBLBILX DS    PL6       P         AMOUNT BILLED EXEMPT-OR CD FOR US            
TRBLBIL0 DS    PL6       P                       NIL-PAYABLE AMT FOR US         
TRBLBIL1 DS    PL6       P                       RATE 1                         
TRBLBIL2 DS    PL6       P                       RATE 2                         
TRBLBIL3 DS    PL6       P                       RATE 3                         
TRBLBIL4 DS    PL6       P                       RATE 4                         
TRBLBIL5 DS    PL6       P                       RATE 5                         
TRBLVAT1 DS    PL6       P         VAT BILLED    RATE 1                         
TRBLVAT2 DS    PL6       P                       RATE 2                         
TRBLVAT3 DS    PL6       P                       RATE 3                         
TRBLVAT4 DS    PL6       P                       RATE 4                         
TRBLVAT5 DS    PL6       P                       RATE 5                         
         SPACE 2                                                                
*        DSECT TO COVER REVERSE BILLING INFORMATION                             
         SPACE 1                                                                
REVBD    DSECT                                                                  
REVBEL   DS    CL1       B         ELEMENT CODE                                 
REVBELQ  EQU   X'49'                                                            
REVBLEN  DS    CL1       B         ELEMENT LENGTH X'0A'                         
REVBDAT  DS    CL2       B         ORIGINAL BILLING DATE (COMPRESSED)           
REVBUND  DS    CL2       B         REVERSE BILLING DATE(COMPRESSED)             
         DS    CL4                 SPARE                                        
REVBLNQ  EQU   *-REVBD                                                          
         SPACE 2                                                                
*        <   > DSECT TO COVER EXTRA BILLING INFORMATION                         
         SPACE 1                                                                
TRXBILLD DSECT                                                                  
TRXBEL   DS    CL1       B         ELEMENT CODE X'4A'                           
TRXBLEN  DS    CL1       B         ELEMENT LENGTH X'36'                         
TRXBMED  DS    CL15      X         MEDIA NAME                                   
TRXBPRD  DS    CL6       X         PRODUCT                                      
TRXBEST  DS    CL3                 ESTIMATE NUMBER                              
TRXBMOS  DS    CL6       X         MONTH OF SERVICE (MMM/YY)                    
TRXBINV  DS    CL10      X         INVOICE NUMBER                               
TRXBDAT  DS    PL3       P         INVOICE DATE (PACKED YMD)                    
TRXBTOT  DS    PL6       P         BILL TOTAL                                   
TRXBSHR  DS    PL3       P         SHARE OF BILL (2 DEC PL)                     
         SPACE 2                                                                
*        <   > DSECT FOR BILL NUMBER/DATE ELEMENT                               
         SPACE 1                                                                
TRBDETD  DSECT                                                                  
TRBDEL   DS    CL1       B         ELEMENT CODE                                 
TRBDELQ  EQU   X'4B'                                                            
TRBDLEN  DS    CL1       B         ELEMENT LENGTH X'10' OR X'20'                
TRBDNO   DS    CL6       C         BILL NO (IF BILLED)                          
*                                  SPACES =  ALLOCATED(NOT BILLED)              
*                                  BINARY ZEROS = SPARE ELEMENT                 
TRBDDTE  DS    XL2       B         BILL DATE (2-BYTE COMPRESSED)                
TRBDAMNT DS    XL4       B         ALLOCATED AMOUNT (BINARY)                    
TRBDCMR  DS    CL2       B         COMMISSION RATE                              
*&&US                                                                           
         ORG   TRBDCMR                                                          
TRBDCMP  DS    PL4       P         COMMISSION RATE PACKED                       
TRBDCMST DS    CL1       X         COMMISSION STATUS                            
TRBDCPAK EQU   X'80'               COMMISSION IS PACKED                         
TRBDCSD  DS    XL4       B         ALLOCATED CASH DISCOUNT                      
TRBDHRS  DS    XL4       B         ALLOCATED HOURS                              
TRBDWOT  DS    CL1       X         WRITE-OFF TYPE                               
TRBDFORM DS    CL2       C         FORMAT/GROUP LEVEL                           
TRBDTYPE DS    CL1       C         WORKCODE TYPE                                
TRBDVATC DS    CL1       C         VAT CODE                                     
*&&                                                                             
TRBDLNQ  EQU   *-TRBDETD                                                        
TRBDPSTC DS    CL1       C         PST CODE                                     
TRBDPRVC DS    CL2       C         PROVINCE CODE                                
TRBDMOS  DS    XL2       X         MOA - IF SET                                 
TRBDRUN  DS    XL2       B         RUNDATE (2-BYTE COMPRESSED)                  
TRBDLNQ2 EQU   *-TRBDETD                                                        
         SPACE 2                                                                
*        <   > DSECT FOR SUBSIDIARY POSTING DESCRIPTION                         
         SPACE 1                                                                
TRSDESCD DSECT                                                                  
TRSDEL   DS    CL1       B         ELEMENT CODE X'4C'                           
TRSDELQ  EQU   X'4C'                                                            
TRSDLEN  DS    CL1       B         ELEMENT LENGTH                               
TRSDACCS DS    0CL100    X         SUBSIDIARY ACCOUNTS POSTED TO                
*                                  AS A RESULT OF THIS TRANSACTION              
         SPACE 2                                                                
*        <   > DSECT TO COVER AUTHORISATION ELEMENT                             
         SPACE 1                                                                
TRAUTHD  DSECT                                                                  
TRAUEL   DS    CL1       B         ELEMENT CODE X'4D'                           
TRAULEN  DS    CL1       B         ELEMENT LENGTH X'11'                         
TRAUCODE DS    CL15      C         AUTH CODE FOR JOB POSTING                    
         SPACE 2                                                                
*        <   > DSECT TO COVER POSTING TRANSFER DETAILS ELEMENT                  
         SPACE 1                                                                
TRTRANSD DSECT                                                                  
TRTREL   DS    CL1       B         ELEMENT CODE X'4E'                           
TRTRLEN  DS    CL1       B         ELEMENT LENGTH X'15'                         
TRTRTYPE DS    CL1       C         F=TRANSFERRED FROM                           
*                                  T=TRANSFERRED TO                             
TRTRDATE DS    CL3       P         TRANSFER DATE                                
TRTRACC  DS    CL15      C         FROM/TO ACCOUNT CODE                         
         SPACE 2                                                                
*        <   > DSECT TO COVER CLI/PRO/JOB ELEMENT                               
         SPACE 1                                                                
TRCPJD   DSECT                                                                  
TRCPEL   DS    CL1       B         ELEMENT CODE X'4F'                           
TRCPELQ  EQU   X'4F'                                                            
TRCPLEN  DS    CL1       B         ELEMENT LENGTH X'17'                         
TRCPTYPE DS    CL1       C         J=JOB,E=EXPENSE,C=COMMERCIAL                 
*                                  T=T&R SPONSOR/EST#                           
TRCPCLI  DS    CL6       C         CLIENT                                       
         ORG   TRCPCLI+3                                                        
TRCPEMP  DS    CL3       C         PRIMARY EMPLOYER (US TALENT)                 
TRCPPROD DS    CL6       C         PRODUCT                                      
         ORG   TRCPPROD+3                                                       
TRCPCAT  DS    CL3       C         CATEGORY (US TALENT)                         
TRCPJOB  DS    CL6       C         JOB                                          
         ORG   TRCPJOB                                                          
TRCPCOM  DS    CL6       C         COMMERCIAL                                   
TRCPWC   DS    CL2       C         WORK CODE OF POSTING                         
         ORG   TRCPWC                                                           
TRCPUL   DS    CL2       C         COMMERCIAL UNIT AND LEDGER (US TAL)          
         ORG   TRCPCLI                                                          
TRCPACCT DS    CL12      C         EXPENSE ACCOUNT                              
         ORG   TRCPCLI                                                          
TRCPSPON DS    CL5                 SPONSOR                                      
TRCPEST  DS    CL15                ESTIMATE                                     
         SPACE 2                                                                
*        <   > DSECT TO COVER SUBSIDIARY CASH                                   
         SPACE 1                                                                
TRCASHD  DSECT                                                                  
TRCSEL   DS    CL1       B         ELEMENT CODE X'50'                           
TRCSELQ  EQU   X'50'                                                            
TRCSLEN  DS    CL1       B         ELEMENT LENGTH X'09' OR X'0F'                
TRCSTYPE DS    CL1       X         CASH TYPE  A=FEE ADJUSTMENT                  
*                                             B=BENEFIT                         
*                                             C=COMMISSION                      
*                                             D=CASH DISCOUNT                   
*                                             D=DEPRECIATION                    
*                                             E=GROSS/NET FOR COKE EXP          
*                                             E=TRANSFER AMT FOR GERMAN         
*                                               BATCH TYPE 46                   
*                                             F=FEES                            
*                                             G=GROSS BILLING                   
*                                             H=HOURS                           
*                                             I=INCOME                          
*                                             J=HOURS(H) DEBIT/CREDIT           
*                                             K=KUENSTLER(FREELANCE)TAX         
*                                             L=CREDIT LIMIT(SR ACCS.)          
*                                             M=GROSS ON FEE SI. (HOL)          
*                                             M=MILAGE ON SE/2P (UK)            
*                                             N=GROSS-VAT(UK)                   
*                                             O=FULLY MATCHED ORDER             
*                                             P=PART MATCHED ORDER              
*                                             R=COSTING RATE (SJ HOURS)         
*                                             S=AMOUNT POSTED TO EXP            
*                                             T=HOURS (UK SJ TIME)              
*                                             V=VEHICLES(DODGE)                 
*                                             W=VAT (ME09 SF POSTING)           
*                                             X=VAT (UK -SI)                    
*                                             Y=ASBOF (UK SI)                   
*                                               OR CHEQUE TOTAL IN              
*                                               OFFICE CHEQUE POSTINGS          
*                                               TO BANK ACCOUNTS                
TRCSAMNT DS    PL6       P         AMOUNT                                       
TRCSLNQ1 EQU   *-TRCASHD                                                        
TRCSADMN DS    PL6       P         ADMIN. AMOUNT FOR TYPE 'B'                   
         ORG   TRCSAMNT                                                         
TRCSGRS  DS    PL6       P         FOR TYPE E (COKE) GROSS IS DEBIT             
TRCSNET  DS    PL6       P         FOR TYPE E (COKE) NET IS CREDIT              
TRCSLNQ2 EQU   *-TRCASHD                                                        
         SPACE 2                                                                
*        <   > DSECT FOR PROJECT CONTROL ELEMENT                                
         SPACE 1                                                                
ACPCD    DSECT                                                                  
ACPCEL   DS    CL1       B         ELEMENT CODE X'51'                           
ACPCLEN  DS    CL1       B         ELEMENT LENGTH X'11' OR X'22'                
ACPCCLI  DS    CL15      X         CLI/PRD ACCOUNT INPUT ON TIME SHEET          
ACPCPRJT DS    CL15      X         PROJECT ACCOUNT                              
ACPCTSK  DS    CL2       X         TASK                                         
         SPACE 2                                                                
*        <   > DSECT TO COVER MONTHLY SALARY ELEMENT                            
         SPACE 1                                                                
ACSALRYD DSECT                                                                  
ACSALEL  DS    CL1       B         ELEMENT CODE X'52'                           
ACSALEN  DS    CL1       B         ELEMENT LENGTH X'11'                         
ACSALARY DS    PL6       P         MONTHLY SALARY (2 DEC PL)                    
ACSALBEG DS    CL2       P         START DATE                                   
ACSALEND DS    CL2       P         END DATE                                     
ACSALTYP DS    CL1       B         TYPE X'50' = SALARY                          
*                                       X'40' = OVERTIME                        
*                                       X'30' = TEMPORARY                       
*                                       X'20' = BONUS                           
*                                       X'15' = PENSION                         
*                                       X'10' = BENEFIT                         
*                                       X'09' = ADMINISTRATION                  
*                                       X'08' = BUDGET                          
*                                       X'07' = HOURLY RATE                     
ACSALSTA DS    CL1       B         STATUS X'20' = PERCENT 2 DP                  
*                                         X'10' = PERCENT 5 DP                  
*                                         X'00' = DOLLAR AMOUNT 2 DP            
ACSALBAS DS    CL1       X         BASIS M=MONTHLY                              
*                                        Q=QUARTERLY                            
*                                        Y=YTD                                  
*                                        A=ANNUAL                               
*                                        H=HOURLY                               
ACSALINS DS    CL2                 INSURANCE (DOLLARS/POUNDS/DM)                
         SPACE 2                                                                
*        <   > DSECT FOR TIME CHARGE ELEMENT                                    
         SPACE 1                                                                
ACCHARGD DSECT                                                                  
ACCHEL   DS    XL1       B         ELEMENT CODE X'53'                           
ACCHLEN  DS    XL1       B         ELEMENT LENGTH X'13'                         
ACCHCM   DS    CL6       C         CLIENT OR JOB MEDIA                          
*                                  BINARY ZEROES = ALL CLIENTS                  
ACCHAMT  DS    PL4       P         CHARGE RATE (2DEC PL)                        
ACCHDTE  DS    PL3       P         EFFECTIVE DATE (PWOS)                        
         DS    XL4                 SPARE                                        
         SPACE 2                                                                
*        <   > DSECT FOR OFFICE CHECK NUMBER ELEMENT                            
         SPACE 1                                                                
ACOFFD   DSECT                                                                  
ACOFEL   DS    CL1       B         ELEMENT CODE X'54'                           
ACOFLEN  DS    CL1       B         ELEMENT LENGTH X'25' OR X'2B'                
ACOFBEF  DS    CL6       X         STARTING CHECK NO. (=END AFTER LOAD)         
ACOFAFT  DS    CL6       X         ENDING NUMBER                                
ACOFID   DS    CL2       B         OFFICE ORIGIN ID                             
ACOFBANK DS    CL15      X         OFFICE/LEDGER BANK ACCOUNT                   
ACOFNTYP DS    CL1       X         OPTIONAL NUMBER TYPE                         
ACOFFILT DS    CL3       X         CLIENT OR (*) OFFICE FILTER                  
ACOFSTAT DS    CL1       X         STATUS BYTE ONE                              
*                                  X'80' PRINT DIRECT                           
*                                  X'40' OFFICE REQUIRED                        
*                                  X'20' PRINT CHECK NUMBER ON CHECK            
*                                  X'10' DIRECT REGISTER                        
*                                  X'08' AUTHORIZATION REQUIRED                 
*                                  X'04' DDS-SHUTTLE                            
*                                  X'02' AUTHORISED FOR SOON CHECKS             
*                                  X'01' AUTHORISED FOR LOCAL REGISTER          
ACOFLAST DS    CL6       X         LAST CHECK IN STOCK AT DDS                   
ACOFSTA2 DS    XL1                 STATUS BYTE TWO                              
ACOFMICR EQU   X'80'               X'80' MICRO PRINTER                          
ACOFFTP  EQU   X'40'               X'40' SEND TO PRINT QUE                      
ACOFLNQ2 EQU   *-ACOFFD                                                         
ACODDIS  DS    CL14                DISCOUNT ACCOUNT                             
ACOFSEQ  DS    XL2                 SEQUENCE FOR SOON CHECKS                     
ACOFDPSR DS    XL2                 DATE OF PENDING SOON REGISTER                
ACOFDPLR DS    XL2                 DATE OF PENDING LOCAL REGISTER               
ACOFSORT DS    XL1                 SORT SEQUENCE                                
ACOFPOFF DS    XL2                 OFFICE FOR CASH POSTING                      
ACOFLASR DS    XL1                 LASER                                        
ACOFLRED EQU   1                   LASERRED                                     
ACOFLBLU EQU   2                   LASERBLUE                                    
ACOFLGRN EQU   3                   LASERGREN                                    
ACOFLGLD EQU   4                   LASERGOLD                                    
ACOFLBRN EQU   5                   LASERBROW                                    
ACOFLVIO EQU   6                   LASERVIOL                                    
ACOFLWSP EQU   7                   LASERVIOL                                    
         DS    XL2                 SPARE                                        
ACOFLNQ  EQU   *-ACOFFD                                                         
         SPACE 2                                                                
*        <   > DSECT TO COVER PRIOR CONTRA BUCKETS                              
         SPACE 1                                                                
ACPBKD   DSECT                                                                  
ACPBKEL  DS    CL1       B         ELEMENT CODE X'55'                           
ACPBKLEN DS    CL1       B         ELEMENT LENGTH X'16'                         
ACPBKLOW DS    CL2       P         MONTH OF FIRST BUCKET                        
ACPBKHI  DS    CL2       P         MONTH OF LAST BUCKET                         
ACPBKDR  DS    PL8       P         DEBITS                                       
ACPBKCR  DS    PL8       P         CREDITS                                      
         SPACE 2                                                                
*        <   > DSECT TO EXTRA NAME ELEMENTS                                     
         SPACE 1                                                                
ACXNMD   DSECT                                                                  
ACXNMEL  DS    CL1       B         ELEMENT CODE X'56'                           
ACXNMLEN DS    CL1       B         ELEMENT LENGTH                               
ACXNMSTT DS    XL1       B         STATUS/LANGUAGE                              
ACXNMSD  EQU   *                   SUB-ELEMENT FOR SEVERAL NAMES                
ACXNMSL  DS    XL1       B         SUB-ELEMENT LENGTH                           
ACXNMSN  DS    0C        B         SUB-ELEMENT NAME                             
         SPACE 2                                                                
*        <   > DSECT TO ACCOUNT POINTER ELEMENT                                 
         SPACE 1                                                                
ACPTRD   DSECT                                                                  
ACPTREL  DS    CL1       B         ELEMENT CODE X'57'                           
ACPTRLEN DS    CL1       B         ELEMENT LENGTH X'13'                         
ACPTRST  DS    XL1       B         STATUS                                       
*                                  X'80' IS BANK ACCOUNT ON CLIENT              
*                                        OR ON LEDGER                           
*                                  X'40' IS TAX ACCOUNT ON LEDGER               
         DS    XL1       B         SPARE                                        
ACPTRAC  DS    XL15      B         ACCOUNT CODE                                 
ACPTRLNQ EQU   *-ACPTREL                                                        
         SPACE 2                                                                
*        <   > DSECT FOR INT'L CURR DATA FROM MEDLINE                           
         SPACE 1                                                                
AIAD     DSECT                                                                  
AIAEL    DS    C         B         ELEMENT CODE X'58'                           
AIALEN   DS    C         B         ELEMENT LENGTH                               
AIACURR  DS    CL5       C         CURTAB ENTRY                                 
AIARATE  DS    CL4       B         RATE                                         
AIAX     DS    0CL7                EXCHANGE RATE RULE                           
AIAXST   DS    C         X         STATUS - X'01' DIVIDE BY RATE                
AIAXRT   DS    CL5       P         PWOS RATE (99999.99999)                      
AIAXSH   DS    C         B         SHIFT VALUE FOR DEC PLACE DIFF'NCE           
AIADATE  DS    CL3       P         PWOS LATEST RE-VALUATION DATE                
AIALENQ  EQU   *-AIAEL                                                          
         SPACE 2                                                                
*        <   > DSECT FOR PRICELIST TRANSACTIONS (GERMANY)                       
         SPACE 1                                                                
TRPRICED DSECT                                                                  
TRPREL   DS    C         B         ELEMENT CODE X'59'                           
TRPRLEN  DS    C         B         ELEMENT LENGTH X'0A'                         
TRPRCDE  DS    CL4       C         PRICELIST CODE                               
TRPRNUM  DS    CL4       C         NUMBER OF ITEMS                              
         SPACE 2                                                                
*        <   > DSECT FOR GENERAL PURPOSE NAME ELEMENT                           
         SPACE 1                                                                
ACGNELD  DSECT                                                                  
ACGNEL   DS    XL1                 ELEMENT CODE                                 
ACGNELQ  EQU   X'5A'                                                            
ACGNLN   DS    XL1                 ELEMENT LENGTH                               
ACGNTYP  DS    XL1                 TYPE                                         
ACGNTLST EQU   1                   LAST NAME                                    
ACGNTFST EQU   2                   FIRST NAME MI.                               
ACGNLNQ  EQU   *-ACGNELD                                                        
ACGNNME  DS    0CL36                                                            
         SPACE 2                                                                
*        <   > DSECT FOR EMPLOYEE HISTORY ELEMENT                               
         SPACE 1                                                                
ACEMPD   DSECT                                                                  
ACEMPEL  DS    X         B         ELEMENT CODE X'5A' (UK) X'56' (US)           
ACEMPLEN DS    X         B         ELEMENT LENGTH X'14'                         
ACEMPHIR DS    XL3       P         HIRE DATE PACKED YMD                         
ACEMPTRM DS    XL3       P         TERMINATION DATE PACKED YMD                  
ACEMPLOK DS    XL3       P         LOCK TIME SHEET DATE PACKED YMD              
ACEMPST  DS    XL1                 STATUS BYTE                                  
ACEMPEX  EQU   X'80'               EMPLOYEE IS AN EXECUTIVE                     
ACEMPPRO EQU   X'40'               PROD REQUIRED                                
ACEMPJOB EQU   X'20'               JOB REQUIRED                                 
ACEMPACT EQU   X'10'               USE ACTUAL AS STANDARD HOURS                 
ACEMPLOC EQU   X'08'               ACCOUNT LOCKED (DIFF FROM TIMESHEET)         
ACEMPST2 DS    XL1                 CURRENT STATUS (DEFAULT ACTIVE)              
ACEMPTER EQU   1                   TERMINATED                                   
ACEMPLOA EQU   2                   LEAVE OF ABSENCE                             
         DS    XL7                 N/D                                          
ACEMPLNQ EQU   *-ACEMPD            LENGTH                                       
         SPACE 2                                                                
*        <   > DSECT FOR EXTRA BILLING ELEMENT (GERMANY)                        
         SPACE 1                                                                
TRBILLGD DSECT                                                                  
TRBGEL   DS    X         B         ELEMENT CODE X'5B'                           
TRBGLEN  DS    X         B         ELEMENT LENGTH X'1A'                         
TRBGIINC DS    PL6       P         INTERNAL INCOME                              
TRBGIGRS DS    PL6       P         INTERNAL GROSS                               
TRBGEINC DS    PL6       P         EXTERNAL INCOME                              
TRBGEGRS DS    PL6       P         EXTERNAL GROSS                               
TRBGLNQ  EQU   *-TRBILLGD          LENGTH                                       
         SPACE 2                                                                
*        <   > DSECT FOR UNBILL DATA FOR CLIENT BILLS                           
         SPACE 1                                                                
TRBUETD  DSECT                                                                  
TRBUEL   DS    CL1       B         ELEMENT CODE X'5C'                           
TRBUELQ  EQU   X'5C'                                                            
TRBULEN  DS    CL1       B         ELEMENT LENGTH X'28'                         
TRBUNO   DS    CL6       C         BILL NO                                      
TRBUDTE  DS    XL2       B         BILLED DATE                                  
TRBUAMNT DS    XL4       B         BILLED AMOUNT                                
TRBUCMR  DS    CL2       B         COMMISSION RATE                              
*&&US                                                                           
         ORG   TRBUCMR                                                          
TRBUCMP  DS    PL4       P         COMMISSION RATE PACKED                       
TRBUCMST DS    CL1       X         COMMISSION STATUS                            
TRBUCSD  DS    XL4       B         CASH DISCOUNT BILLED                         
TRBUHRS  DS    XL4       B         HOURS BILLED                                 
TRBUWOT  DS    CL1       C         WRITE-OFF TYPE                               
TRBUFORM DS    CL2       C         FORMAT/GROUP LEVEL                           
TRBUTYPE DS    CL1       C         WORKCODE TYPE                                
TRBUVATC DS    CL1       C         VAT CODE                                     
TRBUUNNO DS    CL6       C         UNBILL BILL NO                               
TRBUUND  DS    XL2       B         UNBILLED DATE                                
*&&                                                                             
TRBULNQ  EQU   *-TRBUETD                                                        
TRBUPSTC DS    CL1       C         PST CODE                                     
TRBUPRVC DS    CL2       C         PROVINCE CODE                                
TRBUMOA  DS    CL2       X         MOA - IF SET                                 
TRBURUN  DS    XL2       X         RUN DATE OF BILLING                          
TRBULNQ2 EQU   *-TRBUETD                                                        
         SPACE 2                                                                
*        <   > DSECT TO COVER BUDGETTED SALARY ELEMENT                          
         SPACE 1                                                                
ACBSALD  DSECT                                                                  
ACBSALEL DS    CL1       B         ELEMENT CODE X'5D'                           
ACBSALEN DS    CL1       B         ELEMENT LENGTH                               
ACBSSTRT DS    PL3       X         YEAR/MONTH/DAY                               
ACBSENDT DS    PL3       X         YEAR/MONTH/DAY                               
ACBSDGNO DS    CL2       X         BINARY BUDGET NUMBER                         
ACBSMNLY DS    0PL4      P         MONTHLY CURRENT SALARY                       
ACBSWKLY DS    PL4       P         WEEKLY CURRENT SALARY                        
ACBSYRLY DS    PL5       P         YEARLY CURRENT SALARY                        
ACBSMON1 DS    0XL1      X         MONTH OF INCREASE (PWOS)                     
ACBSQTR1 DS    CL1       C         QUARTER OF INCREASE (1, 2, 3, OR 4)          
ACBSMON2 DS    0XL1      X         MONTH OF 2ND INCREASE                        
ACBSQTR2 DS    CL1       C         QUARTER OF 2ND INCREASE                      
*                                                                               
ACBSINC1 DS    PL3       P         AMOUNT OF 1ST YRLY INCREASE                  
ACBSINC2 DS    PL3       P         AMOUNT OF 2ND YRLY INCREASE                  
ACBSBSAL DS    PL5       P         BUDGETED YEARLY SALARY                       
ACBSTA1  DS    XL1       X         STATUS BITS                                  
ACBSMON  EQU   X'80'               ELEMENT IS MONTHLY (DEFAULT IS QTR)          
         DS    CL4                 SPARE                                        
ACBSLNEQ EQU   *-ACBSALD                                                        
         SPACE 2                                                                
*        <   > DSECT TO COVER CLIENT ALLOCATION ELEMENT                         
         SPACE 1                                                                
ACCLPCTD DSECT                                                                  
ACCLPCEL DS    CL1       B         ELEMENT CODE X'5E'                           
ACCLPCLN DS    CL1       B         ELEMENT LENGTH,  VARIABLE- MAX=X'F9'         
ACCLPCST DS    CL2       X         COMPRESSED START DATE                        
ACCLPCEN DS    CL2       X         COMPRESSED END DATE                          
ACCLBDNO DS    CL2       B         BUDGET NUMBER                                
*                                  UP TO 27 PAIRS OF CLIENT/PRODUCT             
*                                  PERCENT FILEDS.                              
ACCLTPRD DS    CL6       C         CLIENT-PRODUCT                               
ACCPRCNT DS    PL3       P         PERCENT-CARRIES 2 DEC PRECISION              
         SPACE 2                                                                
*        <   > DSECT TO COVER SALES/USE TAX RATES                               
         SPACE 1                                                                
ACTAXD   DSECT                                                                  
ACTAXEL  DS    CL1       B         ELEMENT CODE X'5F'                           
ACTAXLEN DS    CL1       B         ELEMENT LENGTH X'12' OR X'20'                
ACTAXEFF DS    CL3       P         EFFECTIVE DATE                               
ACTAXRTE DS    PL4       P         TAX RATE(4DP)                                
ACTAXBAS DS    PL6       P         TAX BASIS(TRANSACTIONS ONLY)                 
         DS    CL3                 SPARE                                        
ACTAXLQ1 EQU   *-ACTAXD            LENGTH EQUATE                                
ACTAXACC DS    CL14      C         CREDIT ACCOUNT                               
         ORG   ACTAXACC                                                         
ACTAXLOC DS    CL14      C         LOCALITY KEY(ON TRANSACTIONS)                
ACTAXLQ2 EQU   *-ACTAXD            LENGTH EQUATE                                
         SPACE 2                                                                
*        <   > DSECT TO COVER TRANSACTION STATUS                                
         SPACE 1                                                                
TRSTATD  DSECT                                                                  
TRSTEL   DS    CL1       B         ELEMENT CODE X'60'                           
TRSLEN   DS    CL1       B         ELEMENT LENGTH X'20'                         
TRSTDATE DS    CL2       B         ACTIVITY DATE                                
TRSTATUS DS    CL1       X         '80'=1 IF UPDATED TO G/L, 0 IF REV.          
*                                  X'40'=O&M CONVERSION TRANSACTION             
*                                  X'20' ON=G/L,OFF=PRODUCTION BATCH            
*                                  X'10' ON=PEELED-OFF (CLOSED-OUT)             
*                                  X'08' ON=OFFSET PAYABLES ITEM                
TRSTREVD DS    CL2       B         DATE ITEM MARKED AS REVERSAL                 
TRSTUPDT DS    CL2       B         DATE ITEM MARKED BY GLU                      
TRSTPMOS DS    CL2       P         POSTING MOS (PWOS YM)                        
TRSTUSER DS    CL2       X         ORIGIN ID NUMBER OF USER                     
TRSTUDAT DS    CL2       X         USED DATE (COMPRESSED)                       
TRSTPDAT DS    CL2       X         PEEL DATE (COMPRESSED)                       
TRSTUREQ DS    PL2       P         USED PROGRAM REQUEST NUMBER                  
TRSTUMOS DS    CL2       P         USED PROGRAM MOS (PWOS YM)                   
TRSTBSEQ DS    XL2       X         BATCH SEQUENCE NUMBER (OR ZERO)              
TRSTRMOS DS    PL2       P         MOS VALUE OF REVERSING TRANSACTION           
TRSTMARK DS    XL1       X         LAST MARKER ACTION                           
TRSTSTA2 DS    XL1       X         STATUS BYTE 2                                
TRSTSTA3 DS    XL1       X         STATUS BYTE 3                                
TRSTREJT EQU   X'40'               COKE ONLY - EXPENSE - REJECTED ITEMS         
TRSTBSDT DS    XL2       ?         BANK STATEMENT DATE (CASH LEDGER)            
TRSTEFDT DS    XL2       ?         TRANSACTION EFFECTIVE DATE                   
TRSLENQ  EQU   *-TRSTATD                                                        
         SPACE 2                                                                
*        <   > DSECT TO COVER DUE DATE ELEMENT                                  
         SPACE 1                                                                
TRDUED   DSECT                                                                  
TRDUEL   DS    CL1       B         ELEMENT CODE X'61'                           
TRDUELQ  EQU   X'61'                                                            
TRDUEN   DS    CL1       B         ELEMENT LENGTH X'04'                         
TRDUDATE DS    CL2       B         DUE DATE FOR RECEIVABLES                     
*                                  OR PAYMENT DATE FOR GERMAN PAYEES            
TRDULNQ  EQU   *-TRDUED                                                         
         SPACE 2                                                                
*        <   > DSECT TO COVER DISTRIBUTION SCHEME RECORD                        
         SPACE 1                                                                
ACDISTD  DSECT                                                                  
ACDIEL   DS    CL1       B         ELEMENT CODE X'62'                           
ACDILEN  DS    CL1       B         ELEMENT LENGTH X'0A'                         
ACDICODE DS    CL2       X         SCHEME CODE                                  
ACDIVAL  DS    PL6       P         NO OF UNITS (2 DEC PL)                       
         SPACE 2                                                                
*        <   > DSECT TO COVER HOMES ELEMENT                                     
         SPACE 1                                                                
ACHOMED  DSECT                                                                  
ACHMEL   DS    CL1       X         ELEMENT TYPE X'63'                           
ACHMLEN  DS    CL1       X         ELEMENT LENGTH X'08'                         
ACHMNO   DS    PL6       P         NO OF HOMES                                  
         SPACE 2                                                                
*        <   > DSECT FOR MANUAL PAYMENT ELEMENT                                 
         SPACE 1                                                                
TRMAPD   DSECT                                                                  
TRMAPEL  DS    XL1       X         ELEMENT CODE X'64'                           
TRMAPELQ EQU   X'64'                                                            
TRMAPLEN DS    XL1       X         ELEMENT LENGTH X'1E'                         
TRMAPNO  DS    CL6       C         NUMBER OF MANUAL CHEQUE                      
TRMAPDTE DS    XL2       X         DATE OF CHEQUE                               
TRMAPAMT DS    PL6       P         AMOUNT OF CHEQUE                             
TRMAPBNK DS    CL14      C         UL ACCOUNT OF BANK ACCOUNT                   
TRMAPLNQ EQU   *-TRMAPD                                                         
         SPACE 2                                                                
*        <   > DSECT TO COVER PRODUCTION ORDER NUMBER CONTROL ELEMENT           
         SPACE 1                                                                
ACONUMD  DSECT                                                                  
ACONEL   DS    CL1       B         ELEMENT CODE X'66'                           
ACONLEN  DS    CL1       B         ELEMENT LENGTH X'08'                         
ACONUM   DS    CL6       C         LAST ORDER NUMBER AUTO-GENERATED             
ACONLNQ  EQU   *-ACONUMD                                                        
         SPACE 2                                                                
*        <   > DSECT TO COVER PRODUCTION ORDER ELEMENT                          
         SPACE 1                                                                
ACORDRD  DSECT                                                                  
ACOREL   DS    CL1       B         ELEMENT CODE X'67'                           
ACORLEN  DS    CL1       B         ELEMENT LENGTH X'3C' OR X'50'                
ACORJOB  DS    CL15      C         CLIENT/PRODUCT/JOB ACCOUNT CODE              
         ORG   ACORJOB                                                          
ACOREXP  DS    CL15      C         EXPENSE ACCOUNT CODE                         
ACORSUPP DS    CL15      C         SUPPLIER ACCOUNT CODE                        
ACORDATE DS    PL3       P         ORDER DATE                                   
ACORAUTH DS    CL15      C         AUTHORISED BY                                
ACORAMNO DS    CL1       B         LATEST AMENDMENT NUMBER                      
ACORAMDT DS    PL3       P         LATEST AMENDMENT DATE                        
ACORREQD DS    CL20      C         REQUIRED BY - FREE FORM (UK)                 
         ORG   ACORREQD                                                         
ACORDDTE DS    PL3       P         DUE DATE (US)                                
ACORATTN DS    CL20      C         ATTN NAME (US)                               
ACORTAX  DS    CL1       C         TAX REPLY                                    
ACORSTAT DS    XL1       X         STATUS BYTE                                  
ACORSPRE EQU   X'80'               ORDER IS A PRESTO ORDER                      
ACORSPAR EQU   X'20'               ORDER IS PARTIALLY PAID                      
         DS    CL1                 SPARE (1 SPARE IN US)                        
ACORLNQ  EQU   *-ACORDRD                                                        
         DS    CL3                 SPARE (5 SPARE IN UK)                        
         SPACE 2                                                                
*        <   > DSECT TO COVER PRODUCTION ORDER AMOUNT ELEMENT                   
         SPACE 1                                                                
ACOAMTD  DSECT                                                                  
ACOAEL   DS    CL1       B         ELEMENT CODE X'68'                           
ACOALEN  DS    CL1       B         ELEMENT LENGTH X'18' OR X'35'                
ACOASTAT DS    CL1       X         STATUS/SEQUENCE                              
*                                  X'80' 1=NON-COMMISSIONABLE                   
*                                  X'40' 0=MAJOR, 1=MINOR (US ONLY)             
ACOAWC   DS    CL2       C         WORK CODE                                    
ACOAMT   DS    PL6       P         ESTIMATED AMOUNT                             
ACOAINUM DS    PL6       P         NUMBER OF INVOICES TO DATE                   
ACOAIVAL DS    PL6       P         AMOUNT INVOICED TO DATE                      
         DS    CL1                 SPARE                                        
ACOLNQ1  EQU   *-ACOAMTD                                                        
ACOPAMT  DS    PL6       P         AMOUNT INVOICED TODAY                        
ACOPDATE DS    PL3       P         LAST ACTIVITY DATE                           
         DS    CL20                SPARE                                        
ACOLNQ2  EQU   *-ACOAMTD                                                        
         SPACE 2                                                                
*        <   > DSECT TO COVER FEE ACCOUNTING RULE ELEMENT                       
         SPACE 1                                                                
ACRULD   DSECT                                                                  
ACRUEL   DS    CL1       X         ELEMENT CODE X'69'                           
ACRULEN  DS    CL1       B         ELEMENT LENGTH (4+L'DET)                     
ACRULEFF DS    CL2       X         EFFECTIVE DATE (OPTIONAL)                    
ACRULDET DS    0C        C         KEYWORD=DATA                                 
         SPACE 2                                                                
*        <   > DSECT TO COVER ASSET DESCRIPTION ELEMENT                         
         SPACE 1                                                                
ACASSD   DSECT                                                                  
ACASEL   DS    CL1       X         ELEMENT CODE X'6A'                           
ACASLEN  DS    CL1       B         ELEMENT LENGTH X'58'                         
ACASCP   DS    PL6       P         COST PRICE (2DECPL)                          
ACASPD   DS    XL2       X         PURCHASE DATE (COMPRESSED)                   
ACASLOC  DS    CL26      C         LOCATION (FREE FORM)                         
ACASREF  DS    CL12      C         REFERENCE (FREE FORM)                        
ACASSUP  DS    CL14      C         SUPPLIER (ULACCT)                            
ACASBAT  DS    PL6       P         BOOK 'AS AT' VALUE                           
ACASBDTE DS    XL2       X         BOOK 'AS AT' DATE                            
ACASTAT  DS    PL6       P         TAX 'AS AT' VALUE                            
ACASTDTE DS    XL2       X         TAX 'AS AT' DATE                             
         DS    CL10      X         SPARE                                        
         SPACE 2                                                                
*        <   > DSECT TO COVER ASSET DISPOSAL ELEMENT                            
         SPACE 1                                                                
ACADISD  DSECT                                                                  
ACADDEL  DS    CL1       X         ELEMENT CODE X'6B'                           
ACADDLEN DS    CL1       X         ELEMENT LENGTH X'10'                         
ACADDAMT DS    PL6       P         DISPOSAL AMOUNT                              
ACADDTE  DS    CL2       X         DISPOSAL DATE                                
         DS    CL6       X         SPARE                                        
         SPACE 2                                                                
*        <   > DSECT TO COVER DEPRECIATION CONTROL ELEMENT                      
         SPACE 1                                                                
ACADPD   DSECT                                                                  
ACADPEL  DS    CL1       X         ELEMENT CODE X'6D'                           
ACADPLEN DS    CL1       X         ELEMENT LENGTH X'28'                         
*                                  BOOK VALUE CONTROL                           
ACADBTYP DS    CL1       C         PERIOD OF DEPRECIATION                       
*                                  A=ANNUAL                                     
*                                  Q=QUARTERLY                                  
*                                  M=MONTHLY                                    
ACADBPCT DS    PL4       P         PERCENTAGE (4 DEC PL)                        
ACADBBAS DS    CL1       C         DEPRECIATION BASIS                           
*                                  C=CURRENT VALUE                              
*                                  P=PURCHASE PRICE                             
         DS    CL14      X         SPARE                                        
*                                  TAX VALUE CONTROL                            
ACADTTYP DS    CL1       C         PERIOD OF DEPRECIATION                       
ACADTPCT DS    PL4       P         PERCENTAGE (4 DEC PL)                        
ACADTBAS DS    CL1       C         DEPRECIATION BASIS                           
ACADTSTA DS    XL1       B         STATUS                                       
*                                  X'80' IS A MOTOR CAR                         
         DS    CL11      X         SPARE                                        
         SPACE 2                                                                
*        <   > DSECT TO COVER RATE OF INTEREST BY DATE ELEMENT                  
         SPACE 1                                                                
ACRATED  DSECT                                                                  
ACRIEL   DS    CL1                 ELEMENT CODE                                 
ACRIELQ  EQU   X'6E'                                                            
ACRILEN  DS    CL1                 ELEMENT LENGTH                               
ACRILEQ  EQU   X'07'                                                            
ACRIDAT  DS    XL2                 AS OF DATE                                   
ACRIRAT  DS    XL3                 INTEREST RATE                                
         SPACE 2                                                                
ACPHELD  DSECT                     ** PERSONAL HOURLY RATE ELEMENT **           
ACPHREL  DS    XL1                 ELEMENT CODE                                 
ACPHRELQ EQU   X'80'                                                            
ACPHLN   DS    XL1                 ELEMENT LENGTH                               
ACPHPER  DS    0XL2                PERIOD                                       
ACPHYR   DS    XL1                 YEAR                                         
ACPHMON  DS    XL1                 MONTH                                        
ACPHMTH  DS    CL1                 METHOD OF ALLOCATION                         
ACPHNUM  DS    XL1                 NUMBER OF SALARY SUB-ELEMENTS                
ACPHLN1Q EQU   *-ACPHELD                                                        
*                                                                               
ACPHNTRY DS    0X                  SALARY SUB-ELEMENT                           
ACPHNLEN DS    XL1                 LENGTH OF SUB-ELEMENT                        
ACPHTYPE DS    CL1                 SALARY TYPE                                  
ACPHTSAL EQU   C'1'                BASE SALARY                                  
ACPHTBEN EQU   C'2'                BENEFIT                                      
ACPHTPEN EQU   C'3'                PENSION                                      
ACPHTADM EQU   C'4'                ADMINISTRATION                               
ACPHTTMP EQU   C'5'                TEMPORARY                                    
ACPHTBON EQU   C'6'                BONUS                                        
ACPHTOVT EQU   C'7'                OVERTIME                                     
ACPHRATE DS    PL5                 HOURLY RATE (4 DP)                           
ACPHLN2Q EQU   *-ACPHNTRY                                                       
         SPACE 2                                                                
*        <   > DSECT TO COVER TRAILER ELEMENT                                   
         SPACE 1                                                                
ACFILED  DSECT                                                                  
ACFLEL   DS    CL1       B         ELEMENT CODE X'90'                           
ACFLLEN  DS    CL1       B         ELEMENT LENGTH X'1F'                         
ACFLGEN  DS    PL4       P         GENERATION NUMBER                            
ACFLRECS DS    PL6       P         NUMBER OF RECORDS ON FILE                    
ACFLDR   DS    PL8       P         TOTAL FILE DEBITS                            
ACFLCR   DS    PL8       P         TOTAL FILE CREDITS                           
ACFLDATE DS    PL3       P         DATE GENERATED                               
         SPACE 1                                                                
*                                                                               
*                                                                               
         SPACE 2                                                                
*        <   > DSECT TO COVER O+M JOB DATA ELEMENT                              
*                                                                               
ACJVD    DSECT                                                                  
ACJVEL   DS    X                   ELEMENT CODE X'99'                           
ACJVELQ  EQU   X'99'                                                            
ACJVLEN  DS    X                   ELEMENT LENGTH                               
ACJVAM   DS    X                   O+M AGENCY/MEDIA                             
ACJVCLT  DS    CL2                 O+M CLIENT CODE                              
ACJVPRD  DS    CL2                 O+M PRODUCT CODE                             
ACJVJOB  DS    CL6                 O+M JOB NUMBER                               
ACJVLENQ EQU   *-ACJVD             ELEMENT LENGTH                               
         SPACE 3                                                                
*        <   > DSECT TO COVER TALENT SYSTEM DETAILS                             
         SPACE 1                                                                
ACTAD    DSECT                                                                  
ACTAEL   DS    CL1                 ELEMENT CODE                                 
ACTAELQ  EQU   X'9D'                                                            
ACTALEN  DS    CL1                 ELEMENT LENGTH                               
ACTAAGY  DS    CL6                 AGENCY                                       
ACTACLI  DS    CL6                 CLIENT                                       
ACTAPRD  DS    CL6                 PRODUCT                                      
ACTACID  DS    CL12                COMMERCIAL ID                                
ACTAEST  DS    CL16                ESTIMATE NUMBER                              
ACTASTAT DS    CL1                 ERROR STATUS                                 
ACTASCLI EQU   X'80'               CLIENT MISSING                               
ACTASPRD EQU   X'40'               PRODUCT MISSING                              
ACTASJOB EQU   X'20'               JOB MISSING                                  
ACTASACC EQU   X'10'               ACCOUNT INVALID                              
ACTASLCK EQU   X'08'               ACCOUNT LOCKED                               
ACTASCLO EQU   X'04'               ACCOUNT CLOSED                               
ACTASXJB EQU   X'02'               XJOB - INTERNAL ERROR FROM ACXJOB            
ACTASDRF EQU   X'01'               DRAFT JOB                                    
ACTASTA2 DS    CL1                 ERROR STATUS 2                               
ACTASTP  EQU   X'80'               TP MUST FIX THIS ONE                         
ACTASX1  EQU   X'04'               XJOB - NO SE ACCOUNT                         
ACTASX2  EQU   X'02'               XJOB - NO DEPARTMENT                         
ACTASX3  EQU   X'01'               XJOB - NO STAFF                              
ACTALNQ  EQU   *-ACTAD                                                          
         SPACE 3                                                                
*        <   > DSECT TO COVER PROD INTRFACE AMOUNTS BY CATEGORY ELEMENT         
         SPACE 1                                                                
PICATD   DSECT                                                                  
PICAEL   DS    CL1       B         ELEMENT CODE X'9E'                           
PICALEN  DS    CL1       B         ELEMENT LENGTH X'19'                         
PICACAT  DS    CL1       B         CATEGORY EQUATE                              
PICANUM  DS    CL1       B         NUMBER OF PEOPLE IN CATEGORY                 
         DS    CL1                 SPARE                                        
PICAFEES DS    CL4       B         FEES                                         
PICAPNW  DS    CL4       B         P&W AMOUNT                                   
PICAHNW  DS    CL4       B         H&W AMOUNT                                   
PICATNH  DS    CL4       B         T&H AMOUNT                                   
PICACR   DS    CL4       B         CREDITS                                      
PICALNQ  EQU   *-PICATD                                                         
         SPACE 3                                                                
*        <   > DSECT TO COVER PROD INTRFACE DESCRIPTION ELEMENT                 
         SPACE 1                                                                
PIDESD   DSECT                                                                  
PIDEEL   DS    CL1       B         ELEMENT CODE X'9F'                           
PIDELEN  DS    CL1       B         ELEMENT LENGTH X'3A'                         
PIDEISCI DS    CL8       C         ISCII CODE OF MAIN COMMERCIAL                
PIDESEC  DS    CL1       B         LENGTH IN SECONDS OF MAIN COMMERCIAL         
PIDEISCL DS    CL8       C         ISCII CODE OF LIFT                           
PIDESECL DS    CL1       B         LENGTH IN SECONDS OF LIFT                    
PIDENAME DS    CL20      C         TITLE                                        
PIDEUSE  DS    CL1       B         USE EQUATE                                   
PIDECYCS DS    CL3       P         CYCLE START                                  
PIDECYCE DS    CL3       P           AND END DATE                               
PIDEUNIT DS    CL2       B         NUMBER OF UNITS                              
PIDEMAJ  DS    CL1       B                   MAJOR CITIES X'80'=NY              
*                                                         X'40'=LA              
*                                                         X'20'=CHICAGO         
PIDEUSN1 DS    CL2       B         FROM NUMBER OF USES                          
PIDEUSN2 DS    CL2       B         TO NUMBER OF USES                            
PIDECSF  DS    CL4       B         CONTRACT SERVICE FEE                         
PIDELNQ  EQU   *-PIDESD                                                         
         SPACE 2                                                                
*        <   > DSECT TO COVER PRODUCTION GROUP ELEMENT                          
         SPACE 1                                                                
ACGPD    DSECT                                                                  
*                                  ELEMENT IS USED IN OFFICE RECORDS            
ACGPEL   DS    CL1       B         ELEMENT CODE X'A0'                           
ACGPELQ  EQU   X'A0'                                                            
ACGPLEN  DS    CL1       B         ELEMENT LENGTH 4                             
ACGPCODE DS    CL1       C         CODE                                         
         DS    CL1                 SPARE                                        
ACGPLENQ EQU   *-ACGPD             ELEMENT LENGTH                               
         SPACE 2                                                                
*        <   > DSECT TO COVER PERSONAL ID ELEMENT                               
         SPACE 1                                                                
ACPID    DSECT                                                                  
ACPIEL   DS    CL1       B         ELEMENT CODE X'A1'                           
ACPIELQ  EQU   X'A1'                                                            
ACPILEN  DS    CL1       B         ELEMENT LENGTH 16                            
ACPIPERS DS    CL8       C         PERSON CODE                                  
ACPIDATE DS    CL3       P         LAST ACTIVITY DATE                           
ACPILENQ EQU   *-ACPID             ELEMENT LENGTH                               
         SPACE 2                                                                
*        <   > DSECT TO COVER USER FIELD SELECT ELEMENT                         
         SPACE 1                                                                
ACUFD    DSECT                                                                  
ACUFEL   DS    CL1       B         ELEMENT CODE X'A2'                           
ACUFELQ  EQU   X'A2'                                                            
ACUFLEN  DS    CL1       B         ELEMENT LENGTH 32 (+L'ACUFDATA)              
ACUFSEQ  DS    CL1       B         FIELD SEQUENCE NO                            
         DS    CL1                 SPARE                                        
ACUFCODE DS    CL2       C         USER FIELD CODE                              
ACUFDESC DS    CL12      C         SCREEN HEADER DESCRIPTION                    
ACUFEDIT DS    CL8       C         EDIT RULE - FIRST CHARACTER IS...            
*                                  N=NUMERIC, D=DATE                            
*                                  OTHER CHARACTERS UNDERFINED                  
ACUFMXLN DS    XL1       B         MAXIMUM LENGTH (1-32)                        
ACUFSTAT DS    XL1       X         STATUS                                       
*                                  X'80' REQUIRED FIELD                         
*                                  X'40' NEED FOR BILLS                         
*                                  X'20' SHOW ON EST                            
*                                  X'10' SHOW ON BILLS                          
*                                  X'08' PASS TO RECEIVABLES                    
*                                  X'04' SHOW ON AUTHORIZATION                  
ACUFCUT  DS    PL3                 CUTOFF DATE                                  
         DS    CL1                 SPARE                                        
ACUFDATA DS    0C                  INPUT DATA                                   
*                                  ONLY USED WHEN ELEMENT IS ON JOB             
         SPACE 2                                                                
*        <   > DSECT TO COVER COMMENT INFO ELEMENT                              
         SPACE 1                                                                
ACCID    DSECT                                                                  
ACCIEL   DS    XL1       B         ELEMENT CODE X'A3'                           
ACCILEN  DS    XL1       B         ELEMENT LENGTH 24                            
ACCIDESC DS    XL15      C         COMMENT DESCRIPTION                          
ACCIFILT DS    CL4       C         COMMENT FILTERS                              
         DS    CL3                 SPARE                                        
         SPACE 2                                                                
*        <   > DSECT TO COVER OPTIONS DATA ELEMENT                              
         SPACE 1                                                                
ACOPD    DSECT                                                                  
ACOPEL   DS    XL1       B         ELEMENT CODE X'A4'                           
ACOPELQ  EQU   X'A4'                                                            
ACOPLEN  DS    XL1       B         ELEMENT LENGTH 16 (+L'ACOPDATA)              
ACOPNUM  DS    XL1       B         OPTION NUMBER                                
ACOPPERS DS    CL8                 PERSON LAST CHANGING OPTION                  
ACOPLAST DS    PL3                 DATE OPTION WAS CHANGED                      
         DS    CL2                 SPARE                                        
ACOPDATA DS    0C                  OPTIONAL DATA - DEPENDS ON NUMBER            
         SPACE 2                                                                
*        <   > DSECT TO SCHEME DEFINITION ELEMENT                               
         SPACE 1                                                                
ACSDD    DSECT                                                                  
ACSDEL   DS    XL1       B         ELEMENT CODE X'A5'                           
ACSDELQ  EQU   X'A5'                                                            
ACSDLEN  DS    XL1       B         ELEMENT LENGTH (30)                          
ACSDNAME DS    CL20                SCHEME NAME                                  
         DS    CL8                 SPARE                                        
ACSDLENQ EQU   *-ACSDD             SCHEME DEFINITION ELEMENT LENGTH             
         SPACE 2                                                                
*        <   > DSECT TO SCHEME CATEGORY SEQUENCE ELEMENT                        
         SPACE 1                                                                
ACSCD    DSECT                                                                  
ACSCEL   DS    XL1       B         ELEMENT CODE X'A6'                           
ACSCELQ  EQU   X'A6'                                                            
ACSCLEN  DS    XL1       B         ELEMENT LENGTH (N'CATGS*2+2)                 
ACSCAT   DS    0CL2                CATEGORY LIST                                
         SPACE 2                                                                
*        <   > DSECT TO COVER CATEGORY DESCRIPTION ELEMENT                      
         SPACE 1                                                                
ACCDD    DSECT                                                                  
ACCDEL   DS    XL1       B         ELEMENT CODE X'A7'                           
ACCDELQ  EQU   X'A7'                                                            
ACCDLEN  DS    XL1       B         ELEMENT LENGTH                               
ACCDNAME DS    CL20                CATEGORY NAME                                
ACCDSTAT DS    XL1                 STATUS                                       
ACCDNOTO EQU   X'80'               NO TOTALS                                    
ACCDCONT EQU   X'40'               WORKCODE IS A CONTINUATION                   
ACCDNPRT EQU   X'10'               DO NOT PRINT CAT NAME ON EST                 
ACCDTNAM DS    CL20                SUB-TOTAL NAME                               
         DS    XL8                 SPARE                                        
ACCDTYPE DS    XL1                 TYPE OF INSTRUCTIONS                         
ACCDWORK EQU   1                   WORKCODE LIST                                
ACCDAGY  EQU   2                   AGENCY COMMISSION LINE                       
ACCDFORM EQU   3                   CATEGORY FORUMLA                             
ACCDINST DS    0C                  INSTRUCTIONS - CATEGORY FORMULA              
ACCDLINP DS    X                   L'INPUT STRING(INCLUDES LENGTH BYTE)         
ACCDINP  DS    0C                  INPUT STRING                                 
ACCDLFOR DS    X                   L'FORMULA(INCLUDES LENGTH BYTE)              
ACCDFOR  DS    0C                  INTERNAL FORMULA--OPERATION/CATEGORY         
         SPACE 2                                                                
*        <   > DSECT TO COVER CATEGORY WORK CODE ELEMENT                        
         SPACE 1                                                                
ACCWD    DSECT                                                                  
ACCWEL   DS    XL1       B         ELEMENT CODE X'A8'                           
ACCWELQ  EQU   X'A8'                                                            
ACCWLEN  DS    XL1       B         ELEMENT LENGTH                               
ACCWSEQ  DS    XL1                 SEQUENCE NUMBER                              
ACCWTYPE DS    XL1                 1=WORK CODE 2=SUBTOTAL                       
*                                  3=AGENCY COMMISSION                          
ACCWSTA  DS    X                   STATUS BYTE                                  
ACCWSPRE EQU   X'80'               PRESTO ONLY (DO NOT UPLOAD)                  
ACCWCAT  DS    XL2                 CATEGORY FOR CALCULATION                     
*                                                                               
ACCWDATA DS    0C                                                               
         ORG   ACCWDATA                                                         
ACCWWORK DS    CL2                 WORK CODE (TYPE 1 ABOVE)                     
ACCWSUFF DS    X                   WORKCODE SUFFIX (OPTIONAL)                   
*                                  C=COMMISSIONABLE,N=NON-COMM                  
ACCWLNQ1 EQU   *-ACCWD                                                          
ACCWDESC DS    CL15                OVERRIDE DESCRIPTION                         
ACCWLNQ2 EQU   *-ACCWD                                                          
         SPACE 2                                                                
*        <   > DSECT TO COVER ESTIMATE UPDATE ELEMENT                           
         SPACE 1                                                                
ACEUD    DSECT                                                                  
ACEUEL   DS    XL1       B         ELEMENT CODE X'A9'                           
ACEUELQ  EQU   X'A9'                                                            
ACEULEN  DS    XL1       B         ELEMENT LENGTH                               
ACEUADD  DS    PL3                 DATE ADDED                                   
ACEULAST DS    PL3                 DATE LAST CHANGED                            
ACEUPERS DS    CL8                 PERSON WHO ENTERED LAST CHANGE               
         DS    XL4                 SPARE                                        
ACEULENQ EQU   *-ACEUD             ESTIMATE UPDATE ELEMENT LENGTH               
         SPACE 2                                                                
*        <   > DSECT TO COVER ESTIMATE NAME ELEMENT                             
         SPACE 1                                                                
ACEND    DSECT                                                                  
ACENEL   DS    XL1       B         ELEMENT CODE X'AA'                           
ACENELQ  EQU   X'AA'                                                            
ACENLEN  DS    XL1       B         ELEMENT LENGTH (L'NAME + 3)                  
ACENNUM  DS    X                   FIELD NUMBER                                 
ACENAME  DS    0C                  ESTIMATE NAME                                
         SPACE 2                                                                
*        <   > DSECT TO COVER ESTIMATE APPROVAL ELEMENT                         
         SPACE 1                                                                
ACEAD    DSECT                                                                  
ACEAEL   DS    XL1       B         ELEMENT CODE X'AB'                           
ACEAELQ  EQU   X'AB'                                                            
ACEALEN  DS    XL1       B         ELEMENT LENGTH                               
ACEAINP  DS    PL3                 DATE INPUT                                   
ACEAPPBY DS    CL8                 PERSON APPROVING (SPACE PADDED)              
ACEADATE DS    PL3                 APPROVAL DATE                                
         DS    XL4                 SPARE                                        
ACEALENQ EQU   *-ACEAD             ESTIMATE APPROVAL ELEMENT LENGTH             
         SPACE 2                                                                
*        <   > DSECT TO COVER ESTIMATE DATA ELEMENT                             
         SPACE 1                                                                
ACEDD    DSECT                                                                  
ACEDEL   DS    XL1       B         ELEMENT CODE X'AC'                           
ACEDELQ  EQU   X'AC'                                                            
ACEDLEN  DS    XL1       B         ELEMENT LENGTH                               
ACEDTYPE DS    X                   DATA TYPE                                    
*                                  1=WORKCODE ESTIMATE IN CENTS                 
ACEDATA  DS    0C                  ESTIMATE DATA                                
         ORG   ACEDATA                                                          
ACEDWORK DS    CL2                 WORKCODE                                     
ACEDCOMM DS    PL6                 COMMISSIONABLE ESTIMATE                      
ACEDLNQ1 EQU   *-ACEDD             ELEMENT LENGTH FOR COMM ESTIMATE             
ACEDNCOM DS    PL6                 NON-COMMISSIONABLE ESTIMATE                  
ACEDLNQ2 EQU   *-ACEDD             ELEMENT LENGTH FOR NON-COM EST               
         SPACE 2                                                                
*        <   > DSECT TO COVER PANEL HEADER ELEMENT                              
         SPACE 1                                                                
ACPHD    DSECT                                                                  
ACPHEL   DS    XL1       B         ELEMENT CODE X'AD'                           
ACPHELQ  EQU   X'AD'               PANEL HEADER                                 
ACPHLEN  DS    XL1       B         ELEMENT LENGTH                               
ACPHNAME DS    CL20      C         PANEL NAME                                   
ACPHADD  DS    PL3       PWO       DATE ADDED                                   
ACPHPERS DS    CL8       C         PERSON WHO MADE LAST CHANGE                  
ACPHLAST DS    PL3       PWO       DATE LAST CHANGED                            
ACPHWHAT DS    C         C         A=ADD,C=COPY,R=RENAME,F=FIELD MAINT          
         DS    XL8                 SPARE                                        
ACPHLENQ EQU   *-ACPHD             ELEMENT LENGTH                               
         SPACE 2                                                                
*        <   > DSECT TO COVER PANEL FIELD DATA ELEMENT                          
         SPACE 1                                                                
ACFDD    DSECT                                                                  
ACFDEL   DS    XL1       B         ELEMENT CODE X'AE'                           
ACFDELQ  EQU   X'AE'                                                            
ACFDLEN  DS    XL1       B         ELEMENT LENGTH                               
ACFDSEQ  DS    XL1                 SEQUENCE NUMBER                              
ACFDSROW DS    XL1                 SCREEN ROW                                   
*                                  X'80' ON=AUTOMATIC ROW CALCULATION           
*                                  X'40' ON=PLUS N ROWS FEATURE ACTIVE          
*                                  8-24 = SPECIFIC ROW                          
ACFDSCOL DS    XL1                 SCREEN COLUMN                                
ACFDSLEN DS    XL1                 SCREEN FIELD LENGTH                          
ACFDATTR DS    XL1                 ATTRIBUTE BYTE                               
ACFDFLD  DS    CL4                 FIELD DATA KEYWORD                           
         DS    XL3                 SPARE                                        
*                                                                               
ACFDPLIN DS    XL1                 PRINT LINE                                   
ACFDPCOL DS    XL1                 PRINT COLUMN                                 
ACFDPDTY DS    C                   PRINT DATA TYPE-C=CHARACTER STRING           
*                                  I=INTERNALLY GENERATED                       
ACFDPDLN DS    XL1                 PRINT DATA LENGTH (OPTIONAL)                 
         DS    XL2                 SPARE                                        
ACFDSCR  DS    0C                  SCREEN DATA                                  
ACFDPRT  DS    0C                  PRINT LINE DATA                              
         SPACE 2                                                                
*        <   > DSECT TO COVER TEXT HEADER ELEMENT                               
         SPACE 1                                                                
ACTHD    DSECT                                                                  
ACTHEL   DS    XL1       B         ELEMENT CODE X'AF'                           
ACTHELQ  EQU   X'AF'               TEXT HEADER                                  
ACTHLEN  DS    XL1       B         ELEMENT LENGTH                               
ACTHPAN  DS    CL4       C         PANEL CODE                                   
ACTHCOM  DS    CL6                 STANDARD COMMENT REFERENCE                   
         DS    XL6                 SPARE                                        
ACTHLENQ EQU   *-ACTHD             ELEMENT LENGTH                               
         SPACE 2                                                                
*        <   > DSECT TO COVER TEXT FIELD DATA ELEMENT                           
         SPACE 1                                                                
ACTFD    DSECT                                                                  
ACTFEL   DS    XL1       B         ELEMENT CODE X'B0'                           
ACTFELQ  EQU   X'B0'               TEXT FIELD DATA                              
ACTFLEN  DS    XL1       B         ELEMENT LENGTH                               
ACTFTYPE DS    XL1                 ELEMENT TYPE                                 
ACTFTPAN EQU   1                   PANEL                                        
ACTFTREG EQU   2                   REGULAR TEXT                                 
ACTFFLD  DS    CL4                 FIELD KEYWORD (PANEL TEXT)                   
         ORG   ACTFFLD                                                          
ACTFSEQ  DS    XL1                 SEQUENCE NUMBER (REGULAR TEXT)               
         ORG                                                                    
ACTFTEXT DS    0C                  TEXT DATA                                    
         SPACE 2                                                                
*        <   > DSECT TO COVER ESTIMATE PREPARER ELEMENT                         
         SPACE 1                                                                
ACEPD    DSECT                                                                  
ACEPEL   DS    XL1       B         ELEMENT CODE X'B1'                           
ACEPELQ  EQU   X'B1'               ESTIMATE PREPARER                            
ACEPLEN  DS    XL1       B         ELEMENT LENGTH                               
ACEPINP  DS    PL3                 DATE INPUT                                   
ACEPREP  DS    CL8       C         PREPARER                                     
ACEPDATE DS    PL3                 PREPARED DATE                                
         DS    CL4                 SPARE                                        
ACEPLENQ EQU   *-ACEPD             ELEMENT LENGTH                               
         SPACE 2                                                                
*        <   > DSECT TO COVER ESTIMATE BILLING ELEMENT                          
         SPACE 1                                                                
ESMRECD  DSECT                                                                  
ESMEL    DS    XL1       B         ELEMENT CODE X'B2'                           
ESMELQ   EQU   X'B2'               ESTIMATE BILLING                             
ESMLEN   DS    XL1       B         ELEMENT LENGTH                               
ESMWC    DS    CL3       C         WORKCODE                                     
ESMPEBC  DS    PL6                 NET AMOUNT                                   
ESMPEBCG DS    PL6                 GROSS AMOUNT                                 
ESMVAT   DS    CL1       C         VAT CODE                                     
ESMLENQ  EQU   *-ESMRECD           ELEMENT LENGTH                               
ESMPST   DS    CL1       C         PST CODE                                     
ESMPRV   DS    CL2       C         PST PROVINCE CODE                            
ESMLNQ2  EQU   *-ESMRECD           ELEMENT LENGTH                               
         SPACE 2                                                                
*        <   > DSECT TO COVER MEDIA NAME ELEMENT                                
         SPACE 1                                                                
ACMND    DSECT                                                                  
ACMNEL   DS    XL1       B         ELEMENT CODE X'B3'                           
ACMNELQ  EQU   X'B3'               MEDIA NAME                                   
ACMNLEN  DS    XL1       B         ELEMENT LENGTH                               
ACMNCODE DS    CL1                 MEDIA CODE                                   
ACMNTYPE DS    CL1       C         NAME TYPE                                    
ACMNEST  EQU   C'E'                ESTIMATE NAME                                
ACMNBILL EQU   C'B'                BILLING NAME                                 
         DS    X                   SPARE                                        
ACMNAME  DS    0CL36               NAME                                         
         SPACE  2                                                               
*        <   > DSECT TO COVER GROUP BILLING DATA ELEMENT                        
         SPACE 1                                                                
ACGDD    DSECT                                                                  
ACGDEL   DS    XL1                 ELEMENT CODE                                 
ACGDELQ  EQU   X'B4'               GROUP BILLING DATA                           
ACGDLEN  DS    XL1                                                              
ACGDFORM DS    CL1                 FORMAT                                       
ACGDLVL  DS    CL1                 LEVEL                                        
ACGDFDTE DS    PL2                 FROM DATE (YM)                               
ACGDTDTE DS    PL2                 TO DATE (YM)                                 
ACGDTYPE DS    CL1                 BILLING TYPE                                 
ACGDRUN  DS    PL3                 RUN DATE (PWO)                               
ACGDDUE  DS    PL3                 DUE DATE (PWO)                               
ACGDRCVA DS    CL15                RECEIVABLE ACCOUNT                           
ACGDRCVO DS    CL2                 RECEIVABLE OFFICE                            
ACGDUNUM DS    CL6                 UNBILL NUMBER                                
ACGDUNDT DS    PL3                 UNBILL DATE (PWO)                            
         DS    CL6                 SPARE                                        
ACGDPAY  DS    PL6                 PAYABLE AMOUNT (SJ)                          
ACGDREC  DS    PL6                 RECEIVABLE AMOUNT (SR)                       
ACGDINC  DS    PL6                 INCOME (12-REVENUE) AMOUNT                   
ACGDGRS  DS    PL6                 GROSS (11-BILLINGS) AMOUNT                   
ACGDCSH  DS    PL6                 CASH DISCOUNT                                
ACGDINT  DS    PL6                 INTERNAL INCOME (SK REVERSAL)                
ACGDTME  DS    PL6                 TIME (WORKCODE TYPE=T)                       
ACGDOOP  DS    PL6                 OUT OF POCKET (W/T=O)                        
ACGDPRV  DS    PL6                 PREVIOUSLY BILLED (W/T=P, B/T=48)            
ACGDPRE  DS    PL6                 PRE-BILLING (W/T=P)                          
         DS    2PL6                SPARE                                        
ACGDLNQ  EQU   *-ACGDD             ELEMENT LENGTH                               
         SPACE 2                                                                
*        <   > DSECT TO COVER JOB NUMBER DATA ELEMENT                           
         SPACE 1                                                                
ACJND    DSECT                                                                  
ACJNEL   DS    XL1       B         ELEMENT CODE X'B5'                           
ACJNELQ  EQU   X'B5'               JOB NUMBER                                   
ACJNLEN  DS    XL1       B         ELEMENT LENGTH                               
ACJNP2N  DS    CL18      C         NAME FOR POSITION 2                          
ACJNP2   DS    CL2       C         DATA TYPE FOR POSITION 2                     
ACJNP3N  DS    CL18      C         NAME FOR POSITION 3                          
ACJNP3   DS    CL2       C         DATA TYPE FOR POSITION 3                     
ACJNP4N  DS    CL18      C         NAME FOR POSITION 4                          
ACJNP4   DS    CL2       C         DATA TYPE FOR POSITION 4                     
ACJNP5N  DS    CL18      C         NAME FOR POSITION 5                          
ACJNP5   DS    CL2       C         DATA TYPE FOR POSITION 5                     
ACJNP6N  DS    CL18      C         NAME FOR POSITION 6                          
ACJNP6   DS    CL2       C         DATA TYPE FOR POSITION 6                     
ACJNSTRT DS    CL5       C         STARTING SEQUENTIAL NUMBER                   
ACJNLNUM DS    CL12      C         LAST NUMBER USED                             
ACJNMANS DS    CL5       C         MANUAL INVOICE START RANGE                   
ACJNMANE DS    CL5       C         MANUAL INVOICE END RANGE                     
ACJNEND  DS    CL5                 SEQUENCE END                                 
         DS    CL5                 SPARE                                        
ACJNLENQ EQU   *-ACJND             LENGTH OF ELEMENT                            
         SPACE  2                                                               
*        <   > DSECT TO COVER INTERNAL INCOME ELEMENT                           
         SPACE 1                                                                
ACINCD   DSECT                                                                  
ACINCEL  DS    XL1       B         ELEMENT CODE X'B7'                           
ACINCELQ EQU   X'B7'                                                            
ACINCLN  DS    XL1       B         ELEMENT LENGTH                               
ACINCWRK DS    CL3       C         WORKCODE                                     
ACINCAMT DS    PL6       P         CURRENT BILLING LESS PREVIOUS                
ACINCDTE DS    PL3       P         DATE USED                                    
ACINCACC DS    CL14      C         INCOME ACCOUNT                               
         DS    CL6                 SPARE                                        
ACINCLQ  EQU   *-ACINCD                                                         
         SPACE 2                                                                
*        <   > DSECT TO COVER ANALYSIS POINTERS ELEMENT                         
         SPACE 1                                                                
ACAPD    DSECT                                                                  
ACAPEL   DS    XL1       B         ELEMENT                                      
ACAPELQ  EQU   X'C0'                                                            
ACAPLEN  DS    CL1       B         LENGTH(VARIABLE)                             
ACAPMIN  DS    CL1       B         NUMBER OF MINI ELEMENTS                      
ACAPMLEN DS    CL1       B         LENGTH OF MINI ELEMENT(VARIABLE)             
ACAPSTAT DS    CL1       B         STATUS                                       
ACAPDEBT EQU   X'80'               DEBIT                                        
ACAPACCT DS    0CL14     C         ACCOUNT CODE                                 
         SPACE 2                                                                
*        <   > DSECT FOR R. S. HEADLINE DATA                                    
         SPACE 1                                                                
RSHD     DSECT                                                                  
RSHEL    DS    XL1                 ELEMENT CODE                                 
RSHELQ   EQU   X'C1'                                                            
RSHLEN   DS    XL1                 LENGTH (VARIABLE)                            
RSHTYPE  DS    XL1                 DATA TYPE                                    
RSHTITL  EQU   1                   TITLE                                        
RSHCNTR  EQU   2                   CENTER                                       
RSHLFTH  EQU   3                   LEFT HEADLINE                                
RSHRHTH  EQU   4                   RIGHT HEADLINE                               
RSHFTLN  EQU   5                   FOOTLINE                                     
RSHSEQ   DS    XL1                 SEQUENCE (I.E. CENTER 1, 2 OR 3)             
RSHFRM   DS    XL1                 DATA FORM                                    
RSHFREE  EQU   X'80'               FREE FORM                                    
RSHDEF   EQU   X'40'               DATA DEFINITION                              
RSHROW   EQU   X'20'               HEADING FROM ROW                             
RSHADR   EQU   X'10'               ADDRESS FROM ACCOUNT TO BE USE               
         DS    XL10                SPARE                                        
RSHLENQ  EQU   *-RSHD              LENGTH UP TO THE DATA                        
RSHDATA  DS    0CL36               DATA                                         
         SPACE 1                                                                
*        <   > DSECT FOR R. S. ROW DATA                                         
         SPACE 1                                                                
RSRD     DSECT                                                                  
RSREL    DS    XL1                 ELEMENT CODE                                 
RSRELQ   EQU   X'C2'                                                            
RSRLEN   DS    XL1                 LENGTH                                       
RSRSEQ   DS    XL1                 SEQUENCE (ROW NUMBER)                        
RSROPT   DS    XL1                 ROW OPTIONS                                  
RSRTOT   EQU   X'80'               ROW TOTAL                                    
RSRPAGE  EQU   X'40'               HEADLINE ,NEW PAGE ON ROW CHANGE             
RSRRNAME EQU   X'20'               ROWNAME                                      
RSRRCODE EQU   X'10'               ROWCODE                                      
RSRTOTSP EQU   X'08'               ROW TOTAL BUT ON SEPERATE PAGE               
RSRTYPE  DS    XL1                 (R,C,L)-HEADLINE  M-MIDLINE  BLANK           
RSRCOL   EQU   C'*'                ROW COLUMN                                   
RSRMID   EQU   C'M'                MIDLINE                                      
RSRLHEAD EQU   C'L'                LEFT HEADLINE                                
RSRCHEAD EQU   C'C'                CENTER HEADLINE                              
RSRRHEAD EQU   C'R'                RIGHT HEADLINE                               
         DS    XL9                 SPARE                                        
RSRDATA  DS    CL12                ROW DATA                                     
RSRLENQ  EQU   *-RSRD              ELEMENT LENGTH                               
         SPACE 1                                                                
*        <   > DSECT FOR R. S. COLUMN DATA                                      
         SPACE 1                                                                
RSCD     DSECT                                                                  
RSCEL    DS    XL1                 ELEMENT CODE                                 
RSCELQ   EQU   X'C3'                                                            
RSCLEN   DS    XL1                 LENGTH                                       
RSCSEQ   DS    XL1                 SEQUENCE (COLUMN NUMBER)                     
RSCWDTH  DS    XL1                 COLUMN WIDTH                                 
RSCOPT   DS    XL1                 COLUMN OPTIONS                               
RSCACCM  EQU   X'80'               ACCUMULATED COLUMN                           
RSCEQU   EQU   X'40'               CALCULATED COLUMN                            
RSCHIDE  EQU   X'20'               HIDDEN COLUMN                                
RSCAGED  EQU   X'10'               AGED COLUMN                                  
RSCDDTE  EQU   X'08'               BY DUE DATE IF ON/ELSE BILL DATE             
RSCPCT   EQU   X'04'               PERCENTAGE COLUMN                            
RSCOPT2  DS    XL1                 COLUMN ROW OPTIONS                           
RSCTOT   EQU   RSRTOT              TOTAL ON COLUMN                              
RSCNAME  EQU   RSRRNAME            COLUMN ROW NAME                              
RSCCODE  EQU   RSRRCODE            COLUMN ROW CODE                              
RSCSORTN DS    XL1                 SORT SEQUENCE NUMBER                         
RSCPARA  DS    XL8                 PARAMETER LIST                               
         ORG   RSCPARA                                                          
         DS    CL3                 SPARE                                        
RSCDTEFG DS    XL1                 DATE FLAG                                    
RSCTODTE EQU   X'80'               PERIOD OR TO DATE                            
RSCYEAR  EQU   X'08'               YEAR FLAG                                    
RSCQTR   EQU   X'04'               QUARTER FLAG                                 
RSCMON   EQU   X'02'               MONTH FLAG                                   
RSCDAY   EQU   X'01'               DAY FLAG                                     
RSCSTDT  DS    XL2                 COLUMN START DATE PARAMETER                  
RSCENDT  DS    XL2                 COLUMN END DATE PARAMETER                    
RSCDATA  DS    CL12                COLUMN DATA                                  
RSCLNQ   EQU   *-RSCD              ELEMENT LENGTH (WITHOUT HEADLINE)            
RSCHDL1  DS    CL12                COLUMN HEADLINE 1                            
RSCLNQ1  EQU   *-RSCD              ELEMENT LENGTH (WITH 1 HEADLINE)             
RSCHDL2  DS    CL12                COLUMN HEADLINE 2                            
RSCLNQ2  EQU   *-RSCD              ELEMENT LENGTH (WITH 2 HEADLINES)            
         SPACE 2                                                                
*        <   > DSECT FOR R. S. PROFILE DATA                                     
         SPACE 1                                                                
RSPD     DSECT                                                                  
RSPEL    DS    XL1                 ELEMENT CODE                                 
RSPELQ   EQU   X'C4'                                                            
RSPLEN   DS    XL1                 LENGTH                                       
RSPPOPT  DS    XL1                 PRINT PROFILE OPTIONS                        
RSPBOX   EQU   X'80'               PRINT BOXES                                  
RSPIACT  EQU   X'40'               PRINT INACTIVE ACCOUNTS                      
RSPRTOT  EQU   X'20'               PRINT REDUNDANT TOTALS                       
RSPRDAT  EQU   X'10'               PRINT REDUNDANT DATA IN COLS                 
RSPLFJT  EQU   X'08'               PRINT LEFT JUSTIFIED                         
RSPZEROT EQU   X'04'               PRINT ZERO TOTALS                            
RSPEDOPT DS    XL1                 EDITING AMOUNTS OPTIONS                      
RSPEDCMA EQU   X'80'               PRINT USING COMMAS                           
RSPEDTRL EQU   X'40'               TRAILING MINUS SIGN                          
RSPEDZRO EQU   X'20'               ZERO AS NONBLANK                             
*              X'10'               SPARE                                        
RSPEDBKT EQU   X'08'               MINUS SIGN AS BRACKETS                       
*              X'04'               PRINT A PERCENT                              
RSPEDLED EQU   X'02'               LEADING MINUS SIGN                           
RSPEDCR  EQU   X'01'               PRINT MINUS AS CR                            
RSPPCTS  DS    XL1                 DECIMAL PLACES FOR PERCENTS 0/1/2            
RSPRND   DS    XL1                 ROUNDING OPTION P/D/T/M                      
RSPLIST  DS    CL6                 BILLING SOURCE LIST                          
RSPRKON  DS    CL2                 RANK ON TOTAL FOR ROW LEVEL                  
RSPRKBY  DS    CL2                 RANK (INTEGERTY OF SORTKEY)                  
RSPRKCL  DS    CL1                 RANK FOR COLUMN                              
RSPRKOR  DS    CL1                 RANK ORDER (ACCENDING/DECENDING)             
RSPUNT   DS    CL1                 UINT TO REQUEST REPORT ON                    
RSPLDG   DS    CL1                 LEDGER TO REQUEST REPORT ON                  
         DS    CL20                SPARE                                        
RSPLENQ  EQU   *-RSPD              ELEMENT LENGTH                               
         SPACE 2                                                                
*        <   > DSECT FOR INTERAGENCY RECEIVABLE PROFILE ELEMENT                 
         SPACE 1                                                                
ACINPRFD DSECT                                                                  
ACIPFEL  DS    CL1                 ELEMENT CODE X'C6'                           
ACIPFEQU EQU   X'C6'                                                            
ACIPFLEN DS    XL1                 LENGTH X'42' (66)                            
ACIPFDES DS    CL36                ESTIMATE DESCRIPTION                         
ACIPFPER DS    0CL4                YYMM YYMM EST PERIOD - PACKED                
ACIPFPRS DS    CL2                 YYMM START EST PERIOD - PACKED               
ACIPFPRE DS    CL2                 YYMM END EST PERIOD - PACKED                 
ACIPFNET DS    PL3                 A.O.R.NET PCT (A/P FOR OTHER AGY)            
ACIPFFEE DS    PL3                 A.O.R.FEE PCT (INCOME FOR OTHER AGY)         
ACIPFREC DS    PL3                 CREATIVE RECV PCT (INC FOR OUR AGY)          
ACIPFTWA DS    XL2                 OFFICE ID CODE FORM TWAUSRID                 
         DS    CL13                                                             
ACIPLENQ EQU   *-ACINPRFD                                                       
         SPACE 2                                                                
*        <   > DSECT FOR INTERAGENCY RECEIVABLE ESTIMATE ELEMENT                
         SPACE 1                                                                
ACINESTD DSECT                                                                  
ACIESEL  DS    CL1                 ELEMENT CODE X'C7'                           
ACIESEQU EQU   X'C7'                                                            
ACIESLEN DS    XL1                 LENGTH X'46' (70)                            
ACIESMTH DS    PL2                 YYMM ADVERTISING MONTH - PACKED              
ACIESDAT DS    PL2                 YMD POSTING DATE - COMPRESSED                
ACIESFEE DS    PL3                 A.O.R.FEE PCT (2 DECIMAL PLACES)             
ACIESRCV DS    PL3                 CREATIVE RECV PCT (2 DEC PLACES)             
ACIESGRS DS    PL6                 GROSS BILLING EST                            
ACIESREC DS    PL6                 RECEIVABLE AMOUNT EST                        
ACIESPD  DS    PL6                 PAID SO FAR       (UPDATED)                  
ACIESDTO DS    PL2                 *ORIG* YMD POST DATE - COMPRESSED            
ACIESFEO DS    PL3                 *ORIG* A.O.R.FEE PCT (2 DEC)                 
ACIESRCO DS    PL3                 *ORIG* CREATIVE RECV PCT (2 DEC)             
ACIESGRO DS    PL6                 *ORIG* GROSS BILLING                         
ACIESRAO DS    PL6                 *ORIG* RECEIVABLE AMOUNT EST                 
ACIESTAT DS    CL1                 ESTIMATE STATUS BITS                         
*                                  X'80'    1=RECEIVABLE POSTED                 
ACIESUSD DS    PL2                 USED DATE - COMPRESSED                       
         DS    CL17                SPARE                                        
ACIELENQ EQU   *-ACINESTD                                                       
         SPACE 2                                                                
*        <  > DSECT FOR CHECK REGISTER DETAIL                                   
         SPACE 1                                                                
ACCRD    DSECT                                                                  
ACCRDEL  DS    XL1                 ELEMENT CODE                                 
ACCRDELQ EQU   X'CD'                                                            
ACCRDLEN DS    XL1                 ELEMENT LENGTH                               
ACCRDTYP DS    XL1                 DATA TYPE                                    
ACCRDSTR EQU   1                   STARTING CHECK NUMBER                        
ACCRDVOD EQU   2                   VOIDED CHECK NUMBERS                         
ACCRDSKP EQU   3                   SKIPPED CHECK NUMBERS                        
         DS    XL4                 SPARE                                        
ACCRDATA DS    CL80                DATA                                         
ACCRDLNQ EQU   *-ACCRD                                                          
         SPACE 2                                                                
*        <  > DSECT FOR MEDIA PRODUCT GROUP CODE/NAME                           
         SPACE 1                                                                
ACPGCD   DSECT                                                                  
ACPGCEL  DS    XL1                 ELEMENT CODE                                 
ACPGCELQ EQU   X'D7'                                                            
ACPGCLEN DS    XL1                 ELEMENT LENGTH                               
ACPGCODE DS    CL6                 MEDIA PRODUCT GROUP CODE                     
ACPGCNME DS    CL24                MEDIA PRODUCT GROUP NAME                     
ACPGCLNQ EQU   *-ACPGCD                                                         
         SPACE 2                                                                
*        <  > DSECT FOR RECEIVABLE ALLOCATION ELEMENT                           
         SPACE 1                                                                
ACRAD    DSECT                                                                  
ACRAEL   DS    XL1                 ELEMENT CODE                                 
ACRAELQ  EQU   X'D9'                                                            
ACRALEN  DS    XL1                 ELEMENT LENGTH                               
ACRATYPE DS    XL1                 TYPE OF ALLOCATION                           
ACRATALC EQU   1                   REGULAR ALLOCATION                           
ACRATOFS EQU   2                   OFFSET/CONTRA'D                              
ACRATWOF EQU   3                   WRITTEN-OFF                                  
ACRATTTO EQU   4                   TRANSFERRED TO                               
ACRATTFR EQU   5                   TRANSFERRED FROM                             
ACRADATA DS    0X                  VARIABLE DATA STARTS HERE                    
*                                                                               
         ORG   ACRADATA                                                         
ACRAALC  DS    0X                  REGULAR ALLOCATION VALUES                    
ACRAAREF DS    CL6                 CHEQUE NUMBER                                
ACRAADAT DS    PL3                 CHEQUE DATED (YYMMDD)                        
ACRAADEP DS    PL3                 CHEQUE DEPOSITED ON (YYMMDD)                 
ACRAALNQ EQU   *-ACRAD             LENGTH OF ELEMENT                            
*                                                                               
         ORG   ACRADATA                                                         
ACRAOFS  DS    0X                  OFFSET/CONTRA VALUES                         
*&&US                                                                           
ACRAODAT DS    PL3                 OFFSET ON (YYMMDD)                           
*&&                                                                             
ACRAOLNQ EQU   *-ACRAD             LENGTH OF ELEMENT                            
*                                                                               
         ORG   ACRADATA                                                         
ACRAWOF  DS    0X                  WRITE-OFF VALUES                             
*&&UK                                                                           
ACRAWREF DS    CL6                 CHEQUE NUMBER                                
ACRAWDAT DS    PL3                 CHEQUE DATED (YYMMDD)                        
ACRAWDEP DS    PL3                 CHEQUE DEPOSITED ON (YYMMDD)                 
ACRAWULA DS    0CL14               WRITE-OFF UNIT/LEDGER/ACCOUNT                
ACRAWUNT DS    CL1                 UNIT CODE                                    
ACRAWLDG DS    CL1                 LEDGER CODE                                  
ACRAWACT DS    CL12                ACCOUNT CODE                                 
*&&                                                                             
*&&US                                                                           
ACRAWREF DS    CL6                 WRITE-OFF REFERENCE NUMBER                   
ACRAWDAT DS    PL3                 WRITTEN-OFF ON (YYMMDD)                      
ACRAWULA DS    0CL14               WRITE-OFF UNIT/LEDGER/ACCOUNT                
ACRAWUNT DS    CL1                 UNIT CODE                                    
ACRAWLDG DS    CL1                 LEDGER CODE                                  
ACRAWACT DS    CL12                ACCOUNT CODE                                 
*&&                                                                             
ACRAWLNQ EQU   *-ACRAD             LENGTH OF ELEMENT                            
*                                                                               
         ORG   ACRADATA                                                         
ACRATRF  DS    0X                  TRANSFER TO/FROM VALUES                      
ACRATMOS DS    PL2                 TRANSFER TO/FROM MONTH OF SERVICE            
ACRATDAT DS    PL3                 TRANSFERRED ON (YYMMDD)                      
ACRATULA DS    0CL14               TRANSFER TO/FROM UNIT/LEDGER/ACCOUNT         
ACRATUNT DS    CL1                 UNIT CODE                                    
ACRATLDG DS    CL1                 LEDGER CODE                                  
ACRATACT DS    CL12                ACCOUNT CODE                                 
ACRATLNQ EQU   *-ACRAD             LENGTH OF ELEMENT                            
         SPACE 2                                                                
*        <  > DSECT FOR REQUEST CARD ELEMENT                                    
         SPACE 1                                                                
ACRQD    DSECT                                                                  
ACRQEL   DS    XL1                 ELEMENT CODE                                 
ACRQELQ  EQU   X'EC'                                                            
ACRQLN   DS    XL1                 ELEMENT LENGTH                               
ACRQSEQ  DS    XL1                 SEQUENCE NUMBER                              
         DS    XL5                 SPARE                                        
ACRQCARD DS    CL80                REQUEST CARD                                 
ACRQLNQ  EQU   *-ACRQD             LENGTH OF ELEMENT                            
         SPACE 2                                                                
*        <  > DSECT FOR MBI (ONLY) ELEMENT                                      
         SPACE 1                                                                
ACMXLD   DSECT                                                                  
ACMXEL   DS    XL1                 ELEMENT CODE                                 
ACMXELQ  EQU   X'F3'                                                            
ACMXELN  DS    XL1                 ELEMENT LENGTH                               
ACMXSYS  DS    CL1                 MEDIA SYSTEM                                 
ACMXMED  DS    CL1                 MEDIA                                        
ACMXCLI  DS    CL3                 MEDIA BILL CLIENT                            
ACMXPRD  DS    CL3                 MEDIA BILL PRODUCT                           
ACMXEST  DS    CL3                 MEDIA BILL ESTIMATE                          
ACMXMOS  DS    XL2                 MEDIA BILL Y/M OF SERVICE                    
ACMXTDT  DS    XL2                 DATE ACCOUNT ORIG TRANSFERED                 
ACMXRDT  DS    XL2                 DATE ACCOUNT REVERSED BY THE MY              
         DS    XL9                 SPARE                                        
ACMXLNQ  EQU   *-ACMXLD            LENGTH OF ELEMENT                            
