*          DATA SET ACGETURLD  AT LEVEL 004 AS OF 08/05/20                      
***********************************************************************         
* AGENCY URL DSECT                                                              
***********************************************************************         
AGYURLD  DSECT                                                                  
AGUSE    DS    XL1                 SE NUMBER                                    
AGUAA    DS    CL2                 AGENCY ALPHA                                 
AGUFED   DS    CL1                 FEDERATED SYSTEM?                            
AGUTST   DS    CL1                 TEST/QA SYSTEM                               
AGUHTT   DS    CL8                 HTTP/HTTPS                                   
AGUENV   DS    CL20                ENVIRONMENT PREFIX                           
AGUURL2  DS    CL20                .MEDIAOCEAN.COM                              
AGUFEDP  DS    CL5                 FEDERATED PREFIX                             
AGUFEDS  DS    CL5                 FEDERATED SUFFIX                             
AGYURLQ  EQU   *-AGYURLD                                                        
         EJECT                                                                  
