*          DATA SET ACGENINPT  AT LEVEL 038 AS OF 02/06/90                      
*              TABLE OF INPUT VALUES                                            
         SPACE 3                                                                
ACINPT   DC    CL15'INVOICE'            1                                       
         DC    CL15'TRANSFER'           2                                       
*&&UK*&& DC    CL15'CHEQUE'             3                                       
*&&US*&& DC    CL15'CHECK'              3                                       
         DC    CL15'PETTY CASH'         4                                       
         DC    CL15'MULTIPLE JRNL'      5                                       
         DC    CL15'MANUAL BILLING'     6                                       
         DC    CL15'CLIENT BILLS'       7                                       
         DC    CL15'INTERNAL INV.'      8                                       
         DC    CL15'MEDIA BILLING'      9                                       
         DC    CL15'MEDIA PAYMENT'     10                                       
         DC    CL15'ANALYSED TRANS.'   11                                       
         DC    CL15'ORDER'             12                                       
         DC    CL15'HOLD CHEQUE'       13                                       
         DC    CL15'BILLING TRANS.'    14                                       
         DC    CL15'EXPENSE TRANS.'    15                                       
         DC    CL15'CASH RECEIPT'      16                                       
         DC    CL15'TIME SHEETS'       17                                       
         DC    CL15'SPECIAL TRANS.'    18                                       
         DC    CL15'OTHERS'            19                                       
         DC    CL15'SPEC JRNL.'        20                                       
         DC    CL15'NON-BILL INV.'     21                                       
         DC    CL15'NON-BILL CASH'     22                                       
         DC    CL15'EXPENSE TRANS.'    23                                       
         DC    CL15'ACCRUAL TRANS.'    24                                       
         DC    CL15'RETAIL BILLING'    25                                       
         DC    CL15'MEDIA/SPEC BILL'   26                                       
         DC    CL15'TIME SHEETS'       27                                       
         DC    CL15'DODGE ASSES.'      28                                       
         DC    CL15'DODGE OTHERS'      29                                       
         DC    CL15'CASH ALLOCATION'   30                                       
         DC    CL15'SCHLITZ BILLING'   31                                       
         DC    CL15'OTHERS'            32                                       
         DC    CL15'BILLABLE TIME'     33                                       
         DC    CL15'JOB TRANSFER'      34                                       
         DC    CL15'RETAIL BILLING'    35                                       
         DC    CL15'ADVANCE PAYMENT'   36                                       
         DC    CL15'VOID'              37                                       
         DC    CL15'DDS BILLING'       38                                       
         DC    CL15'ACCRUAL'           39                                       
         DC    CL15'ACCRUAL REV.'      40                                       
         DC    CL15'TIME SHEETS'       41                                       
         DC    CL15'MEDIA/SPEC BILL'   42                                       
         DC    CL15'ANLYS ACCRUAL'     43                                       
         DC    CL15'ANLYS ACCRL REV'   44                                       
         DC    CL15'MULT ANLYZ J/E '   45                                       
         DC    CL15'MULT BILL/NON  '   46                                       
         DC    CL15'EST. PRODUCTION'   47                                       
         DC    CL15'REVERSAL OF 47 '   48                                       
         DC    CL15'CLIENT TIME'       49                                       
         DC    CL15'TALENT INTRFACE'   50                                       
         DC    CL15'INTER-AGENCY   '   51                                       
         DC    CL15'TAX ADJUSTMENTS'   52                                       
         DC    CL15'MULT ANLYS ACRL'   53                                       
         DC    CL15'MULT ANLYS REV'    54                                       
         DC    CL15'INCOME ACCRUAL'    55                                       
         DC    CL15'INCOME REVERSAL'   56                                       
         DC    CL15'WRITE-OFFS     '   57                                       
         DC    CL15'INTERAGENCY    '   58                                       
