*          DATA SET ACGENRAC   AT LEVEL 005 AS OF 08/07/14                      
RACELD   DSECT                     ** RECORD ACTIVITY ELEMENT **                
RACEL    DS    XL1                 ELEMENT CODE                                 
RACELQ   EQU   X'F9'                                                            
RACLN    DS    XL1                 ELEMENT LENGTH                               
RACTYPE  DS    XL1                 ACTIVITY TYPE                                
RACTADD  EQU   1                   ADD RECORD                                   
RACTCHA  EQU   2                   CHANGE RECORD                                
RACTAPP  EQU   3                   APPROVE RECORD                               
RACUSER  DS    XL2                 USER-ID                                      
RACPERS  DS    XL2                 PERSON                                       
RACTERM  DS    XL2                 TERMINAL NUMBER                              
RACDATE  DS    PL3                 DATE                                         
RACTIME  DS    PL4                 TIME (STANDARD)                              
RACVRSN  DS    0XL3                VERSION INFO (PC APPS)                       
RACVMAJ  DS    XL1                 MAJOR VERSION NUMBER                         
RACVMIN  DS    XL1                 MINOR VERSION NUMBER                         
RACVRVN  DS    XL1                 REVISION NUMBER                              
RACAPPL  DS    XL1                 APPLICATION                                  
RACAURAQ EQU   X'80'               AURA                                         
RACBRONQ EQU   X'40'               BRANDOCEAN                                   
RACAUPLQ EQU   X'20'               ACCOUNT UPLOAD                               
RACMHUBQ EQU   X'10'               MEDIAHUB                                     
RACDSSPQ EQU   X'00'               DS SPECTRA                                   
RACLNQ   EQU   *-RACELD                                                         
         SPACE 1                                                                
RACMAXQ  EQU   3                                                                
         SPACE 1                                                                
