*          DATA SET ACIBANTAB  AT LEVEL 069 AS OF 03/17/10                      
***********************************************************************         
* IBAAN COUNTRY TABLE AND LENGTHS                                     *         
***********************************************************************         
IBANTAB  DS    0D                                                               
*                                                                               
*ALBANIA  DC    CL2'AL',X'00'       ALBANIA                                     
*         DC    AL1(ALBANL)                                                     
*         DC    X'00'               NO STRUCTURE DEFINED                        
*ALBANL   EQU   *-ALBANIA                                                       
*                                                                               
ANDORRA  DC    CL2'AD',X'18'       ANDORRA(24)                                  
         DC    AL1(ADORL)                                                       
         DC    C'N',X'0A',C'M',X'0C' 10 NUMBERS, 12 MIXED                       
ADORL    EQU   *-ANDORRA                                                        
IBACTLN  EQU   *-IBANTAB           LENGTH OF ENTRY                              
*                                                                               
AUSTRIA  DC    CL2'AT',X'14'       AUSTRIA(20)                                  
         DC    AL1(AUSTL)                                                       
         DC    C'N',X'12'          18 NUMBERS                                   
AUSTL    EQU   *-AUSTRIA                                                        
*                                                                               
*BELARUS  DC    CL2'BY',X'00'       BELARUS                                     
*         DC    AL1(BELARL)                                                     
*         DC    X'00'               NO STRUCTURE DEFINED                        
*BELARL   EQU   *-BELARUS                                                       
*                                                                               
BELGIUM  DC    CL2'BE',X'10'       BELGIU(16)                                   
         DC    AL1(BEGL)                                                        
         DC    C'N',X'0E'          14 NUMBERS                                   
BEGL     EQU   *-BELGIUM                                                        
*                                                                               
BOSHER   DC    CL2'BA',X'14'       BOSNIA AND HERZOGOVINA(20)                   
         DC    AL1(BOSHL)                                                       
         DC    C'N',X'12'          18 NUMBERS                                   
BOSHL    EQU   *-BOSHER                                                         
*                                                                               
BULGARIA DC    CL2'BG',X'16'       BULGARIA(22)                                 
         DC    AL1(BULGL)                                                       
         DC    C'N',X'02',C'C',X'04',C'N',X'06',C'M',X'08'                      
BULGL    EQU   *-BULGARIA          2 NUM, 4 CHAR, 6 NUM, 8 MIXED                
*                                                                               
CROATIA  DC    CL2'HR',X'15'       CROATIA(21)                                  
         DC    AL1(CROATL)                                                      
         DC    C'N',X'13'          19 NUMBERS                                   
CROATL   EQU   *-CROATIA                                                        
*                                                                               
CYPRUS   DC    CL2'CY',X'1C'       CYPRUS(28)                                   
         DC    AL1(CYPRL)                                                       
         DC    C'N',X'0A',C'M',X'10' 10 NUMBERS,16 MIXED                        
CYPRL    EQU   *-CYPRUS                                                         
*                                                                               
CZECH    DC    CL2'CZ',X'18'       CZECHOSLOVAKIA(24)                           
         DC    AL1(CZECHL)                                                      
         DC    C'N',X'16'          22 NUMBERS                                   
CZECHL   EQU   *-CZECH                                                          
*                                                                               
DENMARK  DC    CL2'DK',X'12'       DENMARK(18)                                  
         DC    AL1(DENML)                                                       
         DC    C'N',X'10'          16 NUMBERS                                   
DENML    EQU   *-DENMARK                                                        
*                                                                               
ESTONIA  DC    CL2'EE',X'14'       ESTONIA(20)                                  
         DC    AL1(ESTL)                                                        
         DC    C'N',X'12'          18 NUMBERS                                   
ESTL     EQU   *-ESTONIA                                                        
*                                                                               
FINLAND  DC    CL2'FI',X'12'       FINLAND(18)                                  
         DC    AL1(FINL)                                                        
         DC    C'N',X'10'          16 NUMBERS                                   
FINL     EQU   *-FINLAND                                                        
*                                                                               
FRANCE   DC    CL2'FR',X'1B'       FRANCE(27)                                   
         DC    AL1(FRANCL)                                                      
         DC    C'N',X'0C',C'M',X'0B',C'N',X'02' 12 NUM, 11 MIX, 2 NUM           
FRANCL   EQU   *-FRANCE                                                         
*                                                                               
GERMANY  DC    CL2'DE',X'16'       GERMANY(22)                                  
         DC    AL1(GERML)                                                       
         DC    C'N',X'14'          20 NUMBERS                                   
GERML    EQU   *-GERMANY                                                        
*                                                                               
GIBRALT  DC    CL2'GI',X'17'       GIBRALTAR(23)                                
         DC    AL1(GIBRL)                                                       
         DC    C'N',X'02',C'C',X'04',C'M',X'0F' 2 NUM, 4 CHA, 15 MIX            
GIBRL    EQU   *-GIBRALT                                                        
*                                                                               
GREECE   DC    CL2'GR',X'1B'       GREECE(27)                                   
         DC    AL1(GRECL)                                                       
         DC    C'N',X'09',C'M',X'10'  9 NUMBERS, 16 CHARS                       
GRECL    EQU   *-GREECE                                                         
*                                                                               
HUNGARY  DC    CL2'HU',X'1C'       HUNGARY(28)                                  
         DC    AL1(HUNGL)                                                       
         DC    C'N',X'1A'          26 NUMBERS                                   
HUNGL    EQU   *-HUNGARY                                                        
*                                                                               
ICELAND  DC    CL2'IS',X'1A'       ICELAND(26)                                  
         DC    AL1(ICEL)                                                        
         DC    C'N',X'18'          24 NUMBERS                                   
ICEL     EQU   *-ICELAND                                                        
*                                                                               
IRELAND  DC    CL2'IE',X'16'       IRELAND(22)                                  
         DC    AL1(IREL)                                                        
         DC    C'N',X'02',C'C',X'04',C'N',X'0E' 2 NUM, 4 CHAR, 14 NUM           
IREL     EQU   *-IRELAND                                                        
*                                                                               
ISRAEL   DC    CL2'IL',X'17'       ISRAEL(23)                                   
         DC    AL1(ISRAELL)                                                     
         DC    C'N',X'15'          21 NUMBERS                                   
ISRAELL  EQU   *-ISRAEL                                                         
*                                                                               
ITALY    DC    CL2'IT',X'1B'       ITALY(27)                                    
         DC    AL1(ITALL)                                                       
         DC    C'N',X'02',C'C',X'01',C'N',X'0A',C'M',X'0C'                      
ITALL    EQU   *-ITALY             2 NUM 1 CHA 10 NUM 12 CHA                    
*                                                                               
LATVIA   DC    CL2'LV',X'15'       LATVIA(21)                                   
         DC    AL1(LATVL)                                                       
         DC    C'N',X'02',C'C',X'04',C'M',X'0D' 2 NUMS, 4 CHARS, 13 NUM         
LATVL    EQU   *-LATVIA                                                         
*                                                                               
LIECHTEN DC    CL2'LI',X'15'       LIECHTENSTEIN(21)                            
         DC    AL1(LICHL)                                                       
         DC    C'N',X'07',C'M',X'0C' 7 NUMS, 12 MIXED                           
LICHL    EQU   *-LIECHTEN                                                       
*                                                                               
LITHUAN  DC    CL2'LT',X'14'       LITHUANIA(20)                                
         DC    AL1(LITHL)                                                       
         DC    C'N',X'12'          18 NUMBERS                                   
LITHL    EQU   *-LITHUAN                                                        
*                                                                               
LUXEMB   DC    CL2'LU',X'14'       LUXEMBOURG(20)                               
         DC    AL1(LUXEMBL)                                                     
         DC    C'N',X'05',C'M',X'0D' 5 NUM, 13 MIX                              
LUXEMBL  EQU   *-LUXEMB                                                         
*                                                                               
MACEDON  DC    CL2'MK',X'13'       MACEDONIA(19)                                
         DC    AL1(MACEDL)                                                      
         DC    C'N',X'05',C'M',X'0A',C'N',X'02' 5 NUMS, 10 CHA, 2 NUMS          
MACEDL   EQU   *-MACEDON                                                        
*                                                                               
MALTA    DC    CL2'MT',X'1F'       MALTA(31)                                    
         DC    AL1(MALTL)                                                       
         DC    C'N',X'02',C'C',X'04',C'N',X'05',C'M',X'12'                      
MALTL    EQU   *-MALTA             2 NUMS, 4 CHAR, 5 NUM, 18 MIXED              
*                                                                               
MAURIT   DC    CL2'MU',X'1E'       MAURITIUS(30)                                
         DC    AL1(MAURITL)                                                     
         DC    C'N',X'02',C'C',X'04',C'N',X'13',C'C',X'03'                      
MAURITL  EQU   *-MAURIT            2 NUMS, 4 MIX, 19 NUMS, 3 MIX                
*                                                                               
MONACO   DC    CL2'MC',X'1B'       MONACO(27)                                   
         DC    AL1(MONACL)                                                      
         DC    C'N',X'0C',C'M',X'0B',C'N',X'02' 12 NUMS, 11 MIX, 2 NUM          
MONACL   EQU   *-MONACO                                                         
*                                                                               
MONTENEG DC    CL2'ME',X'16'       MONTENEGRO(22)                               
         DC    AL1(MONTEL)                                                      
         DC    C'N',X'14'          20 NUMS                                      
MONTEL   EQU   *-MONTENEG                                                       
*                                                                               
NETHER   DC    CL2'NL',X'12'       THE NETHERLANDS(18)                          
         DC    AL1(NETHERL)                                                     
         DC    C'N',X'02',C'C',X'04',C'N',X'0A' 2 NUM, 4 CHAR, 10 NUM           
NETHERL  EQU   *-NETHER                                                         
*                                                                               
NORWAY   DC    CL2'NO',X'0F'       NORWAY(15)                                   
         DC    AL1(NORWAL)                                                      
         DC    C'N',X'0D'          13 NUMS                                      
NORWAL   EQU   *-NORWAY                                                         
*                                                                               
POLAND   DC    CL2'PL',X'1C'       POLAND(28)                                   
         DC    AL1(POLAL)                                                       
         DC    C'N',X'1A'          26 NUMS                                      
POLAL    EQU   *-POLAND                                                         
*                                                                               
PORTUGAL DC    CL2'PT',X'19'       PORTUGAL/THE AZORES AND MADEIRA(25)          
         DC    AL1(PORTUL)                                                      
         DC    C'N',X'17'          23 NUMS                                      
PORTUL   EQU   *-PORTUGAL                                                       
*                                                                               
ROMANIA  DC    CL2'RO',X'18'       ROMANIA(24)                                  
         DC    AL1(ROMANL)                                                      
         DC    C'N',X'02',C'C',X'04',C'M',X'10'                                 
ROMANL   EQU   *-ROMANIA           2 NUM, 4 CHAR, 16 MIXED                      
*                                                                               
SANMARIN DC    CL2'SM',X'1B'       SAN MARINO(27)                               
         DC    AL1(SANMAL)                                                      
         DC    C'N',X'02',C'C',X'01',C'N',X'0A',C'M',X'0C'                      
SANMAL   EQU   *-SANMARIN          2 NUM, 1 CHAR, 10 NUM, 12 MIX                
*                                                                               
SERBIA   DC    CL2'RS',X'16'       SERBIA/KOSOVO(22)                            
         DC    AL1(SERBL)                                                       
         DC    C'N',X'14'          20 NUMS                                      
SERBL    EQU   *-SERBIA                                                         
*                                                                               
SLOVAKIA DC    CL2'SK',X'18'       SLOVAKIA(24)                                 
         DC    AL1(SLOVAL)                                                      
         DC    C'N',X'16'          22 NUMS                                      
SLOVAL   EQU   *-SLOVAKIA                                                       
*                                                                               
SLOVENIA DC    CL2'SI',X'13'       SLOVENIA(19)                                 
         DC    AL1(SLOVEL)                                                      
         DC    C'N',X'11'          17 NUMS                                      
SLOVEL   EQU   *-SLOVENIA                                                       
*                                                                               
SPAIN    DC    CL2'ES',X'18'       SPAIN/THE CANARIES AND MAJORCA(24)           
         DC    AL1(SPAINL)                                                      
         DC    C'N',X'16'          22 NUMS                                      
SPAINL   EQU   *-SPAIN                                                          
*                                                                               
SWEDEN   DC    CL2'SE',X'18'       SWEDEN(24)                                   
         DC    AL1(SCHWEDL)                                                     
         DC    C'N',X'16'          22 NUMS                                      
SCHWEDL  EQU   *-SWEDEN                                                         
*                                                                               
SWITZ    DC    CL2'CH',X'15'       SWITZERLAND(21)                              
         DC    AL1(SWITZL)                                                      
         DC    C'N',X'07',C'M',X'0C' 7 NUM, 12 MIXED                            
SWITZL   EQU   *-SWITZ                                                          
*                                                                               
*TUNISIA  DC    CL2'TN',X'18'       TUNISIA(24)                                 
*         DC    AL1(TUNISL)                                                     
*         DC    C'N',X'16'          22 NUMS                                     
*TUNISL   EQU   *-TUNISIA                                                       
*                                                                               
TURKEY   DC    CL2'TR',X'1A'       TURKEY(26)                                   
         DC    AL1(TURKL)                                                       
         DC    C'N',X'07',C'M',X'11' 7 NUMS, 17 MIX                             
TURKL    EQU   *-TURKEY                                                         
*                                                                               
*UKRAINE  DC    CL2'UG',X'00'       UKRAINE                                     
*         DC    AL1(UKRL)                                                       
*         DC    X'00'               NO STRUCTURE                                
*UKRL     EQU   *-UKRAINE                                                       
*                                                                               
UNITEDK  DC    CL2'GB',X'16'       UNITED KINGDOM(22)                           
         DC    AL1(UKL)                                                         
         DC    C'N',X'02',C'C',X'04',C'N',X'0E' 2 NUM, 4 CHAR, 14 NUM           
UKL      EQU   *-UNITEDK                                                        
*                                                                               
*USSR     DC    CL2'RU',X'00'       RUSSIA                                      
*         DC    AL1(USSRL)                                                      
*         DC    X'00'               NO STRUCTURE DEFINED                        
*USSRL    EQU   *-UNITEDK                                                       
*                                                                               
         DC    X'FF'                                                            
IBANTABL EQU   *-IBANTAB                                                        
         SPACE 1                                                                
