*          DATA SET ACINTF6D   AT LEVEL 002 AS OF 01/11/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T619F6D      DATE 01/11/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL18     6    2   18  A  P N             T        Y              
DELRCVH  DS    XL8                                                              
DELRCV   DS    CL12     6   25   12  A  U N             T        Y              
DELRCVNH DS    XL8                                                              
DELRCVN  DS    CL36     6   42   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
DELCLTH  DS    XL8                                                              
DELCLT   DS    CL3      7   25    3  A  U N             T        Y              
DELCLTNH DS    XL8                                                              
DELCLTN  DS    CL36     7   42   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
DELPRDH  DS    XL8                                                              
DELPRD   DS    CL3      8   25    3  A  U N             T        Y              
DELPRDNH DS    XL8                                                              
DELPRDN  DS    CL36     8   42   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      9    2    5  A  P N             T        Y              
DELMEDH  DS    XL8                                                              
DELMED   DS    CL5      9   25    5  A  U N             T        Y              
DELMEDNH DS    XL8                                                              
DELMEDN  DS    CL36     9   42   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15    10    2   15  A  P N             T        Y              
DELESTH  DS    XL8                                                              
DELEST   DS    CL6     10   25    6  A  U N             T        Y              
DELESTNH DS    XL8                                                              
DELESTN  DS    CL36    10   32   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15    11    2   15  A  P H             T        Y              
DELPERH  DS    XL8                                                              
DELPER   DS    CL15    11   25   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    11   42   15  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL14    13    2   14  A  P N             T        Y              
DELOPTH  DS    XL8                                                              
DELOPT   DS    CL1     13   25    1  A  U N             T        Y              
DELTAGH  DS    XL8                                                              
DELTAG   DS    CL1     14   19    1  A  P N             T        Y              
DELLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
DELWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 496  BYTES                            
