*          DATA SET ACINQDSECT AT LEVEL 018 AS OF 10/18/96                      
*                                                                               
* ACGENBOTH                                                                     
*                                                                               
         PRINT OFF                                                              
       ++INCLUDE ACGENBOTH                                                      
         PRINT ON                                                               
         SPACE 2                                                                
* ACGENFILE                                                                     
*                                                                               
         PRINT OFF                                                              
       ++INCLUDE ACGENFILE                                                      
         PRINT ON                                                               
         SPACE 2                                                                
* ACLDGTABD                                                                     
*                                                                               
         PRINT OFF                                                              
       ++INCLUDE ACLDGTABD                                                      
         PRINT ON                                                               
         SPACE 2                                                                
* ACOFFALD                                                                      
*                                                                               
         PRINT OFF                                                              
       ++INCLUDE ACOFFALD                                                       
         PRINT ON                                                               
         SPACE 2                                                                
* DDCTRYEQUS/DDLANGEQUS                                                         
*                                                                               
         PRINT OFF                                                              
       ++INCLUDE DDCTRYEQUS                                                     
       ++INCLUDE DDLANGEQUS                                                     
         PRINT ON                                                               
         SPACE 2                                                                
* FAGETTXTD                                                                     
*                                                                               
         PRINT OFF                                                              
       ++INCLUDE FAGETTXTD                                                      
         PRINT ON                                                               
         EJECT                                                                  
* ACPRORATA                                                                     
*                                                                               
         PRINT OFF                                                              
PRORATAD DSECT                                                                  
       ++INCLUDE ACPRORATAD                                                     
         PRINT ON                                                               
         EJECT                                                                  
* GLOBAL EQUATES                                                                
*                                                                               
PFK01    EQU   1                                                                
PFK02    EQU   2                                                                
PFK03    EQU   3                                                                
PFK04    EQU   4                                                                
PFK05    EQU   5                                                                
PFK06    EQU   6                                                                
PFK07    EQU   7                                                                
PFK08    EQU   8                                                                
PFK09    EQU   9                                                                
PFK10    EQU   10                                                               
PFK11    EQU   11                                                               
PFK12    EQU   12                                                               
*                                                                               
MISSING  EQU   1                                                                
INVALID  EQU   2                                                                
NOTNUMRC EQU   3                                                                
NOTVLCDE EQU   5                                                                
LEDGNVAL EQU   9                                                                
UNITNVAL EQU   10                                                               
DATINVAL EQU   13                                                               
ACCTNVAL EQU   17                                                               
CASHERR  EQU   25                                                               
HILVLMIS EQU   61                                                               
WRNGLEVL EQU   65                                                               
CHANGNVL EQU   68                                                               
INVFTYPE EQU   69                                                               
CANVLEDG EQU   74                                                               
         SPACE 2                                                                
DDSONLY  EQU   X'80'                                                            
TWA1USER EQU   X'40'                                                            
RUNLAST  EQU   X'FF'                                                            
ACLISTER EQU   X'01'               ACCOUNT RECORD LISTING TYPE                  
         EJECT                                                                  
* DSECT TO COVER GLOBAL WORKING STORAGE                                         
*                                                                               
GWS      DSECT                                                                  
*                                                                               
DUB      DS    D                                                                
DMCB     DS    7F                                                               
PARM     DS    6F                                                               
FULL     DS    F                                                                
BYTE     DS    C                                                                
THREE    DS    CL3                                                              
HALF     DS    H                                                                
HALF2    DS    H                                                                
*                                                                               
* FACILITIES PARAMETERS                                                         
*                                                                               
AFACS    DS    A         X         A(FACILITIES PARAMETER LIST)                 
ATIOB    DS    A         X         A(TRANSLATOR INPUT/OUTPUT BLOCK)             
ATWA     DS    A         X                                                      
AACCFACS DS    A         X                                                      
ATIA     DS    A         X                                                      
ACOMFACS DS    A         X                                                      
AXTRAI   DS    A         X         A(EXTRA INFO AREA)                           
FACSLEN  EQU   *-ATIOB             LENGTH OF FACILITIES PARM LIST               
         DS    3A                  SPARE                                        
*                                                                               
* ROOT PROGRAM ADDRESSES                                                        
*                                                                               
RELO     DS    F         X         RELOCATION FACTOR                            
AREGSAVE DS    A         X         SAVED ROOT RD VALUE                          
ABASE    DS    A         X         A(1ST BASE REGISTER)                         
A2NDBASE DS    A         X         A(2ND BASE REGISTER)                         
APHASE   DS    A         X         A(PHASE)                                     
         DS    3A                  SPARE                                        
*                                                                               
* TERMINAL VALUES                                                               
*                                                                               
TERMINAL DS    H                                                                
TERMACCS DS    0CL4      C         TWAACCS                                      
TERMACCO DS    CL2                 OLD OFFICE ACCESS                            
TERMACCN DS    CL2                 NEW OFFICE ACCESS                            
TERMAUTH DS    CL2                 TWA AUTHORISATION CODE                       
TERMAGY  DS    CL2                 TERMINAL AGENCY ALPHA                        
DDS      DS    C                   Y=DDS TERMINAL                               
         DS    CL5                 SPARE                                        
*                                                                               
* TRANSLATOR BLOCK VALUES                                                       
*                                                                               
CURDISP  DS    H                   DISPLACEMENT TO CURSOR FIELD                 
MODFRST  DS    H                   DISPLACEMENT TO FIRST MODIFIED FIELD         
MODLAST  DS    H                   DISPLACEMENT TO LAST MODIFIED FIELD          
PFKEY    DS    X                   0=ENTER, 1-12=PF KEY PRESSED                 
         DS    XL5                 SPARE                                        
*                                                                               
* EXTRA INFO VALUES                                                             
*                                                                               
AGYOPTS  DS    XL1                 COUNTRY OPTIONS                              
AGYCTRY  DS    XL1                 ACTUAL COUNTRY                               
AGYLANG  DS    XL1                 LANGUAGE                                     
AGYCURR  DS    CL3                 CURRENCY                                     
         DS    CL10                SPARE                                        
*                                                                               
* COMFACS MODULE ADCONS                                                         
*                                                                               
VADDAY   DS    V                                                                
VCALLOV  DS    V                                                                
VCASHVAL DS    V                                                                
VCUREDIT DS    V                                                                
CUREDIT  EQU   VCUREDIT                                                         
VDATAMGR DS    V                                                                
VDATCON  DS    V                                                                
VDATVAL  DS    V                                                                
VDICTATE DS    V                                                                
VGETFACT DS    V                                                                
VGETMSG  DS    V                                                                
VGETPROF DS    V                                                                
VGETTXT  DS    V                                                                
VHELLO   DS    V                                                                
VHEXIN   DS    V                                                                
VHEXOUT  DS    V                                                                
VPERVAL  DS    V                                                                
VSCANNER DS    V                                                                
VSWITCH  DS    V                                                                
VUNSCAN  DS    V                                                                
         DS    8V                  SPARE                                        
*                                                                               
* CORE-RESIDENT MODULE ADCONS                                                   
*                                                                               
COREFACS DS    0F                                                               
VCENTER  DS    V         X                                                      
VCHOPPER DS    V         X                                                      
VGETOPT  DS    V         X                                                      
VJOBBER  DS    V         X                                                      
VOFFAL   DS    V         X                                                      
VQSORT   DS    V         X                                                      
VSQASHER DS    V         X                                                      
VTSAR    DS    V         X                                                      
         DS    8V                  SPARE                                        
*                                                                               
* COMMON SUB-ROUTINES                                                           
*                                                                               
COMMON   DS    0C                                                               
VACSPLIT DS    V         X                                                      
VBINSRCH DS    V         X                                                      
EDITYPE  DS    CL4       X         CHECK AND CVB TYPE FILTER                    
EDITACC  DS    V         X         CHECK ACCOUNT KEY                            
EDITACNM DS    V         X         DISPLAY ACCOUNT & CONTRA NAMES               
EDITCASH DS    V         X         CHECK AND PACK CASH FILTER                   
EDITCONT DS    V         X         HANDLE CONTRA FILTER                         
EDITSTRT DS    V         X         HANDLE START DATE FILTER                     
EDITEND  DS    V         X         HANDLE END DATE FILTER                       
EDITUNLE DS    V         X         CHECK UNIT OR LEDGER KEY                     
EDITOVER DS    V         X         HANDLE OVERRIDE OPTION                       
EDITOPT1 DS    V         X         SET OPTIONS X'01' BIT                        
ASETELAD DS    V         X         SET UP ELEMENT ADDRESSES IN W/S              
AFILTER  DS    V         X         FILTER VIA FILTER TABLE                      
AREADB   DS    V         X         READ ACCOUNT RECORD TO IOB                   
AHIGHB   DS    V         X         READ HIGH ACCOUNT RECORD TO IOB              
AWRITIA  DS    V         X         WRITE TIA                                    
CONVMOS  DS    V                                                                
PRORATA  DS    V                   PRORATA                                      
         DS    13V                 SPARE                                        
COMMONX  DS    0C                                                               
*                                                                               
* EXTENDED STORAGE ADCONS                                                       
*                                                                               
ALOCAL   DS    A                   A(LOCAL WORKING STORAGE)                     
AOFFBLK  DS    A                   A(OFFAL BLOCK)                               
AIO      DS    A                   A(IO)                                        
AIOB     DS    A                   A(IOB)                                       
AIOC     DS    A                   A(IOC)                                       
         DS    9A                  SPARE                                        
*                                                                               
* COMPANY RECORD VALUES                                                         
*                                                                               
MYCO     DS    C                   COMPANY FOR THIS ENQUIRY                     
PRODUNIT DS    C         C         PRODUCTION UNIT CODE                         
PRODLEDG DS    C         C         PRODUCTION LEDGER CODE                       
RECVUNIT DS    C         C         RECEIVABLE UNIT CODE                         
RECVLEDG DS    C         C         RECEIVABLE LEDGER CODE                       
COMPALFA DS    CL2       C         AGENCY ALPHA CODE                            
         DS    XL12                SPARE                                        
*                                                                               
* ROOT PROGRAM GENERAL AREAS                                                    
*                                                                               
AUTHTYPE DS    C         X         RECAUTH VALUE FOR CURRENT TYPE               
         DS    CL3                 SPARE                                        
HELPKMK  DS    C         X         HELP MARKER.X'01'=KEY,X'02'=CONTRA           
DMARK    DS    C         X         1=SEQUENCE BROKEN SO READ HIGH NEXT          
ERROR    DS    C         X         ERROR NUMBER                                 
FNDX     DS    C         X         FIELD INDEX NUMBER                           
ELCODE   DS    C         X         USED BY GETEL MACRO                          
         DS    XL24                SPARE                                        
*                                                                               
* VALUES SET BY FILTER TABLE PROCESSING ROUTINE                                 
*                                                                               
KEYFILT  DS    C         C         Y=WE HAVE A KEY FILTER                       
OPTIONS  DS    C         X         X'80'-DDS=YES OPTION                         
*                                  X'02'-MOS RANGE FILTER                       
STAFILT  DS    CL27      V         START KEY FILTER (KEY+15 TO +41)             
ENDFILT  DS    CL27      V         END DITTO                                    
DELETED  DS    CL1       C         Y=DELETED=YES FILTER IN USE                  
         DS    XL24                SPARE                                        
*                                                                               
* VALUES EXTRACTED FROM ACCOUNT                                                 
*                                                                               
OFFICE   DS    CL2       C         OFFICE CODE FOR THIS A/C                     
         ORG   OFFICE                                                           
OLDOFF   DS    CL1                 OLD OFFICE CODE                              
         DS    CL1                                                              
SECURITY DS    CL2       X         SECURITY NUMBER                              
         DS    XL16                SPARE                                        
*                                                                               
* VALUES SET BY SECURCHK ROUTINE IN ROOT                                        
*                                                                               
ACLKEYS  DS    CL60      C         ACCOUNT KEYS (4 LEVELS)                      
LEVEL    DS    H                   ACCOUNT LEVEL -BINARY                        
         DS    C                                 -DECIMAL CHARACTER             
         DS    C                                 -BIT- X'08','04','02'          
*                                                 LEV-   1   1-2  1-3           
SAVLEVEL DS    CL2       X         SAVED LEVEL WHEN CHECKING HIGHER ONE         
LOWLEVEL DS    CL1       X         LOWEST LEVEL OF A/C REQUIRED (LIST)          
         DS    XL8                 SPARE                                        
*                                                                               
THISTMBR DS    F                   EXECUTED BRANCHES IN FILTER ROUTINE          
THISBR   DS    F                                                                
ASAVEL   DS    A         X         A(ELEMENT SAVED BY OVERLAY)                  
         DS    CL64                SPARE                                        
*                                                                               
* ADCONS SET FOR OVERLAYS                                                       
*                                                                               
AOFFICE  DS    A         X         A(OFFICE CODE)                               
ALEVEL   DS    A         X         A(LEVEL)                                     
AKEY     DS    A                                                                
         DS    5A                                                               
*                                                                               
AELTAB   DS    0F                  ELEMENT ADDRESS TABLE                        
AHIE     DS    A         X                      X'16' HIERARCHY                 
ANAM     DS    A         X                      X'20' NAME                      
ANUM     DS    A         X                      X'21' NUMBER                    
AOTH     DS    A         X                      X'23' OTHER                     
ASTA     DS    A         X                      X'30' STATUS                    
ABAL     DS    A         X                      X'32' BALANCE                   
ABUD     DS    A         X                      X'34' BUDGET                    
ASUB     DS    A         X                      X'43' SUBHEADER                 
ATRN     DS    A         X                      X'44' TRANSACTION               
AHST     DS    A         X                      X'45' HISTORY                   
ACSH     DS    A         X                      X'50' CASH                      
ATRS     DS    A         X                      X'60' STATUS                    
APRO     DS    A         X                      X'24' PROFILE                   
ATRT     DS    A         X                      X'4E' TRANSFER                  
ALED     DS    A         X                      X'14' LEDGER                    
AXNO     DS    A         X                      X'25' EXTRA NUMBER              
AORD     DS    A         X                      X'67' PRODUCTION ORDER          
AOAM     DS    A         X                      X'68' ORDER AMOUNT              
ADUE     DS    A         X                      X'61' DUE DATE                  
AEST     DS    A         X                      X'35' JOB ESTIMATE              
ACSHD    DS    A         X                      X'50' CASH DISCOUNT             
AJOB     DS    A         X                      X'26' JOB ELEMENT               
APER     DS    A         X                      X'40' PERSONEL ELEMENT          
ATAX     DS    A         X                      X'50  TYPE T, TAX               
AANP     DS    A         X                      X'C0' ANAL/ATTRIBUTES           
AMTR     DS    A         X                      X'1A' MEDIA TRANSFER            
APCI     DS    A         X                      X'51' PROJ CNTL INFO            
AUNT     DS    A         X                      X'7C' UNIT/PRICE INFO           
AELTBLEN EQU   *-AELTAB                         L'ELEM ADCON LIST               
         DS    6A        X                      SPARE                           
AELTABX  DS    C                                                                
*                                                                               
WORK     DS    CL180                                                            
SPACES   DS    CL132                                                            
         DS    XL80                SPARE                                        
*                                                                               
* FILE READING AREAS                                                            
*                                                                               
KEY      DS    CL64      C         MAIN KEY FIELD                               
KEYB     DS    CL64      C         KEY USED FOR SUBSIDIARY READING              
KEYCHK   DS    CL64      V         COPY OF KEY WITH VARIABLE COMPONENTS         
*                                  ZEROISED                                     
KEYMASK  DS    CL64      X         KEY MASK WITH ZEROS IN VARIABLE KEY          
*                                  COMPONENTS AND ONES OTHERWISE                
RECOUNT  DS    F                   IO COUNT MAX FROM FACTSD                     
LIMIT    DS    F                                                                
DATADISP DS    H                                                                
         DS    XL80                SPARE                                        
*                                                                               
* SCAN/UNSCAN BLOCK AND FILTER TABLE                                            
*                                                                               
         DS    0F                                                               
SCANBLCK DS    9CL35     V         SCANNER OUTPUT BLOCK                         
         ORG   SCANBLCK                                                         
UNSCANBK DS    16CL20    V         UNSCAN OUTPUT BLOCK                          
         DS    CL120               SPARE                                        
*                                                                               
FILTAB   DS    10CL20              FILTER TABLE COVERED BY DSECT FTBD           
FILTABX  DS    C                                                                
         DS    CL100               SPARE                                        
*                                                                               
* EXTENDED STORAGE AREAS                                                        
*                                                                               
         DS    0D                                                               
OFFBLK   DS    CL(OFFALLEN)        OFFAL BLOCK                                  
         DS    0D                                                               
IO       DS    CL2048                                                           
         DS    0D                                                               
IOB      DS    CL2048                                                           
         DS    0D                                                               
IOC      DS    CL2048                                                           
         DS    0D                                                               
LOCAL    DS    CL3000    V         AVAILABLE TO OVERLAY                         
LOCALLEN EQU   *-LOCAL             LENGTH OF OVERLAY STORAGE                    
GWSX     EQU   *                                                                
         EJECT                                                                  
*                  DSECT TO COVER A KEYS TABLE ENTRY IN OVERLAY                 
         SPACE 1                                                                
KEYTABD  DSECT                                                                  
KEYNAME  DS    CL10      C         KEY COMPONENT DESCRIPTION                    
KEYMAND  DS    CL1       C         MANDATORY/OPTIONAL MARKER                    
*                                  C'M' = MUST BE INPUT                         
*                                  C'O' = MAY BE INPUT                          
*                                  C' ' = NOT PROVIDED BY USER                  
KEYVARY  DS    CL1       C         VARIABILITY MARKER                           
*                                  C'V' = VALUE WILL VARY FROM RECORD           
*                                         TO RECORD IN SINGLE ENQUIRY           
*                                  C' ' = VALUE WONT VARY                       
KEYDFLT  DS    CL1       V         DEFAULT VALUE OF FIRST BYTE OF KEY           
*                                  COMPONENT IF KEYMAND = C'O'                  
KEYDISP  DS    CL1       X         DISPLACEMENT FROM START OF KEYS              
KEYLEN   DS    CL1       X         LENGTH (PRE-EDIT)                            
KEYPOINT DS    CL2       X         DISPLACEMENT FROM START OF GLOBAL WS         
*                                  OF LOCATION OF KEY COMPONENT VALUE           
KEYEDIT  DS    CL2       X         DISPLACEMENT FROM START OF GLOBAL WS         
*                                  OF LOCATION OF A(EDIT S/R) IN ROOT           
*                                  OR X'FF00' = ENTER OVERLAY TO EDIT           
*                                  OR ZERO    = NO EDITING  REQUIRED            
KEYTBLEN EQU   *-KEYTABD                                                        
         SPACE 3                                                                
*                  DSECT TO COVER A FILTER TABLE ENTRY IN OVERLAY               
         SPACE 1                                                                
FILTERSD DSECT                                                                  
FILFULKW DS    CL10      C         FILTER KEYWORD                               
FILSHTKW DS    CL2       C         SHORT KEYWORD                                
FILSTAT  DS    CL1       X         STATUS BYTE - X'80' = DDS-ONLY               
*                                                X'40' = DMY DATE               
*                                                X'20' = MY DATE                
*                                                X'10' = START KEY              
*                                                X'08' = END KEY                
*                                                X'04' = SUB-RECORD             
*                                                X'02' = REVERSE SIGN           
*                                                X'01' = DISABLED               
FILNOTNL DS    CL8       C         NOTIONAL VALUE (EG 'YES') OR SPACES          
FILVALUE DS    CL1       X         REAL VALUE FOR TEST UNDER MASK IF            
*                                  FILNOTNL IS NOT SPACES                       
*                                  OR OPTIONS BIT SETTING IF FILELMNT=0         
FILELMNT DS    CL2       X         DISPLACEMENT FROM START OF GLOBAL WS         
*                                  OF LOCATION OF A(ELEMENT CONTAINING          
*                                  FILTER FIELD)                                
*                                  OR ZERO IF ITS AN OPTION NOT FILTER          
FILDISP  DS    CL1       X         DISPLACEMENT FROM START OF ELEMENT           
FILENGTH DS    CL1       X         MAX LENGTH OF INPUT FILTER VALUE             
FILPREED DS    CL2       X         VALIDATION S/R POINTER - SAME FORMAT         
*                                  AS FILEDIT BELOW                             
FILEDIT  DS    CL2       X         DISPLACEMENT FROM START OF GLOBAL WS         
*                                  OF LOCATION OF A(FIELD CONVERSION            
*                                  S/R) IN ROOT                                 
*                                  OR X'FF00' = ENTER OVERLAY TO                
*                                               CONVERT FIELD                   
*                                  OR ZERO    = NO FIELD CONVERSION             
FILTBLEN EQU   *-FILTERSD                                                       
         SPACE 3                                                                
*                  DSECT TO COVER A GENERATED FILTER TABLE ENTRY IN GWS         
         SPACE 1                                                                
FTBD     DSECT                                                                  
FTBELMNT DS    CL4       X         ADDRESS IN GLOBAL WS OF A(ELEMENT            
*                                  CONTAINING FILTER)                           
FTBDISP  DS    CL1       X         DISPLACEMENT FROM START OF ELEMENT           
FTBLEN   DS    CL1       X         LENGTH OF INPUT FILTER VALUE                 
FTBSTAT  DS    CL1                 STATUS BYTE (=FILSTAT ABOVE)                 
FTBMARK  DS    CL1       C         M=MASK, C=COMPARE                            
FTBVAL   DS    CL7       V         MASK (CL1) OR COMPARE VALUE                  
FTBSIGN  DS    CL1       C         P=POSITIVE, N=NEGATIVE                       
FTBSR    DS    CL4       X         A(FIELD CONVERSION S/R) OR ZERO              
FTBTBLEN EQU   *-FTBD                                                           
         SPACE 3                                                                
*                  DSECT TO COVER A DATA TABLE ENTRY IN OVERLAY                 
         SPACE 1                                                                
DATTABD  DSECT                                                                  
DATELMNT DS    CL2       X         DISPLACEMENT FROM START OF GLOBAL WS         
*                                  OF LOCATION OF A(ELEMENT CONTAINING          
*                                  DISPLAY FIELD)                               
DATDISP  DS    CL2       X         DISPLACEMENT FROM START OF ELEMENT           
DATLEN   DS    CL1       X         LENGTH (PRE-EDIT)                            
DATEDIT  DS    CL2       X         DISPLACEMENT FROM START OF GLOBAL WS         
*                                  OF LOCATION OF A(EDIT S/R) IN ROOT           
*                                  OR X'FF00' = ENTER OVERLAY TO EDIT           
*                                  OR ZERO    = NO EDITTING REQUIRED            
DATSTART DS    CL1       X         START POSITION ON SCREEN (COL NO)            
DATTWOUP DS    CL1       X         DITTO FOR 2ND HALF IF TWO UP OR ZERO         
DATTBLEN EQU   *-DATTABD                                                        
         SPACE 3                                                                
*                  DSECT TO COVER RECORD TYPE TABLE IN ROOT                     
         SPACE 1                                                                
RECTABD  DSECT                                                                  
RECTYPE  DS    CL2       C         TWO CHARACTER RECORD TYPE CODE               
RECOLAY  DS    CL1       X         OVERLAY PHASE NUMBER                         
RECAUTH  DS    CL1       X         AUTHORIZATION BYTE                           
*                                  X'80' = DDS-ONLY                             
*                                  X'40' = TWA1 USER                            
*                                  X'20' = SECURITY CHECKS REQUIRED             
*                                  X'10' = CONTRA-ACCOUNT IS START KEY          
*                                  X'08' = CONTRA-ACCOUNT IS END KEY            
*                                  X'04' = CONTRA FILTERING BY OVERLAY          
*                                  X'02' = NOT ALLOWED FOR PROD.LEDGER          
*                                  X'01' = ACCOUNT LISTING TYPE                 
RECNAME  DS    CL14      C         RECORD TYPE DESCRIPTION                      
RECTBLEN EQU   *-RECTABD                                                        
         SPACE 3                                                                
*                  DSECT TO COVER A LINE ON THE SCREEN                          
         SPACE 1                                                                
LINED    DSECT                                                                  
LINEHDR  DS    CL8       X         FIELD HEADER                                 
LINEDATA DS    0CL78     C         DATA LINE                                    
LFIRSTH  DS    CL39      C         1ST HALF OF LINE                             
LSECONDH DS    CL39      C         2ND HALF OF LINE                             
LINELEN  EQU   *-LINED                                                          
         EJECT                                                                  
*                   DSECT TO COVER THE TWA                                      
         SPACE 1                                                                
T606TWA  DSECT                                                                  
         DS    CL16                                                             
VIRGIN   DS    C         V         H=HITS,1=SOME DISPLAY,0=NO DISPLAY           
PHASE    DS    C         X         OVERLAY NUMBER                               
LASTKMK  DS    C         X         X'80'=MORE TO COME                           
*                                  X'40'=THERE'S A PREVIOUS SCREEN              
LASTKEY  DS    CL42      V         CONTINUATION KEY                             
SAVECO   DS    C         C         AGENCY CODE                                  
COUNT    DS    H         X         TABLE ENTRIES DISPLAYED SO FAR               
       ++INCLUDE ACINQFFD                                                       
         SPACE 2                                                                
LINE     DS    H         X         LINE NUMBER (INFDATA = 1)                    
SAVEOFFA DS    CL(OFFASAVL)        OFFAL SAVED DATA                             
         DS    CL8                 SPARE                                        
SAVEUNIT DS    CL36      C         UNIT NAME                                    
SAVELEDG DS    CL36      C         LEDGER NAME                                  
SAVEHIER DS    CL8       V         4 X HIERARCHY LNTH & DSCRIPTN 1ST CH         
SAVEACCN DS    CL36      C         ACCOUNT NAME                                 
SAVECACN DS    CL36      C         CONTRA-ACCOUNT NAME                          
         DS    CL64                SPARE                                        
PRODCO   DS    C         C         COMPANY CODE OF LAST CO. RECORD READ         
SPROUNIT DS    C         C         PRODUCTION UNIT CODE                         
SPROLEDG DS    C         C         PRODUCTION LEDGER CODE                       
SRECUNIT DS    C         C         RECEIVABLE UNIT CODE                         
SRECLEDG DS    C         C         RECEIVABLE LEDGER CODE                       
SAVEALFA DS    CL2       C         COMPANY ALPHA CODE                           
SAVEVATR DS    CL20      X         LIST OF VAT RULES (ACMPVATR)                 
SAVCSTA1 DS    XL1       B         COMPANY STATUS BYTE 1                        
SAVCSTA2 DS    XL1       B         COMPANY STATUS BYTE 2                        
SAVCSTA3 DS    XL1       B         COMPANY STATUS BYTE 3                        
SAVCSTA4 DS    XL1       B         COMPANY STATUS BYTE 4                        
         DS    XL8                 SPARE                                        
SAVLTOFF DS    C         V         SAVED ACLTOFF                                
SAVLDGT  DS    C         X         SAVED LEDGER CLOSE-OUT TYPE(LDGCLOS)         
         DS    XL6                 SPARE                                        
*                                                                               
*&&US                                                                           
CAFLDIND DS    C         X         CONTRA  FIELD INDICATOR - 0=NO INPUT         
FIFLDIND DS    C         X         OPTIONS FIELD INDICATOR -   LST TIME         
*&&                                                                             
*&&UK                                                                           
SCMPSTA2 DS    CL1       X         ACMPSTA2 - SEE ESTIMATE REC TYPE             
         DS    CL1                                                              
*&&                                                                             
SOFFICE  DS    CL6       C         COMPOSITE OFFICE CODES FOR LVL 1/2/3         
INVREG   DS    CL1                 2ND BYTE OF MASTER PROFILE                   
FRSTSW   DS    XL1                 X'00' FIRST TIME                             
         DS    CL83                SPARE                                        
TWANEXT  DS    0C                  AVAILABLE TO OVERLAYS                        
TWALEFT  EQU   T606TWA+5120-TWANEXT                                             
         EJECT                                                                  
