*          DATA SET ACINTE0D   AT LEVEL 004 AS OF 10/02/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T619E0D      DATE 10/02/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      6    2    5  A  P N             T        Y              
PRLSTRTH DS    CL8                                                              
PRLSTRT  DS    CL12     6    8   12  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL6      6   22    6  A  P N             T        Y              
PRLCLTH  DS    CL8                                                              
PRLCLT   DS    CL3      6   30    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      6   35    7  A  P N             T        Y              
PRLPRDH  DS    CL8                                                              
PRLPRD   DS    CL3      6   43    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      6   48    5  A  P N             T        Y              
PRLMEDH  DS    CL8                                                              
PRLMED   DS    CL5      6   55    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      6   62    8  A  P N             T        Y              
PRLESTH  DS    CL8                                                              
PRLEST   DS    CL6      6   72    6  A  U N             T        Y              
PRLTAGH  DS    CL8                                                              
PRLTAG   DS    CL1      7    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL69     8    7   69  A  P H             T        Y              
PRLSELH  DS    CL8                                                              
PRLSEL   DS    CL3      9    2    3  A  U N             T        Y              
PRLLINH  DS    CL8                                                              
PRLLIN   DS    CL73     9    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL73    10    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL73    11    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL73    12    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL73    13    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL73    14    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL73    15    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL73    16    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL73    17    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL73    18    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL73    19    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL73    20    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL73    21    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL73    22    7   73  A  P N             T        Y              
PRLPFH   DS    CL8                                                              
PRLPF    DS    CL78    24    2   78  A  P H             T        Y              
PRLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PRLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1616 BYTES                            
