*          DATA SET ACINTF3D   AT LEVEL 002 AS OF 01/21/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T619F3D      DATE 01/21/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL14     5    2   14  A  P N             T        Y              
ESTRCVH  DS    CL8                                                              
ESTRCV   DS    CL12     5   18   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   32    6  A  P N             T        Y              
ESTCLIH  DS    CL8                                                              
ESTCLI   DS    CL6      5   42    6  A  U N             T        Y    0         
ESTCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     5   51   11  A  P N             T        Y              
ESTPERH  DS    CL8                                                              
ESTPER   DS    CL13     5   64   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
ESTPROH  DS    CL8                                                              
ESTPRO   DS    CL6      6   18    6  A  U N             T        Y    0         
ESTPROX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7    2    5  A  P H             T        Y              
ESTMEDH  DS    CL8                                                              
ESTMED   DS    CL5      7   18    5  A  U N             T        Y    0         
ESTMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      7   32    8  A  P H             T        Y              
ESTESTH  DS    CL8                                                              
ESTEST   DS    CL6      7   42    6  A  U N             T        Y    0         
ESTESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     7   51   11  A  P N             T        Y              
ESTESTPH DS    CL8                                                              
ESTESTP  DS    CL13     7   64   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
ESTOPTH  DS    CL8                                                              
ESTOPT   DS    CL50     8   18   50  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL62     9    2   62  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      9   70    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    10    2   78  A  P N             T        Y              
ESTMON1H DS    CL8                                                              
ESTMON1  DS    CL65    11    2   65  A  P N             T        Y              
ESTOP1H  DS    CL8                                                              
ESTOP1   DS    CL11    11   68   11  A  U N             T        Y    0         
ESTOP1X  DS    CL8                                                              
ESTMON2H DS    CL8                                                              
ESTMON2  DS    CL65    12    2   65  A  P N             T        Y              
ESTOP2H  DS    CL8                                                              
ESTOP2   DS    CL11    12   68   11  A  U N             T        Y    0         
ESTOP2X  DS    CL8                                                              
ESTMON3H DS    CL8                                                              
ESTMON3  DS    CL65    13    2   65  A  P N             T        Y              
ESTOP3H  DS    CL8                                                              
ESTOP3   DS    CL11    13   68   11  A  U N             T        Y    0         
ESTOP3X  DS    CL8                                                              
ESTMON4H DS    CL8                                                              
ESTMON4  DS    CL65    14    2   65  A  P N             T        Y              
ESTOP4H  DS    CL8                                                              
ESTOP4   DS    CL11    14   68   11  A  U N             T        Y    0         
ESTOP4X  DS    CL8                                                              
ESTMON5H DS    CL8                                                              
ESTMON5  DS    CL65    15    2   65  A  P N             T        Y              
ESTOP5H  DS    CL8                                                              
ESTOP5   DS    CL11    15   68   11  A  U N             T        Y    0         
ESTOP5X  DS    CL8                                                              
ESTMON6H DS    CL8                                                              
ESTMON6  DS    CL65    16    2   65  A  P N             T        Y              
ESTOP6H  DS    CL8                                                              
ESTOP6   DS    CL11    16   68   11  A  U N             T        Y    0         
ESTOP6X  DS    CL8                                                              
ESTMON7H DS    CL8                                                              
ESTMON7  DS    CL65    17    2   65  A  P N             T        Y              
ESTOP7H  DS    CL8                                                              
ESTOP7   DS    CL11    17   68   11  A  U N             T        Y    0         
ESTOP7X  DS    CL8                                                              
ESTMON8H DS    CL8                                                              
ESTMON8  DS    CL65    18    2   65  A  P N             T        Y              
ESTOP8H  DS    CL8                                                              
ESTOP8   DS    CL11    18   68   11  A  U N             T        Y    0         
ESTOP8X  DS    CL8                                                              
ESTMON9H DS    CL8                                                              
ESTMON9  DS    CL65    19    2   65  A  P N             T        Y              
ESTOP9H  DS    CL8                                                              
ESTOP9   DS    CL11    19   68   11  A  U N             T        Y    0         
ESTOP9X  DS    CL8                                                              
ESTMONAH DS    CL8                                                              
ESTMONA  DS    CL65    20    2   65  A  P N             T        Y              
ESTOPAH  DS    CL8                                                              
ESTOPA   DS    CL11    20   68   11  A  U N             T        Y    0         
ESTOPAX  DS    CL8                                                              
ESTMONBH DS    CL8                                                              
ESTMONB  DS    CL65    21    2   65  A  P N             T        Y              
ESTOPBH  DS    CL8                                                              
ESTOPB   DS    CL11    21   68   11  A  U N             T        Y    0         
ESTOPBX  DS    CL8                                                              
ESTMONCH DS    CL8                                                              
ESTMONC  DS    CL65    22    2   65  A  P N             T        Y              
ESTOPCH  DS    CL8                                                              
ESTOPC   DS    CL11    22   68   11  A  U N             T        Y    0         
ESTOPCX  DS    CL8                                                              
ESTTOTH  DS    CL8                                                              
ESTTOT   DS    CL78    23    2   78  A  P H             T        Y              
ESTPFH   DS    CL8                                                              
ESTPF    DS    CL78    24    2   78  A  P H             T        Y              
ESTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
ESTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1896 BYTES                            
