*          DATA SET ACINVFED   AT LEVEL 002 AS OF 09/30/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T613FED      DATE 09/30/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      6    2    8   A    P    N         T         Y           
AUTSUPH  DS    CL8                                                              
AUTSUP   DS    CL14     6   14   14   A    U    N         T         Y           
AUTSUPNH DS    CL8                                                              
AUTSUPN  DS    CL36     6   36   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL33     8    2   33   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL12     8   38   12   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL14     8   51   14   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL14     9   18   14   A    P    N         T         Y           
AUTFRSTH DS    CL8                                                              
AUTFRST  DS    CL57    10    2   57   A    P    N         T         Y           
AUTFMKH  DS    CL8                                                              
AUTFMK   DS    CL1     10   62    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL57    11    2   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     11   62    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL57    12    2   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     12   62    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL57    13    2   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     13   62    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL57    14    2   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     14   62    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL57    15    2   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     15   62    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL57    16    2   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     16   62    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL57    17    2   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     17   62    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL57    18    2   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     18   62    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL57    19    2   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     19   62    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL57    20    2   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     20   62    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL57    21    2   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     21   62    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL57    22    2   57   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     22   62    1   A    U    N         T         Y           
AUTTABH  DS    CL8                                                              
AUTTAB   DS    CL1     23    2    1   A    U    N         T         Y           
AUTLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
AUTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1161 BYTES                            
