*          DATA SET ACINVFDD   AT LEVEL 002 AS OF 09/30/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T613FDD      DATE 09/30/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     6    2   11   A    P    N         T         Y           
HLDJOBH  DS    CL8                                                              
HLDJOB   DS    CL14     6   14   14   A    U    N         T         Y           
HLDJOBNH DS    CL8                                                              
HLDJOBN  DS    CL36     6   36   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL13     8    2   13   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL34     8   21   34   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL13     9   21   13   A    P    N         T         Y           
HLDFRSTH DS    CL8                                                              
HLDFRST  DS    CL46    10    2   46   A    P    N         T         Y           
HLDFMKH  DS    CL8                                                              
HLDFMK   DS    CL1     10   51    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL46    11    2   46   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     11   51    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL46    12    2   46   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     12   51    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL46    13    2   46   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     13   51    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL46    14    2   46   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     14   51    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL46    15    2   46   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     15   51    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL46    16    2   46   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     16   51    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL46    17    2   46   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     17   51    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL46    18    2   46   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     18   51    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL46    19    2   46   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     19   51    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL46    20    2   46   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     20   51    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL46    21    2   46   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     21   51    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL46    22    2   46   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     22   51    1   A    U    N         T         Y           
HLDTABH  DS    CL8                                                              
HLDTAB   DS    CL1     23    2    1   A    U    N         T         Y           
HLDLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
HLDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1000 BYTES                            
