*          DATA SET ACINFFFD   AT LEVEL 003 AS OF 01/23/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T605FFD      DATE 01/23/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
INFHEADH DS    CL8                                                              
INFHEAD  DS    CL60     1    2   60  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     3    2   11  A  P N             T        Y              
INFRECH  DS    CL8                                                              
INFREC   DS    CL5      3   15    5  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL3      3   21    3  A  P N             T        Y              
INFKEYH  DS    CL8                                                              
INFKEY   DS    CL16     3   26   16  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL7      3   45    7  A  P N             T        Y              
INFFILTH DS    CL8                                                              
INFFILT  DS    CL23     3   54   23  A  U N             T        Y              
INFTABH  DS    CL8                                                              
INFTAB   DS    CL1      3   79    1  A  U N             T        Y              
INFDATAH DS    CL8                                                              
INFDATA  DS    CL78     5    2   78  A  P N             T        Y              
INFDAT2H DS    CL8                                                              
INFDAT2  DS    CL78     6    2   78  A  P N             T        Y              
INFDAT3H DS    CL8                                                              
INFDAT3  DS    CL78     7    2   78  A  P N             T        Y              
INFDAT4H DS    CL8                                                              
INFDAT4  DS    CL78     8    2   78  A  P N             T        Y              
INFDAT5H DS    CL8                                                              
INFDAT5  DS    CL78     9    2   78  A  P N             T        Y              
INFDAT6H DS    CL8                                                              
INFDAT6  DS    CL78    10    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    11    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    12    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    13    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    14    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    15    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    16    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    17    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    19    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    20    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    21    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    22    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  A  P N             T        Y              
INFDATLH DS    CL8                                                              
INFDATL  DS    CL78    24    2   78  A  P N             T        Y              
INFLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
INFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1944 BYTES                            
