*          DATA SET ACINTF2D   AT LEVEL 004 AS OF 01/21/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T619F2D      DATE 01/21/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
HEDREPH  DS    CL8                                                              
HEDREP   DS    CL3      6   20    3  A  U N             T    I   Y    0         
HEDREPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     7    2   10  A  P H             T        Y              
HEDNAMEH DS    CL8                                                              
HEDNAME  DS    CL15     7   20   15  A  U N             T        Y    0         
HEDNAMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     7   37   10  A  P H             T        Y              
HEDREFH  DS    CL8                                                              
HEDREF   DS    CL4      7   49    4  A  U N             T        Y    0         
HEDREFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     7   57   11  A  P H             T        Y              
HEDMONH  DS    CL8                                                              
HEDMON   DS    CL6      7   70    6  A  U N             T        Y    0         
HEDMONX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      9    2    8  A  P H             T        Y              
HEDBANKH DS    CL8                                                              
HEDBANK  DS    CL12     9   20   12  A  U N             T        Y    0         
HEDBANKX DS    CL8                                                              
HEDBNKNH DS    CL8                                                              
HEDBNKN  DS    CL36     9   42   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    10    2   12  A  P H             T        Y              
HEDCKNH  DS    CL8                                                              
HEDCKN   DS    CL6     10   20    6  A  U N             T        Y    0         
HEDCKNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    11    2   12  A  P H             T        Y              
HEDDEPH  DS    CL8                                                              
HEDDEP   DS    CL8     11   20    8  A  U N             T        Y    0         
HEDDEPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    12    2   12  A  P H             T        Y              
HEDAMTH  DS    CL8                                                              
HEDAMT   DS    CL12    12   20   12  A  U N             T        Y    0         
HEDAMTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    13    2   10  A  P H             T        Y              
HEDCKDH  DS    CL8                                                              
HEDCKD   DS    CL8     13   20    8  A  U N             T        Y    0         
HEDCKDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    15    2   14  A  P H             T        Y              
HEDRCVH  DS    CL8                                                              
HEDRCV   DS    CL12    15   20   12  A  U N             T        Y    0         
HEDRCVX  DS    CL8                                                              
HEDRCVNH DS    CL8                                                              
HEDRCVN  DS    CL36    15   42   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     16    2    9  A  P H             T        Y              
HEDCLIH  DS    CL8                                                              
HEDCLI   DS    CL36    16   20   36  A  U N             T        Y    0         
HEDCLIX  DS    CL8                                                              
HEDCLINH DS    CL8                                                              
HEDCLIN  DS    CL21    16   58   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17    2   11  A  P H             T        Y              
HEDPERH  DS    CL8                                                              
HEDPER   DS    CL13    17   20   13  A  U N             T        Y    0         
HEDPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     19    2    7  A  P N             T        Y              
HEDPROH  DS    CL8                                                              
HEDPRO   DS    CL58    19   20   58  A  U N             T        Y    0         
HEDPROX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     20    2    5  A  P N             T        Y              
HEDMEDH  DS    CL8                                                              
HEDMED   DS    CL58    20   20   58  A  U N             T        Y    0         
HEDMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     21    2    8  A  P N             T        Y              
HEDESTH  DS    CL8                                                              
HEDEST   DS    CL58    21   20   58  A  U N             T        Y    0         
HEDESTX  DS    CL8                                                              
HEDTOT1H DS    CL8                                                              
HEDTOT1  DS    CL78    22    2   78  A  P N             T        Y              
HEDTOT2H DS    CL8                                                              
HEDTOT2  DS    CL78    23    2   78  A  P N             T        Y              
HEDPFH   DS    CL8                                                              
HEDPF    DS    CL78    24    2   78  A  P H             T        Y              
HEDLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
HEDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1192 BYTES                            
