*          DATA SET ACINCTABLE AT LEVEL 008 AS OF 04/10/90                      
INCTABLE DS    0F                                                               
*                                  TYPE 2 ONE INC=TAX ID                        
         DC    C'061046174',C'1'                                                
         DC    C'061153467',C'2'                                                
         DC    C'061171785',C'1'                                                
         DC    C'112138156',C'1'                                                
         DC    C'112294070',C'1'                                                
         DC    C'112587690',C'1'                                                
         DC    C'112599476',C'1'                                                
         DC    C'112607751',C'1'                                                
         DC    C'112668838',C'1'                                                
         DC    C'112746882',C'1'                                                
         DC    C'131825054',C'1'                                                
         DC    C'131924236',C'1'                                                
         DC    C'132503845',C'1'                                                
         DC    C'132511740',C'1'                                                
         DC    C'132540008',C'1'                                                
         DC    C'132609832',C'1'                                                
         DC    C'132622040',C'1'                                                
         DC    C'132641832',C'1'                                                
         DC    C'132776280',C'1'                                                
         DC    C'132886095',C'1'                                                
         DC    C'132900999',C'1'                                                
         DC    C'132904692',C'1'                                                
         DC    C'132906255',C'1'                                                
         DC    C'132910186',C'1'                                                
         DC    C'132923900',C'1'                                                
         DC    C'132955037',C'1'                                                
         DC    C'132981153',C'1'                                                
         DC    C'132996922',C'1'                                                
         DC    C'133009562',C'1'                                                
         DC    C'133015295',C'1'                                                
         DC    C'133025417',C'1'                                                
         DC    C'133026306',C'1'                                                
         DC    C'133043952',C'1'                                                
         DC    C'133049333',C'1'                                                
         DC    C'133056868',C'1'                                                
         DC    C'133065879',C'1'                                                
         DC    C'133066050',C'1'                                                
         DC    C'133085805',C'1'                                                
         DC    C'133104222',C'1'                                                
         DC    C'133106016',C'1'                                                
         DC    C'133137348',C'1'                                                
         DC    C'133144860',C'1'                                                
         DC    C'133186088',C'1'                                                
         DC    C'133188719',C'1'                                                
         DC    C'133189079',C'1'                                                
         DC    C'133203437',C'1'                                                
         DC    C'133219418',C'1'                                                
         DC    C'133240405',C'1'                                                
         DC    C'133252189',C'1'                                                
         DC    C'133254215',C'1'                                                
         DC    C'133277315',C'1'                                                
         DC    C'133284018',C'1'                                                
         DC    C'133313081',C'1'                                                
         DC    C'133347314',C'1'                                                
         DC    C'133350334',C'1'                                                
         DC    C'133356500',C'1'                                                
         DC    C'133421076',C'1'                                                
         DC    C'133429553',C'2'                                                
         DC    C'133435338',C'1'                                                
         DC    C'133471355',C'1'                                                
         DC    C'133480377',C'2'                                                
         DC    C'133499579',C'2'                                                
         DC    C'133543165',C'1'                                                
         DC    C'222016297',C'1'                                                
         DC    C'222179424',C'1'                                                
         DC    C'222302724',C'1'                                                
         DC    C'222325477',C'1'                                                
         DC    C'222439096',C'1'                                                
         DC    C'222633501',C'1'                                                
         DC    C'222692377',C'1'                                                
         DC    C'232030044',C'1'                                                
         DC    C'232125089',C'1'                                                
         DC    C'232231927',C'1'                                                
         DC    C'362595606',C'1'                                                
         DC    C'362745122',C'2'                                                
         DC    C'362751429',C'1'                                                
         DC    C'362769128',C'1'                                                
         DC    C'362771938',C'1'                                                
         DC    C'362775834',C'1'                                                
         DC    C'362864541',C'1'                                                
         DC    C'362882095',C'1'                                                
         DC    C'362964102',C'1'                                                
         DC    C'363122407',C'1'                                                
         DC    C'363153513',C'1'                                                
         DC    C'363229122',C'1'                                                
         DC    C'363249624',C'1'                                                
         DC    C'363298481',C'1'                                                
         DC    C'363306159',C'1'                                                
         DC    C'363316814',C'1'                                                
         DC    C'363358073',C'1'                                                
         DC    C'363380702',C'1'                                                
         DC    C'363428546',C'1'                                                
         DC    C'363435099',C'1'                                                
         DC    C'363557508',C'1'                                                
         DC    C'382334621',C'1'                                                
         DC    C'411309712',C'1'                                                
         DC    C'411369771',C'1'                                                
         DC    C'411479965',C'1'                                                
         DC    C'431340896',C'1'                                                
         DC    C'431347280',C'1'                                                
         DC    C'521306977',C'1'                                                
         DC    C'521492783',C'1'                                                
         DC    C'592556080',C'1'                                                
         DC    C'592587291',C'1'                                                
         DC    C'621019403',C'1'                                                
         DC    C'621201088',C'1'                                                
         DC    C'621229977',C'1'                                                
         DC    C'650156265',C'1'                                                
         DC    C'720818041',C'1'                                                
         DC    C'942389960',C'1'                                                
         DC    C'942845893',C'1'                                                
         DC    C'943011070',C'1'                                                
         DC    C'943055320',C'1'                                                
         DC    C'952292763',C'1'                                                
         DC    C'952885046',C'1'                                                
         DC    C'952888126',C'1'                                                
         DC    C'952963300',C'1'                                                
         DC    C'952970743',C'1'                                                
         DC    C'953177398',C'1'                                                
         DC    C'953253785',C'1'                                                
         DC    C'953397942',C'1'                                                
         DC    C'953399066',C'1'                                                
         DC    C'953433219',C'1'                                                
         DC    C'953462320',C'1'                                                
         DC    C'953471401',C'1'                                                
         DC    C'953475203',C'1'                                                
         DC    C'953515299',C'1'                                                
         DC    C'953543349',C'1'                                                
         DC    C'953550101',C'1'                                                
         DC    C'953565460',C'1'                                                
         DC    C'953587077',C'2'                                                
         DC    C'953609960',C'1'                                                
         DC    C'953615926',C'1'                                                
         DC    C'953627730',C'1'                                                
         DC    C'953700913',C'1'                                                
         DC    C'953716299',C'1'                                                
         DC    C'953731404',C'1'                                                
         DC    C'953746311',C'1'                                                
         DC    C'953815790',C'1'                                                
         DC    C'953876679',C'1'                                                
         DC    C'953886006',C'1'                                                
         DC    C'953894146',C'1'                                                
         DC    C'953895946',C'1'                                                
         DC    C'953896730',C'1'                                                
         DC    C'953902506',C'1'                                                
         DC    C'953916000',C'1'                                                
         DC    C'953919338',C'1'                                                
         DC    C'953949427',C'1'                                                
         DC    C'953966163',C'1'                                                
         DC    C'953992773',C'1'                                                
         DC    C'954063483',C'1'                                                
         DC    C'954081710',C'1'                                                
         DC    X'FF'                                                            
         SPACE 1                                                                
INCREVS  DS    0F                  REVERSE TABLE                                
         DC    C'082341928'  1     1=SS NUMBER                                  
         DC    C'132999605'  2     2=TAX ID NUMBER                              
         DC    C'180402450'  1                                                  
         DC    C'133026057'  2                                                  
         DC    C'155720789'  1                                                  
         DC    C'222475775'  2                                                  
         DC    C'257807954'  1                                                  
         DC    C'581783834'  2                                                  
         DC    C'550648061'  1                                                  
         DC    C'954016453'  2                                                  
         DC    X'FF'                                                            
