*          DATA SET ACINTF4D   AT LEVEL 006 AS OF 10/24/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T619F4D      DATE 10/24/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL18     5    2   18  A  P H             T        Y              
ADJRCVH  DS    CL8                                                              
ADJRCV   DS    CL12     5   25   12  A  U N             T        Y              
ADJRCVNH DS    CL8                                                              
ADJRCVN  DS    CL36     5   42   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
ADJCLTH  DS    CL8                                                              
ADJCLT   DS    CL3      6   25    3  A  U N             T        Y              
ADJCLTNH DS    CL8                                                              
ADJCLTN  DS    CL36     6   42   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
ADJPRDH  DS    CL8                                                              
ADJPRD   DS    CL3      7   25    3  A  U N             T        Y              
ADJPRDNH DS    CL8                                                              
ADJPRDN  DS    CL36     7   42   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      8    2    5  A  P H             T        Y              
ADJMEDH  DS    CL8                                                              
ADJMED   DS    CL5      8   12    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15     8   25   15  A  P H             T        Y              
ADJESTH  DS    CL8                                                              
ADJEST   DS    CL6      8   42    6  A  U N             T        Y              
ADJTAGH  DS    CL8                                                              
ADJTAG   DS    CL1      8   49    1  A  P N             T        Y              
ADJPERTH DS    CL8                                                              
ADJPERT  DS    CL11     8   51   11  A  P H             T        Y              
ADJPERH  DS    CL8                                                              
ADJPER   DS    CL15     8   63   15  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL3     10    4    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL3     10   11    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     10   23    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL3     10   33    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL4     10   40    4  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL10    10   47   10  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6     10   62    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL4     10   73    4  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6     11    2    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6     11   10    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     11   22    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     11   32    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     11   39    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     11   48    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6     11   62    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6     11   72    6  A  P H             T        Y              
ADJMONH  DS    CL8                                                              
ADJMON   DS    CL6     12    2    6  A  P N             T        Y              
ADJPSTH  DS    CL8                                                              
ADJPST   DS    CL8     12   10    8  A  U N             T        Y              
ADJGRSH  DS    CL8                                                              
ADJGRS   DS    CL11    12   19   11  A  U N             T        Y              
ADJAPCH  DS    CL8                                                              
ADJAPC   DS    CL5     12   32    5  A  U N             T        Y              
ADJRPCH  DS    CL8                                                              
ADJRPC   DS    CL5     12   39    5  A  U N             T        Y              
ADJRECH  DS    CL8                                                              
ADJREC   DS    CL10    12   46   10  A  U N             T        Y              
ADJPOSH  DS    CL8                                                              
ADJPOS   DS    CL10    12   58   10  A  P N             T        Y              
ADJPREH  DS    CL8                                                              
ADJPRE   DS    CL10    12   70   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   19   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   32    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   39    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    13   46   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    13   58   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    13   70   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   19   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   32    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   39    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    14   46   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    14   58   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    14   70   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   19   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   32    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   39    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   46   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   58   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    15   70   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   19   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   32    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   39    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    16   46   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    16   58   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    16   70   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   19   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   32    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   39    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    17   46   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    17   58   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    17   70   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   19   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   32    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   39    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    18   46   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    18   58   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    18   70   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   19   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   32    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   39    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    19   46   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    19   58   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    19   70   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   19   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   32    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   39    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    20   46   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    20   58   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    20   70   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   19   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   32    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   39    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   46   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   58   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    21   70   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     22    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   19   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   32    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   39    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    22   46   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    22   58   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    22   70   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     23    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     23   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    23   19   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   32    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   39    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    23   46   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    23   58   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    23   70   10  A  P N             T        Y              
ADJLLINH DS    CL8                                                              
ADJLLIN  DS    CL6     24    2    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     24   10    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL11    24   19   11  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     24   32    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     24   39    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL10    24   46   10  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL10    24   58   10  A  P H             T        Y              
ADJENDH  DS    CL8                                                              
ADJEND   DS    CL10    24   70   10  A  P H             T        Y              
ADJLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
ADJWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2240 BYTES                            
