*          DATA SET ACINVFCD   AT LEVEL 009 AS OF 10/15/85                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T613FCD      DATE 10/15/85                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL13     6    2   13   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL13     6   25   13   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL13     7    2   13   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL13     7   25   13   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL4      9    2    4   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL13     9   25   13   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     10    2    6   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL16    10   25   16   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL30    11   25   30   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL30    12   25   30   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL41    13   25   41   A    P    N         T         Y           
HLPLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
HLPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 283  BYTES                            
