*          DATA SET ACINTF5D   AT LEVEL 002 AS OF 07/07/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T619F5D      DATE 07/07/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      6    2    8  A  P N             T        Y              
LISRCVH  DS    CL8                                                              
LISRCV   DS    CL12     6   12   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9      6   25    9  A  P N             T        Y              
LISCLIH  DS    CL8                                                              
LISCLI   DS    CL20     6   35   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      6   56    6  A  P N             T        Y              
LISPERH  DS    CL8                                                              
LISPER   DS    CL13     6   63   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
LISPROH  DS    CL8                                                              
LISPRO   DS    CL58     7   12   58  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      8    2    6  A  P N             T        Y              
LISMEDH  DS    CL8                                                              
LISMED   DS    CL58     8   12   58  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      9    2    8  A  P N             T        Y              
LISESTH  DS    CL8                                                              
LISEST   DS    CL58     9   12   58  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10    2    6  A  P N             T        Y              
LISSCRH  DS    CL8                                                              
LISSCR   DS    CL4     10   12    4  A  U N             T        Y    0         
LISSCRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     10   17    7  A  P N             T        Y              
LISOPTH  DS    CL8                                                              
LISOPT   DS    CL50    10   26   50  A  U N             T        Y    0         
LISOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     10   78    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     11    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL41    11    4   41  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    11   51   23  A  P N             T        Y              
LISSEL1H DS    CL8                                                              
LISSEL1  DS    CL1     12    2    1  A  U N             T        Y    0         
LISSEL1X DS    CL8                                                              
LISEST1H DS    CL8                                                              
LISEST1  DS    CL64    12    4   64  A  P N             T        Y              
LISOPE1H DS    CL8                                                              
LISOPE1  DS    CL11    12   69   11  A  U H             T        Y    0         
LISOPE1X DS    CL8                                                              
LISSEL2H DS    CL8                                                              
LISSEL2  DS    CL1     13    2    1  A  U N             T        Y    0         
LISSEL2X DS    CL8                                                              
LISEST2H DS    CL8                                                              
LISEST2  DS    CL64    13    4   64  A  P N             T        Y              
LISOPE2H DS    CL8                                                              
LISOPE2  DS    CL11    13   69   11  A  U H             T        Y    0         
LISOPE2X DS    CL8                                                              
LISSEL3H DS    CL8                                                              
LISSEL3  DS    CL1     14    2    1  A  U N             T        Y    0         
LISSEL3X DS    CL8                                                              
LISEST3H DS    CL8                                                              
LISEST3  DS    CL64    14    4   64  A  P N             T        Y              
LISOPE3H DS    CL8                                                              
LISOPE3  DS    CL11    14   69   11  A  U H             T        Y    0         
LISOPE3X DS    CL8                                                              
LISSEL4H DS    CL8                                                              
LISSEL4  DS    CL1     15    2    1  A  U N             T        Y    0         
LISSEL4X DS    CL8                                                              
LISEST4H DS    CL8                                                              
LISEST4  DS    CL64    15    4   64  A  P N             T        Y              
LISOPE4H DS    CL8                                                              
LISOPE4  DS    CL11    15   69   11  A  U H             T        Y    0         
LISOPE4X DS    CL8                                                              
LISSEL5H DS    CL8                                                              
LISSEL5  DS    CL1     16    2    1  A  U N             T        Y    0         
LISSEL5X DS    CL8                                                              
LISEST5H DS    CL8                                                              
LISEST5  DS    CL64    16    4   64  A  P N             T        Y              
LISOPE5H DS    CL8                                                              
LISOPE5  DS    CL11    16   69   11  A  U H             T        Y    0         
LISOPE5X DS    CL8                                                              
LISSEL6H DS    CL8                                                              
LISSEL6  DS    CL1     17    2    1  A  U N             T        Y    0         
LISSEL6X DS    CL8                                                              
LISEST6H DS    CL8                                                              
LISEST6  DS    CL64    17    4   64  A  P N             T        Y              
LISOPE6H DS    CL8                                                              
LISOPE6  DS    CL11    17   69   11  A  U H             T        Y    0         
LISOPE6X DS    CL8                                                              
LISSEL7H DS    CL8                                                              
LISSEL7  DS    CL1     18    2    1  A  U N             T        Y    0         
LISSEL7X DS    CL8                                                              
LISEST7H DS    CL8                                                              
LISEST7  DS    CL64    18    4   64  A  P N             T        Y              
LISOPE7H DS    CL8                                                              
LISOPE7  DS    CL11    18   69   11  A  U H             T        Y    0         
LISOPE7X DS    CL8                                                              
LISSEL8H DS    CL8                                                              
LISSEL8  DS    CL1     19    2    1  A  U N             T        Y    0         
LISSEL8X DS    CL8                                                              
LISEST8H DS    CL8                                                              
LISEST8  DS    CL64    19    4   64  A  P N             T        Y              
LISOPE8H DS    CL8                                                              
LISOPE8  DS    CL11    19   69   11  A  U H             T        Y    0         
LISOPE8X DS    CL8                                                              
LISSEL9H DS    CL8                                                              
LISSEL9  DS    CL1     20    2    1  A  U N             T        Y    0         
LISSEL9X DS    CL8                                                              
LISEST9H DS    CL8                                                              
LISEST9  DS    CL64    20    4   64  A  P N             T        Y              
LISOPE9H DS    CL8                                                              
LISOPE9  DS    CL11    20   69   11  A  U H             T        Y    0         
LISOPE9X DS    CL8                                                              
LISSELAH DS    CL8                                                              
LISSELA  DS    CL1     21    2    1  A  U N             T        Y    0         
LISSELAX DS    CL8                                                              
LISESTAH DS    CL8                                                              
LISESTA  DS    CL64    21    4   64  A  P N             T        Y              
LISOPEAH DS    CL8                                                              
LISOPEA  DS    CL11    21   69   11  A  U H             T        Y    0         
LISOPEAX DS    CL8                                                              
LISTOTH  DS    CL8                                                              
LISTOT   DS    CL78    22    2   78  A  P H             T        Y              
LISPF1H  DS    CL8                                                              
LISPF1   DS    CL78    23    2   78  A  P H             T        Y              
LISPF2H  DS    CL8                                                              
LISPF2   DS    CL78    24    2   78  A  P H             T        Y              
LISLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LISWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2000 BYTES                            
