*          DATA SET ACINTF0D   AT LEVEL 004 AS OF 10/02/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T619F0D      DATE 10/02/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL18     6    2   18  A  P H             T        Y              
PRORCVH  DS    CL8                                                              
PRORCV   DS    CL12     6   25   12  A  U N             T        Y              
PRORCVNH DS    CL8                                                              
PRORCVN  DS    CL36     6   42   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
PROCLTH  DS    CL8                                                              
PROCLT   DS    CL3      7   25    3  A  U N             T        Y              
PROCLTNH DS    CL8                                                              
PROCLTN  DS    CL36     7   42   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P H             T        Y              
PROPRDH  DS    CL8                                                              
PROPRD   DS    CL3      8   25    3  A  U N             T        Y              
PROPRDNH DS    CL8                                                              
PROPRDN  DS    CL36     8   42   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      9    2    5  A  P H             T        Y              
PROMEDH  DS    CL8                                                              
PROMED   DS    CL5      9   25    5  A  U N             T        Y              
PROMEDNH DS    CL8                                                              
PROMEDN  DS    CL36     9   42   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    10    2   15  A  P H             T        Y              
PROESTH  DS    CL8                                                              
PROEST   DS    CL6     10   25    6  A  U N             T        Y              
PROTAGH  DS    CL8                                                              
PROTAG   DS    CL1     10   32    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    12    2   20  A  P H             T        Y              
PROESTNH DS    CL8                                                              
PROESTN  DS    CL36    12   25   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    13    2   15  A  P H             T        Y              
PROPERH  DS    CL8                                                              
PROPER   DS    CL15    13   25   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    13   42   15  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL14    15    2   14  A  P H             T        Y              
PRONETH  DS    CL8                                                              
PRONET   DS    CL7     15   25    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   33    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL14    16    2   14  A  P H             T        Y              
PROFEEH  DS    CL8                                                              
PROFEE   DS    CL7     16   25    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   33    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL17    17    2   17  A  P H             T        Y              
PRORECH  DS    CL8                                                              
PROREC   DS    CL7     17   25    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   33    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL9     18   25    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    19    2   11  A  P H             T        Y              
PROTOTH  DS    CL8                                                              
PROTOT   DS    CL7     19   25    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   33    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  P N             T        Y              
PROPIDH  DS    CL8                                                              
PROPID   DS    CL10    22    5   10  A  P N             T        Y              
PROPROH  DS    CL8                                                              
PROPRO   DS    CL5     23    2    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P H             T        Y              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 824  BYTES                            
