*          DATA SET ACINTF1D   AT LEVEL 003 AS OF 07/02/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T619F1D      DATE 07/02/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL18     5    2   18  A  P H             T        Y              
ETMRCVH  DS    CL8                                                              
ETMRCV   DS    CL12     5   25   12  A  U N             T        Y              
ETMRCVNH DS    CL8                                                              
ETMRCVN  DS    CL36     5   42   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
ETMCLTH  DS    CL8                                                              
ETMCLT   DS    CL3      6   25    3  A  U N             T        Y              
ETMCLTNH DS    CL8                                                              
ETMCLTN  DS    CL36     6   42   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P H             T        Y              
ETMPRDH  DS    CL8                                                              
ETMPRD   DS    CL3      7   25    3  A  U N             T        Y              
ETMPRDNH DS    CL8                                                              
ETMPRDN  DS    CL36     7   42   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      8    2    5  A  P H             T        Y              
ETMMEDH  DS    CL8                                                              
ETMMED   DS    CL5      8   12    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15     8   25   15  A  P H             T        Y              
ETMESTH  DS    CL8                                                              
ETMEST   DS    CL6      8   42    6  A  U N             T        Y              
ETMTAGH  DS    CL8                                                              
ETMTAG   DS    CL1      8   49    1  A  P N             T        Y              
ETMPERTH DS    CL8                                                              
ETMPERT  DS    CL11     8   51   11  A  P H             T        Y              
ETMPERH  DS    CL8                                                              
ETMPER   DS    CL15     8   63   15  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL3     10    4    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7     10   11    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     10   23    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL3     10   33    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL4     10   40    4  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL10    10   48   10  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6     10   63    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL4     10   74    4  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6     11    2    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     11   10    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     11   22    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     11   32    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     11   39    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     11   49    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6     11   63    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6     11   73    6  A  P H             T        Y              
ETMMONH  DS    CL8                                                              
ETMMON   DS    CL6     12    2    6  A  P N             T        Y              
ETMPSTH  DS    CL8                                                              
ETMPST   DS    CL8     12   10    8  A  U N             T        Y              
ETMGRSH  DS    CL8                                                              
ETMGRS   DS    CL11    12   20   11  A  U N             T        Y              
ETMAPCH  DS    CL8                                                              
ETMAPC   DS    CL5     12   32    5  A  U N             T        Y              
ETMRPCH  DS    CL8                                                              
ETMRPC   DS    CL5     12   39    5  A  U N             T        Y              
ETMRECH  DS    CL8                                                              
ETMREC   DS    CL11    12   46   11  A  U N             T        Y              
ETMPOSH  DS    CL8                                                              
ETMPOS   DS    CL11    12   58   11  A  P N             T        Y              
ETMPREH  DS    CL8                                                              
ETMPRE   DS    CL11    12   70   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   20   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   32    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   39    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   46   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   58   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   70   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   20   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   32    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   39    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   46   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   58   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   70   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   20   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   32    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   39    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   46   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   58   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   70   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   20   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   32    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   39    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   46   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   58   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   70   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   20   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   32    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   39    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   46   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   58   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   70   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   20   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   32    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   39    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   46   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   58   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   70   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   20   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   32    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   39    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   46   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   58   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   70   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   20   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   32    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   39    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   46   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   58   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   70   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   20   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   32    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   39    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   46   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   58   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   70   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     22    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   20   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   32    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   39    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   46   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   58   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   70   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     23    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     23   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    23   20   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   32    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   39    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    23   46   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    23   58   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    23   70   11  A  P N             T        Y              
ETMLLINH DS    CL8                                                              
ETMLLIN  DS    CL6     24    2    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8     24   10    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL11    24   20   11  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     24   32    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5     24   39    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL11    24   46   11  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL11    24   58   11  A  P H             T        Y              
ETMENDH  DS    CL8                                                              
ETMEND   DS    CL11    24   70   11  A  P H             T        Y              
ETMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
ETMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2288 BYTES                            
