*          DATA SET ACISOCTRYD AT LEVEL 003 AS OF 02/02/01                      
* DSECT TO COVER ISO COUNTRY CODES (SEE BOOK ACISOCTRY)                         
                                                                                
ISOCTRYD DSECT                                                                  
ISOCODE1 DS    CL2                 ISO COUNTRY CODE (2 CHARACTERS)              
ISOCODE2 DS    CL3                 ISO COUNTRY CODE (3 CHARACTERS)              
ISOCTRY  DS    CL24                ISO COUNTRY NAME                             
ISOCTRYL EQU   *-ISOCTRYD                                                       
