*          DATA SET ACISOCTRY  AT LEVEL 059 AS OF 02/02/01                      
*                                                                               
ISOCTAB  DS    0D                                                               
         DC    CL2'AF',CL3'AFG',CL24'AFGHANISTAN             '   004            
ISOCTLN  EQU   *-ISOCTAB                                                        
         DC    CL2'AL',CL3'ALB',CL24'ALBANIA                 '   008            
         DC    CL2'DZ',CL3'DZA',CL24'ALGERIA                 '   012            
         DC    CL2'AS',CL3'ASM',CL24'AMERICAN SAMOA          '   016            
         DC    CL2'AD',CL3'AND',CL24'ANDORRA                 '   020            
         DC    CL2'AO',CL3'AGO',CL24'ANGOLA                  '   024            
         DC    CL2'AI',CL3'AIA',CL24'ANGUILLA                '   660            
         DC    CL2'AQ',CL3'ATA',CL24'ANTARCTICA              '   010            
         DC    CL2'AG',CL3'ATG',CL24'ANTIGUA AND BARBUDA     '   028            
         DC    CL2'AR',CL3'ARG',CL24'ARGENTINA               '   032            
         DC    CL2'AM',CL3'ARM',CL24'ARMENIA                 '   051            
         DC    CL2'AW',CL3'ABW',CL24'ARUBA                   '   533            
         DC    CL2'AU',CL3'AUS',CL24'AUSTRALIA               '   036            
         DC    CL2'AT',CL3'AUT',CL24'AUSTRIA                 '   040            
         DC    CL2'AZ',CL3'AZE',CL24'AZERBAIJAN              '   031            
         DC    CL2'BS',CL3'BHS',CL24'BAHAMAS                 '   044            
         DC    CL2'BH',CL3'BHR',CL24'BAHRAIN                 '   048            
         DC    CL2'BD',CL3'BGD',CL24'BANGLADESH              '   050            
         DC    CL2'BB',CL3'BRB',CL24'BARBADOS                '   052            
         DC    CL2'BY',CL3'BLR',CL24'BELARUS                 '   112            
         DC    CL2'BE',CL3'BEL',CL24'BELGIUM                 '   056            
         DC    CL2'BZ',CL3'BLZ',CL24'BELIZE                  '   084            
         DC    CL2'BJ',CL3'BEN',CL24'BENIN                   '   204            
         DC    CL2'BM',CL3'BMU',CL24'BERMUDA                 '   060            
         DC    CL2'BT',CL3'BTN',CL24'BHUTAN                  '   064            
         DC    CL2'BO',CL3'BOL',CL24'BOLIVIA                 '   068            
         DC    CL2'BA',CL3'BIH',CL24'BOSNIA AND HERZEGOWINA  '   070            
         DC    CL2'BW',CL3'BWA',CL24'BOTSWANA                '   072            
         DC    CL2'BV',CL3'BVT',CL24'BOUVET ISLAND           '   074            
         DC    CL2'BR',CL3'BRA',CL24'BRAZIL                  '   076            
         DC    CL2'IO',CL3'IOT',CL24'BRITISH INDIAN OCEAN    '   086            
         DC    CL2'BN',CL3'BRN',CL24'BRUNEI DARUSSALAM       '   096            
         DC    CL2'BG',CL3'BGR',CL24'BULGARIA                '   100            
         DC    CL2'BF',CL3'BFA',CL24'BURKINA FASO            '   854            
         DC    CL2'BI',CL3'BDI',CL24'BURUNDI                 '   108            
         DC    CL2'KH',CL3'KHM',CL24'CAMBODIA                '   116            
         DC    CL2'CM',CL3'CMR',CL24'CAMEROON                '   120            
         DC    CL2'CA',CL3'CAN',CL24'CANADA                  '   124            
         DC    CL2'CV',CL3'CPV',CL24'CAPE VERDE              '   132            
         DC    CL2'KY',CL3'CYM',CL24'CAYMAN ISLANDS          '   136            
         DC    CL2'CF',CL3'CAF',CL24'CENTRAL AFRICAN         '   140            
         DC    CL2'TD',CL3'TCD',CL24'CHAD                    '   148            
         DC    CL2'CL',CL3'CHL',CL24'CHILE                   '   152            
         DC    CL2'CN',CL3'CHN',CL24'CHINA                   '   156            
         DC    CL2'CX',CL3'CXR',CL24'CHRISTMAS ISLAND        '   162            
         DC    CL2'CC',CL3'CCK',CL24'COCOS                   '   166            
         DC    CL2'CO',CL3'COL',CL24'COLOMBIA                '   170            
         DC    CL2'KM',CL3'COM',CL24'COMOROS                 '   174            
         DC    CL2'CG',CL3'COG',CL24'CONGO                   '   178            
         DC    CL2'CK',CL3'COK',CL24'COOK ISLANDS            '   184            
         DC    CL2'CR',CL3'CRI',CL24'COSTA RICA              '   188            
         DC    CL2'CI',CL3'CIV',CL24'COTE D IVOIRE           '   384            
         DC    CL2'HR',CL3'HRV',CL24'CROATIA                 '   191            
         DC    CL2'CU',CL3'CUB',CL24'CUBA                    '   192            
         DC    CL2'CY',CL3'CYP',CL24'CYPRUS                  '   196            
         DC    CL2'CZ',CL3'CZE',CL24'CZECH REPUBLIC          '   203            
         DC    CL2'DK',CL3'DNK',CL24'DENMARK                 '   208            
         DC    CL2'DJ',CL3'DJI',CL24'DJIBOUTI                '   262            
         DC    CL2'DM',CL3'DMA',CL24'DOMINICA                '   212            
         DC    CL2'DO',CL3'DOM',CL24'DOMINICAN REPUBLIC      '   214            
         DC    CL2'TP',CL3'TMP',CL24'EAST TIMOR              '   626            
         DC    CL2'EC',CL3'ECU',CL24'ECUADOR                 '   218            
         DC    CL2'EG',CL3'EGY',CL24'EGYPT                   '   818            
         DC    CL2'SV',CL3'SLV',CL24'EL SALVADOR             '   222            
         DC    CL2'GQ',CL3'GNQ',CL24'EQUATORIAL GUINEA       '   226            
         DC    CL2'ER',CL3'ERI',CL24'ERITREA                 '   232            
         DC    CL2'EE',CL3'EST',CL24'ESTONIA                 '   233            
         DC    CL2'ET',CL3'ETH',CL24'ETHIOPIA                '   231            
         DC    CL2'FK',CL3'FLK',CL24'FALKLAND ISLANDS        '   238            
         DC    CL2'FO',CL3'FRO',CL24'FAROE ISLANDS           '   234            
         DC    CL2'FJ',CL3'FJI',CL24'FIJI                    '   242            
         DC    CL2'FI',CL3'FIN',CL24'FINLAND                 '   246            
         DC    CL2'FR',CL3'FRA',CL24'FRANCE                  '   250            
         DC    CL2'FX',CL3'FXX',CL24'FRANCE METROPOLITAN     '   249            
         DC    CL2'GF',CL3'GUF',CL24'FRENCH GUIANA           '   254            
         DC    CL2'PF',CL3'PYF',CL24'FRENCH POLYNESIA        '   258            
         DC    CL2'TF',CL3'ATF',CL24'FRENCH SOUTHERN TERRITOR'   260            
         DC    CL2'GA',CL3'GAB',CL24'GABON                   '   266            
         DC    CL2'GM',CL3'GMB',CL24'GAMBIA                  '   270            
         DC    CL2'GE',CL3'GEO',CL24'GEORGIA                 '   268            
         DC    CL2'DE',CL3'DEU',CL24'GERMANY                 '   276            
         DC    CL2'GH',CL3'GHA',CL24'GHANA                   '   288            
         DC    CL2'GI',CL3'GIB',CL24'GIBRALTAR               '   292            
         DC    CL2'GR',CL3'GRC',CL24'GREECE                  '   300            
         DC    CL2'GL',CL3'GRL',CL24'GREENLAND               '   304            
         DC    CL2'GD',CL3'GRD',CL24'GRENADA                 '   308            
         DC    CL2'GP',CL3'GLP',CL24'GUADELOUPE              '   312            
         DC    CL2'GU',CL3'GUM',CL24'GUAM                    '   316            
         DC    CL2'GT',CL3'GTM',CL24'GUATEMALA               '   320            
         DC    CL2'GN',CL3'GIN',CL24'GUINEA                  '   324            
         DC    CL2'GW',CL3'GNB',CL24'GUINEA-BISSAU           '   624            
         DC    CL2'GY',CL3'GUY',CL24'GUYANA                  '   328            
         DC    CL2'HT',CL3'HTI',CL24'HAITI                   '   332            
         DC    CL2'HM',CL3'HMD',CL24'HEARD AND MC DONALD     '   334            
         DC    CL2'HN',CL3'HND',CL24'HONDURAS                '   340            
         DC    CL2'HK',CL3'HKG',CL24'HONG KONG               '   344            
         DC    CL2'HU',CL3'HUN',CL24'HUNGARY                 '   348            
         DC    CL2'IS',CL3'ISL',CL24'ICELAND                 '   352            
         DC    CL2'IN',CL3'IND',CL24'INDIA                   '   356            
         DC    CL2'ID',CL3'IDN',CL24'INDONESIA               '   360            
         DC    CL2'IR',CL3'IRN',CL24'IRAN                    '   364            
         DC    CL2'IQ',CL3'IRQ',CL24'IRAQ                    '   368            
         DC    CL2'IE',CL3'IRL',CL24'IRELAND                 '   372            
         DC    CL2'IL',CL3'ISR',CL24'ISRAEL                  '   376            
         DC    CL2'IT',CL3'ITA',CL24'ITALY                   '   380            
         DC    CL2'JM',CL3'JAM',CL24'JAMAICA                 '   388            
         DC    CL2'JP',CL3'JPN',CL24'JAPAN                   '   392            
         DC    CL2'JO',CL3'JOR',CL24'JORDAN                  '   400            
         DC    CL2'KZ',CL3'KAZ',CL24'KAZAKHSTAN              '   398            
         DC    CL2'KE',CL3'KEN',CL24'KENYA                   '   404            
         DC    CL2'KI',CL3'KIR',CL24'KIRIBATI                '   296            
         DC    CL2'KP',CL3'PRK',CL24'NORTH KOREA             '   408            
         DC    CL2'KR',CL3'KOR',CL24'SOUTH KOREA             '   410            
         DC    CL2'KW',CL3'KWT',CL24'KUWAIT                  '   414            
         DC    CL2'KG',CL3'KGZ',CL24'KYRGYZSTAN              '   417            
         DC    CL2'LA',CL3'LAO',CL24'LAO                     '   418            
         DC    CL2'LV',CL3'LVA',CL24'LATVIA                  '   428            
         DC    CL2'LB',CL3'LBN',CL24'LEBANON                 '   422            
         DC    CL2'LS',CL3'LSO',CL24'LESOTHO                 '   426            
         DC    CL2'LR',CL3'LBR',CL24'LIBERIA                 '   430            
         DC    CL2'LY',CL3'LBY',CL24'LIBYAN ARAB JAMAHIRIYA  '   434            
         DC    CL2'LI',CL3'LIE',CL24'LIECHTENSTEIN           '   438            
         DC    CL2'LT',CL3'LTU',CL24'LITHUANIA               '   440            
         DC    CL2'LU',CL3'LUX',CL24'LUXEMBOURG              '   442            
         DC    CL2'MO',CL3'MAC',CL24'MACAU                   '   446            
         DC    CL2'MK',CL3'MKD',CL24'MACEDONIA               '   807            
         DC    CL2'MG',CL3'MDG',CL24'MADAGASCAR              '   450            
         DC    CL2'MW',CL3'MWI',CL24'MALAWI                  '   454            
         DC    CL2'MY',CL3'MYS',CL24'MALAYSIA                '   458            
         DC    CL2'MV',CL3'MDV',CL24'MALDIVES                '   462            
         DC    CL2'ML',CL3'MLI',CL24'MALI                    '   466            
         DC    CL2'MT',CL3'MLT',CL24'MALTA                   '   470            
         DC    CL2'MH',CL3'MHL',CL24'MARSHALL ISLANDS        '   584            
         DC    CL2'MQ',CL3'MTQ',CL24'MARTINIQUE              '   474            
         DC    CL2'MR',CL3'MRT',CL24'MAURITANIA              '   478            
         DC    CL2'MU',CL3'MUS',CL24'MAURITIUS               '   480            
         DC    CL2'YT',CL3'MYT',CL24'MAYOTTE                 '   175            
         DC    CL2'MX',CL3'MEX',CL24'MEXICO                  '   484            
         DC    CL2'FM',CL3'FSM',CL24'MICRONESIA  FEDERATED ST'   583            
         DC    CL2'MD',CL3'MDA',CL24'MOLDOVA                 '   498            
         DC    CL2'MC',CL3'MCO',CL24'MONACO                  '   492            
         DC    CL2'MN',CL3'MNG',CL24'MONGOLIA                '   496            
         DC    CL2'MS',CL3'MSR',CL24'MONTSERRAT              '   500            
         DC    CL2'MA',CL3'MAR',CL24'MOROCCO                 '   504            
         DC    CL2'MZ',CL3'MOZ',CL24'MOZAMBIQUE              '   508            
         DC    CL2'MM',CL3'MMR',CL24'MYANMAR                 '   104            
         DC    CL2'NA',CL3'NAM',CL24'NAMIBIA                 '   516            
         DC    CL2'NR',CL3'NRU',CL24'NAURU                   '   520            
         DC    CL2'NP',CL3'NPL',CL24'NEPAL                   '   524            
         DC    CL2'NL',CL3'NLD',CL24'NETHERLANDS             '   528            
         DC    CL2'AN',CL3'ANT',CL24'NETHERLANDS ANTILLES    '   530            
         DC    CL2'NC',CL3'NCL',CL24'NEW CALEDONIA           '   540            
         DC    CL2'NZ',CL3'NZL',CL24'NEW ZEALAND             '   554            
         DC    CL2'NI',CL3'NIC',CL24'NICARAGUA               '   558            
         DC    CL2'NE',CL3'NER',CL24'NIGER                   '   562            
         DC    CL2'NG',CL3'NGA',CL24'NIGERIA                 '   566            
         DC    CL2'NU',CL3'NIU',CL24'NIUE                    '   570            
         DC    CL2'NF',CL3'NFK',CL24'NORFOLK ISLAND          '   574            
         DC    CL2'MP',CL3'MNP',CL24'NORTHERN MARIANA ISLANDS'   580            
         DC    CL2'NO',CL3'NOR',CL24'NORWAY                  '   578            
         DC    CL2'OM',CL3'OMN',CL24'OMAN                    '   512            
         DC    CL2'PK',CL3'PAK',CL24'PAKISTAN                '   586            
         DC    CL2'PW',CL3'PLW',CL24'PALAU                   '   585            
         DC    CL2'PA',CL3'PAN',CL24'PANAMA                  '   591            
         DC    CL2'PG',CL3'PNG',CL24'PAPUA NEW GUINEA        '   598            
         DC    CL2'PY',CL3'PRY',CL24'PARAGUAY                '   600            
         DC    CL2'PE',CL3'PER',CL24'PERU                    '   604            
         DC    CL2'PH',CL3'PHL',CL24'PHILIPPINES             '   608            
         DC    CL2'PN',CL3'PCN',CL24'PITCAIRN                '   612            
         DC    CL2'PL',CL3'POL',CL24'POLAND                  '   616            
         DC    CL2'PT',CL3'PRT',CL24'PORTUGAL                '   620            
         DC    CL2'PR',CL3'PRI',CL24'PUERTO RICO             '   630            
         DC    CL2'QA',CL3'QAT',CL24'QATAR                   '   634            
         DC    CL2'RE',CL3'REU',CL24'REUNION                 '   638            
         DC    CL2'RO',CL3'ROM',CL24'ROMANIA                 '   642            
         DC    CL2'RU',CL3'RUS',CL24'RUSSIAN FEDERATION      '   643            
         DC    CL2'RW',CL3'RWA',CL24'RWANDA                  '   646            
         DC    CL2'KN',CL3'KNA',CL24'SAINT KITTS AND NEVIS   '   659            
         DC    CL2'LC',CL3'LCA',CL24'SAINT LUCIA             '   662            
         DC    CL2'VC',CL3'VCT',CL24'SAINT VINCENT AND THE GR'   670            
         DC    CL2'WS',CL3'WSM',CL24'SAMOA                   '   882            
         DC    CL2'SM',CL3'SMR',CL24'SAN MARINO              '   674            
         DC    CL2'ST',CL3'STP',CL24'SAO TOME AND PRINCIPE   '   678            
         DC    CL2'SA',CL3'SAU',CL24'SAUDI ARABIA            '   682            
         DC    CL2'SN',CL3'SEN',CL24'SENEGAL                 '   686            
         DC    CL2'SC',CL3'SYC',CL24'SEYCHELLES              '   690            
         DC    CL2'SL',CL3'SLE',CL24'SIERRA LEONE            '   694            
         DC    CL2'SG',CL3'SGP',CL24'SINGAPORE               '   702            
         DC    CL2'SK',CL3'SVK',CL24'SLOVAKIA (SLOVAK REPUBLI'   703            
         DC    CL2'SI',CL3'SVN',CL24'SLOVENIA                '   705            
         DC    CL2'SB',CL3'SLB',CL24'SOLOMON ISLANDS         '   090            
         DC    CL2'SO',CL3'SOM',CL24'SOMALIA                 '   706            
         DC    CL2'ZA',CL3'ZAF',CL24'SOUTH AFRICA            '   710            
         DC    CL2'GS',CL3'SGS',CL24'SOUTH GEORGIA AND THE SO'   239            
         DC    CL2'ES',CL3'ESP',CL24'SPAIN                   '   724            
         DC    CL2'LK',CL3'LKA',CL24'SRI LANKA               '   144            
         DC    CL2'SH',CL3'SHN',CL24'ST  HELENA              '   654            
         DC    CL2'PM',CL3'SPM',CL24'ST  PIERRE AND MIQUELON '   666            
         DC    CL2'SD',CL3'SDN',CL24'SUDAN                   '   736            
         DC    CL2'SR',CL3'SUR',CL24'SURINAME                '   740            
         DC    CL2'SJ',CL3'SJM',CL24'SVALBARD AND JAN MAYEN I'   744            
         DC    CL2'SZ',CL3'SWZ',CL24'SWAZILAND               '   748            
         DC    CL2'SE',CL3'SWE',CL24'SWEDEN                  '   752            
         DC    CL2'CH',CL3'CHE',CL24'SWITZERLAND             '   756            
         DC    CL2'SY',CL3'SYR',CL24'SYRIAN ARAB REPUBLIC    '   760            
         DC    CL2'TW',CL3'TWN',CL24'TAIWAN                  '   158            
         DC    CL2'TJ',CL3'TJK',CL24'TAJIKISTAN              '   762            
         DC    CL2'TZ',CL3'TZA',CL24'TANZANIA                '   834            
         DC    CL2'TH',CL3'THA',CL24'THAILAND                '   764            
         DC    CL2'TG',CL3'TGO',CL24'TOGO                    '   768            
         DC    CL2'TK',CL3'TKL',CL24'TOKELAU                 '   772            
         DC    CL2'TO',CL3'TON',CL24'TONGA                   '   776            
         DC    CL2'TT',CL3'TTO',CL24'TRINIDAD AND TOBAGO     '   780            
         DC    CL2'TN',CL3'TUN',CL24'TUNISIA                 '   788            
         DC    CL2'TR',CL3'TUR',CL24'TURKEY                  '   792            
         DC    CL2'TM',CL3'TKM',CL24'TURKMENISTAN            '   795            
         DC    CL2'TC',CL3'TCA',CL24'TURKS AND CAICOS ISLANDS'   796            
         DC    CL2'TV',CL3'TUV',CL24'TUVALU                  '   798            
         DC    CL2'UG',CL3'UGA',CL24'UGANDA                  '   800            
         DC    CL2'UA',CL3'UKR',CL24'UKRAINE                 '   804            
         DC    CL2'AE',CL3'ARE',CL24'UNITED ARAB EMIRATES    '   784            
         DC    CL2'GB',CL3'GBR',CL24'UNITED KINGDOM          '   826            
         DC    CL2'US',CL3'USA',CL24'UNITED STATES           '   840            
         DC    CL2'UM',CL3'UMI',CL24'UNITED STATES MINOR OUTL'   581            
         DC    CL2'UY',CL3'URY',CL24'URUGUAY                 '   858            
         DC    CL2'UZ',CL3'UZB',CL24'UZBEKISTAN              '   860            
         DC    CL2'VU',CL3'VUT',CL24'VANUATU                 '   548            
         DC    CL2'VA',CL3'VAT',CL24'VATICAN CITY STATE      '   336            
         DC    CL2'VE',CL3'VEN',CL24'VENEZUELA               '   862            
         DC    CL2'VN',CL3'VNM',CL24'VIET NAM                '   704            
         DC    CL2'VG',CL3'VGB',CL24'VIRGIN ISLANDS (BRITISH)'   092            
         DC    CL2'VI',CL3'VIR',CL24'VIRGIN ISLANDS (US)     '   850            
         DC    CL2'WF',CL3'WLF',CL24'WALLIS AND FUTUNA ISLAND'   876            
         DC    CL2'EH',CL3'ESH',CL24'WESTERN SAHARA          '   732            
         DC    CL2'YE',CL3'YEM',CL24'YEMEN                   '   887            
         DC    CL2'YU',CL3'YUG',CL24'YUGOSLAVIA              '   891            
         DC    CL2'ZR',CL3'ZAR',CL24'ZAIRE                   '   180            
         DC    CL2'ZM',CL3'ZMB',CL24'ZAMBIA                  '   894            
         DC    CL2'ZW',CL3'ZWE',CL24'ZIMBABWE                '   716            
*                                                                               
ISOCTABX DC    X'FFFFFFFF'                                                      
