*          DATA SET ACJOBMNTD  AT LEVEL 009 AS OF 10/17/94                      
*                                                                               
MPARM    DS    0D                                                               
MACTION  DS    0C                  ACTION = D, R, C OR O                        
MJOB     DS    A                   ADDRESS OF JOB KEY                           
MDRAFT   DS    0C                  DRAFT = Y OR N                               
MCOMFACS DS    A                   A(COMFACS)                                   
MPRORATA DS    A                   A(PRORATA)                                   
MPERSON  DS    A                   ADDRESS OF PERSON (OPTIONAL)                 
MGETOPT  DS    A                   ADDRESS OF GETOPT (REQ'D FOR CLOSE)          
MRAPPER  DS    A                   A(RAPPER) OR A(0) IF NOT GENERATING          
*                                  RECORD ACTIVITY POINTERS                     
MPARML   EQU   *-MPARM                                                          
