*          DATA SET ACJOBAGED  AT LEVEL 005 AS OF 11/24/99                      
*        EQUATES AND DSECTS USED BY ACJOBAGE                                    
*                                                                               
***********************************************************************         
*  EQUATES                                                            *         
***********************************************************************         
*                                                                               
COMPRSSZ EQU   2                   SIZE  OF   A    COMPRESSED DATE FLD          
MAX#DATS EQU   32                  MAX   NUM  OF   DATE PAIRS                   
MAXDEBUG EQU   500                 MAX   NUM  OF   DEBUG      PRINTING          
SPACE    EQU   C' '                SPACE                                        
YES      EQU   C'Y'                YES                                          
NO       EQU   C'N'                NO                                           
POSITIVE EQU   C'P'                POSITIVE                                     
NEGATIVE EQU   C'N'                NEGATIVE                                     
ZERO     EQU   C'Z'                ZERO                                         
MIXED    EQU   C'M'                MIXED                                        
DEBUGTX  EQU   1                   DEBUG      TRANSACTION     ELEMENTS          
DEBUGPRO EQU   2                   DEBUG      PRORATA         ELEMENTS          
*                                                                               
MX#DUMPP EQU   2                   MAX   NUM  OF   DUMP POINTERS                
MXTIMTAB EQU   600                 MAX   NUM  OF   TIME TBL  ENTRIES            
MXBILTAB EQU   3000                MAX   NUM  OF   BILL TBL  ENTRIES            
MXCRTAB  EQU   3000                MAX   NUM  OF   CR   TBL  ENTRIES            
MXDRTAB  EQU   3000                MAX   NUM  OF   DR   TBL  ENTRIES            
MXODRTB  EQU   3000                MAX   NUM  OF   OPEN DR   TBL  ENT'S         
MXOFFSTB EQU   2000                MAX   NUM  OF   OFFSET    TBL  ENT'S         
MXTOTTB  EQU   600                 MAX   NUM  OF   TOTALS    TBL  ENT'S         
MXOCRTB  EQU   800                 MAX   NUM  OF   OPEN CR   TBL  ENT'S         
MXOCRATB EQU   1200                MAX   NUM  OF   OPEN CR   ADJUSTED           
*                                                       TBL  ENTRIES            
*                                                                               
PKDAMNTQ EQU   JAILPTOT            LENGTH     OF   PACKED    AMOUNTS            
*                                                                               
*                                                                               
         EJECT 1                                                                
***********************************************************************         
*  GETMAINED FIELDS FOR THE JOB AGEING SUBROUTINE (ACJOBAGE)          *         
***********************************************************************         
         SPACE 1                                                                
JOBAGED  DSECT                     ***   GETMAINED FIELDS DSECT ***             
*                                                                               
IDJOBAGD DS    CL8                 EYE   CATCHER                                
*                                                                               
*                                  **    ADDRESSES **                           
*                                                                               
AJOBAGEI DS    A                   ADDR  OF   JOBAGEID  DSECT                   
ATX      DS    A                   ADDR  OF   TRANSACTION    ELEMENT            
AJOBRCD  DS    A                   ADDR  OF   JOB  RECORD   (TX)                
AJOBRCDS DS    A                   ADDR  OF   JOB  RECORD   (TOTAL)             
APRORATA DS    A                   ADDR  OF   PRORATA   BLOCK                   
ASEDATES DS    A                   ADDR  OF   START/END DATE PAIRS              
AUSRDATS DS    A                   ADDR  OF   USER'S    START/END DATES         
ATIMETAB DS    A                   ADDR  OF   TIME TABLE                        
ABILLTAB DS    A                   ADDR  OF   BILL TABLE                        
ACRTAB   DS    A                   ADDR  OF   CR   TABLE                        
ADRTAB   DS    A                   ADDR  OF   DR   TABLE                        
AOCRTB   DS    A                   ADDR  OF   OPEN CR   TABLE                   
AODRTB   DS    A                   ADDR  OF   OPEN DR   TABLE                   
AOCRATB  DS    A                   ADDR  OF   OPEN CR   ADJUSTED  TABLE         
ATOTTB   DS    A                   ADDR  OF   TOTAL     BILLS     TABLE         
AOFFSTB  DS    A                   ADDR  OF   OFFSET    TABLE                   
AASOFTAB DS    A                   ADDR  OF   AS   OF   TABLE                   
*                                                                               
ADCOMFAC DS    A                   ADDR  OF   COMFACS                           
BINSRCH  DS    A                   ADDR  OF   BINSRCH   ROUTINE                 
DATCON   DS    A                   ADDR  OF   DATCON    ROUTINE                 
ADDAY    DS    A                   ADDR  OF   ADDAY     ROUTINE                 
APRINT   DS    A                   ADDR  OF   PRINT     ROUTINE                 
APRNTBL  DS    A                   ADDR  OF   PRNTBL    ROUTINE                 
*                                                                               
         EJECT ,                                                                
*                                                                               
*                                  **    RUN  CONSTANTS **                      
*                                                                               
DATADISP DS    H                   DISP  OF   1ST  ELEMENT   IN   RCD           
TODAYDAT DS    XL(COMPRSSZ)        TODAY'S    DATE (COMPRESSED)                 
MOAENDDT DS    PL2                 MOA   END  DATE (PACKED   YYMM)              
ACTENDDT DS    XL(COMPRSSZ)        ACTIVITY   END  DATE (COMPRESSED)            
*                                                                               
LOWDATE  DS    XL(COMPRSSZ)        LOWEST     DATE REQUESTED (COMPRESS)         
HIGHDATE DS    XL(COMPRSSZ)        HIGHEST    DATE REQUESTED (COMPRESS)         
*                                                                               
*                                                                               
*                                  **    TEMP WORK AREAS     **                 
*                                                                               
DMCB     DS    8F                  PARAMETER  LIST      AREA                    
WORK     DS    8D                  8 DOUBLE   WORD WORK AREA                    
DUB      DS    D                   DOUBLE     WORD WORK AREA                    
PCK      DS    PL(PKDAMNTQ)        PACKED          WORK AREA                    
FULL     DS    F                   FULL       WORD WORK AREA                    
HALF     DS    H                   HALF       WORD WORK AREA                    
BYTE     DS    C                   ONE        BYTE WORK AREA                    
*                                                                               
         EJECT ,                                                                
*                                                                               
*                                  **    VARIABLES **                           
*                                                                               
JOBID    DS    XL(L'TRNKCULA)      JOB   ID                                     
CONTRAID DS    XL(L'TRNKCULC)      CONTRA-COMPANY  ID                           
*                                                                               
TRANMOA  DS    PL2                 TRANSACTION     MOA (YYMM)                   
*                                                                               
TRANAMNT DS    PL(PKDAMNTQ)        TRANSACTION     AMOUNT    OR                 
*                                        MEMO IF   XJOB                         
*                                                                               
POSTTRAN DS    PL(PKDAMNTQ)        AMOUNT     TO   POST THIS TX                 
*                                                                               
POSTMOAD DS    PL2                 MOA   DATE TO   POST THIS TX                 
*                                       (PACKED    YYMM)                        
POSTTXDT DS    PL3                 TX    DATE TO   POST THIS TX                 
*                                       (PACKED    YYMMDD)                      
POSTDADT DS    XL(COMPRSSZ)        DATE  ADDED     DATE (COMPRESSED)            
*                                                                               
POSTTBL  DS    A                   ADDR  OF   TABLE     TO   BE  POSTED         
*                                                                               
JOBBAL   DS    PL(PKDAMNTQ)        TOTAL BALANCE  (DEBITS - CREDITS)            
*                                        FOR  THE  JOB                          
DRPLUSCR DS    PL(PKDAMNTQ)        TOTAL OF   DR   AMOUNTS   (R3  TBL)          
*                                        PLUS CR   AMOUNTS   (R5  TBL)          
*                                                                               
OCRAADJV DS    PL(PKDAMNTQ)        FOR   OPEN CR   ADJUSTED  TABLE              
*                                        SPECIAL   ADJUSTMENT     VALUE         
*                                                                               
*                                  NOTE: IN   THE  NEXT TWO  FIELDS             
*                                        THE  CR   TABLE     AND                
*                                        THE  DR   TABLE     MAY  BE            
*                                        REVERSED                               
CRNUMENT DS    F                   NUMBER     OF   CR   TBL  ENTRIES            
DRNUMENT DS    F                   NUMBER     OF   DR   TBL  ENTRIES            
NUMTBENT DS    F                   NUMBER     OF   TBL  ENTRIES                 
*                                                                               
         DS    0F                  TEMPORARY  TOTALS    AREA                    
TEMPTOTA DS    (MAX#DATS)PL(PKDAMNTQ)                                           
*                                                                               
DEBUGCNT DS    H                   COUNT OF   DEBUG     PRINTOUTS               
*                                                                               
         EJECT ,                                                                
*                                                                               
*                                  **    BINARY    SEARCH    AREAS   **         
*                                                                               
         DS    0F                                                               
TIMEKEY  DS    CL(TIMELNQ)               FOR  TIME TABLE                        
*                                                                               
         DS    0F                                                               
CRDRKEY  DS    CL(CRDRLNQ)               FOR  CR   OR   DR   TABLE              
*                                                                               
         DS    0F                                                               
OFFSTKEY DS    CL(OFFSLNQ)               FOR  OFFSET    TABLE                   
*                                                                               
         DS    0F                                                               
OCRBSKEY DS    CL(OCRLNQ)                FOR  OPEN CR   TBL                     
*                                                                               
         DS    0F                                                               
TOTBSKEY DS    CL(TOTBLNQ)               FOR  TOTAL     BILLS     TABLE         
*                                                                               
         DS    0F                                                               
ASOFBLK  DS    CL(ACASOFLN)        *     AS   OF   BLOCK                        
*                                                                               
         EJECT ,                                                                
*                                                                               
*                                  **    SWITCHES/ ONE  BYTE FIELDS  **         
*                                                                               
         DS    0F                                                               
MODE     DS    XL1                 MODE  OF   THIS INVOCATION                   
INIT     EQU   JAIINIT             ..    INITIALIZE                             
TRANS    EQU   JAITRANS            ..    TRANSACTION                            
TOTAL    EQU   JAITOTAL            ..    GET  TOTALS    FOR  JOB                
FINI     EQU   JAIFINI             ..    FINISHED      (FREE STORAGE)           
*                                                                               
ELCODE   DS    XL1                 ELEMENT    CODE FOR  GETEL/NEXTEL            
*                                                                               
DATPAIRS DS    AL1                 NUM   OF   START/END DATE PAIRS              
*                                                                               
METHOD   DS    CL1                 AGEING METHOD                                
MTHDACTD EQU   C'A'                ..    ACTIVITY  DATE      AGEING             
MTHDFIFO EQU   C'F'                ..    FIFO                AGEING             
MTHDEFLT EQU   C'N'                ..    SYSTEM    DEFAULT   AGEING             
MTHDOPEN EQU   C'O'                ..    OPEN ITEM           AGEING             
MTHDUBIL EQU   C'U'                ..    UNBILLED            AGEING             
*                                       (DEFAULT - N)                           
*                                                                               
*SUPLASTN DS   CL1                 SUPPRESS   LAST NIGHT'S   BILLED             
*                                        ITEMS                                  
*                                       (YES/NO -  DEFAULT   NO)                
*                                                                               
*REVERSAL DS   CL1                 INCLUDE    REVERSALS                         
*                                       (YES/NO -  DEFAULT   YES)               
*                                                                               
TRIAL    DS    CL1                 GENERATE   TRIAL     BALANCE  REPORT         
*                                       (YES/NO -  DEFAULT   NO)                
*                                                                               
TIMCHRGS DS    CL1                 INCLUDE    TIME CHARGES                      
TIMCOOP  EQU   C'O'                           OUT  OF   POCKET    ONLY          
TIMTIMEO EQU   C'T'                           TIME                ONLY          
TIMBOTH  EQU   SPACE                          DEFAULT   BOTH                    
*                                                                               
EXPJOB   DS    XL1                 EXPENSE    JOB  INDICATOR                    
EXPJB    EQU   X'01'               JOB   IS   AN   EXPENSE   JOB                
*                                                                               
SKCNTRAT DS    CL1                 TREAT SK   CONTRA    AS   TIME               
*                                       (YES/NO -  DEFAULT   NO)                
*                                                                               
ZEROBAL  DS    CL1                 INCLUDE    ZERO BALANCE   JOBS               
*                                       (YES/NO -  DEFAULT   NO)                
*                                                                               
AGEBYTXD DS    CL1                 AGE   BY   TRANSACTION    DATE               
*                                        INSTEAD   OF   BY                      
*                                        BATCH     HDR  MONTH                   
*                                       (YES/NO/BOTH-   DEFAULT   NO)           
AGBYBOTH EQU   JAIAGEBT                  WHERE     BOTH MEANS:                  
*                                             SOME DATE PAIRS     AGE           
*                                                  BY   TX   DATE AND           
*                                             SOME DATE PAIRS     AGE           
*                                                  BY   MOA  DATE               
*                                                                               
TAGEBYTX DS    CL1                 FOR   THIS TOTALS    CALL AGE                
*                                        BY   TRANSACTION    DATE               
*                                        INSTEAD   OF   BY                      
*                                        BATCH     HDR  MONTH                   
*                                       (YES/NO -  DEFAULT   NO)                
*                                                                               
TPUTSTAT DS    CL1                 TIME  PUT  FLAG                              
TPUTBILL EQU   C'B'                      BILL                                   
TPUTSUB  EQU   C'S'                      SUBTRACT                               
*                                                                               
TRANSTAT DS    XL1                 TRANSACTION     STATUS                       
NEGATVE  EQU   X'01'                                                            
CREDIT   EQU   X'02'                                                            
TIME     EQU   X'04'               TRANSACTION     IS   CLIENT    TIME          
*                                                                               
SWAPSTAT DS    CL1                 SWAP  STATUS                                 
*                                                                               
OFFSTAT  DS    CL1                 OFFSET     STATUS                            
*                                                                               
TMPTOTSW DS    CL1                 TEMPORARY  TOTALS    SWITCH                  
*                                                                               
DEBUGSW  DS    CL1                 DEBUGGING  REQUESTED INDICATOR               
*                                                                               
         EJECT ,                                                                
*                                                                               
*                                  **    TABLES    **                           
*                                                                               
         DS    0F                  *     START/END DATE PAIRS                   
SEDATES  DS    (MAX#DATS)XL(DATESLNQ)                                           
*                                                                               
*        DS    0F                  *     AS   OF   BILLING   TABLE              
ASOFTAB  DS    XL(25*ACABTBSZ)     HANDLES 8000 BILLS                           
*                                                                               
TIMETAB  DS    0F                  *     TIME TABLE                             
TIMTAB#  DS    F                   NUM   IN   BINARY    SEARCH TABLE            
TIMTABMX DS    F                   MAX   NUM  IN   TABLE                        
TIMTABST EQU   *                   DATA  START                                  
         DS    (MXTIMTAB)CL(TIMELNQ)                                            
TIMTABLQ EQU   *-TIMTABST          DATA  LENGTH                                 
*                                                                               
BILLTAB  DS    0F                  *     BILL TABLE                             
BILTAB#  DS    F                   NUM   IN   BINARY    SEARCH TABLE            
BILTABMX DS    F                   MAX   NUM  IN   TABLE                        
BILTABST EQU   *                   DATA  START                                  
         DS    (MXBILTAB)CL(TIMELNQ)                                            
BILTABLQ EQU   *-BILTABST          DATA  LENGTH                                 
*                                                                               
OFFSTB   DS    0F                  *     OFFSET    TABLE                        
OFFSTB#  DS    F                   NUM   IN   BINARY    SEARCH TABLE            
OFFSTBMX DS    F                   MAX   NUM  IN   TABLE                        
OFFSTBST EQU   *                   DATA  START                                  
         DS    (MXOFFSTB)CL(OFFSLNQ)                                            
OFFSTBLQ EQU   *-OFFSTBST          DATA  LENGTH                                 
*                                                                               
OCRTB    DS    0F                  *     OPEN CR   TABLE                        
OCRTB#   DS    F                   NUM   IN   BINARY    SEARCH TABLE            
OCRTBMAX DS    F                   MAX   NUM  IN   TABLE                        
OCRTBSTA EQU   *                   DATA  START                                  
         DS    (MXOCRTB)CL(OCRLNQ)                                              
OCRTBLNQ EQU   *-OCRTBSTA          DATA  LENGTH                                 
*                                                                               
TOTTB    DS    0F                  *     TOTAL     BILLS     TABLE,             
*                                  *     A.K.A.    TOTALS    TABLE              
TOTTB#   DS    F                   NUM   IN   BINARY    SEARCH TABLE            
TOTTBMAX DS    F                   MAX   NUM  IN   TABLE                        
TOTTBSTA EQU   *                   DATA  START                                  
         DS    (MXTOTTB)CL(TOTBLNQ)                                             
TOTTBLNQ EQU   *-TOTTBSTA          DATA  LENGTH                                 
         EJECT ,                                                                
*                                                                               
CRTAB    DS    0F                  *     CR   TABLE                             
CRTAB#   DS    F                   NUM   IN   BINARY    SEARCH TABLE            
CRTABMAX DS    F                   MAX   NUM  IN   TABLE                        
CRTABTOT DS    PL(PKDAMNTQ)        SUM   OF   TABLE     AMOUNTS                 
*                                       (WHEN THE  SAME TX   IS                 
*                                        ENTERED   TWICE     INTO THIS          
*                                        TBL, THE  TX   AMOUNT    IS            
*                                        STILL     ADDED     ONLY ONCE)         
CRTABSTA EQU   *                   DATA  START                                  
         DS    (MXCRTAB)CL(CRDRLNQ)                                             
CRTABLNQ EQU   *-CRTABSTA          DATA  LENGTH                                 
*                                                                               
DRTAB    DS    0F                  *     DR   TABLE                             
DRTAB#   DS    F                   NUM   IN   BINARY    SEARCH TABLE            
DRTABMAX DS    F                   MAX   NUM  IN   TABLE                        
DRTABTOT DS    PL(PKDAMNTQ)        SUM   OF   TABLE     AMOUNTS                 
*                                       (WHEN THE  SAME TX   IS                 
*                                        ENTERED   TWICE     INTO THIS          
*                                        TBL, THE  TX   AMOUNT    IS            
*                                        STILL     ADDED     ONLY ONCE)         
DRTABSTA EQU   *                   DATA  START                                  
         DS    (MXDRTAB)CL(CRDRLNQ)                                             
DRTABLNQ EQU   *-DRTABSTA          DATA  LENGTH                                 
*                                                                               
ODRTB    DS    0F                  *     OPEN DR   TABLE                        
ODRTB#   DS    F                   NUM   IN   BINARY    SEARCH TABLE            
ODRTBMAX DS    F                   MAX   NUM  IN   TABLE                        
ODRTBTOT DS    PL(PKDAMNTQ)        SUM   OF   TABLE     AMOUNTS                 
*                                       (WHEN THE  SAME TX   IS                 
*                                        ENTERED   TWICE     INTO THIS          
*                                        TBL, THE  TX   AMOUNT    IS            
*                                        STILL     ADDED     ONLY ONCE)         
ODRTBSTA EQU   *                   DATA  START                                  
         DS    (MXODRTB)CL(CRDRLNQ)                                             
ODRTBLNQ EQU   *-ODRTBSTA          DATA  LENGTH                                 
*                                                                               
OCRATB   DS    0F                  *     OPEN CR   ADJUSTED    TABLE            
OCRATB#  DS    F                   NUM   IN   BINARY    SEARCH TABLE            
OCRATBMX DS    F                   MAX   NUM  IN   TABLE                        
OCRATBTO DS    PL(PKDAMNTQ)        SUM   OF   TABLE     AMOUNTS                 
*                                       (WHEN THE  SAME TX   IS                 
*                                        ENTERED   TWICE     INTO THIS          
*                                        TBL, THE  TX   AMOUNT    IS            
*                                        STILL     ADDED     ONLY ONCE)         
OCRATBST EQU   *                   DATA  START                                  
         DS    (MXOCRATB)CL(CRDRLNQ)                                            
OCRATBLQ EQU   *-OCRATBST          DATA  LENGTH                                 
*                                                                               
         SPACE 3                                                                
JOBAGELQ EQU   *-JOBAGED           LNG   OF   JOBAGED                           
*                                                                               
         EJECT 1                                                                
*                                  ************************************         
DATESD   DSECT                     *     START/END DATE PAIRS         *         
*                                  ************************************         
*                                                                               
STARTDT  DS    XL(COMPRSSZ)        START DATE COMPRESSED                        
ENDDT    DS    XL(COMPRSSZ)        END   DATE COMPRESSED                        
*                                                                               
DATESLNQ EQU   *-DATESD            DATESD     LENGTH                            
         EJECT ,                                                                
*                                  ************************************         
CRENTRYD DSECT                     *     CR   TABLE     ENTRY         *         
*                                  ************************************         
*                                                                               
*                                  NOTE: THE  LAYOUT    OF   THE                
*                                        CR   TBL  AND  THE  DR   TBL           
*                                        IS   IDENTICAL                         
*                                                                               
CRKEY    DS    0C                        CR   OR   DR   TABLE                   
CRDTTYPE DS    XL1                            DATE TYPE MOA  OR   TX            
CRDTMOA  EQU   NO                                  TYPE MOA                     
CRDTTX   EQU   YES                                 TYPE TRANSACTION             
CRDATE   DS    XL(COMPRSSZ)                   DATE (MOA OR   TX)                
*                                                  COMPRESSED                   
CRSKYLNQ EQU   *-CRKEY                        SHORT     KEY  LENGTH             
*CRRUND   DS   XL(COMPRSSZ)                   RUN  DATE COMPRESSED              
*CRBILD   DS   XL(COMPRSSZ)                   BILL DATE COMPRESSED              
CRKYLNQ  EQU   *-CRKEY                        KEY  LENGTH                       
CRAMNT   DS    PL(PKDAMNTQ)                   AMOUNT                            
CRLNQ    EQU   *-CRKEY                        ENTRY     LENGTH                  
*                                                                               
         SPACE 3                                                                
*                                  ************************************         
DRENTRYD DSECT                     *     DR   TABLE     ENTRY         *         
*                                  ************************************         
*                                                                               
*                                  NOTE: THE  LAYOUT    OF   THE                
*                                        CR   TBL  AND  THE  DR   TBL           
*                                        IS   IDENTICAL                         
*                                                                               
DRKEY    DS    0C                        CR   OR   DR   TABLE                   
DRDTTYPE DS    XL1                            DATE TYPE MOA  OR   TX            
DRDTMOA  EQU   NO                                  TYPE MOA                     
DRDTTX   EQU   YES                                 TYPE TRANSACTION             
DRDATE   DS    XL(COMPRSSZ)                   DATE (MOA OR   TX)                
*                                                  COMPRESSED                   
DRSKYLNQ EQU   *-DRKEY                        SHORT     KEY  LENGTH             
*DRRUND   DS   XL(COMPRSSZ)                   RUN  DATE COMPRESSED              
*DRBILD   DS   XL(COMPRSSZ)                   BILL DATE COMPRESSED              
DRKYLNQ  EQU   *-DRKEY                        KEY  LENGTH                       
DRAMNT   DS    PL(PKDAMNTQ)                   AMOUNT                            
DRLNQ    EQU   *-DRKEY                        ENTRY     LENGTH                  
*                                                                               
         EJECT ,                                                                
*                                  ************************************         
CRDRHDRD DSECT                     *     CR   TBL  AND  DR   TBL      *         
*                                  *     COMMON    HEADER    AREA     *         
*                                  ************************************         
*                                                                               
CRDR#ENT DS    F                   CURR  NUM  OF   ENTRIES   IN   TBL           
CRDRMAX  DS    F                   MAX   NUM  OF   ENTRIES   IN   TBL           
CRDRTOT  DS    PL(PKDAMNTQ)        SUM   OF   TABLE     AMOUNTS                 
CRDRDSTA EQU   *                   DATA  START                                  
         SPACE 3                                                                
*                                  ************************************         
CRDRDATD DSECT                     *     CR   TBL  AND  DR   TBL      *         
*                                  *     COMMON    DATA AREA          *         
*                                  ************************************         
*                                                                               
CRDRDTYP DS    XL1                 DATE  TYPE MOA  OR   TRANSACTION             
CRDRDMOA EQU   NO                        TYPE MOA                               
CRDRDTX  EQU   YES                       TYPE TRANSACTION                       
CRDRDATE DS    XL(COMPRSSZ)        DATE (MOA  OR   TRANSACTION)                 
*                                        COMPRESSED                             
CRDRSKYQ EQU   *-CRDRDATD          SHORT KEY  LENGTH                            
*CRDRRUND DS   XL(COMPRSSZ)        RUN   DATE COMPRESSED                        
*CRDRBILD DS   XL(COMPRSSZ)        BILL  DATE COMPRESSED                        
CRDRKYLQ EQU   *-CRDRDATD          KEY   LENGTH                                 
CRDRAMNT DS    PL(PKDAMNTQ)        AMOUNT                                       
CRDRLNQ  EQU   *-CRDRDATD          ENTRY LENGTH                                 
*                                                                               
         EJECT ,                                                                
*                                  ************************************         
TIMEHDRD DSECT                     *     TIME TBL, BILL TBL  AND      *         
*                                  *     OFFSET    TBL                *         
*                                  *     COMMON    HEADER    AREA     *         
*                                  ************************************         
*                                                                               
TIME#ENT DS    F                   CURR  NUM  OF   ENTRIES   IN   TBL           
TIMEMAX  DS    F                   MAX   NUM  OF   ENTRIES   IN   TBL           
TIMEDSTA EQU   *                   DATA  START                                  
         SPACE 3                                                                
*                                  ************************************         
TIMEDATD DSECT                     *     TIME TBL  AND  BILL TBL      *         
*                                  *     COMMON    DATA AREA          *         
*                                  ************************************         
*                                                                               
TIMEINV  DS    CL(L'TRNREF)                   INVOICE   NUMBER                  
TIMERUN  DS    XL(COMPRSSZ)                   RUN  DATE COMPRESSED              
TIMSKYLQ EQU   *-TIMEDATD                     SHORT     KEY  LENGTH             
TIMEBIL  DS    XL(COMPRSSZ)                   BILL DATE COMPRESSED              
TIMKYLNQ EQU   *-TIMEDATD                     KEY  LENGTH                       
TIMEAMNT DS    PL(PKDAMNTQ)                   AMOUNT                            
TIMELNQ  EQU   *-TIMEDATD                     ENTRY     LENGTH                  
*                                                                               
         EJECT ,                                                                
*                                  ************************************         
OFFSTABD DSECT                     *     OFFSET    TABLE     ENTRY    *         
*                                  ************************************         
*                                                                               
OFFSKEY  DS    0C                  OFFSET     TABLE     KEY                     
OFFSREF  DS    CL(L'TRNREF)                   REFERENCE NUMBER                  
OFFSDATE DS    PL(L'TRNDATE)                  TX   DATE                         
*                                                  PACKED    YYMMMDD            
OFFSAMNT DS    PL(PKDAMNTQ)                   AMOUNT                            
OFFSSKYQ EQU   *-OFFSKEY                      SHORT     KEY  LENGTH             
OFFSKYLQ EQU   *-OFFSKEY                      KEY  LENGTH                       
OFFSMOAD DS    PL(L'POSTMOAD)                 MOA  DATE PACKED    YYMM          
OFFSTXDT DS    PL(L'POSTTXDT)                 TX   DATE                         
*                                                  PACKED    YYMMDD             
OFFSLNQ  EQU   *-OFFSKEY                      ENTRY     LENGTH                  
*                                                                               
         EJECT ,                                                                
*                                  ************************************         
OCRENTD  DSECT                     *     OPEN CR   TABLE     ENTRY    *         
*                                  ************************************         
*                                                                               
OCRKEY   DS    0C                                                               
OCRDADAT DS    XL(COMPRSSZ)                   DATE ADDED     DATE               
*                                                  COMPRESSED                   
OCRCTR   DS    XL2                            UNIQUE    COUNTER                 
OCRSKYLQ EQU   *-OCRKEY                       SHORT     KEY  LENGTH             
*                                                  PACKED    YYMMMDD            
OCRKYLNQ EQU   *-OCRKEY                       KEY  LENGTH                       
OCRMOAD  DS    PL(L'POSTMOAD)                 MOA  DATE PACKED    YYMM          
OCRTXDT  DS    PL(L'POSTTXDT)                 TX   DATE                         
*                                                  PACKED    YYMMMDD            
OCRAMNT  DS    PL(PKDAMNTQ)                   AMOUNT                            
OCRLNQ   EQU   *-OCRKEY                       ENTRY     LENGTH                  
*                                                                               
         EJECT ,                                                                
*                                  ************************************         
TOTBENTD DSECT                     *     TOTALS    TABLE     ENTRY    *         
*                                  ************************************         
*                                                                               
TOTBKEY  DS    0C                                                               
TOTBDADT DS    XL(COMPRSSZ)                   DATE ADDED     DATE               
*                                                  COMPRESSED                   
TOTBCTR  DS    XL2                            UNIQUE    COUNTER                 
TOTBSKYQ EQU   *-TOTBKEY                      SHORT     KEY  LENGTH             
*                                                  PACKED    YYMMMDD            
TOTBKYLQ EQU   *-TOTBKEY                      KEY  LENGTH                       
TOTBMOAD DS    PL(L'POSTMOAD)                 MOA  DATE PACKED    YYMM          
TOTBTXDT DS    PL(L'POSTTXDT)                 TX   DATE                         
*                                                  PACKED    YYMMMDD            
TOTBAMNT DS    PL(PKDAMNTQ)                   AMOUNT                            
TOTB2DAY DS    XL(COMPRSSZ)                   TODAY'S   DATE COMPRESSED         
TOTBUBIL DS    XL(COMPRSSZ)                   UNBILLED  DATE COMPRESSED         
TOTBLNQ  EQU   *-TOTBKEY                      ENTRY     LENGTH                  
*                                                                               
