*          DATA SET ACLABELD   AT LEVEL 131 AS OF 12/03/03                      
*                                                                               
* DSECT FOR LABEL LINEUP BLOCK                                                  
*                                                                               
LBBLKD   DSECT                                                                  
LBJNM    DS    CL8                 JOB NAME (USE EXTRACT MACRO)                 
LBSTPNM  DS    CL8                 STEP NAME                                    
LBLOG2   DS    CL7                 FROM LOGO 2                                  
LBLOGNM  DS    CL33                FROM LOGO NAME                               
LBLOGAD  DS    CL33                FROM ADDRESS                                 
LBORGNID DS    CL8                 ORIGIN ID                                    
LBBLKLNQ EQU   *-LBBLKD                                                         
*                                                                               
LINESD   DSECT                     DSECT COVERS USER SUPPLIED DATA              
LINE1    DS    CL39                                                             
LINE2    DS    CL39                                                             
LINE3    DS    CL39                                                             
LINE4    DS    CL39                                                             
LINE5    DS    CL39                                                             
LINE6    DS    CL39                                                             
LINE7    DS    CL39                                                             
