*          DATA SET ACLDGTABD  AT LEVEL 004 AS OF 02/11/00                      
LDGTABD  DSECT                     ** LEDGER TABLE **                           
LDGTUL   DS    CL2                 UNIT/LEDGER CODE                             
LDGTEOTQ EQU   0                   END OF TABLE INDICATOR                       
LDGTTYPE DS    0CL1                LEDGER TYPE                                  
LDGTSTA2 DS    XL1                 LEDGER STATUS 2                              
LDGTLIKE DS    CL1                 LEDGER IS LIKE                               
LDGTOFFP DS    XL1                 OFFICE POSITION                              
LDGTCLOS DS    XL1                 LEDGER CLOSE-OUT TYPE                        
LDGTLVA  DS    XL1                 LEVEL A LENGTH                               
LDGTLVB  DS    XL1                 LEVEL B LENGTH                               
LDGTLVC  DS    XL1                 LEVEL C LENGTH                               
LDGTLVD  DS    XL1                 LEVEL D LENGTH                               
LDGTSEC  DS    XL1                 SECURITY NUMBER                              
LDGTVATC DS    0CL1                VAT CODE FOR CREDITOR LEDGERS                
LDGTDDL  DS    XL1                 DISPLACEMENT/LENGTH OF DEPARTMENT            
LDGTABL  EQU   *-LDGTABD                                                        
