*          DATA SET ACLFMDAD   AT LEVEL 015 AS OF 01/15/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603DAD      DATE 01/15/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      7    2    4  A  P H             T        Y              
TAXCODXH DS    CL8                                                              
TAXCODX  DS    CL9      7   15    9  A  U N             T    I   Y              
TAXNAM1H DS    CL8                                                              
TAXNAM1  DS    CL36     7   32   36  A  P N             T        Y              
TAXNAM2H DS    CL8                                                              
TAXNAM2  DS    CL36     8   32   36  A  P N             T        Y              
TAXNAM3H DS    CL8                                                              
TAXNAM3  DS    CL36     9   32   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     10    2    4  A  P H             T        Y              
TAXNAMXH DS    CL8                                                              
TAXNAMX  DS    CL36    10   15   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12    2    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7     13    2    7  A  P H             T        Y              
TAXACCH  DS    CL8                                                              
TAXACC   DS    CL14    13   15   14  A  U N             T        Y              
TAXACNMH DS    CL8                                                              
TAXACNM  DS    CL36    13   32   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    15   15   20  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL20    16   15   20  A  P H             T        Y              
TAXEFFH  DS    CL8                                                              
TAXEFF   DS    CL8     18   15    8  A  U N             T        Y              
TAXRATXH DS    CL8                                                              
TAXRATX  DS    CL7     18   29    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   15    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   29    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   15    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   29    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   15    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   29    7  A  U N             T        Y              
TAXTABH  DS    CL8                                                              
TAXTAB   DS    CL1     21   40    1  A  U N             T        Y              
TAXLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
TAXWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 504  BYTES                            
