*          DATA SET ACLFMEAD   AT LEVEL 003 AS OF 03/05/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603EAD      DATE 03/05/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     6    2   11  A   P    H         T        Y              
LOGDPTH  DS    CL8                                                              
LOGDPT   DS    CL5      6   20    5  A   U    N         T    I   Y              
LOGDPTNH DS    CL8                                                              
LOGDPTN  DS    CL36     6   31   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      7    2    8  A   P    H         T        Y              
LOGSBDH  DS    CL8                                                              
LOGSBD   DS    CL2      7   20    2  A   U    N         T        Y              
LOGSBDNH DS    CL8                                                              
LOGSBDN  DS    CL36     7   31   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      8    2    5  A   P    H         T        Y              
LOGSTFH  DS    CL8                                                              
LOGSTF   DS    CL7      8   20    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11     9    2   11  A   P    H         T        Y              
LOGSTRTH DS    CL8                                                              
LOGSTRT  DS    CL17     9   20   17  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     10    2    9  A   P    H         T        Y              
LOGHIREH DS    CL8                                                              
LOGHIRE  DS    CL8     10   20    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     10   34    9  A   P    H         T        Y              
LOGTERMH DS    CL8                                                              
LOGTERM  DS    CL8     10   52    8  A   U    N         T        Y              
LOGXNAMH DS    CL8                                                              
LOGXNAM  DS    CL4     11    2    4  A   P    H         T        Y              
LOGNAMEH DS    CL8                                                              
LOGNAME  DS    CL36    11   20   36  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL15    12    2   15  A   P    H         T        Y              
LOGPROFH DS    CL8                                                              
LOGPROF  DS    CL54    12   20   54  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    14    5   11  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL4     14   20    4  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL9     14   32    9  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL5     14   48    5  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL4     14   62    4  A   P    H         T        Y              
LOGLINEH DS    CL8                                                              
LOGLINE  DS    CL3     15    9    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     15   20    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    15   30   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   49    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    15   58   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    9    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     16   20    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    16   30   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   49    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    16   58   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    9    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     17   20    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    17   30   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   49    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    17   58   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    9    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     18   20    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    18   30   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   49    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    18   58   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    9    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     19   20    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    19   30   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   49    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    19   58   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    9    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     20   20    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    20   30   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   49    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    20   58   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    9    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     21   20    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    21   30   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   49    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    21   58   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    9    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     22   20    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    22   30   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22   49    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    22   58   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    9    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     23   20    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    23   30   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23   49    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    23   58   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     24    9    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     24   20    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    24   30   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     24   49    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    24   58   13  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     24   75    1  A   U    N         T        Y              
LOGLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LOGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1272 BYTES                            
