*          DATA SET ACLFMD2D   AT LEVEL 023 AS OF 10/22/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603D2D      DATE 10/22/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     6    2   11  A  P H             T        Y              
INTFLTDH DS    CL8                                                              
INTFLTD  DS    CL8      6   14    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL49     8    4   49  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL24     8   53   24  A  P H             T        Y              
INTDAT1H DS    CL8                                                              
INTDAT1  DS    CL8      9    2    8  A  U N             T        Y              
INTRAT1H DS    CL8                                                              
INTRAT1  DS    CL7      9   12    7  A  U N             T        Y              
INTDAT2H DS    CL8                                                              
INTDAT2  DS    CL8      9   22    8  A  U N             T        Y              
INTRAT2H DS    CL8                                                              
INTRAT2  DS    CL7      9   32    7  A  U N             T        Y              
INTDAT3H DS    CL8                                                              
INTDAT3  DS    CL8      9   42    8  A  U N             T        Y              
INTRAT3H DS    CL8                                                              
INTRAT3  DS    CL7      9   52    7  A  U N             T        Y              
INTDAT4H DS    CL8                                                              
INTDAT4  DS    CL8      9   62    8  A  U N             T        Y              
INTRAT4H DS    CL8                                                              
INTRAT4  DS    CL7      9   72    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     10    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     10   12    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   22    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     10   32    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   42    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     10   52    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   62    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     10   72    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   12    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   22    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   32    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   42    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   52    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   62    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   72    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   12    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   22    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   32    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   42    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   52    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   62    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   72    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   12    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   22    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   32    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   42    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   52    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   62    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   72    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   12    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   22    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   32    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   42    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   52    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   62    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   72    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   12    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   22    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   32    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   42    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   52    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   62    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   72    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   12    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   22    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   32    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   42    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   52    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   62    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   72    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   12    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   22    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   32    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   42    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   52    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   62    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   72    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   12    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   22    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   32    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   42    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   52    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   62    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   72    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   12    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   22    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   32    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   42    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   52    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   62    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   72    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   12    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   22    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   32    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   42    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   52    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   62    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   72    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   12    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   22    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   32    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   42    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   52    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   62    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   72    7  A  U N             T        Y              
INTENDH  DS    CL8                                                              
INTEND   DS    CL1     21   80    1  A  U N             T        Y              
INTLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
INTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1752 BYTES                            
