*          DATA SET ACLFMD5D   AT LEVEL 009 AS OF 07/12/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603D5D      DATE 07/12/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
ROWBGNH  DS    CL8                                                              
ROWBGN   DS    CL5      8   28    5  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL4      9    9    4  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL4      9   22    4  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL7      9   27    7  A   P    H         T        Y              
ROWFRSTH DS    CL8                                                              
ROWFRST  DS    CL1     10    3    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    10    9   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10   24    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10   30    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11    3    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    11    9   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11   24    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11   30    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12    3    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    12    9   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12   24    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12   30    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13    3    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    13    9   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   24    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   30    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14    3    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    14    9   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14   24    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14   30    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15    3    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    15    9   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   24    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   30    1  A   U    N         T        Y              
ROWTABH  DS    CL8                                                              
ROWTAB   DS    CL1     16    9    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL60    24    2   60  A   P    H         T        Y              
ROWLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
ROWWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 432  BYTES                            
