*          DATA SET ACLFMFDD   AT LEVEL 003 AS OF 08/24/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603FDD      DATE 08/24/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL12     6    2   12  A  P H             T        Y              
LOGCOMPH DS    CL8                                                              
LOGCOMP  DS    CL2      6   21    2  A  U N             T    I   Y              
LOGCNAMH DS    CL8                                                              
LOGCNAM  DS    CL36     6   41   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9      7    2    9  A  P H             T        Y              
LOGUNITH DS    CL8                                                              
LOGUNIT  DS    CL1      7   21    1  A  U N             T        Y              
LOGUNAMH DS    CL8                                                              
LOGUNAM  DS    CL36     7   41   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     8    2   11  A  P H             T        Y              
LOGLEDGH DS    CL8                                                              
LOGLEDG  DS    CL2      8   21    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      8   41    8  A  P H             T        Y              
LOGPASSH DS    CL8                                                              
LOGPASS  DS    CL3      8   52    3  A  U Z             T        Y              
LOGNMDSH DS    CL8                                                              
LOGNMDS  DS    CL11     9    2   11  A  P H             T        Y              
LOGLNAMH DS    CL8                                                              
LOGLNAM  DS    CL36     9   21   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    10    2   14  A  P N             T        Y              
LOGTYPEH DS    CL8                                                              
LOGTYPE  DS    CL56    10   21   56  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    11    2   14  A  P N             T        Y              
LOGSECH  DS    CL8                                                              
LOGSEC   DS    CL3     11   21    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    12    2   14  A  P H             T        Y              
LOGLEVAH DS    CL8                                                              
LOGLEVA  DS    CL2     12   21    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   41    5  A  P H             T        Y              
LOGDESAH DS    CL8                                                              
LOGDESA  DS    CL15    12   52   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    13    2   14  A  P N             T        Y              
LOGLEVBH DS    CL8                                                              
LOGLEVB  DS    CL2     13   21    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13   41    5  A  P N             T        Y              
LOGDESBH DS    CL8                                                              
LOGDESB  DS    CL15    13   52   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    14    2   14  A  P N             T        Y              
LOGLEVCH DS    CL8                                                              
LOGLEVC  DS    CL2     14   21    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14   41    5  A  P N             T        Y              
LOGDESCH DS    CL8                                                              
LOGDESC  DS    CL15    14   52   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    15    2   14  A  P N             T        Y              
LOGLEVDH DS    CL8                                                              
LOGLEVD  DS    CL2     15   21    2  N  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   41    5  A  P N             T        Y              
LOGDESDH DS    CL8                                                              
LOGDESD  DS    CL15    15   52   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    16    2   18  A  P N             T        Y              
LOGGENH  DS    CL8                                                              
LOGGEN   DS    CL56    16   21   56  A  U N             T        Y              
LOGGEN2H DS    CL8                                                              
LOGGEN2  DS    CL56    17   21   56  A  U N             T        Y              
LOGGEN3H DS    CL8                                                              
LOGGEN3  DS    CL56    18   21   56  A  U N             T        Y              
LOGGEN4H DS    CL8                                                              
LOGGEN4  DS    CL56    19   21   56  A  U N             T        Y              
LOGGEN5H DS    CL8                                                              
LOGGEN5  DS    CL56    20   21   56  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    21    2   16  A  P N             T        Y              
LOGCDACH DS    CL8                                                              
LOGCDAC  DS    CL14    21   21   14  A  U N             T        Y              
LOGCDNMH DS    CL8                                                              
LOGCDNM  DS    CL36    21   40   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    22    2   16  A  P N             T        Y              
LOGNUMH  DS    CL8                                                              
LOGNUM   DS    CL6     22   21    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    22   29   12  A  P N             T        Y              
LOGRSETH DS    CL8                                                              
LOGRSET  DS    CL4     22   43    4  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    23   21   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL16    24    2   16  A  P N             T        Y              
LOGXANLH DS    CL8                                                              
LOGXANL  DS    CL12    24   21   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    24   41   14  A  P N             T        Y              
LOGXCSTH DS    CL8                                                              
LOGXCST  DS    CL1     24   60    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     24   68    6  A  P N             T        Y              
LOGXSCHH DS    CL8                                                              
LOGXSCH  DS    CL1     24   75    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     24   79    1  A  U N             T        Y              
LOGLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LOGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1296 BYTES                            
