*          DATA SET ACLFMD3D   AT LEVEL 030 AS OF 03/08/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603D3D      DATE 03/08/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
PRFBGNH  DS    CL8                                                              
PRFBGN   DS    CL19     8    2   19  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL15     9    2   15  A   P    N         T        Y              
PRFLFJTH DS    CL8                                                              
PRFLFJT  DS    CL1      9   31    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL25     9   38   25  A   P    N         T        Y              
PRFRTOTH DS    CL8                                                              
PRFRTOT  DS    CL1      9   73    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL14    10    2   14  A   P    N         T        Y              
PRFBOXH  DS    CL8                                                              
PRFBOX   DS    CL1     10   31    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL32    10   38   32  A   P    N         T        Y              
PRFRDATH DS    CL8                                                              
PRFRDAT  DS    CL1     10   73    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL26    11    2   26  A   P    N         T        Y              
PRFIACTH DS    CL8                                                              
PRFIACT  DS    CL1     11   31    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL29    11   38   29  A   P    N         T        Y              
PRFPCMAH DS    CL8                                                              
PRFPCMA  DS    CL1     11   73    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL22    12    2   22  A   P    N         T        Y              
PRFPZAMH DS    CL8                                                              
PRFPZAM  DS    CL1     12   31    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL21    12   38   21  A   P    N         T        Y              
PRFPZTOH DS    CL8                                                              
PRFPZTO  DS    CL1     12   73    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL70    13    2   70  A   P    N         T        Y              
PRFPMINH DS    CL8                                                              
PRFPMIN  DS    CL1     13   73    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL16    15    2   16  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL26    16    2   26  A   P    N         T        Y              
PRFRNDH  DS    CL8                                                              
PRFRND   DS    CL1     16   31    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL30    16   38   30  A   P    N         T        Y              
PRFPCTSH DS    CL8                                                              
PRFPCTS  DS    CL1     16   73    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL14    18    2   14  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL28    19    2   28  A   P    N         T        Y              
PRFLISTH DS    CL8                                                              
PRFLIST  DS    CL6     19   31    6  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL7     21    2    7  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL17    22    2   17  A   P    N         T        Y              
PRFRKONH DS    CL8                                                              
PRFRKON  DS    CL2     22   20    2  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL15    22   23   15  A   P    N         T        Y              
PRFRKCLH DS    CL8                                                              
PRFRKCL  DS    CL2     22   39    2  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL23    22   42   23  A   P    N         T        Y              
PRFRKORH DS    CL8                                                              
PRFRKOR  DS    CL1     22   66    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL5     22   69    5  A   P    H         T        Y              
PRFTABH  DS    CL8                                                              
PRFTAB   DS    CL1     23    9    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL50    24    2   50  A   P    H         T        Y              
PRFLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
PRFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 832  BYTES                            
