*          DATA SET ACLFMFFD   AT LEVEL 018 AS OF 05/26/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603FFD      DATE 05/26/93                 
         SPACE 1                                                                
T603FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
LOGHEADH DS    CL8                                                              
LOGHEAD  DS    CL60     1    2   60  A  P N             T        Y              
LOGSERVH DS    CL8                                                              
LOGSERV  DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      3    2    6  A  P N             T        Y              
LOGRECH  DS    CL8                                                              
LOGREC   DS    CL15     3    9   15  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL6      4    2    6  A  P N             T        Y              
LOGACTH  DS    CL8                                                              
LOGACT   DS    CL10     4    9   10  A  U N             T        Y              
LOGTABH  DS    CL8                                                              
LOGTAB   DS    CL1      5    9    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL48     7    2   48  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17     7   52   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48     8    2   48  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17     8   52   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48    10    2   48  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    10   52   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48    11    2   48  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    11   52   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48    12    2   48  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    12   52   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48    13    2   48  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48    14    2   48  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48    15    2   48  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48    16    2   48  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48    17    2   48  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48    18    2   48  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48    19    2   48  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48    20    2   48  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL48    21    2   48  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22    2    1  A  P N             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1160 BYTES                            
