*          DATA SET ACLFMF8D   AT LEVEL 003 AS OF 09/22/86                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603F8D      DATE 09/22/86                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      6    2    9  A   P    H         T        Y              
LOGUNITH DS    CL8                                                              
LOGUNIT  DS    CL1      6   19    1  A   U    N         T    I   Y              
         DS    CL8                                                              
         DS    CL36     6   42   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11     7    2   11  A   P    H         T        Y              
LOGLEDGH DS    CL8                                                              
LOGLEDG  DS    CL1      7   19    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL36     7   42   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9      8    2    9  A   P    H         T        Y              
LOGWRKH  DS    CL8                                                              
LOGWRK   DS    CL2      8   19    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11    11    2   11  A   P    H         T        Y              
LOGDESCH DS    CL8                                                              
LOGDESC  DS    CL15    11   19   15  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6     12    2    6  A   P    N         T        Y              
LOGSTATH DS    CL8                                                              
LOGSTAT  DS    CL50    12   19   50  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   19    1  A   U    N         T        Y              
LOGLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LOGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 295  BYTES                            
