*          DATA SET ACLFMCBD   AT LEVEL 011 AS OF 08/06/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603CBD      DATE 08/06/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P N             T        Y              
OFCLEDGH DS    CL8                                                              
OFCLEDG  DS    CL1      5    9    1  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL22     7    2   22  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL22     7   28   22  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL22     7   54   22  A  P H             T        Y              
OFCSUB1H DS    CL8                                                              
OFCSUB1  DS    CL2      8    6    2  A  U N             T        Y              
OFCGNL1H DS    CL8                                                              
OFCGNL1  DS    CL2      8   18    2  A  U N             T        Y              
OFCSUB2H DS    CL8                                                              
OFCSUB2  DS    CL2      8   32    2  A  U N             T        Y              
OFCGNL2H DS    CL8                                                              
OFCGNL2  DS    CL2      8   44    2  A  U N             T        Y              
OFCSUB3H DS    CL8                                                              
OFCSUB3  DS    CL2      8   58    2  A  U N             T        Y              
OFCGNL3H DS    CL8                                                              
OFCGNL3  DS    CL2      8   70    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2      9    6    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2      9   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2      9   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2      9   44    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2      9   58    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2      9   70    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     10    6    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     10   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     10   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     10   44    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     10   58    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     10   70    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     11    6    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   44    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   58    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   70    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     12    6    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   44    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   58    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   70    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     13    6    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   44    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   58    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   70    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14    6    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   44    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   58    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   70    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15    6    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   44    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   58    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   70    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16    6    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   44    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   58    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   70    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17    6    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   44    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   58    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   70    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18    6    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   44    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   58    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   70    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19    6    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   44    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   58    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   70    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20    6    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   44    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   58    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   70    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21    6    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   44    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   58    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   70    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22    6    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   44    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   58    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   70    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     23    6    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     23   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     23   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     23   44    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     23   58    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     23   70    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     24    6    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     24   18    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     24   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     24   44    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     24   58    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     24   70    2  A  U N             T        Y              
OFCENDH  DS    CL8                                                              
OFCEND   DS    CL1     24   79    1  A  U N             T        Y              
OFCLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
OFCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1152 BYTES                            
