*          DATA SET ACLFMF9D   AT LEVEL 001 AS OF 03/28/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603F9D      DATE 03/28/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL10     6    2   10  A  P H             T        Y              
LOGCODEH DS    XL8                                                              
LOGCODE  DS    CL1      6   22    1  A  U N             T    I   Y              
         DS    XL8                                                              
         DS    CL11     8    2   11  A  P H             T        Y              
LOGDESCH DS    XL8                                                              
LOGDESC  DS    CL12     8   22   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18     9    2   18  A  P H             T        Y              
LOGCOMMH DS    XL8                                                              
LOGCOMM  DS    CL14     9   22   14  A  U N             T        Y              
LOGCNAMH DS    XL8                                                              
LOGCNAM  DS    CL36     9   41   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL18    10    2   18  A  P H             T        Y              
LOGCSDH  DS    XL8                                                              
LOGCSD   DS    CL14    10   22   14  A  U N             T        Y              
LOGCSDNH DS    XL8                                                              
LOGCSDN  DS    CL36    10   41   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    11    2   16  A  P H             T        Y              
LOGPCDH  DS    XL8                                                              
LOGPCD   DS    CL14    11   22   14  A  U N             T        Y              
LOGPCDNH DS    XL8                                                              
LOGPCDN  DS    CL36    11   41   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    12    2   16  A  P H             T        Y              
LOGTWOH  DS    XL8                                                              
LOGTWO   DS    CL14    12   22   14  A  U N             T        Y              
LOGTWONH DS    XL8                                                              
LOGTWON  DS    CL36    12   41   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    13    2   16  A  P H             T        Y              
LOGTINH  DS    XL8                                                              
LOGTIN   DS    CL14    13   22   14  A  U N             T        Y              
LOGTINNH DS    XL8                                                              
LOGTINN  DS    CL36    13   41   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    14    2   13  A  P N             T        Y              
LOGANALH DS    XL8                                                              
LOGANAL  DS    CL12    14   22   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16    15    2   16  A  P N             T        Y              
LOGNUMH  DS    XL8                                                              
LOGNUM   DS    CL6     15   22    6  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    16    2   17  A  P N             T        Y              
LOGRSETH DS    XL8                                                              
LOGRSET  DS    CL4     16   22    4  N  U N             T        Y              
         DS    XL8                                                              
         DS    CL6     17    2    6  A  P N             T        Y              
LOGSTATH DS    XL8                                                              
LOGSTAT  DS    CL40    17   22   40  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    18    2   18  A  P Z             T        Y              
LOGVATOH DS    XL8                                                              
LOGVATO  DS    CL14    18   22   14  A  P N             T        Y              
LOGVNAMH DS    XL8                                                              
LOGVNAM  DS    CL36    18   41   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   22    1  A  U N             T        Y              
LOGLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
LOGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 808  BYTES                            
