*          DATA SET ACLFMDCD   AT LEVEL 009 AS OF 10/23/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603DCD      DATE 10/23/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     6    2   11  A  P H             T        Y              
LOGDPTH  DS    CL8                                                              
LOGDPT   DS    CL6      6   20    6  A  U N             T    I   Y              
LOGDPTNH DS    CL8                                                              
LOGDPTN  DS    CL36     6   31   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      7    2    8  A  P H             T        Y              
LOGSBDH  DS    CL8                                                              
LOGSBD   DS    CL6      7   20    6  A  U N             T        Y              
LOGSBDNH DS    CL8                                                              
LOGSBDN  DS    CL36     7   31   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      8    2    8  A  P H             T        Y              
LOGIEMPH DS    CL8                                                              
LOGIEMP  DS    CL6      8   20    6  A  U N             T        Y              
LOGEMPNH DS    CL8                                                              
LOGEMPN  DS    CL36     8   31   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13     9    2   13  A  P H             T        Y              
LOGBUDFH DS    CL8                                                              
LOGBUDF  DS    CL10     9   20   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      9   31    9  A  P H             T        Y              
LOGSTRTH DS    CL8                                                              
LOGSTRT  DS    CL8      9   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      9   55    7  A  P H             T        Y              
LOGENDH  DS    CL8                                                              
LOGEND   DS    CL8      9   65    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    10    2   11  A  P H             T        Y              
LOGBUDTH DS    CL8                                                              
LOGBUDT  DS    CL10    10   20   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     10   31    9  A  P H             T        Y              
LOGCLTSH DS    CL8                                                              
LOGCLTS  DS    CL8     10   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     10   55    7  A  P H             T        Y              
LOGCLTEH DS    CL8                                                              
LOGCLTE  DS    CL8     10   65    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    11    2   21  A  P H             T        Y              
LOGWSALH DS    CL8                                                              
LOGWSAL  DS    CL9     11   25    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL21    11   41   21  A  P H             T        Y              
LOGYSALH DS    CL8                                                              
LOGYSAL  DS    CL9     11   67    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    12    4   14  A  P H             T        Y              
LOGQTR1H DS    CL8                                                              
LOGQTR1  DS    CL2     12   20    2  A  U N             T        Y              
LOGINC1H DS    CL8                                                              
LOGINC1  DS    CL9     12   25    9  A  U N             T        Y              
LOGAMT1H DS    CL8                                                              
LOGAMT1  DS    CL9     12   67    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   15    3  A  P H             T        Y              
LOGQTR2H DS    CL8                                                              
LOGQTR2  DS    CL2     13   20    2  A  U N             T        Y              
LOGINC2H DS    CL8                                                              
LOGINC2  DS    CL9     13   25    9  A  U N             T        Y              
LOGAMT2H DS    CL8                                                              
LOGAMT2  DS    CL9     13   67    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24    14   41   24  A  P H             T        Y              
LOGIAMTH DS    CL8                                                              
LOGIAMT  DS    CL9     14   67    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL22    15   41   22  A  P H             T        Y              
LOGSAMTH DS    CL8                                                              
LOGSAMT  DS    CL9     15   67    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    16    3   11  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL11    16   22   11  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL11    16   41   11  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL11    16   60   11  A  P H             T        Y              
LOGCLT1H DS    CL8                                                              
LOGCLT1  DS    CL7     17    3    7  A  U N             T        Y              
LOGPCT1H DS    CL8                                                              
LOGPCT1  DS    CL5     17   12    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   22    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   31    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   41    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   50    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   60    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   69    5  A  U N             T        Y              
LOGCLT2H DS    CL8                                                              
LOGCLT2  DS    CL7     18    3    7  A  U N             T        Y              
LOGPCT2H DS    CL8                                                              
LOGPCT2  DS    CL5     18   12    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   22    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   31    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   41    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   50    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   60    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   69    5  A  U N             T        Y              
LOGCLT3H DS    CL8                                                              
LOGCLT3  DS    CL7     19    3    7  A  U N             T        Y              
LOGPCT3H DS    CL8                                                              
LOGPCT3  DS    CL5     19   12    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   22    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   31    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   41    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   50    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   60    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   69    5  A  U N             T        Y              
LOGCLT4H DS    CL8                                                              
LOGCLT4  DS    CL7     20    3    7  A  U N             T        Y              
LOGPCT4H DS    CL8                                                              
LOGPCT4  DS    CL5     20   12    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   22    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   31    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   41    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   50    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   60    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   69    5  A  U N             T        Y              
LOGCLT5H DS    CL8                                                              
LOGCLT5  DS    CL7     21    3    7  A  U N             T        Y              
LOGPCT5H DS    CL8                                                              
LOGPCT5  DS    CL5     21   12    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   22    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   31    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   41    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   50    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   60    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   69    5  A  U N             T        Y              
LOGCLT6H DS    CL8                                                              
LOGCLT6  DS    CL7     22    3    7  A  U N             T        Y              
LOGPCT6H DS    CL8                                                              
LOGPCT6  DS    CL5     22   12    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   22    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   31    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   41    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   50    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   60    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   69    5  A  U N             T        Y              
LOGCLT7H DS    CL8                                                              
LOGCLT7  DS    CL7     23    3    7  A  U N             T        Y              
LOGPCT7H DS    CL8                                                              
LOGPCT7  DS    CL5     23   12    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   22    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   31    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   41    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   50    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     23   60    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   69    5  A  U N             T        Y              
LOGCLT8H DS    CL8                                                              
LOGCLT8  DS    CL7     24    3    7  A  U N             T        Y              
LOGPCT8H DS    CL8                                                              
LOGPCT8  DS    CL5     24   12    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     24   22    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     24   31    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     24   41    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     24   50    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     24   60    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     24   69    5  A  U N             T        Y              
LOGLSTH  DS    CL8                                                              
LOGLST   DS    CL1     24   79    1  A  U N             T        Y              
LOGLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LOGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1728 BYTES                            
