*          DATA SET ACLFME9D   AT LEVEL 013 AS OF 07/15/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603E9D      DATE 07/15/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL49     6    2   49  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL22     6   56   22  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL47     7    2   47  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL20     7   56   20  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3      8    3    3  A   P    H         T        Y              
LOGMONH  DS    CL8                                                              
LOGMON   DS    CL3      8   10    3  A   U    N         T        Y              
LOGSECH  DS    CL8                                                              
LOGSEC   DS    CL1      8   19    1  A   U    N         T        Y              
LOGTYP1H DS    CL8                                                              
LOGTYP1  DS    CL2      8   30    2  A   U    N         T        Y              
LOGMON1H DS    CL8                                                              
LOGMON1  DS    CL3      8   37    3  A   U    N         T        Y              
LOGSEC1H DS    CL8                                                              
LOGSEC1  DS    CL1      8   46    1  A   U    N         T        Y              
LOGTYP2H DS    CL8                                                              
LOGTYP2  DS    CL2      8   57    2  A   U    N         T        Y              
LOGMON2H DS    CL8                                                              
LOGMON2  DS    CL3      8   64    3  A   U    N         T        Y              
LOGSEC2H DS    CL8                                                              
LOGSEC2  DS    CL1      8   73    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2      9    3    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   10    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9   19    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2      9   30    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   37    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9   46    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2      9   57    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   64    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9   73    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     10    3    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   10    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10   19    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     10   30    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   37    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10   46    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     10   57    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   64    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10   73    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     11    3    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   10    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11   19    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     11   30    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   37    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11   46    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     11   57    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   64    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11   73    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     12    3    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   10    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12   19    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     12   30    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   37    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12   46    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     12   57    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   64    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12   73    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     13    3    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   10    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   19    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     13   30    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   37    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   46    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     13   57    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   64    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   73    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     14    3    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   10    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14   19    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     14   30    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   37    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14   46    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     14   57    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   64    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14   73    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     15    3    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   10    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   19    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     15   30    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   37    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   46    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     15   57    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   64    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   73    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     16    3    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   10    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16   19    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     16   30    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   37    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16   46    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     16   57    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   64    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16   73    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     17    3    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   10    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   19    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     17   30    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   37    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   46    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     17   57    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   64    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   73    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     18    3    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   10    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   19    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     18   30    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   37    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   46    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     18   57    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   64    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   73    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     19    3    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   10    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   19    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     19   30    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   37    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   46    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     19   57    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   64    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   73    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     20    3    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   10    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   19    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     20   30    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   37    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   46    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     20   57    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   64    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   73    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     21    3    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   10    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   19    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     21   30    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   37    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   46    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     21   57    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   64    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   73    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     22    3    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22   10    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22   19    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     22   30    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22   37    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22   46    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     22   57    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22   64    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22   73    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     23    3    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23   10    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23   19    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     23   30    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23   37    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23   46    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     23   57    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23   64    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23   73    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     24    3    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     24   10    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     24   19    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     24   30    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     24   37    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     24   46    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     24   57    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     24   64    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     24   73    1  A   U    N         T        Y              
LOGENDH  DS    CL8                                                              
LOGEND   DS    CL1     24   77    1  A   U    N         T        Y              
LOGLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
LOGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1713 BYTES                            
