*          DATA SET ACLFMD7D   AT LEVEL 004 AS OF 11/28/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603D7D      DATE 11/28/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
COLBGNH  DS    CL8                                                              
COLBGN   DS    CL4      8   21    4  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3      8   35    3  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3      8   39    3  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL4      8   43    4  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL4      9    7    4  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL5      9   21    5  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL2      9   32    2  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3      9   35    3  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3      9   39    3  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL5      9   43    5  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL6      9   50    6  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL6      9   65    6  A   P    H         T        Y              
COLFRSTH DS    CL8                                                              
COLFRST  DS    CL2     10    3    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    10    7   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    10   21   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     10   32    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10   36    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10   40    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     10   44    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    10   50   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    10   65   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     11    3    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    11    7   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    11   21   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     11   32    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11   36    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11   40    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     11   44    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    11   50   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    11   65   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     12    3    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    12    7   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    12   21   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     12   32    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12   36    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12   40    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     12   44    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    12   50   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    12   65   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     13    3    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    13    7   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    13   21   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     13   32    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   36    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   40    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     13   44    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    13   50   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    13   65   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     14    3    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    14    7   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    14   21   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     14   32    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14   36    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14   40    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     14   44    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    14   50   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    14   65   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     15    3    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    15    7   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    15   21   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     15   32    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   36    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   40    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     15   44    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    15   50   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    15   65   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     16    3    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    16    7   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    16   21   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     16   32    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16   36    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16   40    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     16   44    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    16   50   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    16   65   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     17    3    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    17    7   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    17   21   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     17   32    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   36    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   40    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     17   44    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    17   50   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    17   65   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     18    3    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    18    7   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    18   21   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     18   32    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   36    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   40    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     18   44    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    18   50   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    18   65   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     19    3    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    19    7   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    19   21   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     19   32    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   36    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   40    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     19   44    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    19   50   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    19   65   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     20    3    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    20    7   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    20   21   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     20   32    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   36    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   40    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     20   44    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    20   50   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    20   65   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     21    3    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    21    7   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    21   21   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     21   32    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   36    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   40    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     21   44    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    21   50   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    21   65   12  A   U    N         T        Y              
COLTABH  DS    CL8                                                              
COLTAB   DS    CL1     22   10    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL55    23    2   55  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL55    24    2   55  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL14    24   60   14  A   P    H         T        Y              
COLTWDTH DS    CL8                                                              
COLTWDT  DS    CL3     24   75    3  A   P    N         T        Y              
COLLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
COLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1840 BYTES                            
