*          DATA SET ACLFMEED   AT LEVEL 002 AS OF 09/30/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603EED      DATE 09/30/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     6    2   11   A    P    N         T         Y           
LOGCLIH  DS    CL8                                                              
LOGCLI   DS    CL6      6   16    6   A    U    N         T    I    Y           
LOGCLINH DS    CL8                                                              
LOGCLIN  DS    CL36     6   33   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL12     7    2   12   A    P    N         T         Y           
LOGPROH  DS    CL8                                                              
LOGPRO   DS    CL6      7   16    6   A    U    N         T         Y           
LOGPRONH DS    CL8                                                              
LOGPRON  DS    CL36     7   33   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL10     8    2   10   A    P    N         T         Y           
LOGJOBH  DS    CL8                                                              
LOGJOB   DS    CL6      8   16    6   A    U    N         T         Y           
LOGJOBNH DS    CL8                                                              
LOGJOBN  DS    CL36     8   33   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL16    10   16   16   A    P    N         T         Y           
LOGFRSTH DS    CL8                                                              
LOGFRST  DS    CL6     12   16    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     12   25    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL36    12   33   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     13   16    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     13   25    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL36    13   33   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     14   16    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     14   25    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL36    14   33   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     15   16    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     15   25    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL36    15   33   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     16   16    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     16   25    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL36    16   33   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     17   16    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     17   25    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL36    17   33   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     18   16    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     18   25    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL36    18   33   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     19   16    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     19   25    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL36    19   33   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     20   16    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     20   25    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL36    20   33   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     21   16    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     21   25    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL36    21   33   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     22   16    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     22   25    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL36    22   33   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     23   16    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     23   25    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL36    23   33   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     24   16    1   A    U    N         T         Y           
LOGLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LOGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1131 BYTES                            
