*          DATA SET ACLFME2D   AT LEVEL 002 AS OF 09/30/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603E2D      DATE 09/30/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    4    6   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      6   16    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      6   27    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      6   38    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      6   49    8   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL8      6   60    8   A    P    N         T         Y           
LOGPERDH DS    CL8                                                              
LOGPERD  DS    CL6      8    4    6   A    U    N         T    I    Y           
LOGHOURH DS    CL8                                                              
LOGHOUR  DS    CL7      8   16    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      8   27    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      8   38    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      8   49    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      8   60    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6      9    4    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      9   16    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      9   27    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      9   38    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      9   49    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      9   60    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     10    4    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     10   16    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     10   27    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     10   38    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     10   49    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     10   60    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     11    4    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     11   16    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     11   27    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     11   38    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     11   49    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     11   60    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     12    4    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     12   16    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     12   27    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     12   38    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     12   49    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     12   60    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     13    4    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     13   16    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     13   27    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     13   38    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     13   49    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     13   60    7   A    U    N         T         Y           
LOGENDH  DS    CL8                                                              
LOGEND   DS    CL1     14    4    1   A    U    N         T         Y           
LOGLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
LOGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 640  BYTES                            
