*          DATA SET ACLFMD6D   AT LEVEL 017 AS OF 09/19/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603D6D      DATE 09/19/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
HLP08H   DS    CL8                                                              
HLP08    DS    CL79     8    2   79  A   P    N         T        Y              
HLP09H   DS    CL8                                                              
HLP09    DS    CL79     9    2   79  A   P    N         T        Y              
HLP10H   DS    CL8                                                              
HLP10    DS    CL79    10    2   79  A   P    N         T        Y              
HLP11H   DS    CL8                                                              
HLP11    DS    CL79    11    2   79  A   P    N         T        Y              
HLP12H   DS    CL8                                                              
HLP12    DS    CL79    12    2   79  A   P    N         T        Y              
HLP13H   DS    CL8                                                              
HLP13    DS    CL79    13    2   79  A   P    N         T        Y              
HLP14H   DS    CL8                                                              
HLP14    DS    CL79    14    2   79  A   P    N         T        Y              
HLP15H   DS    CL8                                                              
HLP15    DS    CL79    15    2   79  A   P    N         T        Y              
HLP16H   DS    CL8                                                              
HLP16    DS    CL79    16    2   79  A   P    N         T        Y              
HLP17H   DS    CL8                                                              
HLP17    DS    CL79    17    2   79  A   P    N         T        Y              
HLP18H   DS    CL8                                                              
HLP18    DS    CL79    18    2   79  A   P    N         T        Y              
HLP19H   DS    CL8                                                              
HLP19    DS    CL79    19    2   79  A   P    N         T        Y              
HLP20H   DS    CL8                                                              
HLP20    DS    CL79    20    2   79  A   P    N         T        Y              
HLP21H   DS    CL8                                                              
HLP21    DS    CL79    21    2   79  A   P    N         T        Y              
HLP22H   DS    CL8                                                              
HLP22    DS    CL79    22    2   79  A   P    N         T        Y              
HLP23H   DS    CL8                                                              
HLP23    DS    CL79    23    2   79  A   P    N         T        Y              
HLP24H   DS    CL8                                                              
HLP24    DS    CL50    24    2   50  A   P    H         T        Y              
HLPLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
HLPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1456 BYTES                            
