*          DATA SET ACLFMC9D   AT LEVEL 002 AS OF 09/18/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603C9D      DATE 09/18/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
SECAGT1H DS    CL8                                                              
SECAGT1  DS    CL20     8    2   20  A  P H             T        Y              
SECAGN1H DS    CL8                                                              
SECAGN1  DS    CL20     8   24   20  L  U N             T        Y              
SECAGT2H DS    CL8                                                              
SECAGT2  DS    CL20     9    2   20  A  P H             T        Y              
SECAGN2H DS    CL8                                                              
SECAGN2  DS    CL20     9   24   20  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    24    2   11  A  P H             T        Y              
SECLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
SECWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 136  BYTES                            
