*          DATA SET ACLFMF3D   AT LEVEL 004 AS OF 03/05/86                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603F3D      DATE 03/05/86                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    H         T        Y              
LOGCLIH  DS    CL8                                                              
LOGCLI   DS    CL6      6   21    6  A   U    N         T    I   Y              
LOGCLINH DS    CL8                                                              
LOGCLIN  DS    CL36     6   31   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
LOGPRDH  DS    CL8                                                              
LOGPRD   DS    CL6      7   21    6  A   U    N         T        Y              
LOGPRDNH DS    CL8                                                              
LOGPRDN  DS    CL36     7   31   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A   P    N         T        Y              
LOGJOBH  DS    CL8                                                              
LOGJOB   DS    CL6      8   21    6  A   U    N         T        Y              
LOGJOBNH DS    CL8                                                              
LOGJOBN  DS    CL36     8   31   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10     9    2   10  A   P    N         T        Y              
LOGMEDH  DS    CL8                                                              
LOGMED   DS    CL3      9   21    3  A   U    N         T        Y              
LOGMEDNH DS    CL8                                                              
LOGMEDN  DS    CL15     9   31   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9     10    2    9  A   P    N         T        Y              
LOGWRKH  DS    CL8                                                              
LOGWRK   DS    CL3     10   21    3  A   U    N         T        Y              
LOGWRKNH DS    CL8                                                              
LOGWRKN  DS    CL15    10   31   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    11    2   15  A   P    N         T        Y              
LOGCOMMH DS    CL8                                                              
LOGCOMM  DS    CL8     11   21    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8     12    2    8  A   P    Z         T        Y              
LOGTAXH  DS    CL8                                                              
LOGTAX   DS    CL3     12   21    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   21    1  A   U    N         T        Y              
LOGLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LOGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 395  BYTES                            
