*          DATA SET ACLFMF4D   AT LEVEL 002 AS OF 06/05/84                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603F4D      DATE 06/05/84                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6   A    P    H         T         Y           
LOGCLIH  DS    CL8                                                              
LOGCLI   DS    CL8      6   12    8   A    U    N         T    I    Y           
LOGCLINH DS    CL8                                                              
LOGCLIN  DS    CL36     6   24   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7      7    2    7   A    P    H         T         Y           
LOGPRDH  DS    CL8                                                              
LOGPRD   DS    CL8      7   12    8   A    U    N         T         Y           
LOGPRDNH DS    CL8                                                              
LOGPRDN  DS    CL36     7   24   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3      8    2    3   A    P    H         T         Y           
LOGJOBH  DS    CL8                                                              
LOGJOB   DS    CL8      8   12    8   A    U    N         T         Y           
LOGJOBNH DS    CL8                                                              
LOGJOBN  DS    CL56     8   24   56   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL5      9    2    5   A    P    H         T         Y           
LOGWCH   DS    CL8                                                              
LOGWC    DS    CL30     9   12   30   A    U    N         T         Y           
LOGENDH  DS    CL8                                                              
LOGEND   DS    CL1     10   12    1   A    U    N         T         Y           
LOGHDLH  DS    CL8                                                              
LOGHDL   DS    CL77    12    2   77   A    P    N         T         Y           
LOGFSWCH DS    CL8                                                              
LOGFSWC  DS    CL18    13    2   18   A    P    N         T         Y           
LOGFSLIH DS    CL8                                                              
LOGFSLI  DS    CL58    13   21   58   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL18    14    2   18   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL58    14   21   58   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL18    15    2   18   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL58    15   21   58   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL18    16    2   18   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL58    16   21   58   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL18    17    2   18   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL58    17   21   58   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL18    18    2   18   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL58    18   21   58   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL18    19    2   18   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL58    19   21   58   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL18    20    2   18   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL58    20   21   58   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL18    21    2   18   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL58    21   21   58   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL18    22    2   18   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL58    22   21   58   A    P    N         T         Y           
LOGPAGWH DS    CL8                                                              
LOGPAGW  DS    CL18    23    2   18   A    P    N         T         Y           
LOGPAGOH DS    CL8                                                              
LOGPAGO  DS    CL58    23   21   58   A    P    N         T         Y           
LOGTOTWH DS    CL8                                                              
LOGTOTW  DS    CL18    24    2   18   A    P    N         T         Y           
LOGTOTOH DS    CL8                                                              
LOGTOTO  DS    CL58    24   21   58   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     24   80    1   A    P    N         T         Y           
LOGLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LOGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1501 BYTES                            
