*          DATA SET ACLFMDBD   AT LEVEL 016 AS OF 02/19/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603DBD      DATE 02/19/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    H         T        Y              
CHGOFFH  DS    CL8                                                              
CHGOFF   DS    CL2      6   15    2  A   U    N         T    I   Y              
CHGONAMH DS    CL8                                                              
CHGONAM  DS    CL36     6   24   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  A   P    H         T        Y              
CHGDEPH  DS    CL8                                                              
CHGDEP   DS    CL3      7   15    3  A   U    N         T        Y              
CHGDNAMH DS    CL8                                                              
CHGDNAM  DS    CL36     7   24   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      8    2    8  A   P    H         T        Y              
CHGSDH   DS    CL8                                                              
CHGSD    DS    CL2      8   15    2  A   U    N         T        Y              
CHGSNAMH DS    CL8                                                              
CHGSNAM  DS    CL36     8   24   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      9    2    8  A   P    H         T        Y              
CHGSTAH  DS    CL8                                                              
CHGSTA   DS    CL7      9   15    7  A   U    N         T        Y              
CHGSTNOH DS    CL8                                                              
CHGSTNO  DS    CL36     9   24   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9     10    2    9  A   P    H         T        Y              
CHGTASKH DS    CL8                                                              
CHGTASK  DS    CL2     10   15    2  A   U    N         T        Y              
CHGTNAMH DS    CL8                                                              
CHGTNAM  DS    CL15    10   24   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     11    2    6  A   P    H         T        Y              
CHGCOFH  DS    CL8                                                              
CHGCOF   DS    CL2     11   15    2  A   U    N         T        Y              
CHGCONMH DS    CL8                                                              
CHGCONM  DS    CL36    11   24   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     12    2    6  A   P    H         T        Y              
CHGCLIH  DS    CL8                                                              
CHGCLI   DS    CL3     12   15    3  A   U    N         T        Y              
CHGCNAMH DS    CL8                                                              
CHGCNAM  DS    CL36    12   24   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     13    2    7  A   P    H         T        Y              
CHGPROH  DS    CL8                                                              
CHGPRO   DS    CL3     13   15    3  A   U    N         T        Y              
CHGPNAMH DS    CL8                                                              
CHGPNAM  DS    CL36    13   24   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL36    14   16   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     15    6    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     15   18    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     15   31    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     15   43    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     15   56    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     15   68    4  A   P    N         T        Y              
CHGDAT1H DS    CL8                                                              
CHGDAT1  DS    CL8     16    6    8  A   U    N         T        Y              
CHGRAT1H DS    CL8                                                              
CHGRAT1  DS    CL7     16   18    7  A   U    N         T        Y              
CHGSEQ1H DS    CL8                                                              
CHGSEQ1  DS    CL1     16   27    1  N   P    N         N        Y              
CHGDAT2H DS    CL8                                                              
CHGDAT2  DS    CL8     16   31    8  A   U    N         T        Y              
CHGRAT2H DS    CL8                                                              
CHGRAT2  DS    CL7     16   43    7  A   U    N         T        Y              
CHGSEQ2H DS    CL8                                                              
CHGSEQ2  DS    CL1     16   52    1  N   P    N         N        Y              
CHGDAT3H DS    CL8                                                              
CHGDAT3  DS    CL8     16   56    8  A   U    N         T        Y              
CHGRAT3H DS    CL8                                                              
CHGRAT3  DS    CL7     16   68    7  A   U    N         T        Y              
CHGSEQ3H DS    CL8                                                              
CHGSEQ3  DS    CL1     16   77    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     17    6    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17   18    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   27    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     17   31    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17   43    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   52    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     17   56    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     17   68    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   77    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     18    6    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18   18    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   27    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     18   31    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18   43    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   52    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     18   56    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     18   68    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   77    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     19    6    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19   18    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   27    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     19   31    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19   43    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   52    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     19   56    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     19   68    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   77    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     20    6    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     20   18    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   27    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     20   31    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     20   43    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   52    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     20   56    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     20   68    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   77    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     21    6    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21   18    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   27    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     21   31    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21   43    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   52    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     21   56    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     21   68    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   77    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     22    6    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     22   18    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22   27    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     22   31    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     22   43    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22   52    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     22   56    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     22   68    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22   77    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     23    6    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     23   18    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23   27    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     23   31    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     23   43    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23   52    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     23   56    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     23   68    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23   77    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     24    6    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     24   18    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     24   27    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     24   31    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     24   43    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     24   52    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     24   56    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     24   68    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     24   77    1  N   P    N         N        Y              
CHGENDH  DS    CL8                                                              
CHGEND   DS    CL1     24   79    1  A   U    N         T        Y              
CHGLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
CHGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1760 BYTES                            
