*          DATA SET ACLFMCCD   AT LEVEL 001 AS OF 06/21/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603CCD      DATE 06/21/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL15     6    2   15  L  P N             T        Y              
LOGDATEH DS    CL8                                                              
LOGDATE  DS    CL8      6   19    8  A  U N             T    I   Y              
LOGPRHDH DS    CL8                                                              
LOGPRHD  DS    CL8      6   32    8  L  P N             T        Y              
LOGPRVH  DS    CL8                                                              
LOGPRV   DS    CL2      6   42    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15     7    2   15  L  P N             T        Y              
LOGREGH  DS    CL8                                                              
LOGREG   DS    CL12     7   19   12  A  U N             T        Y              
LOGOFHDH DS    CL8                                                              
LOGOFHD  DS    CL6      7   32    6  L  P N             T        Y              
LOGOFFH  DS    CL8                                                              
LOGOFF   DS    CL2      7   40    2  A  U N             T        Y              
LOGOFNMH DS    CL8                                                              
LOGOFNM  DS    CL36     7   44   36  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      9    4    4  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL10     9    9   10  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL12     9   21   12  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL36     9   35   36  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      9   73    6  L  P H             T        Y              
LOGIPL1H DS    CL8                                                              
LOGIPL1  DS    CL1     10    2    1  A  P H             T        Y              
LOGVTCDH DS    CL8                                                              
LOGVTCD  DS    CL2     10    5    2  A  U N             T        Y              
LOGTYPEH DS    CL8                                                              
LOGTYPE  DS    CL10    10    9   10  L  U N             T        Y              
LOGACCDH DS    CL8                                                              
LOGACCD  DS    CL12    10   21   12  A  U N             T        Y              
LOGACNMH DS    CL8                                                              
LOGACNM  DS    CL36    10   35   36  A  U N             T        Y              
LOGRATEH DS    CL8                                                              
LOGRATE  DS    CL6     10   73    6  A  U N             T        Y              
LOGIPL2H DS    CL8                                                              
LOGIPL2  DS    CL1     11    2    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     11    5    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    11    9   10  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    11   21   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    11   35   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   73    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12    2    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     12    5    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    12    9   10  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    12   21   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    12   35   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   73    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13    2    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     13    5    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    13    9   10  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    13   21   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    13   35   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   73    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14    2    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     14    5    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    14    9   10  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    14   21   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    14   35   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   73    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15    2    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     15    5    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    15    9   10  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   21   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    15   35   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   73    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16    2    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     16    5    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    16    9   10  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    16   21   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    16   35   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   73    6  A  U N             T        Y              
LOGOPHDH DS    CL8                                                              
LOGOPHD  DS    CL4     17    4    4  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL11    17    9   11  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL12    17   21   12  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL36    17   35   36  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL6     17   73    6  L  P H             T        Y              
LOGOPL1H DS    CL8                                                              
LOGOPL1  DS    CL1     18    2    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     18    5    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    18    9   10  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    18   21   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    18   35   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   73    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19    2    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     19    5    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    19    9   10  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    19   21   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    19   35   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   73    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20    2    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     20    5    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    20    9   10  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    20   21   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    20   35   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   73    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21    2    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     21    5    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    21    9   10  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    21   21   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    21   35   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   73    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22    2    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     22    5    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    22    9   10  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    22   21   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    22   35   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   73    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23    2    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     23    5    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    23    9   10  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    23   21   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    23   35   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   73    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     24    2    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     24    5    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    24    9   10  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    24   21   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    24   35   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     24   73    6  A  U N             T        Y              
LOGLAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
LOGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2008 BYTES                            
