*          DATA SET ACLFMDED   AT LEVEL 016 AS OF 10/25/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603DED      DATE 10/25/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
HSTACCTH DS    XL8                                                              
HSTACCT  DS    CL14     6   10   14  A  U N             T    I   Y              
HSTACNMH DS    XL8                                                              
HSTACNM  DS    CL36     6   27   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
HSTOFFCH DS    XL8                                                              
HSTOFFC  DS    CL2      7   10    2  A  U N             T        Y              
HSTOFNMH DS    XL8                                                              
HSTOFNM  DS    CL36     7   27   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      8    2    6  A  P N             T        Y              
HSTCONTH DS    XL8                                                              
HSTCONT  DS    CL14     8   10   14  A  U N             T        Y              
HSTCTNMH DS    XL8                                                              
HSTCTNM  DS    CL36     8   27   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
HSTPERDH DS    XL8                                                              
HSTPERD  DS    CL13     9   10   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL4      9   27    4  A  P N             T        Y              
HSTTYPEH DS    XL8                                                              
HSTTYPE  DS    CL1      9   32    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   40    8  A  P N             T        Y              
HSTPASSH DS    XL8                                                              
HSTPASS  DS    CL6      9   50    6  A  U Z             T        Y              
HSTINFOH DS    XL8                                                              
HSTINFO  DS    CL20     9   58   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     10   27    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10   47    7  A  P N             T        Y              
HSTLIN1H DS    XL8                                                              
HSTLIN1  DS    CL13    11    2   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    11   20   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    11   40   17  A  U N             T        Y              
HSTLIN2H DS    XL8                                                              
HSTLIN2  DS    CL13    12    2   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    12   20   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    12   40   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    13    2   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    13   20   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    13   40   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    14    2   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    14   20   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    14   40   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    15    2   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    15   20   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    15   40   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    16    2   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    16   20   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    16   40   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    17    2   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    17   20   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    17   40   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    18    2   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    18   20   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    18   40   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    19    2   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    19   20   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    19   40   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    20    2   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    20   20   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    20   40   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    21    2   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    21   20   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    21   40   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    22    2   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    22   20   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    22   40   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    23    2   13  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    23   20   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    23   40   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13    24    2   13  A  P N             T        Y              
HSTRCDRH DS    XL8                                                              
HSTRCDR  DS    CL17    24   20   17  A  P N             T        Y              
HSTRCCRH DS    XL8                                                              
HSTRCCR  DS    CL17    24   40   17  A  P N             T        Y              
HSTRCBAH DS    XL8                                                              
HSTRCBA  DS    CL17    24   60   17  A  P N             T        Y              
HSTLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
HSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1400 BYTES                            
