*          DATA SET ACLFMEBD   AT LEVEL 003 AS OF 09/22/86                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603EBD      DATE 09/22/86                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      6    2    4  A   P    N         T        Y              
LOGINPH  DS    CL8                                                              
LOGINP   DS    CL4      6    9    4  A   U    N         T    I   Y              
         DS    CL8                                                              
         DS    CL6      6   18    6  A   P    N         T        Y              
LOGSTUSH DS    CL8                                                              
LOGSTUS  DS    CL4      6   26    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      6   41    6  A   P    N         T        Y              
LOGFILTH DS    CL8                                                              
LOGFILT  DS    CL7      6   49    7  A   U    N         T        Y              
LOGRPTH  DS    CL8                                                              
LOGRPT   DS    CL1      6   66    1  A   U    N    M    T        Y              
         DS    CL8                                                              
         DS    CL44     8    2   44  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL32     8   48   32  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      9   19    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL39     9   41   39  A   P    N         T        Y              
LOGLINEH DS    CL8                                                              
LOGLINE  DS    CL79    11    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    12    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    13    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    14    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    15    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    16    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    17    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    18    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    19    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    20    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    21    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    22    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    23    2   79  A   P    N         T        Y              
LOGTOTH  DS    CL8                                                              
LOGTOT   DS    CL79    24    2   79  A   P    N         T        Y              
LOGLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LOGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1460 BYTES                            
