*          DATA SET ACLFME1D   AT LEVEL 012 AS OF 01/29/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603E1D      DATE 01/29/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     6    2   11  A  P H             T        Y              
LOGLEDGH DS    CL8                                                              
LOGLEDG  DS    CL1      6   21    1  A  U N             T    I   Y              
LOGLNAMH DS    CL8                                                              
LOGLNAM  DS    CL36     6   36   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12     7    2   12  A  P H             T        Y              
LOGACCH  DS    CL8                                                              
LOGACC   DS    CL12     7   21   12  A  U N             T        Y              
LOGNMDSH DS    CL8                                                              
LOGNMDS  DS    CL12     9    2   12  A  P H             T        Y              
LOGANAMH DS    CL8                                                              
LOGANAM  DS    CL36     9   21   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    10    2   14  A  P N             T        Y              
LOGSECH  DS    CL8                                                              
LOGSEC   DS    CL3     10   21    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    12    3   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     12   34    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL17    12   41   17  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12   71    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12   75    3  A  P N             T        Y              
LOGACCSH DS    CL8                                                              
LOGACCS  DS    CL29    14    3   29  A  U N             T        Y              
LOGFLTH  DS    CL8                                                              
LOGFLT   DS    CL5     14   34    5  A  U N             T        Y              
LOGCONSH DS    CL8                                                              
LOGCONS  DS    CL29    14   41   29  A  U N             T        Y              
LOGTYPEH DS    CL8                                                              
LOGTYPE  DS    CL1     14   72    1  A  U N             T        Y              
LOGACTNH DS    CL8                                                              
LOGACTN  DS    CL1     14   76    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    15    3   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15   34    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    15   41   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   72    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   76    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    16    3   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   34    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    16   41   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   72    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   76    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    17    3   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   34    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    17   41   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   72    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   76    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    18    3   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18   34    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    18   41   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   72    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   76    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    19    3   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19   34    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    19   41   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   72    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   76    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    20    3   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20   34    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    20   41   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   72    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   76    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    21    3   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21   34    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    21   41   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   72    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   76    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    22    3   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     22   34    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    22   41   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   72    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   76    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    23    3   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     23   34    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL29    23   41   29  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   72    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   76    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   78    1  A  U N             T        Y              
LOGLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LOGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1352 BYTES                            
