*          DATA SET ACLFMD4D   AT LEVEL 017 AS OF 05/17/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603D4D      DATE 05/17/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL10     6    2   10  A   P    H         T        Y              
LOGCODEH DS    CL8                                                              
LOGCODE  DS    CL2      6   22    2  A   U    N         T    I   Y              
         DS    CL8                                                              
         DS    CL11     8    2   11  A   P    H         T        Y              
LOGDESCH DS    CL8                                                              
LOGDESC  DS    CL12     8   22   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL18     9    2   18  A   P    H         T        Y              
LOGCOMH  DS    CL8                                                              
LOGCOM   DS    CL14     9   22   14  A   U    N         T        Y              
LOGCOMNH DS    CL8                                                              
LOGCOMN  DS    CL36     9   41   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL18    10    2   18  A   P    H         T        Y              
LOGCSDH  DS    CL8                                                              
LOGCSD   DS    CL14    10   22   14  A   U    N         T        Y              
LOGCSDNH DS    CL8                                                              
LOGCSDN  DS    CL36    10   41   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL18    11    2   18  A   P    H         T        Y              
LOGLSDH  DS    CL8                                                              
LOGLSD   DS    CL14    11   22   14  A   U    N         T        Y              
LOGLSDNH DS    CL8                                                              
LOGLSDN  DS    CL36    11   41   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL18    12    2   18  A   P    H         T        Y              
LOGCSRH  DS    CL8                                                              
LOGCSR   DS    CL14    12   22   14  A   U    N         T        Y              
LOGCSRNH DS    CL8                                                              
LOGCSRN  DS    CL36    12   41   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL18    13    2   18  A   P    H         T        Y              
LOGCCRH  DS    CL8                                                              
LOGCCR   DS    CL14    13   22   14  A   U    N         T        Y              
LOGCCRNH DS    CL8                                                              
LOGCCRN  DS    CL36    13   41   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL19    14    2   19  A   P    H         T        Y              
LOGMEDH  DS    CL8                                                              
LOGMED   DS    CL14    14   22   14  A   U    N         T        Y              
LOGMEDNH DS    CL8                                                              
LOGMEDN  DS    CL36    14   41   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL19    15    2   19  A   P    H         T        Y              
LOGONLH  DS    CL8                                                              
LOGONL   DS    CL14    15   22   14  A   U    N         T        Y              
LOGONLNH DS    CL8                                                              
LOGONLN  DS    CL36    15   41   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    16    2   16  A   P    H         T        Y              
LOGANLH  DS    CL8                                                              
LOGANL   DS    CL12    16   22   12  A   U    N         T        Y              
LOGLSTH  DS    CL8                                                              
LOGLST   DS    CL1     17    2    1  A   U    N         T        Y              
LOGLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LOGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 776  BYTES                            
