*          DATA SET ACLFMFBD   AT LEVEL 002 AS OF 09/30/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603FBD      DATE 09/30/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      6    2    9   A    P    H         T         Y           
LOGUNITH DS    CL8                                                              
LOGUNIT  DS    CL3      6   18    3   A    U    N         T    I    Y           
LOGUNAMH DS    CL8                                                              
LOGUNAM  DS    CL36     6   36   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL11     7    2   11   A    P    N         T         Y           
LOGLEDGH DS    CL8                                                              
LOGLEDG  DS    CL3      7   18    3   A    U    N         T         Y           
LOGLNAMH DS    CL8                                                              
LOGLNAM  DS    CL36     7   36   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL12     8    2   12   A    P    N         T         Y           
LOGACCH  DS    CL8                                                              
LOGACC   DS    CL12     8   18   12   A    U    N         T         Y           
LOGANAMH DS    CL8                                                              
LOGANAM  DS    CL36     8   36   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL14     9    2   14   A    P    N         T         Y           
LOGCNTH  DS    CL8                                                              
LOGCNT   DS    CL15     9   18   15   A    U    N         T         Y           
LOGCNAMH DS    CL8                                                              
LOGCNAM  DS    CL36     9   36   36   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL11    10    2   11   A    P    N         T         Y           
LOGSTRTH DS    CL8                                                              
LOGSTRT  DS    CL6     10   18    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL9     11    2    9   A    P    N         T         Y           
LOGENDH  DS    CL8                                                              
LOGEND   DS    CL6     11   18    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL14    12    2   14   A    P    H         T         Y           
LOGTYPEH DS    CL8                                                              
LOGTYPE  DS    CL1     12   18    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL16    12   36   16   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL13    13    2   13   A    P    H         T         Y           
LOGAMNTH DS    CL8                                                              
LOGAMNT  DS    CL12    13   18   12   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     14    2    6   A    P    N         T         Y           
LOGOPTH  DS    CL8                                                              
LOGOPT   DS    CL12    14   18   12   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     15   18    1   A    U    N         T         Y           
LOGLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LOGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 525  BYTES                            
