*          DATA SET ACLFMF5D   AT LEVEL 001 AS OF 07/21/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603F5D      DATE 07/21/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     6    2   11  A   P    H         T        Y              
LOGCLIH  DS    CL8                                                              
LOGCLI   DS    CL6      6   22    6  A   U    N         T    I   Y              
LOGCNAMH DS    CL8                                                              
LOGCNAM  DS    CL36     6   42   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12     7    2   12  A   P    H         T        Y              
LOGPRODH DS    CL8                                                              
LOGPROD  DS    CL6      7   22    6  A   U    N         T        Y              
LOGPNAMH DS    CL8                                                              
LOGPNAM  DS    CL36     7   42   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10     8    2   10  A   P    H         T        Y              
LOGJOBH  DS    CL8                                                              
LOGJOB   DS    CL6      8   22    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      9    2    8  A   P    H         T        Y              
LOGJNAMH DS    CL8                                                              
LOGJNAM  DS    CL36     9   22   36  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    10    2   12  A   P    H         T        Y              
LOGCLOSH DS    CL8                                                              
LOGCLOS  DS    CL17    10   22   17  A   U    N         T        Y              
LOGSTATH DS    CL8                                                              
LOGSTAT  DS    CL36    10   42   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    11    2   17  A   P    N         T        Y              
LOGUNITH DS    CL8                                                              
LOGUNIT  DS    CL1     11   22    1  A   P    N         T        Y              
LOGUNAMH DS    CL8                                                              
LOGUNAM  DS    CL36    11   42   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    12    2   12  A   P    N         T        Y              
LOGTYPEH DS    CL8                                                              
LOGTYPE  DS    CL12    12   22   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL18    12   42   18  A   P    N         T        Y              
LOGNONBH DS    CL8                                                              
LOGNONB  DS    CL17    12   61   17  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL18    13    2   18  A   P    N         T        Y              
LOGRECVH DS    CL8                                                              
LOGRECV  DS    CL15    13   22   15  A   U    N         T        Y              
LOGRNAMH DS    CL8                                                              
LOGRNAM  DS    CL36    13   42   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL16    14    2   16  A   P    N         T        Y              
LOGCOSTH DS    CL8                                                              
LOGCOST  DS    CL15    14   22   15  A   U    N         T        Y              
LOGCSTNH DS    CL8                                                              
LOGCSTN  DS    CL36    14   42   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL14    15    2   14  A   P    N         T        Y              
LOGPRNTH DS    CL8                                                              
LOGPRNT  DS    CL50    15   22   50  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17    16    2   17  A   P    N         T        Y              
LOGINF1H DS    CL8                                                              
LOGINF1  DS    CL50    16   22   50  A   U    N         T        Y              
LOGINF2H DS    CL8                                                              
LOGINF2  DS    CL50    17   22   50  A   U    N         T        Y              
LOGINF3H DS    CL8                                                              
LOGINF3  DS    CL50    18   22   50  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL16    19    2   16  A   P    N         T        Y              
LOGPRFH  DS    CL8                                                              
LOGPRF   DS    CL50    19   22   50  A   U    N         T        Y              
LOGPR2H  DS    CL8                                                              
LOGPR2   DS    CL50    20   22   50  A   U    N         T        Y              
LOGPR3H  DS    CL8                                                              
LOGPR3   DS    CL50    21   22   50  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    22    2   12  A   P    N         T        Y              
LOGCOM1H DS    CL8                                                              
LOGCOM1  DS    CL50    22   22   50  A   U    N         T        Y              
LOGCOM2H DS    CL8                                                              
LOGCOM2  DS    CL50    23   22   50  A   U    N         T        Y              
LOGCOM3H DS    CL8                                                              
LOGCOM3  DS    CL50    24   22   50  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     24   75    1  A   U    N         T        Y              
LOGLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LOGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1372 BYTES                            
