*          DATA SET ACLFMEDD   AT LEVEL 002 AS OF 09/30/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603EDD      DATE 09/30/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL14     6    2   14   A    P    N         T         Y           
COMNUMH  DS    CL8                                                              
COMNUM   DS    CL6      6   17    6   A    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL12     8    2   12   A    P    N         T         Y           
COMFRSTH DS    CL8                                                              
COMFRST  DS    CL72     9    2   72   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL72    10    2   72   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL72    11    2   72   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL72    12    2   72   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL72    13    2   72   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL72    14    2   72   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL72    15    2   72   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL72    16    2   72   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL72    17    2   72   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL72    18    2   72   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL72    19    2   72   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL72    20    2   72   A    U    N         T         N           
COMTABH  DS    CL8                                                              
COMTAB   DS    CL1     21    2    1   A    U    N         T         Y           
COMLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
COMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1028 BYTES                            
