*          DATA SET ACLFMF2D   AT LEVEL 023 AS OF 02/19/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603F2D      DATE 02/19/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      7    2    6  A   P    H         T        Y              
AJROFFH  DS    CL8                                                              
AJROFF   DS    CL3      7   15    3  A   U    N         T    I   Y              
AJRONAMH DS    CL8                                                              
AJRONAM  DS    CL36     7   24   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6      8    2    6  A   P    H         T        Y              
AJRCLIH  DS    CL8                                                              
AJRCLI   DS    CL3      8   15    3  A   U    N         T        Y              
AJRCNAMH DS    CL8                                                              
AJRCNAM  DS    CL36     8   24   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    H         T        Y              
AJRPROH  DS    CL8                                                              
AJRPRO   DS    CL3      9   15    3  A   U    N         T        Y              
AJRPNAMH DS    CL8                                                              
AJRPNAM  DS    CL36     9   24   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   P    H         T        Y              
AJRJOBH  DS    CL8                                                              
AJRJOB   DS    CL6     10   15    6  A   U    N         T        Y              
AJRJNAMH DS    CL8                                                              
AJRJNAM  DS    CL36    10   24   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     11    2    6  A   P    H         T        Y              
AJRDOFH  DS    CL8                                                              
AJRDOF   DS    CL2     11   15    2  A   U    N         T        Y              
AJRDONMH DS    CL8                                                              
AJRDONM  DS    CL36    11   24   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     12    2    4  A   P    H         T        Y              
AJRDEPH  DS    CL8                                                              
AJRDEP   DS    CL3     12   15    3  A   U    N         T        Y              
AJRDNAMH DS    CL8                                                              
AJRDNAM  DS    CL36    12   24   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     13    2    8  A   P    H         T        Y              
AJRSDH   DS    CL8                                                              
AJRSD    DS    CL2     13   15    2  A   U    N         T        Y              
AJRSNAMH DS    CL8                                                              
AJRSNAM  DS    CL36    13   24   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     14    2    8  A   P    H         T        Y              
AJRSTAH  DS    CL8                                                              
AJRSTA   DS    CL7     14   15    7  A   U    N         T        Y              
AJRSTNOH DS    CL8                                                              
AJRSTNO  DS    CL36    14   24   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9     15    2    9  A   P    H         T        Y              
AJRTASKH DS    CL8                                                              
AJRTASK  DS    CL2     15   15    2  A   U    N         T        Y              
AJRTNAMH DS    CL8                                                              
AJRTNAM  DS    CL15    15   24   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL40    16   19   40  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     17    2    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     17   14    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     17   27    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     17   39    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8     17   52    8  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     17   64    4  A   P    N         T        Y              
AJRDAT1H DS    CL8                                                              
AJRDAT1  DS    CL8     18    2    8  A   U    N         T        Y              
AJRRAT1H DS    CL8                                                              
AJRRAT1  DS    CL9     18   12    9  A   U    N         T        Y              
AJRSEQ1H DS    CL8                                                              
AJRSEQ1  DS    CL1     18   24    1  N   P    N         N        Y              
AJRDAT2H DS    CL8                                                              
AJRDAT2  DS    CL8     18   27    8  A   U    N         T        Y              
AJRRAT2H DS    CL8                                                              
AJRRAT2  DS    CL9     18   37    9  A   U    N         T        Y              
AJRSEQ2H DS    CL8                                                              
AJRSEQ2  DS    CL1     18   49    1  N   P    N         N        Y              
AJRDAT3H DS    CL8                                                              
AJRDAT3  DS    CL8     18   52    8  A   U    N         T        Y              
AJRRAT3H DS    CL8                                                              
AJRRAT3  DS    CL9     18   62    9  A   U    N         T        Y              
AJRSEQ3H DS    CL8                                                              
AJRSEQ3  DS    CL1     18   74    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     19    2    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     19   12    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   24    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     19   27    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     19   37    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   49    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     19   52    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     19   62    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   74    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     20    2    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     20   12    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   24    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     20   27    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     20   37    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   49    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     20   52    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     20   62    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   74    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     21    2    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     21   12    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   24    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     21   27    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     21   37    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   49    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     21   52    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     21   62    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   74    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     22    2    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     22   12    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22   24    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     22   27    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     22   37    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22   49    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     22   52    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     22   62    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     22   74    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     23    2    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     23   12    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23   24    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     23   27    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     23   37    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23   49    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     23   52    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     23   62    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23   74    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     24    2    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     24   12    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     24   24    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     24   27    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     24   37    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     24   49    1  N   P    N         N        Y              
         DS    CL8                                                              
         DS    CL8     24   52    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9     24   62    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     24   74    1  N   P    N         N        Y              
AJRENDH  DS    CL8                                                              
AJREND   DS    CL1     24   79    1  A   U    N         T        Y              
AJRLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
AJRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1640 BYTES                            
