*          DATA SET ACLFME7D   AT LEVEL 003 AS OF 08/06/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603E7D      DATE 08/06/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      6    2    9  A  P H             T        Y              
LOGLCODH DS    CL8                                                              
LOGLCOD  DS    CL5      6   14    5  A  U N             T    I   Y              
LOGLNM1H DS    CL8                                                              
LOGLNM1  DS    CL9      8    2    9  A  P H             T        Y              
LOGLNAMH DS    CL8                                                              
LOGLNAM  DS    CL36     8   14   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     9    2   11  A  P N             T        Y              
LOGLDATH DS    CL8                                                              
LOGLDAT  DS    CL11     9   14   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     11    2    9  A  P H             T        Y              
LOGLYN1H DS    CL8                                                              
LOGLYN1  DS    CL66    11   14   66  A  U N             T        Y              
LOGLYN2H DS    CL8                                                              
LOGLYN2  DS    CL66    12   14   66  A  U N             T        Y              
LOGLYN3H DS    CL8                                                              
LOGLYN3  DS    CL66    13   14   66  A  U N             T        Y              
LOGLYN4H DS    CL8                                                              
LOGLYN4  DS    CL66    14   14   66  A  U N             T        Y              
LOGLYN5H DS    CL8                                                              
LOGLYN5  DS    CL66    15   14   66  A  U N             T        Y              
LOGLYN6H DS    CL8                                                              
LOGLYN6  DS    CL66    16   14   66  A  U N             T        Y              
LOGLYN7H DS    CL8                                                              
LOGLYN7  DS    CL66    17   14   66  A  U N             T        Y              
LOGLYN8H DS    CL8                                                              
LOGLYN8  DS    CL66    18   14   66  A  U N             T        Y              
LOGLYN9H DS    CL8                                                              
LOGLYN9  DS    CL66    19   14   66  A  U N             T        Y              
LOGLYNAH DS    CL8                                                              
LOGLYNA  DS    CL66    20   14   66  A  U N             T        Y              
LOGLYNBH DS    CL8                                                              
LOGLYNB  DS    CL66    21   14   66  A  U N             T        Y              
LOGLYNCH DS    CL8                                                              
LOGLYNC  DS    CL66    22   14   66  A  U N             T        Y              
LOGLYNDH DS    CL8                                                              
LOGLYND  DS    CL66    23   14   66  A  U N             T        Y              
LOGLYNEH DS    CL8                                                              
LOGLYNE  DS    CL60    24   14   60  A  U N             T        Y              
LOGTAB2H DS    CL8                                                              
LOGTAB2  DS    CL1     24   76    1  A  U N             T        Y              
LOGLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
LOGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1192 BYTES                            
