*          DATA SET ACLFMCED   AT LEVEL 016 AS OF 10/17/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603CED      DATE 10/17/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      6    2    4  A  P H             T        Y              
LOGUNITH DS    CL8                                                              
LOGUNIT  DS    CL1      6   18    1  A  U N             T    I   Y              
LOGUNAMH DS    CL8                                                              
LOGUNAM  DS    CL36     6   21   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
LOGLEDGH DS    CL8                                                              
LOGLEDG  DS    CL1      7   18    1  A  U N             T        Y              
LOGLNAMH DS    CL8                                                              
LOGLNAM  DS    CL36     7   21   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13     8    2   13  A  P H             T        Y              
LOGSACCH DS    CL8                                                              
LOGSACC  DS    CL12     8   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     9    2   12  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5      9   16    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      9   26    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL12     9   43   12  A  P H             T        Y              
LOGFACCH DS    CL8                                                              
LOGFACC  DS    CL12    10    2   12  A  P N             T        Y              
LOGTULH  DS    CL8                                                              
LOGTUL   DS    CL2     10   19    2  A  U N             T        Y              
LOGTACCH DS    CL8                                                              
LOGTACC  DS    CL12    10   26   12  A  U N             T        Y              
LOGTNAMH DS    CL8                                                              
LOGTNAM  DS    CL36    10   43   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    11    2   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   19    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    11   26   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    11   43   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    12    2   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   19    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    12   26   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    12   43   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    13    2   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   19    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    13   26   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    13   43   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    14    2   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   19    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    14   26   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    14   43   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    15    2   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   19    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   26   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    15   43   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    16    2   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   19    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    16   26   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    16   43   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    17    2   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   19    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    17   26   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    17   43   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    18    2   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   19    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    18   26   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    18   43   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    19    2   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   19    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    19   26   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    19   43   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    20    2   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   19    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    20   26   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    20   43   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    21    2   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   19    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    21   26   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    21   43   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    22    2   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   19    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    22   26   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    22   43   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    23    2   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     23   19    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    23   26   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    23   43   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL28    24   20   28  A  P N             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1600 BYTES                            
