*          DATA SET ACLFME5D   AT LEVEL 002 AS OF 09/30/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T603E5D      DATE 09/30/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
LOGGRPLH DS    CL8                                                              
LOGGRPL  DS    CL13    19    2   13   A    P    N         T         Y           
LOGGRUPH DS    CL8                                                              
LOGGRUP  DS    CL3     19   16    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL13    20    2   13   A    P    N         T         Y           
LOGADD1H DS    CL8                                                              
LOGADD1  DS    CL26    20   16   26   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL5     21   10    5   A    P    N         T         Y           
LOGADD2H DS    CL8                                                              
LOGADD2  DS    CL26    21   16   26   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL5     22   10    5   A    P    N         T         Y           
LOGADD3H DS    CL8                                                              
LOGADD3  DS    CL26    22   16   26   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL5     23   10    5   A    P    N         T         Y           
LOGADD4H DS    CL8                                                              
LOGADD4  DS    CL26    23   16   26   A    U    N         T         Y           
LOGNUMLH DS    CL8                                                              
LOGNUML  DS    CL13    24    2   13   A    P    N         T         Y           
LOGNUMBH DS    CL8                                                              
LOGNUMB  DS    CL50    24   16   50   A    U    N         T         Y           
LOGCTABH DS    CL8                                                              
LOGCTAB  DS    CL1     24   68    1   A    U    N         T         Y           
LOGLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
LOGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 319  BYTES                            
