*          DATA SET ACMAPFILE  AT LEVEL 065 AS OF 10/24/00                      
*++TYPE KEY                                                                     
*++PROCESS OFF                                                                  
DD#DISK  EQU   32768                                                            
         SPACE 1                                                                
ACCORLEN EQU   42                  DISP. TO RECORD LENGTH ON OLD FILE           
ACCOSTAT EQU   44                  DISP. TO RECORD STATUS ON OLD FILE           
ACCOUSED EQU   45                  DISP. TO ACDTUSED ON OLD FILE                
ACCOPEEL EQU   47                  DISP. TO ACDTPEEL ON OLD FILE                
ACCORFST EQU   49                  DISP. TO FIRST ELEMENT ON OLD FILE           
ACCOULEN EQU   2                   LENGTH OF ACDTUSED ON OLD FILE               
ACCOPLEN EQU   2                   LENGTH OF ACDTPEEL ON OLD FILE               
         SPACE 1                                                                
ACCRECD  DSECT                     ** GENERAL RECORD DSECT **                   
ACCKEY   DS    XL42                                                             
ACCKSTA  DS    XL8                 KEY STATUS                                   
ACCKDA   DS    XL4                 DISK ADDRESS                                 
ACCKLEN  EQU   *-ACCRECD           LENGTH OF DIRECTORY RECORD                   
         ORG   ACCKSTA                                                          
ACCRLEN  DS    XL2                 RECORD LENGTH                                
ACCRSTA  DS    XL8                 RECORD STATUS                                
ACCRLNK  DS    XL4                 LINKAGE AREA                                 
ACCRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
         SPACE 1                                                                
*++PROCESS ON                                                                   
OFFRECD  DSECT                     ** OFFICE/OFFICE GROUP RECORDS **            
OFFKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
OFFKTYP  DS    XL1                 OFFICE RECORD TYPE                           
OFFKTYPQ EQU   X'01'                                                            
OFFKCPY  DS    XL1                 COMPANY CODE                                 
         DS    XL38                N/D                                          
OFFKOFF  DS    CL2                 OFFICE/OFFICE GROUP CODE                     
         ORG   OFFKCPY+L'OFFKCPY                                                
         DS    XL36                N/D                                          
OFFKOFFC DS    CL2                 OFFICE/OFFICE GROUP CODE                     
OFFKEFDT DS    XL2                 EFFECTIVE DATE (COMPLEMENT)                  
*++PROCESS OFF                                                                  
OFFKEND  EQU   *-OFFKEY                                                         
OFFKSTA  DS    0XL8                KEY STATUS                                   
OFFKSTAT DS    XL1                 OFFICE STATUS                                
OFFKSINC DS    XL2                 NUMBER OF LISTS THIS IS INCLUDED IN          
OFFKSUSE DS    XL2                 NUMBER OF REFERENCES (LEDG/ACC)              
         DS    XL3                 N/D                                          
OFFKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   OFFKSTA                                                          
*++PROCESS ON                                                                   
OFFRLEN  DS    XL2                 RECORD LENGTH                                
OFFRSTA  DS    0XL8                RECORD STATUS                                
OFFRSTAT DS    XL1                 OFFICE STATUS (SEE OFFKSTAT)                 
OFFSLIST EQU   X'40'               OFFICE IS AN OFFICE LIST                     
*        EQU   X'04'               RESERVED FOR ARCHIVE                         
OFFRSINC DS    XL2                 NUMBER OF LISTS THIS IS INCLUDED IN          
OFFRSUSE DS    XL2                 NUMBER OF REFERENCES (LEDG/ACC)              
         DS    XL3                 N/D                                          
OFFRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
OFFRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
*++PROCESS OFF                                                                  
INVPASD  DSECT                     ** INVOICE NUMBER PASSIVE **                 
INVPKEY  DS    0XL42                                                            
INVPTYP  DS    XL1                 RECORD TYPE                                  
INVPTYPQ EQU   X'02'                                                            
INVPCPY  DS    XL1                 COMPANY CODE                                 
INVPLDG  DS    CL1                 LEDGER CODE                                  
INVPACT  DS    CL12                SUPPLIER ACCOUNT CODE                        
INVPINV  DS    CL20                INVOICE NUMBER (SPACE FILLED)                
INVPDAT  DS    PL3                 INVOICE DATE (YMD)                           
INVPDA   DS    XL4                 DISK ADDRESS OF RECORD                       
INVPKSTA DS    XL8                 KEY STATUS                                   
INVPKDA  DS    XL4                 DISK ADDRESS                                 
*++PROCESS ON                                                                   
         SPACE 1                                                                
TBARECD  DSECT                     ** TRANSACTION BATCH RECORDS **              
TBAKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
TBAKTYP  DS    XL1                 TRANSACTION BATCH RECORD TYPE                
TBAKTYPQ EQU   X'03'                                                            
TBAKCPY  DS    XL1                 COMPANY CODE                                 
         DS    XL16                N/D                                          
TBAKUSER DS    XL2                 OWNER USER-ID NUMBER                         
TBAKADDT DS    XL2                 DATE ADDED (COMPRESSED COMPLEMENT)           
TBAKGRUP DS    CL1                 BATCH TYPE GROUP                             
TBAGGENQ EQU   C'G'                GENERAL LEDGER BATCH                         
TBAGPRDQ EQU   C'P'                PRODUCTION BATCH                             
TBAKBTYP DS    XL1                 BATCH TYPE (SEE TRNTYPE)                     
TBAKBMOS DS    PL2                 BATCH MONTH OF SERVICE                       
TBAKBREF DS    CL4                 BATCH REFERENCE CODE                         
TBAKBCHR DS    XL2                 BATCHER NUMBER                               
         DS    XL5                 N/D                                          
TBAKSEQN DS    XL1                 DUPLICATE BATCH SEQUENCE NUMBER              
TBAKOFFC DS    CL2                 OFFICE (FROM LIMIT ACCESS)                   
TBAKTSEQ DS    XL2                 TRANSACTION SEQUENCE (ZERO=HEADER)           
*++PROCESS OFF                                                                  
TBAKEND  EQU   *-TBAKEY                                                         
TBAKLAST EQU   *                                                                
         ORG   TBAKEY              ** BATCH HEADER PASSIVE POINTERS **          
TBAPAS   DS    0XL42                                                            
TBAPTYP  DS    XL1                 BATCH HEADER PASSIVE RECORD TYPE             
TBAPTYPQ EQU   X'04'                                                            
TBAPCPY  DS    XL1                 COMPANY CODE                                 
         DS    XL16                N/D                                          
TBAPUSER DS    XL2                 OWNER USER-ID NUMBER                         
TBAPEFDT DS    XL2                 BATCH EFFECTIVE DATE (YMD OR YM0)            
TBAPGRUP DS    CL1                 BATCH TYPE GROUP                             
TBAPBTYP DS    XL1                 BATCH TYPE (SEE TRNTYPE)                     
TBAPBMOS DS    PL2                 BATCH MONTH OF SERVICE                       
TBAPBREF DS    CL4                 BATCH REFERENCE CODE                         
TBAPBCHR DS    XL2                 BATCHER NUMBER                               
         DS    XL5                 N/D                                          
TBAPSEQN DS    XL1                 DUPLICATE BATCH SEQUENCE NUMBER              
TBAPOFFC DS    CL2                 OFFICE (FROM LIMIT ACCESS)                   
TBAPTSEQ DS    XL2                 TRANSACTION SEQUENCE (ZERO=HEADER)           
TBAPEND  EQU   *-TBAKEY                                                         
TBAPLAST EQU   *                                                                
*++PROCESS ON                                                                   
         ORG   TBAKEY+L'TBAKEY                                                  
*++PROCESS OFF                                                                  
TBAKSTA  DS    0XL8                KEY STATUS                                   
TBAKHSTA DS    XL1                 HEADER STATUS                                
TBAHSDEL EQU   X'80'               BATCH DELETED                                
TBAHSIIP EQU   X'40'               BATCH INPUT IN PROGRESS                      
TBAHSEND EQU   X'20'               BATCH ENDED                                  
TBAHSUPD EQU   X'10'               BATCH UPDATED                                
TBAHSIAD EQU   X'08'               BATCH OPEN FOR IMMEDIATE UPDATE              
*        EQU   X'04'               RESERVED FOR ARCHIVE                         
TBAHSSAV EQU   X'02'               BATCH SAVED                                  
TBAHSAPR EQU   X'01'               BATCH APPROVED                               
TBAHKADT DS    XL2                 DATE BATCH ADDED TO FILE                     
TBAHKEDT DS    XL2                 EFFECTIVE DATE OF BATCH                      
TBAHKUDT DS    XL2                 DATE BATCH UPDATED TO FILE                   
TBAHKIND DS    XL1                 BATCH RECORD INDICATORS                      
TBAHIDEL EQU   X'80'               BATCH DELETED BY DAILY JOURNAL               
TBAHIWRN EQU   X'40'               BATCH DELETION IMMINENT                      
TBAHIUOF EQU   X'20'               BATCH TO BE UPDATED OFFLINE                  
TBAHIMAL EQU   X'10'               BATCH MONTH OF ACTIVITY LOCKED               
TBAHIUSN EQU   X'08'               BATCH WILL BE UPDATED SOON                   
TBAHIAAP EQU   X'04'               BATCH AWAITING APPROVAL                      
TBAHIMLT EQU   X'02'               BATCH SUPPORTS MULTIPLE ITEM/CHANGE          
TBAHIGDJ EQU   X'01'               BATCH GENERATED BY DAILY JOURNAL             
         ORG   TBAKSTA                                                          
TBAKESTA DS    XL1                 ENTRY STATUS                                 
TBAKESCR DS    XL1                 SCREEN OVERLAY NUMBER OR ZERO                
TBAKECFN DS    XL2                 TERMINAL CONTROL FILE NUMBER                 
TBAKETYP DS    XL1                 ENTRY TRANSACTION TYPE                       
TBAKESPG DS    XL1                 ENTRY SUB-PROGRAM NUMBER                     
         DS    XL2                 N/D                                          
TBAKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   TBAKSTA                                                          
*++PROCESS ON                                                                   
TBARLEN  DS    XL2                 RECORD LENGTH                                
TBARSTA  DS    0XL8                RECORD STATUS                                
TBARHSTA DS    XL1                 HEADER STATUS (SEE TBAKHSTA)                 
TBAESDEL EQU   X'80'               ENTRY DELETED                                
TBAESORD EQU   X'40'               ENTRY CARRIES ORDER(S)                       
TBAESIDR EQU   X'20'               ENTRY IS A DEBIT (FOR BT45 ETC.)             
TBAESAUT EQU   X'10'               ENTRY IS AUTO GENERATED BY UPDATE            
TBAESDMD EQU   X'08'               ENTRY IS DEBIT / MINUS DEBIT                 
TBAESCMC EQU   X'02'               ENTRY IS CREDIT / MINUS CREDIT               
TBAESDAC EQU   X'0A'               ENTRY IS DEBIT / CREDIT                      
*        EQU   X'04'               RESERVED FOR ARCHIVE                         
TBAESLDE EQU   X'01'               ENTRY IS LOGICALLY DELETED                   
TBAHRADT DS    XL2                 DATE BATCH ADDED TO FILE                     
TBAHREDT DS    XL2                 EFFECTIVE DATE OF BATCH                      
TBAHRUDT DS    XL2                 DATE BATCH UPDATED TO FILE                   
TBAHRIND DS    XL1                 BATCH RECORD INDICATORS                      
         ORG   TBARSTA                                                          
TBARESTA DS    XL1                 ENTRY STATUS (SEE TBAKESTA)                  
TBARESCR DS    XL1                 SCREEN OVERLAY NUMBER OR ZERO                
TBARECFN DS    XL2                 TERMINAL CONTROL FILE NUMBER                 
TBARETYP DS    XL1                 ENTRY TRANSACTION TYPE                       
TBARESPG DS    XL1                 ENTRY SUB-PROGRAM NUMBER                     
         DS    XL2                 N/D                                          
TBARLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
TBARFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
TAXRECD  DSECT                     ** TAX RULES RECORDS **                      
TAXKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
TAXKTYP  DS    XL1                 TAX RULES RECORD TYPE                        
TAXKTYPQ EQU   X'05'                                                            
TAXKCPY  DS    XL1                 COMPANY CODE                                 
*&&US                                                                           
TAXKPRV  DS    XL2                 PROVINCE                                     
*&&                                                                             
TAXKOFF  DS    XL2                 OFFICE CODE OR X'FFFF'                       
         DS    XL1                 N/D                                          
TAXKDATE DS    PL3                 COMPLEMENT OF PWOS START DATE                
*++PROCESS OFF                                                                  
TAXKEND  EQU   *-TAXKEY                                                         
*++PROCESS ON                                                                   
         ORG   TAXKEY+L'TAXKEY                                                  
*++PROCESS OFF                                                                  
TAXKSTA  DS    0XL8                KEY STATUS AREA                              
TAXKSTAT DS    XL1                 TAX RULE STATUS                              
         ORG   TAXKSTA+L'TAXKSTA                                                
TAXKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   TAXKSTA                                                          
*++PROCESS ON                                                                   
TAXRLEN  DS    XL2                 RECORD LENGTH                                
TAXRSTA  DS    0XL8                RECORD STATUS AREA                           
TAXRSTAT DS    XL1                 TAX RULE STATUS (SEE VALKSTAT)               
TAXSDELT EQU   X'80'               TAX RULE IS DELETED                          
         ORG   TAXRSTA+L'TAXRSTA                                                
TAXRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
TAXRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
BSCRECD  DSECT                     ** BILLING SOURCE RECORDS **                 
BSCKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
BSCKTYP  DS    XL1                 BILLING SOURCE RECORD TYPE                   
BSCKTYPQ EQU   X'06'                                                            
BSCKCPY  DS    XL1                 COMPANY CODE                                 
BSCKEND  EQU   *-BSCKEY                                                         
         ORG   BSCKEY+L'BSCKEY                                                  
*++PROCESS OFF                                                                  
BSCKSTA  DS    0XL8                KEY STATUS AREA                              
BSCKSTAT DS    XL1                 BILLING SOURCE STATUS                        
         ORG   BSCKSTA+L'BSCKSTA                                                
BSCKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   BSCKSTA                                                          
*++PROCESS ON                                                                   
BSCRLEN  DS    XL2                 RECORD LENGTH                                
BSCRSTA  DS    0XL8                RECORD STATUS AREA                           
BSCRSTAT DS    XL1                 BILLING SOURCE STATUS                        
BSCSDELT EQU   X'80'               BILLING SOURCE RECORD IS DELETED             
         ORG   BSCRSTA+L'BSCRSTA                                                
BSCRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
BSCRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
MRHPASD  DSECT                     ** MEDIA RECONCILIATION HOLLAND **           
MRHPKEY  DS    0XL42                                                            
*++IDENTIFIER                                                                   
MRHPTYP  DS    XL1                 RECORD TYPE                                  
MRHPTYPQ EQU   X'07'                                                            
MRHPCPY  DS    XL1                 COMPANY CODE                                 
MRHPMED  DS    0CL1                MEDIA LETTER                                 
MRHPACT  DS    CL12                SZ LEDGER ACCOUNT CODE                       
MRHPSUP  DS    XL3                 MEDIA SUPPLIER NUMBER (BINARY)               
MRHPSER  DS    0XL4                BUY SERIAL NUMBER                            
MRHPSERA DS    CL1                 MEDIA LETTER                                 
MRHPSMIS EQU   X'FF'               BUY RECORD MISSING                           
MRHPSERN DS    XL3                 SERIAL NUMBER                                
MRHPMEDI DS    CL6                 MEDIA INVOICE NUMBER                         
MRHPSEQN DS    XL2                 SEQUENCE NUMBER                              
MRHPTYPE DS    XL1                 POSTING TYPE (SEE MRHTYPE EQUATES)           
MRHPCLIC DS    CL5                 CLIENT CODE                                  
MRHPIREF DS    CL7                 INTERNAL REFERENCE NUMBER                    
         ORG   MRHPASD+L'MRHPKEY                                                
MRHPKSTA DS    XL8                 KEY STATUS                                   
MRHPKDA  DS    XL4                 DISK ADDRESS                                 
         SPACE 1                                                                
MINRECD  DSECT                     ** MEDIA INTERFACE RECORDS **                
MINKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
MINKTYP  DS    XL1                 MEDIA INTERFACE RECORD TYPE                  
MINKTYPQ EQU   X'08'                                                            
MINKCPY  DS    XL1                 COMPANY CODE                                 
MINKMED  DS    CL2                 MEDIA CODE                                   
MINKEND  EQU   *-MINKEY                                                         
         ORG   MINKEY+L'MINKEY                                                  
*++PROCESS OFF                                                                  
MINKSTA  DS    XL8                 KEY STATUS                                   
MINKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   MINKSTA                                                          
*++PROCESS ON                                                                   
MINRLEN  DS    XL2                 RECORD LENGTH                                
MINRSTA  DS    XL8                 RECORD STATUS                                
MINRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
MINRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
PMDRECD  DSECT                     ** PRODUCTION MEDIA RECORDS **               
PMDKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
PMDKTYP  DS    XL1                 MEDIA RECORD TYPE                            
PMDKTYPQ EQU   X'09'                                                            
PMDKCPY  DS    XL1                 COMPANY CODE                                 
PMDKMED  DS    CL1                 MEDIA CODE                                   
PMDKEND  EQU   *-PMDKEY                                                         
         ORG   PMDKEY+L'PMDKEY                                                  
*++PROCESS OFF                                                                  
PMDKSTA  DS    XL8                 KEY STATUS                                   
PMDKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   PMDKSTA                                                          
*++PROCESS ON                                                                   
PMDRLEN  DS    XL2                 RECORD LENGTH                                
PMDRSTA  DS    XL8                 RECORD STATUS                                
PMDRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
PMDRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
WCORECD  DSECT                     ** WORK-CODE RECORDS **                      
WCOKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
WCOKTYP  DS    XL1                 WORK-CODE RECORD TYPE                        
WCOKTYPQ EQU   X'0A'                                                            
WCOKCPY  DS    XL1                 COMPANY CODE                                 
WCOKUNT  DS    CL1                 UNIT CODE                                    
WCOKLDG  DS    CL1                 LEDGER CODE                                  
WCOKWRK  DS    CL2                 WORK-CODE                                    
WCOKEND  EQU   *-WCOKEY                                                         
         ORG   WCOKEY+L'WCOKEY                                                  
*++PROCESS OFF                                                                  
WCOKSTA  DS    XL8                 KEY STATUS                                   
WCOKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   WCOKSTA                                                          
*++PROCESS ON                                                                   
WCORLEN  DS    XL2                 RECORD LENGTH                                
WCORSTA  DS    XL8                 RECORD STATUS                                
WCORLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
WCORFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
BATRECD  DSECT                     ** BATCH RECORDS **                          
BATKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
BATKTYP  DS    XL1                 BATCH RECORD TYPE                            
BATKTYPQ EQU   X'0B'                                                            
BATKCPY  DS    XL1                 COMPANY CODE                                 
         DS    XL1                 BINARY ZERO                                  
BATKOFF  DS    XL2                 OFFICE ID CODE                               
         DS    XL1                 BINARY ZERO                                  
BATKGRUP DS    XL1                 INPUT TYPE GROUP                             
         DS    XL1                 BINARY ZERO                                  
BATKTYPE DS    XL1                 INPUT TYPE                                   
BATKDATE DS    XL3                 BATCH DATE                                   
BATKREF  DS    CL6                 BATCH REFERENCE                              
*++PROCESS OFF                                                                  
BATKEND  EQU   *-BATKEY                                                         
*++PROCESS ON                                                                   
         ORG   BATKEY+L'BATKEY                                                  
*++PROCESS OFF                                                                  
BATKSTA  DS    0XL8                KEY STATUS                                   
BATKSTAT DS    XL1                 BATCH RECORD STATUS                          
BATSDELT EQU   X'80'               BATCH RECORD DELETED                         
BATSNOK  EQU   X'40'               BATCH RECORD NOT OK (NOT ENDED)              
BATSUPD  EQU   X'20'               BATCH UPDATED ONLINE                         
BATSRECV EQU   X'10'               BATCH XACTIONS ON ACCRCV NOT ACCDAY          
*&&UK                                                                           
BATSSECC EQU   X'08'               BATCH TOTAL IN 2ND CURRENCY                  
*&&                                                                             
BATSPRG  DS    XL2                 BATCH UPDATED BY PROGRAM 08/BG               
BATSDAT  DS    XL2                 BATCH UPDATED DATE                           
         DS    XL3                 N/D                                          
BATKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   BATKSTA                                                          
*++PROCESS ON                                                                   
BATRLEN  DS    XL2                 RECORD LENGTH                                
BATRSTA  DS    0XL8                RECORD STATUS                                
BATRSTAT DS    XL1                 BATCH RECORD STATUS (SEE BATKSTAT)           
BATRPRG  DS    XL2                 BATCH UPDATED BY PROGRAM 08/BG               
BATRDAT  DS    XL2                 BATCH UPDATED DATE                           
         DS    XL3                 N/D                                          
BATRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
BATRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
SCMRECD  DSECT                     ** STANDARD COMMENT RECORDS **               
SCMKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
SCMKTYP  DS    XL1                 COMMENT RECORD TYPE                          
SCMKTYPQ EQU   X'0C'                                                            
SCMKCPY  DS    XL1                 COMPANY CODE                                 
SCMKCODE DS    CL6                 COMMENT CODE (RIGHT ALIGNED)                 
*++PROCESS OFF                                                                  
SCMKEND  EQU   *-SCMKEY                                                         
*++PROCESS ON                                                                   
         ORG   SCMKEY+L'SCMKEY                                                  
*++PROCESS OFF                                                                  
SCMKSTA  DS    XL8                 KEY STATUS                                   
SCMKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   SCMKSTA                                                          
*++PROCESS ON                                                                   
SCMRLEN  DS    XL2                 RECORD LENGTH                                
SCMRSTA  DS    XL8                 RECORD STATUS                                
SCMRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
SCMRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
DPTRECD  DSECT                     ** DEPARTMENT RECORD  **                     
DPTKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
DPTKTYP  DS    XL1                 DEPARTMENT RECORD TYPE                       
DPTKTYPQ EQU   X'0D'                                                            
DPTKCPY  DS    XL1                 COMPANY CODE                                 
DPTKCODE DS    CL6                 DEPARTMENT                                   
         ORG   DPTKEY+L'DPTKEY                                                  
*++PROCESS OFF                                                                  
DPTKSTA  DS    XL8                 KEY STATUS                                   
DPTKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   DPTKSTA                                                          
*++PROCESS ON                                                                   
DPTRLEN  DS    XL2                 RECORD LENGTH                                
DPTRSTA  DS    XL8                 RECORD STATUS                                
DPTRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
DPTRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
SBDRECD  DSECT                     ** SUB-DEPARTMENT RECORD  **                 
SBDKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
SBDKTYP  DS    XL1                 SUB-DEPARTMENT RECORD TYPE                   
SBDKTYPQ EQU   X'0E'                                                            
SBDKCPY  DS    XL1                 COMPANY CODE                                 
SBDKCODE DS    CL6                 SUB-DEPARTMENT                               
         ORG   SBDKEY+L'SBDKEY                                                  
*++PROCESS OFF                                                                  
SBDKSTA  DS    XL8                 KEY STATUS                                   
SBDKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   SBDKSTA                                                          
*++PROCESS ON                                                                   
SBDRLEN  DS    XL2                 RECORD LENGTH                                
SBDRSTA  DS    XL8                 RECORD STATUS                                
SBDRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
SBDRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
PERRECD  DSECT                     ** PERSON RECORD  **                         
PERKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
PERKTYP  DS    XL1                 PERSON RECORD TYPE                           
PERKTYPQ EQU   X'0F'                                                            
PERKCPY  DS    XL1                 COMPANY CODE                                 
PERKCODE DS    CL8                 PERSON                                       
         ORG   PERKEY+L'PERKEY                                                  
*++PROCESS OFF                                                                  
PERKSTA  DS    XL8                 KEY STATUS                                   
PERKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   PERKSTA                                                          
*++PROCESS ON                                                                   
PERRLEN  DS    XL2                 RECORD LENGTH                                
PERRSTA  DS    XL8                 RECORD STATUS                                
PERRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
PERRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
CHARECD  DSECT                     ** CHECK AUTHORIZATION RECORD **             
CHAKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
CHAKTYP  DS    XL1                 CHECK RECORD TYPE                            
CHAKTYPQ EQU   X'10'                                                            
CHAKCULA DS    0XL3                                                             
CHAKCPY  DS    XL1                 COMPANY CODE                                 
CHAKUNT  DS    CL1                 UNIT                                         
CHAKLDG  DS    CL1                 LEDGER                                       
         ORG   CHAKEY+L'CHAKEY                                                  
*++PROCESS OFF                                                                  
CHAKSTA  DS    XL8                 KEY STATUS                                   
CHAKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   CHAKSTA                                                          
*++PROCESS ON                                                                   
CHARLEN  DS    XL2                 RECORD LENGTH                                
CHARSTA  DS    XL8                 RECORD STATUS                                
CHARLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
CHARFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
ADVRECD  DSECT                     ** ADVERTISER RECORD **                      
ADVKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
ADVKTYP  DS    XL1                 ADVERTISER RECORD TYPE                       
ADVKTYPQ EQU   X'11'                                                            
ADVKCPY  DS    XL1                 COMPANY CODE                                 
ADVKADV  DS    CL5                 ADVERTISER CODE                              
ADVKNULL DS    XL35                BINARY ZEROES                                
         ORG   ADVKEY+L'ADVKEY                                                  
*++PROCESS OFF                                                                  
ADVKSTA  DS    XL8                 KEY STATUS                                   
ADVKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   ADVKSTA                                                          
*++PROCESS ON                                                                   
ADVRLEN  DS    XL2                 RECORD LENGTH                                
ADVRSTA  DS    XL8                 RECORD STATUS                                
ADVRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
ADVRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
*++PROCESS OFF                                                                  
ACPRECD  DSECT                     ** ADVERTISER/CLIENT PASSIVE **              
ACPKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
ACPKTYP  DS    XL1                 ADVERTISER RECORD TYPE                       
ACPKTYPQ EQU   X'11'                                                            
ACPKCPY  DS    XL1                 COMPANY CODE                                 
ACPKADV  DS    CL5                 ADVERTISER CODE (OR CLIENT CODE)             
ACPKCLI  DS    CL5                 CLIENT CODE                                  
ACPKULA  DS    0XL14                                                            
ACPKUNT  DS    CL1                 UNIT CODE                                    
ACPKLDG  DS    CL1                 LEDGER CODE                                  
ACPKACT  DS    CL12                ACCOUNT CODE                                 
         ORG   ACPKEY+L'ACPKEY                                                  
ACPKSTA  DS    XL8                 KEY STATUS                                   
ACPKDA   DS    XL4                 DISK ADDRESS                                 
*++PROCESS ON                                                                   
         SPACE 1                                                                
AGRRECD  DSECT                     ** ACCOUNT GROUP RECORD **                   
AGRKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
AGRKTYP  DS    XL1                 ACCOUNT GROUP RECORD TYPE                    
AGRKTYPQ EQU   X'12'                                                            
AGRKCPY  DS    XL1                 COMPANY CODE                                 
AGRKGTYP DS    CL1                 ACCOUNT GROUP TYPE                           
AGRKGTY1 EQU   C'1'                ACCOUNT GROUP 1                              
AGRKGTY2 EQU   C'2'                ACCOUNT GROUP 2                              
AGRKAGR  DS    CL3                 ACCOUNT GROUP CODE                           
         ORG   AGRKEY+L'AGRKEY                                                  
*++PROCESS OFF                                                                  
AGRKSTA  DS    XL8                 KEY STATUS                                   
AGRKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   AGRKSTA                                                          
*++PROCESS ON                                                                   
AGRRLEN  DS    XL2                 RECORD LENGTH                                
AGRRSTA  DS    XL8                 RECORD STATUS                                
AGRRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
AGRRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
*++PROCESS OFF                                                                  
AGPRECD  DSECT                     ** ACCOUNT GROUP PASSIVE POINTER **          
AGPKEY   DS    0XL42                                                            
AGPKTYP  DS    XL1                 ACCOUNT GROUP PASSIVE RECORD TYPE            
AGPKTYPQ EQU   X'13'                                                            
AGPKCPY  DS    XL1                 COMPANY CODE                                 
AGPKGTYP DS    CL1                 ACCOUNT GROUP TYPE (SEE AGRKGTYP)            
AGPKAGR  DS    CL3                 ACCOUNT GROUP CODE                           
AGPKULA  DS    0XL14                                                            
AGPKUNT  DS    CL1                 UNIT CODE                                    
AGPKLDG  DS    CL1                 LEDGER CODE                                  
AGPKACT  DS    CL12                ACCOUNT CODE                                 
AGPKCLPR DS    CL12                PRODUCTION CLIENT/PRODUCT CODE               
         ORG   AGPKEY+L'AGPKEY                                                  
AGPKSTA  DS    XL8                 KEY STATUS                                   
AGPKDA   DS    XL4                 DISK ADDRESS                                 
*++PROCESS ON                                                                   
         SPACE 1                                                                
*++PROCESS OFF                                                                  
RAPRECD  DSECT                     ** RECORD ACTIVITY PASSIVE PTR **            
RAPKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
RAPKTYP  DS    XL1                 ACCOUNT GROUP PASSIVE RECORD TYPE            
RAPKTYPQ EQU   X'14'                                                            
RAPKCPY  DS    XL1                 COMPANY CODE                                 
RAPKRTYP DS    XL1                 RECORD TYPE                                  
RAPKROFF EQU   1                   OFFICE                                       
RAPKROGR EQU   2                   OFFICE GROUP                                 
RAPKRCLI EQU   3                   CLIENT                                       
RAPKRPRO EQU   4                   PRODUCT                                      
RAPKRJOB EQU   5                   JOB                                          
RAPKRSUP EQU   6                   PRODUCTION SUPPLIER                          
RAPKRMED EQU   7                   MEDIA                                        
RAPKRMGR EQU   8                   MEDIA GROUP                                  
RAPKRWRK EQU   9                   WORK CODE                                    
RAPKRWGR EQU   10                  WORK CODE GROUP                              
RAPKRPRL EQU   11                  PRICE LIST                                   
RAPKROPT EQU   12                  OPTION                                       
RAPKRSCH EQU   13                  SCHEME                                       
RAPKRCAT EQU   14                  CATEGORY                                     
RAPKRORD EQU   15                  ORDER                                        
RAPKROFL EQU   16                  OFFICE LIST                                  
RAPKRTAX EQU   17                  TAX RULES                                    
RAPKRUSR EQU   18                  USER FIELD                                   
*                                                                               
RAPKDATE DS    XL2                 ACTIVITY DATE (COMPRESSED)                   
RAPKTIME DS    XL3                 ACTIVITY TIME (BINARY SECONDS)               
*                                                                               
RAPKKEY  DS    0XL34               RECORD KEY                                   
RAPKACT  DS    0XL15               CLIENT/PRODUCT/JOB/SUPPLIER KEY              
RAPKACPY DS    XL1                 COMPANY CODE                                 
RAPKAUNT DS    CL1                 UNIT CODE                                    
RAPKALDG DS    CL1                 LEDGER CODE                                  
RAPKAACT DS    CL12                ACCOUNT CODE                                 
         ORG   RAPKKEY                                                          
*                                                                               
RAPKOFF  DS    XL7                 OFFICE RECORD KEY                            
         ORG   RAPKKEY                                                          
*                                                                               
RAPKOGR  DS    XL7                 OFFICE GROUP RECORD KEY                      
         ORG   RAPKKEY                                                          
*                                                                               
RAPKMED  DS    XL3                 MEDIA RECORD KEY                             
         ORG   RAPKKEY                                                          
*                                                                               
RAPKMGR  DS    XL6                 MEDIA GROUP RECORD KEY                       
         ORG   RAPKKEY                                                          
*                                                                               
RAPKWRK  DS    XL6                 WORK CODE RECORD KEY                         
         ORG   RAPKKEY                                                          
*                                                                               
RAPKWGR  DS    XL6                 WORK CODE GROUP RECORD KEY                   
         ORG   RAPKKEY                                                          
*                                                                               
RAPKPRL  DS    XL6                 PRICE LIST                                   
         ORG   RAPKKEY                                                          
*                                                                               
RAPKOPT  DS    XL31                OPTION RECORD                                
         ORG   RAPKKEY                                                          
*                                                                               
RAPKSCH  DS    XL13                SCHEME RECORD                                
         ORG   RAPKKEY                                                          
*                                                                               
RAPKCAT  DS    XL15                CATEGORY RECORD                              
         ORG   RAPKKEY                                                          
*                                                                               
RAPKORD  DS    XL10                ORDER RECORD                                 
         ORG   RAPKKEY                                                          
*                                                                               
RAPKOFL  DS    CL2                 OFFICE LIST CODE                             
         ORG   RAPKKEY                                                          
*                                                                               
RAPKUSR  DS    XL28                USER FIELD                                   
*                                                                               
         ORG   RAPKEY+L'RAPKEY                                                  
RAPKSTA  DS    XL8                 KEY STATUS                                   
RAPKDA   DS    XL4                 DISK ADDRESS                                 
*++PROCESS ON                                                                   
         SPACE 1                                                                
*++PROCESS OFF                                                                  
MOSPASD  DSECT                     ** MONTH OF SERVICE PASSIVE **               
MOSPKEY  DS    0XL42                                                            
*++IDENTIFIER                                                                   
MOSPTYP  DS    XL1                 RECORD TYPE                                  
MOSPTYPQ EQU   X'15'                                                            
MOSPCPY  DS    XL1                 COMPANY CODE                                 
MOSPMOS  DS    PL2                 MONTH OF ACTIVITY                            
MOSPULA  DS    0XL14               ACCOUNT                                      
MOSPUNT  DS    CL1                 UNIT CODE                                    
MOSPLDG  DS    CL1                 LEDGER CODE                                  
MOSPACT  DS    CL12                ACCOUNT CODE                                 
MOSPOFF  DS    CL2                 OFFICE OR SPACES                             
         ORG   MOSPOFF                                                          
MOSPWORK DS    CL2                 WORK CODE OR SPACES                          
MOSPCULC DS    0XL15                                                            
MOSPCCPY DS    XL1                 CONTRA-COMPANY CODE                          
MOSPULC  DS    0XL14                                                            
MOSPCUNT DS    CL1                 CONTRA-UNIT CODE                             
MOSPCLDG DS    CL1                 CONTRA-LEDGER CODE                           
MOSPCACT DS    CL12                CONTRA-ACCOUNT CODE                          
MOSPDATE DS    PL3                 TRANSACTION DATE                             
MOSPDA   DS    XL4                 DISK ADDRESS OF RECORD                       
         ORG   MOSPMOS                                                          
MOSPNULL DS    XL2                 BINARY ZEROS                                 
MOSPLMOS DS    PL2                 LOWEST MONTH - SET BY LOAD                   
         ORG   MOSPKEY+L'MOSPKEY                                                
MOSPKSTA DS    XL8                 KEY STATUS                                   
MOSPKDA  DS    XL4                 DISK ADDRESS                                 
*++PROCESS ON                                                                   
         SPACE 1                                                                
OCORECD  DSECT                     ** OVERRIDE CONTROL RECORD **                
OCOKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
OCOKTYP  DS    XL1                 ACCOUNT GROUP RECORD TYPE                    
OCOKTYPQ EQU   X'16'                                                            
OCOKCPY  DS    XL1                 COMPANY CODE                                 
OCOKOFF  DS    CL2                 OFFICE CODE                                  
OCOKACC  DS    CL15                ACCOUNT CODE                                 
         ORG   OCOKEY+L'OCOKEY                                                  
*++PROCESS OFF                                                                  
OCOKSTA  DS    XL8                 KEY STATUS                                   
OCOKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   OCOKSTA                                                          
*++PROCESS ON                                                                   
OCORLEN  DS    XL2                 RECORD LENGTH                                
OCORSTA  DS    XL8                 RECORD STATUS                                
OCORLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
OCORFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
TCPPASD  DSECT                     ** TRANSACTION/CONTRA POINTER **             
TCPPKEY  DS    0XL42                                                            
*++IDENTIFIER                                                                   
TCPPTYP  DS    XL1                 RECORD TYPE                                  
TCPPTYPQ EQU   X'17'                                                            
TCPPCPY  DS    XL1                 COMPANY CODE                                 
TCPPUL   DS    0XL2                                                             
TCPPUNT  DS    CL1                 MAIN ACCOUNT UNIT                            
TCPPLDG  DS    CL1                 MAIN ACCOUNT LEDGER                          
TCPPULC  DS    0XL14                                                            
TCPPCUNT DS    CL1                 CONTRA(/ANALYSIS) UNIT                       
TCPPCLDG DS    CL1                 CONTRA(/ANALYSIS) LEDGER                     
TCPPCACT DS    CL12                CONTRA(/ANALYSIS) ACCOUNT                    
TCPPACT  DS    CL12                MAIN ACCOUNT                                 
TCPPWORK DS    0CL2                WORK CODE (PRODUCTION LEDGER)                
TCPPOFF  DS    CL2                 OFFICE CODE (ALL OTHER LEDGERS)              
TCPPMOA  DS    PL2                 MONTH-OF-ACTIVITY OR ZEROES                  
TCPPDATE DS    PL3                 TRANSACTION DATE (OR ZEROES)                 
         DS    XL1                 N/D (BINARY ZEROES)                          
TCPPDA   DS    XL4                 DISK ADDRESS OF RECORD                       
*++PROCESS OFF                                                                  
TCPPKSTA DS    XL8                 KEY STATUS                                   
TCPPKDA  DS    XL4                 DISK ADDRESS                                 
*++PROCESS ON                                                                   
         SPACE 1                                                                
*++PROCESS OFF                                                                  
PARRECD  DSECT                     ** PRODUCTION ADJUSTMENT RATES **            
PARKEY   DS    0XL42                                                            
*&&US                                                                           
*++IDENTIFIER                                                                   
PARKTYP  DS    XL1                 PRODUCTION ADJUSTMENT RATE TYPE              
PARKTYPQ EQU   X'19'                                                            
PARKCPY  DS    XL1                 COMPANY CODE                                 
PARKOFF  DS    CL2                 OFFICE CODE                                  
PARKCLI  DS    CL3                 CLIENT CODE                                  
PARKPRO  DS    CL3                 PRODUCT CODE                                 
PARKJOB  DS    CL6                 JOB CODE                                     
PARKDEP  DS    CL3                 DEPARTMENT CODE                              
         ORG   PARKDEP                                                          
PARKDOF  DS    CL1                                                              
PARKDPT  DS    CL2                                                              
         DS    CL1                 N/D                                          
PARKSUB  DS    CL2                 SUB-DEPARTMENT CODE                          
PARKSTF  DS    CL7                 STAFF CODE                                   
PARKTSK  DS    CL2                 TASK CODE                                    
*&&                                                                             
*&&UK                                                                           
*++IDENTIFIER                                                                   
PARKTYP  DS    XL1                 PRODUCTION ADJUSTMENT RATE TYPE              
PARKTYPQ EQU   X'19'                                                            
PARKCPY  DS    XL1                 COMPANY CODE                                 
PARKOFF  DS    CL1                 OFFICE CODE                                  
PARKCLI  DS    CL3                 CLIENT CODE                                  
PARKPRO  DS    CL3                 PRODUCT CODE                                 
PARKJOB  DS    CL6                 JOB CODE                                     
PARKDEP  DS    CL3                 DEPARTMENT CODE                              
PARKSUB  DS    CL2                 SUB-DEPARTMENT CODE                          
PARKSTF  DS    CL7                 STAFF CODE                                   
PARKTSK  DS    CL2                 TASK CODE                                    
*&&                                                                             
         ORG   PARKEY+L'PARKEY                                                  
*++PROCESS OFF                                                                  
PARKSTA  DS    XL8                 KEY STATUS                                   
PARKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   PARKSTA                                                          
*++PROCESS ON                                                                   
PARRLEN  DS    XL2                 RECORD LENGTH                                
PARRSTA  DS    XL8                 RECORD STATUS                                
PARRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
PARRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
PAJRECD  DSECT                     ** PRODUCTION ADJUSTMENT RATES **            
PAJKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
PAJKTYP  DS    XL1                 PRODUCTION ADJUSTMENT RATE TYPE              
PAJKTYPQ EQU   X'19'                                                            
PAJKCPY  DS    XL1                 COMPANY CODE                                 
*&&US                                                                           
PAJKOFF  DS    CL2                 OFFICE CODE                                  
PAJKCLI  DS    CL3                 CLIENT CODE                                  
PAJKPRO  DS    CL3                 PRODUCT CODE                                 
PAJKJOB  DS    CL6                 JOB CODE                                     
PAJKDOF  DS    CL2                 OFFICE CODE                                  
PAJKDEP  DS    CL3                                                              
PAJKSUB  DS    CL2                 SUB-DEPARTMENT CODE                          
PAJKSTF  DS    CL7                 STAFF CODE                                   
PAJKTSK  DS    CL2                 TASK CODE                                    
PAJKLNQ  EQU   *-PAJKEY                                                         
*&&                                                                             
*&&UK                                                                           
PAJKOFF  DS    CL1                 OFFICE CODE                                  
PAJKCLI  DS    CL3                 CLIENT CODE                                  
PAJKPRO  DS    CL3                 PRODUCT CODE                                 
PAJKJOB  DS    CL6                 JOB CODE                                     
PAJKDOF  DS    CL2                 OFFICE CODE                                  
PAJKDEP  DS    CL3                 DEPARTMENT CODE                              
PAJKSUB  DS    CL2                 SUB-DEPARTMENT CODE                          
PAJKSTF  DS    CL7                 STAFF CODE                                   
PAJKTSK  DS    CL2                 TASK CODE                                    
*&&                                                                             
         ORG   PAJKEY+L'PAJKEY                                                  
*++PROCESS OFF                                                                  
PAJKSTA  DS    XL8                 KEY STATUS                                   
PAJKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   PAJKSTA                                                          
*++PROCESS ON                                                                   
PAJRLEN  DS    XL2                 RECORD LENGTH                                
PAJRSTA  DS    XL8                 RECORD STATUS                                
PAJRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
PAJRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
ORDRECD  DSECT                     ** ORDER RECORDS **                          
ORDKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
ORDKTYP  DS    XL1                 ORDER RECORD TYPE                            
ORDKTYPQ EQU   X'1A'                                                            
ORDKCPY  DS    XL1                 COMPANY CODE                                 
         DS    XL2                 BINARY ZEROES                                
ORDKORD  DS    CL6                 ORDER# (000000=CONTROL RECORD)               
ORDKSEQ  DS    CL1                 ORDER RECORD SEQUENCE NUMBER                 
*++PROCESS OFF                                                                  
ORDKEND  EQU   *-ORDKEY                                                         
*++PROCESS ON                                                                   
         ORG   ORDKEY+L'ORDKEY                                                  
*++PROCESS OFF                                                                  
ORDKSTA  DS    0XL8                KEY STATUS                                   
ORDKSTAT DS    XL1                 ORDER RECORD STATUS                          
ORDSOFF  DS    XL2                 OFFICE CODE OR BINARY ZEROES                 
         DS    XL5                 N/D                                          
ORDKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   ORDKSTA                                                          
*++PROCESS ON                                                                   
ORDRLEN  DS    XL2                 RECORD LENGTH                                
ORDRSTA  DS    0XL8                RECORD STATUS                                
ORDRSTAT DS    XL1                 ORDER RECORD STATUS                          
ORDSDEL  EQU   X'80'               ORDER IS DELETED                             
ORDSFMCH EQU   X'40'               ORDER IS FULLY MATCHED                       
ORDSLDEL EQU   X'20'               ORDER IS LOGICALLY DELETED                   
ORDSCON  EQU   X'01'               ORDER IS A CONTRACT ORDER                    
*&&UK                                                                           
*RDSSECC EQU   X'10'               ORDER AMOUNTS IN 2ND CURRENCY                
*RDCLOSE EQU   X'08'               ORDER CLOSED IN =ORD                         
*&&                                                                             
ORDROFF  DS    XL2                 OFFICE CODE OR BINARY ZEROES                 
         DS    XL5                 N/D                                          
ORDRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
ORDRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
BUDRECD  DSECT                     ** BUDGET RECORDS **                         
BUDKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
BUDKTYP  DS    XL1                 BUDGET RECORD TYPE                           
BUDKTYPQ EQU   X'1B'                                                            
BUDKCPY  DS    XL1                 COMPANY CODE                                 
BUDKIND  DS    XL1                 BINARY ZEROES                                
BUDKNO1  DS    XL2                 BUDGET NUMBER OR ZEROES                      
BUDKCOD  DS    CL10                BUDGET CODE                                  
BUDKNO2  DS    XL2                 BUDGET NUMBER OR ZEROES                      
BUDKBTYP DS    CL1                 BUCKET TYPE OR ZEROS                         
*++PROCESS OFF                                                                  
BUDKEND1 EQU   *-BUDKEY                                                         
*++PROCESS ON                                                                   
         ORG   BUDKCPY                                                          
BUDKCULA DS    0XL15                                                            
         DS    XL1                 COMPANY CODE                                 
BUDKUNT  DS    CL1                 UNIT CODE                                    
BUDKLDG  DS    CL1                 LEDGER CODE                                  
BUDKACT  DS    CL12                ACCOUNT CODE                                 
BUDKWORK DS    CL2                 WORK CODE OR SPACES                          
BUDKCCPY DS    XL1                 CONTRA-COMPANY CODE                          
BUDKCUNT DS    CL1                 CONTRA-UNIT CODE                             
BUDKCLDG DS    CL1                 CONTRA-LEDGER CODE                           
BUDKCACT DS    CL12                CONTRA-ACCOUNT CODE                          
BUDKBUDN DS    XL2                 BUDGET NUMBER                                
BUDKBCKT DS    CL1                 BUCKET TYPE OR ZEROS                         
*++PROCESS OFF                                                                  
BUDKEND2 EQU   *-BUDKEY                                                         
*++PROCESS ON                                                                   
*                                                                               
*++PROCESS OFF                                                                  
         ORG   BUDKCPY             ** BUDGET PASSIVE POINTER #1 **              
*                                                                               
         DS    XL1                 COMPANY CODE                                 
BUDPTYP  DS    XL1                                                              
BUDPTYPQ EQU   X'01'                                                            
BUDPBUDN DS    XL2                 BUDGET NUMBER                                
BUDPBCKT DS    CL1                 BUCKET TYPE OR ZEROS                         
BUDPULA  DS    0XL14                                                            
BUDPUNT  DS    CL1                 UNIT CODE                                    
BUDPLDG  DS    CL1                 LEDGER CODE                                  
BUDPACT  DS    CL12                ACCOUNT CODE                                 
BUDPWORK DS    CL2                 WORK CODE OR SPACES                          
BUDPCCPY DS    XL1                 CONTRA-COMPANY CODE                          
BUDPCUNT DS    CL1                 CONTRA-UNIT CODE                             
BUDPCLDG DS    CL1                 CONTRA-LEDGER CODE                           
BUDPCACT DS    CL12                CONTRA-ACCOUNT CODE                          
BUDPEND  EQU   *-BUDKEY                                                         
*                                                                               
         ORG   BUDKCPY             ** BUDGET PASSIVE POINTER #2 **              
*                                                                               
         DS    XL1                 COMPANY CODE                                 
BUD2TYP  DS    XL1                                                              
BUD2TYPQ EQU   X'02'                                                            
BUD2BUDN DS    XL2                 BUDGET NUMBER                                
BUD2BCKT DS    CL1                 BUCKET TYPE OR ZEROS                         
BUD2CUNT DS    CL1                 CONTRA-UNIT CODE                             
BUD2CLDG DS    CL1                 CONTRA-LEDGER CODE                           
BUD2ULA  DS    0XL14                                                            
BUD2UNT  DS    CL1                 ACCOUNT UNIT CODE                            
BUD2LDG  DS    CL1                 ACCOUNT LEDGER CODE                          
BUD2ACT  DS    CL12                ACCOUNT CODE                                 
BUD2WORK DS    CL2                 WORK CODE OR SPACES                          
BUD2CCPY DS    XL1                 CONTRA-COMPANY CODE                          
BUD2CACT DS    CL12                CONTRA-ACCOUNT CODE                          
BUD2END  EQU   *-BUDKEY                                                         
*++PROCESS ON                                                                   
         ORG   BUDKEY+L'BUDKEY                                                  
*++PROCESS OFF                                                                  
BUDKSTA  DS    XL8                 KEY STATUS                                   
BUDKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   BUDKSTA                                                          
*++PROCESS ON                                                                   
BUDRLEN  DS    XL2                 RECORD LENGTH                                
BUDRSTA  DS    XL8                 RECORD STATUS                                
BUDRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
BUDRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
PRLRECD  DSECT                     ** PRICE LIST RECORD **                      
PRLKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
PRLKTYP  DS    XL1                 PRICE LIST RECORD TYPE                       
PRLKTYPQ EQU   X'1C'                                                            
PRLKCPY  DS    XL1                 COMPANY CODE                                 
PRLKNUM  DS    CL4                 PRICE LIST NUMBER                            
         ORG   PRLKEY+L'PRLKEY                                                  
*++PROCESS OFF                                                                  
PRLKSTA  DS    XL8                 KEY STATUS                                   
PRLKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   PRLKSTA                                                          
*++PROCESS ON                                                                   
PRLRLEN  DS    XL2                 RECORD LENGTH                                
PRLRSTA  DS    XL8                 RECORD STATUS                                
PRLRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
PRLRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
LSTRECD  DSECT                     ** LIST RECORDS **                           
LSTKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
LSTKTYP  DS    XL1                 LIST RECORD TYPE                             
LSTKTYPQ EQU   X'1D'                                                            
LSTKCPY  DS    XL1                 COMPANY CODE                                 
LSTKLST  DS    CL5                 LIST CODE                                    
*++PROCESS OFF                                                                  
LSTKEND  EQU   *-LSTKEY                                                         
*++PROCESS ON                                                                   
         ORG   LSTKEY+L'LSTKEY                                                  
*++PROCESS OFF                                                                  
LSTKSTA  DS    XL8                 KEY STATUS                                   
LSTKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   LSTKSTA                                                          
*++PROCESS ON                                                                   
LSTRLEN  DS    XL2                 RECORD LENGTH                                
LSTRSTA  DS    XL8                 RECORD STATUS                                
LSTRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
LSTRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
*++PROCESS OFF                                                                  
GINPASD  DSECT                     ** GROUP INVOICE PASSIVE POINTERS **         
GINPKEY  DS    0XL42                                                            
*++IDENTIFIER                                                                   
GINPTYP  DS    XL1                 RECORD TYPE                                  
GINPTYPQ EQU   X'1E'                                                            
GINPCPY  DS    XL1                 COMPANY CODE                                 
GINPINV  DS    XL4                 COMPANY INTERNAL INVOICE NUMBER              
GINPISN  DS    XL2                 INPUT SEQUENCE NUMBER                        
GINPPTYP DS    XL1                 POSTING TYPE (SEE GINTYP)                    
GINPULA  DS    0XL14               ACCOUNT                                      
GINPUNT  DS    CL1                 UNIT CODE                                    
GINPLDG  DS    CL1                 LEDGER CODE                                  
GINPACT  DS    CL12                ACCOUNT CODE                                 
GINPWORK DS    CL2                 WORK-CODE OR OFFICE CODE                     
GINPDA   DS    XL4                 DISK ADDRESS OF RECORD                       
GINPEND  EQU   *-GINPKEY                                                        
         ORG   GINPASD+L'GINPKEY                                                
GINPKSTA DS    XL8                 KEY STATUS                                   
GINPKDA  DS    XL4                 DISK ADDRESS                                 
*++PROCESS ON                                                                   
         SPACE 1                                                                
*++PROCESS OFF                                                                  
PPRPASD  DSECT                     ** PRODUCTION ENQ PASSIVE POINTER **         
PPRPKEY  DS    0XL42                                                            
*++IDENTIFIER                                                                   
PPRPTYP  DS    XL1                 RECORD TYPE                                  
PPRPTYPQ EQU   X'1F'                                                            
PPRPCPY  DS    XL1                 COMPANY CODE                                 
PPRPMOA  DS    XL2                 PWOS MONTH OF ACTIVITY                       
         DS    XL1                 SPARE                                        
PPRPWORK DS    CL2                 WORKCODE                                     
PPRPSUPP DS    0XL14               CONTRA U/L/ACCOUNT                           
PPRPSUNT DS    XL1                 SUPPLIER UNIT                                
PPRPSLDG DS    XL1                 SUPPLIER LEDGER                              
PPRPSACT DS    XL12                SUPPLIER ACCOUNT CODE                        
PPRPJOB  DS    XL12                JOB CODE                                     
PPRPDATE DS    XL2                 COMPRESSED TRANSACTION DATE                  
PPRPREF  DS    CL6                 TRANSACTION REFERENCE                        
PPRPSUBR DS    XL1                 TRANSACTION SUB-REFERENCE                    
         ORG   PPRPASD+L'PPRPKEY                                                
PPRPKSTA DS    XL8                 KEY STATUS                                   
PPRPKDA  DS    XL4                 DISK ADDRESS                                 
*++PROCESS ON                                                                   
         SPACE 1                                                                
OBRRECD  DSECT                     ** ORDER BLOCK RESERVATION RECS **           
OBRKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
OBRKTYP  DS    XL1                 RECORD TYPE                                  
OBRKTYPQ EQU   X'22'                                                            
OBRKCPY  DS    XL1                 COMPANY CODE                                 
OBRKLAST DS    CL6                 LAST ORDER RESERVED                          
OBRKFRST DS    CL6                 FIRST ORDER RESERVED                         
*++PROCESS OFF                                                                  
OBRKEND  EQU   *-OBRKEY                                                         
*++PROCESS ON                                                                   
         ORG   OBRKEY+L'OBRKEY                                                  
*++PROCESS OFF                                                                  
OBRKSTA  DS    0XL8                                                             
OBRKSTAT DS    XL1                 KEY STATUS                                   
         DS    XL7                 N/D                                          
OBRKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   OBRKSTA                                                          
*++PROCESS ON                                                                   
OBRRLEN  DS    XL2                 RECORD LENGTH                                
OBRRSTA  DS    0XL8                                                             
OBRRSTAT DS    XL1                 RECORD STATUS                                
OBRSDELT EQU   X'80'                                                            
         DS    XL7                 N/D                                          
OBRRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
OBRRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
GBCPASD  DSECT                     ** GERMAN BANK/CLIENT POINTERS **            
GBCPKEY  DS    0XL42                                                            
*++IDENTIFIER                                                                   
GBCPTYP  DS    XL1                 RECORD TYPE                                  
GBCPTYPQ EQU   X'23'                                                            
GBCPCULA DS    0XL15               BANK ACCOUNT                                 
GBCPCPY  DS    XL1                 COMPANY CODE                                 
GBCPUNT  DS    CL1                 UNIT CODE                                    
GBCPLDG  DS    CL1                 LEDGER CODE                                  
GBCPACT  DS    CL12                ACCOUNT CODE                                 
GBCPCLI  DS    CL5                 CLIENT CODE                                  
*++PROCESS OFF                                                                  
GBCPEND  EQU   *-GBCPKEY                                                        
*++PROCESS ON                                                                   
         ORG   GBCPASD+L'GBCPKEY                                                
*++PROCESS OFF                                                                  
GBCPKSTA DS    XL8                 KEY STATUS                                   
GBCPKDA  DS    XL4                 DISK ADDRESS                                 
*++PROCESS ON                                                                   
         SPACE 1                                                                
PCRRECD  DSECT                     ** PRODUCTION CHARGE RATES **                
PCRKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
PCRKTYP  DS    XL1                 PRODUCTION CHARGE RATE TYPE                  
PCRKTYPQ EQU   X'2A'               NON-TMS USERS AND US SYSTEM                  
PCRKTMSQ EQU   X'29'               TMS USERS ON UK SYSTEM ONLY                  
PCRKCPY  DS    XL1                 COMPANY CODE                                 
*&&US                                                                           
PCRKDEP  DS    CL3                 DEPARTMENT CODE                              
         ORG   PCRKDEP                                                          
PCRKDOF  DS    CL1                                                              
PCRKDPT  DS    CL2                                                              
         DS    XL1                 N/D                                          
PCRKSUB  DS    CL2                 SUB-DEPARTMENT CODE                          
PCRKSTF  DS    CL7                 STAFF CODE                                   
PCRKTSK  DS    CL2                 TASK CODE                                    
PCRKOFF  DS    CL2                 OFFICE CODE                                  
PCRKCLI  DS    CL3                 CLIENT CODE                                  
PCRKPRO  DS    CL3                 PRODUCT CODE                                 
*&&                                                                             
*&&UK                                                                           
PCRKPER  DS    0CL12                                                            
PCRKDEP  DS    CL3                 DEPARTMENT CODE                              
PCRKSUB  DS    CL2                 SUB-DEPARTMENT CODE                          
PCRKSTF  DS    CL7                 STAFF CODE                                   
PCRKOFF  DS    CL1                 OFFICE CODE                                  
PCRKJOB  DS    CL12                FULL PRODUCTION LEDGER KEY                   
PCRKCLI  DS    0CL3                CLIENT CODE                                  
PCRKPRO  DS    0CL3                PRODUCT CODE                                 
PCRKTSK  DS    CL2                 TASK CODE                                    
*&&                                                                             
         ORG   PCRKEY+L'PCRKEY                                                  
*++PROCESS OFF                                                                  
PCRKSTA  DS    XL8                 KEY STATUS                                   
PCRKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   PCRKSTA                                                          
*++PROCESS ON                                                                   
PCRRLEN  DS    XL2                 RECORD LENGTH                                
PCRRSTA  DS    XL8                 RECORD STATUS                                
PCRRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
PCRRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
PCHRECD  DSECT                     ** PRODUCTION CHARGE RATES **                
PCHKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
PCHKTYP  DS    XL1                 PRODUCTION CHARGE RATE TYPE                  
PCHKTYPQ EQU   X'2A'                                                            
PCHKCPY  DS    XL1                 COMPANY CODE                                 
*&&US                                                                           
PCHKDOF  DS    CL2                 OFFICE CODE                                  
PCHKDEP  DS    CL3                 DEPARTMENT CODE                              
PCHKSUB  DS    CL2                 SUB-DEPARTMENT CODE                          
PCHKSTF  DS    CL7                 STAFF CODE                                   
PCHKTSK  DS    CL2                 TASK CODE                                    
PCHKOFF  DS    CL2                 OFFICE CODE                                  
PCHKCLI  DS    CL3                 CLIENT CODE                                  
PCHKPRO  DS    CL3                 PRODUCT CODE                                 
*++PROCESS OFF                                                                  
PCHKLNQ  EQU   *-PCHKEY                                                         
*++PROCESS ON                                                                   
*&&                                                                             
*&&UK                                                                           
PCHKPER  DS    0CL12                                                            
PCHKDOF  DS    CL2                 OFFICE CODE                                  
PCHKDEP  DS    CL3                 DEPARTMENT CODE                              
PCHKSUB  DS    CL2                 SUB-DEPARTMENT CODE                          
PCHKSTF  DS    CL7                 STAFF CODE                                   
PCHKOFF  DS    CL1                 OFFICE CODE                                  
PCHKJOB  DS    CL12                FULL PRODUCTION LEDGER KEY                   
PCHKCLI  DS    0CL3                CLIENT CODE                                  
PCHKPRO  DS    0CL3                PRODUCT CODE                                 
PCHKTSK  DS    CL2                 TASK CODE                                    
*&&                                                                             
         ORG   PCHKEY+L'PCHKEY                                                  
*++PROCESS OFF                                                                  
PCHKSTA  DS    XL8                 KEY STATUS                                   
PCHKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   PCHKSTA                                                          
*++PROCESS ON                                                                   
PCHRLEN  DS    XL2                 RECORD LENGTH                                
PCHRSTA  DS    XL8                 RECORD STATUS                                
PCHRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
PCHRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
BDPPASD  DSECT                     ** BILL/DEBTOR PASSIVE POINTERS **           
BDPPKEY  DS    0XL42                                                            
BDPPTYP  DS    XL1                 RECORD TYPE                                  
BDPPTYPQ EQU   X'2B'                                                            
BDPPCPY  DS    XL1                 COMPANY CODE                                 
BDPPSYS  DS    CL1                 SYSTEMS CODE                                 
BDPPACCQ EQU   C'A'                ACCOUNTING SYSTEM                            
BDPPMED  DS    CL1                 MEDIA CODE OR BINARY ZERO                    
BDPPOFF  DS    CL2                 OFFICE CODE                                  
BDPPJOB  DS    CL12                CLIENT/PRODUCT/JOB CODE                      
BDPPBIL# DS    CL6                 BILL NUMBER                                  
BDPPBILD DS    XL2                 BILL DATE                                    
BDPPRTYP DS    XL1                 RECORD TYPE                                  
BDPPRDDR EQU   1                   DEBTORS LEDGER DEBIT POSTING                 
BDPPRWDR EQU   2                   WORK IN PROGRESS DEBIT POSTING               
BDPPRDCR EQU   3                   DEBTORS LEDGER CREDIT POSTING                
BDPPBILM DS    PL2                 BILL MONTH-OF-ACTIVITY                       
BDPPDA   DS    XL4                 RECORD DISK ADDRESS                          
*++PROCESS OFF                                                                  
BDPPEND  EQU   *-BDPPKEY                                                        
*++PROCESS ON                                                                   
         ORG   BDPPASD+L'BDPPKEY                                                
*++PROCESS OFF                                                                  
BDPPKSTA DS    XL8                 KEY STATUS                                   
BDPPKDA  DS    XL4                 DISK ADDRESS                                 
*++PROCESS ON                                                                   
         SPACE 1                                                                
OGRRECD  DSECT                     ** OFFICE AND GROUP RECORDS **               
OGRKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
OGRKTYP  DS    XL1                 OFFICE/GROUP RECORD TYPE                     
OGRKTYPQ EQU   X'2C'                                                            
*++IDENTIFIER                                                                   
OGRKSUB  DS    XL1                 OFFICE/GROUP SUB-RECORD TYPE                 
OGRKGRPQ EQU   X'02'               GROUP RECORD                                 
OGRKOFFQ EQU   X'04'               OFFICE RECORD                                
OGRKCPY  DS    XL1                 COMPANY CODE                                 
OGRKUNT  DS    CL1                 UNIT CODE                                    
OGRKLDG  DS    CL1                 LEDGER CODE                                  
OGRKCODE DS    CL1                 GROUP CODE                                   
         ORG   OGRKCODE                                                         
OGRKOFC  DS    CL2                 OFFICE CODE                                  
         ORG   OGRKEY+L'OGRKEY                                                  
*++PROCESS OFF                                                                  
OGRKSTA  DS    XL8                 KEY STATUS                                   
OGRKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   OGRKSTA                                                          
*++PROCESS ON                                                                   
OGRRLEN  DS    XL2                 RECORD LENGTH                                
OGRRSTA  DS    XL8                 RECORD STATUS                                
OGRRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
OGRRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
MGRRECD  DSECT                     ** MEDIA GROUP RECORDS **                    
MGRKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
MGRKTYP  DS    XL1                 MEDIA GROUP RECORD TYPE                      
MGRKTYPQ EQU   X'2C'                                                            
*++IDENTIFIER                                                                   
MGRKSUB  DS    XL1                 MEDIA GROUP SUB-RECORD TYPE                  
MGRKSUBQ EQU   X'06'                                                            
MGRKCPY  DS    XL1                 COMPANY CODE                                 
MGRKUNT  DS    CL1                 UNIT CODE                                    
MGRKLDG  DS    CL1                 LEDGER CODE                                  
MGRKCODE DS    CL1                 MEDIA GROUP CODE                             
         ORG   MGRKEY+L'MGRKEY                                                  
*++PROCESS OFF                                                                  
MGRKSTA  DS    XL8                 KEY STATUS                                   
MGRKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   MGRKSTA                                                          
*++PROCESS ON                                                                   
MGRRLEN  DS    XL2                 RECORD LENGTH                                
MGRRSTA  DS    XL8                 RECORD STATUS                                
MGRRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
MGRRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
WGRRECD  DSECT                     ** WORK CODE GROUP RECORDS **                
WGRKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
WGRKTYP  DS    XL1                 WORK CODE GROUP RECORD TYPE                  
WGRKTYPQ EQU   X'2C'                                                            
*++IDENTIFIER                                                                   
WGRKSUB  DS    XL1                 WORK CODE GROUP SUB-RECORD TYPE              
WGRKSUBQ EQU   X'08'                                                            
WGRKCPY  DS    XL1                 COMPANY CODE                                 
WGRKUNT  DS    CL1                 UNIT CODE                                    
WGRKLDG  DS    CL1                 LEDGER CODE                                  
WGRKCODE DS    CL1                 WORK GROUP CODE                              
         ORG   WGRKEY+L'WGRKEY                                                  
*++PROCESS OFF                                                                  
WGRKSTA  DS    XL8                 KEY STATUS                                   
WGRKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   WGRKSTA                                                          
*++PROCESS ON                                                                   
WGRRLEN  DS    XL2                 RECORD LENGTH                                
WGRRSTA  DS    XL8                 RECORD STATUS                                
WGRRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
WGRRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
UFSRECD  DSECT                     ** USER FIELD SELECT RECORD **               
UFSKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
UFSKTYP  DS    XL1                 USER FIELD SELECT RECORD TYPE                
UFSKTYPQ EQU   X'2C'                                                            
*++IDENTIFIER                                                                   
UFSKSUB  DS    XL1                 USER FIELD SELECT SUB-RECORD TYPE            
UFSKSUBQ EQU   X'10'                                                            
UFSKCPY  DS    XL1                 COMPANY CODE                                 
UFSKUNT  DS    CL1                 UNIT CODE                                    
UFSKLDG  DS    CL1                 LEDGER CODE                                  
UFSKOFG  DS    XL1                 OFFICE GROUP OR BINARY ZEROES                
UFSKOFC  DS    XL2                 OFFICE CODE OR BINARY ZEROES                 
UFSKCLI  DS    XL6                 CLIENT CODE OR BINARY ZEROES                 
UFSKPRO  DS    XL6                 PRODUCT CODE OR BINARY ZEROES                
UFSKMGR  DS    XL1                 MEDIA GROUP OR BINARY ZEROES                 
UFSKMED  DS    XL1                 MEDIA CODE OR BINARY ZEROES                  
UFSKJOB  DS    XL6                 JOB CODE OR BINARY ZEROES                    
         ORG   UFSKEY+L'UFSKEY                                                  
*++PROCESS OFF                                                                  
UFSKSTA  DS    XL8                 KEY STATUS                                   
UFSKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   UFSKSTA                                                          
*++PROCESS ON                                                                   
UFSRLEN  DS    XL2                 RECORD LENGTH                                
UFSRSTA  DS    XL8                 RECORD STATUS                                
UFSRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
UFSRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
JGRRECD  DSECT                     ** JOB GROUP RECORD **                       
JGRKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
JGRKTYP  DS    XL1                 JOB GROUP RECORD TYPE                        
JGRKTYPQ EQU   X'2C'                                                            
*++IDENTIFIER                                                                   
JGRKSUB  DS    XL1                 JOB GROUP RECORD SUB-TYPE                    
JGRKSUBQ EQU   X'12'                                                            
JGRKCPY  DS    XL1                 COMPANY CODE                                 
JGRKUNT  DS    CL1                 UNIT                                         
JGRKLDG  DS    CL1                 LEDGER                                       
JGRKCODE DS    CL8                 JOB GROUP CODE                               
         ORG   JGRKEY+L'JGRKEY                                                  
*++PROCESS OFF                                                                  
JGRKSTA  DS    XL8                 KEY STATUS                                   
JGRKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   JGRKSTA                                                          
*++PROCESS ON                                                                   
JGRRLEN  DS    XL2                 RECORD LENGTH                                
JGRRSTA  DS    XL8                 RECORD STATUS                                
JGRRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
JGRRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
POPRECD  DSECT                     ** PRODUCTION OPTIONS RECORD **              
POPKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
POPKTYP  DS    XL1                 OPTION RECORD TYPE                           
POPKTYPQ EQU   X'2C'                                                            
*++IDENTIFIER                                                                   
POPKSUB  DS    XL1                 OPTION RECORD SUB-RECORD TYPE                
POPKSUBQ EQU   X'20'                                                            
POPKCPY  DS    XL1                 COMPANY CODE                                 
POPKUNT  DS    CL1                 UNIT CODE                                    
POPKLDG  DS    CL1                 LEDGER CODE                                  
POPKOFG  DS    XL1                 OFFICE GROUP OR BINARY ZEROES                
POPKOFC  DS    XL2                 OFFICE CODE OR BINARY ZEROES                 
POPKCLI  DS    XL6                 CLIENT CODE OR BINARY ZEROES                 
POPKPRO  DS    XL6                 PRODUCT CODE OR BINARY ZEROES                
POPKJOB  DS    XL6                 JOB CODE OR BINARY ZEROES                    
POPKMGR  DS    XL1                 MEDIA GROUP OR BINARY ZEROES                 
*                                  X'FF'=MEDIA LEVEL OPTION                     
POPKMED  DS    XL1                 MEDIA CODE OR BINARY ZEROES                  
POPKWGR  DS    XL1                 WORK GROUP OR BINARY ZEROES                  
*                                  X'FF'=WORK CODE LEVEL OPTION                 
POPKWRK  DS    XL2                 WORK CODE OR BINARY ZEROES                   
*++PROCESS OFF                                                                  
POPKLAST EQU   *                                                                
*++PROCESS ON                                                                   
         ORG   POPKEY+L'POPKEY                                                  
*++PROCESS OFF                                                                  
POPKSTA  DS    0XL8                KEY STATUS AREA                              
POPKSSTA DS    XL1                 KEY STATUS                                   
POPKSCOM DS    PL4                 COMMISSION RATE OR BINARY ZEROS              
POPKSTAX DS    CL1                 VAT CODE OR BINARY ZERO                      
POPKSGRP DS    XL1                 OPTION GROUPS PRESENT:                       
         DS    XL1                 N/D                                          
POPKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   POPKSTA                                                          
*++PROCESS ON                                                                   
POPRLEN  DS    XL2                 RECORD LENGTH                                
POPRSTA  DS    0XL8                RECORD STATUS AREA                           
POPRSSTA DS    XL1                 RECORD STATUS                                
POPRSCOM DS    PL4                 COMMISSION RATE OR BINARY ZEROS              
POPRSTAX DS    CL1                 VAT CODE OR BINARY ZERO                      
POPRSGRP DS    XL1                 OPTION GROUPS PRESENT, SEE KEY EQU'S         
POPKSGR1 EQU   X'80'               GROUP 1 OPTION(S) PRESENT                    
POPKSGR2 EQU   X'40'               GROUP 2 OPTION(S) PRESENT                    
POPKSGR3 EQU   X'20'               GROUP 3 OPTION(S) PRESENT                    
POPKSGR4 EQU   X'10'               GROUP 4 OPTION(S) PRESENT                    
POPKSGR5 EQU   X'08'               GROUP 5 OPTION(S) PRESENT                    
POPKSGR6 EQU   X'04'               GROUP 6 OPTION(S) PRESENT                    
POPKSGR7 EQU   X'02'               GROUP 7 OPTION(S) PRESENT                    
POPKSGR8 EQU   X'01'               GROUP 8 OPTION(S) PRESENT                    
         DS    XL1                 N/D                                          
POPRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
POPRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
AJNRECD  DSECT                     ** AUTO JOB NUMBER RECORD **                 
AJNKEY   DS    0CL42                                                            
*++IDENTIFIER                                                                   
AJNKTYP  DS    XL1                 RECORD TYPE X'2C'                            
AJNKTYPQ EQU   X'2C'                                                            
*++IDENTIFIER                                                                   
AJNKSUB  DS    XL1                 SUB RECORD  X'22'                            
AJNKSUBQ EQU   X'22'                                                            
AJNKCUL  DS    0CL3                COMPANY/UNIT/LEDGER                          
AJNKCPY  DS    CL1                 COMPANY                                      
AJNKUNT  DS    CL1                 UNIT                                         
AJNKLDG  DS    CL1                 LEDGER                                       
AJNKOG   DS    CL1                 OFFICE GROUP OR X'00'                        
AJNKOFC  DS    CL2                 OFFICE       OR X'00'                        
AJNKCLI  DS    CL6                 CLIENT       OR X'00'                        
AJNKPRO  DS    CL6                 PRODUCT      OR X'00'                        
AJNKMG   DS    CL1                 MEDIA GROUP  OR X'00'                        
AJNKMED  DS    CL1                 MEDIA        OR X'00'                        
AJNKEFF  DS    XL3                 COMPLEMENT OF PWOS EFFECTIVE DATE            
         ORG   AJNKEY+L'AJNKEY                                                  
*++PROCESS OFF                                                                  
AJNKSTA  DS    XL8                 KEY STATUS                                   
AJNKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   AJNKSTA                                                          
*++PROCESS ON                                                                   
AJNRLEN  DS    XL2                 RECORD LENGTH                                
AJNRSTA  DS    XL1                 RECORD STATUS                                
AJNNDACT EQU   X'10'               RECORD IS DEACTIVATED                        
AJNRLNK  DS    XL4                 LINKAGE ADDRESS                              
*++PROCESS OFF                                                                  
AJNRFST  EQU   *                   DISPLACEMENT OF FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
STURECD  DSECT                     ** STUDIO RECORD **                          
STUKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
STUKTYP  DS    XL1                 STUDIO RECORD TYPE                           
STUKTYPQ EQU   X'2C'                                                            
*++IDENTIFIER                                                                   
STUKSUB  DS    XL1                 STUDIO TYPE SUB-RECORD                       
STUKSUBQ EQU   X'23'                                                            
STUKCPY  DS    XL1                 COMPANY CODE                                 
STUKCODE DS    CL4                 STUDIO TYPE CODE                             
         ORG   STUKEY+L'STUKEY                                                  
*++PROCESS OFF                                                                  
STUKSTA  DS    XL8                 KEY STATUS                                   
STUKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   STUKSTA                                                          
*++PROCESS ON                                                                   
STURLEN  DS    XL2                 RECORD LENGTH                                
STURSTA  DS    XL8                 RECORD STATUS                                
STURLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
STURFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
PRCRECD  DSECT                     ** PRICE LIST RECORD **                      
PRCKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
PRCKTYP  DS    XL1                 PRICE LIST RECORD TYPE                       
PRCKTYPQ EQU   X'2C'                                                            
*++IDENTIFIER                                                                   
PRCKSUB  DS    XL1                 PRICE LIST RECORD SUB-RECORD TYPE            
PRCKSUBQ EQU   X'24'                                                            
PRCKCPY  DS    XL1                 COMPANY CODE                                 
PRCKUNT  DS    CL1                 UNIT CODE                                    
PRCKLDG  DS    CL1                 LEDGER CODE                                  
PRCKOFG  DS    XL1                 OFFICE GROUP                                 
PRCKOFC  DS    XL2                 OFFICE CODE                                  
PRCKCLI  DS    XL6                 CLIENT CODE                                  
PRCKPRO  DS    XL6                 PRODUCT CODE                                 
PRCKJOB  DS    XL6                 JOB CODE                                     
PRCKMGR  DS    XL1                 MEDIA GROUP                                  
PRCKMED  DS    XL1                 MEDIA CODE                                   
PRCKWGR  DS    XL1                 WORK GROUP                                   
PRCKWRK  DS    XL2                 WORK CODE                                    
PRCKEFF  DS    XL3                 EFFECTIVE DATE                               
*++PROCESS OFF                                                                  
PRCKLAST EQU   *                                                                
*++PROCESS ON                                                                   
         ORG   PRCKEY+L'PRCKEY                                                  
*++PROCESS OFF                                                                  
PRCKSTA  DS    0XL8                KEY STATUS                                   
PRCKSTAT DS    XL1                 RECORD STATUS                                
PRCSDELT EQU   X'80'               RECORD IS DELETED                            
PRCSQTRH EQU   X'40'               RECORD DATA IS IN QUARTER HOURS              
         ORG   PRCKSTA+L'PRCKSTA                                                
PRCKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   PRCKSTA                                                          
*++PROCESS ON                                                                   
PRCRLEN  DS    XL2                 RECORD LENGTH                                
PRCRSTA  DS    XL8                 RECORD STATUS                                
PRCRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
PRCRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
SCHRECD  DSECT                     ** SCHEME HEADER RECORD **                   
SCHKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
SCHKTYP  DS    XL1                 SCHEME HEADER RECORD TYPE                    
SCHKTYPQ EQU   X'2C'                                                            
*++IDENTIFIER                                                                   
SCHKSUB  DS    XL1                 SCHEME HEADER RECORD SUB-RECORD TYPE         
SCHKSUBQ EQU   X'30'                                                            
SCHKCPY  DS    XL1                 COMPANY CODE                                 
SCHKUNT  DS    CL1                 UNIT CODE                                    
SCHKLDG  DS    CL1                 LEDGER CODE                                  
SCHKCODE DS    CL8                 SCHEME HEADER CODE                           
         ORG   SCHKEY+L'SCHKEY                                                  
*++PROCESS OFF                                                                  
SCHKSTA  DS    XL8                 KEY STATUS                                   
SCHKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   SCHKSTA                                                          
*++PROCESS ON                                                                   
SCHRLEN  DS    XL2                 RECORD LENGTH                                
SCHRSTA  DS    XL8                 RECORD STATUS                                
SCHRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
SCHRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
CATRECD  DSECT                     ** CATEGORY RECORD **                        
CATKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
CATKTYP  DS    XL1                 CATEGORY RECORD TYPE                         
CATKTYPQ EQU   X'2C'                                                            
*++IDENTIFIER                                                                   
CATKSUB  DS    XL1                 CATEGORY RECORD SUB-RECORD TYPE              
CATKSUBQ EQU   X'32'                                                            
CATKCUL  DS    0XL3                COMPANY/UNIT/LEDGER                          
CATKCPY  DS    XL1                 COMPANY CODE                                 
CATKUNT  DS    CL1                 UNIT CODE                                    
CATKLDG  DS    CL1                 LEDGER CODE                                  
CATKSCH  DS    CL8                 SCHEME CODE                                  
CATKCODE DS    CL2                 CATEGORY CODE                                
         ORG   CATKEY+L'CATKEY                                                  
*++PROCESS OFF                                                                  
CATKSTA  DS    XL8                 KEY STATUS                                   
CATKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   CATKSTA                                                          
*++PROCESS ON                                                                   
CATRLEN  DS    XL2                 RECORD LENGTH                                
CATRSTA  DS    XL8                 RECORD STATUS                                
CATRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
CATRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
PANRECD  DSECT                     ** PANEL RECORDS **                          
PANKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
PANKTYP  DS    XL1                 TEXT RECORD TYPE                             
PANKTYPQ EQU   X'2C'                                                            
*++IDENTIFIER                                                                   
PANKSUB  DS    XL1                 TEXT RECORD SUB-RECORD TYPE                  
PANKSUBQ EQU   X'34'                                                            
PANKCUL  DS    0XL3                COMPANY/UNIT/LEDGER                          
PANKCPY  DS    XL1                 COMPANY CODE                                 
PANKUNT  DS    CL1                 UNIT CODE                                    
PANKLDG  DS    CL1                 LEDGER CODE                                  
PANKCODE DS    CL4                 PANEL CODE                                   
PANKNUM  DS    XL1                 PANEL NUMBER (NON-ZERO=FIELD)                
PANKLANG DS    XL1                 PANEL LANGUAGE                               
PANKNHDR EQU   0                   HEADER RECORD                                
         ORG   PANKEY+L'PANKEY                                                  
*++PROCESS OFF                                                                  
PANKSTA  DS    XL8                 KEY STATUS                                   
PANKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   PANKSTA                                                          
*++PROCESS ON                                                                   
PANRLEN  DS    XL2                 RECORD LENGTH                                
PANRSTA  DS    XL8                 RECORD STATUS                                
PANRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
PANRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
EVERECD  DSECT                     ** ESTIMATE VERSION RECORD **                
EVEKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
EVEKTYP  DS    XL1                 ESTIMATING COLUMN RECORD TYPE                
EVEKTYPQ EQU   X'2C'                                                            
*++IDENTIFIER                                                                   
EVEKSUB  DS    XL1                 ESTIMATING COLUMN SUB-RECORD TYPE            
EVEKSUBQ EQU   X'36'                                                            
EVEKCPY  DS    XL1                 COMPANY CODE                                 
EVEKUNT  DS    CL1                 UNIT CODE                                    
EVEKLDG  DS    CL1                 LEDGER CODE                                  
*                                  COLUMN LIBRARY RECORDS HAVE BINARY           
*                                  ZEROS IN CLIENT/PRODUCT/JOB FIELDS           
EVEKCLI  DS    XL6                 CLIENT CODE                                  
EVEKPRO  DS    XL6                 PRODUCT CODE                                 
EVEKJOB  DS    XL6                 JOB NUMBER                                   
EVEKTYPE DS    CL1                 ESTIMATE TYPE                                
EVEKTPLN EQU   C'P'                PLANNING ESTIMATE                            
EVEKTREV EQU   C'R'                REVISION ESTIMATE                            
EVEKVER  DS    XL1                 VERSION NUMBER                               
EVEKWC   DS    XL2                 WORK-CODE (TIME EST.) OR ZEROES              
EVEKSWC  DS    XL1                 SUB-WORKCODE (TIME EST.) OR ZEROES           
EVEKSEQ  DS    XL1                 SEQUENCE NUMBER OR ZEROES                    
         ORG   EVEKEY+L'EVEKEY                                                  
*++PROCESS OFF                                                                  
EVEKSTA  DS    XL8                 KEY STATUS                                   
         ORG   EVEKSTA                                                          
EVEKSTAT DS    XL1                                                              
EVEKCUR  DS    CL3                 ESTIMATE CURRENCY (IE DENOMINATION)          
         ORG                                                                    
EVEKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   EVEKSTA                                                          
*++PROCESS ON                                                                   
EVERLEN  DS    XL2                 RECORD LENGTH                                
EVERSTA  DS    XL8                 RECORD STATUS                                
         ORG   EVERSTA                                                          
EVERSTAT DS    XL1                                                              
EVERCUR  DS    CL3                 ESTIMATE CURRENCY (IE DENOMINATION)          
         ORG   EVERSTA+L'EVERSTA                                                
EVERLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
EVERFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
TXTRECD  DSECT                     ** TEXT RECORDS **                           
TXTKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
TXTKTYP  DS    XL1                 TEXT RECORD TYPE                             
TXTKTYPQ EQU   X'2C'                                                            
*++IDENTIFIER                                                                   
TXTKSUB  DS    XL1                 TEXT RECORD SUB-RECORD TYPE                  
TXTKSUBQ EQU   X'38'                                                            
TXTKCPY  DS    XL1                 COMPANY CODE                                 
TXTKUNT  DS    CL1                 UNIT CODE                                    
TXTKLDG  DS    CL1                 LEDGER CODE                                  
TXTKOFG  DS    XL1                 OFFICE GROUP                                 
TXTKOFC  DS    XL2                 OFFICE                                       
TXTKCLI  DS    CL6                 CLIENT CODE                                  
TXTKPRO  DS    CL6                 PRODUCT CODE                                 
TXTKJOB  DS    CL6                 JOB NUMBER                                   
TXTKMG   DS    XL1                 MEDIA GROUP                                  
TXTKMED  DS    XL1                 MEDIA                                        
TXTKCAT  DS    XL2                 CATEGORY OR BINARY ZEROES                    
TXTKWRK  DS    XL2                 WORK CODE OR BINARY ZEROES                   
TXTKWSUF DS    XL1                 WORK CODE SUFFIX                             
TXTKFORM DS    CL1                 COMMENT APPEARS:-                            
TXTKFBIL EQU   C'B'                ON BILL                                      
TXTKFEST EQU   C'E'                ON ESTIMATE                                  
TXTKWHER DS    CL2                 PRINT TEXT WHERE                             
TXTKLANG DS    XL1                 TEXT LANGUAGE                                
         ORG   TXTKEY+L'TXTKEY                                                  
*++PROCESS OFF                                                                  
TXTKSTA  DS    XL8                 KEY STATUS                                   
TXTKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   TXTKSTA                                                          
*++PROCESS ON                                                                   
TXTRLEN  DS    XL2                 RECORD LENGTH                                
TXTRSTA  DS    XL8                 RECORD STATUS                                
TXTRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
TXTRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
GRBRECD  DSECT                     ** GROUP BILL RECORD **                      
GRBKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
GRBKTYP  DS    XL1                 GROUP BILL RECORD TYPE                       
GRBKTYPQ EQU   X'2C'                                                            
*++IDENTIFIER                                                                   
GRBKSUB  DS    XL1                 GROUP BILL SUB RECORD TYPE                   
GRBKSUBQ EQU   X'3A'                                                            
GRBKCPY  DS    XL1                 COMPANY                                      
GRBKCLI  DS    CL6                 CLIENT                                       
GRBKBILN DS    CL6                 BILL NUMBER                                  
GRBKBILD DS    PL3                 BILL DATE (9'S COMPLEMENT PWO)               
         ORG   GRBKEY+L'GRBKEY                                                  
*++PROCESS OFF                                                                  
GRBKSTA  DS    XL8                 KEY STATUS                                   
GRBKDA   DS    CL4                 DISK ADDRESS                                 
         ORG   GRBKSTA                                                          
*++PROCESS ON                                                                   
GRBRLEN  DS    CL2                 RECORD LENGTH                                
GRBRSTA  DS    0XL8                RECORD STATUS                                
GRBRGSTA DS    XL1                 GROUP BILL BILLING STATUS                    
GRBSUNBQ EQU   X'40'               GROUP BILL HAS BEEN UNBILLED                 
GRBSPTSQ EQU   X'20'               CREATED BY AC27 (PTS) BILLING                
GRBSPROQ EQU   X'10'               CREATED BY AC21 (PRODUCTION) BILLING         
         DS    XL7                 N/D                                          
GRBRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
GRBRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
SESRECD  DSECT                     ** SESSION ESTIMATE RECORD (US) **           
SESKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
SESKTYP  DS    XL1                 SESSION ESTIMATE RECORD TYPE                 
SESKTYPQ EQU   X'2C'                                                            
*++IDENTIFIER                                                                   
SESKSUB  DS    XL1                 SESSION ESTIMATE SUB-RECORD TYPE             
SESKSUBQ EQU   X'3C'                                                            
SESKCUL  DS    0XL3                COMPANY/UNIT/LEDGER                          
SESKCPY  DS    XL1                 COMPANY CODE                                 
SESKUNT  DS    CL1                 UNIT CODE                                    
SESKLDG  DS    CL1                 LEDGER CODE                                  
SESKCLI  DS    XL6                 CLIENT CODE                                  
SESKPRO  DS    XL6                 PRODUCT CODE                                 
SESKJOB  DS    XL6                 JOB NUMBER                                   
SESKTYPE DS    CL1                 ESTIMATE TYPE                                
SESKTPLN EQU   C'P'                PLANNING ESTIMATE                            
SESKTREV EQU   C'R'                REVISION ESTIMATE                            
SESKVER  DS    XL1                 VERSION NUMBER                               
SESKMED  DS    CL1                 MEDIA                                        
SESKSEQ  DS    XL1                 SEQUENCE NUMBER                              
         ORG   SESKEY+L'SESKEY                                                  
*++PROCESS OFF                                                                  
SESKSTA  DS    XL8                 KEY STATUS                                   
SESKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   SESKSTA                                                          
*++PROCESS ON                                                                   
SESRLEN  DS    XL2                 RECORD LENGTH                                
SESRSTA  DS    XL8                 RECORD STATUS                                
SESRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
SESRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
JCBRECD  DSECT                     ** JOB CYCLE BILLING RECORD(US) **           
JCBKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
JCBKTYP  DS    XL1                 JOB CYCLE BILLING RECORD TYPE                
JCBKTYPQ EQU   X'2C'                                                            
*++IDENTIFIER                                                                   
JCBKSUB  DS    XL1                 JOB CYCLE BILLING SUB-REOCRD TYPE            
JCBKSUBQ EQU   X'3E'                                                            
JCBKCUL  DS    0XL3                COMPANY/UNIT/LEDGER                          
JCBKCPY  DS    XL1                 COMPANY CODE                                 
JCBKUNT  DS    CL1                 UNIT CODE                                    
JCBKLDG  DS    CL1                 LEDGER CODE                                  
JCBKCLI  DS    XL6                 CLIENT CODE                                  
JCBKPRO  DS    XL6                 PRODUCT CODE                                 
JCBKJOB  DS    XL6                 JOB NUMBER                                   
         ORG   JCBKEY+L'JCBKEY                                                  
*++PROCESS OFF                                                                  
JCBKSTA  DS    XL8                 KEY STATUS                                   
JCBKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   JCBKSTA                                                          
*++PROCESS ON                                                                   
JCBRLEN  DS    XL2                 RECORD LENGTH                                
JCBRSTA  DS    XL8                 RECORD STATUS                                
JCBRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
JCBRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
DATRECD  DSECT                     ** PROJECT DATE RECORD **                    
DATKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
DATKTYP  DS    XL1                 PROJECT DATE RECORD TYPE                     
DATKTYPQ EQU   X'2C'                                                            
*++IDENTIFIER                                                                   
DATKSUB  DS    XL1                 PROJECT DATE RECORD SUB-RECORD TYPE          
DATKSUBQ EQU   X'40'                                                            
DATKCULA DS    0CL15                                                            
DATKCPY  DS    XL1                 COMPANY CODE                                 
DATKUNT  DS    CL1                 UNIT CODE                                    
DATKLDG  DS    CL1                 LEDGER CODE                                  
DATKACT  DS    CL12                ACCOUNT CODE                                 
DATKSEQ  DS    XL1                 SEQUENCE NUMBER                              
*++PROCESS OFF                                                                  
DATKEND  EQU   *-DATKEY                                                         
*++PROCESS ON                                                                   
         ORG   DATKEY+L'DATKEY                                                  
*++PROCESS OFF                                                                  
DATKSTA  DS    XL8                 KEY STATUS                                   
DATKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   DATKSTA                                                          
*++PROCESS ON                                                                   
DATRLEN  DS    XL2                 RECORD LENGTH                                
DATRSTA  DS    XL8                 RECORD STATUS                                
DATRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
DATRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
TSLRECD  DSECT                     ** TIME SHEET LIST RECORD **                 
TSLKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
TSLKTYP  DS    XL1                 TIME SHEET LIST RECORD TYPE                  
TSLKTYPQ EQU   X'2C'                                                            
*++IDENTIFIER                                                                   
TSLKSUB  DS    XL1                 TIME SHEET LIST SUB-RECORD TYPE              
TSLKSUBQ EQU   X'42'                                                            
TSLKCULA DS    0CL15                                                            
TSLKCPY  DS    XL1                 COMPANY CODE                                 
TSLKUNT  DS    CL1                 UNIT CODE                                    
TSLKLDG  DS    CL1                 LEDGER CODE                                  
TSLKACT  DS    CL12                ACCOUNT CODE                                 
TSLKSEQ  DS    XL1                 SEQUENCE NUMBER                              
*++PROCESS OFF                                                                  
TSLKEND  EQU   *-TSLKEY                                                         
*++PROCESS ON                                                                   
         ORG   TSLKEY+L'TSLKEY                                                  
*++PROCESS OFF                                                                  
TSLKSTA  DS    XL8                 KEY STATUS                                   
TSLKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   TSLKSTA                                                          
*++PROCESS ON                                                                   
TSLRLEN  DS    XL2                 RECORD LENGTH                                
TSLRSTA  DS    XL8                 RECORD STATUS                                
TSLRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
TSLRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
SUTRECD  DSECT                     ** US SALES/USE TAX RECORDS **               
SUTKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
SUTKTYP  DS    XL1                 SALES/USE TAX RECORD TYPE                    
SUTKTYPQ EQU   X'2D'                                                            
*++IDENTIFIER                                                                   
SUTKSUB  DS    XL1                 SALES/USE TAX SUB-RECORD TYPE                
SUTKSUBQ EQU   X'01'                                                            
SUTKCPY  DS    XL1                 COMPANY CODE                                 
SUTKLOC  DS    CL8                 LOCALITY CODE                                
         ORG   SUTKEY+L'SUTKEY                                                  
*++PROCESS OFF                                                                  
SUTKSTA  DS    XL8                 KEY STATUS                                   
SUTKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   SUTKSTA                                                          
*++PROCESS ON                                                                   
SUTRLEN  DS    XL2                 RECORD LENGTH                                
SUTRSTA  DS    XL8                 RECORD STATUS                                
SUTRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
SUTRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
RESRECD  DSECT                     ** RECEIVABLE STATEMENT RECORDS **           
RESKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
RESKTYP  DS    XL1                 RECEIVABLE STATEMENT RECORD TYPE             
RESKTYPQ EQU   X'2D'                                                            
*++IDENTIFIER                                                                   
RESKSUB  DS    XL1                 RCVABLE STATEMENT SUB-RECORD TYPE            
RESKSUBQ EQU   X'02'                                                            
RESKCPY  DS    XL1                 COMPANY CODE                                 
RESKFORM DS    CL8                 FORMAT CODE                                  
RESKFRML EQU   *-RESRECD                                                        
         DS    XL10                SPACES                                       
*++IDENTIFIER                                                                   
RESKSEQ  DS    XL1                                                              
RESKSREG EQU   X'40'               FORMAT REGULAR                               
RESKS2ND EQU   X'41'               FORMAT REGULAR 2ND RECORD                    
RESKSTXT EQU   X'50'               FORMAT DESCRIPTION TEXT                      
         ORG   RESKEY+L'RESKEY                                                  
*++PROCESS OFF                                                                  
RESKSTA  DS    XL8                 KEY STATUS                                   
RESKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   RESKSTA                                                          
*++PROCESS ON                                                                   
RESRLEN  DS    XL2                 RECORD LENGTH                                
RESRSTA  DS    XL8                 RECORD STATUS                                
RESRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
RESRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
INTRECD  DSECT                     ** INTERAGENCY ESTIMATE RECORDS **           
INTKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
INTKTYP  DS    XL1                 INTERAGENCY ESTIMATE RECORD TYPE             
INTKTYPQ EQU   X'2D'                                                            
*++IDENTIFIER                                                                   
INTKSUB  DS    XL1                 INTERAGENCY ESTIMATE SUB-RECORD              
INTKSUBQ EQU   X'03'                                                            
INTKCULA DS    0XL15               COMPANY/UNIT/LEDGER/ACCOUNT                  
INTKCUL  DS    0XL3                COMPANY/UNIT/LEDGER                          
INTKCPY  DS    XL1                 COMPANY CODE                                 
INTKUNT  DS    XL1                 UNIT CODE                                    
INTKLDG  DS    XL1                 LEDGER CODE                                  
INTKACT  DS    XL12                RECEIVABLE ACCOUNT                           
INTKCLT  DS    XL3                 CLIENT CODE                                  
INTKPRD  DS    XL3                 PRODUCT CODE                                 
INTKMED  DS    XL2                 MEDIA CODE                                   
INTKEST  DS    XL6                 ESTIMATE CODE                                
*++PROCESS OFF                                                                  
INTKSUBL EQU   *-INTKCULA          KEY LENGTH FROM IDJ RECORD                   
INTKEND  EQU   *-INTKEY                                                         
*++PROCESS ON                                                                   
         ORG   INTKEY+L'INTKEY                                                  
*++PROCESS OFF                                                                  
INTKSTA  DS    XL8                 KEY STATUS                                   
INTKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   INTKSTA                                                          
*++PROCESS ON                                                                   
INTRLEN  DS    XL2                 RECORD LENGTH                                
INTRSTA  DS    XL8                 RECORD STATUS                                
INTSMI   EQU   X'02'               MEDIA IS MEDIA INTERFACE RECORD              
INTRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
INTRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
IDJRECD  DSECT                     ** INTERAGENCY DAILY JOURNAL **              
IDJKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
IDJKTYP  DS    XL1                 INTERAGENCY DAILY JOURNAL REC TYPE           
IDJKTYPQ EQU   X'2D'                                                            
*++IDENTIFIER                                                                   
IDJKSUB  DS    XL1                 INTERAGENCY DAILY JOURNAL SUB-REC            
IDJKSUBQ EQU   X'04'                                                            
IDJKDATE DS    PL3                 POSTING DATE (YYMMDD) PWO                    
IDJKCULA DS    0XL15               COMPANY/UNIT/LEDGER/ACCOUNT                  
IDJKCUL  DS    0XL3                COMPANY/UNIT/LEDGER                          
IDJKCPY  DS    XL1                 COMPANY CODE                                 
IDJKUNT  DS    XL1                 UNIT CODE                                    
IDJKLDG  DS    XL1                 LEDGER CODE                                  
IDJKACT  DS    XL12                RECEIVABLE ACCOUNT                           
IDJKCLT  DS    XL3                 CLIENT CODE                                  
IDJKPRD  DS    XL3                 PRODUCT CODE                                 
IDJKMED  DS    XL2                 MEDIA CODE                                   
IDJKEST  DS    XL6                 ESTIMATE CODE                                
*++PROCESS OFF                                                                  
IDJKEND  EQU   *-IDJKEY                                                         
*++PROCESS ON                                                                   
         ORG   IDJKEY+L'IDJKEY                                                  
*++PROCESS OFF                                                                  
IDJKSTA  DS    0XL8                KEY STATUS                                   
IDJKSTAT DS    XL1                 RECORD STATUS                                
IDJKPDAT DS    XL2                 COMPRESSED POSTING DATE                      
         DS    XL5                 N/D                                          
IDJKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   IDJKSTA                                                          
*++PROCESS ON                                                                   
IDJRLEN  DS    XL2                 RECORD LENGTH                                
IDJRSTA  DS    0XL8                RECORD STATUS                                
IDJRSTAT DS    XL1                 RECORD STATUS                                
IDJKSDEL EQU   X'80'               RECORD IS DELETED                            
IDJKPDAT DS    XL2                 COMPRESSED POSTING DATE                      
         DS    XL5                 N/D                                          
IDJKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   IDJKSTA                                                          
IDJRLEN  DS    XL2                 RECORD LENGTH                                
IDJRSTA  DS    0XL8                RECORD STATUS                                
IDJRSTAT DS    XL1                 RECORD STATUS                                
         DS    XL7                 N/D                                          
IDJRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
IDJRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
RATRECD  DSECT                     ** INTEREST RATE RECORDS **                  
RATKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
RATKTYP  DS    XL1                 INTEREST RATE RECORD TYPE                    
RATKTYPQ EQU   X'2D'                                                            
*++IDENTIFIER                                                                   
RATKSUB  DS    XL1                 INTEREST RATE SUB-RECORD TYPE                
RATKSUBQ EQU   X'05'                                                            
RATKCPY  DS    XL1                 COMPANY CODE                                 
*&&UK                                                                           
RATKOFF  DS    CL2                 OFFICE CODE OR SPACES OR X'FFFF'             
RATKACT  DS    CL12                PRODUCTION ACCOUNT CODE OR SPACES            
*&&                                                                             
         ORG   RATKEY+L'RATKEY                                                  
*++PROCESS OFF                                                                  
RATKSTA  DS    XL8                 KEY STATUS                                   
RATKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   RATKSTA                                                          
*++PROCESS ON                                                                   
RATRLEN  DS    XL2                 RECORD LENGTH                                
RATRSTA  DS    XL8                 RECORD STATUS                                
RATRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
RATRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
KWDRECD  DSECT                     ** KEYWORD RECORDS **                        
KWDKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
KWDKTYP  DS    XL1                 RECEIVABLE STATEMENT RECORD TYPE             
KWDKTYPQ EQU   X'2D'                                                            
*++IDENTIFIER                                                                   
KWDKSUB  DS    XL1                 KEYWORD SUB-RECORD TYPE                      
KWDKSUBQ EQU   X'06'                                                            
KWDKCPY  DS    XL1                 COMPANY CODE                                 
KWDKCODE DS    CL6                 KEYWORD CODE                                 
         ORG   KWDKEY+L'KWDKEY                                                  
*++PROCESS OFF                                                                  
KWDKSTA  DS    XL8                 KEY STATUS                                   
KWDKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   KWDKSTA                                                          
*++PROCESS ON                                                                   
KWDRLEN  DS    XL2                 RECORD LENGTH                                
KWDRSTA  DS    XL8                 RECORD STATUS                                
KWDRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
KWDRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
APGRECD  DSECT                     ** APG DESCRIPTION RECORDS **                
APGKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
APGKTYP  DS    XL1                 APG RECORD TYPE                              
APGKTYPQ EQU   X'2D'                                                            
*++IDENTIFIER                                                                   
APGKSUB  DS    XL1                 APG SUB-RECORD TYPE                          
APGKSUBQ EQU   X'07'                                                            
APGKCPY  DS    XL1                 COMPANY CODE                                 
APGKRTY  DS    CL2                 APG REPORT TYPE (FI,M2,IV, ETC.)             
APGKFMT  DS    CL1                 APG FORMAT CODE                              
*++PROCESS OFF                                                                  
APGKFMTL EQU   *-APGRECD                                                        
*++PROCESS ON                                                                   
         ORG   APGKEY+L'APGKEY                                                  
*++PROCESS OFF                                                                  
APGKSTA  DS    XL8                 KEY STATUS                                   
APGKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   APGKSTA                                                          
*++PROCESS ON                                                                   
APGRLEN  DS    XL2                 RECORD LENGTH                                
APGRSTA  DS    XL8                 RECORD STATUS                                
APGRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
APGRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
GSBRECD  DSECT                     ** GERMAN SPLIT BILLING RECORD **            
GSBKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
GSBKTYP  DS    XL1                 SPLIT BILLING RECORD TYPE                    
GSBKTYPQ EQU   X'2E'                                                            
GSBKCPY  DS    XL1                 COMPANY CODE                                 
GSBKCLI  DS    CL6                 CLIENT CODE                                  
         DS    CL1                 BINARY ZERO (SCHEME NUMBER)                  
GSBKRCPY DS    XL1                 RECEIVABLE COMPANY CODE                      
GSBKRUNT DS    CL1                 RECEIVABLE UNIT CODE                         
GSBKRLDG DS    CL1                 RECEIVABLE LEDGER CODE                       
GSBKRACT DS    CL12                RECEIVABLE ACCOUNT CODE                      
         ORG   GSBKEY+L'GSBKEY                                                  
*++PROCESS OFF                                                                  
GSBKSTA  DS    XL8                 KEY STATUS                                   
GSBKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   GSBKSTA                                                          
*++PROCESS ON                                                                   
GSBRLEN  DS    XL2                 RECORD LENGTH                                
GSBRSTA  DS    XL8                 RECORD STATUS                                
GSBRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
GSBRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
MPDRECD  DSECT                     ** MEDIA POSTING DETAIL RECORD **            
MPDKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
MPDKTYP  DS    XL1                 MEDIA POSTING DETAIL RECORD TYPE             
MPDKTYPQ EQU   X'2F'                                                            
*++IDENTIFIER                                                                   
MPDKSUB  DS    XL1                 RECORD SUB-TYPE                              
MPDKSUBQ EQU   X'00'               POSTING DETAIL                               
MPDKCPY  DS    XL1                 COMPANY CODE                                 
         DS    XL9                 N/D                                          
MPDKALPH DS    CL2                 AGENCY ALPHA                                 
MPDKSYS  DS    CL1                 SYSTEM                                       
MPDKMED  DS    CL1                 MEDIA                                        
MPDKCLI  DS    CL3                 CLIENT                                       
MPDKPRD  DS    CL3                 PRODUCT                                      
MPDKEST  DS    CL4                 ESTIMATE                                     
MPDKPER  DS    CL4                 BILL MONTH (YYMM)                            
MPDKMOS  DS    CL4                 MONTH OF SERVICE (YYMM)                      
MPDKINV  DS    CL5                 INVOICE NUMBER                               
         DS    XL1                 N/D                                          
MPDKSEQ  DS    XL1                 SEQUENCE                                     
         DS    XL1                 N/D                                          
         ORG   MPDKEY+L'MPDKEY                                                  
*++PROCESS OFF                                                                  
MPDKSTA  DS    XL8                 KEY STATUS                                   
MPDKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   MPDKSTA                                                          
*++PROCESS ON                                                                   
MPDRLEN  DS    XL2                 RECORD LENGTH                                
MPDRSTA  DS    XL8                 RECORD STATUS                                
MPDRLNK  DS    CL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
MPDRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
MPRRECD  DSECT                     ** MEDIA POSTING RULES RECORD **             
MPRKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
MPRKTYP  DS    XL1                 MEDIA POSTING PROFILE TYPE                   
MPRKTYPQ EQU   X'2F'                                                            
*++IDENTIFIER                                                                   
MPRKSUB  DS    XL1                 RECORD SUB-TYPE                              
MPRKSUBQ EQU   X'01'               POSTING PROFILE                              
MPRKCPY  DS    XL1                 COMPANY CODE                                 
         DS    XL26                N/D                                          
MPRKALPH DS    CL2                 AGENCY ALPHA                                 
MPRKSYS  DS    CL1                 SYSTEM                                       
MPRKMED  DS    CL1                 MEDIA                                        
MPRKOFC  DS    CL2                 OFFICE OR OFFICE GROUP                       
MPRKCLI  DS    CL3                 CLIENT                                       
MPRKPRD  DS    CL3                 PRODUCT                                      
*++IDENTIFIER                                                                   
MPRKPRO  DS    XL1                 PROFILE TYPE                                 
MPRKREG  EQU   X'01'               REGULAR BILLING                              
MPRKAOR  EQU   X'02'               AOR BILLING                                  
MPRKRTL  EQU   X'03'               RETAIL BILLING                               
MPRKPPB  EQU   X'04'               SPECIAL PRINT PROD BILLING                   
MPRKUC   EQU   X'05'               REGULAR UPFRONT COMMISSION BILLING           
MPRKUN   EQU   X'06'               REGULAR UPFRONT NET BILLING                  
MPRKUAC  EQU   X'07'               AOR UPFRONT COMMISSION BILLING               
MPRKUAN  EQU   X'08'               AOR UPFRONT NET BILLING                      
MPRKPST  EQU   X'09'               PST RECORD (FOR ALL BILLING TYPES)           
MPRKDIF  EQU   X'0A'               DPOST (ACT MINUS ASSIGNED BILLING)           
         ORG   MPRKEY+L'MPRKEY                                                  
*++PROCESS OFF                                                                  
MPRKSTA  DS    XL8                 KEY STATUS                                   
MPRKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   MPRKSTA                                                          
*++PROCESS ON                                                                   
MPRRLEN  DS    XL2                 RECORD LENGTH                                
MPRRSTA  DS    XL8                 RECORD STATUS                                
MPRRLNK  DS    CL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
MPRRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
OAPRECD  DSECT                     ** OFFICE/ACCOUNT PASSIVE POINTER **         
OAPKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
OAPKTYP  DS    XL1                 RECORD TYPE                                  
OAPKTYPQ EQU   X'30'                                                            
OAPKCUL  DS    0XL3                COMPANY/UNIT/LEDGER                          
OAPKCPY  DS    XL1                 COMPANY CODE                                 
OAPKUNT  DS    CL1                 UNIT CODE                                    
OAPKLDG  DS    CL1                 LEDGER CODE                                  
OAPKOFF  DS    XL2                 OFFICE CODE                                  
OAPKACT  DS    XL12                ACCOUNT CODE                                 
OAPKEND  EQU   *-OAPKEY                                                         
         ORG   OAPKEY+L'OAPKEY                                                  
*++PROCESS OFF                                                                  
OAPKSTA  DS    XL8                 STATUS                                       
OAPKDA   DS    XL4                 DISK ADDRESS                                 
*++PROCESS ON                                                                   
         SPACE 1                                                                
ANCRECD  DSECT                     ** ACCOUNT NAME CHANGE POINTER **            
ANCKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
ANCKTYP  DS    XL1                 RECORD TYPE                                  
ANCKTYPQ EQU   X'31'                                                            
ANCKCULA DS    XL15                ACCOUNT CODE                                 
ANCKEND  EQU   *-ANCKEY                                                         
         ORG   ANCKEY+L'ANCKEY                                                  
ANCKSTA  DS    0XL8                KEY STATUS AREA                              
ANCKSTAT DS    XL1                 STATUS                                       
ANCSDELT EQU   X'80'               DELETED (ALWAYS ON FOR ANC RECORDS)          
         DS    XL7                 N/D                                          
ANCKDA   DS    XL4                 DISK ADDRESS OF ACCOUNT RECORD               
*++PROCESS OFF                                                                  
         SPACE 1                                                                
*++PROCESS ON                                                                   
SRCRECD  DSECT                     ** NAME SEARCH POINTER **                    
SRCKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
SRCKTYP  DS    XL1                 RECORD TYPE                                  
SRCKTYPQ EQU   X'32'                                                            
SRCKCUL  DS    0XL3                COMPANY/UNIT/LEDGER                          
SRCKCPY  DS    XL1                 COMPANY CODE                                 
SRCKUL   DS    0CL2                UNIT/LEDGER                                  
SRCKUNT  DS    CL1                 UNIT CODE                                    
SRCKLDG  DS    CL1                 LEDGER CODE                                  
SRCKSUB  DS    XL1                 RECORD SUB-TYPE                              
SRCKWDSQ EQU   X'01'               WORD FOLLOWED BY SEQUENCE NO.                
SRCKSQWD EQU   X'02'               SEQUENCE NO. FOLLOWED BY WORD                
         DS    XL12                N/D                                          
SRCKWRD1 DS    XL10                WORD          (IF SUB-TYPE SRCKWDSQ)         
SRCKSEQ1 DS    XL3                 SEQUENCE NO.                                 
         ORG   SRCKWRD1                                                         
SRCKSEQ2 DS    XL3                 SEQUENCE NO.  (IF SUB-TYPE SRCKSQWD)         
SRCKWRD2 DS    XL10                WORD                                         
SRCKACT  DS    CL12                ACCOUNT CODE                                 
*++PROCESS OFF                                                                  
SRCKEND  EQU   *-SRCKEY                                                         
*++PROCESS ON                                                                   
         ORG   SRCKEY+L'SRCKEY                                                  
*++PROCESS OFF                                                                  
SRCKSTA  DS    XL8                 KEY STATUS AREA OF PARENT RECORD             
SRCKDA   DS    XL4                 DISK ADDRESS OF PARENT RECORD                
*++PROCESS ON                                                                   
         SPACE 1                                                                
SAPRECD  DSECT                     ** SEARCH ACCOUNT CODE POINTER **            
SAPKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
SAPKTYP  DS    XL1                 RECORD TYPE                                  
SAPKTYPQ EQU   X'32'                                                            
SAPKCUL  DS    0XL3                COMPANY/UNIT/LEDGER                          
SAPKCPY  DS    XL1                 COMPANY CODE                                 
SAPKUL   DS    0CL2                UNIT/LEDGER                                  
SAPKUNT  DS    CL1                 UNIT CODE                                    
SAPKLDG  DS    CL1                 LEDGER CODE                                  
*++IDENTIFIER                                                                   
SAPKSUB  DS    XL1                 RECORD SUB-TYPE                              
SAPKSUBQ EQU   X'03'                                                            
         DS    XL22                N/D                                          
SAPKLVL  DS    XL1                 ACCOUNT LEVEL                                
SAPKACT  DS    CL12                ACCOUNT CODE                                 
*++PROCESS OFF                                                                  
SAPKEND  EQU   *-SAPKEY                                                         
*++PROCESS ON                                                                   
         ORG   SAPKEY+L'SAPKEY                                                  
*++PROCESS OFF                                                                  
SAPKSTA  DS    0XL8                KEY STATUS AREA                              
SAPKSTAT DS    XL1                 STATUS                                       
SAPSDELT EQU   X'80'               DELETED                                      
SAPKSEQ  DS    XL3                 SEQUENCE NUMBER                              
         ORG   SAPKSTA+L'SAPKSTA                                                
SAPKDA   DS    XL4                 DISK ADDRESS OF PARENT RECORD                
*++PROCESS ON                                                                   
         SPACE 1                                                                
SANRECD  DSECT                     ** SEARCH ACCOUNT NAME POINTER **            
SANKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
SANKTYP  DS    XL1                 RECORD TYPE                                  
SANKTYPQ EQU   X'32'                                                            
SANKCUL  DS    0XL3                COMPANY/UNIT/LEDGER                          
SANKCPY  DS    XL1                 COMPANY CODE                                 
SANKUL   DS    0CL2                UNIT/LEDGER                                  
SANKUNT  DS    CL1                 UNIT CODE                                    
SANKLDG  DS    CL1                 LEDGER CODE                                  
*++IDENTIFIER                                                                   
SANKSUB  DS    XL1                 RECORD SUB-TYPE                              
SANKSUBQ EQU   X'04'                                                            
SANKNAME DS    XL34                ACCOUNT NAME                                 
SANKSEQ  DS    XL3                 SEQUENCE NUMBER                              
SANKEND  EQU   *-SANKEY                                                         
         ORG   SANKEY+L'SANKEY                                                  
SANKSTA  DS    0XL8                KEY STATUS AREA                              
SANKSTAT DS    XL1                 STATUS                                       
SANSDELT EQU   X'80'               DELETED                                      
SANKLVL  DS    XL1                 ACCOUNT LEVEL                                
         ORG   SANKSTA+L'SANKSTA                                                
SANKDA   DS    XL4                 DISK ADDRESS OF PARENT RECORD                
*++PROCESS OFF                                                                  
         SPACE 1                                                                
*++PROCESS ON                                                                   
SWCRECD  DSECT                     ** WORK-CODE NAME SEARCH POINTER **          
SWCKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
SWCKTYP  DS    XL1                 RECORD TYPE                                  
SWCKTYPQ EQU   X'32'                                                            
SWCKCPY  DS    XL1                 COMPANY CODE                                 
SWCKSRC  DS    XL1                 SEARCH TYPE                                  
SWCKSRCQ EQU   X'01'                                                            
SWCKUL   DS    CL2                 UNIT/LEDGER CODE                             
*++IDENTIFIER                                                                   
SWCKSUB  DS    XL1                 RECORD SUB-TYPE                              
SWCKWDSQ EQU   X'01'               WORD FOLLOWED BY SEQUENCE NO.                
SWCKSQWD EQU   X'02'               SEQUENCE NO. FOLLOWED BY WORD                
         DS    XL21                N/D                                          
SWCKWRD1 DS    CL10                WORD          (IF SUB-TYPE SWCKWDSQ)         
SWCKSEQ1 DS    XL3                 SEQUENCE NO.                                 
         ORG   SWCKWRD1                                                         
SWCKSEQ2 DS    XL3                 SEQUENCE NO.  (IF SUB-TYPE SWCKSQWD)         
SWCKWRD2 DS    CL10                WORD                                         
SWCKWC   DS    CL2                 WORK-CODE                                    
*++PROCESS OFF                                                                  
SWCKEND  EQU   *-SWCRECD                                                        
*++PROCESS ON                                                                   
         ORG   SWCKEY+L'SWCKEY                                                  
*++PROCESS OFF                                                                  
SWCKSTA  DS    XL8                 KEY STATUS AREA OF PARENT RECORD             
SWCKDA   DS    XL4                 DISK ADDRESS OF PARENT RECORD                
*++PROCESS ON                                                                   
         SPACE 1                                                                
SMCRECD  DSECT                     ** MEDIA CODE NAME SEARCH POINTER **         
SMCKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
SMCKTYP  DS    XL1                 RECORD TYPE                                  
SMCKTYPQ EQU   X'32'                                                            
SMCKCPY  DS    XL1                 COMPANY CODE                                 
SMCKSRC  DS    XL1                 SEARCH TYPE                                  
SMCKSRCQ EQU   X'02'                                                            
*++IDENTIFIER                                                                   
SMCKSUB  DS    XL1                 RECORD SUB-TYPE                              
SMCKWDSQ EQU   X'01'               WORD FOLLOWED BY SEQUENCE NO.                
SMCKSQWD EQU   X'02'               SEQUENCE NO. FOLLOWED BY WORD                
         DS    XL24                N/D                                          
SMCKWRD1 DS    CL10                WORD          (IF SUB-TYPE SMCKWDSQ)         
SMCKSEQ1 DS    XL3                 SEQUENCE NO.                                 
         ORG   SMCKWRD1                                                         
SMCKSEQ2 DS    XL3                 SEQUENCE NO.  (IF SUB-TYPE SMCKSQWD)         
SMCKWRD2 DS    CL10                WORD                                         
SMCKMC   DS    CL1                 MEDIA CODE                                   
*++PROCESS OFF                                                                  
SMCKEND  EQU   *-SMCRECD                                                        
*++PROCESS ON                                                                   
         ORG   SMCKEY+L'SMCKEY                                                  
*++PROCESS OFF                                                                  
SMCKSTA  DS    XL8                 KEY STATUS AREA OF PARENT RECORD             
SMCKDA   DS    XL4                 DISK ADDRESS OF PARENT RECORD                
*++PROCESS ON                                                                   
         SPACE 1                                                                
PBRRECD  DSECT                     ** PRODUCTION BILL RECORDS **                
PBRKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
PBRKTYP  DS    XL1                 RECORD TYPE                                  
PBRKTYPQ EQU   X'33'                                                            
PBRKCPY  DS    XL1                 COMPANY CODE                                 
PBRKSUB  DS    XL1                 SUB-RECORD TYPE                              
PBRKACTQ EQU   1                   ACTIVE RECORD                                
PBRKJOB  DS    CL12                JOB CODE                                     
PBRKSEQ  DS    XL2                 SEQUENCE#  (COMPLEMENT)                      
PBRKPARA DS    XL1                 PARAGRAPH# (ZERO=BILL HEADER)                
PBRKLINE DS    XL1                 LINE#      (ZERO=PARAGRAPH HEADER)           
         ORG   PBRKEY                                                           
*++PROCESS OFF                                                                  
         SPACE 1                                                                
*++PROCESS ON                                                                   
PBRPAS   DS    0XL42                                                            
*++IDENTIFIER                                                                   
PBRPTYP  DS    XL1                 RECORD TYPE                                  
PBRPTYPQ EQU   X'33'                                                            
PBRPCPY  DS    XL1                 COMPANY CODE                                 
PBRPSUB  DS    XL1                 SUB-RECORD TYPE                              
PBRPPASQ EQU   2                   PASSIVE RECORD                               
PBRPBLNO DS    CL6                 BILL NUMBER                                  
PBRPIND  DS    CL1                 DRAFT/LIVE INDICATOR                         
PBRPIDFT EQU   C'D'                DRAFT BILL                                   
PBRPILVE EQU   C'L'                LIVE BILL                                    
PBRPUSER DS    XL2                 USER-ID                                      
PBRPJOB  DS    CL12                JOB CODE                                     
PBRPCRED DS    XL2                 CREATED DATE                                 
PBRPBILD DS    XL2                 BILLED DATE  (ZERO=DRAFT BILL)               
PBRPFORM DS    XL1                 FORMAT CODE                                  
PBRPPERS DS    XL2                 PERSON CODE                                  
         ORG   PBRKEY+L'PBRKEY                                                  
*++PROCESS OFF                                                                  
PBRKSTA  DS    0XL8                KEY STATUS                                   
PBRKSTAT DS    XL1                 RECORD STATUS                                
PBRSDELT EQU   X'80'               RECORD IS DELETED                            
PBRKEXPD DS    XL2                 EXPIRY DATE  (PASSIVE ONLY)                  
PBRKBILD DS    XL2                 BILLED DATE  (ZERO=DRAFT BILL)               
PBRKSTA2 DS    XL1                                                              
PBRSAUTR EQU   X'80'               THIS IS AN AUTOREV BILL                      
PBRKLSTA DS    XL1                 LINE STATUS (LINE RECORD ONLY)               
PBRLTOT  EQU   X'80'               TOTAL LINE                                   
PBRLSUB  EQU   X'40'               SUB-TOTAL LINE                               
PBRLNUM  EQU   X'20'               NUMBERS WITHIN TEXT                          
PBRLTXT  EQU   X'00'               TEXT ONLY                                    
*++PROCESS ON                                                                   
         ORG   PBRKSTA+L'PBRKSTA                                                
*++PROCESS OFF                                                                  
PBRKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   PBRKSTA                                                          
*++PROCESS ON                                                                   
PBRRLEN  DS    XL2                 RECORD LENGTH                                
PBRRSTA  DS    0XL8                                                             
PBRRSTAT DS    XL1                 RECORD STATUS                                
PBRREXPD DS    XL2                 EXPIRY DATE  (PASSIVE ONLY)                  
PBRRBILD DS    XL2                 BILLED DATE  (ZERO=DRAFT BILL)               
PBRRSTA2 DS    XL1                                                              
PBRRLSTA DS    XL1                 LINE STATUS                                  
         ORG   PBRRSTA+L'PBRRSTA                                                
PBRRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
PBRRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
PBCRECD  DSECT                     ** PRODUCTION BILL CONTROL RECORD **         
PBCKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
PBCKTYP  DS    XL1                 RECORD TYPE                                  
PBCKTYPQ EQU   X'33'                                                            
PBCKCPY  DS    XL1                 COMPANY CODE                                 
*++IDENTIFIER                                                                   
PBCKSUB  DS    XL1                 SUB-RECORD TYPE                              
PBCKCONQ EQU   0                   CONTROL RECORD                               
PBCKFMT  DS    XL1                 FORMAT NUMBER                                
PBCKLANG DS    XL1                 LANGUAGE CODE                                
PBCKSEQ  DS    XL1                 RECORD SEQUENCE NUMBER                       
         ORG   PBCKEY+L'PBCKEY                                                  
*++PROCESS OFF                                                                  
PBCKSTA  DS    0XL8                KEY STATUS AREA                              
PBCKSTAT DS    XL1                 STATUS                                       
PBCSDELT EQU   X'80'               RECORD IS DELETED                            
PBCKTRNQ EQU   01                  ONE TRANSACTION PER PARAGRAPH                
PBCKWCQ  EQU   02                  ONE WORKCODE PER PARAGRAPH                   
PBCKWGQ  EQU   03                  ONE WORKGROUP PER PARAGRAPH                  
PBCKHRSQ EQU   04                  GROUP HOURLY WORKCODES                       
PBCKUSEQ EQU   05                  USER SPECIFIED AT ALLOCATION TIME            
PBCKSTA2 DS    XL1                 STATUS 2                                     
PBCSHRSF EQU   X'80'               HOUR PARAGRAPHS FIRST                        
PBCSOOPF EQU   X'40'               COST PARAGRAPHS FIRST                        
PBCKGRPC DS    XL1                 GROUPING BASIS FOR COSTS                     
*++PROCESS ON                                                                   
         ORG   PBCKSTA+L'PBCKSTA                                                
*++PROCESS OFF                                                                  
PBCKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   PBCKSTA                                                          
*++PROCESS ON                                                                   
PBCRLEN  DS    XL2                 RECORD LENGTH                                
PBCRRESQ EQU   750                 BYTES RESERVED FOR NAME,FORMOPTS ETC         
PBCRSTA  DS    0XL8                RECORD STATUS AREA                           
PBCRSTAT DS    XL1                 STATUS                                       
PBCRGRPB DS    XL1                 GROUPING BASIS                               
PBCRSTA2 DS    XL1                 STATUS 2                                     
PBCRGRPC DS    XL1                 GROUPING BASIS FOR COSTS                     
         ORG   PBCRSTA+L'PBCRSTA                                                
PBCRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
PBCRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
PBSRECD  DSECT                     ** BILL SECTION DEFINITION REC **            
PBSKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
PBSKTYP  DS    XL1                 RECORD TYPE                                  
PBSKTYPQ EQU   X'33'                                                            
PBSKCPY  DS    XL1                 COMPANY CODE                                 
*++IDENTIFIER                                                                   
PBSKSUB  DS    XL1                 SUB-RECORD TYPE                              
PBSKDEFQ EQU   3                   SECTION DEFINITION RECORD                    
PBSKFMT  DS    XL1                 FORMAT NUMBER                                
PBSKSEC  DS    XL1                 SECTION NUMBER                               
PBSKLANG DS    XL1                 LANGUAGE CODE                                
         ORG   PBSKEY+L'PBSKEY                                                  
*++PROCESS OFF                                                                  
PBSKSTA  DS    0XL8                KEY STATUS AREA                              
PBSKSTAT DS    XL1                 STATUS                                       
PBSKDELT EQU   X'80'               RECORD IS DELETED                            
*++PROCESS ON                                                                   
         ORG   PBSKSTA+L'PBSKSTA                                                
*++PROCESS OFF                                                                  
PBSKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   PBSKSTA                                                          
*++PROCESS ON                                                                   
PBSRLEN  DS    XL2                 RECORD LENGTH                                
PBSRSTA  DS    0XL8                RECORD STATUS AREA                           
PBSRSTAT DS    XL1                 STATUS                                       
         ORG   PBSRSTA+L'PBSRSTA                                                
PBSRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
PBSRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
BFMRECD  DSECT                     ** PC BILLING FORMAT RECORD **               
BFMKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
BFMKTYP  DS    XL1                 RECORD TYPE                                  
BFMKTYPQ EQU   X'33'                                                            
BFMKCPY  DS    XL1                 COMPANY CODE                                 
*++IDENTIFIER                                                                   
BFMKSUB  DS    XL1                 SUB-RECORD TYPE                              
BFMKSUBQ EQU   X'04'                                                            
BFMKFMT  DS    XL1                 FORMAT NUMBER                                
BFMKLANG DS    XL1                 LANGUAGE CODE                                
BFMKLVL  DS    XL2                 LEVEL                                        
BFMKLCPQ EQU   X'0100'             COVER PAGE                                   
BFMKLMNQ EQU   X'0200'             MAIN BILL                                    
BFMKLSMQ EQU   X'0300'             SUMMARY                                      
BFMKWHER DS    XL2                 WHERE                                        
BFMKWPHQ EQU   X'0500'             PAGE HEADER                                  
BFMKWGHQ EQU   X'0600'             GROUPING HEADER                              
BFMKWBDQ EQU   X'0700'             BODY OF BILL                                 
BFMKWGTQ EQU   X'1100'             GROUPING TOTALS                              
BFMKWBTQ EQU   X'1300'             BILL TOTALS                                  
BFMKWPFQ EQU   X'1800'             PAGE FOOTER                                  
BFMKSECT DS    XL1                 SECTION NUMBER (FOR BODY OF BILL)            
BFMKSWHR DS    XL2                 WHERE WITHIN SECTION (BODY OF BILL)          
BFMKSHPQ EQU   X'0900'             HEADINGS PER PAGE                            
BFMKSHSQ EQU   X'0A00'             HEADINGS PER SECTION                         
BFMKSSHQ EQU   X'0C00'             SUB-HEADING                                  
BFMKSPRQ EQU   X'0E00'             SECTION PARAGRAPGH                           
BFMKSSTQ EQU   X'0F00'             SUB-TOTAL                                    
BFMKSTOQ EQU   X'1000'             SECTION TOTAL                                
BFMKSWSQ DS    XL1                 SUB-TOTAL SEQUENCE NUMBER                    
         DS    XL28                N/D                                          
BFMKSEQ  DS    XL1                 SEQUENCE NUMBER                              
         ORG   BFMKEY+L'BFMKEY                                                  
*++PROCESS OFF                                                                  
*                                                                               
BFMKSTA  DS    0XL8                KEY STATUS                                   
BFMKSTAT DS    XL1                 STATUS BYTE                                  
BFMSDELT EQU   X'80'               RECORD DELETED                               
BFMSCONT EQU   X'40'               RECORD CONTINUED ON NEXT BFMKSEQ             
*++PROCESS ON                                                                   
         ORG   BFMKSTA+L'BFMKSTA                                                
*++PROCESS OFF                                                                  
BFMKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   BFMKSTA                                                          
*++PROCESS ON                                                                   
BFMRLEN  DS    XL2                 RECORD LENGTH                                
BFMRSTA  DS    0XL8                RECORD STATUS                                
BFMRSTAT DS    XL1                 STATUS BYTE                                  
         ORG   BFMRSTA+L'BFMRSTA                                                
BFMRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
BFMRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
BEDRECD  DSECT                     ** PC BILLING EDIT RECORD **                 
BEDKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
BEDKTYP  DS    XL1                 RECORD TYPE                                  
BEDKTYPQ EQU   X'33'                                                            
BEDKCPY  DS    XL1                 COMPANY CODE                                 
BEDKSUB  DS    XL1                 SUB-RECORD TYPE                              
*++IDENTIFIER                                                                   
BEDKSUBQ EQU   X'05'                                                            
BEDKJOB  DS    CL12                JOB CODE                                     
BEDKJSEQ DS    XL2                 JOB SEQUENCE NUMBER (COMPLEMENT)             
BEDKLVL  DS    XL2                 LEVEL                                        
BEDKLADV EQU   X'0080'             ADVANCE (SPECIAL RECORD)                     
BEDKLCPQ EQU   X'0100'             COVER PAGE                                   
BEDKLMNQ EQU   X'0200'             MAIN BILL                                    
BEDKLSMQ EQU   X'0300'             SUMMARY                                      
BEDKWHER DS    XL2                 WHERE                                        
BEDKWPHQ EQU   X'0500'             PAGE HEADER                                  
BEDKWGHQ EQU   X'0600'             GROUPING HEADER                              
BEDKWBDQ EQU   X'0700'             BODY OF BILL                                 
BEDKWGTQ EQU   X'1100'             GROUPING TOTALS                              
BEDKWBTQ EQU   X'1300'             BILL TOTALS                                  
BEDKWVAQ EQU   X'1400'             VAT ANALYSIS                                 
BEDKWPBQ EQU   X'1600'             PREVBILLS                                    
BEDKWPFQ EQU   X'1800'             PAGE FOOTER                                  
BEDKSSEQ DS    XL1                 BODY OF BILL SECTION SEQUENCE NUMBER         
BEDKPARA DS    XL2                 BODY OF BILL PARAGRAPH NUMBER                
         DS    XL17                N/D                                          
BEDKSEQ  DS    XL1                 SEQUENCE NUMBER                              
         ORG   BEDKEY+L'BEDKEY                                                  
         ORG   BEDKEY                                                           
*++PROCESS OFF                                                                  
BEDPAS   DS    0XL42               ** PC BILLING EDIT PASSIVE **                
BEDPTYP  DS    XL1                 RECORD TYPE                                  
BEDPTYPQ EQU   X'33'                                                            
BEDPCPY  DS    XL1                 COMPANY CODE                                 
BEDPSUB  DS    XL1                 SUB-RECORD TYPE                              
BEDPSUBQ EQU   X'06'                                                            
BEDPBLNO DS    CL6                 BILL NUMBER                                  
BEDPIND  DS    CL1                 DRAFT/LIVE INDICATOR                         
BEDPIDFT EQU   C'D'                DRAFT BILL                                   
BEDPILVE EQU   C'L'                LIVE BILL                                    
BEDPUSER DS    XL2                 USER-ID                                      
BEDPJOB  DS    CL12                JOB CODE                                     
BEDPCRED DS    XL2                 CREATED DATE                                 
BEDPBILD DS    XL2                 BILLED DATE  (ZERO=DRAFT BILL)               
BEDPFORM DS    XL1                 FORMAT CODE                                  
BEDPPERS DS    XL2                 PERSON CODE                                  
*++PROCESS ON                                                                   
         ORG   BEDKEY+L'BEDKEY                                                  
*++PROCESS OFF                                                                  
BEDKSTA  DS    0XL8                KEY STATUS                                   
BEDKSTAT DS    XL1                 STATUS BYTE                                  
BEDSDELT EQU   X'80'               RECORD DELETED                               
BEDSCONT EQU   X'40'               RECORD CONTINUED ON NEXT BEDKSEQ             
BEDSPAN  EQU   X'20'               RECORD CONTAINS PANEL BFMELDS                
*                                  * BILL HEADER AND PASSIVE ONLY *             
BEDKEXPD DS    XL2                 EXPIRY DATE                                  
BEDKBILD DS    XL2                 BILLED DATE                                  
BEDKSTA2 DS    XL1                 STATUS BYTE 2                                
BEDSAUTR EQU   X'80'               THIS IS AN AUTO REV BILL                     
         ORG   BEDKSTAT+L'BEDKSTAT * BODY OF BILL LEVELS *                      
BEDKSECT DS    XL1                 SECTION NUMBER                               
BEDKSLVL DS    XL2                 SECTION PARAGRAPH LEVEL                      
BEDKSHPQ EQU   X'0900'             HEADINGS PER PAGE                            
BEDKSHSQ EQU   X'0A00'             HEADINGS PER SECTION                         
BEDKSSHQ EQU   X'0C00'             SUB-HEADING                                  
BEDKSTXQ EQU   X'0D00'             SECTION PARAGRAPH (TEXT ONLY)                
BEDKSPRQ EQU   X'0E00'             SECTION PARAGRAPGH (WITH AMOUNTS)            
BEDKSSTQ EQU   X'0F00'             SUB-TOTAL                                    
BEDKSTOQ EQU   X'1000'             SECTION TOTAL                                
BEDKSSUB DS    XL1                 SUB-SECTION LEVEL                            
         ORG   BEDKSTA+L'BEDKSTA                                                
BEDKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   BEDKSTA                                                          
*++PROCESS ON                                                                   
BEDRLEN  DS    XL2                 RECORD LENGTH                                
BEDRSTA  DS    0XL8                RECORD STATUS                                
BEDRSTAT DS    XL1                 STATUS BYTE                                  
BEDREXPD DS    XL2                 EXPIRY DATE                                  
BEDRBILD DS    XL2                 BILLED DATE                                  
BEDRSTA2 DS    XL1                 STATUS BYTE 2                                
         ORG   BEDRSTAT+L'BEDRSTAT                                              
BEDRSECT DS    XL1                 SECTION NUMBER                               
BEDRSLVL DS    XL2                 SECTION PARAGRAPH LEVEL                      
BEDRSSUB DS    XL1                 SUB-SECTION LEVEL                            
         ORG   BEDRSTA+L'BEDRSTA                                                
BEDRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
BEDRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
PTARECD  DSECT                     ** PRODUCTION TRANSACTN ACTIVITY **          
PTAKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
PTAKTYP  DS    XL1                 RECORD TYPE                                  
PTAKTYPQ EQU   X'34'                                                            
PTAKCPY  DS    XL1                 COMPANY CODE                                 
PTAKJOB  DS    CL12                JOB CODE                                     
PTAKSEQN DS    XL2                 SEQUENCE NUMBER (COMPLEMENTED)               
         ORG   PTAKEY+L'PTAKEY                                                  
*++PROCESS OFF                                                                  
PTAKSTA  DS    0XL8                KEY STATUS AREA                              
PTAKSTAT DS    XL1                 STATUS                                       
PTASDELT EQU   X'80'               DELETED                                      
         DS    XL7                 N/D                                          
PTAKDA   DS    XL4                 DISK ADDRESS OF ACCOUNT RECORD               
         ORG   PTAKSTA                                                          
*++PROCESS ON                                                                   
PTARLEN  DS    XL2                 RECORD LENGTH                                
PTARSTA  DS    0XL8                RECORD STATUS                                
PTARSTAT DS    XL1                 STATUS                                       
         DS    XL7                 N/D                                          
PTARLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
PTARFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
STCRECD  DSECT                     ** STUDIO TYPE CODE POINTER **               
STCKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
STCKTYP  DS    XL1                 RECORD TYPE                                  
STCKTYPQ EQU   X'35'                                                            
*++IDENTIFIER                                                                   
STCKSUB  DS    XL1                 SUB-RECORD TYPE                              
STCKSUBQ EQU   X'02'                                                            
STCKCPY  DS    CL1                 COMPANY CODE                                 
STCKSTY  DS    CL4                 STUDIO TYPE CODE                             
STCKSJB  DS    CL12                STUDIO JOB CODE                              
STCKAJB  DS    CL12                AGENCY JOB CODE                              
STCKPO   DS    CL6                 PURCHASE ORDER NUMBER                        
STCKEND  EQU   *-STCKEY                                                         
         ORG   STCKEY+L'STCKEY                                                  
STCKSTA  DS    XL8                 STATUS                                       
STCKDA   DS    XL4                 DISK ADDRESS                                 
*++PROCESS OFF                                                                  
         SPACE 1                                                                
*++PROCESS ON                                                                   
SACRECD  DSECT                     ** STUDIO AGENCY JOB CODE POINTER **         
SACKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
SACKTYP  DS    XL1                 RECORD TYPE                                  
SACKTYPQ EQU   X'35'                                                            
*++IDENTIFIER                                                                   
SACKSUB  DS    XL1                 SUB-RECORD TYPE                              
SACKSUBQ EQU   X'04'                                                            
SACKCPY  DS    CL1                 COMPANY CODE                                 
SACKAJB  DS    CL12                AGENCY JOB CODE                              
SACKSTY  DS    CL4                 STUDIO TYPE CODE                             
SACKSJB  DS    CL12                STUDIO JOB CODE                              
SACKPO   DS    CL6                 PURCHASE ORDER NUMBER                        
*++PROCESS OFF                                                                  
SACKEND  EQU   *-SACKEY                                                         
*++PROCESS ON                                                                   
         ORG   SACKEY+L'SACKEY                                                  
SACKSTA  DS    XL8                 STATUS                                       
SACKDA   DS    XL4                 DISK ADDRESS                                 
*++PROCESS ON                                                                   
         SPACE 1                                                                
RSFRECD  DSECT                     ** FILTER NAME/VALUE RECORD  **              
RSFKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
RSFKTYP  DS    XL1                 RECORD TYPE                                  
RSFKTYPQ EQU   X'36'                                                            
RSFKCPY  DS    CL1                 COMPANY CODE                                 
RSFKUNT  DS    CL1                 UNIT CODE                                    
RSFKLDG  DS    CL1                 LEDGER CODE                                  
         DS    XL17                N/D (SPACES)                                 
RSFKACT  DS    CL12                ACCOUNT CODE (OR SPACES)                     
         DS    XL8                 N/D (SPACES)                                 
RSFKFLT# DS    XL1                 FILTER # (IF X'00' FILTER NAME)              
*++PROCESS OFF                                                                  
RSFKEND  EQU   *-RSFKEY            KEY IS SPACE FILLED                          
*++PROCESS ON                                                                   
         ORG   RSFKEY+L'RSFKEY                                                  
*++PROCESS OFF                                                                  
RSFKSTA  DS    XL8                 STATUS                                       
RSFKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   RSFKSTA                                                          
*++PROCESS ON                                                                   
RSFRLEN  DS    XL2                 RECORD LENGTH                                
RSFRSTA  DS    0XL8                                                             
RSFRSTAT DS    XL1                 RECORD STATUS                                
         DS    XL7                 N/D                                          
RSFRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
RSFRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
CNTRECD  DSECT                     ** CTA CONTRACT RECORD **                    
CNTKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
CNTKTYP  DS    XL1                                                              
CNTKTYPQ EQU   X'3D'                                                            
*++IDENTIFIER                                                                   
CNTKSUB  DS    XL1                                                              
CNTKSUBQ EQU   X'01'                                                            
CNTKCPY  DS    XL1                 COMPANY CODE                                 
CNTKSM   DS    0CL2                SYSTEM/MEDIA                                 
CNTKSYS  DS    CL1                 SYSTEM                                       
CNTKMED  DS    CL1                 MEDIA                                        
CNTKCON  DS    PL3                 CONTRACT NUMBER                              
CNTKCNTR DS    CL6                 CONTRACTOR                                   
         ORG   CNTKEY+L'CNTKEY                                                  
*++PROCESS OFF                                                                  
CNTKSTA  DS    0XL8                                                             
CNTKSTAT DS    XL1                 KEY STATUS                                   
         DS    XL7                 N/D                                          
CNTKDA   DS    XL4                 DISK ADDRESS                                 
*++PROCESS ON                                                                   
         SPACE 1                                                                
*++PROCESS OFF                                                                  
         ORG   CNTKEY                                                           
CNTPAS   DS    0XL42               ** CTA CONTRACT PASSIVE **                   
CNTPTYP  DS    XL1                                                              
CNTPTYPQ EQU   X'3D'                                                            
CNTPSUB  DS    XL1                                                              
*++IDENTIFIER                                                                   
CNTPSUBQ EQU   X'02'                                                            
CNTPCPY  DS    XL1                 COMPANY CODE                                 
CNTPSM   DS    0CL2                SYSTEM/MEDIA                                 
CNTPSYS  DS    CL1                 SYSTEM                                       
CNTPMED  DS    CL1                 MEDIA                                        
CNTPCNTR DS    CL6                 CONTRACTOR                                   
CNTPCON  DS    PL3                 CONTRACT NUMBER                              
         ORG   CNTPAS+L'CNTPAS                                                  
CNTPSTA  DS    0XL8                                                             
CNTPSTAT DS    XL1                 KEY STATUS                                   
         DS    XL7                 N/D                                          
CNTPDA   DS    XL4                 DISK ADDRESS                                 
         SPACE 1                                                                
         ORG   CNTKSTA                                                          
*++PROCESS ON                                                                   
CNTRLEN  DS    XL2                 RECORD LENGTH                                
CNTRSTA  DS    0XL8                                                             
CNTRSTAT DS    XL1                 RECORD STATUS                                
         DS    XL7                 N/D                                          
CNTRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
CNTRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
CAHRECD  DSECT                     ** COST ALLOCATION HISTORY RECORD **         
CAHKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
CAHKTYP  DS    XL1                 COST ALLOCATION HISTORY RECORD TYPE          
CAHKTYPQ EQU   X'3E'                                                            
*++IDENTIFIER                                                                   
CAHKSUB  DS    XL1                 COST ALLOCATION HISTORY SUB-RECORD           
CAHKSUBQ EQU   X'01'                                                            
CAHKCPY  DS    XL1                 COMPANY CODE                                 
CAHKMTHD DS    CL1                 METHOD                                       
CAHKOFC  DS    CL2                 OFFICE/OFFICE GROUP                          
         ORG   CAHKEY+L'CAHKEY                                                  
*++PROCESS OFF                                                                  
CAHKSTA  DS    0XL8                                                             
CAHKSTAT DS    XL1                 KEY STATUS                                   
CAHSOFG  EQU   X'40'               KEY OFFICE IS OFFICE GROUP                   
         DS    XL7                 N/D                                          
CAHKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   CAHKSTA                                                          
*++PROCESS ON                                                                   
CAHRLEN  DS    XL2                 RECORD LENGTH                                
CAHRSTA  DS    0XL8                                                             
CAHRSTAT DS    XL1                 RECORD STATUS                                
         DS    XL7                 N/D                                          
CAHRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
CAHRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
CMTRECD  DSECT                     ** ALLOCATION METHOD RECORD (CODE)**         
CMTKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
CMTKTYP  DS    XL1                 ALLOCATION METHOD RECORD TYPE                
CMTKTYPQ EQU   X'3E'                                                            
*++IDENTIFIER                                                                   
CMTKSUB  DS    XL1                 METHOD BY CODE SUB-RECORD                    
CMTKSUBQ EQU   X'02'                                                            
CMTKCPY  DS    XL1                 COMPANY CODE                                 
CMTKMTHD DS    CL3                 METHOD CODE                                  
         ORG   CMTKEY+L'CMTKEY                                                  
*++PROCESS OFF                                                                  
CMTKSTA  DS    0XL8                                                             
CMTKSTAT DS    XL1                 KEY STATUS                                   
         DS    XL7                 N/D                                          
CMTKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   CMTKSTA                                                          
*++PROCESS ON                                                                   
CMTRLEN  DS    XL2                 RECORD LENGTH                                
CMTRSTA  DS    0XL8                                                             
CMTRSTAT DS    XL1                 RECORD STATUS                                
         DS    XL7                 N/D                                          
CMTRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
CMTRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
PAYRECD  DSECT                     ** PAYROLL CODE RECORD **                    
PAYKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
PAYKTYP  DS    XL1                 PAYROLL CODE RECORD TYPE                     
PAYKTYPQ EQU   X'3E'                                                            
*++IDENTIFIER                                                                   
PAYKSUB  DS    XL1                 PAYROLL CODE SUB-RECORD TYPE                 
PAYKSUBQ EQU   X'03'                                                            
PAYKCPY  DS    XL1                 COMPANY CODE                                 
PAYKSEQ  DS    XL1                 SEQUENCE NUMBER                              
         ORG   PAYKEY+L'PAYKEY                                                  
*++PROCESS OFF                                                                  
PAYKSTA  DS    0XL8                                                             
PAYKSTAT DS    XL1                 KEY STATUS                                   
         DS    XL7                 N/D                                          
PAYKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   PAYKSTA                                                          
*++PROCESS ON                                                                   
PAYRLEN  DS    XL2                 RECORD LENGTH                                
PAYRSTA  DS    0XL8                                                             
PAYRSTAT DS    XL1                 RECORD STATUS                                
         DS    XL7                 N/D                                          
PAYRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
PAYRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
PHIRECD  DSECT                     ** PAYROLL HISTORY RECORD **                 
PHIKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
PHIKTYP  DS    XL1                 PAYROLL HISTORY RECORD TYPE                  
PHIKTYPQ EQU   X'3E'                                                            
*++IDENTIFIER                                                                   
PHIKSUB  DS    XL1                 PAYROLL HISTORY SUB-RECORD TYPE              
PHIKSUBQ EQU   X'05'                                                            
PHIKCPY  DS    XL1                 COMPANY CODE                                 
PHIKOFC  DS    CL2                 OFFICE                                       
PHIKDPT  DS    CL3                 DEPARTMENT                                   
PHIKSBD  DS    CL3                 SUB-DEPARTMENT                               
PHIKPER  DS    CL8                 PERSON                                       
PHIKMOA  DS    XL2                 YYMM (2'S COMPLEMENT)                        
PHIKSEQ  DS    XL1                 SEQUENCE NUMBER                              
         ORG   PHIKEY+L'PHIKEY                                                  
*++PROCESS OFF                                                                  
PHIKSTA  DS    0XL8                                                             
PHIKSTAT DS    XL1                 KEY STATUS                                   
         DS    XL7                 N/D                                          
PHIKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   PHIKSTA                                                          
*++PROCESS ON                                                                   
PHIRLEN  DS    XL2                 RECORD LENGTH                                
PHIRSTA  DS    0XL8                                                             
PHIRSTAT DS    XL1                 RECORD STATUS                                
         DS    XL7                 N/D                                          
PHIRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
PHIRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
CPRRECD  DSECT                     ** COSTING PERSONAL RATES RECORD **          
CPRKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
CPRKTYP  DS    XL1                 PERSONAL RATES RECORD TYPE                   
CPRKTYPQ EQU   X'3E'                                                            
*++IDENTIFIER                                                                   
CPRKSUB  DS    XL1                 PERSONAL RATES SUB-RECORD TYPE               
CPRKSUBQ EQU   X'07'                                                            
CPRKCPY  DS    XL1                 COMPANY CODE                                 
CPRKUNT  DS    XL1                 UNIT CODE                                    
CPRKLDG  DS    XL1                 LEDGER CODE                                  
CPRKACT  DS    XL12                ACCOUNT CODE                                 
         ORG   CPRKEY+L'CPRKEY                                                  
*++PROCESS OFF                                                                  
CPRKSTA  DS    XL8                 KEY STATUS                                   
CPRKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   CPRKSTA                                                          
*++PROCESS ON                                                                   
CPRRLEN  DS    XL2                 RECORD LENGTH                                
CPRRSTA  DS    XL8                 RECORD STATUS                                
CPRRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
CPRRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
CAPRECD  DSECT                     ** COST ALLOCATION PROFILE RECORD **         
CAPKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
CAPKTYP  DS    XL1                 COST ALLOCATION RECORD TYPE                  
CAPKTYPQ EQU   X'3E'                                                            
*++IDENTIFIER                                                                   
CAPKSUB  DS    XL1                 COST ALLOCATION SUB-RECORD TYPE              
CAPKSUBQ EQU   X'09'                                                            
CAPKCPY  DS    XL1                 COMPANY CODE                                 
CAPKMTHD DS    CL1                 METHOD                                       
*++PROCESS OFF                                                                  
CAPKMIN  EQU   *-CAPKEY            MINIMUM KEY REQUIRED (COMP/METHOD)           
*++PROCESS ON                                                                   
CAPKOFC  DS    CL2                 OFFICE/OFFICE GROUP                          
CAPKDPT  DS    CL6                 DEPARTMENT                                   
CAPKSDT  DS    CL6                 SUB-DEPARTMENT                               
CAPKPER  DS    CL8                 PERSON                                       
         ORG   CAPKEY+L'CAPKEY                                                  
*++PROCESS OFF                                                                  
CAPKSTA  DS    0XL8                                                             
CAPKSTAT DS    XL1                 KEY STATUS                                   
CAPSOFG  EQU   X'40'               KEY OFFICE IS OFFICE GROUP                   
         DS    XL7                 N/D                                          
CAPKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   CAPKSTA                                                          
*++PROCESS ON                                                                   
CAPRLEN  DS    XL2                 RECORD LENGTH                                
CAPRSTA  DS    0XL8                                                             
CAPRSTAT DS    XL1                 RECORD STATUS                                
         DS    XL7                 N/D                                          
CAPRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
CAPRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
CCPRECD  DSECT                     ** COSTING CLIENT PROFILE RECORD **          
CCPKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
CCPKTYP  DS    XL1                 CLIENT PROFILE RECORD TYPE                   
CCPKTYPQ EQU   X'3E'                                                            
*++IDENTIFIER                                                                   
CCPKSUB  DS    XL1                 CLIENT PROFILE SUB-RECORD TYPE               
CCPKSUBQ EQU   X'0A'                                                            
CCPKCPY  DS    XL1                 COMPANY CODE                                 
CCPKUNT  DS    XL1                 UNIT CODE                                    
CCPKLDG  DS    XL1                 LEDGER CODE                                  
CCPKACT  DS    XL12                ACCOUNT CODE                                 
         ORG   CCPKEY+L'CCPKEY                                                  
*++PROCESS OFF                                                                  
CCPKSTA  DS    XL8                 KEY STATUS                                   
CCPKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   CCPKSTA                                                          
*++PROCESS ON                                                                   
CCPRLEN  DS    XL2                 RECORD LENGTH                                
CCPRSTA  DS    XL8                 RECORD STATUS                                
CCPRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
CCPRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
CASRECD  DSECT                     ** COST CALENDAR RECORD **                   
CASKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
CASKTYP  DS    XL1                 COST CALENDAR RECORD TYPE                    
CASKTYPQ EQU   X'3E'                                                            
*++IDENTIFIER                                                                   
CASKSUB  DS    XL1                 COST CALENDAR PERIOD SUB-RECORD              
CASKSUBQ EQU   X'0B'                                                            
CASKCPY  DS    XL1                 COMPANY CODE                                 
CASKEMOA DS    PL2                 END MOA                                      
CASKSMOA DS    PL2                 START MOA                                    
CASKOFC  DS    CL2                 OFFICE/OFFICE GROUP                          
         ORG   CASKEY+L'CASKEY                                                  
*++PROCESS OFF                                                                  
CASKSTA  DS    0XL8                                                             
CASKSTAT DS    XL1                 KEY STATUS                                   
         DS    XL7                 N/D                                          
CASKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   CASKEY                                                           
         SPACE 1                                                                
CASPAS   DS    0XL42               ** CALENDAR PASSIVE POINTER **               
*++IDENTIFIER                                                                   
CASPTYP  DS    XL1                 COST CALENDAR RECORD TYPE                    
CASPTYPQ EQU   X'3E'                                                            
*++IDENTIFIER                                                                   
CASPSUB  DS    XL1                 COST CALENDAR SUB-RECORD                     
CASPSUBQ EQU   X'0C'                                                            
CASPCPY  DS    XL1                 COMPANY CODE                                 
CASPEDTE DS    PL3                 END DATE                                     
CASPSDTE DS    PL3                 START DATE                                   
CASPOFC  DS    CL2                 OFFICE/OFFICE GROUP                          
         ORG   CASPAS+L'CASPAS                                                  
CASPSTA  DS    0XL8                                                             
CASPSTAT DS    XL1                 KEY STATUS                                   
         DS    XL7                 N/D                                          
CASPDA   DS    XL4                 DISK ADDRESS                                 
         ORG   CASPSTA                                                          
*++PROCESS ON                                                                   
CASRLEN  DS    XL2                 RECORD LENGTH                                
CASRSTA  DS    0XL8                                                             
CASRSTAT DS    XL1                 RECORD STATUS                                
         DS    XL7                 N/D                                          
CASRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
CASRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
STDRECD  DSECT                     ** COST STANDARD HOURS RECORD **             
STDKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
STDKTYP  DS    XL1                 COST STD HOURS RECORD TYPE                   
STDKTYPQ EQU   X'3E'                                                            
*++IDENTIFIER                                                                   
STDKSUB  DS    XL1                 COST STD HOURS SUB-RECORD                    
STDKSUBQ EQU   X'0D'                                                            
STDKCPY  DS    XL1                 COMPANY CODE                                 
STDKOFC  DS    CL2                 OFFICE                                       
STDKDPT  DS    CL3                 DEPARTMENT                                   
STDKSBD  DS    CL3                 SUB-DEPARTMENT                               
STDKPER  DS    CL8                 PERSON                                       
STDKSEQ  DS    XL1                 SEQ NUMBER                                   
         ORG   STDKEY+L'STDKEY                                                  
*++PROCESS OFF                                                                  
STDKSTA  DS    0XL8                                                             
STDKSTAT DS    XL1                 KEY STATUS                                   
STDKSTDT DS    XL3                 FIRST DATE ON RECORD                         
STDKENDT DS    XL3                 LAST DATE ON RECORD                          
         DS    XL1                 N/D                                          
STDKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   STDKSTA                                                          
*++PROCESS ON                                                                   
STDRLEN  DS    XL2                 RECORD LENGTH                                
STDRSTA  DS    0XL8                                                             
STDRSTAT DS    XL1                 RECORD STATUS                                
STDRSTDT DS    XL3                 FIRST DATE ON RECORD                         
STDRENDT DS    XL3                 LAST DATE ON RECORD                          
         DS    XL1                 N/D                                          
STDRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
STDRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
TTHRECD  DSECT                     ** TIME TOTAL HOURS RECORD  **               
TTHKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
TTHKTYP  DS    XL1                 TIME TOTAL HOURS RECORD TYPE                 
TTHKTYPQ EQU   X'3E'                                                            
*++IDENTIFIER                                                                   
TTHKSUB  DS    XL1                 TIME TOTAL HOURS SUB-RECORD                  
TTHKSUBQ EQU   X'0E'                                                            
TTHKCULA DS    0XL15                                                            
TTHKCPY  DS    XL1                 COMPANY CODE                                 
TTHKULA  DS    0XL14                                                            
TTHKUNT  DS    CL1                 UNIT CODE                                    
TTHKLDG  DS    CL1                 LEDGER CODE                                  
TTHKACT  DS    CL12                ACCOUNT CODE                                 
TTHKTIME DS    XL1                 TYPE OF TIME                                 
TTHKTWKL EQU   0                   PERIOD                                       
TTHKTCLI EQU   1                   CLIENT                                       
TTHKTTOT EQU   2                   TOTAL TIME                                   
TTHKEMOA DS    PL2                 END MOA                                      
TTHKSMOA DS    PL2                 START MOA                                    
TTHKSEQ  DS    XL1                 SEQUENCE                                     
         ORG   TTHKEY+L'TTHKEY                                                  
*++PROCESS OFF                                                                  
TTHKSTA  DS    0XL8                                                             
TTHKSTAT DS    XL1                                                              
TTHSDELT EQU   X'80'               RECORD IS DELETED                            
TTHSLAST EQU   X'08'               LAST RECORD IN SET                           
         DS    XL7                 N/D                                          
TTHKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   TTHKSTA                                                          
*++PROCESS ON                                                                   
TTHRLEN  DS    XL2                 RECORD LENGTH                                
TTHRSTA  DS    0XL8                RECORD STATUS AREA                           
TTHRSTAT DS    XL1                 RECORD STATUS(SEE TTHKSTAT)                  
         DS    XL7                 N/D                                          
TTHRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
TTHRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
*++PROCESS OFF                                                                  
TSWRECD  DSECT                     ** TIME SHEET WEEKLY POINTER **              
TSWKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
TSWKTYP  DS    XL1                 TIME SHEET WEEKLY RECORD TYPE                
TSWKTYPQ EQU   X'3E'                                                            
*++IDENTIFIER                                                                   
TSWKSUB  DS    XL1                 TIME SHEET WEEKLY SUB-RECORD                 
TSWKSUBQ EQU   X'0F'                                                            
TSWKCPY  DS    XL1                 COMPANY CODE                                 
TSWKPER  DS    CL8                 PERSON CODE                                  
TSWKEND  DS    PL3                 WEEK ENDING DATE(2'S COMPLEMENT)             
TSWKODS  DS    CL8                 OFFC/DEPT/SUB                                
TSWKULC  DS    XL14                CONTRA ACCOUNT                               
TSWKCOFC DS    CL2                 CLIENT OFFICE                                
         DS    XL3                 N/D                                          
TSWKSBR  DS    XL1                 SUB-REFERENCE                                
         ORG   TSWKEY+L'TSWKEY                                                  
TSWKSTA  DS    0XL8                                                             
TSWKRI1  DS    XL1                 INDICATOR 1                                  
TSWKRI2  DS    XL1                 INDICATOR 2                                  
         DS    XL2                                                              
TSWKRI3  DS    XL1                 INDICATOR 3                                  
TSWKRI4  DS    XL1                 INDICATOR 4                                  
         DS    XL2                                                              
TSWKDA   DS    XL4                 DISK ADDRESS                                 
*++PROCESS ON                                                                   
         SPACE 1                                                                
EDTRECD  DSECT                     ** COST EDIT HOURS RECORD **                 
EDTKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
EDTKTYP  DS    XL1                 COST EDIT HOURS RECORD TYPE                  
EDTKTYPQ EQU   X'3E'                                                            
*++IDENTIFIER                                                                   
EDTKSUB  DS    XL1                 COST EDIT HOURS SUB-RECORD                   
EDTKSUBQ EQU   X'10'                                                            
EDTKCPY  DS    XL1                 COMPANY CODE                                 
EDTKOFC  DS    CL2                 OFFICE                                       
EDTKDPT  DS    CL3                 DEPARTMENT                                   
EDTKSBD  DS    CL3                 SUB-DEPARTMENT                               
EDTKPER  DS    CL8                 PERSON                                       
EDTKSEQ  DS    XL1                 SEQ NUMBER                                   
         ORG   EDTKEY+L'EDTKEY                                                  
*++PROCESS OFF                                                                  
EDTKSTA  DS    0XL8                                                             
EDTKSTAT DS    XL1                 KEY STATUS                                   
EDTKSTDT DS    XL3                 FIRST DATE ON RECORD                         
EDTKENDT DS    XL3                 LAST DATE ON RECORD                          
         DS    XL1                 N/D                                          
EDTKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   EDTKSTA                                                          
*++PROCESS ON                                                                   
EDTRLEN  DS    XL2                 RECORD LENGTH                                
EDTRSTA  DS    0XL8                                                             
EDTRSTAT DS    XL1                 RECORD STATUS                                
EDTRSTDT DS    XL3                 FIRST DATE ON RECORD                         
EDTRENDT DS    XL3                 LAST DATE ON RECORD                          
         DS    XL1                 N/D                                          
EDTRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
EDTRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
TSSRECD  DSECT                     ** TIME SHEET SAVE RECORD **                 
TSSKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
TSSKTYP  DS    XL1                 TIME SHEET WEEKLY RECORD TYPE                
TSSKTYPQ EQU   X'3E'                                                            
*++IDENTIFIER                                                                   
TSSKSUB  DS    XL1                 TIME SHEET WEEKLY SUB-RECORD                 
TSSKSUBQ EQU   X'11'                                                            
TSSKCPY  DS    XL1                 COMPANY CODE                                 
TSSKPER  DS    CL8                 PERSON CODE                                  
TSSKEND  DS    PL3                 WEEK ENDING DATE(2'S COMPLEMENT)             
TSSKODS  DS    CL8                 OFFC/DEPT/SUB                                
         DS    XL19                N/D                                          
TSSKSBR  DS    XL1                 SUB-REFERENCE                                
         ORG   TSSKEY+L'TSSKEY                                                  
*++PROCESS OFF                                                                  
TSSKSTA  DS    0XL8                                                             
TSSKRI1  DS    XL1                 INDICATOR 1                                  
TSSKRI2  DS    XL1                 INDICATOR 2                                  
         DS    XL2                                                              
TSSKRI3  DS    XL1                 INDICATOR 3                                  
TSSKRI4  DS    XL1                 INDICATOR 4                                  
         DS    XL2                                                              
TSSKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   TSSKSTA                                                          
*++PROCESS ON                                                                   
TSSRLEN  DS    XL2                 RECORD LENGTH                                
TSSRSTA  DS    0XL8                RECORD STATUS                                
TSSRRI1  DS    XL1                 RECORD INDICATOR 1                           
TSSRRI2  DS    XL1                 RECORD INDICATOR 2                           
         DS    XL2                                                              
TSSRRI3  DS    XL1                 RECORD INDICATOR 3                           
TSSRRI4  DS    XL1                 RECORD INDICATOR 4                           
         DS    XL2                                                              
TSSRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
TSSRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
PIDRECD  DSECT                     ** PERSON PASSIVE POINTER    **              
PIDKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
PIDKTYP  DS    XL1                 PERSON ID NUMBER RECORD TYPE                 
PIDKTYPQ EQU   X'3E'                                                            
*++IDENTIFIER                                                                   
PIDKSUB  DS    XL1                 PERSON ID NUMBER SUB-RECORD                  
PIDKSUBQ EQU   X'12'                                                            
PIDKCPY  DS    XL1                 COMPANY CODE                                 
PIDKPID  DS    XL2                 PERSON ID NUMBER (CONTROL SECURITY)          
PIDKPER  DS    CL8                 PERSON CODE                                  
         ORG   PIDKEY+L'PIDKEY                                                  
*++PROCESS OFF                                                                  
PIDKSTA  DS    0XL8                                                             
PIDKSTAT DS    XL1                 KEY STATUS                                   
         DS    XL7                 N/D                                          
PIDKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   PIDKSTA                                                          
*++PROCESS ON                                                                   
PIDRLEN  DS    XL2                 RECORD LENGTH                                
PIDRSTA  DS    0XL8                                                             
PIDRSTAT DS    XL1                 RECORD STATUS                                
         DS    XL7                 N/D                                          
PIDRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
PIDRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
TSXRECD  DSECT                     ** TIME SHEET TEMPO X-REFERENCE ***          
TSXKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
TSXKTYP  DS    XL1                 TIME SHEET TEMPO RECORD TYPE                 
TSXKTYPQ EQU   X'3E'                                                            
*++IDENTIFIER                                                                   
TSXKSUB  DS    XL1                 TIME SHEET TEMPO SUB-RECORD                  
TSXKSUBQ EQU   X'13'                                                            
TSXKCPY  DS    XL1                 COMPANY CODE                                 
TSXKPER  DS    CL8                 PERSON CODE                                  
TSXKEND  DS    PL3                 WEEK ENDING DATE YYMMDD                      
TSXKODS  DS    CL8                 OFFC/DEPT/SUB                                
         DS    XL19                N/D                                          
TSXKSBR  DS    XL1                 SUB-REFERENCE                                
         ORG   TSXKEY+L'TSXKEY                                                  
*++PROCESS OFF                                                                  
TSXKSTA  DS    0XL8                                                             
TSXKRI1  DS    XL1                 INDICATOR 1                                  
TSXKRI2  DS    XL1                 INDICATOR 2                                  
TSXKSTA1 DS    XL1                 EXTRA STATUS                                 
         DS    XL1                                                              
TSXKRI3  DS    XL1                 INDICATOR 3                                  
TSXKRI4  DS    XL1                 INDICATOR 4                                  
         DS    XL2                                                              
TSXKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   TSXKSTA                                                          
*++PROCESS ON                                                                   
TSXRLEN  DS    XL2                 RECORD LENGTH                                
TSXRSTA  DS    0XL8                RECORD STATUS                                
TSXRRI1  DS    XL1                 RECORD INDICATOR 1                           
TSXRRI2  DS    XL1                 RECORD INDICATOR 2                           
TSXRSTA1 DS    XL1                 EXTRA STATUS                                 
TSXTEMPO EQU   X'01'               RECORD CREATED DURING SCRIPT UPLOAD          
         DS    XL1                                                              
TSXRRI3  DS    XL1                 RECORD INDICATOR 3                           
TSXRRI4  DS    XL1                 RECORD INDICATOR 4                           
         DS    XL2                                                              
TSXRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
TSXRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
*++PROCESS OFF                                                                  
SRMRECD  DSECT                     ** STORED REQUEST MAINTENANCE  **            
SRMKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
SRMKTYP  DS    XL1                 STORED REQUEST                               
SRMKTYPQ EQU   X'3F'                                                            
*++IDENTIFIER                                                                   
SRMKSUB  DS    XL1                 RECORD SUB-TYPE                              
SRMKSCRQ EQU   X'01'               STACKED CHECK REQUEST                        
SRMKCUL  DS    0XL3                COMPANY/UNIT/LEDGER                          
SRMKCPY  DS    XL1                 COMPANY CODE                                 
SRMKUNT  DS    CL1                 UNIT CODE                                    
SRMKLDG  DS    CL1                 LEDGER CODE                                  
SRMKDTE  DS    PL3                 DATE                                         
SRMKUSR  DS    XL2                 USER CODE                                    
SRMKSEQ  DS    XL2                 SEQUENCE NUMBER                              
SRMKACT  DS    XL12                ACCOUNT CODE                                 
SRMKEND  EQU   *-SRMKEY                                                         
         ORG   SRMKEY+L'SRMKEY                                                  
SRMKSTA  DS    XL8                 STATUS                                       
SRMKDA   DS    XL4                 DISK ADDRESS                                 
*++PROCESS ON                                                                   
         SPACE 1                                                                
*++PROCESS OFF                                                                  
SRFRECD  DSECT                     ** STORED REQUEST FILTER RECORD **           
SRFKEY   DS    0XL42                                                            
*++IDENTIFIER                                                                   
SRFKTYP  DS    XL1                 STORED REQUEST                               
SRFKTYPQ EQU   X'3F'                                                            
*++IDENTIFIER                                                                   
SRFKSUB  DS    XL1                 RECORD SUB-TYPE                              
SRFKSCRQ EQU   X'02'               EXTRA FILTER RECORD                          
SRFKUSR  DS    XL2                 USER CODE                                    
SRFKRNUM DS    CL2                 REQUEST NUMBER                               
SRFKDTE  DS    PL3                 DATE                                         
SRFKSEQ  DS    XL2                 SEQUENCE NUMBER                              
SRFKEND  EQU   *-SRFKEY                                                         
         ORG   SRFKEY+L'SRFKEY                                                  
SRFKSTA  DS    XL8                 STATUS                                       
SRFKDA   DS    XL4                 DISK ADDRESS                                 
*++PROCESS ON                                                                   
         SPACE 1                                                                
*++PROCESS OFF                                                                  
TRSPASD  DSECT                     ** TRANS SERIAL NUMBER PASSIVE **            
TRSPKEY  DS    0XL42                                                            
*++IDENTIFIER                                                                   
TRSPTYP  DS    XL1                 STORED REQUEST                               
TRSPTYPQ EQU   X'3F'                                                            
*++IDENTIFIER                                                                   
TRSPSUB  DS    XL1                 RECORD SUB-TYPE                              
TRSPSUBQ EQU   X'03'               EXTRA FILTER RECORD                          
TRSPCPY  DS    XL1                 COMPANY                                      
TRSPNULL DS    XL35                BINARY ZEROS                                 
TRSPSER  DS    XL4                 SERIAL NUMBER 2 COMPLIMENT                   
TRSPEND  EQU   *-TRSPKEY                                                        
         ORG   TRSPKEY+L'TRSPKEY                                                
TRSPSTA  DS    XL8                 STATUS ONLY UPDATED DUMP AND LOAD            
TRSPDA   DS    XL4                 DISK ADDRESS                                 
*++PROCESS ON                                                                   
         SPACE 1                                                                
*++PROCESS OFF                                                                  
CPYRECD  DSECT                     ** COMPANY RECORD **                         
CPYKEY   DS    0XL42                                                            
CPYKCPY  DS    XL1                 COMPANY CODE                                 
*++PROCESS OFF                                                                  
CPYKEND  EQU   *-CPYKEY            SPACE FILLED KEY                             
*++PROCESS ON                                                                   
         ORG   CPYKEY+L'CPYKEY                                                  
*++PROCESS OFF                                                                  
CPYKSTA  DS    XL8                 KEY STATUS                                   
CPYKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   CPYKSTA                                                          
*++PROCESS ON                                                                   
CPYRLEN  DS    XL2                 RECORD LENGTH                                
CPYRSTA  DS    XL8                 RECORD STATUS                                
CPYRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
CPYRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
UNTRECD  DSECT                     ** UNIT RECORD **                            
UNTKEY   DS    0XL42                                                            
UNTKCPY  DS    XL1                 COMPANY CODE                                 
UNTKUNT  DS    CL1                 UNIT CODE                                    
*++PROCESS OFF                                                                  
UNTKEND  EQU   *-UNTKEY            SPACE FILLED KEY                             
*++PROCESS ON                                                                   
         DS    CL40                SPACES                                       
*++PROCESS OFF                                                                  
UNTKSTA  DS    XL8                 KEY STATUS                                   
UNTKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   UNTKSTA                                                          
*++PROCESS ON                                                                   
UNTRLEN  DS    XL2                 RECORD LENGTH                                
UNTRSTA  DS    XL8                 RECORD STATUS                                
UNTRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
UNTRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
LDGRECD  DSECT                     ** LEDGER RECORD **                          
LDGKEY   DS    0XL42                                                            
LDGKCPY  DS    XL1                 COMPANY CODE                                 
LDGKUNT  DS    CL1                 UNIT CODE                                    
LDGKLDG  DS    CL1                 LEDGER CODE                                  
*++PROCESS OFF                                                                  
LDGKEND  EQU   *-LDGKEY            SPACE FILLED KEY                             
*++PROCESS ON                                                                   
         ORG   LDGKEY+L'LDGKEY                                                  
*++PROCESS OFF                                                                  
LDGKSTA  DS    XL8                 KEY STATUS                                   
LDGKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   LDGKSTA                                                          
*++PROCESS ON                                                                   
LDGRLEN  DS    XL2                 RECORD LENGTH                                
LDGRSTA  DS    XL8                 RECORD STATUS                                
LDGRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
LDGRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
ACTRECD  DSECT                     ** ACCOUNT RECORD **                         
ACTKEY   DS    0XL42                                                            
ACTKCULA DS    0XL15                                                            
ACTKCPY  DS    XL1                 COMPANY CODE                                 
ACTKULA  DS    0XL14                                                            
ACTKUNT  DS    CL1                 UNIT CODE                                    
ACTKLDG  DS    CL1                 LEDGER CODE                                  
ACTKACT  DS    CL12                ACCOUNT CODE AT ANY LEVEL                    
*++PROCESS OFF                                                                  
ACTKEND  EQU   *-ACTKEY            SPACE FILLED KEY                             
*++PROCESS ON                                                                   
         ORG   ACTKEY+L'ACTKEY                                                  
*++PROCESS OFF                                                                  
ACTKSTA  DS    0XL8                KEY STATUS AREA                              
ACTKSTAT DS    XL1                 ACCOUNT STATUS                               
ACTSDELT EQU   X'80'               ACCOUNT IS DELETED                           
ACTSCLOS EQU   X'40'               ACCOUNT IS CLOSED                            
ACTSLOCK EQU   X'20'               ACCOUNT IS LOCKED                            
ACTSABLP EQU   X'10'               ACCOUNT HAS BALANCE ELEMENT                  
ACTSCHDR EQU   X'08'               ACCOUNT HAS CONTRA-HEADER REFERENCES         
*              X'04'               RESERVED FOR ARCHIVE                         
ACTSLAPL EQU   X'02'               ACCOUNT IS P&L (RSTSLAPL)                    
ACTSLABS EQU   X'01'               ACCOUNT IS B/S (RSTSLABS)                    
ACTKSAF1 DS    CL1                 ACCOUNT FILT 1 (RSTFILT1)                    
ACTKSAF2 DS    CL1                 ACCOUNT FILT 2 (RSTFILT2)                    
ACTKSAF3 DS    CL1                 ACCOUNT FILT 3 (RSTFILT3)                    
ACTKSAF4 DS    CL1                 ACCOUNT FILT 4 (RSTFILT4)                    
ACTKSAF5 DS    CL1                 ACCOUNT FILT 5 (RSTFILT5)                    
*&&UK                                                                           
ACTKSUFA DS    CL1                 PRODUCTION UNIT FOR ANAL (PPRUFORA)          
ACTKSBTY DS    CL1                 PRODUCTION BILLABLE TYPE (PPRBTYPE)          
         ORG   ACTKSUFA                                                         
*&&                                                                             
*&&US                                                                           
ACTKSOFF DS    CL2                 PRODUCTION OFFICE (PPRGAOFF)                 
         ORG   ACTKSOFF                                                         
*&&                                                                             
         DS    XL2                 N/D FOR NON-PRODUCTION LEDGERS               
ACTKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   ACTKSTA                                                          
*++PROCESS ON                                                                   
ACTRLEN  DS    XL2                 RECORD LENGTH                                
ACTRSTA  DS    0XL8                RECORD STATUS AREA                           
ACTRSTAT DS    XL1                 ACCOUNT STATUS (SEE ACTKSTAT)                
ACTRSAF1 DS    CL1                 ACCOUNT FILT 1 (RSTFILT1)                    
ACTRSAF2 DS    CL1                 ACCOUNT FILT 2 (RSTFILT2)                    
ACTRSAF3 DS    CL1                 ACCOUNT FILT 3 (RSTFILT3)                    
ACTRSAF4 DS    CL1                 ACCOUNT FILT 4 (RSTFILT4)                    
ACTRSAF5 DS    CL1                 ACCOUNT FILT 5 (RSTFILT5)                    
ACTRSOFF DS    CL2                 PRODUCTION OFFICE (PPRGAOFF)                 
         ORG   ACTRSOFF                                                         
         DS    XL2                 N/D FOR NON-PRODUCTION LEDGERS               
ACTRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
ACTRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
OFARECD  DSECT                     ** OFFICE ACCOUNT RECORD **                  
OFAKEY   DS    0XL42                                                            
OFAKCULA DS    0XL15                                                            
OFAKCPY  DS    XL1                 COMPANY CODE                                 
OFAKULA  DS    0XL14                                                            
OFAKUNT  DS    CL1                 UNIT CODE                                    
OFAKLDG  DS    CL1                 LEDGER CODE                                  
OFAKACT  DS    CL12                ACCOUNT CODE                                 
OFAKOFF  DS    CL2                 OFFICE CODE                                  
*++PROCESS OFF                                                                  
OFAKEND  EQU   *-OFAKEY            SPACE FILLED KEY                             
*++PROCESS ON                                                                   
         ORG   OFAKEY+L'OFAKEY                                                  
*++PROCESS OFF                                                                  
OFAKSTA  DS    0XL8                KEY STATUS AREA                              
OFAKSTAT DS    XL1                 OFFICE ACCOUNT STATUS                        
OFAKLMOS DS    PL2                 OFFICE LOWEST MOS POSTED                     
OFAKHMOS DS    PL2                 OFFICE HIGHEST MOS POSTED                    
OFAKCMOS DS    PL2                 OFFICE LAST CLOSED MOS                       
         DS    XL1                 N/D                                          
OFAKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   OFAKSTA                                                          
*++PROCESS ON                                                                   
OFARLEN  DS    XL2                 RECORD LENGTH                                
OFARSTA  DS    0XL8                RECORD STATUS AREA                           
OFARSTAT DS    XL1                 OFFICE ACCOUNT STATUS (SEE OFAKSTAT)         
OFARLMOS DS    PL2                 OFFICE LOWEST MOS POSTED                     
OFARHMOS DS    PL2                 OFFICE HIGHEST MOS POSTED                    
OFARCMOS DS    PL2                 OFFICE LAST CLOSED MOS                       
         DS    XL1                 N/D                                          
OFARLNK  DS    XL4                 LINKAGE AREA                                 
OFARFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
CHDRECD  DSECT                     ** CONTRA-ACCOUNT RECORD **                  
CHDKEY   DS    0XL42                                                            
CHDKCULA DS    0XL15                                                            
CHDKCPY  DS    XL1                 COMPANY CODE                                 
CHDKULA  DS    0XL14                                                            
CHDKUNT  DS    CL1                 UNIT CODE                                    
CHDKLDG  DS    CL1                 LEDGER CODE                                  
CHDKACT  DS    CL12                ACCOUNT CODE AT ANY LEVEL                    
CHDKWRK  DS    0CL2                WORK CODE OR SPACES                          
CHDKOFF  DS    CL2                 OFFICE CODE OR SPACES                        
CHDKCULC DS    0XL15                                                            
CHDKCCPY DS    XL1                 CONTRA-COMPANY CODE                          
CHDKULC  DS    0XL14                                                            
CHDKCUNT DS    CL1                 CONTRA-UNIT CODE                             
CHDKCLDG DS    CL1                 CONTRA-LEDGER CODE                           
CHDKCACT DS    CL12                CONTRA-ACCOUNT CODE                          
CHDKSPCS DS    CL3                 SPACES                                       
CHDKBTYP DS    CL1                 BUCKET TYPE                                  
CHDKNULL DS    XL6                 BINARY ZEROES                                
*++PROCESS OFF                                                                  
CHDKEND  EQU   *-CHDKEY                                                         
*++PROCESS ON                                                                   
         ORG   CHDKEY+L'CHDKEY                                                  
*++PROCESS OFF                                                                  
CHDKSTA  DS    0XL8                KEY STATUS                                   
CHDKSTAT DS    XL1                 CONTRA-ACCOUNT STATUS                        
CHDSDELT EQU   X'80'                                                            
CHDKAPTR DS    XL7                 X'FF'S IF A REAL ACCOUNT POINTER             
CHDKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   CHDKSTA                                                          
*++PROCESS ON                                                                   
CHDRLEN  DS    XL2                 RECORD LENGTH                                
CHDRSTA  DS    0XL8                RECORD STATUS                                
CHDRSTAT DS    XL1                 CONTRA-ACCOUNT STATUS                        
         DS    XL7                 N/D                                          
CHDRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
CHDRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
CACRECD  DSECT                     ** CONTRA-ACCOUNT RECORD **                  
CACKEY   DS    0XL42                                                            
CACKCULA DS    0XL15                                                            
CACKCPY  DS    XL1                 COMPANY CODE                                 
CACKULA  DS    0XL14                                                            
CACKUNT  DS    CL1                 UNIT CODE                                    
CACKLDG  DS    CL1                 LEDGER CODE                                  
CACKACT  DS    CL12                ACCOUNT CODE AT ANY LEVEL                    
CACKWRK  DS    0CL2                WORK CODE OR SPACES                          
CACKOFF  DS    CL2                 OFFICE CODE OR SPACES                        
CACKCULC DS    0XL15                                                            
CACKCCPY DS    XL1                 CONTRA-COMPANY CODE                          
CACKULC  DS    0XL14                                                            
CACKCUNT DS    CL1                 CONTRA-UNIT CODE                             
CACKCLDG DS    CL1                 CONTRA-LEDGER CODE                           
CACKCACT DS    CL12                CONTRA-ACCOUNT CODE                          
CACKSPAC DS    CL3                 SPACES                                       
CACKBTYP DS    CL1                 BUCKET TYPE                                  
CACKSTYP DS    CL3                 BUCKET SUB-TYPE OR SPACES                    
*++PROCESS OFF                                                                  
CACKEND  EQU   *-CACKEY            SPACE FILLED KEY                             
*++PROCESS ON                                                                   
         ORG   CACKEY+L'CACKEY                                                  
*++PROCESS OFF                                                                  
CACKSTA  DS    0XL8                KEY STATUS                                   
CACKSTAT DS    XL1                 CONTRA-ACCOUNT STATUS                        
CACSDELT EQU   X'80'                                                            
CACKLMOS DS    XL2                 CONTRA-ACCOUNT LOWEST MOS                    
CACKHMOS DS    XL2                 CONTRA-ACCOUNT HIGHEST MOS                   
         DS    XL3                 N/D                                          
CACKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   CACKSTA                                                          
*++PROCESS ON                                                                   
CACRLEN  DS    XL2                 RECORD LENGTH                                
CACRSTA  DS    0XL8                RECORD STATUS                                
CACRSTAT DS    XL1                 CONTRA-ACCOUNT STATUS                        
CACRLMOS DS    XL2                 CONTRA-ACCOUNT LOWEST MOS                    
CACRHMOS DS    XL2                 CONTRA-ACCOUNT HIGHEST MOS                   
         DS    XL3                 N/D                                          
CACRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
CACRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
TRNRECD  DSECT                     ** TRANSACTION RECORD **                     
TRNKEY   DS    0XL42                                                            
TRNKCULA DS    0XL15                                                            
TRNKCPY  DS    XL1                 COMPANY CODE                                 
TRNKULA  DS    0XL14                                                            
TRNKUNT  DS    CL1                 UNIT CODE                                    
TRNKLDG  DS    CL1                 LEDGER CODE                                  
TRNKACT  DS    CL12                ACCOUNT CODE AT ANY LEVEL                    
TRNKWORK DS    0CL2                WORK CODE OR SPACES                          
TRNKOFF  DS    CL2                 OFFICE CODE OR SPACES                        
TRNKCULC DS    0XL15                                                            
TRNKCCPY DS    XL1                 CONTRA-COMPANY CODE                          
TRNKULC  DS    0XL14                                                            
TRNKCUNT DS    CL1                 CONTRA-UNIT CODE                             
TRNKCLDG DS    CL1                 CONTRA-LEDGER CODE                           
TRNKCACT DS    CL12                CONTRA-ACCOUNT CODE                          
TRNKDATE DS    PL3                 TRANSACTION DATE                             
TRNKREF  DS    CL6                 TRANSACTION REFERENCE                        
TRNKSBR  DS    XL1                 TRANSACTION SUB-REFERENCE NUMBER             
*++PROCESS OFF                                                                  
TRNKEND  EQU   *-TRNKEY                                                         
*++PROCESS ON                                                                   
TRNKSTA  DS    0XL8                KEY STATUS AREA                              
*++PROCESS OFF                                                                  
TRNKSTAT DS    XL1                 TRANSACTION STATUS 1                         
TRNSDELT EQU   X'80'               TRANSACTION IS DELETED                       
TRNSDRFT EQU   X'40'               TRANSACTION IS DRAFT                         
TRNSREVS EQU   X'20'               TRANSACTION IS A REVERSAL                    
*&&UK                                                                           
TRNSSECC EQU   X'10'               TRANSACTION INPUT IN 2ND CURRENCY            
*&&                                                                             
TRNSARCH EQU   X'04'               TRANSACTION ON ARCHIVE FILE                  
*&&US                                                                           
TRNSTALR EQU   X'02'               TRANSACTION TALENT STATUS?                   
TRNSREVD EQU   X'01'               TRANSACTION IS A TALENT REVERSAL             
*&&                                                                             
TRNSTIME EQU   X'01'               RECORD IS A TIME RECORD                      
TRNKSTA2 DS    XL1                 TRANSACTION STATUS 2                         
TRNKSMOS DS    PL2                 TRANSACTION MOS (PACKED YM)                  
TRNKSTYP DS    XL1                 TRANSACTION TYPE (SEE TRNTYPE)               
TRNKSANL DS    CL1                 OLD ANALYSIS CODE                            
TRNKSDUE DS    0XL2                DUE DATE                                     
TRNKSUSE DS    PL2                 USED MOS (PACKED YM)                         
TRNKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   TRNKSTA                                                          
*++PROCESS ON                                                                   
TRNRLEN  DS    XL2                 RECORD LENGTH                                
TRNRSTA  DS    0XL8                RECORD STATUS                                
TRNRSTAT DS    XL1                 TRANSACTION STATUS 1 (SEE TRNKSTAT)          
TRNSTIME EQU   X'01'               RECORD IS A TIME RECORD                      
TRNRSTA2 DS    XL1                 TRANSACTION STATUS 2 (SEE TRNKSTA2)          
TRNSGLUP EQU   X'80'               TRANSACTION UPDATED TO G/L                   
TRNSUSED EQU   X'40'               TRANSACTION MARKED AS USED                   
TRNSPEEL EQU   X'20'               TRANSACTION CLOSED (PEELED)                  
TRNSEXCL EQU   X'10'               TRANSACTION IS EXCLUDED FROM REPORTS         
TRNSPBAL EQU   X'04'               TRANSACTION IS BALANCED (PAYABLES)           
***********************************************************************         
* THE FOLLOWING BITS ARE USED ON THE PRODUCTION LEDGER FOR NEW CLIENT *         
* BILLING - THEY MAY BE RE-DEFINED FOR OTHER LEDGERS                  *         
***********************************************************************         
TRNSXFRP EQU   X'04'               TRANSACTION TRANSFER PENDING                 
TRNSWOFP EQU   X'02'               TRANSACTION WRITE-OFF PENDING                
TRNSBILP EQU   X'01'               TRANSACTION BILL ACTIVITY PENDING            
TRNRSMOS DS    PL2                 TRANSACTION MOS (PACKED YM)                  
TRNRSTYP DS    XL1                 TRANSACTION TYPE (SEE TRNTYPE)               
TRNRSANL DS    CL1                 OLD ANALYSIS CODE                            
TRNRSDUE DS    0XL2                DUE DATE                                     
TRNRSUSE DS    PL2                 USED MOS (PACKED YM)                         
TRNRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
TRNRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
TIMRECD  DSECT                     ** TIME RECORD **                            
TIMKEY   DS    0XL42                                                            
TIMKCULA DS    0XL15                                                            
TIMKCPY  DS    XL1                 COMPANY CODE                                 
TIMKULA  DS    0XL14                                                            
TIMKUNT  DS    CL1                 UNIT CODE                                    
TIMKLDG  DS    CL1                 LEDGER CODE                                  
TIMKACT  DS    CL12                ACCOUNT CODE AT ANY LEVEL                    
TIMKOFF  DS    CL2                 OFFICE CODE OR SPACES                        
TIMKCULC DS    0XL15                                                            
TIMKCCPY DS    XL1                 CONTRA-COMPANY CODE                          
TIMKULC  DS    0XL14                                                            
TIMKCUNT DS    CL1                 CONTRA-UNIT CODE                             
TIMKCLDG DS    CL1                 CONTRA-LEDGER CODE                           
TIMKCACT DS    CL12                CONTRA-ACCOUNT CODE                          
TIMKPEDT DS    PL3                 PERIOD ENDING DATE                           
TIMKREF  DS    CL6                 REFERENCE *TIME*                             
TIMKSBR  DS    XL1                 SUB-REFERENCE NUMBER                         
*++PROCESS OFF                                                                  
TIMKEND  EQU   *-TIMKEY                                                         
TIMKSTA  DS    0XL8                KEY STATUS AREA                              
TIMKRI1  DS    XL1                 INDICATOR 1                                  
TIMKRI1Q EQU   X'61'                                                            
TIMKRI2  DS    XL1                 INDICATOR 2                                  
TIMKRI2Q EQU   X'61'                                                            
TIMKLMOS DS    PL2                 LOWEST MOS (PACKED YM)                       
TIMKRI3  DS    XL1                 INDICATOR 3                                  
TIMKRI3Q EQU   X'FF'                                                            
TIMKRI4  DS    XL1                 INDICATOR 4                                  
TIMKRI4Q EQU   X'FF'                                                            
TIMKHMOS DS    PL2                 HIGHEST MOS (PACKED YM)                      
TIMKDA   DS    XL4                 DISK ADDRESS                                 
         ORG   TIMKSTA                                                          
*++PROCESS ON                                                                   
TIMRLEN  DS    XL2                 RECORD LENGTH                                
TIMRSTA  DS    0XL8                RECORD STATUS                                
TIMRRI1  DS    XL1                 RECORD INDICATOR 1                           
TIMRRI2  DS    XL1                 RECORD INDICATOR 2                           
TIMRLMOS DS    PL2                 LOWEST MOS (PACKED YM)                       
TIMRRI3  DS    XL1                 RECORD INDICATOR 3                           
TIMRRI4  DS    XL1                 RECORD INDICATOR 4                           
TIMRHMOS DS    PL2                 HIGHEST MOS (PACKED YM)                      
TIMRLNK  DS    XL4                 LINKAGE AREA                                 
*++PROCESS OFF                                                                  
TIMRFST  EQU   *                   DISPLACEMENT TO FIRST ELEMENT                
*++PROCESS ON                                                                   
         SPACE 1                                                                
*++TYPE ELEMENT                                                                 
FHDELD   DSECT                     ** FILE HEADER ELEMENT **                    
*++IDENTIFIER                                                                   
FHDEL    DS    XL1                 ELEMENT CODE                                 
FHDELQ   EQU   X'01'                                                            
FHDLN    DS    XL1                 ELEMENT LENGTH                               
FHDLDAT  DS    CL8                 DATE LAST LOADED DD/MM/YY                    
FHDLTIM  DS    CL6                 TIME LAST LOADED HHMMSS                      
         DS    XL4                 N/D                                          
FHDFNAM  DS    CL12                FILE NAME                                    
FHDRCNT  DS    XL4                 FILE RECORD COUNT                            
FHDNTRK  DS    XL4                 NEXT AVAILABLE TRACK                         
FHDCNTR  DS    XL3                 COUNTER                                      
FHDLOAD  DS    XL2                 LAST FILE LOAD DATE                          
FHDUPDT  DS    XL2                 LAST UPDATE RUN DATE                         
FHDGOOD  DS    XL2                 LAST SUCCESSFUL UPDATE DATE                  
         DS    XL23                N/D                                          
*++ASSOCIATED FHDLN                                                             
FHDLNQ   EQU   *-FHDELD                                                         
         SPACE 1                                                                
HDRELD   DSECT                     ** CONTROL ELEMENT (HEADER REC) **           
*++IDENTIFIER                                                                   
HDREL    DS    XL1                 ELEMENT CODE                                 
HDRELQ   EQU   X'04'                                                            
HDRLN    DS    XL1                 ELEMENT LENGTH                               
HDRGEN   DS    PL6                 FILE GENERATION NUMBER                       
HDRDUMP  DS    CL6                 DATE FILE LAST DUMPED                        
         ORG   HDRDUMP                                                          
HDRLOAD  DS    XL2                 LAST FILE LOAD DATE                          
HDRUPDT  DS    XL2                 LAST UPDATE RUN DATE                         
HDRGOOD  DS    XL2                 LAST SUCCESSFUL UPDATE DATE                  
*++ASSOCIATED HDRLN                                                             
HDRLNQ   EQU   *-HDRELD                                                         
         SPACE 1                                                                
BTHELD   DSECT                     ** BATCH HEADER ELEMENT **                   
*++IDENTIFIER                                                                   
BTHEL    DS    XL1                 ELEMENT CODE                                 
BTHELQ   EQU   X'06'                                                            
BTHLN    DS    XL1                 ELEMENT LENGTH                               
BTHNAME  DS    CL15                BATCH NAME                                   
BTHCASH  DS    PL6                 BATCH CASH                                   
BTHITEM  DS    PL2                 BATCH ITEM COUNT                             
*++ASSOCIATED BTHLN                                                             
BTHLNQ   EQU   *-BTHELD                                                         
         SPACE 1                                                                
BTIELD   DSECT                     ** BATCH ITEM ELEMENT **                     
*++IDENTIFIER                                                                   
BTIEL    DS    XL1                 ELEMENT CODE                                 
BTIELQ   EQU   X'07'                                                            
BTILN    DS    XL1                 ELEMENT LENGTH                               
BTIREF   DS    CL6                 ITEM REFERENCE                               
BTIAMNT  DS    PL6                 ITEM AMOUNT                                  
BTIDA    DS    XL4                 ITEM DISK ADDRESS                            
*++ASSOCIATED BTILN                                                             
BTILNQ   EQU   *-BTIELD                                                         
         SPACE 1                                                                
GINELD   DSECT                     ** GROUP INVOICE NUMBER ELEMENT **           
*++IDENTIFIER                                                                   
GINEL    DS    XL1                 ELEMENT CODE                                 
GINELQ   EQU   X'08'                                                            
GINLN    DS    XL1                 ELEMENT LENGTH                               
GININV   DS    XL4                 GROUP INVOICE NUMBER                         
*++ASSOCIATED GINLN                                                             
GINLN1Q  EQU   *-GINELD                                                         
GINISN   DS    XL2                 INPUT SEQUENCE NUMBER (TX RECD)              
GINTYP   DS    XL1                 POSTING TYPE (TX RECD)                       
GINTMAC  EQU   0                   MAIN ACCOUNTING POSTING                      
GINTSUB  EQU   1                   SUBSIDIARY OR ANALYSIS POSTING               
*++ASSOCIATED GINLN                                                             
GINLN2Q  EQU   *-GINELD                                                         
         ORG   GINISN                                                           
GINHISN  DS    XL2                 HIGH INPUT SEQUENCE NO. (ITEM RECD)          
GINDELS  DS    XL2                 NUMBER OF DELETES (ITEM RECD)                
*++ASSOCIATED GINLN                                                             
GINLN3Q  EQU   *-GINELD                                                         
         SPACE 1                                                                
BROELD   DSECT                     ** BATCH REF OVERRIDE ELEMENT **             
*++IDENTIFIER                                                                   
BROEL    DS    XL1                 ELEMENT CODE                                 
BROELQ   EQU   X'09'                                                            
BROLEN   DS    XL1                 ELEMENT LENGTH                               
BROCODE  DS    CL4                 OVERRIDE FOR BATCH REF+2                     
*++ASSOCIATED BROLEN                                                            
BROLNQ   EQU   *-BROELD                                                         
         SPACE 1                                                                
CPYELD   DSECT                     ** COMPANY ELEMENT **                        
*++IDENTIFIER                                                                   
CPYEL    DS    XL1                 ELEMENT CODE                                 
CPYELQ   EQU   X'10'                                                            
CPYLN    DS    XL1                 ELEMENT LENGTH                               
CPYLOGO  DS    CL7                 ABBREVIATION FOR LOZENGE                     
CPYGLU   DS    CL1                 UNIT FOR GENERAL LEDGER                      
CPYBSL   DS    CL1                 LEDGER FOR BALANCE SHEET                     
CPYBANK  DS    CL2                 UNIT/LEDGER FOR BANK ACCOUNTS                
CPYPETY  DS    CL2                 UNIT/LEDGER FOR PETTY CASH                   
CPYPROD  DS    CL2                 UNIT/LEDGER FOR CLIENT/PRODUCT/JOBS          
CPYRECV  DS    CL2                 UNIT/LEDGER FOR RECEIVABLES                  
CPYSUPP  DS    CL2                 UNIT/LEDGER FOR SUPPLIERS                    
CPYSUPX  DS    CL1                 LEDGER CODE FOR SUPPLIER EXPENSE             
CPYPANL  DS    CL1                 LEDGER CODE FOR PROFIT AND LOSS              
CPYANAL  DS    CL1                 UNIT CODE FOR ANALYSIS LEDGERS               
CPYWRKSI DS    CL1                 1ST BYTE OF WORK CODES                       
*                                  WHICH REQUIRE STAFF INPUT                    
CPYVATN  EQU   5                   NUMBER OF VAT LIST ENTRIES                   
CPYVATR  DS    (CPYVATN)XL4        LIST OF VAT RULES                            
CPYVATL  EQU   *-CPYVATR                                                        
*                                  BYTES 1-2 = RATE, 3-4 = DATE                 
CPYSTAT1 DS    XL1                 STATUS BYTE ONE                              
CPYSIOMR EQU   X'80'               INVOICE/ORDER MATCH REQUIRED                 
CPYSCIVE EQU   X'40'               CHECK INVOICE CASH VS ESTIMATE               
CPYSOROE EQU   X'20'               OFFICE REQUIRED ON EXPENSES                  
CPYSCOST EQU   X'10'               MAKE COSTING POSTINGS                        
CPYSDISC EQU   X'08'               C/D ON EXPENSES TO INCOME ACCT               
CPYSGENA EQU   X'04'               COMPANY ON GENERAL ACCOUNTING                
CPYSNOJL EQU   X'02'               NO JOB LABELS                                
CPYSNOET EQU   X'01'               NO ESTIMATE TURNAROUND                       
CPYUID   DS    XL2                 PRINCIPAL ID NUMBER                          
CPYCDC   DS    CL1                 CASH DISCOUNT TO CLIENTS                     
CPYCDCNO EQU   C'N'                N=NO CASH DISCOUNT TO CLIENTS                
CPYSTAT2 DS    XL1                 STATUS BYTE TWO                              
CPYSETPP EQU   X'80'               EST. TURNAROUND ON PLAIN PAPER               
CPYSETAC EQU   X'40'               EST. TURNAROUND ACTUAL CHARGES               
CPYSEBIF EQU   X'20'               EST. AND BILL. AMT ON EST SCREEN             
CPYSETDO EQU   X'10'               EST. TURNAROUND-DIFFERENCE OPTN              
CPYSCKDP EQU   X'08'               CHECK INV NO./DATE/AMOUNT FOR DUPES          
CPYSVENR EQU   X'04'               DEMAND VENDOR FOR BT3 & BT22                 
CPYSCACA EQU   X'02'               CONTRA A/C ON JOB BT3 IS CASH A/C            
CPYSERTP EQU   X'01'               EST. REQUIRED FOR TALENT PAY                 
CPYMOSX  DS    CL1                 LATEST CLOSED MOS (1-9,A,B OR C)             
CPYTENO  DS    XL1                 NO. OF BYTES FOR T/E CONTRA-A/C              
CPYSTAT3 DS    XL1                 STATUS BYTE THREE                            
CPYSSXCC EQU   X'80'               SX C/A IS CLIENT                             
CPYSWO14 EQU   X'40'               DEMAND W/O ACCOUNT ON TYPE 14                
CPYSPC1C EQU   X'20'               PROJECT CONTROL = 1C                         
CPYSOPBM EQU   X'10'               OVERRIDE STANDARD BATCH MONTH RULES          
CPYSCA22 EQU   X'08'               C/A ON SE POSTING BT22 IS CASH A/C           
CPYSPCSJ EQU   X'04'               PROJECT CONTROL = SJ                         
CPYSDPST EQU   X'02'               DPS-TYPE COMPANY (TALENT)                    
CPYSBSEC EQU   X'01'               BATCH SECURITY FOR BT5 & BT45                
CPYSFST  DS    XL1                 START MONTH OF FINANCIAL YEAR                
CPYBSEC  DS    XL1                 BATCH SECURITY                               
CPYBSSEC EQU   X'02'               VALIDATE LEDGER/ACCOUNT SECURITY             
CPYBSOFF EQU   X'01'               VALIDATE ACCOUNT OFFICE                      
CPYREPC  DS    XL2                 REP CODE FOR COMMISSION ONLY                 
CPYSTAT4 DS    XL1                 STATUS BYTE FOUR                             
CPYSPESK EQU   X'80'               POST %EST JOBS TO SK                         
CPYSOV12 EQU   X'40'               BACKDATE BATCH MORE THAN 1 YEAR              
*&&UK                                                                           
CPYSICPY EQU   X'20'               MAKE INTERCOMPANY POSTINGS                   
CPYSGEN2 EQU   X'10'               NEW G/L SYSTEM IN USE                        
CPYSNPRD EQU   X'08'               NEW PRODUCTION SYSTEM IN USE                 
*&&                                                                             
*&&US                                                                           
CPYSNPRD EQU   X'20'               NEW PRODUCTION SYSTEM IN USE                 
CPYSMINT EQU   X'10'               NEW MEDIA INTERFACE RECS IN USE              
CPYSICPY EQU   X'08'               MAKE INTERCOMPANY POSTINGS                   
*&&                                                                             
CPYSPRAT EQU   X'04'               NEW BILLABLE TIME RATES IN USE               
CPYSIREG EQU   X'02'               INVOICE REGISTER IN USE                      
CPYSOFF2 EQU   X'01'               NEW OFFICE SYSTEM IN USE                     
CPYSBILL DS    PL3                 CLIENT (CREATIVE BILL NUMBER)                
CPYALPHA DS    CL2                 AGENCY ALPHA CODE                            
CPYDEPTL DS    XL1                 LENGTH OF DEPARTMENT CODES                   
*++ASSOCIATED CPYLN                                                             
CPYLN1Q  EQU   *-CPYELD                                                         
CPYPCFY  DS    PL2                 PREVIOUS CLOSED FINANCIAL YEAR (MOS)         
CPYCCFY  DS    PL2                 CURRENT CLOSED FINANCIAL YEAR (MOS)          
CPYSTAT5 DS    XL1                 STATUS BYTE FIVE                             
CPYSOFPL EQU   X'80'               COMPANY USES OFFICES FOR P&L ONLY            
*&&UK                                                                           
CPYSNEWF EQU   X'40'               NEW ARTISTE FEE SYSTEM IN USE                
*&&                                                                             
CPYSBAPR EQU   X'20'               REGULAR BATCH APPROVAL                       
CPYSBAPE EQU   X'10'               APPROVAL FOR EFFECTIVE BATCHES REQD.         
CPYSNCST EQU   X'08'               NEW COST SYSTEM IN USE                       
CPYSEXPP EQU   X'04'               PRODUCT REQUIRED FOR EXP. ANALYSIS           
*&&US                                                                           
CPYSVEND EQU   X'02'               COPY PROD VEND TO EXP VEND ON TY61           
CPYAPGS  EQU   X'01'               APG SECURITY IN USE                          
*&&                                                                             
*&&UK                                                                           
CPYSNLFM EQU   X'02'               LFM NOT ALLOWED FOR PROD RECORDS             
CPYSNVAT EQU   X'01'               NEW VATRATE RECORD IN USE                    
*&&                                                                             
CPYSTAT6 DS    XL1                 STATUS BYTE SIX                              
CPYSADVP EQU   X'80'               GENERATE ADVERTISER POINTERS                 
CPYSRAPP EQU   X'40'               GENERATE RECORD ACTIVITY POINTERS            
CPYSNO60 EQU   X'20'               DON'T GENERATE AUTOMATIC AC60                
CPYSFTXR EQU   X'10'               CAN USE FT EXCHANGE RATES                    
CPYSBANY EQU   X'08'               ANY BATCH MONTH IS VALID                     
CPYSFBIL EQU   X'04'               COMPANY USES FC BILLING                      
CPYSFMCR EQU   X'02'               COMPANY HAS FC MEDIA SUPPLIERS               
CPYSFOCR EQU   X'01'               COMPANY HAS FC ACCOUNTING SUPPLIERS          
CPYSTAT7 DS    XL1                 STATUS BYTE SEVEN                            
*&&UK                                                                           
CPYSAPSP EQU   X'80'               APS PRINTING FOR BILLS (GER)                 
CPYSNEWO EQU   X'40'               NEW OFFICE RECORDS IN USE                    
CPYSLA2D EQU   X'10'               USE LAST 2 CHRS OF DEPARTMENT INPUT          
*                                  FOR 1P DEPARTMENT CODE IN POSTMAN            
*&&                                                                             
CPYSAGRP EQU   X'20'               ACCOUNT GROUPS IN USE                        
CPYSTMSY EQU   X'08'               TIME MANAGEMENT SYSTEM IN USE                
CPYSJTIM EQU   X'04'               JOB TIME SHEET POSTINGS                      
CPYSL1NA EQU   X'02'               LOOKUP 1N ANALYSIS AT ALLOC TIME             
*&&US                                                                           
CPYSNEWB EQU   X'01'               NEW BILLING IN USE                           
*&&                                                                             
*&&UK                                                                           
CPYSSCNV EQU   X'01'               OCAEL CONVERSION HAS BEEN RUN                
*&&                                                                             
CPYSTAT8 DS    XL1                 STATUS BYTE EIGHT                            
CPYSRLOG EQU   X'80'               PRINT LOGOS ON REMOTE TURNAROUNDS            
CPYSTEST EQU   X'40'               COMPANY USES TIME ESTIMATING                 
*&&UK                                                                           
CPYS1P13 EQU   X'20'               CHANGE 1PDDX TO 13X FOR EXPENSE              
CPYSTTAX EQU   X'10'               SUPPORT TAX TYPE CODES ON SE POSTING         
*&&                                                                             
CPYSFNAM EQU   X'08'               FILTER NAMES SUPPORTED                       
*&&UK                                                                           
CPYS1CUT EQU   X'04'               1C UNBILLABLE TIME BUCKETS                   
*&&                                                                             
CPYSJBBO EQU   X'02'               JOURNAL BATCHES TO BALANCE BY OFFICE         
CPYSSPDS EQU   X'01'               SUPPRESS DISCOUNT ACC FIELDS IN BT70         
CPYTAX   DS    CL2                 UNIT/LEDGER FOR TAX ACCOUNTS                 
CPYOFFC  DS    XL2                 GENERAL LEDGER DEFAULT OFFICE CODE           
*&&UK                                                                           
CPYDEBOT DS    XL1                 $DEBTORS PROGRAM OVERLAY TYPE                
*&&                                                                             
*&&US                                                                           
CPYTSD   DS    XL1                 TIMESHEET DAY (IN GETDAY # FORMAT)           
*&&                                                                             
CPYCURR  DS    CL3                 COMPANY CURRENCY CODE                        
CPYTBIND DS    XL1                 DISPLACEMENT TO SPECIAL CHARACTER            
*                                  THAT IS INSERTED BY BILLING ON SR            
*                                  TAX ONLY POSTINGS IN THE UK                  
*&&UK                                                                           
CPYCRDOT DS    XL1                 =FILE CREDITOR OVERLAY NUMBER                
CPYBNKOT DS    XL1                 =FILE BANK A/C OVERLAY NUMBER                
         DS    XL1                 N/D                                          
*&&                                                                             
*&&US                                                                           
CPYXSUPP DS    CL1                 LEDGER CODE - EXTRA PROD. SUPPLIERS          
CPYCTFIL DS    XL2                 ALPHA CODE FOR MEDIA BUYS                    
*&&                                                                             
*++ASSOCIATED CPYLN                                                             
CPYLN2Q  EQU   *-CPYELD                                                         
CPYTCMP  DS    XL1                 HEX COMPANY CODE FOR CONVERSION USE          
CPYTMSSD DS    XL2                 TMS START DATE (COMPRESSED)                  
CPYSTAT9 DS    XL1                 STATUS BYTE NINE                             
CPYSBGXT EQU   X'80'               LOAD EXTERNAL DURING BG PROCESSING           
CPYSEDHO EQU   X'40'               EDIT HOURS DOWNLOAD FOR TEMPO                
*&&UK                                                                           
CPYSTATQ EQU   X'20'               AUTHORISED FOR STATS ENQUIRIES               
*&&                                                                             
CPYSXDSJ EQU   X'10'               CAN POST EXCH. DIFF. TO JOB IN =MAR          
*&&UK                                                                           
CPYSSRFR EQU   X'08'               SUBREF REQUIRED FOR INVOICE BATCHES          
CPYS2CNV EQU   X'04'               SECONDARY CURRENCY CONVERSION RUN            
CPYSLASF EQU   X'02'               LIMITED SF AMENDMENTS ALLOWED                
CPYSSRNM EQU   X'01'               AGENCY USES TX SERIAL NUMBERS                
*&&                                                                             
CPYCURRS DS    CL3                 2ND CURRENCY OR BINARY ZEROES                
CPYSCMOA DS    PL2                 2ND CURRENCY START MONTH                     
*&&UK                                                                           
CPYSTATA DS    XL1                 COMPANY STATUS BYTE A                        
*&&                                                                             
*&&US                                                                           
         DS    CL1                 SPARE                                        
*&&                                                                             
*++ASSOCIATED CPYLN                                                             
CPYLN3Q  EQU   *-CPYELD                                                         
         SPACE 1                                                                
         SPACE 1                                                                
PMDELD   DSECT                     ** PRODUCTION MEDIA ELEMENT **               
*++IDENTIFIER                                                                   
PMDEL    DS    XL1                 ELEMENT CODE                                 
PMDELQ   EQU   X'11'                                                            
PMDLN    DS    XL1                 ELEMENT LENGTH                               
PMDCODE  DS    CL1                 MEDIA CODE (FIRST CHARACTER IN JOB)          
PMDSPACE DS    CL3                 PRESET TO SPACES                             
PMDDESC  DS    CL12                MEDIA DESCRIPTION                            
PMDCOM1  DS    0XL15               COMMISSION ACCOUNT FOR BILLS                 
PMDCOMC1 DS    XL1                 COMPANY CODE                                 
PMDCOMU1 DS    CL1                 UNIT CODE                                    
PMDCOML1 DS    CL1                 LEDGER CODE                                  
PMDCOMA1 DS    CL12                ACCOUNT CODE                                 
PMDVAT1  DS    0XL15               VAT ACCOUNT FOR BILLS                        
PMDVATC1 DS    XL1                 COMPANY CODE                                 
PMDVATU1 DS    CL1                 UNIT CODE                                    
PMDVATL1 DS    CL1                 LEDGER CODE                                  
PMDVATA  DS    CL12                ACCOUNT CODE                                 
         ORG   PMDVAT1                                                          
PMDCSHD  DS    0XL15               CASH DISCOUNT ACCOUNT FOR BILLS              
PMDCSHDC DS    XL1                 COMPANY CODE                                 
PMDCSHDU DS    CL1                 UNIT CODE                                    
PMDCSHDL DS    CL1                 LEDGER CODE                                  
PMDCSHDA DS    CL12                ACCOUNT CODE                                 
PMDFBILL DS    CL6                 FIRST BILL NUMBER                            
PMDLBILL DS    CL6                 LAST BILL NUMBER                             
PMDRBILL DS    CL4                 RESET BILL NUMBER                            
PMDANAL  DS    CL1                 ANALYSIS CODE                                
PMDSTAT  DS    XL1                 MEDIA STATUS                                 
PMDSPNIH EQU   X'80'               PRINT MEDIA NAME IN BILL HEADS               
PMDSTV   EQU   JOBSTV              MEDIA IS TV FOR TALENT INTERFACE             
PMDSRAD  EQU   JOBSRAD             MEDIA IS RADIO FOR TALENT INTERFACE          
PMDGRP   DS    CL1                 MEDIA GROUP CODE                             
         DS    XL3                 N/D                                          
*++ASSOCIATED PMDLN                                                             
PMDLN1Q  EQU   *-PMDELD                                                         
*&&UK                                                                           
*                                  ** UK EXTENSION TO MEDIA ELEMENT **          
PMDVAT2  DS    0XL15               SECOND VAT ACC FOR NON-VATABLE CL.           
PMDVATC2 DS    XL1                 COMPANY CODE                                 
PMDVATU2 DS    CL1                 UNIT CODE                                    
PMDVATL2 DS    CL1                 LEDGER CODE                                  
PMDVATA2 DS    CL12                ACCOUNT CODE                                 
PMDCOM2  DS    0XL15               SECOND (INTERNAL) INCOME ACCOUNT             
PMDCOMC2 DS    XL1                 COMPANY CODE                                 
PMDCOMU2 DS    CL1                 UNIT CODE                                    
PMDCOML2 DS    CL1                 LEDGER CODE                                  
PMDCOMA2 DS    CL12                ACCOUNT CODE                                 
PMDFLT1  DS    0XL15               FREELANCE TAX ACCOUNT#1                      
PMDFLTC1 DS    XL1                 COMPANY CODE                                 
PMDFLTU1 DS    CL1                 UNIT CODE                                    
PMDFLTL1 DS    CL1                 LEDGER CODE                                  
PMDFLTA1 DS    CL12                ACCOUNT CODE                                 
PMDFLT2  DS    0XL15               FREELANCE TAX ACCOUNT#2                      
PMDFLTC2 DS    XL1                 COMPANY CODE                                 
PMDFLTU2 DS    CL1                 UNIT CODE                                    
PMDFLTL2 DS    CL1                 LEDGER CODE                                  
PMDFLTA2 DS    CL12                ACCOUNT CODE                                 
PMDANAL2 DS    CL1                 SECOND ANALYSIS CODE (INTERNAL)              
*++ASSOCIATED PMDLN                                                             
PMDLN2Q  EQU   *-PMDELD                                                         
*&&                                                                             
*&&US                                                                           
*                                  ** US EXTENSION TO MEDIA ELEMENT **          
PMDPRCD  DS    CL15                PRINT C.D. ACCCOUNT                          
PMDTWO   DS    CL15                TIME WRITE-OFF ACCOUNT                       
PMDCOST  DS    CL12                COST ANALYSIS CODE                           
PMDLN2Q  EQU   *-PMDELD                                                         
PMDTIN   DS    CL15                TIME INCOME ACCOUNT                          
         DS    CL45                N/D                                          
*++ASSOCIATED PMDLN                                                             
PMDLN3Q  EQU   *-PMDELD                                                         
*&&                                                                             
         SPACE 1                                                                
WCOELD   DSECT                     ** WORK CODE ELEMENT **                      
*++IDENTIFIER                                                                   
WCOEL    DS    XL1                 ELEMENT CODE                                 
WCOELQ   EQU   X'12'                                                            
WCOLN    DS    XL1                 ELEMENT LENGTH                               
WCOCODE  DS    CL2                 WORK CODE                                    
WCODESC  DS    CL15                WORK CODE DESCRIPTION                        
WCOSTAT  DS    XL1                 WORK CODE STATUS                             
WCOSSIND EQU   X'80'               SUPPRESS INVOICE DETAIL                      
WCOSSDP1 EQU   X'40'               SUPPRESS DETAIL ON P1 REPORT                 
*&&UK                                                                           
WCOSINTR EQU   X'20'               W/C IS INTERNAL                              
WCOSEXTR EQU   X'10'               W/C IS EXTERNAL                              
*&&                                                                             
*&&US                                                                           
WCOSEXPT EQU   X'20'               W/C IN 2P/29 IS TRAVEL                       
WCOSEXPE EQU   X'10'               W/C IN 2P/29 IS ENTERTAINING                 
*&&                                                                             
WCOSHCOE EQU   X'08'               HOURS CARRIED IN ORIG. EST.                  
WCOSDP14 EQU   X'04'               DON'T PRINT ON AC14 (UK ONLY)                
*&&UK                                                                           
WCOSEARQ EQU   X'03'               EXP. ANAL. REQ'D ON PROD. INPUT              
WCOSEABJ EQU   X'02'               EXP. ANAL. REQ'D ON BILLABLE JOBS            
WCOSEAUJ EQU   X'01'               EXP. ANAL. REQ'D ON UNBILLABLE JOBS          
*&&                                                                             
*&&US                                                                           
WCOSNONC EQU   X'02'               W/C IS NON-COMMISSIONABLE                    
WCOSMEDT EQU   X'01'               W/C IS A MEDIA TRANSFER                      
*&&                                                                             
WCORMED  DS    CL1                 MEDIA FOR RETAIL SCHEMES                     
*&&UK                                                                           
WCOSTAT2 DS    XL1                 WORK CODE STATUS BYTE 2                      
WCOSSINV EQU   X'80'               SUPPRESS INV DETAIL UNLESS PROFILE           
*                                  OVERRIDE (GER BILLING ONLY)                  
WCOSSREF EQU   X'40'               SUPPRESS REFERENCE AS ABOVE.                 
WCOSNSCH EQU   X'20'               WORKCODE IS NOT SURCHARGABLE                 
WCOSLORD EQU   X'08'               LOCKED FOR ORDERS                            
WCOSLEST EQU   X'04'               LOCKED FOR ESTIMATES                         
WCOSLPST EQU   X'02'               LOCKED FOR POSTINGS                          
WCOSLBIL EQU   X'01'               LOCKED FOR BILLING                           
WCOGRP   DS    CL1                 WORK CODE GROUP                              
         DS    XL1                 N/D                                          
*&&                                                                             
*&&US                                                                           
WCOGRP   DS    CL1                 WORK CODE GROUP                              
WCOTYPE  DS    CL1                 WORK CODE TYPE (T, O, P OR M)                
WCOSTAT2 DS    XL1                 WORK CODE STATUS BYTE 2                      
WCOSINA  EQU   X'80'               WORK CODE IS INACTIVE                        
WCOSART  EQU   X'40'               ADJUST THE RATE (TYPE 49)                    
WCOSINC  EQU   X'20'               WORKCODE IS INTERNAL INCOME                  
WCOSLPST EQU   X'02'               LOCKED FOR POSTINGS                          
*&&                                                                             
*++ASSOCIATED WCOLN                                                             
WCOLNQ   EQU   *-WCOELD                                                         
         SPACE 1                                                                
RTYELD   DSECT                     ** RECORD TYPE ELEMENT **                    
*++IDENTIFIER                                                                   
RTYEL    DS    XL1                 ELEMENT CODE                                 
RTYELQ   EQU   X'13'                                                            
RTYLN    DS    XL1                 ELEMENT LENGTH                               
RTYREC   DS    XL1                 RECORD TYPE                                  
RTYROFF  EQU   1                   OFFICE                                       
RTYRDPT  EQU   2                   DEPARTMENT                                   
RTYRSBD  EQU   3                   SUB-DEPARTMENT                               
RTYRPER  EQU   4                   PERSON                                       
RTYCLEN  DS    XL1                 LENGTH OF KEY CODE                           
RTYDICT  DS    XL2                 DICTIONARY NUMBER FOR TEXT                   
         DS    XL6                 N/D                                          
RTYULLN  DS    XL1                 NUMBER OF SUB-ELEMENTS                       
*++ASSOCIATED RTYLN                                                             
RTYLN1Q  EQU   *-RTYELD                                                         
*                                                                               
RTYULL   DS    0XL3                                                             
RTYUNT   DS    CL1                 UNIT                                         
RTYLDG   DS    CL1                 LEDGER                                       
RTYLVL   DS    XL1                 ACCOUNT LEVEL IN LEDGER                      
         SPACE 1                                                                
LDGELD   DSECT                     ** LEDGER ELEMENT **                         
*++IDENTIFIER                                                                   
LDGEL    DS    XL1                 ELEMENT CODE                                 
LDGELQ   EQU   X'14'                                                            
LDGLN    DS    XL1                 ELEMENT LENGTH                               
LDGLIKE  DS    CL1                 LEDGER IS LIKE:-                             
LDGLPROD EQU   C'J'                PRODUCTION LEDGER                            
LDGLRECV EQU   C'R'                RECEIVABLE LEDGER                            
LDGSPRNT DS    CL1                 STATEMENT PRINTING CONTROL                   
LDGSTAT  DS    XL1                 LEDGER STATUS                                
LDGSBFRD EQU   X'80'               USE RUN DATE FOR BBF DATE IN AC98            
LDGSCOST EQU   X'04'               COST POSTINGS FOR EXPENSE LEDGER             
*&&US                                                                           
LDGSCHQO EQU   X'40'               AC55 REQUESTED AND PRINTED AT AGENCY         
LDGSCANL EQU   X'20'               CANADIAN LEDGER                              
LDGSVENR EQU   X'10'               VEHICLE NUMBER REQUIRED                      
LDGSCOKE EQU   X'08'               COKE EXPENDITURE LEDGER                      
LDGSNEWT EQU   X'04'               USING NEW TALENT PAYMENT                     
LDGSERNT EQU   X'02'               EST. REQ'D FOR NEW TALENT PAY                
LDGRUPCT EQU   X'01'               RETAIL UNITS ARE PERCENTS                    
*&&                                                                             
LDGTYPE  DS    CL1                 LEDGER TYPE                                  
LDGTANAL EQU   C'A'                ANALYSIS LEDGER                              
LDGTSUBS EQU   C'S'                SUBSIDIARY LEDGER                            
LDGTGENL EQU   C'G'                GENERAL LEDGER                               
LDGOPOS  DS    XL1                 LOCATION OF OFFICE FOR LEDGER                
LDGONONE EQU   0                   NO OFFICE                                    
LDGOKEY  EQU   12                  1-12 DISPLACEMENT TO OFFICE IN KEY           
LDGOKEY2 EQU   X'40'               ON=2 CHARACTER OFFICE IN KEY                 
LDGONKLO EQU   LDGOKEY2+1          1-12 DISPLACEMENT TO TWO CHARACTER           
LDGONKHI EQU   LDGOKEY2+12         OFFICE IN ACCOUNT KEY                        
LDGOPROF EQU   C'C'                PRODUCTION PROFILE  (PPRGAOFF)               
LDGOTRAN EQU   C'T'                TRANSACTIONS        (TRNOFFC)                
LDGOFLT1 EQU   C'1'                ACCOUNT FILTER 1    (RSTFILT1)               
LDGOFLT2 EQU   C'2'                ACCOUNT FILTER 2    (RSTFILT2)               
LDGOFLT3 EQU   C'3'                ACCOUNT FILTER 3    (RSTFILT3)               
LDGOFLT4 EQU   C'4'                ACCOUNT FILTER 4    (RSTFILT4)               
LDGDPOS  DS    XL1                 DISPLACEMENT TO DEPARTMENT CODE              
LDGDLEN  DS    XL1                 LENGTH OF DEPARTMENT CODE                    
         ORG   LDGDPOS                                                          
LDGLAGT  DS    CL2                 LAST AGENT CODE USED (TALENT SN)             
*&&UK                                                                           
LDGCDSC  DS    0XL15               ACCOUNT FOR CASH DISCOUNT                    
LDGCDSCC DS    XL1                 COMPANY CODE                                 
*&&                                                                             
*&&US                                                                           
LDGCDSC  DS    0XL14               ACCOUNT FOR CASH DISCOUNT                    
*&&                                                                             
LDGCDSCU DS    CL1                 UNIT CODE                                    
LDGCDSCL DS    CL1                 LEDGER CODE                                  
LDGCDSCA DS    CL12                ACCOUNT CODE                                 
*&&US*&& DS    XL1                 N/D                                          
LDGCPOS  DS    XL1                 DISPLACEMENT TO CLIENT CODE                  
LDGBPOS  DS    XL1                 DISPOSITION OF OFFICE CODE IN THIS           
*                                  LEDGER FOR BUDGETS (SEE LDGOPOS)             
LDGWONUM DS    XL2                 WRITE-OFF NUMBER FOR CREATIVE BILLS          
         ORG   LDGWONUM                                                         
LDGXMSK  DS    XL2                 EXPENSE CATEGORY MASK FOR SE                 
LDGCLOS  DS    XL1                 LEDGER CLOSE TYPE                            
LDGCBBF  EQU   1                   REGULAR BALANCE BROUGHT FORWARD              
LDGCPBL  EQU   2                   PAYABLES LEDGER (SEMI OPEN ITEM)             
LDGCZBF  EQU   3                   ZERO BALANCE FORWARD (SE, SI)                
LDGCRCV  EQU   4                   RECEIVABLES LEDGER (OPEN ITEM)               
LDGCPRD  EQU   5                   PRODUCTION LEDGER (OPEN ITEM)                
LDGCCSH  EQU   6                   CASH LEDGER (BBF + ACCOUNT OVERRIDE)         
LDGCMBF  EQU   7                   MATCHED BALANCE FORWARD (SZ, SK)             
LDGOFFC  DS    XL2                 GENERAL LEDGER DEFAULT OFFICE CODE           
LDGSTAT2 DS    XL1                 LEDGER STATUS BYTE 2                         
LDGSSRCH EQU   X'80'               USE LEDGER FOR SEARCH                        
LDGSCPAY EQU   X'40'               CONVERTED PAYABLE LEDGER                     
LDGSSNAM EQU   X'20'               ADD SEARCH NAME RECORDS (SANRECD)            
LDGSGCAP EQU   X'10'               GENERATE CONTRA-HEADER POINTERS              
LDGSGTRP EQU   X'08'               GENERATE TRANSACTION POINTERS                
*++ASSOCIATED LDGLN                                                             
LDGLNQ   EQU   *-LDGELD                                                         
         SPACE 1                                                                
GLPELD   DSECT                     ** GENERAL LEDGER POSTING ELEMENT **         
*++IDENTIFIER                                                                   
GLPEL    DS    XL1                 ELEMENT CODE                                 
GLPELQ   EQU   X'15'                                                            
GLPLN    DS    XL1                 ELEMENT LENGTH                               
GLPSUB   DS    CL10                SPACES=POST ALL ACCOUNTS ON LEDGER           
*                                         TO GLPACC1                            
*                                  NON-SPACES=POST THIS SPECIFIC ACCT           
*                                  FOR PRODUCTION THIS IS MEDIA CODE            
         ORG   GLPSUB                                                           
GLPFLTS  DS    CL5                 FILTERS FOR FINANCIAL REPORTING              
GLPACTN  DS    CL1                 ACTION FOR FINANCIAL                         
GLPBTYP  DS    XL1                 BUCKET TYPE                                  
         DS    XL3                 N/D                                          
GLPACC1  DS    0CL14               ACCOUNT CODE IN GENERAL LEDGER               
GLPACC1U DS    CL1                 UNIT CODE                                    
GLPACC1L DS    CL1                 LEDGER CODE                                  
GLPACC1A DS    CL12                ACCOUNT CODE                                 
*++ASSOCIATED GLPLN                                                             
GLPLN1Q  EQU   *-GLPELD                                                         
GLPACC2  DS    0CL14               OPTIONAL SECOND ACCOUNT FOR RANGE            
GLPACC2U DS    CL1                 UNIT CODE                                    
GLPACC2L DS    CL1                 LEDGER CODE                                  
GLPACC2A DS    CL12                ACCOUNT CODE                                 
*++ASSOCIATED GLPLN                                                             
GLPLN2Q  EQU   *-GLPELD                                                         
GLPCON1  DS    0CL14               OPTIONAL CONTRA-ACCOUNT                      
GLPCON1U DS    CL1                 CONTRA-UNIT CODE                             
GLPCON1L DS    CL1                 CONTRA-LEDGER CODE                           
GLPCON1A DS    CL12                CONTRA-ACCOUNT CODE                          
*++ASSOCIATED GLPLN                                                             
GLPLN3Q  EQU   *-GLPELD                                                         
GLPCON2  DS    0CL14               OPTIONAL SECOND CONTRA-ACCOUNT               
GLPCON2U DS    CL1                 CONTRA-UNIT CODE                             
GLPCON2L DS    CL1                 CONTRA-LEDGER CODE                           
GLPCON2A DS    CL12                CONTRA-ACCOUNT CODE                          
*++ASSOCIATED GLPLN                                                             
GLPLN4Q  EQU   *-GLPELD                                                         
         SPACE 1                                                                
ACLELD   DSECT                     ** ACCOUNT LENGTHS ELEMENT **                
*++IDENTIFIER                                                                   
ACLEL    DS    XL1                 ELEMENT CODE                                 
ACLELQ   EQU   X'16'                                                            
ACLLN    DS    XL1                 ELEMENT LENGTH (ACLLN1Q+L'ACLVALS*N)         
ACLLN1Q  EQU   *-ACLELD                                                         
ACLVALS  DS    0XL16               ACCOUNT LENGTHS AND DESCRIPTIONS             
ACLVLEN  DS    XL1                 LENGTH OF THIS LEVEL                         
ACLVDESC DS    CL15                NAME OF THIS ACCOUNT LEVEL                   
         SPACE 1                                                                
SHOELD   DSECT                     ** STANDARD HOURS ELEMENT **                 
*++IDENTIFIER                                                                   
SHOEL    DS    XL1                 ELEMENT CODE                                 
SHOELQ   EQU   X'17'                                                            
SHOLN    DS    XL1                 ELEMENT LENGTH                               
SHODATE  DS    PL2                 YEAR/MONTH (PWOS)                            
SHOURS   DS    5PL4                HOURS (UNITS) FOR PERIOD                     
*++ASSOCIATED SHOLN                                                             
SHOLNQ   EQU   *-SHOELD                                                         
         SPACE 1                                                                
MSLELD   DSECT                     ** MOS LOCK ELEMENT **                       
*++IDENTIFIER                                                                   
MSLEL    DS    XL1                 ELEMENT CODE                                 
MSLELQ   EQU   X'18'                                                            
MSLLN    DS    XL1                 ELEMENT LENGTH (MSLLN1Q+L'MSLVALS*N)         
MSLNUM   DS    XL1                 NUMBER OF MSLVALS ENTRIES                    
*++ASSOCIATED MSLLN                                                             
MSLLN1Q  EQU   *-MSLELD                                                         
MSLVALS  DS    0XL3                MOS LOCK VALUES                              
MSLVALS2 DS    0XL4                MOS LOCK VALUES - EXTENDED LENGTH            
MSLVTYP  DS    XL1                 BATCH TYPE                                   
MSLVMON  DS    CL1                 LATEST LOCKED MONTH FOR ABOVE TYPE           
MSLVSEC  DS    XL1                 SECURITY LEVEL                               
MSLVSXTN EQU   X'80'               EXTENDED ENTRY CARRIES YEAR                  
MSLVSDEF EQU   X'40'               NO BATCH TYPE MOS OVERRIDE                   
MSLVSDUM EQU   X'08'               DUMMY ENTRY CARRIES DEFAULT MM/YY            
MSLVSSEC EQU   X'02'               CHECK LEDGER/ACCOUNT SECURITY NUMBER         
MSLVSOFF EQU   X'01'               CHECK ACCOUNT OFFICE SECURITY                
MSLVYEAR DS    XL1                 YEAR (BINARY) - EXTENDED ENTRY ONLY          
         SPACE 1                                                                
MDIELD   DSECT                     ** MEDIA INTERFACE ELEMENT **                
*++IDENTIFIER                                                                   
MDIEL    DS    XL1                 ELEMENT CODE                                 
MDIELQ   EQU   X'19'                                                            
MDILN    DS    XL1                 ELEMENT LENGTH                               
MDICODE  DS    CL2                 MEDIA CODE                                   
MDIDESC  DS    CL12                MEDIA DESCRIPTION                            
MDICOMM  DS    CL14                COMMISSION ACCOUNT                           
MDICSHD  DS    CL14                CASH DISCOUNT ACCOUNT                        
MDICSHR  DS    CL14                CASH RECEIPT ACCOUNT                         
MDICCSR  DS    CL14                CANADIAN CASH RECEIPT ACCOUNT                
MDICNTL  DS    CL14                MEDIA CONTROL ACCOUNT                        
MDICOST  DS    CL12                COST ANALYSIS (11 AND 12)                    
MDILOST  DS    CL14                LOST CASH DISCOUNT ACCOUNT                   
MDICONL  DS    CL14                COMMISSION ONLY CONTROL                      
         DS    XL12                N/D                                          
*++ASSOCIATED MDILN                                                             
MDILNQ   EQU   *-MDIEL                                                          
         SPACE 1                                                                
MDTELD   DSECT                     ** MEDIA TRANSFER ELEMENT **                 
*++IDENTIFIER                                                                   
MDTEL    DS    XL1                 ELEMENT CODE                                 
MDTELQ   EQU   X'1A'                                                            
MDTLN    DS    XL1                 ELEMENT LENGTH                               
MDTSYS   DS    CL1                 SYSTEM                                       
MDTSSPOT EQU   C'S'                SPOT                                         
MDTSPRNT EQU   C'P'                PRINT                                        
MDTSPROD EQU   C'J'                PRODUCTION                                   
MDTSINTA EQU   C'I'                INTERAGENCY                                  
MDTMED   DS    CL1                 MEDIA CODE                                   
MDTCLI   DS    CL3                 CLIENT CODE                                  
MDTPRD   DS    CL3                 PRODUCT CODE                                 
MDTJOB   DS    CL6                 JOB CODE                                     
         ORG   MDTJOB                                                           
MDTEST   DS    CL6                 ESTIMATE NUMBER                              
MDTSTAT  DS    XL1                 STATUS BITS                                  
MDTSMIQ  EQU   X'02'               MDTMED2 IS A MI RECORD CODE                  
MDTMED2  DS    CL2                 INTERAGENCY MEDIA CODE                       
MDTMOS   DS    PL2                 MONTH OF SERVICE (YYMM)                      
MDTDSCP  DS    CL36                ESTIMATE DESCRIPTION / JOB NAME              
MDTGRS   DS    XL4                 BILLING (GROSS)                              
MDTNET   DS    XL4                 PAYABLE (EXTERNAL)                           
MDTCOM   DS    XL4                 INCOME  (COMMISSION)                         
MDTCD    DS    XL4                 CASH DISCOUNT                                
MDTINTL  DS    XL4                 INCOME (INTERNAL)                            
MDTRECV  DS    XL4                 ACCOUNTS RECEIVABLE                          
MDTFDTE  DS    XL2                 FROM MONTH/YR OR CURR (COMPRESSED)           
MDTTDTE  DS    XL2                 TO MONTH/YR OR ZEROES (COMPRESSED)           
MDTVAT   DS    XL4                 VAT AMOUNT                                   
MDTDTE   DS    XL2                 TRANSFER DATE (COMPRESSED)                   
MDTBTYPE DS    CL2                 MEDIA BILL TYPE                              
MDTBAOR  EQU   C'AM'               AOR CLIENT (MAIN BILL)                       
MDTBAA   EQU   C'AA'               AOR TRUE                                     
MDTBAJ   EQU   C'AJ'               AOR ADJUSTMENT                               
MDTBAC   EQU   C'AC'               AOR CASH DISCOUNT                            
MDTBAUFC EQU   C'AU'               AOR UPFRONT COMMISSION                       
MDTBAUFN EQU   C'AN'               AOR UPFRONT NET BILL                         
MDTBCD   EQU   C'CM'               CASH DISCOUNT (MAIN BILL)                    
MDTBCDC  EQU   C'CC'               CASH DISCOUNT BILL                           
MDTBRET  EQU   C'R '               GENERAL RETAIL BILL                          
MDTBRC   EQU   C'RC'               RETAIL CORPORATE OUTLET                      
MDTBRP   EQU   C'RP'               RETAIL PARTICIPANT OUTLET                    
MDTBADJ  EQU   C'J '               COMMISSION ADJUSTMENT                        
MDTBCOM  EQU   C'O '               COMMISSION ONLY                              
MDTBFIN  EQU   C'FM'               FINANCIAL (MAIN BILL)                        
MDTBFR   EQU   C'FR'               FINANCIAL REBATE                             
MDTBREG  EQU   C'G '               REGULAR BILL                                 
MDTBRUFC EQU   C'GC'               REGULAR UPFRONT COMMISSION BILL              
MDTBRUFN EQU   C'GN'               REGULAR UPFRONT NET BILL                     
*++ASSOCIATED MDTLN                                                             
MDTLNQ   EQU   *-MDTEL                                                          
         SPACE 1                                                                
BCNELD   DSECT                     ** BUDGET COLUMN NAME ELEMENT **             
*++IDENTIFIER                                                                   
BCNEL    DS    XL1                 ELEMENT CODE                                 
BCNELQ   EQU   X'1B'                                                            
BCNLN    DS    XL1                 ELEMENT LENGTH                               
BCNCOL1  DS    CL10                COLUMN NAME-1                                
BCNCOL2  DS    CL10                           -2                                
*++ASSOCIATED BCNLN                                                             
BCNLNOQ  EQU   *-BCNELD            OLD LENGTH                                   
BCNSTAT  DS    XL1                 BUDGET COLUMN STATUS                         
BCNSPROD EQU   X'04'               USE PRODUCTION CLIENT/PRODUCT                
BCNPREC  DS    XL1                 PRECISION                                    
         DS    XL5                 N/D                                          
*++ASSOCIATED BCNLN                                                             
BCNLNQ   EQU   *-BCNELD            NEW LENGTH                                   
         SPACE 1                                                                
BIVELD   DSECT                     ** BUDGET INPUT VALID'TN ELEMENTS **         
*++IDENTIFIER                                                                   
BIVEL    DS    XL1                 ELEMENT CODE                                 
BIVELQ   EQU   X'1C'                                                            
BIVLN    DS    XL1                 ELEMENT LENGTH                               
BIVAUNT  DS    CL1                 ACCOUNT UNIT CODE                            
BIVALDG  DS    CL1                 ACCOUNT LEDGER CODE                          
BIVACLV  DS    XL1                 ACCOUNT LEVEL                                
BIVVALS  DS    0XL3                LIST OF VALUES                               
BIVVCUNT DS    XL1                 CONTRA UNIT OR X'00' OR C'+'                 
BIVVCLDG DS    XL1                 CONTRA LEDGER OR X'00' OR DISP               
BIVVCACL DS    XL1                 CONTRA LEVEL OR X'00' OR LENGTH              
         SPACE 1                                                                
BAMELD   DSECT                     ** BUDGET AMOUNT ELEMENTS **                 
*++IDENTIFIER                                                                   
BAMEL    DS    XL1                 ELEMENT CODE                                 
BAMELQ   EQU   X'1D'                                                            
BAMLN    DS    XL1                 ELEMENT LENGTH                               
BAMMNTH  DS    PL2                 MONTH (PWOS YYMM)                            
BAMBUDG  DS    PL8                 BUDGET AMOUNT (PENNIES)                      
*++ASSOCIATED BAMLN                                                             
BAMLNQ   EQU   *-BAMELD                                                         
         SPACE 1                                                                
LITELD   DSECT                     ** LIST TYPE ELEMENTS **                     
*++IDENTIFIER                                                                   
LITEL    DS    XL1                 ELEMENT CODE                                 
LITELQ   EQU   X'1E'                                                            
LITLN    DS    XL1                 ELEMENT LENGTH                               
*++IDENTIFIER                                                                   
LITTYPE  DS    CL1                 LIST TYPE                                    
LITTLDG  EQU   C'L'                LEDGER LIST                                  
LITTACT  EQU   C'A'                ACCOUNT LIST                                 
LITTWRK  EQU   C'W'                WORK-CODE LIST                               
LITTMED  EQU   C'M'                BILLING SOURCE (MEDIA)                       
LITEDAT  DS    PL3                 EXPIRY DATE (PWOS)                           
LITUSE   DS    CL1                 VALUE SET BY MONACC:-                        
LITUINCL EQU   C'I'                INCLUDE ENTRIES IN LIST                      
LITUEXCL EQU   C'E'                EXCLUDE ENTRIES IN LIST                      
         DS    XL4                 N/D                                          
*++ASSOCIATED LITLN                                                             
LITLNQ   EQU   *-LITELD                                                         
         SPACE 1                                                                
LIDELD   DSECT                     ** LIST DATA ELEMENT **                      
*++IDENTIFIER                                                                   
LIDEL    DS    XL1                 ELEMENT CODE                                 
LIDELQ   EQU   X'1F'                                                            
LIDLN    DS    XL1                 ELEMENT LENGTH                               
LIDITLN  DS    XL1                 LENGTH OF EACH ITEM IN LIST                  
         DS    XL4                 N/D                                          
LIDDATA  DS    0C                                                               
LIDDLEDG DS    0CL2                UNIT/LEDGER CODES                            
LIDDWORK DS    0CL2                WORK-CODE CODES                              
*                                  ACCOUNT LIST DATA                            
LIDDAUNT DS    CL1                 UNIT CODE                                    
LIDDALDG DS    CL1                 LEDGER CODE                                  
LIDDALVL DS    CL1                 ACCOUNT LEVEL                                
LIDDACCS DS    0C                  ACCOUNT CODES                                
         SPACE 1                                                                
NAMELD   DSECT                     ** GENERAL NAME ELEMENT **                   
*++IDENTIFIER                                                                   
NAMEL    DS    XL1                 ELEMENT CODE                                 
NAMELQ   EQU   X'20'                                                            
NAMLN    DS    XL1                 ELEMENTH LENGTH                              
*++ASSOCIATED NAMLN                                                             
NAMLN1Q  EQU   *-NAMELD                                                         
NAMEREC  DS    0CL36               RECORD NAME                                  
         SPACE 1                                                                
NUMELD   DSECT                     ** NUMBER ELEMENT **                         
*++IDENTIFIER                                                                   
NUMEL    DS    XL1                 ELEMENT CODE                                 
NUMELQ   EQU   X'21'                                                            
NUMLN    DS    XL1                 ELEMENT LENGTH                               
NUMBEF   DS    CL6                 STARTING NUMBER (=END AFTER LOAD)            
NUMAFT   DS    CL6                 ENDING NUMBER                                
*++ASSOCIATED NUMLN                                                             
NUMLN1Q  EQU   *-NUMELD                                                         
NUMTYPE  DS    CL1                 OPTIONAL NUMBER TYPE                         
*++ASSOCIATED NUMLN                                                             
NUMLN2Q  EQU   *-NUMELD                                                         
         SPACE 1                                                                
ADRELD   DSECT                     ** ADDRESS ELEMENT **                        
*++IDENTIFIER                                                                   
ADREL    DS    XL1                 ELEMENT CODE                                 
ADRELQ   EQU   X'22'               REGULAR ADDRESS ELEMENT                      
OADELQ   EQU   X'8C'               OTHER ADDRESS ELEMENT                        
ADRLN    DS    XL1                 ELEMENT LENGTH                               
ADRNUM   DS    XL1                 NUMBER OF ADDRESS LINES                      
ADRADD1  DS    CL26                ADDRESS LINE 1                               
*++ASSOCIATED ADRLN                                                             
ADRLN1Q  EQU   *-ADRELD                                                         
ADRADD2  DS    CL26                ADDRESS LINE 2                               
*++ASSOCIATED ADRLN                                                             
ADRLN2Q  EQU   *-ADRELD                                                         
ADRADD3  DS    CL26                ADDRESS LINE 3                               
*++ASSOCIATED ADRLN                                                             
ADRLN3Q  EQU   *-ADRELD                                                         
ADRADD4  DS    CL26                ADDRESS LINE 4                               
*++ASSOCIATED ADRLN                                                             
ADRLN4Q  EQU   *-ADRELD                                                         
ADRADD5  DS    CL26                ADDRESS LINE 5                               
*++ASSOCIATED ADRLN                                                             
ADRLN5Q  EQU   *-ADRELD                                                         
         SPACE 1                                                                
OTHELD   DSECT                     ** OTHERS ELEMENT **                         
*++IDENTIFIER                                                                   
OTHEL    DS    XL1                 ELEMENT CODE                                 
OTHELQ   EQU   X'23'                                                            
OTHLN    DS    XL1                 ELEMENT LENGTH                               
OTHNUM   DS    CL9                 FREE FORM NUMBER                             
OTHPROF  DS    CL4                 FREE FORM PROFILE                            
         ORG   OTHPROF+2                                                        
OTHDATE  DS    PL2                 MEDIA MONTH OF SERVICE                       
*++ASSOCIATED OTHLN                                                             
OTHLN1Q  EQU   *-OTHELD                                                         
OTHNET   DS    CL4                 NETWORK (FROM BILLING XFER)                  
         DS    XL6                 N/D                                          
*++ASSOCIATED OTHLN                                                             
OTHLN2Q  EQU   *-OTHELD                                                         
         SPACE 1                                                                
PPRELD   DSECT                     ** PRODUCTION PROFILE ELEMENT **             
*++IDENTIFIER                                                                   
PPREL    DS    XL1                 ELEMENT CODE                                 
PPRELQ   EQU   X'24'                                                            
PPRLN    DS    XL1                 ELEMENT LENGTH                               
PPRGRUP  DS    CL3                 BILLING GROUP                                
PPRPROD  EQU   PPRGRUP             PRODUCTION CLI/PRD (US TALENT)               
PPRRECV  DS    0XL15               RECEIVABLE ACCOUNT                           
PPRRECVC DS    XL1                 COMPANY CODE                                 
PPRRECVU DS    CL1                 UNIT CODE                                    
PPRRECVL DS    CL1                 LEDGER CODE                                  
PPRRECVA DS    CL12                ACCOUNT CODE                                 
PPRCOST  DS    0XL15               COSTING ACCOUNT                              
PPRCOSTC DS    XL1                 COMPANY CODE                                 
PPRCOSTU DS    CL1                 UNIT CODE                                    
PPRCOSTL DS    CL1                 LEDGER CODE                                  
PPRCOSTA DS    CL12                ACCOUNT CODE                                 
PPRGAOFF DS    CL2                 OFFICE CODE (GENERAL ACCOUNTING)             
PPRBTYPE DS    CL1                 BILLING TYPE                                 
PPRBCLIT EQU   C'C'                CLIENT                                       
PPRBPROG EQU   C'P'                PROGRESSIVE                                  
PPRBTOTL EQU   C'T'                TOTAL                                        
PPRBESTS EQU   C'E'                ESTIMATE                                     
PPRBSPEC EQU   C'S'                SPECIAL                                      
PPRBUNBL EQU   C'U'                UNBILLABLE                                   
PPRB1LIN EQU   C'1'                ONE LINE                                     
PPRBLAMT DS    XL4                 %EST (2DP) OR SPECIAL AMOUNT                 
PPRUFORA DS    CL1                 UNIT FOR ANALYSIS                            
PPRUWRKN EQU   6                   NUMBER OF WORK CODES                         
PPRUWRK  DS    (PPRUWRKN)CL2       UNBILLABLE WORK CODES                        
PPRBILLP DS    CL50                ADDITIONAL BILLING PRINT                     
*++ASSOCIATED PPRLN                                                             
PPRLN1Q  EQU   *-PPRELD                                                         
PPRNARRP DS    0CL150              OTHER NARRATIVE                              
         SPACE 1                                                                
FFNELD   DSECT                     ** FREE FORM NUMBER ELEMENT **               
*++IDENTIFIER                                                                   
FFNEL    DS    XL1                 ELEMENT CODE                                 
FFNELQ   EQU   X'25'                                                            
FFNLN    DS    XL1                 ELEMENT LENGTH (L'ACNO+2)                    
*++ASSOCIATED FFNLN                                                             
FFNLN1Q  EQU   *-FFNELD                                                         
FFNUMBER DS    0CL10               FREE FORM NUMBER                             
FFNONUM  DS    CL6                 ORDER NUMBER                                 
FFNSTAT  DS    CL1                 ORDER STATUS                                 
FFNSPRTQ EQU   C'P'                PARTIAL ORDER                                
         DS    XL3                 N/D                                          
*++ASSOCIATED FFNLN                                                             
FFNLN2Q  EQU   *-FFNELD                                                         
         SPACE 1                                                                
JOBELD   DSECT                     ** PRODUCTION JOB ELEMENT **                 
*++IDENTIFIER                                                                   
JOBEL    DS    XL1                 ELEMENT CODE                                 
JOBELQ   EQU   X'26'                                                            
JOBLN    DS    XL1                 ELEMENT LENGTH                               
JOBCDATE DS    PL3                 ESTIMATED CLOSING DATE                       
JOBADATE DS    PL3                 DATE ADDED TO FILE                           
*++ASSOCIATED JOBLN                                                             
JOBLN1Q  EQU   *-JOBEL                                                          
JOBREVNO DS    XL2                 REVISION NUMBER                              
JOBODATE DS    PL3                 JOB OPENING DATE                             
JOBRDATE DS    PL3                 REVISION DATE                                
*++ASSOCIATED JOBLN                                                             
JOBLN2Q  EQU   *-JOBELD                                                         
JOBF2BLB DS    CL1                 JOB FILTER 2 BEFORE LAST BILL                
JOBBTBLB DS    CL1                 JOB BILL TYPE BEFORE LAST BILL               
JOBBIST  DS    XL1                 %EST BILLING STATUS                          
JOBB1BIL EQU   X'80'               1ST BILLING DONE                             
JOBB2BIL EQU   X'40'               2ND BILLING DONE                             
JOBB3BIL EQU   X'20'               3RD BILLING DONE                             
JOBSTA1  DS    XL1                 JOB STATUS                                   
JOBSUEST EQU   X'80'               JOB HAS UNAPPROVED ESTIMATE                  
JOBSNEST EQU   X'40'               JOB USES NEW ESTIMATING SYSTEM               
JOBSART  EQU   X'20'               JOB QUALIFIES FOR RATE ADJUSTMENT            
JOBSXJOB EQU   X'10'               JOB IS AN X-JOB                              
JOBSTV   EQU   X'08'               JOB IS TALENT MEDIA TV                       
JOBSRAD  EQU   X'04'               JOB IS TALENT MEDIA RADIO                    
JOBSTUD  EQU   X'02'               JOB IS A STUDIO JOB                          
JOBSTA2  DS    CL1                 JOB STATUS 2                                 
JOBSINC  EQU   X'80'               JOB IS INCOMPLETE                            
JOBSDFT  EQU   X'40'               JOB IS A DRAFT                               
         DS    XL2                 N/D                                          
*++ASSOCIATED JOBLN                                                             
JOBLN3Q  EQU   *-JOBELD                                                         
         SPACE 1                                                                
ABIELD   DSECT                     ** ACCOUNT BILLING INFO ELEMENT **           
*++IDENTIFIER                                                                   
ABIEL    DS    XL1                 ELEMENT CODE                                 
ABIELQ   EQU   X'27'                                                            
ABILN    DS    XL1                 ELEMENT LENGTH                               
ABIEANO  DS    CL14                EA NUMBER -(LJ) XXXXX-XX-X                   
ABIACNO  DS    CL14                ACCT NUMBER (LJ)                             
*                                  SCHEME 1 XXXX-XXXX-XXX                       
*                                  SCHEME 2 XXXX-XXX-XXXX                       
*                                  SCHEME 3 NNNN(9 BLANKS)                      
*++ASSOCIATED ABILN                                                             
ABILN1Q  EQU   *-ABIELD                                                         
ABIESNO  DS    CL12                ESTIMATE NO. FOR INTERFACE TPS (LJ)          
ABIBUNO  DS    CL15                BUD. NO. FOR INTERFACE TPS (RJ,PWZ)          
*++ASSOCIATED ABILN                                                             
ABILN2Q  EQU   *-ABIELD                                                         
ABIBINO  DS    CL15                BILLING NO., (A/N FREEFORM)                  
*++ASSOCIATED ABILN                                                             
ABILN3Q  EQU   *-ABIELD                                                         
ABIBMEM  DS    CL15                BUDGET MEMO FIGURE (A/N FREEFORM)            
*++ASSOCIATED ABILN                                                             
ABILN4Q  EQU   *-ABIELD                                                         
         SPACE 1                                                                
XBPELD   DSECT                     ** EXTRA BILLING PRINT ELEMENT **            
*++IDENTIFIER                                                                   
XBPEL    DS    XL1                 ELEMENT CODE                                 
XBPELQ   EQU   X'28'                                                            
XBPLN    DS    XL1                 ELEMENT LENGTH                               
XBPTYPE  DS    XL1                 COMMENT TYPE                                 
XBPTBILL EQU   X'80'               BILLING - REPLACES PPRBILLP                  
XBPTNARR EQU   X'40'               OTHER   - REPLACES PPRNARRP                  
*++ASSOCIATED XBPLN                                                             
XBPLN1Q  EQU   *-XBPELD                                                         
XBPRINT  DS    0CL150              NARRATIVE                                    
         SPACE 1                                                                
PMRELD   DSECT                     ** PLANMASTER EXRACT RULE ELEMENT **         
*++IDENTIFIER                                                                   
PMREL    DS    XL1                 ELEMENT CODE                                 
PMRELQ   EQU   X'29'                                                            
PMRLN    DS    XL1                 ELEMENT LENGTH                               
PMRLINE  DS    CL4                 PLANMASTER LINE NUMBER                       
*++IDENTIFIER                                                                   
PMRINDS  DS    XL1                 INDICATOR OF TYPE OF ELEMENT                 
PMRIDRQ  EQU   X'80'               DEBIT                                        
PMRICRQ  EQU   X'40'               CREDIT                                       
PMRIGRQ  EQU   X'20'               GROSS FIGURE FROM SCIELD                     
PMRICFQ  EQU   X'10'               CLIENT FILTER                                
PMRIDXQ  EQU   X'08'               ALL DEBITS                                   
PMRICXQ  EQU   X'04'               ALL CREDITS                                  
PMRIBLQ  EQU   X'02'               BALANCE                                      
         DS    XL2                 N/D                                          
PMRFILT  DS    CL6                 FILTER VALUES (EG CLIENT NAME)               
PMROFFS  DS    XL1                 OFFSET INTO BRANCH TABLE PROCESS             
*++ASSOCIATED PMRLN                                                             
PMRLNQ   EQU   *-PMRELD                                                         
         SPACE 1                                                                
FTNELD   DSECT                     ** FOREIGN TAX NUMBER ELEMENT **             
*++IDENTIFIER                                                                   
FTNEL    DS    XL1                 ELEMENT CODE                                 
FTNELQ   EQU   X'2A'                                                            
FTNLN    DS    XL1                 ELEMENT LENGTH                               
*++ASSOCIATED FTNLN                                                             
FTNLN1Q  EQU   *-FTNELD                                                         
FTNUM    DS    0CL10               FREE FORM NUMBER                             
         SPACE 1                                                                
*&&US                                                                           
RBRELD   DSECT                     ** RETAIL BILL RECVBL ELEMENT **             
*++IDENTIFIER                                                                   
RBREL    DS    XL1                 ELEMENT CODE                                 
RBRELQ   EQU   X'2B'                                                            
RBRLN    DS    XL1                 ELEMENT LENGTH                               
RBRRECB  DS    CL14                RECEIVABLE ACCOUNT                           
RBRCOST  DS    CL14                COSTING ACCOUNT                              
         DS    XL10                N/D                                          
*++ASSOCIATED RBRLN                                                             
RBRLNQ   EQU   *-RBRELD                                                         
*&&                                                                             
         SPACE 1                                                                
BACELD   DSECT                     ** BANK ACCOUNT ELEMENT **                   
*++IDENTIFIER                                                                   
BACEL    DS    XL1                 ELEMENT CODE                                 
BACELQ   EQU   X'2B'                                                            
BACLN    DS    XL1                 ELEMENT LENGTH VARIABLE                      
BACSTAT  DS    XL1                 STATUS BYTE                                  
BACSTCHQ EQU   X'80'               PAY BY CHEQUE                                
BACSTMCH EQU   X'70'               PAY BY MANUAL CHEQUE                         
BACSTPAY EQU   X'60'               PAY BY PAYMENT (AC5P)                        
BACSTBAC EQU   X'50'               PAY BY BACS                                  
BACSTTRF EQU   X'40'               PAY BY TRANSFER                              
BACSTCUR EQU   X'20'               PAY BY CHEQUE (PLUS LOCAL CURRENCY)          
BACSORT  DS    CL10                BANK SORTING CODE                            
BACCOUNT DS    CL12                ACCOUNT CODE WITHIN BANK                     
         ORG   BACSORT                                                          
BACSSRT  DS    CL4                 BANK SORTING CODE (SCANDINAVIA)              
         DS    CL6                 SPACES                                       
BACSACC  DS    CL10                A/C CODE WITHIN BANK (SCANDINAVIA)           
         DS    CL2                 SPACES                                       
*++ASSOCIATED BACLN                                                             
BACLNQ   EQU   *-BACELD            OLD ELEMENT LENGTH                           
BACBNAME DS    CL35                BANK NAME                                    
*++ASSOCIATED BACLN                                                             
BACLNQ2  EQU   *-BACELD            NEW ELEMENT LENGTH(FIXED PART)               
BACACNAM DS    0CL36               BANK ACCOUNT NAME                            
         SPACE 1                                                                
SPAELD   DSECT                     ** SPECIAL POSTING A/C ELEMENT **            
*++IDENTIFIER                                                                   
SPAEL    DS    XL1                 ELEMENT CODE                                 
SPAELQ   EQU   X'2C'                                                            
SPALN    DS    XL1                 ELEMENT LENGTH                               
*++IDENTIFIER                                                                   
SPATYPE  DS    XL1                 TYPE OF ACCOUNT                              
SPATINCO EQU   1                   INCOME ACCOUNT                               
SPATWOFF EQU   2                   WRITE-OFF ACCOUNT                            
SPATANAL EQU   3                   ANALYSIS ACCOUNT                             
SPATCSHD EQU   4                   CASH DISCOUNT ACCOUNT                        
SPATMEDC EQU   5                   MEDIA CONTROL ACCOUNT (SZ)                   
SPATFACC EQU   6                   FACTORING ACCOUNT (PAYABLES)                 
SPATABNK EQU   7                   ANALYSIS BANK ACCOUNT (SC)                   
SPATITAX EQU   8                   INPUT TAX ACCOUNT                            
SPATXFRF EQU   9                   TRANSFER FROM ACCOUNT                        
SPATXFRT EQU   10                  TRANSFER TO ACCOUNT                          
SPATSRCH EQU   11                  SURCHARGE ACCOUNT                            
SPATDISC EQU   12                  DISCOUNT ACCOUNT                             
SPATINCA EQU   13                  INCOME ACCRUAL ACCOUNT                       
SPATDEPT EQU   14                  DEPARTMENTAL ACCOUNT                         
SPATPERS EQU   15                  PERSONNEL ACCOUNT                            
SPATEXPN EQU   16                  EXPENSE ACCOUNT                              
SPATBCHA EQU   17                  BANK CHARGES ACCOUNT                         
SPATEXDF EQU   18                  EXCHANGE RATE DIFFERENCES ACCOUNT            
SPATOTAX EQU   19                  OUTPUT TAX ACCOUNT                           
SPATW1PA EQU   20                  WRITE-OFF 1P ACCOUNT                         
SPATW1CA EQU   21                  WRITE-OFF 1C ACCOUNT                         
SPATW13A EQU   22                  WRITE-OFF 13 ACCOUNT                         
SPATW29A EQU   23                  WRITE-OFF 29 ACCOUNT                         
SPATW2PA EQU   24                  WRITE-OFF 2P ACCOUNT                         
SPATW2DA EQU   25                  WRITE-OFF 2D ACCOUNT                         
SPATW28A EQU   26                  WRITE-OFF 28 ACCOUNT                         
SPATW29C EQU   27                  WRITE-OFF 29 CONTRA-ACCOUNT                  
SPATW2PC EQU   28                  WRITE-OFF 2P CONTRA-ACCOUNT                  
SPATBANK EQU   29                  BANK ACCOUNT                                 
SPATPART EQU   30                  RETAIL PARTICIPANT ACCOUNT                   
SPATW12A EQU   31                  WRITE-OFF 12 ACCOUNT                         
SPATCCST EQU   32                  CLIENT COSTING ACCOUNT                       
SPATW12K EQU   33                  WRITE-OFF 12 ACCOUNT (FOR SK)                
SPATTXCR EQU   34                  SALES TAX CREDIT ACCOUNT                     
SPATCOSG EQU   35                  1C COSTING A/C + GROUP IN SPACGRP            
SPATDEBT EQU   36                  DEBTOR ACCOUNT                               
         DS    XL3                 N/D                                          
SPACGRP  DS    XL1                 COSTING GROUP (IF SPATYPE=SPATCOSG)          
SPAAULA  DS    0XL14               UNIT/LEDGER/ACCOUNT                          
SPAAUNT  DS    CL1                 UNIT                                         
SPAALDG  DS    CL1                 LEDGER                                       
SPAAACT  DS    CL12                ACCOUNT CODE                                 
         ORG   SPAAULA                                                          
SPAAANAL DS    XL12                ANALYSIS ACCOUNT (11 OR 12 LEDGERS)          
         ORG                                                                    
*++ASSOCIATED SPALN                                                             
SPALNQ   EQU   *-SPAELD                                                         
         SPACE 1                                                                
ICPELD   DSECT                     ** INTERCOMPANY POSTING ELEMENT **           
*++IDENTIFIER                                                                   
ICPEL    DS    XL1                 ELEMENT CODE                                 
ICPELQ   EQU   X'2D'                                                            
ICPLN    DS    XL1                 ELEMENT LENGTH                               
ICPSUBEL DS    0X                                                               
ICPSLN   DS    XL1                 SUB-ELEMENT LENGTH                           
ICPSOFF  DS    CL2                 OFFICE                                       
ICPSACC  DS    0C                  ACCOUNT FOR INTERCOMPANY POSTING             
         SPACE 1                                                                
MBTELD   DSECT                     ** MEDIA BILLING TRANSFER ELEMENT **         
*++IDENTIFIER                                                                   
MBTEL    DS    XL1                 ELEMENT CODE                                 
MBTELQ   EQU   X'2E'                                                            
MBTLLN   DS    XL1                 ELEMENT LENGTH                               
*++IDENTIFIER                                                                   
MBTTYP   DS    XL1                 ELEMENT TYPE                                 
MBTTRCV  EQU   X'01'               RECEIVABLES                                  
MBTTINC  EQU   X'02'               INCOME                                       
MBTTNET  EQU   X'03'               NET                                          
MBTTCD   EQU   X'04'               CASH DISCOUNT                                
MBTTCOS  EQU   X'05'               COSTING                                      
MBTTBIL  EQU   X'06'               BILLING                                      
MBTTREV  EQU   X'07'               REVENUE                                      
MBTTGST  EQU   X'08'               OUTPUT GST                                   
MBTTARI  EQU   X'09'               AOR INCOME                                   
MBTTARR  EQU   X'0A'               AOR REVENUE                                  
MBTTSEL  EQU   X'0B'               SELLOFF INCOME                               
MBTTAPR  EQU   X'0C'               AOR PAY/RCVBL                                
MBTTRCS  EQU   X'0D'               CLT RCVBL SUSP                               
MBTTRCR  EQU   X'0E'               CLT RCVBL REBT                               
MBTTABL  EQU   X'0F'               AOR BILLING                                  
MBTTSBL  EQU   X'10'               SELLOFF BILLING                              
MBTTSRV  EQU   X'11'               SELLOFF REVENUE                              
MBTTGSTI EQU   X'12'               INPUT GST                                    
MBTTSPCD EQU   X'13'               SEPARATE CASH DISCOUNT                       
MBTTPQI  EQU   X'14'               PQ PST INPUT                                 
MBTTPQO  EQU   X'15'               PQ PST OUTPUT                                
MBTTINTI EQU   X'16'               INTERNAL INCOME                              
MBTTINTC EQU   X'17'               INTERNAL COSTING                             
MBTTINTB EQU   X'18'               INTERNAL BILLING                             
MBTTINTR EQU   X'19'               INTERNAL REVENUE                             
MBTTNBI  EQU   X'1A'               NB PST INPUT                                 
MBTTNBO  EQU   X'1B'               NB PST OUTPUT                                
MBTTNSI  EQU   X'1C'               NS PST INPUT                                 
MBTTNSO  EQU   X'1D'               NS PST OUTPUT                                
MBTTNFI  EQU   X'1E'               NF PST INPUT                                 
MBTTNFO  EQU   X'1F'               NF PST OUTPUT                                
MBTCHNG  DS    XL3                 LAST CHANGE DATE                             
MBTULA   DS    0CL14               UNIT/LEDGER/ACCOUNT                          
MBTUNIT  DS    CL1                 UNIT                                         
MBTLDGR  DS    CL1                 LEDGER                                       
MBTACCT  DS    CL12                ACCOUNT                                      
MBTSTAT  DS    XL1                 STATUS BYTE                                  
MBTSDR   EQU   X'80'               DEBIT POSTING                                
MBTSAOR  EQU   X'40'               TRUE AOR POSTING                             
MBTCNTRA DS    CL14                CONTRA ACCOUNT                               
MBTOFFC  DS    CL2                 OFFICE                                       
MBTPOST  DS    PL6                 POSTING AMOUNT                               
MBTMEMO  DS    PL6                 MEMO AMOUNT                                  
*++ASSOCIATED MBTLLN                                                            
MBTPDLNQ EQU   *-MBTELD            LENGTH OF POSTING DETAIL ELEMENT             
         ORG   MBTSTAT                                                          
MBTPERID DS    CL3                 LAST CHANGED BY (PERSON'S INITIALS)          
MBTAMTX  DS    CL8                 AMOUNT EXPRESSION                            
MBTMEMOX DS    CL8                 MEMO AMOUNT EXPRESSION                       
*++ASSOCIATED MBTLLN                                                            
MBTPRLNQ EQU   *-MBTELD            LENGTH OF ELEMENT                            
         SPACE 1                                                                
MTPELD   DSECT                     ** MEDIA TRANSFER PROFILE **                 
*++IDENTIFIER                                                                   
MTPEL    DS    XL1                 ELEMENT CODE                                 
MTPELQ   EQU   X'2F'                                                            
MTPLN    DS    XL1                 ELEMENT LENGTH (VARIABLE)                    
*++IDENTIFIER                                                                   
MTPFNUM  DS    XL1                 PROFILE NUMBER                               
MTPFDACC EQU   X'01'               DDS ACC FILE                                 
MTPFDPST EQU   X'02'               DDS MAKE POSTINGS                            
MTPFBILS EQU   X'03'               BILL SOURCE/MEDIA NAME                       
MTPFSJ   EQU   X'04'               CHECK FOR SJ PRODUCT                         
MTPFSJ1C EQU   X'05'               CHECK FOR SJ 1C ACCOUNT                      
MTPFDELM EQU   X'06'               SPECIAL NUMBER DELIMITER                     
MTPFMOSB EQU   X'07'               MOS BACK-UP DATE                             
MTPFMOSF EQU   X'08'               MOS FORWARD DATE                             
MTPFPST  EQU   X'09'               MAKE POSTINGS                                
MTPFCC   EQU   X'0A'               COST CENTER OVERRIDE                         
MTPFDMED EQU   X'0B'               DDS MEDIA FILE                               
MTPF3LDG EQU   X'0C'               RETAIL UNIT 3 LEDGER                         
MTPFCOV  EQU   X'0D'               RETAIL UNIT 3 LEVEL                          
MTPFRCV  EQU   X'0E'               RECEIVABLE OVERRIDE                          
MTPFCST  EQU   X'0F'               COST OVERRIDE                                
MTPFRCSJ EQU   X'10'               RECEIVABLE SJ                                
MTPFWKSJ EQU   X'11'               WORK CODE FOR SJ                             
MTPFJBCD EQU   X'12'               SEPARATE CASH DISCOUNT FOR SJ                
MTPFSUFX EQU   X'13'               SUSPENSE SUFFIX                              
MTPFRBFX EQU   X'14'               REBATE SUFFIX                                
MTPFCLRC EQU   X'15'               POST TO CLIENT RECEIVABLE                    
MTPFPGR  EQU   X'16'               PRODUCT GROUP SCHEMES                        
MTPFPOV  EQU   X'17'               RETAIL PRODUCT OVERRIDE                      
MTPFNMEM EQU   X'18'               DON'T POST CASH DISCOUNT AMOUNT              
MTPFMGOV EQU   X'19'               MARKET GROUP OVERRIDE (CORP SUMMARY)         
MTPFIPCT EQU   X'1A'               PERCENTAGE FOR INTERNAL (IOR)                
MTPFIPT2 EQU   X'1B'               AOR PERCENTAGE FOR INTERNAL (IOR)            
MTPFIOFC EQU   X'1C'               OFFCODE OVERRIDE FOR INTERNAL (IOR)          
MTPFCHDT DS    XL3                 LAST CHANGE DATE                             
MTPFCHID DS    CL3                 LAST CHANGED BY (INITIALS)                   
*++ASSOCIATED MTPLN                                                             
MTPLN1Q  EQU   *-MTPELD                                                         
MTPFDATA DS    0C                  VARIABLE LENGTH DATA                         
         SPACE 1                                                                
RSTELD   DSECT                     ** RECORD STATUS ELEMENT **                  
*++IDENTIFIER                                                                   
RSTEL    DS    XL1                 ELEMENT CODE                                 
RSTELQ   EQU   X'30'                                                            
RSTLN    DS    XL1                 ELEMENT LENGTH                               
RSTSECY  DS    XL2                 SECURITY NUMBER                              
RSTSUBC  DS    0CL1                SUB-COMPANY                                  
RSTFILT4 DS    CL1                 ACCOUNT FILTER 4                             
RSTCCTR  DS    XL3                 COST CENTER                                  
RSTSTAT3 DS    XL1                 STATUS BYTE TWO                              
RSTSCAIV EQU   X'80'               FOR TYPE 21 AND 22 CONTRA-ACC                
*                                  ON 29 POSTING IS VENDOR                      
RSTSPRCR EQU   X'40'               PEEL/CLOSE RECONCILED CREDITS (CASH)         
RSTSPRDR EQU   X'20'               PEEL/CLOSE RECONCILED DEBITS  (CASH)         
RSTSPRTS EQU   X'10'               PROJECT REQUIRED ON TIME SHEETS              
RSTSIDPT EQU   X'08'               INDIRECT DEPARTMENT                          
RSTSLAPL EQU   X'04'               LEDGER/ACCOUNT IS PROFIT/LOSS                
RSTSLABS EQU   X'02'               LEDGER/ACCOUNT IS BALANCE SHEET              
RSTSCCBJ EQU   X'01'               CLIENT COSTING BY JOB                        
RSTPBILL DS    XL2                 ON PRODN. LAST BILLED DATE FOR JOB           
         ORG   RSTPBILL                                                         
RSTCCTRR DS    XL1                 COSTING CENTER REPLACE POSITION              
         DS    XL1                 N/D                                          
RSTBDATE DS    PL3                 DATE BALANCE BROUGHT FORWARD                 
RSTTDATE DS    PL3                 DATE LAST TRANSACTION POSTED                 
RSTANAL  DS    0CL1                ANALYSIS CODE                                
RSTFILT3 DS    CL1                 ACCOUNT FILTER 3                             
RSTSTAT  DS    0XL1                                                             
RSTSTAT1 DS    XL1                 STATUS BYTE ONE                              
RSTSGPEI EQU   X'80'               GENERATE PERSONAL EXPENSE ITEM               
RSTSACIC EQU   X'40'               ACCOUNT IS CLOSED                            
RSTSACIL EQU   X'20'               ACCOUNT IS LOCKED OUT                        
RSTSEADD EQU   X'10'               EXPENSE A/C DEMANDS DEPARTMENT               
RSTSOFBR EQU   X'08'               OUTPUT FILE FOR BANK RECONCILIAITION         
RSTSPIAE EQU   X'04'               PERSON IS ACCOUNT EXEC (1R)                  
*&&US                                                                           
RSTSAIOH EQU   X'04'               ACCOUNT IS ON HOLD (TALENT)                  
RSTSVB2C EQU   X'02'               FOR VENDOR BT1 & B21 (+ OPTIONALLY           
*                                  BT3 & BT22) POST TO '2C'                     
*&&                                                                             
*&&UK                                                                           
RSTSPVAT EQU   X'04'               POST 2P/29 PLUS VAT                          
RSTSIVAT EQU   X'02'               VAT INPUT ACCOUNT IF ON, OUTPUT OFF          
*&&                                                                             
RSTSSFAM EQU   X'01'               SALARY FIGURE IS ACTUAL AMOUNT               
RSTFILT1 DS    CL1                 ACCOUNT FILTER 1                             
RSTFILT2 DS    CL1                 ACCOUNT FILTER 2                             
RSTCOSTG DS    CL1                 COSTING GROUP (OR SPACE)                     
*++ASSOCIATED RSTLN                                                             
RSTLN1Q  EQU   *-RSTELD                                                         
RSTSTAT2 DS    XL1                 ADDITIONAL STATUS                            
RSTSBILY EQU   X'80'               BILLABLE OPTION BILL=Y                       
RSTSBILN EQU   X'40'               BILLABLE OPTION BILL=N                       
RSTSPLOK EQU   X'20'               PAYEE LOCKED FROM ACDC (GERMAN D/DR)         
RSTSDUPN EQU   X'08'               DISABLE DUPLICATE CHECKING                   
RSTSYCST EQU   X'02'               COST POSTINGS FOR EXPENSE LEDGER             
RSTSNCST EQU   X'01'               NO COST POSTINGS FOR THIS LEVEL              
*&&UK                                                                           
RSTSPRNT EQU   X'10'               ACCOUNT IS MEDIA PRINT SUPPLIER              
RSTSBRDC EQU   X'08'               ACCOUNT IS MEDIA BROADCAST SUPPLIER          
RSTSMILE EQU   X'04'               ACCOUNT REQUIRES MILAGE INPUT                
*&&                                                                             
*&&US                                                                           
RSTSIVAT EQU   X'10'               VAT INPUT ACCOUNT IF ON, OUTPUT OFF          
*&&                                                                             
RSTFILT5 DS    CL1                 ACCOUNT FILTER 5                             
RSTSNUM  DS    XL2                 TIME SHEET NUMBER (0-9999) 1R ONLY           
RSTXCONV EQU   RSTSNUM             TEMP USE FOR GERMAN POSTCODE CONV.           
         ORG   RSTSNUM                                                          
RSTSYSME DS    XL2                 SYSTEM MEDIA CODE (SI LEDGER)                
RSTOFFC  DS    XL2                 GENERAL LEDGER OFFICE CODE                   
RSTSTAT4 DS    XL1                 STATUS BYTE 4                                
*&&UK                                                                           
RSTSCSTH EQU   X'80'               COSTING - HOUSE CLIENT                       
RSTSCSTN EQU   X'40'               COSTING - NEW BUSINESS CLIENT                
RSTSCSTC EQU   X'C0'               COSTING - REGULAR CLIENT                     
RSTSJREA EQU   X'20'               JOB REQUIRED FOR EXPENSE ANALYSIS            
RSTSMSDR EQU   X'10'               MERGE INVS. WITH SAME DATE/REF               
*&&                                                                             
RSTSOCOT EQU   X'0F'               OVERRIDE CLOSE OUT TYPES 1-15                
*++ASSOCIATED RSTLN                                                             
RSTLN2Q  EQU   *-RSTELD                                                         
*&&US                                                                           
RSTX1099 DS    XL1                 1099 PAYMENT TYPE                            
RSTXNCMP EQU   X'00'               - NON EMPLOYEE COMPENSATION                  
RSTXRENT EQU   X'01'               - RENT                                       
RSTXPRIZ EQU   X'02'               - PRIZES/AWARDS                              
RSTXMEDC EQU   X'04'               - MEDICAL/HEALTH CARE PAYMENTS               
RSTXROYL EQU   X'08'               - ROYALTIES                                  
*&&                                                                             
*&&UK*&& DS    XL1                 N/D                                          
RSTSTAT5 DS    XL1                 STATUS BYTE 5                                
RSTSPROD EQU   X'20'               FORCE PRODUCT IN TIMESHEETS (1R)             
RSTSPRJB EQU   X'10'               FORCE PROD/JOB ON TIMESHEETS (1R)            
RSTSNOTS EQU   X'02'               LOCKED FROM TEMPO TIMESHEETS                 
*&&UK                                                                           
RSTSSUND EQU   X'80'               SUNDRY CREDITOR                              
RSTSNOC3 EQU   X'40'               SUPPRESS TIME SHEET FOR THIS PERSON          
RSTSNBIZ EQU   X'08'               NEW BUSINESS                                 
RSTSBONO EQU   X'04'               PROBONO                                      
*&&                                                                             
*&&US                                                                           
RSTSNBIZ EQU   X'80'               NEW BUSINESS                                 
RSTSBONO EQU   X'40'               PROBONO                                      
RSTSHOUS EQU   X'08'               HOUSE CLIENTS                                
RSTSPROV EQU   X'01'               PROVISIONAL                                  
*&&                                                                             
RSTDFTSK DS    XL2                 DEFAULT TASK CODE FOR TMS                    
RSTMAIL  DS    XL1                 VENDOR MAIL DELIVERY OPTIONS                 
RSTMAIOV EQU   X'80'               OVERNIGHT                                    
         DS    XL6                 N/D                                          
*++ASSOCIATED RSTLN                                                             
RSTLN3Q  EQU   *-RSTELD                                                         
         SPACE 1                                                                
ASTELD   DSECT                     ** ACCOUNT STATUS ELEMENT **                 
*++IDENTIFIER                                                                   
ASTEL    DS    XL1                 ELEMENT CODE                                 
ASTELQ   EQU   X'31'                                                            
ASTLN    DS    XL1                 ELEMENT LENGTH                               
ASTDRAFT DS    XL3                 NUMBER OF DRAFT TRANSACTIONS FOR A/C         
ASTCUR   DS    CL3                 ACCOUNT CURRENCY CODE                        
ASTCANY  EQU   X'FF'               IF ASTCUR(1)=ASTCANY ANY CURRENCY            
*                                  IS VALID (UK CREDITORS ONLY)                 
ASTSTAT1 DS    XL1                 STATUS - 1                                   
ASTSLOCL EQU   X'80'               CURRENCY ACCOUNT HELD LOCALLY                
ASTPEDT  DS    XL2                 TIMESHEET PERIOD END DATE                    
         DS    XL2                 N/D                                          
ASTKSVTY DS    XL1                 KSV TYPE                                     
         DS    XL3                 N/D                                          
*++ASSOCIATED ASTLN                                                             
ASTLN1Q  EQU   *-ASTELD                                                         
         SPACE 1                                                                
ABLELD   DSECT                     ** ACCOUNT BALANCE ELEMENT **                
*++IDENTIFIER                                                                   
ABLEL    DS    XL1                 ELEMENT CODE                                 
ABLELQ   EQU   X'32'                                                            
ABLLN    DS    XL1                 ELEMENT LENGTH                               
ABLFRWD  DS    PL8                 BALANCE BROUGHT FORWARD                      
ABLDR    DS    PL8                 DEBITS  SINCE BALANCE FORWARD                
ABLCR    DS    PL8                 CREDITS SINCE BALANCE FORWARD                
*++ASSOCIATED ABLLN                                                             
ABLLN1Q  EQU   *-ABLELD                                                         
ABLURG   DS    PL6                 URGENT CREDITS                               
*++ASSOCIATED ABLLN                                                             
ABLLN2Q  EQU   *-ABLELD                                                         
         SPACE 1                                                                
APOELD   DSECT                     ** ACCOUNT PEEL-OFF ELEMENT **               
*++IDENTIFIER                                                                   
APOEL    DS    XL1                 ELEMENT CODE                                 
APOELQ   EQU   X'33'                                                            
APOLN    DS    XL1                 ELEMENT LENGTH                               
APOPLDT  DS    PL3                 DATE OF THIS PEEL-OFF                        
APOLBDT  DS    PL3                 DATE OF LAST BAL B/FRWD                      
APODR    DS    PL6                 DEBITS  B/F IN THIS PEEL                     
APOCR    DS    PL6                 CREDITS B/F IN THIS PEEL                     
*++ASSOCIATED APOLN                                                             
APOLN1Q  EQU   *-APOELD                                                         
APOLMOS  DS    PL2                 ACCOUNT LOWEST MOS POSTED                    
APOCMOS  DS    PL2                 ACCOUNT LAST CLOSED MOS                      
*++ASSOCIATED APOLN                                                             
APOLN2Q  EQU   *-APOELD                                                         
         SPACE 1                                                                
BUDELD   DSECT                     ** BUDGET ELEMENT **                         
*++IDENTIFIER                                                                   
BUDEL    DS    XL1                 ELEMENT CODE                                 
BUDELQ   EQU   X'34'                                                            
BUDLN    DS    XL1                 ELEMENT LENGTH                               
*++IDENTIFIER                                                                   
BUDTYPE  DS    CL1                 BUDGET OR ESTIMATE TYPE:-                    
BUDTDR   EQU   C'D'                                                             
BUDTCR   EQU   C'C'                                                             
BUDTORD  EQU   C'O'                                                             
BUDTCOM  EQU   C'E'                                                             
BUDSTRT  DS    PL2                 BUDGET START DATE (PWOS)                     
BUDEND   DS    PL2                 BUDGET END DATE   (PWOS)                     
BUDBUDG  DS    PL6                 BUDGET                                       
BUDSBAC  DS    CL15                OPTIONAL SUB-ACCOUNT OR SPACES               
*                                  FOR JOB ESTIMATE - WORK-CODE  NAME           
*++ASSOCIATED BUDLN                                                             
BUDLN1Q  EQU   *-BUDELD                                                         
BUDWORK  DS    CL2                 WORK-CODE                                    
BUDORIG  DS    PL6                 ORIGINAL ESTIMATE                            
*++ASSOCIATED BUDLN                                                             
BUDLN2Q  EQU   *-BUDELD                                                         
         SPACE 1                                                                
ESTELD   DSECT                     ** JOB ESTIMATE ELEMENT **                   
*++IDENTIFIER                                                                   
ESTEL    DS    XL1                 ELEMENT CODE                                 
ESTELQ   EQU   X'35'                                                            
ESTLN    DS    XL1                 ELEMENT LENGTH                               
ESTWORK  DS    CL2                 WORK-CODE                                    
ESTORIG  DS    PL6                 ORIGINAL ESTIMATE                            
ESTCURR  DS    PL6                 CURRENT ESTIMATE                             
*++ASSOCIATED ESTLN                                                             
ESTLN1Q  EQU   *-ESTELD                                                         
ESTPRV   DS    PL6                 PREVIOUS ESTIMATE                            
*++ASSOCIATED ESTLN                                                             
ESTLN2Q  EQU   *-ESTELD                                                         
         SPACE 1                                                                
RATELD   DSECT                     ** GENERAL RATE ELEMENT **                   
*++IDENTIFIER                                                                   
RATEL    DS    CL1                 ELEMENT CODE                                 
RATEVATQ EQU   X'36'               VAT ELEMENT                                  
RATETAXQ EQU   X'37'               FREELANCE TAX ELEMENT                        
RATEDSCQ EQU   X'38'               DISCOUNT ELEMENT                             
RATLN    DS    XL1                 ELEMENT LENGTH                               
RATRATE  DS    XL2                 RATE (2DP)                                   
*++ASSOCIATED RATLN                                                             
RATLNQ   EQU   *-RATELD                                                         
         SPACE 1                                                                
CEXELD   DSECT                     ** COKE EXPENDITURE ELEMENT **               
*++IDENTIFIER                                                                   
CEXEL    DS    XL1                 ELEMENT CODE                                 
CEXELQ   EQU   X'39'                                                            
CEXLN    DS    XL1                 ELEMENT LENGTH                               
CEXACC   DS    0XL15               AREA/REGION/DISTRICT                         
CEXACCC  DS    XL1                 COMPANY CODE                                 
CEXACCU  DS    CL1                 UNIT CODE                                    
CEXACCL  DS    CL1                 LEDGER CODE                                  
CEXACCA  DS    CL12                AREA/REGION/DISTRICT                         
CEXDTE   DS    PL3                 EFFECTIVE DATE                               
         DS    XL4                 N/D                                          
*++ASSOCIATED CEXLN                                                             
CEXLNQ   EQU   *-CEXELD                                                         
         SPACE 1                                                                
PBAELD   DSECT                     ** POOL BRAND ALLOCATION ELEMENT **          
*++IDENTIFIER                                                                   
PBAEL    DS    XL1                 ELEMENT CODE                                 
PBAELQ   EQU   X'3A'                                                            
PBALN    DS    XL1                 ELEMENT LENGTH                               
PBABRND  DS    CL6                 BRAND CODE                                   
PBAPCNT  DS    PL3                 PERCENTAGE ALLOCATION (2 DEC PLACES)         
PBARECV  DS    0XL15               RECEIVABLE ACCOUNT                           
PBARECVC DS    XL1                 COMPANY CODE                                 
PBARECVU DS    CL1                 UNIT CODE                                    
PBARECVL DS    CL1                 LEDGER CODE                                  
PBARECVA DS    CL12                ACCOUNT CODE                                 
PBACOST  DS    0XL15               COSTING ACCOUNT                              
PBACOSTC DS    XL1                 COMPANY CODE                                 
PBACOSTU DS    CL1                 UNIT CODE                                    
PBACOSTL DS    CL1                 LEDGER CODE                                  
PBACOSTA DS    CL12                ACCOUNT CODE                                 
*++ASSOCIATED PBALN                                                             
PBALNQ   EQU   *-PBAELD                                                         
         SPACE 1                                                                
WPBELD   DSECT                     ** CREATIVE BILLING ELEMENT **               
*++IDENTIFIER                                                                   
WPBEL    DS    XL1                 ELEMENT CODE                                 
WPBELQ   EQU   X'3B'                                                            
WPBLN    DS    XL1                 ELEMENT LENGTH                               
WPBWORK  DS    CL2                 WORK CODE                                    
WPBSOFA  DS    PL6                 BILLING SO FAR                               
WPBTODA  DS    PL6                 BILLING TODAY                                
WPBDATE  DS    PL3                 BILLING DATE                                 
WPBGRSS  DS    PL6                 GROSS BILLED SO FAR                          
WPBGRST  DS    PL6                 GROSS BILLED TODAY                           
         DS    XL2                 N/D                                          
*++ASSOCIATED WPBLN                                                             
WPBLNQ   EQU   *-WPBELD                                                         
         SPACE 1                                                                
XPRELD   DSECT                     ** PROD'N EXTRA PROFILE ELEMENT **           
*++IDENTIFIER                                                                   
XPREL    DS    XL1                 ELEMENT CODE                                 
XPRELQ   EQU   X'3C'                                                            
XPRLN    DS    XL1                 ELEMENT LENGTH                               
XPRDUE   DS    PL2                 NUMBER OF DAYS TO WORK OUT DUE DATE          
*                                  (DEFAULT = 10 DAYS)                          
XPROVER  DS    PL3                 PERCENT OF ESTIMATE WHICH, WHEN              
*                                  OVERSPENT, PROHIBITS BILLING.                
*                                  (2 DEC PLACES - DEFAULT = 100)               
XPRLOW   DS    PL4                 THE CASH LIMIT BELOW WHICH BILLS ARE         
*                                  NOT PRINTED (PENNIES - DEFAULT=$50)          
XPRSUM   DS    CL1                 OPTION TO PRINT SUMMARY                      
XPRSUMY  EQU   C'Y'                                                             
XPRSUMN  EQU   C'N'                                                             
XPRNET   DS    CL1                 PAY NET OPTION                               
XPRNETN  EQU   C'N'                                                             
XPRNETY  EQU   C'Y'                                                             
XPRNETS  EQU   C'S'                                                             
XPRDET   DS    CL1                 PRINT DETAIL ON PROGRESSIVE BILLS            
XPRDETY  EQU   C'Y'                                                             
XPRDETN  EQU   C'N'                                                             
XPREDET  DS    CL1                 SHOW WORK-CODE LINES ON EST BILLING          
XPREDETN EQU   C'N'                                                             
XPREDETY EQU   C'Y'                                                             
XPRCD    DS    CL1                 CASH DISCOUNT TO CLIENT                      
XPRCDY   EQU   C'Y'                                                             
XPRCDN   EQU   C'N'                                                             
*++ASSOCIATED XPRLN                                                             
XPRLN1Q  EQU   *-XPRELD                                                         
XPREST   DS    CL1                 ESTIMATE REQUIRED FOR BILLING                
XPRESTY  EQU   C'Y'                                                             
XPRESTN  EQU   C'N'                                                             
XPRSTAT1 DS    XL1                 STATUS BYTE ONE                              
XPRSNOAE EQU   X'80'               NO AUTOMATIC ESTIMATES                       
XPRSEBZC EQU   X'40'               ESTIMATE BILLS TAKE ZERO COMM.               
XPRSSBIT EQU   X'20'               SUPPRESS SPOT/PRINT BILLING XFER             
XPRSCPNP EQU   X'10'               CLI/PRO ARE NOT FOR PROD'N SYSTEM            
XPRSGCDC EQU   X'08'               POST GROSS+CD ON COSTING POSTINGS            
XPRSJHUA EQU   X'04'               JOB HAS UNAPPROVED ESTIMATE                  
XPRSNJUS EQU   X'02'               NEW JOBS FOR CLI ARE UNAPPROVED              
XPRSWC21 EQU   X'01'               PRINT WORK CODE ON AC21 (UK)                 
XPRSTAT2 DS    XL1                 STATUS BYTE TWO                              
XPRSAUBI EQU   X'80'               AUTO UNHOLD WHEN BILLING                     
XPRSBIAL EQU   X'40'               BILL IN ALT LANGUAGE (ENGLISH)               
XPRSCNLD EQU   X'20'               COMMISSION ON NET LESS CD                    
XPRSFTNB EQU   X'10'               FREELANCE TAX NOT BILLED TO CLIENT           
XPRSSB1R EQU   X'08'               SPLIT BILLING-ONLY 1 RECVBLE POSTING         
XPRREP   DS    CL1                 CODE FOR FILTER 2 WHEN AUTO                  
*                                  CHANGING %EST TO TOTAL BILL                  
XPRBILL  DS    CL1                 NEW BILL TYPE FOR %EST JOB                   
XPRINTC  DS    XL2                 COMMISSION RATE FOR INT. WORK (2DP)          
         DS    XL1                 N/D                                          
*++ASSOCIATED XPRLN                                                             
XPRLN2Q  EQU   *-XPRELD                                                         
         SPACE 1                                                                
SANELD   DSECT                     ** SALES ANALYSIS ELEMENT **                 
*++IDENTIFIER                                                                   
SANEL    DS    XL1                 ELEMENT CODE                                 
SANELQ   EQU   X'3D'                                                            
SANLN    DS    XL1                 ELEMENT LENGTH                               
SANCODE  DS    CL15                ANALYSIS ACCOUNT (COMBINING CONTRA-          
*                                  ACCOUNT FOR INCOME POSTING)                  
SANNAME  DS    CL36                NAME OF THIS ACCOUNT                         
*++ASSOCIATED SANLN                                                             
SANLNQ   EQU   *-SANELD                                                         
         SPACE 1                                                                
SCMELD   DSECT                     ** STANDARD COMMENT ELEMENTS **              
*++IDENTIFIER                                                                   
SCMEL    DS    XL1                 ELEMENT CODE                                 
SCMELQ   EQU   X'3E'                                                            
SCMLN    DS    XL1                 ELEMENT LENGTH                               
SCMSEQ   DS    XL1                 COMMENT SEQUENCE NUMBER                      
SCMTYPE  DS    XL1                 COMMENT TYPE BIT SETTINGS -                  
SCMTPRBI EQU   X'80'               PRINT ON BILLS                               
SCMTPRES EQU   X'40'               PRINT ON ESTIMATES                           
SCMTPRBD EQU   X'08'               PRINT BEFORE DATA                            
SCMTPRAD EQU   X'04'               PRINT AFTER DATA                             
SCMTPOFT EQU   X'02'               PROD ORDER FOOTLINE (NB X'06' MEANS          
*                                  NON-STANDARD, X'02' STD)                     
SCMTSTND EQU   X'00'               SIGNIFIES STANDARD COMMENT                   
*++ASSOCIATED SCMLN                                                             
SCMLN1Q  EQU   *-SCMELD                                                         
SCMNARR  DS    0CL255              COMMENT                                      
SCMCODE  DS    0CL6                OR COMMENT CODE                              
         ORG   SCMCODE+L'SCMCODE                                                
*++ASSOCIATED SCMLN                                                             
SCMLN2Q  EQU   *-SCMELD                                                         
         SPACE 1                                                                
OMEELD   DSECT                     ** ONLINE MEMO ELEMENT **                    
*++IDENTIFIER                                                                   
OMEEL    DS    XL1                 ELEMENT CODE                                 
OMEELQ   EQU   X'3F'                                                            
OMELN    DS    XL1                 ELEMENT LENGTH                               
OMELN1Q  EQU   *-OMEELD                                                         
OMEMO    DS    0CL250              COMMENT                                      
         SPACE 1                                                                
PRTELD   DSECT                     ** PERSONNEL RATE ELEMENT **                 
*++IDENTIFIER                                                                   
PRTEL    DS    XL1                 ELEMENT CODE                                 
PRTELQ   EQU   X'40'                                                            
PRTLN    DS    XL1                 ELEMENT LENGTH                               
PRTSTRT  DS    PL3                 HOURLY RATE EFFECTIVE START DATE             
PRTRATE  DS    PL4                 HOURLY RATE (2DP)                            
*&&UK                                                                           
PRTHOUR  DS    PL2                 HOURS/MONTH                                  
*&&                                                                             
*&&US                                                                           
PRTHOUR  DS    PL3                 HOURS                                        
PRTSTAT  DS    XL1                                                              
PRTSBILQ EQU   X'80'               BILLABLE TIME 'B'                            
PRTSNOTQ EQU   X'40'               NOT BILLABLE TIME 'N'                        
PRTSRTEQ EQU   X'20'               SPECIAL NON-BILLABLE TIME 'R'                
PRTSADJ  EQU   X'01'               RATE WAS ADJUSTED                            
PRTLINE# DS    XL2                 TMS LINE# (ON ORIGINAL TMS POSTING)          
*&&                                                                             
*++ASSOCIATED PRTLN                                                             
PRTLNQ   EQU   *-PRTELD                                                         
         SPACE 1                                                                
DEXELD   DSECT                     ** DUE DATE EXPRESSION ELEMENT **            
*++IDENTIFIER                                                                   
DEXEL    DS    XL1                 ELEMENT CODE                                 
DEXELQ   EQU   X'41'                                                            
DEXLN    DS    XL1                 ELEMENT LENGTH                               
DEXVAL   DS    XL4                 DUE DATE EXPRESSION (SEE ACCONVERT)          
*++ASSOCIATED DEXLN                                                             
DEXLNQ   EQU   *-DEXELD                                                         
         SPACE 1                                                                
PRUELD   DSECT                     ** PRODUCTION RULES ELEMENT **               
*++IDENTIFIER                                                                   
PRUEL    DS    XL1                 ELEMENT CODE                                 
PRUELQ   EQU   X'42'                                                            
PRULN    DS    XL1                 ELEMENT LENGTH                               
PRUMED   DS    XL1                 MEDIA CODE (X'00' = ALL)                     
PRUWORK  DS    XL2                 WORK CODE  (X'00' = ALL)                     
PRUCOMM  DS    PL4                 COMMISSION RATE (2 DEC PLACES)               
PRUTAX   DS    CL1                 TAX RATE CODE (Z=ZERO X=EXEMPT OR S)         
PRUTAXS  EQU   C'S'                STANDARD                                     
PRUTAXE  EQU   C'X'                EXEMPT                                       
PRUTAXZ  EQU   C'Z'                ZERO                                         
*                                  NOTE- IF ONLY ONE VALUE IS OVERRIDE,         
*                                  THE OTHER IS SET TO X'FF'                    
PRUSTAT  DS    XL1                 STATUS                                       
PRUSCOM4 EQU   X'80'               PRUCOMM IS 4DP NOT 2DP                       
*++ASSOCIATED PRULN                                                             
PRULNQ   EQU   *-PRUELD                                                         
         SPACE 1                                                                
CACELD   DSECT                     ** CONTRA-ACCOUNT HEADER ELEMENT **          
*++IDENTIFIER                                                                   
CACEL    DS    XL1                 ELEMENT CODE                                 
CACELQ   EQU   X'43'                                                            
CACLN    DS    XL1                 ELEMENT LENGTH                               
CACCNT   DS    0XL15               SUB ACCOUNT NUMBER                           
CACCNTC  DS    XL1                 COMPANY CODE OR SPACE                        
CACCNTU  DS    CL1                 UNIT CODE OR SPACE                           
CACCNTL  DS    CL1                 LEDGER CODE OR SPACE                         
CACCNTA  DS    CL12                CONTRA-ACCOUNT CODE                          
*++ASSOCIATED CACLN                                                             
CACLN1Q  EQU   *-CACELD                                                         
CACNAME  DS    0CL36               CONTRA-ACCOUNT NAME                          
         SPACE 1                                                                
TRNELD   DSECT                     ** TRANSACTION ELEMENT **                    
*++IDENTIFIER                                                                   
TRNEL    DS    XL1                 ELEMENT CODE                                 
TRNELQ   EQU   X'44'                                                            
TRNLN    DS    XL1                 ELEMENT LENGTH                               
TRNDATE  DS    PL3                 TRANSACTION DATE (PWOS YMD)                  
TRNREF   DS    CL6                 REFERENCE NUMBER                             
TRNSUB   DS    XL1                 SUB-REFERENCE                                
TRNTYPE  DS    XL1                 INPUT TYPE                                   
TRNTINV  EQU   1                   INVOICE                                      
TRNTTRAN EQU   2                   TRANSFER                                     
TRNTCHCK EQU   3                   CHECK                                        
TRNTCHEQ EQU   3                   CHEQUE                                       
TRNTPCSH EQU   4                   PETTY CASH                                   
TRNTMJRN EQU   5                   MULTIPLE JOURNAL                             
TRNTMABL EQU   6                   MANUAL BILLING                               
TRNTBILL EQU   6                   PRODUCTION BILL                              
TRNTCLBL EQU   7                   CLIENT BILL                                  
TRNTIINV EQU   8                   INTERNAL INVOICES                            
TRNTMEBL EQU   9                   MEDIA BILLING                                
TRNTMEPY EQU   10                  MEDIA PAYMENT                                
TRNTANTX EQU   11                  ANALYZED TRANSACTION                         
TRNTORD  EQU   12                  ORDER                                        
TRNTHCHK EQU   13                  HOLD CHECK                                   
TRNTBLTX EQU   14                  BILLING TRANSACTION                          
TRNTEXTX EQU   15                  EXPENSE TRANSACTION                          
TRNTCRCT EQU   16                  CASH RECEIPT                                 
TRNTTIMS EQU   17                  TIME SHEETS                                  
TRNTSPTX EQU   18                  SPECIAL TRANSACTION                          
TRNTOTHR EQU   19                  OTHERS                                       
TRNTSJRN EQU   20                  SPECIAL JOURNAL                              
TRNTNBIN EQU   21                  NON-BILL INVENTORY                           
TRNTNBCH EQU   22                  NON-BILL CASH                                
TRNTEXT2 EQU   23                  EXPENSE TRANSACTION 2                        
TRNTACTX EQU   24                  ACCRUAL TRANSACTION                          
TRNTREBL EQU   25                  RETAIL BILLING                               
TRNTMSBL EQU   26                  MEDIA/SPEC BILLING                           
TRNTTIM2 EQU   27                  TIME SHEETS 2                                
TRNTDODA EQU   28                  DODGE ASSESSMENTS                            
TRNTDODO EQU   29                  DODGE OTHER                                  
TRNTCALC EQU   30                  CASH ALLOCATION                              
TRNTSCHL EQU   31                  SCHLITZ BILLING                              
TRNTOTH2 EQU   32                  OTHERS 2                                     
TRNTBLTM EQU   33                  BILLABLE TIME                                
TRNTJBTX EQU   34                  JOB TRANSFER                                 
TRNTREB2 EQU   35                  RETAIL BILLING 2                             
TRNTADPY EQU   36                  ADVANCE PAYMENT                              
TRNTVOID EQU   37                  VOID                                         
TRNTDDSB EQU   38                  DDS BILLING                                  
TRNTACRL EQU   39                  ACCRUAL                                      
TRNTACRV EQU   40                  ACCRUAL REVERSAL                             
TRNTTIM3 EQU   41                  TIME SHEETS 3                                
TRNTMSB2 EQU   42                  MEDIA/SPEC BILL 2                            
TRNTAACR EQU   43                  ANLYSIS ACCRUAL                              
TRNTAARV EQU   44                  ANLYSIS ACCRUAL REV                          
TRNTMAJE EQU   45                  MULTIPLE ANALYSIS J/E                        
TRNTMUBL EQU   46                  MULTIPLE BILL/NON-BILL                       
TRNTEPRD EQU   47                  ESTIMATE PRODUCTION                          
TRNTEPRV EQU   48                  ESTIMATE PRODUCTION REVERSAL                 
TRNTCLTM EQU   49                  CLIENT TIME                                  
TRNTTALE EQU   50                  TALENT INTERFACE                             
TRNTIAGY EQU   51                  INTER-AGENCY                                 
TRNTTAXA EQU   52                  TAX ADJUSTMENTS                              
TRNTMAAC EQU   53                  MULTIPLE ANALYSIS ACCRUAL                    
TRNTMARV EQU   54                  MULTIPLE ANALYSIS ACCRUAL REVERSAL           
TRNTINAC EQU   55                  INCOME ACCRUAL                               
TRNTINRV EQU   56                  INCOME ACCRUAL REVERSAL                      
TRNTWRTO EQU   57                  WRITE-OFF                                    
TRNTIAG2 EQU   58                  INTER-AGENCY 2                               
TRNTIPOS EQU   63                  INTER-COMPANY POSTINGS                       
TRNTXDIF EQU   79                  EXCHANGE DIFFERENCES (BILLING)               
TRNTCCST EQU   97                  CA COST ALLOCATION (MOS LOCK)                
TRNTMEBT EQU   98                  MEDIA BILLING TRANSFER                       
TRNTWFM  EQU   99                  =WFM                                         
TRNSTAT  DS    XL1                 STATUS BITS                                  
TRNSDR   EQU   X'80'               ON=DEBIT, OFF=CREDIT                         
TRNSURG  EQU   X'40'               URGENT TRANSACTION                           
TRNSREV  EQU   X'20'               TRANSACTION IS A REVERSAL                    
*&&UK                                                                           
TRNS2NDC EQU   X'10'               TRANSACTION DENOMINATED IN 2ND CURR.         
*&&                                                                             
TRNSAUTH EQU   X'08'               INVOICE AUTHORISED BIT (UK)                  
TRNSCANT EQU   X'08'               CANADIAN CURRENCY PAYMENT (TALENT)           
TRNSHOLD EQU   X'04'               UK/GER HOLD CHEQ.(VEN),HOLD BILL(SJ)         
TRNSTALX EQU   X'04'               TALENT BILL/PAY EX SYSTEM                    
TRNSAPPR EQU   X'02'               SELECTED FOR PAYMENT(VENDOR)                 
TRNSBREC EQU   X'02'               BANK RECONCILED                              
TRNSMTCH EQU   X'02'               MATCHED ITEM (LDGCLOS=LDGCMBF)               
TRNSNOCM EQU   X'01'               1=NON-COMMISSIONABLE ITEM                    
TRNBTCH  DS    CL6                 BATCH REFERENCE                              
         ORG   TRNBTCH                                                          
TRNMOS   DS    CL2                 TRANSACTION MONTH-OF-SERVICE                 
TRNBREF  DS    CL4                 TRANSACTION BATCH REFERENCE                  
TRNAMNT  DS    PL6                 TRANSACTION AMOUNT                           
TRNANAL  DS    0CL2                ANALYSIS CODE OR SPACES                      
TRNOFFC  DS    CL2                 OFFICE CODE OR SPACES                        
*++ASSOCIATED TRNLN                                                             
TRNLN1Q  EQU   *-TRNELD                                                         
TRNNARR  DS    0CL200              0-200 BYTE NARRATIVE                         
         SPACE 1                                                                
TRNBLTYP DS    CL15                BILLING TYPE DESCRIPTION                     
TRNBLCOM DS    PL6                 COMMISSION BILLED                            
TRNBLEXP DS    0PL6                BILLED EXEMPT  (UK)                          
TRNBLCD  DS    PL6                 CASH DISCOUNT  (US)                          
TRNBLPAY DS    PL6                 PAYABLE AMOUNT (US)                          
TRNBLRT1 DS    PL6                 BILLED RATE 1                                
         ORG   TRNBLRT1                                                         
TRN2DAY  DS    XL2                 TODAY'S DATE                                 
TRNUNBIL DS    XL2                 UNBILLED DATE                                
TRNSK2SI DS    XL2                 DATE SK POSTED TO SI                         
TRNMDCST DS    0PL6                MEDIA COSTS INCLUDED IN BILL TOTAL           
TRNBLRT2 DS    PL6                 BILLED RATE 2                                
TRNAM2SK DS    0PL6                AMOUNT OF INCOME POSTED TO SK                
TRNBLRT3 DS    PL6                 BILLED RATE 3                                
TRNBLRT4 DS    PL6                 BILLED RATE 4                                
         ORG   TRNBLRT4                                                         
TRNQTFLT DS    CL2                 QTRNSFLT (WORKCODE) AA OR *AA                
TRNRTPCT DS    PL4                 RETAIL PERCENT                               
TRNBLRT5 DS    PL6                 BILLED RATE 5                                
         ORG   TRNBLRT5                                                         
TRNBTYPE DS    X                   BILL TYPE                                    
TRNBTALL EQU   1                   ALLOCATED                                    
TRNBTCLI EQU   2                   CLIENT                                       
TRNBTMAN EQU   3                   MANUAL                                       
TRNBTONE EQU   4                   ONE-LINE                                     
TRNBTPER EQU   5                   PERCENT OF ESTIMATE                          
TRNBTPRO EQU   6                   PROGRESSIVE                                  
TRNBTSPE EQU   7                   SPECIAL                                      
TRNBTTOT EQU   8                   TOTAL                                        
TRNBINTI DS    PL5                 INTERNAL INCOME                              
TRNBLVT1 DS    PL6                 VAT BILLED RATE 1                            
TRNBLVT2 DS    PL6                 VAT BILLED RATE 1                            
TRNBLVT3 DS    PL6                 VAT BILLED RATE 1                            
TRNBLVT4 DS    PL6                 VAT BILLED RATE 1                            
TRNBLVT5 DS    PL6                 VAT BILLED RATE 1                            
*++ASSOCIATED TRNLN                                                             
TRNLN2Q  EQU   *-TRNELD                                                         
*&&UK                                                                           
         ORG   TRNNARR                                                          
TRNDESC  DS    CL15                DESCRIPTION (50% ESTIMATE ETC.)              
*++ASSOCIATED TRNLN                                                             
TRNLNDQ  EQU   *-TRNELD            LENGTH OF SHORT ELEMENT                      
TRNLACCS EQU   6                                                                
TRNCOMM  DS    PL6                 COMMISSION BILLED                            
TRNGRSS  DS    0PL6                                                             
TRNGRSXR DS    PL6                 GROSS BILLED AT VAT RATE EXEMPT              
TRNGRSZR DS    PL6                 GROSS BILLED AT VAT RATE NIL                 
TRNGRSR1 DS    PL6                 GROSS BILLED AT VAT RATE RATE 1              
TRNGRSR2 DS    PL6                 GROSS BILLED AT VAT RATE RATE 2              
TRNGRSR3 DS    PL6                 GROSS BILLED AT VAT RATE RATE 3              
TRNGRSR4 DS    PL6                 GROSS BILLED AT VAT RATE RATE 4              
TRNGRSR5 DS    PL6                 GROSS BILLED AT VAT RATE RATE 5              
TRNGRSN  EQU   7                                                                
TRNVATS  DS    0PL6                                                             
TRNVATR1 DS    PL6                 V.A.T BILLED AT VAT RATE RATE 1              
TRNVATR2 DS    PL6                 V.A.T BILLED AT VAT RATE RATE 2              
TRNVATR3 DS    PL6                 V.A.T BILLED AT VAT RATE RATE 3              
TRNVATR4 DS    PL6                 V.A.T BILLED AT VAT RATE RATE 4              
TRNVATR5 DS    PL6                 V.A.T BILLED AT VAT RATE RATE 5              
TRNVATN  EQU   5                                                                
TRNLNBDQ EQU   *-TRNDESC           LENGTH OF BILLING DETAIL                     
*++ASSOCIATED TRNLN                                                             
TRNLNBQ  EQU   *-TRNELD            LENGTH OF BILLING ELEMENT                    
*&&                                                                             
         SPACE 1                                                                
BUKELD   DSECT                     ** BUCKET ELEMENT **                         
*++IDENTIFIER                                                                   
BUKEL    DS    XL1                 ELEMENT CODE                                 
BUKELQ   EQU   X'45'                                                            
BUKLN    DS    XL1                 ELEMENT LENGTH                               
BUKMOS   DS    0PL2                YEAR/MONTH OF SERVICE                        
BUKYEAR  DS    PL1                 PACKED YEAR                                  
BUKMNTH  DS    PL1                 PACKED MONTH                                 
BUKDR    DS    PL6                 DEBITS  IN MONTH                             
BUKCR    DS    PL6                 CREDITS IN MONTH                             
*++ASSOCIATED BUKLN                                                             
BUKLNQ   EQU   *-BUKELD                                                         
         SPACE 1                                                                
XPYELD   DSECT                     ** EXTRA PAYMENT ELEMENT **                  
*++IDENTIFIER                                                                   
XPYEL    DS    XL1                 ELEMENT CODE                                 
XPYELQ   EQU   X'46'                                                            
XPYLN    DS    XL1                 ELEMENT LENGTH                               
XPYCD    DS    PL6                 CASH DISCOUNT                                
XPYCLI   DS    CL20                CLIENT NAME                                  
XPYPRO   DS    CL20                PRODUCT NAME OR MODE                         
XPYINV   DS    CL14                INVOICE NUMBER                               
XPYPER   DS    CL17                PAY PERIOD                                   
XPYTYPE  DS    CL1                 CODE                                         
XPYEST   DS    XL2                 PRINT EST. NUMBER (OR ZERO)                  
XPYAGY   DS    CL2                 MEDIA SYSTEM AGENCY CODE                     
XPYSEQ   DS    XL1                 CLEARANCE SEQUENCE NUMBER                    
*++ASSOCIATED XPYLN                                                             
XPYLNQ   EQU   *-XPYELD                                                         
XPYMKT   DS    CL4                 SPOT MARKET NUMBER                           
XPYCAT   DS    CL2                 SPOT ESTIMATE CATEGORY                       
XPYDATE  DS    XL2                 INVOICE DATE (OR ZERO)                       
         DS    XL4                 SPARE                                        
*++ASSOCIATED XPYLN                                                             
XPYLN2Q  EQU   *-XPYELD                                                         
         SPACE 1                                                                
MXPELD   DSECT                     ** MEDLINE EXTRA PAYMENT ELEMENT **          
*++IDENTIFIER                                                                   
MXPEL    DS    XL1                 ELEMENT CODE                                 
MXPELQ   EQU   X'47'                                                            
MXPLN    DS    XL1                 ELEMENT LENGTH                               
MXPSER   DS    XL4                 SERIAL NUMBER (1 ALPHA/3 BINARY)             
MXPIDAT  DS    PL3                 INSERTION/TRANSMISSION DATE (YMD)            
MXPADAT  DS    PL3                 ACTIVITY DATE (YMD)                          
MXPCLICD DS    CL5                 CLIENT CODE                                  
MXPCLISH DS    CL12                SHORT CLIENT NAME                            
MXPPROSH DS    CL12                SHORT PRODUCT NAME                           
MXPREM   DS    CL15                SPACE/REMARKS                                
MXPPOS   DS    CL3                 POSITION CODE         * PRESS                
MXPCOL   DS    CL3                 COLOUR CODE           *                      
         ORG   MXPPOS                                                           
MXPSECS  DS    XL2                 SECOND LENGTH         * TV/RADIO             
MXPTIME  DS    XL4                 TIME (SPECIAL FORMAT) *                      
MXPGRSS  DS    PL6                 GROSS AMOUNT (+/-)                           
MXPNETP  DS    PL6                 NET PAID (+/-)                               
MXPVATP  DS    PL6                 VAT PAID (+/-)                               
MXPSLSH  DS    PL6                 SLUSH (+=UNDER, -=OVERPAYMENT)               
*++ASSOCIATED MXPLN                                                             
MXPLNQ   EQU   *-MXPELD            ELEMENT LENGTH                               
*&&UK                                                                           
*++ASSOCIATED MXPLN                                                             
MXPLN1Q  EQU   *-MXPELD                                                         
MXPINDS  DS    XL1                 INDICATOR BYTE:-                             
MXPISCUR EQU   X'80'               BOOKED IN SECONDARY CURRENCY                 
*++ASSOCIATED MXPLN                                                             
MXPLN2Q  EQU   *-MXPELD                                                         
*&&                                                                             
         SPACE 1                                                                
VBIELD   DSECT                     ** VAT BILLED ELEMENT **                     
*++IDENTIFIER                                                                   
VBIEL    DS    XL1                 ELEMENT CODE                                 
VBIELQ   EQU   X'48'                                                            
VBILN    DS    XL1                 ELEMENT LENGTH                               
VBITYPE  DS    CL1                 VAT RATE CODE (1ST CHAR. OF VATTYPE)         
VBIRATE  DS    XL2                 VAT RATE      (SEE VATRATE)                  
VBIVAT   DS    PL6                 VAT AMOUNT BILLED                            
VBIGROSS DS    PL6                 GROSS AMOUNT BILLED                          
VBICOMM  DS    PL6                 COMMISSION AMOUNT BILLED                     
VBIACCT  DS    CL15                VAT ACCOUNT                                  
VBIDATE  DS    PL3                 VAT EFFECTIVE DATE                           
         DS    XL4                 N/D                                          
*++ASSOCIATED VBILN                                                             
VBILNQ   EQU   *-VBIELD                                                         
         SPACE 1                                                                
RBIELD   DSECT                     ** REVERSE BILLING INFO ELEMENT **           
*++IDENTIFIER                                                                   
RBIEL    DS    XL1                 ELEMENT CODE                                 
RBIELQ   EQU   X'49'                                                            
RBILN    DS    XL1                 ELEMENT LENGTH                               
RBIDAT   DS    XL2                 ORIGINAL BILLING DATE (COMPRESSED)           
RBIUND   DS    XL2                 REVERSE BILLING DATE  (COMPRESSED)           
         DS    XL4                 N/D                                          
*++ASSOCIATED RBILN                                                             
RBILNQ   EQU   *-RBIELD                                                         
         SPACE 1                                                                
XBIELD   DSECT                     ** EXTRA BILLING INFO ELEMENT **             
*++IDENTIFIER                                                                   
XBIEL    DS    XL1                 ELEMENT CODE                                 
XBIELQ   EQU   X'4A'                                                            
XBILN    DS    XL1                 ELEMENT LENGTH                               
XBIMED   DS    CL15                MEDIA NAME                                   
XBIPRD   DS    CL6                 PRODUCT                                      
XBIEST   DS    CL3                 ESTIMATE NUMBER                              
XBIMOS   DS    CL6                 MONTH OF SERVICE (MMM/YY)                    
XBIINV   DS    CL10                INVOICE NUMBER                               
XBIDAT   DS    PL3                 INVOICE DATE (PACKED YMD)                    
XBITOT   DS    PL6                 BILL TOTAL                                   
XBISHR   DS    PL3                 SHARE OF BILL (2 DEC PL)                     
*++ASSOCIATED XBILN                                                             
XBILNQ   EQU   *-XBIEL                                                          
         SPACE 1                                                                
BNDELD   DSECT                     ** BILL NUMBER/DATE ELEMENT **               
*++IDENTIFIER                                                                   
BNDEL    DS    XL1                 ELEMENT CODE                                 
BNDELQ   EQU   X'4B'                                                            
BNDLN    DS    XL1                 ELEMENT LENGTH                               
BNDBNO   DS    CL6                 BILL NO (IF BILLED)                          
*                                  SPACES =  ALLOCATED (NOT BILLED)             
*                                  BINARY ZEROS = SPARE ELEMENT                 
BNDDTE   DS    XL2                 BILL DATE (2-BYTE COMPRESSED)                
BNDAMNT  DS    XL4                 ALLOCATED AMOUNT (BINARY PENNIES)            
*&&UK                                                                           
BNDCMR   DS    XL2                 COMMISSION RATE                              
         ORG   BNDAMNT                                                          
BNDAMTP  DS    PL6                 FOR TOBACCO INTERNAL USE ONLY                
*++ASSOCIATED BNDLN                                                             
BNDLNQ   EQU   *-BNDELD                                                         
*&&                                                                             
*&&US                                                                           
BNDCMP   DS    PL4                 COMMISSION RATE PACKED                       
BNDCMST  DS    XL1                 COMMISSION STATUS                            
BNDCPACK EQU   X'80'               COMMISSION IS PACKED                         
BNDCSD   DS    XL4                 ALLOCATED CASH DISCOUNT                      
BNDHRS   DS    XL4                 ALLOCATED HOURS                              
BNDWOT   DS    CL1                 WRITE-OFF TYPE                               
BNDFORM  DS    CL2                 FORMAT/GROUP                                 
BNDTYPE  DS    CL1                 WORKCODE TYPE                                
BNDVATC  DS    CL1                 TAX CODE                                     
BNDLNQ   EQU   *-BNDELD                                                         
BNDPSTC  DS    CL1                 PST CODE                                     
BNDPRVC  DS    CL2                 PROVINCE CODE                                
BNDMOA   DS    XL2                 MOA - IF SET                                 
BNDRUN   DS    XL2                 RUN DATE                                     
*++ASSOCIATED BNDLN                                                             
BNDLN2Q  EQU   *-BNDELD                                                         
*&&                                                                             
         SPACE 1                                                                
SPDELD   DSECT                     ** SUBSIDIARY POSTING ELEMENT **             
*++IDENTIFIER                                                                   
SPDEL    DS    XL1                 ELEMENT CODE                                 
SPDELQ   EQU   X'4C'                                                            
SPDLN    DS    XL1                 ELEMENT LENGTH                               
SPDLN1Q  EQU   *-SPDELD                                                         
SPDACCS  DS    0CL100              SUBSIDIARY ACCOUNTS POSTED TO                
*                                  AS A RESULT OF THIS TRANSACTION              
         SPACE 1                                                                
TAUELD   DSECT                     ** TRANSACTION AUTH ELEMENT **               
*++IDENTIFIER                                                                   
TAUEL    DS    XL1                 ELEMENT CODE                                 
TAUELQ   EQU   X'4D'                                                            
TAULN    DS    XL1                 ELEMENT LENGTH                               
TAUCODE  DS    CL15                AUTH CODE FOR JOB POSTING                    
*++ASSOCIATED TAULN                                                             
TAULNQ   EQU   *-TAUELD                                                         
         SPACE 1                                                                
PXDELD   DSECT                     ** POSTING XFER DETAIL ELEMENT **            
*++IDENTIFIER                                                                   
PXDEL    DS    XL1                 ELEMENT CODE                                 
PXDELQ   EQU   X'4E'                                                            
PXDLN    DS    XL1                 ELEMENT LENGTH                               
PXDTYPE  DS    CL1                 TRANSFER TYPE:-                              
PXDTFROM EQU   C'F'                TRANSFERRED FROM                             
PXDTTO   EQU   C'T'                TRANSFERRED TO                               
PXDDATE  DS    CL3                 TRANSFER DATE                                
PXDFRTO  DS    0XL15               FROM/TO ACCOUNT CODE                         
PXDFRTOC DS    XL1                 COMPANY CODE                                 
PXDFRTOU DS    CL1                 UNIT CODE                                    
PXDFRTOL DS    CL1                 LEDGER CODE                                  
PXDFRTOA DS    CL12                ACCOUNT CODE                                 
*++ASSOCIATED PXDLN                                                             
PXDLNQ   EQU   *-PXDELD                                                         
         SPACE 1                                                                
CPJELD   DSECT                     ** CLI/PRO/JOB ELEMENT **                    
*++IDENTIFIER                                                                   
CPJEL    DS    XL1                 ELEMENT CODE                                 
CPJELQ   EQU   X'4F'                                                            
CPJLN    DS    XL1                 ELEMENT LENGTH (VARIABLE)                    
*++IDENTIFIER                                                                   
CPJTYPE  DS    CL1                 TYPE (SEE EQUATES BELOW)                     
CPJDATA  DS    0X                  SOURCE DATA STARTS HERE                      
*                                                                               
*++ASSOCIATED CPJTYPE                                                           
CPJTJOB  EQU   C'J'                PRODUCTION JOB (SJ)                          
CPJCLI   DS    CL6                 CLIENT                                       
CPJPRO   DS    CL6                 PRODUCT                                      
CPJJOB   DS    CL6                 JOB                                          
CPJCPJLQ EQU   *-CPJCLI                                                         
CPJWRK   DS    CL2                 WORK CODE OF POSTING                         
         ORG   CPJPRO+3                                                         
CPJTCOM  EQU   C'C'                T&R COMMERCIAL                               
CPJTAR   EQU   C'T'                T&R ESTIMATE                                 
CPJCAT   DS    CL3                 CATEGORY                                     
CPJCOM   DS    CL6                 COMMERCIAL                                   
CPJCOMU  DS    CL1                 COMMERCIAL UNIT                              
CPJCOML  DS    CL1                 COMMERCIAL LEDGER                            
*++ASSOCIATED CPJLN                                                             
CPJLNQ   EQU   *-CPJELD                                                         
         ORG   CPJDATA                                                          
*++ASSOCIATED CPJTYPE                                                           
CPJTEXP  EQU   C'E'                EXPENSE ACCOUNT (SE)                         
CPJEXP   DS    CL12                EXPENSE ACCOUNT CODE                         
         DS    XL6                 N/D                                          
         ORG   CPJDATA                                                          
*++ASSOCIATED CPJTYPE                                                           
CPJTOTH  EQU   C'X'                OTHER SOURCE CODES                           
CPJOULA  DS    0CL14               OTHER SOURCE UNIT/LEDGER/ACCOUNT             
CPJOUNT  DS    CL1                 UNIT CODE                                    
CPJOLDG  DS    CL1                 LEDGER CODE                                  
CPJOACT  DS    CL12                ACCOUNT CODE                                 
         DS    XL4                 N/D                                          
*++ASSOCIATED CPJLN                                                             
CPJLN2Q  EQU   *-CPJELD                                                         
         SPACE 1                                                                
SCIELD   DSECT                     ** SUBSIDIARY CASH INFO ELEMENT **           
*++IDENTIFIER                                                                   
SCIEL    DS    XL1                 ELEMENT CODE                                 
SCIELQ   EQU   X'50'                                                            
SCILN    DS    XL1                 ELEMENT LENGTH                               
*++IDENTIFIER                                                                   
SCITYPE  DS    CL1                 CASH TYPE                                    
SCITNULL EQU   X'0'                SPECIAL TYPE (USES SCISUBTY)                 
*&&UK                                                                           
SCITAVTA EQU   C'A'-X'40'          AGENCY VAT TYPE (LITTLE A)                   
SCITAVTB EQU   C'B'-X'40'          AGENCY VAT TYPE (LITTLE B)                   
SCITAVTC EQU   C'C'-X'40'          AGENCY VAT TYPE (LITTLE C)                   
SCITAVTD EQU   C'D'-X'40'          AGENCY VAT TYPE (LITTLE D)                   
SCITAVTE EQU   C'E'-X'40'          AGENCY VAT TYPE (LITTLE E)                   
SCITAVTF EQU   C'F'-X'40'          AGENCY VAT TYPE (LITTLE F)                   
SCITAVTG EQU   C'G'-X'40'          AGENCY VAT TYPE (LITTLE G)                   
SCITAVTH EQU   C'H'-X'40'          AGENCY VAT TYPE (LITTLE H)                   
SCITAVTI EQU   C'I'-X'40'          AGENCY VAT TYPE (LITTLE I)                   
SCITAVTJ EQU   C'J'-X'40'          AGENCY VAT TYPE (LITTLE J)                   
SCITAVTK EQU   C'K'-X'40'          AGENCY VAT TYPE (LITTLE K)                   
SCITAVTL EQU   C'L'-X'40'          AGENCY VAT TYPE (LITTLE L)                   
SCITAVTM EQU   C'M'-X'40'          AGENCY VAT TYPE (LITTLE M)                   
SCITAVTN EQU   C'N'-X'40'          AGENCY VAT TYPE (LITTLE N)                   
SCITAVTO EQU   C'O'-X'40'          AGENCY VAT TYPE (LITTLE O)                   
SCITAVTP EQU   C'P'-X'40'          AGENCY VAT TYPE (LITTLE P)                   
SCITAVTQ EQU   C'Q'-X'40'          AGENCY VAT TYPE (LITTLE Q)                   
SCITAVTR EQU   C'R'-X'40'          AGENCY VAT TYPE (LITTLE R)                   
SCITAVTS EQU   C'S'-X'40'          AGENCY VAT TYPE (LITTLE S)                   
SCITAVTT EQU   C'T'-X'40'          AGENCY VAT TYPE (LITTLE T)                   
SCITAVTU EQU   C'U'-X'40'          AGENCY VAT TYPE (LITTLE U)                   
SCITAVTV EQU   C'V'-X'40'          AGENCY VAT TYPE (LITTLE V)                   
SCITAVTW EQU   C'W'-X'40'          AGENCY VAT TYPE (LITTLE W)                   
SCITAVTX EQU   C'X'-X'40'          AGENCY VAT TYPE (LITTLE X)                   
SCITAVTY EQU   C'Y'-X'40'          AGENCY VAT TYPE (LITTLE Y)                   
SCITAVTZ EQU   C'Z'-X'40'          AGENCY VAT TYPE (LITTLE Z)                   
SCITAVT0 EQU   C'0'-X'40'          AGENCY VAT TYPE (LITTLE 0)                   
SCITAVT1 EQU   C'1'-X'40'          AGENCY VAT TYPE (LITTLE 1)                   
SCITAVT2 EQU   C'2'-X'40'          AGENCY VAT TYPE (LITTLE 2)                   
SCITAVT3 EQU   C'3'-X'40'          AGENCY VAT TYPE (LITTLE 3)                   
SCITAVT4 EQU   C'4'-X'40'          AGENCY VAT TYPE (LITTLE 4)                   
SCITAVT5 EQU   C'5'-X'40'          AGENCY VAT TYPE (LITTLE 5)                   
SCITAVT6 EQU   C'6'-X'40'          AGENCY VAT TYPE (LITTLE 6)                   
SCITAVT7 EQU   C'7'-X'40'          AGENCY VAT TYPE (LITTLE 7)                   
SCITAVT8 EQU   C'8'-X'40'          AGENCY VAT TYPE (LITTLE 8)                   
SCITAVT9 EQU   C'9'-X'40'          AGENCY VAT TYPE (LITTLE 9)                   
*&&                                                                             
SCITDFLT EQU   C' '                DEFAULT BUCKET TYPE                          
SCITFEEA EQU   C'A'                FEE ADJUSTMENT                               
*&&US                                                                           
SCITBENE EQU   C'B'                BENEFIT (US)                                 
*&&                                                                             
SCITKSVB EQU   C'B'                BILLABLE KSV (GERMAN SQ LEDGER)              
SCITCOMM EQU   C'C'                COMMISSION/COMMISSION BILLED (99)            
SCITCRAT EQU   C'C'                COST RATE (UK 1C POSTINGS)                   
SCITCDSC EQU   C'D'                CASH DISCOUNT (SCICURA OPTIONAL)             
SCITDEPR EQU   C'D'                DEPRECIATION                                 
SCITGRNT EQU   C'E'                GROSS/NET FOR COKE EXP                       
SCITXAMT EQU   C'E'                TRANSFER AMOUNT FOR GERMAN BT46              
SCITMEXP EQU   C'E'                MEMO EXPENSES (UK)                           
SCITFEES EQU   C'F'                FEES                                         
SCITGRSS EQU   C'G'                GROSS BILLING                                
SCITHOUR EQU   C'H'                HOURS                                        
SCITINCA EQU   C'I'                INCOME                                       
SCITJHRS EQU   C'J'                HOURS(H) DEBIT/CREDIT                        
SCITFTAX EQU   C'K'                KUENSTLER(FREELANCE)TAX                      
SCITCLIM EQU   C'L'                RECEIVABLE CREDIT LIMIT                      
*&&UK                                                                           
SCITNICL EQU   C'L'                LOWER EARNINGS LIMIT NIC (ST LEDGER)         
*&&                                                                             
SCITGINV EQU   C'M'                GROSS ON FEE INV. SI LDG. (HOLLAND)          
SCITMILE EQU   C'M'                MILEAGE - SE AND 2P LEDGERS (U.K.)           
*&&UK                                                                           
SCITNICM EQU   C'M'                LEL TO THRESHOLD NIC (ST LEDGER)             
*&&                                                                             
SCITGLEV EQU   C'N'                GROSS-VAT (UK)                               
SCITFORD EQU   C'O'                FULLY MATCHED ORDER                          
SCITPORD EQU   C'P'                PART MATCHED ORDER                           
SCITIAMT EQU   C'P'                INSURABLE AMOUNT (UK ST LEDGER)              
SCITPHRS EQU   C'P'                PROFIT HOURS (UK 1P LEDGER)                  
SCITFAMT EQU   C'Q'                FEE AMOUNT (DUTCH BILLING)                   
SCITTQST EQU   C'Q'                QST (CANADIAN PROVINCE TAX)                  
SCITPRAT EQU   C'R'                COSTING RATE (ON SJ TIME POSTINGS)           
SCITSJXP EQU   C'S'                AMOUNT POSTED TO EXPENSES (SJ ONLY)          
SCITSRAT EQU   C'S'                SALES RATE (UK 1C POSTINGS)                  
SCITSJHR EQU   C'T'                HOURS (UK SJ TIME)                           
SCITCHQT EQU   C'T'                AC55 CHECK TOTAL                             
SCITTAXP EQU   C'T'                TAX (VAT/GST) PAID                           
SCITTTAX EQU   C'T'                TAX (NEW BILL RECORDS)                       
SCITKSVU EQU   C'U'                UNBILLABLE KSV (GERMAN SQ LEDGER)            
*&&UK                                                                           
SCITNICU EQU   C'U'                THRESHOLD TO UEL NIC (ST LEDGER)             
*&&                                                                             
SCITVEHI EQU   C'V'                VEHICLES                                     
SCITPREP EQU   C'V'                GERMAN PREPAYMENTS                           
SCITFVAT EQU   C'W'                VAT UK SF/GERMAN SX POSTINGS                 
SCITIVAT EQU   C'X'                VAT (UK SI)                                  
SCITNOCD EQU   C'X'                OR NO CASH DISCOUNT TO BE TAKEN              
SCITLOAT EQU   C'X'                GERMAN 1R LEDGER LEAVE OF ABSENCE            
SCITASBF EQU   C'Y'                ASBOF (UK SI)                                
SCITCTOT EQU   C'Y'                CHECK TOTAL IN OFFICE/CHECK                  
SCITRECN EQU   C'Z'                RECONCILIATION AMOUNT                        
SCITANAL EQU   C'0'                ANALYSIS                                     
SCITITAX EQU   C'1'                INVESTMENT TAX                               
SCITPART EQU   C'2'                PARTIAL AMOUNT                               
SCITINVT EQU   C'6'                INVOICE TOTAL                                
SCITMTAX EQU   C'7'                MEMO TAX                                     
SCITVERN EQU   C'8'                VERSCHILLENOTA NUMBER                        
SCITCOKE EQU   C'9'                CODE EXPENDITURE                             
SCITDBNO EQU   X'B0'               LAST DRAFT BILL# (SJ LEDGER RECORD)          
SCITCBAP EQU   X'B1'               CLIENT BILLING - ALLOCATION PENDING          
SCITCBWP EQU   X'B2'               CLIENT BILLING - WRITE-OFFS PENDING          
SCITCBTP EQU   X'B3'               CLIENT BILLING - TRANSFERS  PENDING          
SCITCBIP EQU   X'B4'               CLIENT BILLING - BT8 (US)   PENDING          
SCITICLM EQU   X'B5'               INTERNAL RECEIVABLES CREDIT LIMIT            
SCITCBRP EQU   X'B6'               CLIENT BILLING - RECOVERIES PENDING          
SCITSTAX EQU   X'B7'               SALES TAX                                    
SCITCBSG EQU   X'B8'               CLIENT BILLING - SURCH AMT BILL HDR          
SCITCBDC EQU   X'B9'               CLIENT BILLING - DISC AMT BILL HDR           
SCITT99S EQU   X'BA'               TODAY'S 99 POSTINGS                          
SCITTADV EQU   X'BB'               TOTAL ADVANCES - (BEDRECD HDR)               
SCITBCHA EQU   X'EA'               BANK CHARGE AMOUNT FOR BANK VOID             
*&&UK                                                                           
SCITSECY EQU   X'EF'               SECONDARY CURRENCY AMOUNT                    
*&&                                                                             
SCITUBPC EQU   X'FA'               ORD V INV TOLERANCE PERCENT BAT=21           
SCITUBAM EQU   X'FB'               ORD V INV TOLERANCE AMOUNT  BAT=21           
SCITBLPC EQU   X'FC'               ORD V INV TOLERANCE PERCENT BAT=1            
SCITBLAM EQU   X'FD'               ORD V INV TOLERANCE AMOUNT  BAT=1            
SCITDMAX EQU   X'FE'               MAX DR BALANCE FOR CLOSE PROG                
SCITCMAX EQU   X'FF'               MAX CR BALANCE FOR CLOSE PROG                
*                                  POSTINGS TO BANK ACCOUNTS                    
SCIGRS   DS    0PL6                FOR TYPE SCITGRNT GROSS IS DEBIT             
SCIGBIL  DS    0PL6                GROSS BILLED (99 POSTINGS)                   
SCIAMNT  DS    PL6                 AMOUNT                                       
*++ASSOCIATED SCILN                                                             
SCILN1Q  EQU   *-SCIELD                                                         
SCINET   DS    0PL6                FOR TYPE SCITGRNT NET IS CREDIT              
SCIVBIL  DS    0PL6                VAT BILLED (99 POSTINGS)                     
SCICURA  DS    0PL6                SCIAMNT IN CURRENCY (OPTIONAL)               
SCIBASE  DS    0PL6                BASIS FOR PST                                
SCIADMN  DS    PL6                 ADMIN. AMOUNT FOR TYPE SCITBENE              
*++ASSOCIATED SCILN                                                             
SCILN2Q  EQU   *-SCIELD                                                         
SCISUBTY DS    CL3                 BUCKET SUB-TYPE (SPACE FILLED)               
         ORG   SCISUBTY                                                         
SCISUBWC DS    CL2                 TAX WORKCODE                                 
         DS    XL1                 N/D                                          
         ORG   SCISUBTY                                                         
SCISUBPR DS    CL2                 PROVINCE                                     
SCISUBPT DS    CL1                 PROVINCE TAX RATE TYPE                       
*++ASSOCIATED SCILN                                                             
SCILN3Q  EQU   *-SCIELD                                                         
         SPACE 1                                                                
PCIELD   DSECT                     ** PROJECT CONTROL INFO ELEMENT **           
*++IDENTIFIER                                                                   
PCIEL    DS    XL1                 ELEMENT CODE                                 
PCIELQ   EQU   X'51'                                                            
PCILN    DS    XL1                 ELEMENT LENGTH                               
PCICLI   DS    CL15                CLI/PRD ACCOUNT INPUT ON TIME SHEET          
*++ASSOCIATED PCILN                                                             
PCILN1Q  EQU   *-PCIELD                                                         
PCIPRJT  DS    CL15                PROJECT ACCOUNT                              
PCITSK   DS    CL2                 TASK                                         
*++ASSOCIATED PCILN                                                             
PCILN2Q  EQU   *-PCIELD                                                         
         SPACE 1                                                                
MSAELD   DSECT                     ** MONTHLY SALARY ELEMENT **                 
*++IDENTIFIER                                                                   
MSAEL    DS    XL1                 ELEMENT CODE                                 
MSAELQ   EQU   X'52'                                                            
MSALN    DS    XL1                 ELEMENT LENGTH                               
MSALARY  DS    PL6                 MONTHLY SALARY                               
MSABEG   DS    PL2                 START DATE                                   
MSAEND   DS    PL2                 END DATE                                     
*++IDENTIFIER                                                                   
MSATYPE  DS    XL1                 SALARY TYPE                                  
MSATSLRY EQU   X'50'               SALARY                                       
MSATOVER EQU   X'40'               OVERTIME                                     
MSATTEMP EQU   X'30'               TEMPORARY                                    
MSATPENS EQU   X'15'               PENSION                                      
MSATBONU EQU   X'20'               BONUS                                        
MSATBENE EQU   X'10'               BENEFIT                                      
MSATADMN EQU   X'09'               ADMINISTRATION                               
MSATBUDG EQU   X'08'               BUDGETED ANNUAL                              
MSATRATE EQU   X'07'               HOURLY RATE                                  
MSASTAT  DS    XL1                 STATUS:-                                     
MSAS2DP  EQU   X'20'               2 DECIMAL PLACES                             
MSAS5DP  EQU   X'10'               5 DECIMAL PLACES                             
MSAS0DP  EQU   X'00'               DOLLARS                                      
MSABASIS DS    CL1                 BASIS M=MONTHLY                              
MSABMNTH EQU   C'M'                MONTHLY                                      
MSABQRTR EQU   C'Q'                QUARTERLY                                    
MSABYTD  EQU   C'Y'                YEAR TO DATE                                 
MSABANN  EQU   C'A'                ANNUAL SALARY                                
MSABHRL  EQU   C'H'                HOURLY RATE                                  
MSAINSUR DS    XL2                 INSURANCE (DOLLARS/POUNDS/DM)                
*++ASSOCIATED MSALN                                                             
MSALNQ   EQU   *-MSAELD                                                         
         SPACE 1                                                                
TCIELD   DSECT                     ** TIME CHARGE INFO ELEMENT **               
*++IDENTIFIER                                                                   
TCIEL    DS    XL1                 ELEMENT CODE                                 
TCIELQ   EQU   X'53'                                                            
TCILN    DS    XL1                 ELEMENT LENGTH                               
TCICM    DS    CL6                 CLIENT OR JOB MEDIA                          
*                                  BINARY ZEROES = ALL CLIENTS                  
TCIAMT   DS    PL4                 CHARGE RATE (2DP)                            
TCIDTE   DS    PL3                 EFFECTIVE DATE (PWOS)                        
         DS    XL4                 N/D                                          
*++ASSOCIATED TCILN                                                             
TCILNQ   EQU   *-TCIELD                                                         
         SPACE 1                                                                
OCNELD   DSECT                     ** OFFICE CHECK NUMBER ELEMENT **            
*++IDENTIFIER                                                                   
OCNEL    DS    XL1                 ELEMENT CODE                                 
OCNELQ   EQU   X'54'                                                            
OCNLN    DS    XL1                 ELEMENT LENGTH                               
OCNBEF   DS    CL6                 STARTING CHECK NO. (=END POST LOAD)          
OCNAFT   DS    CL6                 ENDING CHECK NUMBER                          
OCNOFFID DS    XL2                 OFFICE ORIGIN ID                             
OCNBANK  DS    0XL15               OFFICE/LEDGER BANK ACCOUNT                   
OCNBANKC DS    XL1                 COMPANY CODE                                 
OCNBANKU DS    CL1                 UNIT CODE                                    
OCNBANKL DS    CL1                 LEDGER CODE                                  
OCNBANKA DS    CL12                ACCOUNT CODE                                 
OCNNTYP  DS    CL1                 OPTIONAL NUMBER TYPE                         
OCNFILT  DS    CL3                 CLIENT OR (*) OFFICE FILTER                  
OCNSTAT  DS    XL1                 STATUS BYTE 1:-                              
OCNSPRTQ EQU   X'80'               PRINT CHECKS DIRECT                          
OCNSOFFR EQU   X'40'               OFFICE REQUIRED                              
OCNSPRTN EQU   X'20'               PRINT CHECK NUMBER ON CHECKS                 
OCNSDREG EQU   X'10'               DIRECT REGISTER                              
OCNSAUTH EQU   X'08'               AUTHORISATION REQUIRED                       
OCNSSHUT EQU   X'04'               PRINT CHECKS ON DDS-SHUTTLE                  
OCNSSOON EQU   X'02'               AUTHORISED FOR SOON                          
OCNSLOCL EQU   X'01'               AUTHORISED FOR LOCAL REGISTER                
OCNLAST  DS    CL6                 LAST CHECK IN STOCK AT DDS                   
OCNSTAT2 DS    XL1                 STATUS BYTE 2:-                              
OCNSMICR EQU   X'80'               MICRO PRINTER                                
OCNSFTP  EQU   X'40'               TO PRINT QUE                                 
OCNSLBLT EQU   X'20'               LASER (BOTTOM LINE TECHNOLOGY)               
OCNS820  EQU   X'10'               820 EDI STANDARD CHECK LAYOUT                
*++ASSOCIATED OCNLN                                                             
OCNLNQ   EQU   *-OCNELD                                                         
OCNDISC  DS    0CL14               DISCOUNT ACCOUNT                             
OCNDISCU DS    CL1                 UNIT CODE                                    
OCNDISCL DS    CL1                 LEDGER CODE                                  
OCNDISCA DS    CL12                ACCOUNT CODE                                 
*++ASSOCIATED OCNLN                                                             
OCNLN2Q  EQU   *-OCNELD                                                         
OCNSEQN  DS    XL2                 SEQUENCE NUMBER FOR SOON                     
OCNDPSR  DS    XL2                 DATE OF PENDING SOON REGISTER                
OCNDPLR  DS    XL2                 DATE OF PENDING LOCAL REGISTER               
OCNSORT  DS    XL1                 SORT SEQUENCE                                
OCNPOFF  DS    XL2                 OFFICE FOR CASH POSTING                      
OCNLASR  DS    XL1                 CHECK INDICATOR FOR LASER PRINTING           
OCNRED   EQU   1                   RED CHECKS                                   
OCNBLU   EQU   2                   BLUE CHECKS                                  
OCNGRN   EQU   3                   GREEN CHECKS                                 
OCNGLD   EQU   4                   GOLD CHECKS                                  
OCNBRN   EQU   5                   BROWN CHECKS                                 
OCNVIO   EQU   6                   VIOLET CHECKS                                
         DS    XL2                 N/D                                          
*++ASSOCIATED OCNLN                                                             
OCNLN3Q  EQU   *-OCNELD                                                         
         SPACE 1                                                                
PBKELD   DSECT                     ** PRIOR BUCKET ELEMENT **                   
*++IDENTIFIER                                                                   
PBKEL    DS    XL1                 ELEMENT CODE                                 
PBKELQ   EQU   X'55'                                                            
PBKLN    DS    XL1                 ELEMENT LENGTH                               
PBKLOW   DS    PL2                 MONTH OF FIRST BUCKET                        
PBKHI    DS    PL2                 MONTH OF LAST BUCKET                         
PBKDR    DS    PL8                 DEBITS                                       
PBKCR    DS    PL8                 CREDITS                                      
*++ASSOCIATED PBKLN                                                             
PBKLNQ   EQU   *-PBKELD                                                         
         SPACE 1                                                                
XNMELD   DSECT                     ** EXTRA NAMES ELEMENT **                    
*++IDENTIFIER                                                                   
XNMEL    DS    XL1                 ELEMENT CODE                                 
XNMELQ   EQU   X'56'                                                            
XNMLN    DS    XL1                 ELEMENT LENGTH                               
XNMSTAT  DS    XL1                 STATUS/LANGUAGE                              
*++ASSOCIATED XNMLN                                                             
XNMLN1Q  EQU   *-XNMELD                                                         
XNMSUB   DS    0X                  SUB-ELEMENT FOR SEVERAL NAMES                
XNMSUBL  DS    XL1                 SUB-ELEMENT LENGTH                           
XNMSUBN  DS    0C                  SUB-ELEMENT NAME                             
         SPACE 1                                                                
EMPELD   DSECT                     ** EMPLOYEE HISTORY ELEMENT **               
*++IDENTIFIER                                                                   
EMPEL    DS    XL1                 ELEMENT CODE                                 
EMPELQ   EQU   X'56'                                                            
EMPLN    DS    XL1                 ELEMENT LENGTH                               
EMPHIR   DS    PL3                 HIRE DATE PACKED YMD                         
EMPTRM   DS    PL3                 TERMINATION DATE PACKED YMD                  
EMPLOCK  DS    PL3                 LOCK TIMESHEET DATE                          
EMPSTAT  DS    XL1                 STATUS BYTE                                  
EMPSEXEC EQU   X'80'               EMPLOYEE IS AN EXECUTIVE                     
EMPSPROD EQU   X'40'               PROD REQUIRED                                
EMPSJOB  EQU   X'20'               JOB REQUIRED                                 
EMPSACT  EQU   X'10'               USE ACTUAL AS STANDARD HOURS                 
EMPSLOCK EQU   X'08'               ACCOUNT LOCKED (DIFF FROM TIMESHEET)         
EMPSPRTS EQU   X'04'               PROJECT REQ'D ON TIMESHEETS                  
EMPCSTAT DS    XL1                 CURRENT STATUS (DEFAULT ACTIVE)              
EMPCTRM  EQU   1                   TERMINATED                                   
EMPCLOA  EQU   2                   LEAVE OF ABSENCE                             
EMPCTRAN EQU   3                   TRANSFERRED                                  
EMPCOTH  EQU   4                   OTHER                                        
EMPSALKD DS    PL3                 SALARY LOCKED DATE                           
         DS    XL4                 N/D                                          
*++ASSOCIATED EMPLN                                                             
EMPLNQ   EQU   *-EMPELD                                                         
         SPACE 1                                                                
APTELD   DSECT                     ** ACCOUNT POINTER ELEMENT **                
*++IDENTIFIER                                                                   
APTEL    DS    XL1                 ELEMENT CODE                                 
APTELQ   EQU   X'57'                                                            
APTLN    DS    XL1                 ELEMENT LENGTH                               
APTSTAT  DS    XL1                 STATUS                                       
APTSBNKL EQU   X'80'               BANK ACCOUNT ON CLIENT OR LEDGER             
APTSTAXL EQU   X'40'               TAX ACCOUNT POINTER ON LEDGER                
APTSINTL EQU   X'20'               INTERCOMPANY ACCOUNT POINTER                 
APTSINCL EQU   X'10'               INCOME ACCOUNT POINTER                       
APTSWOFL EQU   X'08'               WRITE-OFF ACCOUNT POINTER                    
APTSDSCL EQU   X'04'               CASH DISCOUNT ACCOUNT POINTER                
APTSDTAL EQU   X'02'               DISCOUNT TAX ADJ. ACCOUNT POINTER            
APTINDS  DS    XL1                                                              
APTIGBCP EQU   X'80'               GENERATE GBCPASD (IF APTSBNKL SET)           
APTACC   DS    0XL15               ACCOUNT CODE                                 
APTACCC  DS    XL1                 COMPANY CODE                                 
APTACCU  DS    CL1                 UNIT CODE                                    
APTACCL  DS    CL1                 LEDGER CODE                                  
APTACCA  DS    CL12                ACCOUNT CODE                                 
*++ASSOCIATED APTLN                                                             
APTLNQ   EQU   *-APTELD                                                         
         SPACE 1                                                                
MFCELD   DSECT                     ** MEDLINE FOREIGN CURRENCY DATA **          
*++IDENTIFIER                                                                   
MFCEL    DS    XL1                 ELEMENT CODE                                 
MFCELQ   EQU   X'58'                                                            
MFCLN    DS    XL1                 ELEMENT LENGTH                               
MFCCURR  DS    CL5                 CURTAB ENTRY                                 
MFCRATE  DS    XL4                 RATE                                         
MFCX     DS    0CL7                EXCHANGE RATE RULE                           
MFCXST   DS    XL1                 STATUS - X'01' DIVIDE BY RATE                
MFCXRT   DS    PL5                 PWOS RATE (99999.99999)                      
MFCXSH   DS    XL1                 SHIFT VALUE FOR DEC PLACE DIFFERENCE         
MFCDATE  DS    CL3                 PWOS LATEST RE-VALUATION DATE                
*++ASSOCIATED MFCLN                                                             
MFCLNQ   EQU   *-MFCELD                                                         
         SPACE 1                                                                
TPRELD   DSECT                     ** PRICELIST TRANSACTION INFO **             
*++IDENTIFIER                                                                   
TPREL    DS    XL1                 ELEMENT CODE                                 
TPRELQ   EQU   X'59'                                                            
TPRLN    DS    XL1                 ELEMENT LENGTH                               
TPRCOD   DS    CL4                 PRICELIST CODE                               
TPRNUM   DS    CL4                 NUMBER OF ITEMS                              
         ORG   TPRNUM                                                           
TPRNUMP  DS    PL6                 NUMBER OF ITEMS TO 2DP                       
TPRLN2Q  EQU   *-TPRELD                                                         
*++ASSOCIATED TPRLN                                                             
TPRLNQ   EQU   *-TPRELD                                                         
         SPACE 1                                                                
GPNELD   DSECT                     ** GENERAL PURPOSE NAME ELEMENT **           
*++IDENTIFIER                                                                   
GPNEL    DS    XL1                 ELEMENT CODE                                 
GPNELQ   EQU   X'5A'                                                            
GPNLN    DS    XL1                 ELEMENT LENGTH                               
*++IDENTIFIER                                                                   
GPNTYP   DS    XL1                 TYPE                                         
GPNTLST  EQU   1                   LAST NAME                                    
GPNTFST  EQU   2                   FIRST NAME MI.                               
*++ASSOCIATED GPNLN                                                             
GPNLNQ   EQU   *-GPNELD                                                         
GPNNME   DS    0C                  NAME                                         
         SPACE 1                                                                
GXBELD   DSECT                     ** GERMAN EXTRA BILLING ELEMENT **           
*++IDENTIFIER                                                                   
GXBEL    DS    XL1                 ELEMENT CODE                                 
GXBELQ   EQU   X'5B'                                                            
GXBLN    DS    XL1                 ELEMENT LENGTH                               
GXBIINC  DS    PL6                 INTERNAL INCOME                              
GXBIGRS  DS    PL6                 INTERNAL GROSS                               
GXBEINC  DS    PL6                 EXTERNAL INCOME                              
GXBEGRS  DS    PL6                 EXTERNAL GROSS                               
*++ASSOCIATED GXBLN                                                             
GXBLNQ   EQU   *-GXBELD            LENGTH                                       
         SPACE 1                                                                
CUBELD   DSECT                     ** CLIENT BILLS UNBILL DATA **               
*++IDENTIFIER                                                                   
CUBEL    DS    XL1                 ELEMENT CODE                                 
CUBELQ   EQU   X'5C'                                                            
CUBLN    DS    XL1                 ELEMENT LENGTH                               
CUBNO    DS    CL6                 BILL NO                                      
CUBDTE   DS    XL2                 BILLED DATE                                  
CUBAMNT  DS    XL4                 BILLED AMOUNT                                
CUBCMR   DS    CL2                 COMMISSION RATE                              
*&&US                                                                           
         ORG   CUBCMR                                                           
CUBCMP   DS    PL4                 COMMISSION RATE PACKED                       
CUBCMST  DS    CL1                 COMMISSION STATUS                            
CUBCSD   DS    XL4                 CASH DISCOUNT BILLED                         
CUBHRS   DS    XL4                 HOURS BILLED                                 
CUBWOT   DS    CL1                 WRITE-OFF TYPE                               
CUBFORM  DS    CL2                 FORMAT/GROUP LEVEL                           
CUBTYPE  DS    CL1                 WORKCODE TYPE                                
CUBGST   DS    XL1                 GST CODE                                     
CUBUNNO  DS    CL6                 UNBILL BILL NO                               
CUBUNDTE DS    XL2                 UNBILLED DATE                                
*&&                                                                             
*++ASSOCIATED CUBLN                                                             
CUBLNQ   EQU   *-CUBEL                                                          
*&&US                                                                           
CUBPST   DS    CL1                 PST CODE                                     
CUBPRV   DS    CL2                 PROVINCE CODE                                
CUBMOA   DS    XL2                 MOA - IF SET                                 
CUBRUN   DS    XL2                 RUN DATE OF BILLING                          
*++ASSOCIATED CUBLN                                                             
CUBLN2Q  EQU   *-CUBEL                                                          
*&&                                                                             
         SPACE 1                                                                
BSAELD   DSECT                     ** BUDGETED SALARY ELEMENT **                
*++IDENTIFIER                                                                   
BSAEL    DS    XL1                 ELEMENT CODE                                 
BSAELQ   EQU   X'5D'                                                            
BSALN    DS    XL1                 ELEMENT LENGTH                               
BSASTRT  DS    PL3                 YEAR/MONTH/DAY                               
BSAENDT  DS    PL3                 YEAR/MONTH/DAY                               
BSABUDNO DS    XL2                 BINARY BUDGET NUMBER                         
BSAMNLY  DS    0PL4                MONTHLY CURRENT SALARY                       
BSAWKLY  DS    PL4                 WEEKLY CURRENT SALARY                        
BSAYRLY  DS    PL5                 YEARLY CURRENT SALARY                        
BSAMON1  DS    0XL1                MONTH OF INCREASE (PWOS)                     
BSAQTR1  DS    CL1                 QUARTER OF INCREASE (1, 2, 3, OR 4)          
BSAMON2  DS    0XL1                MONTH OF 2ND INCREASE                        
BSAQTR2  DS    CL1                 QUARTER OF 2ND INCREASE                      
BSAINC1  DS    PL3                 AMOUNT OF 1ST YRLY INCREASE                  
BSAINC2  DS    PL3                 AMOUNT OF 2ND YRLY INCREASE                  
BSABSAL  DS    PL5                 BUDGETED YEARLY SALARY                       
BSASTAT  DS    XL1                 STATUS BITS                                  
BSASMON  EQU   X'80'               ELEMENT IS MONTHLY (DEFAULT IS QTR)          
         DS    XL4                 N/D                                          
*++ASSOCIATED BSALN                                                             
BSALNQ   EQU   *-BSAELD                                                         
         SPACE 1                                                                
CALELD   DSECT                     ** CLIENT ALLOCATION ELEMENT **              
*++IDENTIFIER                                                                   
CALEL    DS    XL1                 ELEMENT CODE                                 
CALELQ   EQU   X'5E'                                                            
CALLN    DS    XL1                 ELEMENT LENGTH                               
CALPCST  DS    XL2                 COMPRESSED START DATE                        
CALPCND  DS    XL2                 COMPRESSED END DATE                          
CALBDNO  DS    XL2                 BUDGET NUMBER                                
*++ASSOCIATED CALLN                                                             
CALLN1Q  EQU   *-CALELD                                                         
CALMAXN  EQU   27                  MAXIMUM N'CALDATA ENTRIES                    
CALDATA  DS    0XL9                CLIENT/PRODUCT PERCENTAGES                   
CALCLPR  DS    CL6                 CLIENT-PRODUCT                               
CALPCNT  DS    PL3                 PERCENT-CARRIES 2 DEC PRECISION              
         SPACE 1                                                                
SUTELD   DSECT                     ** SALES/USE TAX ELEMENTS **                 
*++IDENTIFIER                                                                   
SUTEL    DS    XL1                 ELEMENT CODE                                 
SUTELQ   EQU   X'5F'                                                            
SUTLN    DS    XL1                 ELEMENT LENGTH                               
SUTEFF   DS    PL3                 EFFECTIVE DATE                               
SUTRTE   DS    PL4                 TAX RATE (4DP)                               
SUTBAS   DS    PL6                 TAX BASIS (TRANSACTIONS ONLY)                
         DS    XL3                 N/D                                          
*++ASSOCIATED SUTLN                                                             
SUTLN1Q  EQU   *-SUTELD                                                         
SUTACC   DS    0CL14               CREDIT ACCOUNT                               
SUTACCU  DS    CL1                 UNIT CODE                                    
SUTACCL  DS    CL1                 LEDGER CODE                                  
SUTACCA  DS    CL12                ACCOUNT CODE                                 
         ORG   SUTACC                                                           
SUTLOC   DS    CL14                LOCALITY KEY (ON TRANSACTIONS)               
*++ASSOCIATED SUTLN                                                             
SUTLN2Q  EQU   *-SUTELD                                                         
         SPACE 1                                                                
TRSELD   DSECT                     ** TRANSACTION STATUS ELEMENT **             
*++IDENTIFIER                                                                   
TRSEL    DS    XL1                 ELEMENT CODE                                 
TRSELQ   EQU   X'60'                                                            
TRSLN    DS    XL1                 ELEMENT LENGTH                               
TRSDATE  DS    XL2                 ACTIVITY DATE                                
TRSSTAT  DS    XL1                 STATUS BYTE                                  
TRSSGLUP EQU   X'80'               ON=UPDATED TO G/L, OFF IF REV.               
TRSSOAMC EQU   X'40'               ON=O+M CONVERSION TRANSACTION                
TRSSGLPR EQU   X'20'               ON=GENERAL LEDGER/OFF=PRODUCTION             
TRSSPEEL EQU   X'10'               ON=PEELED-OFF (CLOSED-OUT)                   
TRSSOFFS EQU   X'08'               OFFSET PAYABLES ITEM                         
TRSSACHQ EQU   X'04'               PAID BY OFFLINE CHECK (AC55 ETC.)            
TRSSREVS EQU   X'02'               REVERSAL TRANSACTION (MARK ORIGINAL)         
TRSSVOID EQU   X'01'               PAYABLE/CASH ITEM CHECK VOIDED               
TRSREVD  DS    XL2                 DATE ITEM MARKED AS REVERSAL                 
TRSVOID  EQU   TRSREVD             VOID ITEM SAVED USED DATE (TRSUDAT)          
TRSUPDT  DS    XL2                 DATE ITEM MARKED BY GLU                      
TRSPMOS  DS    PL2                 POSTING MOS (PWOS YM)                        
TRSUSER  DS    XL2                 USER ID NUMBER OF POSTING ORIGINATOR         
TRSUDAT  DS    XL2                 USED DATE (COMPRESSED)                       
TRSPDAT  DS    XL2                 PEEL DATE (COMPRESSED)                       
TRSUREQ  DS    PL2                 USED PROGRAM REQUEST NUMBER                  
TRSUMOS  DS    PL2                 USED/USER PROGRAM MOS (PWOS YM)              
TRSBSEQ  DS    XL2                 BATCH SEQUENCE NUMBER (OR ZERO)              
TRSRMOS  DS    PL2                 MOS VALUE OF REVERSING TRANSACTION           
TRSMARK  DS    XL1                 LAST MARKER ACTION                           
TRSMUMQ  EQU   X'80'               NEGATIVE ACTION USED (EG UNAUTH)             
TRSMWHQ  EQU   1                   WIP/HOLD                                     
TRSMWNQ  EQU   2                   WIP/NUMBER (GERMANY ONLY)                    
TRSMCAQ  EQU   3                   CREDITOR/AUTHORISE                           
TRSMCSQ  EQU   4                   CREDITOR/SELECT                              
TRSMCOQ  EQU   5                   CREDITOR/CONTRA                              
TRSMCDQ  EQU   6                   CREDITOR/DISCOUNT                            
TRSMCCQ  EQU   7                   CREDITOR/CHECK                               
TRSMCHQ  EQU   8                   CREDITOR/HOLD                                
TRSMBRQ  EQU   9                   BANK/RECONCILE                               
TRSMGRQ  EQU   10                  GENERAL/REVERSE                              
TRSMGOQ  EQU   11                  GENERAL/CONTRA                               
TRSMBVQ  EQU   12                  BANK/VOID                                    
TRSMCMQ  EQU   13                  CREDITOR/MANUAL                              
TRSMMRQ  EQU   14                  MEDIA/RECONCILE                              
TRSMCBQ  EQU   15                  CREDITOR/BALANCE                             
TRSMSCAQ EQU   20                  SUBSIDIARY MARKING BY CR AUTH IN SJ          
TRSMSBVQ EQU   21                  SUBSIDIARY MARKING BY BANK VOID              
TRSMWEXQ EQU   22                  WIP/EXCLUDE                                  
TRSSTAT2 DS    XL1                 STATUS BYTE 2                                
TRSSPMNT EQU   X'80'               PAID BY AC5P (TRSSACHQ IS ALSO ON)           
TRSSANBP EQU   X'40'               ANALYSED PAYMENT RUN                         
TRSSACRL EQU   X'20'               ACCRUAL (IN)                                 
TRSSACRV EQU   X'10'               ACCRUAL REVERSAL (OUT)                       
TRSSTADJ EQU   X'08'               TIMESHEET ADJUSTMENT (US COSTING)            
TRSSTMSS EQU   X'04'               TIMESHEET MISSING (US COSTING)               
TRSSMCHQ EQU   X'02'               PAID BY MARKER MANUAL CHEQUE                 
TRSSTIME EQU   X'01'               TIMESHEET REGULAR (US COSTING)               
TRSSTAT3 DS    XL1                 STATUS BYTE 3                                
TRSSXJOB EQU   X'80'               X-JOB POSTING (US)                           
TRSSVNOT EQU   X'40'               DUTCH V-NOTE PRINTED (LEDGER SZ)             
TRSSREJT EQU   X'40'               COKE ONLY-EXPENSE-REJECTED ITEMS             
TRSSNBIL EQU   X'20'               ITEM IS NOT BILLABLE ON AC21                 
TRSSPROG EQU   X'0F'               CREATING PROGRAM AND MASK                    
TRSSBAT  EQU   X'01'               BATCH                                        
TRSSCLO  EQU   X'02'               CLOSE                                        
TRSSREC  EQU   X'03'               DEBTORS                                      
TRSSWFM  EQU   X'04'               WFM                                          
TRSSMRK1 EQU   X'05'               MARKER (CREDITOR/MANUAL)                     
TRSSMRK2 EQU   X'06'               MARKER (BANK/VOID)                           
TRSSMRK3 EQU   X'07'               MARKER (MEDIA/RECONCILE)                     
TRSSMRK4 EQU   X'08'               MARKER (CREDITOR/BALANCE)                    
TRSBSTDT DS    XL2                 BANK STATEMENT DATE (CASH LEDGER)            
TRSEFDT  DS    XL2                 TRANSACTION EFFECTIVE (LIVE) DATE            
*++ASSOCIATED TRSLN                                                             
TRSLNQ   EQU   *-TRSELD                                                         
         SPACE 1                                                                
DUEELD   DSECT                     ** DUE DATE ELEMENT **                       
*++IDENTIFIER                                                                   
DUEEL    DS    XL1                 ELEMENT CODE                                 
DUEELQ   EQU   X'61'                                                            
DUELN    DS    XL1                 ELEMENT LENGTH                               
DUEDATE  DS    XL2                 DUE DATE FOR RECEIVABLES                     
DUEPMNT  EQU   DUEDATE             PAYMENT DATE FOR GERMAN PAYEES               
*++ASSOCIATED DUELN                                                             
DUELNQ   EQU   *-DUEELD                                                         
         SPACE 1                                                                
DSCELD   DSECT                     ** DISTRIBUTION SCHEME ELEMENT **            
*++IDENTIFIER                                                                   
DSCEL    DS    XL1                 ELEMENT CODE                                 
DSCELQ   EQU   X'62'                                                            
DSCLN    DS    XL1                 ELEMENT LENGTH                               
DSCCODE  DS    XL2                 SCHEME CODE                                  
DSCVAL   DS    PL6                 NUMBER OF UNITS (2 DEC PL)                   
*++ASSOCIATED DSCLN                                                             
DSCLNQ   EQU   *-DSCELD                                                         
         SPACE 1                                                                
HOMELD   DSECT                     ** HOMES ELEMENT **                          
*++IDENTIFIER                                                                   
HOMEL    DS    XL1                 ELEMENT TYPE                                 
HOMELQ   EQU   X'63'                                                            
HOMLN    DS    XL1                 ELEMENT LENGTH                               
HOMENO   DS    PL6                 NUMBER OF HOMES                              
*++ASSOCIATED HOMLN                                                             
HOMLNQ   EQU   *-HOMELD                                                         
         SPACE 1                                                                
MPYELD   DSECT                     ** MANUAL PAYMENT ELEMENT **                 
*++IDENTIFIER                                                                   
MPYEL    DS    XL1                 ELEMENT CODE                                 
MPYELQ   EQU   X'64'                                                            
MPYLN    DS    XL1                 ELEMENT LENGTH                               
MPYNO    DS    CL6                 NUMBER OF MANUAL CHECK                       
MPYDTE   DS    XL2                 DATE OF CHECK                                
MPYAMNT  DS    PL6                 AMOUNT OF CHECK                              
MPYBNK   DS    0CL14               UNIT/LEDGER/ACCOUNT OF BANK ACCOUNT          
MPYBNKU  DS    CL1                 UNIT CODE                                    
MPYBNKL  DS    CL1                 LEDGER CODE                                  
MPYBNKA  DS    CL12                BANK ACCOUNT                                 
*++ASSOCIATED MPYLN                                                             
MPYLNQ   EQU   *-MPYELD                                                         
MPYSUB   DS    XL1                 CHECK/INVOICE TRANSACTION SUB-REF            
*++ASSOCIATED MPYLN                                                             
MPYLN2Q  EQU   *-MPYELD                                                         
MPYPART  DS    PL6                 PORTION OF CHECK IF PART MATCHED             
*++ASSOCIATED MPYLN                                                             
MPYLN3Q  EQU   *-MPYELD                                                         
MPYPARC  DS    PL6                 PORTION OF CHECK IN CURRENCY                 
MPYCUR   DS    CL3                 CURRENCY OF CHECK PORTION                    
         DS    CL3                                                              
*++ASSOCIATED MPYLN                                                             
MPYLN4Q  EQU   *-MPYELD                                                         
         SPACE 1                                                                
ANOELD   DSECT                     ** ANALYZED OFFICE ELEMENT **                
*++IDENTIFIER                                                                   
ANOEL    DS    XL1                 ELEMENT CODE                                 
ANOELQ   EQU   X'65'                                                            
ANOLN    DS    XL1                 ELEMENT LENGTH                               
ANOTYPE  DS    CL1                 OFFICE TYPE                                  
ANOTCLI  EQU   C'C'                CLIENT OFFICE                                
ANOTPER  EQU   C'P'                PERSON OFFICE                                
ANOOFFC  DS    CL2                 OFFICE CODE                                  
*++ASSOCIATED ANOLN                                                             
ANOLNQ   EQU   *-ANOELD                                                         
         SPACE 1                                                                
ONCELD   DSECT                     ** ORDER NUMBER CONTROL ELEMENT **           
*++IDENTIFIER                                                                   
ONCEL    DS    XL1                 ELEMENT CODE                                 
ONCELQ   EQU   X'66'                                                            
ONCLN    DS    XL1                 ELEMENT LENGTH                               
ONCNUM   DS    CL6                 LAST ORDER NUMBER AUTO-GENERATED             
*++ASSOCIATED ONCLN                                                             
ONCLNQ   EQU   *-ONCELD                                                         
         SPACE 1                                                                
ORDELD   DSECT                     ** PRODUCTION ORDER ELEMENT **               
*++IDENTIFIER                                                                   
ORDEL    DS    XL1                 ELEMENT CODE                                 
ORDELQ   EQU   X'67'                                                            
ORDLN    DS    XL1                 ELEMENT LENGTH                               
ORDCONTR DS    0XL15               CONTRACTOR ACCOUNT CODE                      
ORDJOB   DS    0XL15               CLIENT/PRODUCT/JOB ACCOUNT CODE              
ORDEXP   DS    0XL15               EXPENSE ACCOUNT CODE                         
ORDACCC  DS    XL1                 COMPANY CODE                                 
ORDACCU  DS    CL1                 UNIT CODE                                    
ORDACCL  DS    CL1                 LEDGER CODE                                  
ORDACCA  DS    CL12                ACCOUNT CODE                                 
ORDSUP   DS    0XL15               SUPPLIER ACCOUNT CODE                        
ORDSUPC  DS    XL1                 COMPANY CODE                                 
ORDSUPU  DS    CL1                 UNIT CODE                                    
ORDSUPL  DS    CL1                 LEDGER CODE                                  
ORDSUPA  DS    CL12                ACCOUNT CODE                                 
ORDDATE  DS    PL3                 ORDER DATE                                   
ORDAUTH  DS    CL15                AUTHORISED BY                                
*++ASSOCIATED ORDLN                                                             
ORDLN1Q  EQU   *-ORDELD                                                         
ORDAMNO  DS    XL1                 LATEST AMENDMENT NUMBER                      
ORDAMDT  DS    PL3                 LATEST AMENDMENT DATE                        
*&&UK                                                                           
ORDREQD  DS    CL20                REQUIRED BY - FREE FORM                      
*++ASSOCIATED ORDLN                                                             
ORDLN2Q  EQU   *-ORDELD                                                         
ORDOJOB  DS    CL15                ORIGINAL JOB CODE                            
ORDSTAT  DS    XL1                 STATUS BYTE                                  
ORDSPRES EQU   X'80'               ORDER IS A PRESTO ORDER                      
ORDDXTN  EQU   X'40'               ORDER TRANSACTION DELETED SET BY PC          
ORDSPART EQU   X'20'               ORDER IS PARTIALLY PAID                      
ORDSMNUP EQU   X'10'               ORDER FULLY MATCHED (DRAFT/UPDATED)          
ORDDELDT DS    XL2                 DELETE DATE SET BY ACPC                      
         DS    XL1                 N/D                                          
*++ASSOCIATED ORDLN                                                             
ORDLN3Q  EQU   *-ORDELD                                                         
*&&                                                                             
*&&US                                                                           
ORDDDTE  DS    PL3                 DUE DATE                                     
ORDATTN  DS    CL20                ATTN NAME                                    
ORDTAX   DS    CL1                 TAX REPLY                                    
ORDSTAT  DS    XL1                 STATUS BYTE                                  
ORDSPRES EQU   X'80'               ORDER IS A PRESTO ORDER                      
ORDSPART EQU   X'20'               ORDER IS PARTIALLY PAID                      
         DS    XL1                 N/D                                          
*++ASSOCIATED ORDLN                                                             
ORDLN2Q  EQU   *-ORDELD                                                         
*&&                                                                             
         SPACE 1                                                                
OAMELD   DSECT                     ** ORDER AMOUNT ELEMENT **                   
*++IDENTIFIER                                                                   
OAMEL    DS    XL1                 ELEMENT CODE                                 
OAMELQ   EQU   X'68'                                                            
OAMLN    DS    XL1                 ELEMENT LENGTH                               
OAMSTAT  DS    XL1                 STATUS/SEQUENCE                              
OAMSNOCM EQU   X'80'               1=NON-COMMISSIONABLE                         
*&&US                                                                           
OAMSMAMI EQU   X'40'               0=MAJOR, 1=MINOR                             
*&&                                                                             
*&&UK                                                                           
*AMSMPRM EQU   X'20'               ORDER INVOICED IN PRIMARY CURR               
*AMSMSCD EQU   X'10'               ORDER INVOICED IN 2NDARY CURR                
*&&                                                                             
OAMWORK  DS    CL2                 WORK CODE                                    
OAMAMNT  DS    PL6                 ESTIMATED AMOUNT                             
OAMINUM  DS    PL6                 NUMBER OF INVOICES TO DATE                   
OAMIVAL  DS    PL6                 AMOUNT INVOICED TO DATE                      
         DS    XL1                 N/D                                          
*++ASSOCIATED OAMLN                                                             
OAMLN1Q  EQU   *-OAMELD                                                         
OAMTVAL  DS    PL6                 AMOUNT INVOICED TODAY                        
OAMLAST  DS    PL3                 LAST ACTIVITY DATE                           
OAMCONT  DS    0CL14               CONTRACT ACCOUNT CODE                        
OAMCONU  DS    CL1                 UNIT                                         
OAMCONL  DS    CL1                 LEDGER                                       
OAMCONA  DS    CL12                ACCOUNT                                      
OAMRATIO DS    PL4                 RATIO                                        
         DS    XL2                 N/D                                          
*++ASSOCIATED OAMLN                                                             
OAMLN2Q  EQU   *-OAMELD                                                         
         SPACE 1                                                                
FARELD   DSECT                     ** FEE ACCOUNTING RULE ELEMENT **            
*++IDENTIFIER                                                                   
FAREL    DS    XL1                 ELEMENT CODE                                 
FARELQ   EQU   X'69'                                                            
FARLN    DS    XL1                 ELEMENT LENGTH                               
FAREFF   DS    XL2                 EFFECTIVE DATE (OPTIONAL)                    
*++ASSOCIATED FARLN                                                             
FARLN1Q  EQU   *-FARELD                                                         
FARDET   DS    0C                  KEYWORD=DATA                                 
         SPACE 1                                                                
MDPELD   DSECT                     ** MEDIA TRANSFER (PACKED DATA)              
*++IDENTIFIER                                                                   
MDPEL    DS    XL1                 ELEMENT CODE                                 
MDPELQ   EQU   X'6A'               (SEE X'1A')                                  
MDPLN    DS    XL1                 ELEMENT LENGTH                               
MDPSYS   DS    CL1                 SYSTEM                                       
MDPSSPOT EQU   C'S'                SPOT                                         
MDPSPRNT EQU   C'P'                PRINT                                        
MDPSPROD EQU   C'J'                PRODUCTION                                   
MDPSINTA EQU   C'I'                INTERAGENCY                                  
MDPMED   DS    CL1                 MEDIA CODE                                   
MDPCLI   DS    CL3                 CLIENT CODE                                  
MDPPRD   DS    CL3                 PRODUCT CODE                                 
MDPJOB   DS    CL6                 JOB CODE                                     
         ORG   MDPJOB                                                           
MDPEST   DS    CL6                 ESTIMATE NUMBER                              
MDPSTAT  DS    XL1                 STATUS BITS                                  
MDPSMIQ  EQU   X'02'               MDTMED2 IS A MI RECORD CODE                  
MDPMED2  DS    CL2                 INTERAGENCY MEDIA CODE                       
MDPMOS   DS    PL2                 MONTH OF SERVICE (YYMM)                      
MDPDSCP  DS    CL36                ESTIMATE DESCRIPTION / JOB NAME              
MDPGRS   DS    PL6                 BILLING (GROSS)                              
MDPNET   DS    PL6                 PAYABLE (EXTERNAL)                           
MDPCOM   DS    PL6                 INCOME  (COMMISSION)                         
MDPCD    DS    PL6                 CASH DISCOUNT                                
MDPINTL  DS    PL6                 INCOME (INTERNAL)                            
MDPRECV  DS    PL6                 ACCOUNTS RECEIVABLE                          
MDPFDTE  DS    XL2                 FROM MONTH/YR OR CURR (COMPRESSED)           
MDPTDTE  DS    XL2                 TO MONTH/YR OR ZEROES (COMPRESSED)           
MDPVAT   DS    PL6                 VAT AMOUNT                                   
MDPDTE   DS    XL2                 TRANSFER DATE (COMPRESSED)                   
MDPBTYPE DS    CL2                 MEDIA BILL TYPE                              
MDPBAOR  EQU   C'AM'               AOR CLIENT (MAIN BILL)                       
MDPBAA   EQU   C'AA'               AOR TRUE                                     
MDPBAJ   EQU   C'AJ'               AOR ADJUSTMENT                               
MDPBAC   EQU   C'AC'               AOR CASH DISCOUNT                            
MDPBAUFC EQU   C'AU'               AOR UPFRONT COMMISSION                       
MDPBAUFN EQU   C'AN'               AOR UPFRONT NET BILL                         
MDPBCD   EQU   C'CM'               CASH DISCOUNT (MAIN BILL)                    
MDPBCDC  EQU   C'CC'               CASH DISCOUNT BILL                           
MDPBRET  EQU   C'R '               GENERAL RETAIL BILL                          
MDPBRC   EQU   C'RC'               RETAIL CORPORATE OUTLET                      
MDPBRP   EQU   C'RP'               RETAIL PARTICIPANT OUTLET                    
MDPBADJ  EQU   C'J '               COMMISSION ADJUSTMENT                        
MDPBCOM  EQU   C'O '               COMMISSION ONLY                              
MDPBFIN  EQU   C'FM'               FINANCIAL (MAIN BILL)                        
MDPBFR   EQU   C'FR'               FINANCIAL REBATE                             
MDPBREG  EQU   C'G '               REGULAR BILL                                 
MDPBRUFC EQU   C'GC'               REGULAR UPFRONT COMMISSION BILL              
MDPBRUFN EQU   C'GN'               REGULAR UPFRONT NET BILL                     
*++ASSOCIATED MDPLN                                                             
MDPLNQ   EQU   *-MDPEL                                                          
         SPACE 1                                                                
ADSELD   DSECT                     ** ASSET DESCRIPTION ELEMENT **              
*++IDENTIFIER                                                                   
ADSEL    DS    XL1                 ELEMENT CODE                                 
ADSELQ   EQU   X'6A'                                                            
ADSLN    DS    XL1                 ELEMENT LENGTH                               
ADSCP    DS    PL6                 COST PRICE (2DP)                             
ADSPD    DS    XL2                 PURCHASE DATE (COMPRESSED)                   
ADSLOC   DS    CL26                LOCATION (FREE FORM)                         
ADSREF   DS    CL12                REFERENCE (FREE FORM)                        
ADSSUP   DS    0CL14               SUPPLIER (ULACCT)                            
ADSSUPU  DS    CL1                 UNIT CODE                                    
ADSSUPL  DS    CL1                 LEDGER CODE                                  
ADSSUPA  DS    CL12                ACCOUNT CODE                                 
ADSBATV  DS    PL6                 BOOK 'AS AT' VALUE                           
ADSBDTE  DS    XL2                 BOOK 'AS AT' DATE                            
ADSTATV  DS    PL6                 TAX 'AS AT' VALUE                            
ADSTDTE  DS    XL2                 TAX 'AS AT' DATE                             
         DS    XL10                N/D                                          
*++ASSOCIATED ADSLN                                                             
ADSLNQ   EQU   *-ADSELD                                                         
         SPACE 1                                                                
ADIELD   DSECT                     ** ASSET DISPOSAL ELEMENT **                 
*++IDENTIFIER                                                                   
ADIEL    DS    XL1                 ELEMENT CODE                                 
ADIELQ   EQU   X'6B'                                                            
ADILN    DS    XL1                 ELEMENT LENGTH                               
ADIAMNT  DS    PL6                 DISPOSAL AMOUNT                              
ADIDATE  DS    XL2                 DISPOSAL DATE                                
         DS    XL6                 N/D                                          
*++ASSOCIATED ADILN                                                             
ADILNQ   EQU   *-ADIELD                                                         
         SPACE 1                                                                
RRNELD   DSECT                     ** RECORD REVISION# ELEMENT **               
*++IDENTIFIER                                                                   
RRNEL    DS    XL1                 ELEMENT CODE                                 
RRNELQ   EQU   X'6C'                                                            
RRNLN    DS    XL1                 ELEMENT LENGTH                               
RRNUM    DS    XL2                 RECORD REVISION NUMBER                       
*++ASSOCIATED RRNLN                                                             
RRNLN1Q  EQU   *-RRNELD                                                         
         SPACE 1                                                                
ADEELD   DSECT                     ** ASSET DEPRECIATION CONTROL **             
*++IDENTIFIER                                                                   
ADEEL    DS    XL1                 ELEMENT CODE                                 
ADEELQ   EQU   X'6D'                                                            
ADELN    DS    XL1                 ELEMENT LENGTH                               
*                                  BOOK VALUE CONTROL                           
ADEBTYP  DS    CL1                 PERIOD OF DEPRECIATION                       
ADEBYEAR EQU   C'A'                ANNUAL                                       
ADEBQART EQU   C'Q'                QUARTERLY                                    
ADEBMNTH EQU   C'M'                MONTHLY                                      
ADEBPCT  DS    PL4                 PERCENTAGE (4DP)                             
ADEBBAS  DS    CL1                 DEPRECIATION BASIS                           
ADEBCURR EQU   C'C'                CURRENT VALUE                                
ADEBPURC EQU   C'P'                PURCHASE PRICE                               
         DS    XL14                N/D                                          
*                                  TAX VALUE CONTROL                            
ADETTYP  DS    CL1                 PERIOD OF DEPRECIATION                       
ADETPCT  DS    PL4                 PERCENTAGE (4DP)                             
ADETBAS  DS    CL1                 DEPRECIATION BASIS                           
ADESTAT  DS    XL1                 STATUS                                       
ADESACAR EQU   X'80'               IS A MOTOR CAR                               
         DS    XL11                N/D                                          
*++ASSOCIATED ADELN                                                             
ADENLQ   EQU   *-ADEELD                                                         
         SPACE 1                                                                
RTEELD   DSECT                     ** INTEREST RATE ELEMENT **                  
*++IDENTIFIER                                                                   
RTEEL    DS    XL1                 ELEMENT CODE                                 
RTEELQ   EQU   X'6E'                                                            
RTELN    DS    XL1                 ELEMENT LENGTH                               
RTEDATE  DS    XL2                 AS OF DATE                                   
RTERATE  DS    XL3                 INTEREST RATE                                
*                                  EQUATES FOR HOB OF RTERATE                   
RTERCPYQ EQU   X'80'               COMPANY RATE ADJUSTMENT                      
RTERNEGQ EQU   X'40'               NEGATIVE ADJUSTMENT (OFF = +VE)              
*++ASSOCIATED RTELN                                                             
RTELNQ   EQU   *-RTEELD                                                         
         SPACE 1                                                                
MXCELD   DSECT                     ** MEDIA EXTRA CHARGE ELEMENT **             
*++IDENTIFIER                                                                   
MXCEL    DS    XL1                 ELEMENT CODE                                 
MXCELQ   EQU   X'6F'                                                            
MXCLN    DS    XL1                 ELEMENT LENGTH                               
MXCDICTR DS    AL2                 UK MEDIA DICTIONARY REFERENCE NUMBER         
MXCHARGE DS    PL6                 EXTRA CHARGE                                 
         DS    XL4                 N/D                                          
*++ASSOCIATED MXCLN                                                             
MXCLNQ   EQU   *-MXCELD                                                         
         SPACE 1                                                                
SNMELD   DSECT                     ** SHORT NAME ELEMENT **                     
*++IDENTIFIER                                                                   
SNMEL    DS    XL1                 ELEMENT CODE                                 
SNMELQ   EQU   X'70'                                                            
SNMLN    DS    XL1                 ELEMENT LENGTH                               
SNMNAME  DS    CL12                SHORT NAME                                   
*++ASSOCIATED SNMLN                                                             
SNMLNQ   EQU   *-SNMELD                                                         
         SPACE 1                                                                
TXBELD   DSECT                     ** TALENT EXTRA BILLING INFO **              
*++IDENTIFIER                                                                   
TXBEL    DS    XL1                 ELEMENT CODE                                 
TXBELQ   EQU   X'71'                                                            
TXBLN    DS    XL1                 ELEMENT LENGTH                               
         DS    XL1                 N/D                                          
TXBATTN  DS    CL33                ATTENTION NAME                               
         DS    XL20                N/D                                          
*++ASSOCIATED TXBLN                                                             
TXBLNQQ  EQU   *-TXBELD                                                         
         SPACE 1                                                                
MRHELD   DSECT                     ** MEDIA RECONCILIATION HOLLAND **           
*++IDENTIFIER                                                                   
MRHEL    DS    XL1                 ELEMENT CODE                                 
MRHELQ   EQU   X'72'                                                            
MRHLN    DS    XL1                 ELEMENT LENGTH                               
MRHSUP   DS    CL6                 SUPPLIER NUMBER                              
MRHDAT   DS    XL2                 INSERTION/TRANSMISSION DATE                  
         DS    XL1                 N/D                                          
MRHSER   DS    0XL4                BUY SERIAL NUMBER                            
MRHSERA  DS    CL1                 MEDIA LETTER                                 
MRHSERN  DS    XL3                 SERIAL NUMBER                                
MRHUNPR  DS    PL6                 UNIT PRICE                                   
MRHGRSS  DS    PL6                 GROSS COST                                   
MRHDETS  DS    CL30                INSERTION/TRANSMISSION DETAILS               
MRHTYPE  DS    XL1                 POSTING TYPE                                 
MRHTXFR  EQU   0                   TRANSFER                                     
MRHTMED  EQU   1                   MEDIA SYSTEM BILL POSTING                    
MRHTREC  EQU   2                   RECONCILIATION                               
MRHTRECR EQU   3                   RECONCILIATION REVERSAL                      
MRHTVNO  EQU   4                   VERSCHILLENNOTE                              
MRHTVNOR EQU   5                   VERSCHILLENNOTE REVERSAL                     
MRHTWOF  EQU   6                   WRITTEN-OFF                                  
MRHTWOFR EQU   7                   WRITTEN-OFF REVERSAL                         
MRHSEQN  DS    XL2                 PASSIVE POINTER SEQUENCE NUMBER              
MRHMCOMR DS    XL2                 MEDIA COMMISSION RATE (2DP)                  
MRHSUPN  DS    CL8                 MEDIA SUPPLIER SHORT NAME                    
         DS    XL2                 N/D                                          
*++ASSOCIATED MRHLN                                                             
MRHLN1Q  EQU   *-MRHELD                                                         
MRHTAXR  DS    XL2                 TAX INPUT RATE                               
MRHCLIC  DS    CL5                 MEDIA CLIENT CODE                            
MRHCLIN  DS    CL12                MEDIA CLIENT SHORT NAME                      
*++ASSOCIATED MRHLN                                                             
MRHLN2Q  EQU   *-MRHELD                                                         
         SPACE 1                                                                
SIDELD   DSECT                     ** SUPPLIER INVOICE DETAILS **               
*++IDENTIFIER                                                                   
SIDEL    DS    XL1                 ELEMENT CODE                                 
SIDELQ   EQU   X'73'                                                            
SIDLN    DS    XL1                 ELEMENT LENGTH                               
SIDDAT   DS    XL3                 DATE                                         
SIDREF   DS    CL6                 SUPPLIER INVOICE NUMBER                      
*++ASSOCIATED SIDLN                                                             
SIDLNQ   EQU   *-SIDELD                                                         
         SPACE 1                                                                
MRXELD   DSECT                     ** MEDIA RECONCILE EXTRA DETAIL **           
*++IDENTIFIER                                                                   
MRXEL    DS    XL1                 ELEMENT CODE                                 
MRXELQ   EQU   X'74'                                                            
MRXLN    DS    XL1                 ELEMENT LENGTH                               
MRXTYPE  DS    XL1                 RECONCILIATION TYPE                          
MRXTWOF  EQU   1                   WRITE-OFF DETAILS                            
MRXTXTO  EQU   2                   TRANSFERRED TO DETAILS                       
MRXTXFR  EQU   3                   TRANSFERRED FROM DETAILS                     
MRXTVER  EQU   4                   VERSCHIL DETAILS                             
MRXULA   DS    0CL14               UNIT/LEDGER/ACCOUNT                          
MRXUNT   DS    CL1                 UNIT CODE                                    
MRXLDG   DS    CL1                 LEDGER CODE                                  
MRXACT   DS    CL12                ACCOUNT CODE                                 
*++ASSOCIATED MRXLN                                                             
MRXLN1Q  EQU   *-MRXELD            ** MRXTXTO/MRXTXFR **                        
MRXREF   DS    CL6                 REFERENCE                                    
MRXDAT   DS    PL3                 DATE                                         
*++ASSOCIATED MRXLN                                                             
MRXLN2Q  EQU   *-MRXELD            ** MRXTWOF **                                
MRXIND1  DS    XL1                 INDICATOR - 1                                
MRXINOCD EQU   X'80'               DISCOUNT NOT TAKEN ORIGINALLY                
MRXISSD  DS    XL2                 DATE VERSCHILLEN NOTE PRINTED                
         DS    XL6                 N/D                                          
*++ASSOCIATED MRXLN                                                             
MRXLN3Q  EQU   *-MRXELD            ** MRXTVER **                                
         SPACE 1                                                                
TRXELD   DSECT                     ** TRANSACTION EXTRA STATUS **               
*++IDENTIFIER                                                                   
TRXEL    DS    XL1                 ELEMENT CODE                                 
TRXELQ   EQU   X'75'                                                            
TRXLN    DS    XL1                 ELEMENT LENGTH                               
TRXSTA1  DS    XL1                 STATUS BYTE 1                                
TRXSRQRD EQU   X'80'               DEBTORS QUERIED STATUS  (ON=QUERIED)         
TRXSRHLD EQU   X'40'               DEBTORS HELD STATUS     (ON=HELD)            
TRXSRCLR EQU   X'20'               DEBTORS CLEARING STATUS (ON=CLRNG)           
TRXSXDSJ EQU   X'10'               EX. DIFF. POSTING ON SJ - USE SOREL          
TRXSXALC EQU   X'02'               EXCLUDE FROM BILL ALLOCATION (NBILL)         
TRXSXDIF EQU   X'01'               VENDOR EXCHANGE DIFFERENCE POSTING           
TRXSTA2  DS    XL1                 STATUS BYTE 2                                
TRXSNTMS EQU   X'80'               NO TIMRECD RECORD EXISTS                     
TRXSEXCL EQU   X'10'               TRANSACTION IS EXCLUDED FROM REPORTS         
TRXSXFRP EQU   X'04'               TRANSACTION TRANSFER PENDING                 
TRXSWOFP EQU   X'02'               TRANSACTION WRITE-OFF PENDING                
TRXSBILP EQU   X'01'               TRANSACTION BILL ACTIVITY PENDING            
TRXSTA3  DS    XL1                 STATUS BYTE 3                                
TRXSADVC EQU   X'80'               ADVANCE PAYMENT POSTING                      
TRXSDIFF EQU   X'40'               MINOR DIFFERENCE POSTING                     
TRXSTA4  DS    XL1                 STATUS BYTE 4                                
*++ASSOCIATED TRXLN                                                             
TRXLN1Q  EQU   *-TRXELD                                                         
         SPACE 1                                                                
NOTELD   DSECT                     ** TRANSACTION NOTES **                      
*++IDENTIFIER                                                                   
NOTEL    DS    XL1                 ELEMENT CODE                                 
NOTELQ   EQU   X'76'                                                            
NOTLN    DS    XL1                 ELEMENT LENGTH                               
NOTDATE  DS    XL2                 DATE                                         
NOTREF   DS    XL6                 REFERENCE                                    
*++ASSOCIATED NOTLN                                                             
NOTLN1Q  EQU   *-NOTELD                                                         
NOTNOTE  DS    0C                  NOTE                                         
         SPACE 1                                                                
PTAELD   DSECT                     ** PROD TRANSACTION ACTIVITY **              
*++IDENTIFIER                                                                   
PTAEL    DS    XL1                 ELEMENT CODE                                 
PTAELQ   EQU   X'77'                                                            
PTALN    DS    XL1                 ELEMENT LENGTH                               
PTADATE  DS    XL2                 ACTIVITY DATE                                
PTAPERS  DS    XL2                 PERSON CODE                                  
PTATYPE  DS    XL1                 ACTIVITY TYPE                                
PTATRAL  EQU   1                   ALLOCATE TO BILL                             
PTATTRFF EQU   2                   TRANSFER FROM                                
PTATTRFT EQU   3                   TRANSFER TO                                  
PTATWOF  EQU   4                   WRITE-OFF                                    
PTATWOFR EQU   5                   WRITE-OFF RECOVERY                           
PTATREVS EQU   X'80'               TRANSFER/WRITE-OFF REVERSAL POSTING          
PTASTAT1 DS    XL1                 STATUS BYTE 1                                
PTASPEND EQU   X'80'               THIS ACTIVITY PENDING (DRAFTED ONLY)         
PTASCOVR EQU   X'40'               COMMISSION OVERRIDDEN                        
PTASHOUR EQU   X'20'               ALLOCATED BY HOURS                           
PTASCASH EQU   X'10'               ALLOCATED BY CASH                            
PTASREVS EQU   X'08'               REVERSAL ALLOCATION                          
PTASREVD EQU   X'04'               THIS BILL REVERSED (ALLOCATED)               
PTASREVU EQU   X'02'               REVERSAL OF THIS BILL UPDATED                
PTASUOFF EQU   X'01'               UPDATED OFFLINE                              
PTASTAT2 DS    XL1                 STATUS BYTE 2                                
PTASXCOM EQU   X'80'               TRANSFER IS COMMISSIONABLE                   
PTASCISN EQU   X'40'               PRINT COMM AS NET (POST AS COMM)             
PTASXISA EQU   X'20'               TRANSFER IS ALLOCATED                        
PTASAUTR EQU   X'10'               AUTO REVERSAL ELEMENT                        
PTASWRUP EQU   X'08'               ELEMENT HAS W-UP AMT IN PTAWUAMT             
PTASTBIL EQU   X'04'               THIS BILLING IS TOTAL BILL                   
PTASRETB EQU   X'02'               SECONDARY RETAIL POSTING                     
*&&UK                                                                           
PTASOXFR EQU   X'02'               THIS ORDER ALLOC NOW ON INVOICE              
*&&                                                                             
PTANET   DS    PL6                 NET AMOUNT IN AGENCY CURRENCY                
PTANETF  DS    PL6                 NET AMOUNT IN FOREIGN CURRENCY               
         ORG   PTANETF                                                          
PTAWUAMT DS    PL6                 WRITE-UP AMOUNT                              
PTASEQN  DS    XL2                 SEQUENCE NUMBER (SEE PTAKSEQN)               
         ORG   PTASEQN                                                          
PTAWUHRS DS    XL2                 WRITE-UP HOURS                               
PTACUR   DS    CL3                 CURRENCY CODE                                
PTAMOA   DS    XL2                 MOA UPDATED - PWOS                           
PTACDSC  DS    PL6                 CASH DISCOUNT                                
PTAHOURS DS    XL2                 HOURS (2DP)                                  
PTAOFFC  DS    XL2                 CLIENT OFFICE                                
*++ASSOCIATED PTALN                                                             
PTALN1Q  EQU   *-PTAELD                                                         
PTAVALS  DS    0X                                                               
*                                                                               
PTARVAL  DS    0X                  ** REGULAR ALLOCATION VALUES **              
PTARCORT DS    PL4                 COMMISSION RATE                              
PTARCOM  DS    PL6                 COMMISSION AMOUNT                            
PTARDATE DS    XL2                 BILLING DATE                                 
PTARPERS DS    XL2                 PERSON CODE                                  
PTARBLNO DS    CL6                 BILL NUMBER                                  
PTARBLDT DS    XL2                 BILL DATE                                    
PTARCODE DS    XL1                 'FORMAT TO' PARAGRAPH CODE                   
*&&US                                                                           
PTARFORM DS    CL2                 FORMAT/GROUP LEVEL (A27)                     
PTARTYPE DS    CL1                 WORKCODE TYPE      (A27)                     
PTARGSTC DS    CL1                 GST CODE                                     
PTARPSTC DS    CL1                 PST CODE                                     
PTARPRVC DS    XL2                 PROVINCE CODE                                
PTARORGB DS    CL6                 ORIGINAL BILL NUMBER (REVERSAL)              
PTARORGD DS    XL2                 ORIGINAL BILL DATE   (REVERSAL)              
         ORG   PTARORGB                                                         
PTARUNBB DS    CL6                 UNBILL BILL NUMBER (REVERSED)                
PTARUNBD DS    XL2                 UNBILL RUN DATE (REVERSED)                   
*&&                                                                             
*++ASSOCIATED PTALN                                                             
PTARLN1Q EQU   *-PTAELD                                                         
*                                                                               
PTARCVAL DS    0X                  ** FOREIGN CURRENCY BILLING **               
PTARFCOM DS    PL6                 COMMISSION AMOUNT                            
*++ASSOCIATED PTALN                                                             
PTARLN2Q EQU   *-PTAELD                                                         
*                                                                               
         ORG   PTAVALS                                                          
PTATVAL  DS    0X                  ** TRANSFER TO VALUES **                     
PTATJOB  DS    CL12                TRANSFER TO JOB                              
PTATWRK  DS    CL2                 TRANSFER TO WORKCODE                         
*++ASSOCIATED PTALN                                                             
PTATLN1Q EQU   *-PTAELD                                                         
PTATSKAC DS    CL12                OVERRIDE SK ACCOUNT                          
*++ASSOCIATED PTALN                                                             
PTATLN2Q EQU   *-PTAELD                                                         
*                                                                               
         ORG   PTAVALS                                                          
PTAFVAL  DS    0X                  ** TRANSFER FROM VALUES **                   
PTAFJOB  DS    CL12                TRANSFER FROM JOB                            
PTAFWRK  DS    CL2                 TRANSFER FROM WORKCODE                       
*++ASSOCIATED PTALN                                                             
PTAFLN1Q EQU   *-PTAELD                                                         
*                                                                               
         ORG   PTAVALS                                                          
PTAWVAL  DS    0X                  ** WRITE-OFF VALUES **                       
PTAWREF  DS    CL6                 TRANSACTION REFERENCE                        
PTAWDAT  DS    PL3                 TRANSACTION DATE                             
PTAWEXPA DS    0CL14               EXPENSE ACCOUNT                              
PTAWEUNT DS    CL1                 UNIT CODE                                    
PTAWELDG DS    CL1                 LEDGER CODE                                  
PTAWEACT DS    CL12                ACCOUNT CODE                                 
*&&US                                                                           
PTAWWOT  DS    CL1                 WRITE-OFF TYPE                               
*&&                                                                             
*++ASSOCIATED PTALN                                                             
PTAWLN1Q EQU   *-PTAELD                                                         
PTAWWOFA DS    0CL14               WRITE-OFF ACCOUNT                            
PTAWWUNT DS    CL1                 UNIT CODE                                    
PTAWWLDG DS    CL1                 LEDGER CODE                                  
PTAWWACT DS    CL12                ACCOUNT CODE                                 
*++ASSOCIATED PTALN                                                             
PTAWLN2Q EQU   *-PTAELD                                                         
         SPACE 1                                                                
BLHELD   DSECT                     ** BILL HEADER ELEMENT **                    
*++IDENTIFIER                                                                   
BLHEL    DS    XL1                 ELEMENT CODE                                 
BLHELQ   EQU   X'78'                                                            
BLHLN    DS    XL1                 ELEMENT LENGTH                               
BLHJOB   DS    CL12                JOB NUMBER                                   
BLHBLNO  DS    CL6                 BILL NUMBER (DRAFT OR LIVE)                  
BLHUSER  DS    XL2                 USER-ID                                      
BLHPERS  DS    XL2                 PERSON                                       
BLHLUID  DS    CL8                 TERMINAL LUID                                
BLHCRED  DS    XL2                 CREATED DATE                                 
BLHBILD  DS    XL2                 BILLED DATE (ZERO=DRAFT BILL)                
BLHEXPD  DS    XL2                 EXPIRY DATE                                  
BLHTRND  DS    XL2                 TRANSACTION DATE (PRINTED ON BILL)           
BLHDUED  DS    XL2                 DUE DATE    (FOR DEBTORS POSTING)            
BLHFORM  DS    XL1                 BILL FORMAT                                  
BLHLANG  DS    XL1                 LANGUAGE CODE                                
BLHCUR   DS    CL3                 CURRENCY CODE                                
BLHRVAL  DS    0XL7                                                             
BLHRIND  DS    XL1                 EXCHANGE RATE INDICATOR                      
BLHRATE  DS    PL5                 CURRENCY EXCHANGE RATE                       
BLHRSHF  DS    XL1                 SHIFT VALUE                                  
BLHBREF  DS    CL4                 BATCH REFERENCE                              
BLHBMOS  DS    PL2                 BATCH MONTH                                  
BLHDSCI  DS    XL1                 INDICATOR BYTE:-                             
BLHDSC   DS    PL6                 DISCOUNT % (2DP)                             
BLHSCHI  DS    XL1                 INDICATOR BYTE:-                             
BLHSCH   DS    PL6                 SURCHARGE % (2DP)                            
BLHPDATE DS    XL2                 DATE BILL LAST SENT TO PRINT QUEUE           
BLHPTIME DS    0PL3                TIME BILL LAST SENT TO PRINT QUEUE           
BLHPTHH  DS    PL1                 HOUR                                         
BLHPTMM  DS    PL1                 MINUTE                                       
BLHPTSS  DS    PL1                 SECONDS                                      
BLHPNUM  DS    XL1                 NUMBER OF TIMES BILL SENT TO PQ              
*++ASSOCIATED BLHLN                                                             
BLHLNQ   EQU   *-BLHELD                                                         
BLHINDS1 DS    XL1                 INDICATOR BYTE                               
BLHIDDSF EQU   X'80'               DUE DATE SET FROM FORMULA                    
BLHIAGBN EQU   X'40'               AUTO GENERATE LIVE BILL NUMBER               
BLHIAGBR EQU   X'20'               AUTO GENERATE BATCH REF                      
BLHIAFRM EQU   X'10'               BODY OF BILL AUTO-FORMED                     
BLHIRTOT EQU   X'08'               BILL TOTALS NEED TO BE REFRESHED             
BLHIACSA EQU   X'04'               ACCRUALS SET BY AMOUNT, NOT PERCENT          
BLHIREP  EQU   X'02'               IS A DRAFT REPLICATE BILL                    
BLHDUEDF DS    XL4                 DUE DATE FORMULA                             
BLHLVNO  DS    CL6                 LIVE BILL# (SAVED ON DRAFT BILL)             
BLHNADV  DS    XL1                 NUMBER OF ADVANCES ON RECORD                 
BLHTSEQ  DS    XL2                 JCBSEQ VALUE WHEN BILL TOTALS SET            
         DS    XL18                N/D                                          
*++ASSOCIATED BLHLN                                                             
BLHLN2Q  EQU   *-BLHELD                                                         
         SPACE 1                                                                
PGHELD   DSECT                     ** PARAGRAPH HEADER ELEMENT **               
*++IDENTIFIER                                                                   
PGHEL    DS    XL1                 ELEMENT CODE                                 
PGHELQ   EQU   X'79'                                                            
PGHLN    DS    XL1                 ELEMENT LENGTH                               
PGHNET   DS    PL6                 NET AMOUNT                                   
PGHCOM   DS    PL6                 COMMISSION AMOUNT                            
PGHTAX   DS    CL1                 TAX TYPE (LOWER CASE) OR SCITTTAX            
PGHHTYP  DS    CL1                 HEADING TYPE                                 
PGHHHRSQ EQU   01                  HOURLY HEADING                               
PGHHCSTQ EQU   02                  COST HEADING                                 
PGHHTYP2 DS    XL1                 INTERNAL/EXTERNAL PARAGRAPH                  
PGHHINTQ EQU   01                  INTERNAL                                     
PGHHEXTQ EQU   02                  EXTERNAL                                     
PGHOALLC DS    PL6                 OVERALLOCATION (INCLUDED IN PGHCOM)          
         DS    XL8                 N/D                                          
*++ASSOCIATED PGHLN                                                             
PGHLNQ   EQU   *-PGHELD                                                         
         SPACE 1                                                                
AFCELD   DSECT                     ** ACCOUNT FOREIGN CURRENCY DATA **          
*++IDENTIFIER                                                                   
AFCEL    DS    XL1                 ELEMENT CODE                                 
AFCELQ   EQU   X'7A'                                                            
AFCLN    DS    XL1                 ELEMENT LENGTH                               
AFCCURR  DS    CL3                 FOREIGN CURRENCY CODE                        
AFCRATE  DS    0PL6                                                             
AFCAMNT  DS    PL6                 FOREIGN CURRENCY AMOUNT                      
AFCX     DS    0CL7                EXCHANGE RATE RULE                           
AFCXSTAT DS    XL1                 STATUS                                       
AFCXSFIX EQU   X'80'               FIXED CONVERSION RATE                        
AFCXSDIV EQU   X'01'               DIVIDE BY RATE (ELSE MULTIPLY)               
AFCXRATE DS    PL5                 PWOS RATE (99999.99999)                      
AFCXSHFT DS    XL1                 SHIFT VALUE FOR DEC PLACE DIFFERENCE         
AFCXSTA2 DS    XL1                 STATUS BYTE 2                                
AFCXSMEM EQU   X'04'               MEMO ONLY (NO ACCOUNTING VALUE)              
AFCXPRIM EQU   X'02'               PRIME AFCEL FOR BATCH ITEM                   
         DS    XL2                 N/D                                          
*++ASSOCIATED AFCLN                                                             
AFCLNQ   EQU   *-AFCELD                                                         
         SPACE 1                                                                
SORELD   DSECT                     ** SOURCE ELEMENT **                         
*++IDENTIFIER                                                                   
SOREL    DS    XL1                 ELEMENT CODE                                 
SORELQ   EQU   X'7B'                                                            
SORLN    DS    XL1                 ELEMENT LENGTH                               
SORSYS   DS    CL1                 ORIGINATING SYSTEM                           
SORSACC  EQU   C'A'                ACCOUNT SYSTEM                               
SORSMED  EQU   C'M'                MEDIA SYSTEM                                 
SORDATA  DS    0X                  ELEMENT DATA STARTS HERE                     
*                                                                               
SORAULA  DS    0CL14               ACCOUNT SYSTEM SOURCE                        
SORAUNT  DS    CL1                 UNIT CODE                                    
SORALDG  DS    CL1                 LEDGER CODE                                  
SORAACT  DS    CL12                ACCOUNT CODE                                 
*++ASSOCIATED SORLN                                                             
SORALNQ  EQU   *-SORELD                                                         
SORAWRK  DS    CL2                 WORK-CODE                                    
*++ASSOCIATED SORLN                                                             
SORAL2Q  EQU   *-SORELD                                                         
*                                                                               
         ORG   SORDATA                                                          
SORMCPC  DS    0CL11               MEDIA SYSTEM SOURCE                          
SORMMED  DS    CL1                 MEDIA CODE                                   
SORMCLI  DS    CL5                 CLIENT CODE                                  
SORMPRO  DS    CL2                 PRODUCT NUMBER OR SPACES                     
SORMCAM  DS    CL3                 CAMPAIGN NUMBER OR SPACES                    
*++ASSOCIATED SORLN                                                             
SORMLNQ  EQU   *-SORELD                                                         
         SPACE 1                                                                
UNPELD   DSECT                     ** UNIT PRICING ELEMENT **                   
*++IDENTIFIER                                                                   
UNPEL    DS    XL1                 ELEMENT CODE                                 
UNPELQ   EQU   X'7C'                                                            
UNPLN    DS    XL1                 ELEMENT LENGTH                               
UNPSTRT  DS    PL3                 EFFECTIVE START DATE                         
UNPRICE  DS    PL4                 UNIT PRICE (2DP)                             
UNPUNIT  DS    PL3                 UNITS                                        
UNPSTAT  DS    XL1                                                              
UNPSQTRH EQU   X'40'               UNITS DATA IS QUARTER HOUR                   
*&&UK                                                                           
*NPSQTRH EQU   X'80'               UNITS DATA IS QUARTER HOUR                   
*&&                                                                             
UNPLVL   DS    XL1                 PRICE LEVEL                                  
         DS    XL1                 N/D                                          
*++ASSOCIATED UNPLN                                                             
UNPLNQ   EQU   *-UNPELD                                                         
         SPACE 1                                                                
BLFELD   DSECT                     ** BILLING PARAGRAPH FORMAT ELEM. **         
*++IDENTIFIER                                                                   
BLFEL    DS    XL1                 ELEMENT CODE                                 
BLFELQ   EQU   X'7C'                                                            
BLFLN    DS    XL1                 ELEMENT LENGTH                               
*++IDENTIFIER                                                                   
BLFFLD   DS    XL1                 DATA/COLUMN CODE                             
BLFFWCQ  EQU   01                  WORKCODE                                     
BLFFREFQ EQU   02                  TRANSACTION REFERENCE                        
BLFFDATQ EQU   03                  TRANSACTION DATE                             
BLFFSUPQ EQU   04                  SUPPLIER/PERSON NAME                         
BLFFNARQ EQU   05                  NARRATIVE                                    
BLFFNETQ EQU   06                  NET                                          
BLFFCOMQ EQU   07                  COMMISSION                                   
BLFFGRSQ EQU   08                  GROSS                                        
BLFFVATQ EQU   09                  VAT                                          
BLFFHRSQ EQU   10                  HOURS                                        
BLFFRATQ EQU   11                  RATE (SALES)                                 
BLFFWCNQ EQU   12                  WORKCODE NAME                                
BLFFNET2 EQU   13                  NET 2                                        
BLFFGRS2 EQU   14                  GROSS 2                                      
BLFFCDSQ EQU   15                  CASH DISCOUNT                                
BLFFPLMQ EQU   16                  PRICELIST MULTIPLIER                         
BLFFPLVQ EQU   17                  PRICELIST VALUE                              
BLFFCMRQ EQU   18                  COMMISSION RATE                              
BLFFKSVQ EQU   19                  ARTISTS KSV                                  
BLFFORGQ EQU   20                  ORIGINAL INPUT                               
BLFFIRFQ EQU   21                  INTERNAL REFERENCE NUMBER                    
BLFTYPE  DS    0XL1                WORKCODE TYPE                                
BLFTTIMQ EQU   01                  DETAILS APPLY TO HOURLY PARAS                
BLFTCSTQ EQU   02                  DETAILS APPLY TO COST                        
BLFSECT  DS    XL1                 SECTION NUMBER                               
BLFLINF  DS    XL1                 START LINE NUMBER                            
BLFLINN  DS    XL1                 NUMBER OF LINES                              
BLFCOLF  DS    XL1                 START COLUMN NUMBER                          
BLFCOLN  DS    XL1                 NUMBER OF COLUMNS                            
BLFOPT1  DS    XL1                 OPTIONS 1                                    
BLFOLFTQ EQU   X'80'               LEFT ALIGN HEADLINES                         
BLFORGTQ EQU   X'40'               RIGHT ALIGN HEADLINES                        
BLFOCTRQ EQU   X'20'               CENTRALISE HEADLINES                         
BLFOMAXQ EQU   X'10'               MAXIMISE HEADING 2                           
BLFONPRQ EQU   X'08'               THIS COLUMN DOES NOT PRINT                   
BLFONKYQ EQU   X'04'               THIS COLUMN NOT A SORT KEY                   
BLFOPT2  DS    XL1                 OPTIONS 2                                    
BLFOBOT  EQU   X'80'               BLFLINF IS FROM BOTTOM, NOT THE TOP          
BLFOAPL  EQU   X'40'               AMOUNT PER LINE                              
BLFOHPG  EQU   X'20'               HEADING FOR EACH PAGE                        
BLFOHPR  EQU   X'10'               HEADING FOR EACH PARA                        
BLFOHUND EQU   X'08'               HEADING IS UNDERLINED                        
BLFOHONE EQU   X'04'               HEADING IS ONE LINE ONLY                     
BLFHEDL  DS    XL1                 HEADING LINE INDEX (0-8)                     
BLFHEDCN DS    XL1                 WIDTH OF HEADING (DEFAULT 16)                
         DS    XL2                 N/D                                          
BLFHED1  DS    CL16                HEADING 1                                    
BLFHED2  DS    CL16                HEADING 2                                    
*++ASSOCIATED BLFLN                                                             
BLFLNQ   EQU   *-BLFELD                                                         
         SPACE 1                                                                
PBIELD   DSECT                     ** PST BILLED ELEMENT **                     
*++IDENTIFIER                                                                   
PBIEL    DS    XL1                 ELEMENT CODE                                 
PBIELQ   EQU   X'7D'                                                            
PBILN    DS    XL1                 ELEMENT LENGTH                               
PBITYPE  DS    CL1                 PST CODE                                     
PBIRATE  DS    XL2                 PST RATE                                     
PBIPRV   DS    CL2                 PST PROVINCE CODE                            
PBIPST   DS    PL6                 PST AMOUNT BILLED                            
PBIGROSS DS    PL6                 GROSS AMOUNT BILLED                          
PBICOMM  DS    PL6                 COMMISSION AMOUNT BILLED                     
PBIACCT  DS    CL15                PST ACCOUNT                                  
PBIDATE  DS    PL3                 PST EFFECTIVE DATE                           
         DS    XL4                 N/D                                          
*++ASSOCIATED PBILN                                                             
PBILNQ   EQU   *-PBIELD                                                         
         SPACE 1                                                                
BOFELD   DSECT                     ** BILLING OPTIONS FORMAT ELEMENT **         
*++IDENTIFIER                                                                   
BOFEL    DS    XL1                 ELEMENT CODE                                 
BOFELQ   EQU   X'7E'                                                            
BOFLN    DS    XL1                 ELEMENT LENGTH                               
BOFINDS1 DS    XL1                 INDICATOR BYTE 1                             
BOFIHPAG EQU   X'80'               HEADINGS FOR EACH PAGE                       
BOFIHPAR EQU   X'40'               HEADINGS FOR EACH PARA                       
BOFIAPRE EQU   X'20'               APPEND PREVIOUS BILL DETAILS                 
BOFIPVSA EQU   X'10'               PRINT VAT SUMMARY IN AGENCY CUR.             
BOFIPVSF EQU   X'08'               PRINT VAT SUMMARY IN FOREIGN CUR.            
BOFISAVV EQU   X'04'               SHOW AGENCY CUR. VAT (IF FOREIGN)            
BOFISVAT EQU   X'02'               SHOW $STG VAT VALUE                          
BOFIPPAY EQU   X'01'               PRINT "PLEASE PAY THIS AMOUNT"               
BOFINDS2 DS    XL1                 INDICATOR BYTE 2                             
BOFIUPCA EQU   X'80'               PRINT EVERYTHING IN UPPER CASE               
BOFISSUR EQU   X'40'               SUPPRESS % FOR SURCHARGE                     
BOFISDIS EQU   X'20'               SUPPRESS % FOR DISCOUNT                      
BOFIPASP EQU   X'10'               PRINT AMOUNTS ON SPACE ONLY PARAS            
BOFISCIT EQU   X'08'               SUPPRESS CURRENCY FOR INVOICE TOTAL          
BOFIPREV EQU   X'04'               INCLUDE PRIOR BILLING                        
BOFITEUR EQU   X'02'               PRINT TOTAL IN EUROS                         
BOFWCORD DS    XL1                 WORKCODE DISPLAY ORDER                       
BOFWTIME EQU   C'T'                TIME WORKCODES FIRST, THEN COST              
BOFWCOST EQU   C'C'                COST WORKCODES FIRST, THEN TIME              
BOFWALPH EQU   C'A'                WORKCODES SHOWN ALPHANUMERICALLY             
BOFSUBT  DS    XL1                 SUB-TOTAL TIME/COST                          
BOFSBOTH EQU   C'B'                BOTH                                         
BOFSNO   EQU   C'N'                NO                                           
BOFSTIME EQU   C'T'                TIME ONLY                                    
BOFSCOST EQU   C'C'                COST ONLY                                    
BOFPARSP DS    XL1                 PARAGRAPH SPACING                            
BOFMAXLN DS    XL1                 MAXLINES PER PAGE                            
BOFMAXWD DS    XL1                 MAXWIDTH PER PAGE                            
BOFPAGSP DS    XL1                 NUMBER OF SPACE LINES AT TOP OF PAGE         
BOFSUBT2 DS    XL1                 SUB-TOTAL INTERNAL/EXTERNAL                  
BOFS2BTH EQU   C'B'                BOTH                                         
BOFS2NO  EQU   C'N'                NO                                           
BOFS2INT EQU   C'T'                INTERNAL ONLY                                
BOFS2EXT EQU   C'C'                EXTERNAL ONLY                                
BOFINDS3 DS    XL1                 INDICATOR BYTE 3                             
BOFIPORT EQU   X'80'               PC PRINTING DONE IN PORTRAIT                 
         DS    XL8                 N/D                                          
*++ASSOCIATED BOFLN                                                             
BOFLNQ   EQU   *-BOFELD                                                         
         SPACE 1                                                                
NDXELD   DSECT                     ** INDEX ELEMENT **                          
*++IDENTIFIER                                                                   
NDXEL    DS    XL1                 ELEMENT CODE                                 
NDXELQ   EQU   X'7F'                                                            
NDXLN    DS    XL1                 ELEMENT LENGTH                               
NDXHIGH  DS    XL1                 HIGHEST SEQUENCE NUMBER USED                 
NDXACTV  DS    XL1                 NUMBER OF ACTIVE ENTRIES IN USE              
NDXINDX  DS    200XL1              ACTIVE INDEX/REUSABLE INDEX                  
*++ASSOCIATED NDXLN                                                             
NDXLNQ   EQU   *-NDXELD                                                         
         SPACE 1                                                                
PHRELD   DSECT                     ** PERSONAL HOURLY RATE ELEMENT **           
*++IDENTIFIER                                                                   
PHREL    DS    XL1                 ELEMENT CODE                                 
PHRELQ   EQU   X'80'                                                            
PHRLN    DS    XL1                 ELEMENT LENGTH                               
PHRPER   DS    0XL2                PERIOD                                       
PHRYR    DS    XL1                 YEAR                                         
PHRMON   DS    XL1                 MONTH                                        
PHRMTH   DS    CL1                 METHOD OF ALLOCATION                         
PHRNUM   DS    XL1                 NUMBER OF SALARY SUB-ELEMENTS                
*++ASSOCIATED PHRLN                                                             
PHRLN1Q  EQU   *-PHRELD                                                         
*                                                                               
PHRNTRY  DS    0X                  SALARY SUB-ELEMENT                           
PHRTYPE  DS    CL1                 SALARY TYPE                                  
PHRTSAL  EQU   C'1'                BASE SALARY                                  
PHRTBEN  EQU   C'2'                BENEFIT                                      
PHRTPEN  EQU   C'3'                PENSION                                      
PHRTADM  EQU   C'4'                ADMINISTRATION                               
PHRTTMP  EQU   C'5'                TEMPORARY                                    
PHRTBON  EQU   C'6'                BONUS                                        
PHRTOVT  EQU   C'7'                OVERTIME                                     
PHRTTOT  EQU   C'T'                TOTAL                                        
PHRRATE  DS    PL5                 HOURLY RATE (4 DP)                           
         DS    XL2                 N/D                                          
*++ASSOCIATED PHRLN                                                             
PHRLN2Q  EQU   *-PHRNTRY                                                        
         SPACE 1                                                                
DOAELD   DSECT                     ** DATE OF ALLOCATION ELEMENT **             
*++IDENTIFIER                                                                   
DOAEL    DS    XL1                 ELEMENT CODE                                 
DOAELQ   EQU   X'81'                                                            
DOALN    DS    XL1                 ELEMENT LENGTH                               
DOAPER   DS    0XL2                ALLOCATION PERIOD                            
DOAYR    DS    XL1                 YEAR                                         
DOAMON   DS    XL1                 MONTH                                        
DOADTE   DS    XL2                 DATE OF ALLOCATION (COMPRESSED)              
         DS    XL10                N/D                                          
*++ASSOCIATED DOALN                                                             
DOALNQ   EQU   *-DOAELD                                                         
         SPACE 1                                                                
METELD   DSECT                     ** METHOD OF ALLOCATION ELEMENT **           
*++IDENTIFIER                                                                   
METEL    DS    XL1                 ELEMENT CODE                                 
METELQ   EQU   X'82'                                                            
METLN    DS    XL1                 ELEMENT LENGTH                               
METNUM   DS    XL1                 ALLOCATION METHOD NUMBER                     
METCODE  DS    CL3                 ALLOCATION METHOD CODE                       
         DS    XL20                N/D                                          
*++ASSOCIATED METLN                                                             
METLNQ   EQU   *-METELD                                                         
         SPACE 1                                                                
LOCELD   DSECT                     ** STAFF LOCATION ELEMENT **                 
*++IDENTIFIER                                                                   
LOCEL    DS    XL1                 ELEMENT CODE                                 
LOCELQ   EQU   X'83'                                                            
LOCLN    DS    XL1                 ELEMENT LENGTH                               
LOCSTART DS    PL3                 DATE THIS LOCATION STARTED                   
LOCEND   DS    PL3                 DATE THIS LOCATION ENDED                     
LOCOFF   DS    CL2                 OFFICE                                       
LOCDEPT  DS    CL6                 DEPARTMENT                                   
LOCSUB   DS    CL6                 SUB-DEPARTMENT                               
LOCLOCK  DS    PL3                 TIMESHEET LOCKED DATE                        
LOCATTR  DS    XL1                 LOCATION ATTRIBUTES                          
LOCAEXEC EQU   X'80'               EMPLOYEE IS AN EXECUTIVE                     
LOCAPROD EQU   X'40'               PRODUCT REQUIRED ON TIMESHEET                
LOCAJOB  EQU   X'20'               JOB REQUIRED ON TIMESHEET                    
LOCAACT  EQU   X'10'               USE ACTUAL AS STANDARD HOURS                 
LOCALOCK EQU   X'08'               ACCOUNT LOCKED (DIFF FORM TIMESHEET)         
LOCAPRTS EQU   X'04'               PROJECT REQ'D ON TIMESHEETS                  
LOCSTAT  DS    XL1                 LOCATION STATUS                              
LOCSACT  EQU   0                   ACTIVE                                       
LOCSTRM  EQU   1                   TERMINATED (AT THIS LOCATION)                
LOCSLOA  EQU   2                   LEAVE OF ABSENCE                             
LOCSTRAN EQU   3                   TRANSFERRED                                  
LOCSOTH  EQU   4                   OTHER                                        
LOCSTAT2 DS    XL1                 MORE STATII                                  
LOCSDUP  EQU   X'80'               LOCATION HAS BEEN DUPLICATED (LOCK)          
LOCSALKD DS    PL3                 SALARY LOCKED DATE                           
*++ASSOCIATED LOCLN                                                             
LOCLNQ   EQU   *-LOCELD                                                         
         SPACE 1                                                                
PAYELD   DSECT                     ** PAYROLL CODE ELEMENT **                   
*++IDENTIFIER                                                                   
PAYEL    DS    XL1                 ELEMENT CODE                                 
PAYELQ   EQU   X'84'                                                            
PAYLN    DS    XL1                 ELEMENT LENGTH                               
PAYNUM   DS    XL1                 NUMBER (SYSTEM ASSIGNED)                     
PAYCODE  DS    XL5                 PAYROLL CODE                                 
PAYDESC  DS    XL15                DESCRIPTION                                  
PAYREV   DS    CL5                 REVERSE TYPE                                 
PAYPCS   DS    0XL2                PERCENTAGE PAY CODES                         
PAYPC1   DS    XL1                 NUMBER OF PC1 PAY CODE                       
PAYPC2   DS    XL1                 NUMBER OF PC2 PAY CODE                       
PAYSTAT  DS    XL1                 STATUS BIT                                   
PAYSHRTE EQU   X'80'               HOURLY RATE PAYCODE                          
PAYADJRT EQU   X'40'               YEAR END ADJUSTMENT PAYCODE                  
PAYCRTE  EQU   X'20'               CRATE PAYCODE                                
         DS    XL2                 N/D                                          
*++ASSOCIATED PAYLN                                                             
PAYLNQ   EQU   *-PAYELD                                                         
         SPACE 1                                                                
PATELD   DSECT                     ** PAYROLL TYPE ELEMENT **                   
*++IDENTIFIER                                                                   
PATEL    DS    XL1                 ELEMENT CODE                                 
PATELQ   EQU   X'85'                                                            
PATLN    DS    XL1                 ELEMENT LENGTH                               
PATNUM   DS    XL1                 PAYROLL CODE NUMBER                          
PATTYPE  DS    XL1                 SALARY TYPE                                  
PATTSAL  EQU   C'1'                SALARY                                       
PATTBEN  EQU   C'2'                BENEFIT                                      
PATTPEN  EQU   C'3'                PENSION                                      
PATTIND  EQU   C'4'                INDIRECT                                     
PATTOTH  EQU   C'7'                OTHER TYPES                                  
         DS    XL5                 N/D                                          
*++ASSOCIATED PATLN                                                             
PATLNQ   EQU   *-PATELD                                                         
         SPACE 1                                                                
PDEELD   DSECT                     ** PAYROLL DETAIL ELEMENT **                 
*++IDENTIFIER                                                                   
PDEEL    DS    XL1                 ELEMENT CODE                                 
PDEELQ   EQU   X'86'                                                            
PDELN    DS    XL1                 ELEMENT LENGTH                               
PDEDTE   DS    XL3                 DATE (PWOS)                                  
PDENUM   DS    XL1                 PAYROLL CODE NUMBER(SEE PAYELD)              
PDEAMT   DS    PL6                 AMOUNT (FROM INTERFACE SYSTEM)               
PDEADJ   DS    PL6                 ADJUSTMENT                                   
PDESTAT  DS    XL1                 STATUS BYTE                                  
PDERVRSL EQU   X'01'               AUTO REVERSAL                                
PDEPCS   EQU   X'06'               PDEPC1+PDEPC2 (ALL PERCENTAGES)              
PDEPC1   EQU   X'02'               GENERATED BY PC1                             
PDEPC2   EQU   X'04'               GENERATED BY PC2                             
PDESTAT2 DS    XL1                                                              
PDESLAST EQU   X'80'               USE LAST DAY OF MONTH W/MONTH OPTION         
PDESHRTE EQU   X'40'               AMOUNTS ARE HOURLY RATES                     
PDESADJ  EQU   X'20'               AMOUNT IS AN ADJUSTMENT RATE                 
         DS    XL3                 N/D                                          
*++ASSOCIATED PDELN                                                             
PDELNQ   EQU   *-PDEELD                                                         
PDEDESC  DS    0CL21               DESCRIPTION (21 BYTE MAX)                    
         SPACE 1                                                                
TMRELD   DSECT                     ** TIMESHEET PERIOD RULES ELEMENT **         
*++IDENTIFIER                                                                   
TMREL    DS    XL1                 ELEMENT CODE                                 
TMRELQ   EQU   X'87'                                                            
TMRLN    DS    XL1                 ELEMENT LENGTH                               
TMRSTART DS    XL3                 PACKED YEAR STARTING DATE                    
TMREND   DS    XL3                 PACKED YEAR ENDING DATE                      
TMRPEND  DS    XL1                 DAY OF WK PERIOD ENDS 01=MON,07=SUN          
TMRMON   EQU   1                   MON                                          
TMRTUE   EQU   2                   TUES                                         
TMRWED   EQU   3                   WED                                          
TMRTHU   EQU   4                   THU                                          
TMRFRI   EQU   5                   FRI                                          
TMRSAT   EQU   6                   SAT                                          
TMRSUN   EQU   7                   SUN                                          
TMRDEF   DS    XL1                 PERIOD DEFINITION                            
TMRWEEK  EQU   X'80'               WEEKLY                                       
TMRMNTH  EQU   X'40'               MONTHLY                                      
TMRHMTH  EQU   X'20'               HALF MONTHLY(15TH AND 31ST)                  
TMRBIWK  EQU   X'10'               BI WEEKLY(EVERY OTHER THURSDAY)              
TMRBDCST EQU   X'08'               BROADCAST WEEKS                              
TMRWKMON EQU   X'04'               WK PERIODS CANNOT OVERLAP CAL MONTHS         
         DS    XL10                N/D                                          
*++ASSOCIATED TMRLN                                                             
TMRLNQ   EQU   *-TMRELD                                                         
         SPACE 1                                                                
TMPELD   DSECT                     ** TIMESHEET PERIODS ELEMENT **              
*++IDENTIFIER                                                                   
TMPEL    DS    XL1                 ELEMENT CODE                                 
TMPELQ   EQU   X'88'                                                            
TMPLN    DS    XL1                 ELEMENT LENGTH                               
TMPMTH   DS    XL2                 PACKED YYMM                                  
TMPNUMB  DS    XL1                 PERIOD #                                     
TMPSTART DS    XL3                 PACKED PERIOD STARTING DATE                  
TMPEND   DS    XL3                 PACKED PERIOD ENDING DATE                    
         DS    XL4                 N/D                                          
*++ASSOCIATED TMPLN                                                             
TMPLNQ   EQU   *-TMPELD                                                         
         SPACE 1                                                                
SHRELD   DSECT                     ** STANDARD HOURS YEAR ELEMENT **            
*++IDENTIFIER                                                                   
SHREL    DS    XL1                 ELEMENT CODE                                 
SHRELQ   EQU   X'89'                                                            
SHRLN    DS    XL1                 ELEMENT LENGTH                               
SHRSTART DS    PL3                 START DATE FOR HOURS                         
SHREND   DS    PL3                 END DATE FOR HOURS                           
SHRHOURS DS    PL4                 STANDARD HOURS (2 DEC)                       
         DS    XL4                 N/D                                          
*++ASSOCIATED SHRLN                                                             
SHRLNQ   EQU   *-SHRELD                                                         
         SPACE 1                                                                
CEDELD   DSECT                     ** CHEQUE EXTRA DETAIL ELEMENT **            
*++IDENTIFIER                                                                   
CEDEL    DS    XL1                 ELEMENT CODE                                 
CEDELQ   EQU   X'8A'                                                            
CEDLN    DS    XL1                 ELEMENT LENGTH                               
CED#INV  DS    XL2                 NUMBER OF INVOICES ON CHEQUE                 
*++ASSOCIATED CEDLN                                                             
CEDLN1Q  EQU   *-CEDELD                                                         
         SPACE 1                                                                
TIMELD   DSECT                     ** TIME DETAIL ELEMENT **                    
*++IDENTIFIER                                                                   
TIMEL    DS    XL1                 ELEMENT CODE                                 
TIMELQ   EQU   X'8B'                                                            
TIMLN    DS    XL1                 ELEMENT LENGTH                               
TIMSEQ   DS    XL1                 SEQUENCE                                     
*++IDENTIFIER                                                                   
TIMETYP  DS    XL1                 DATA TYPE                                    
TIMEINP  EQU   1                   INPUT DETAIL                                 
TIMETAX  EQU   2                   TAX DETAIL                                   
TIMENAR  EQU   3                   NARRATIVE                                    
TIMEFLD  EQU   4                   COMMENTED FIELDS                             
TIMEXREF EQU   5                   TEMPO XREF ELEMENT                           
TIMEXTRA EQU   6                   TEMPO EXTRA STATUS ELEMENT                   
*++ASSOCIATED TIMLN                                                             
TIMHLNQ  EQU   *-TIMELD            LENGTH OF ELEMENT HEADER                     
*                                                                               
TIMINP   DS    0X                  INPUT DATA                                   
TIMACC   DS    CL14                'SJ' OR '1N' ACCOUNT                         
TIMTSK   DS    CL2                 TASK CODE                                    
TIMOFF   DS    CL2                 CLIENT OFFICE CODE                           
TIMTTYP  DS    XL1                 TYPE OF TIME                                 
TIMTCB   EQU   1                   CLIENT BILLABLE                              
TIMTCR   EQU   2                   CLIENT REALIZATION                           
TIMTCN   EQU   3                   CLIENT NON-BILLABLE                          
TIMTNC   EQU   16                  NON-CLIENT                                   
TIMIND   DS    XL1                 TIME INDICATOR                               
TIMIADJ  EQU   X'20'               ADJUSTED                                     
TIMIWO   EQU   X'40'               WRITE-OFF ITEM                               
TIMMOA   DS    PL2                 MONTH OF ACTIVITY                            
*++ASSOCIATED TIMLN                                                             
TIMILNQ  EQU   *-TIMINP            LENGTH OF INPUT KEY DATA                     
TIMSTAT  DS    XL1                 STATUS                                       
TIMSPCC  EQU   X'80'               PROJECT CONTROL(CLIENT LEDGER)               
TIMSPCJ  EQU   X'40'               PROJECT CONTROL(JOB LEDGER)                  
TIMLOCK  EQU   X'20'               CLUSTER LOCK INDICATOR                       
TIMNOTAX EQU   X'10'               TAX SUPPRESSED FOR THIS ITEM                 
TIMTEMPO EQU   X'08'               LINE ITEM CREATED BY TEMPO UPLOAD            
TIMRESTR EQU   X'04'               LINE IS NOT A NEW ADD-EXISTED PREV           
TIMDRPND EQU   X'02'               PENDING DRAFT TRANSFERS                      
TIMLDRFT EQU   X'00'               *** NO LONGER USED ***                       
TIMRQTAX EQU   X'01'               TAX ELIGIBLE FOR THIS ITEM                   
TIMLINE# DS    XL2                 TIMESHEET LINE #                             
TIMADAT  DS    PL3                 ACTIVITY DATE                                
TIMHRS   DS    PL3                 HOURS                                        
*++ASSOCIATED TIMLN                                                             
TIMILN1Q EQU   *-TIMELD            LENGTH FOR NON-BILLABLE INPUT                
*                                                                               
TIMBID   DS    0X                  BILLABLE INPUT DATA                          
TIMRATE  DS    PL4                 BILLING RATE                                 
TIMRBSTA DS    XL1                 BILLABLE TIME STATUS                         
TIMROINC EQU   X'01'               INCOME ACCT OVERRIDDEN @INPUT TIME           
TIMRORAT EQU   X'02'               RATE OVERRIDDEN @INPUT TIME                  
TIMRBADJ EQU   X'80'               BILLING RATE WAS ADJUSTED                    
TIMREFF  DS    PL3                 RATE EFFECTIVE DATE                          
TIMINC   DS    CL14                INCOME ACCOUNT                               
*&&UK                                                                           
TIMCRATE DS    PL4                 COST RATE                                    
TIMCREFF DS    PL3                 COST RATE EFFECTIVE DATE                     
         DS    XL6                 N/D                                          
*&&                                                                             
*++ASSOCIATED TIMLN                                                             
TIMBLNQ  EQU   *-TIMBID            LENGTH OF BILLABLE DATA                      
         DS    XL1                 N/D                                          
TIMLKCBI DS    XL1                 LOCK COUNT - # TIMES LOCKED FROM CBI         
TIMAMNT  DS    PL6                 BILLING AMOUNT                               
*++ASSOCIATED TIMLN                                                             
TIMILN2Q EQU   *-TIMELD            LENGTH FOR BILLABLE INPUT                    
*                                                                               
         ORG   TIMINP                                                           
TIMTAX   DS    0X                  TAX DETAIL                                   
TIMTWC   DS    CL2                 TAX WORK CODE                                
TIMTLOC  DS    CL8                 TAX LOCALITY                                 
TIMTBAS  DS    PL6                 TAX BASIS                                    
TIMTSTA  DS    XL1                 TAX STATUS BYTE                              
TIMTOVR  EQU   X'01'               TAX INFORMATION WAS OVERRIDDEN               
         DS    XL2                 N/D                                          
TIMTMINI DS    XL1                 # TAX ACCT MINI ELEMENTS                     
*++ASSOCIATED TIMLN                                                             
TIMTHDQ  EQU   *-TIMELD            LENGTH OF HEADER                             
TIMTMINS DS    0C                  START OF MINI ELEMENTS                       
TIMTACC  DS    CL14                TAX CREDIT ACCOUNT                           
TIMTEFF  DS    PL3                 TAX EFFECTIVE DATE                           
TIMTRATE DS    PL4                 TAX RATE                                     
TIMTAMNT DS    PL6                 TAX AMOUNT                                   
TIMTMINQ EQU   *-TIMTMINS          LENGTH OF MINI ENTRY                         
*                                                                               
         ORG   TIMINP                                                           
TIMNARR  DS    0CL60               NARRATIVE                                    
*++ASSOCIATED TIMLN                                                             
TIMNLNQ  EQU   *-TIMELD                                                         
*                                                                               
         ORG   TIMINP                                                           
TIMFMINI DS    XL1                 NUMBER OF MINI ELEMENTS                      
TIMFLINE DS    XL2                 TIMESHEET LINE #                             
TIMFITEM DS    0C                                                               
TIMFLEN  DS    XL1                 MINI ELEMENT LENGTH                          
TIMFNUM  DS    XL2                 FIELD NUMBER                                 
TIMFITMQ EQU   *-TIMFITEM                                                       
TIMFIELD DS    0C                  COMMENTED FIELDS                             
*++ASSOCIATED TIMLN                                                             
TIMFLNQ  EQU   *-TIMELD                                                         
*                                                                               
         ORG   TIMINP                                                           
TIMXPED# DS    XL1                 PERIOD NUMBER                                
TIMXPEDT DS    PL3                 ACTUAL PERIOD END DATE                       
TIMXOFFC DS    CL2                 OFFICE                                       
TIMXDEPT DS    CL6                 DEPARTMENT                                   
TIMXSDPT DS    CL6                 SUBDEPARTMENT                                
TIMXPSDT DS    PL3                 ACTUAL PERIOD START DATE                     
         DS    XL27                N/D                                          
*++ASSOCIATED TIMLN                                                             
TIMXLNQ  EQU   *-TIMELD                                                         
*                                                                               
         ORG   TIMINP                                                           
TIMXTLN# DS    XL2                 TEMPO LINE NUMBER                            
TIMXTPDT DS    PL3                 ACTUAL PERIOD END DATE                       
         DS    XL7                 N/D                                          
*++ASSOCIATED TIMLN                                                             
TIMXTLNQ EQU   *-TIMELD                                                         
         SPACE 1                                                                
PTHELD   DSECT                     ** PERIOD TOTAL HOURS ELEMENT **             
*++IDENTIFIER                                                                   
PTHEL    DS    XL1                 ELEMENT CODE                                 
PTHELQ   EQU   X'8D'                                                            
PTHELQA  EQU   X'8E'               ADJUSTED VERSION                             
PTHLN    DS    XL1                 ELEMENT LENGTH                               
PTHEDT   DS    PL3                 PERIOD ENDING DATE                           
PTHBLNQ  EQU   *-PTHELD            LENGTH OF BASE ELEMENT                       
*                                                                               
PTHSLNQ  DS    0XL8                SUB-ELEMENT FOR EACH MOA                     
*                                  ** DO NOT CHANGE LENGTH ELSE PRGMS           
*                                  ** WILL DIE, DUE TO DIVIDE USING SRL         
PTHMOA   DS    PL2                 MOA                                          
PTHMHRS  DS    0PL3                HOURS REPORTED FOR FIRST MOA                 
PTHCHRS  DS    PL3                 TOTAL CLIENT HOURS                           
PTHTHRS  DS    PL3                 TOTAL HOURS                                  
*++ASSOCIATED PTHLN                                                             
PTHLNQ   EQU   *-PTHELD                                                         
         SPACE 1                                                                
MCHELD   DSECT                     ** MONTHLY CLIENT HOURS ELEMENT **           
*++IDENTIFIER                                                                   
MCHEL    DS    XL1                 ELEMENT CODE                                 
MCHELQ   EQU   X'8E'                                                            
MCHLN    DS    XL1                 ELEMENT LENGTH                               
MCHMOA   DS    PL2                 MONTH (YYMM)                                 
MCHHRS   DS    PL4                 HOURS                                        
*++ASSOCIATED MCHLN                                                             
MCHLNQ   EQU   *-MCHELD                                                         
         SPACE 1                                                                
TSCELD   DSECT                     ** TIME SHEET CHANGE ELEMENT **              
*++IDENTIFIER                                                                   
TSCEL    DS    XL1                 ELEMENT CODE                                 
TSCELQ   EQU   X'8F'                                                            
TSCLN    DS    XL1                 ELEMENT LENGTH                               
TSCDATE  DS    XL2                 DATE OF CHANGE(COMPRESSED)                   
TSCHOUR  DS    PL3                 OLD NUMBER OF HOURS                          
         DS    XL10                N/D                                          
*++ASSOCIATED TSCLN                                                             
TSCLNQ   EQU   *-TSCELD                                                         
         SPACE 1                                                                
VPDELD   DSECT                     ** VENDOR PAYMENT DETAIL  **                 
*++IDENTIFIER                                                                   
VPDEL    DS    XL1                 ELEMENT CODE                                 
VPDELQ   EQU   X'90'                                                            
VPDLN    DS    XL1                 ELEMENT LENGTH                               
VPDACT   DS    XL2                 ACTIVITY DATE (COMPRESSED)                   
VPDMOS   DS    PL2                 MOS(PWOS YYMM)                               
VPDUPDT  DS    XL2                 DATE ITEM MARKED BY GLU                      
VPDVOID  DS    XL2                 DATE ITEM VOIDED                             
VPDSTAT  DS    XL1                 STATUS BYTE                                  
VPDSGLUP EQU   X'80'               ON=UPDATED TO G/L, OFF IF REV.               
VPDSACHQ EQU   X'04'               PAID BY OFFLINE CHECK (AC55 ETC.)            
VPDSAOVD EQU   X'01'               VOIDED OLD WAY (BAT37)                       
VPDNO    DS    CL6                 CHECK NUMBER                                 
VPDDTE   DS    XL2                 DATE OF CHECK                                
VPDCKAMT DS    PL6                 CHECK AMOUNT                                 
VPDBNK   DS    CL14                BANK ACCOUNT                                 
VPDBREF  DS    CL6                 DEBIT BATCH REFERENCE NUMBER                 
VPDDAMT  DS    PL6                 DEBIT AMOUNT                                 
         DS    XL5                 N/D                                          
*++ASSOCIATED VPDLN                                                             
VPDLNQ   EQU   *-VPDELD                                                         
         SPACE 1                                                                
TRPELD   DSECT                     ** TRANSACTION POINTER ELEMENT **            
*++IDENTIFIER                                                                   
TRPEL    DS    XL1                 ELEMENT CODE                                 
TRPELQ   EQU   X'91'                                                            
TRPLN    DS    XL1                 LENGTH                                       
TRPSTAT  DS    XL1                 TRANSACTION STATUS                           
TRPSDR   EQU   X'80'               DEBIT IF ON ELSE CREDIT                      
TRPTYPE  DS    XL1                 TRANSACTION TYPE                             
TRPTADV  EQU   1                   ADVANCE PAYMENT                              
TRPTDIF  EQU   2                   MINOR DIFFERENCE                             
TRPTDTD  EQU   3                   MINOR DIFFERENCE TAX ADJ. DIFF A/C           
TRPTDTT  EQU   4                   MINOR DIFFERENCE TAX ADJ. TAX A/C            
TRPTAXV  EQU   5                   ADVANCE EXCHANGE DIFF - VENDOR               
TRPTAXX  EQU   6                   ADVANCE EXCHANGE DIFF - EXCH DIFF            
TRPAMNT  DS    PL6                 TRANSACTION AMOUNT                           
TRPULA   DS    0C                                                               
TRPUL    DS    0CL2                                                             
TRPUNT   DS    CL1                 UNIT CODE                                    
TRPLDG   DS    CL1                 LEDGER CODE                                  
*++ASSOCIATED TRPLN                                                             
TRPLN1Q  EQU   *-TRPELD                                                         
TRPACT   DS    0C                  ACCOUNT CODE (SPACES TRUNCATED)              
         SPACE 1                                                                
CNTELD   DSECT                     ** CTA CONTRACT ELEM **                      
*++IDENTIFIER                                                                   
CNTEL    DS    XL1                 ELEMENT CODE                                 
CNTELQ   EQU   X'92'                                                            
CNTLN    DS    XL1                 LENGTH                                       
CNTCONTR DS    CL6                 CONTRACTOR                                   
CNTGCI   DS    PL6                 GCI FOR CONTRACT                             
CNTNCI   DS    PL6                 NCI FOR CONTRACT                             
CNTNPAY  DS    PL6                 NET PAYABLE FOR CONTRACT                     
CNTCLRD  DS    PL6                 MEDIA CLEARED(DLV'D) AMOUNT                  
CNTOPNPO DS    PL6                 RETAIL VALUE OPEN PURCHASE ORDERS            
CNTINVPO DS    PL6                 RETAIL VALUE INVOICED PO'S                   
CNTCOST  DS    PL6                 ACTUAL COST INVOICED PO'S                    
CNTDELDT DS    PL3                 LAST DATE OF DELIVERY - MEMO BILL            
         DS    CL10                N/D                                          
*++ASSOCIATED CNTLN                                                             
CNTLNQ   EQU   *-CNTELD                                                         
CNTBINV  DS    PL6                 BALANCE B/F SERVICES DLVD (INVOICED)         
CNTBCOST DS    PL6                 BALANCE B/F SERVICES COST                    
         DS    CL6                 N/D                                          
*++ASSOCIATED CNTLN                                                             
CNTLN2Q  EQU   *-CNTELD                                                         
         SPACE 1                                                                
CTGELD   DSECT                     ** CTA CATEGORY ELEM **                      
*++IDENTIFIER                                                                   
CTGEL    DS    XL1                 ELEMENT CODE                                 
CTGELQ   EQU   X'93'                                                            
CTGLN    DS    XL1                 LENGTH                                       
CTGCTGY  DS    CL2                 CATEGORY= WORK CODE                          
CTGGCI   DS    PL6                 GCI FOR CATEGORY                             
CTGNCI   DS    PL6                 NCI FOR CATEGORY                             
CTGRATIO DS    PL4                 RATIO FOR NET PAYABLE                        
CTGCPCT  DS    PL4                 COST % (ESTIMATED)                           
CTGOPNPO DS    PL6                 RETAIL VALUE OPEN PURCHASE ORDERS            
CTGINVPO DS    PL6                 RETAIL VALUE INVOICED PO'S                   
CTGCOST  DS    PL6                 ACTUAL COST INVOICED PO'S                    
CTGNPAY  DS    PL6                 NET PAYABLE FOR CATEGORY                     
         DS    CL4                 N/D                                          
*++ASSOCIATED CTGLN                                                             
CTGLNQ   EQU   *-CTGELD                                                         
CTGBINV  DS    PL6                 BALANCE B/F SERVICES DLVD (INVOICED)         
CTGBCOST DS    PL6                 BALANCE B/F SERVICES COST                    
         DS    CL6                 N/D                                          
*++ASSOCIATED CTGLN                                                             
CTGLN2Q  EQU   *-CTGELD                                                         
         SPACE 1                                                                
CPOELD   DSECT                     ** CONTRACT PURCHASE ORDER ELEM **           
*++IDENTIFIER                                                                   
CPOEL    DS    XL1                 ELEMENT CODE                                 
CPOELQ   EQU   X'94'                                                            
CPOLN    DS    XL1                 LENGTH                                       
CPOLINE  DS    XL1                 LINE NUMBER                                  
CPOQTY   DS    PL3                 QUANTITY                                     
CPOSTOCK DS    CL8                 STOCK NUMBER                                 
CPOUPRI  DS    PL6                 UNIT PRICE                                   
CPOURET  DS    PL6                 UNIT RETAIL                                  
CPORATIO DS    PL4                 RATIO FOR RETAIL EXTENSION                   
CPOQTYIN DS    PL3                 QUANTITY INVOICED                            
CPOAMTIN DS    PL6                 AMOUNT INVOICED                              
CPOQTYTD DS    PL3                 QUANTITY INVOICED TODAY                      
CPOAMTTD DS    PL6                 AMOUNT INVOICED TODAY                        
CPOLAST  DS    PL3                 LAST ACTIVITY DATE                           
         DS    CL10                N/D                                          
*++ASSOCIATED CPOLN                                                             
CPOLN1Q  EQU   *-CPOELD                                                         
CPODESC  DS    0CL25               DESCRIPTION                                  
         SPACE 1                                                                
CXFELD   DSECT                     ** CONTRACT TRANSFER ELEM **                 
*++IDENTIFIER                                                                   
CXFEL    DS    XL1                 ELEMENT CODE                                 
CXFELQ   EQU   X'95'                                                            
CXFLN    DS    XL1                 LENGTH                                       
CXFCON   DS    CL5                 CONTRACT NUMBER                              
CXFSTAT  DS    XL1                 STATUS                                       
CXFSPAID EQU   X'80'               TRANSFER DOLLARS ARE PAID                    
CXFSAVL  EQU   X'40'               TRANSFER DOLLARS ARE AVAILABLE               
CXFAMNT  DS    PL6                 AMOUNT OF TRANSFER                           
*++ASSOCIATED CXFLN                                                             
CXFLNQ   EQU   *-CXFELD                                                         
         SPACE 1                                                                
BMAELD   DSECT                     ** BILL MONTHLY ACCRUAL ELEMENT **           
*++IDENTIFIER                                                                   
BMAEL    DS    XL1                 ELEMENT CODE                                 
BMAELQ   EQU   X'96'                                                            
BMALN    DS    XL1                 ELEMENT LENGTH                               
BMAMOA   DS    PL2                 MONTH OF ACTIVITY                            
BMAINDS  DS    XL1                 INICATORS BYTE                               
BMAIDIV  EQU   X'80'               AMOUNT IS DIVISION OF REMAINDER              
         DS    XL3                 N/D                                          
BMAPC    DS    PL4                 PERCENT (TO 4 DEC. PLACES)                   
BMAAMT   DS    PL6                 AMOUNT                                       
*++ASSOCIATED BMALN                                                             
BMALNQ   EQU   *-BMAELD                                                         
         SPACE 1                                                                
OMJELD   DSECT                     ** O+M JOB DATA ELEMENT **                   
*++IDENTIFIER                                                                   
OMJEL    DS    XL1                 ELEMENT CODE                                 
OMJELQ   EQU   X'99'                                                            
OMJLN    DS    XL1                 ELEMENT LENGTH                               
OMJAM    DS    XL1                 O+M AGENCY/MEDIA                             
OMJCLT   DS    CL2                 O+M CLIENT CODE                              
OMJPRD   DS    CL2                 O+M PRODUCT CODE                             
OMJJOB   DS    CL6                 O+M JOB NUMBER                               
*++ASSOCIATED OMJLN                                                             
OMJLNQ   EQU   *-OMJELD            ELEMENT LENGTH                               
         SPACE 1                                                                
TSLELD   DSECT                     ** TIME SHEET LIST ELEMENT **                
*++IDENTIFIER                                                                   
TSLEL    DS    XL1                 ELEMENT CODE                                 
TSLELQ   EQU   X'9A'                                                            
TSLLN    DS    XL1                 ELEMENT LENGTH                               
TSLSEQ   DS    XL1                 ELEMENT SEQUENCE NUMBER                      
         DS    XL3                 N/D                                          
*++ASSOCIATED TSLLN                                                             
TSLLN1Q  EQU   *-TSLELD                                                         
*                                                                               
TSLNTRY  DS    0X                  VARIABLE NUMBER OF ENTRIES                   
TSLLEN   DS    XL1                 LENGTH OF ENTRY (ZERO=EOL)                   
TSLSTA   DS    XL1                 STATUS                                       
TSLACT   DS    0C                  ACCOUNT CODE (EXCLUDING U/L)                 
*++ASSOCIATED TSLLN                                                             
TSLLN2Q  EQU   *-TSLNTRY                                                        
         SPACE 1                                                                
*++PROCESS OFF                                                                  
* ELEMENT CODES 9A,9B,9C,9E AND 9F ARE RESERVED FOR TALENT ELEMENTS             
* MAINTAINED ON THE TALENT SESSION ESTIMATING RECORD(US).  THE                  
* ACTUAL ELEMENT LAYOUTS ARE DEFINED IN TAGENFILE.                              
*                                                                               
TECELQ   EQU   X'9F'               TAECEL- ESTIMATE CAST (X'EA')                
TETELQ   EQU   X'9B'               TAETEL - ESUMATE TOTAL (X'EB')               
TEOELQ   EQU   X'9C'               TAEOEL - ESTIMATE OPTIONS (X'EC')            
TEXELQ   EQU   X'9E'               TAXCEL - ESTIMATE COMMENT (X'8C')            
TEWELQ   EQU   X'9A'               TAWCEL - ESTIMATE WORKCODE (X'B4')           
         SPACE 1                                                                
*++PROCESS ON                                                                   
TSDELD   DSECT                     ** TALENT SYSTEM DETAILS **                  
*++IDENTIFIER                                                                   
TSDEL    DS    XL1                 ELEMENT CODE                                 
TSDELQ   EQU   X'9D'                                                            
TSDLN    DS    CL1                 ELEMENT LENGTH                               
TSDAGY   DS    CL6                 AGENCY                                       
TSDCLI   DS    CL6                 CLIENT                                       
TSDPRD   DS    CL6                 PRODUCT                                      
TSDCID   DS    CL12                COMMERCIAL ID                                
TSDEST   DS    CL16                ESTIMATE NUMBER                              
TSDSTAT  DS    XL1                 ERROR STATUS                                 
TSDSCLI  EQU   X'80'               CLIENT MISSING                               
TSDSPRD  EQU   X'40'               PRODUCT MISSING                              
TSDSJOB  EQU   X'20'               JOB MISSING                                  
TSDSACC  EQU   X'10'               ACCOUNT INVALID                              
TSDSLCK  EQU   X'08'               ACCOUNT LOCKED                               
TSDSCLO  EQU   X'04'               ACCOUNT CLOSED                               
TSDSXJB  EQU   X'02'               ACCOUNT IS AN XJOB                           
TSDSTA2  DS    CL1                 ERROR STATUS 2                               
TSDSTP   EQU   X'80'               TP MUST FIX                                  
*++ASSOCIATED TSDLN                                                             
TSDLNQ   EQU   *-TSDELD            ELEMENT LENGTH                               
         SPACE 1                                                                
PGRELD   DSECT                     ** PRODUCTION GROUP ELEMENT **               
*                                  ELEMENT IS USED IN OFFICE RECORDS            
*++IDENTIFIER                                                                   
PGREL    DS    XL1                 ELEMENT CODE                                 
PGRELQ   EQU   X'A0'                                                            
PGRLN    DS    XL1                 ELEMENT LENGTH                               
PGRCODE  DS    CL1                 CODE                                         
         DS    XL1                 N/D                                          
*++ASSOCIATED PGRLN                                                             
PGRLNQ   EQU   *-PGRELD                                                         
         SPACE 1                                                                
PACELD   DSECT                     ** PERSON ACTIVITY ELEMENT **                
*++IDENTIFIER                                                                   
PACEL    DS    XL1                 ELEMENT CODE                                 
PACELQ   EQU   X'A1'                                                            
PACLN    DS    XL1                 ELEMENT LENGTH                               
PACPERS  DS    CL8                 PERSON CODE                                  
PACDATE  DS    PL3                 LAST ACTIVITY DATE                           
*++ASSOCIATED PACLN                                                             
PACLNQ   EQU   *-PACELD                                                         
         SPACE 1                                                                
UFSELD   DSECT                     ** USER FIELD SELECT ELEMENT **              
*++IDENTIFIER                                                                   
UFSEL    DS    XL1                 ELEMENT CODE                                 
UFSELQ   EQU   X'A2'                                                            
UFSLN    DS    XL1                 ELEMENT LENGTH                               
UFSSEQ   DS    XL1                 FIELD SEQUENCE NO                            
         DS    XL1                 N/D                                          
UFSCODE  DS    CL2                 USER FIELD CODE                              
UFSDESC  DS    CL12                SCREEN HEADER DESCRIPTION                    
UFSEDIT  DS    CL8                 EDIT RULE - FIRST CHARACTER IS...            
*                                  N=NUMERIC D=DATE                             
UFSMXLN  DS    XL1                 MAXIMUM LENGTH (1-32)                        
UFSSTAT  DS    XL1                 STATUS                                       
UFSSREQD EQU   X'80'               REQUIRED FIELD                               
UFSSNEBI EQU   X'40'               NEED FOR BILLS                               
UFSSSHES EQU   X'20'               SHOW ON EST                                  
UFSSSHBI EQU   X'10'               SHOW ON BILLS                                
UFSSPRCV EQU   X'08'               PASS TO RECEIVABLES                          
UFSUCOM  EQU   X'02'               UCOM USER FIELD, NOT UDEF                    
UFSCUT   DS    PL3                 CUTOFF DATE                                  
         DS    XL1                 N/D                                          
*++ASSOCIATED UFSLN                                                             
UFSLN1Q  EQU   *-UFSELD                                                         
UFSDATA  DS    0C                  INPUT DATA WHEN ELEMENT ON JOB               
         SPACE 1                                                                
COIELD   DSECT                     ** COMMENT INFO ELEMENT **                   
*++IDENTIFIER                                                                   
COIEL    DS    XL1                 ELEMENT CODE                                 
COIELQ   EQU   X'A3'                                                            
COILN    DS    XL1                 ELEMENT LENGTH                               
COIDESC  DS    CL15                COMMENT DESCRIPTION                          
COIFILT  DS    CL4                 COMMENT FILTERS                              
         DS    XL3                 N/D                                          
*++ASSOCIATED COILN                                                             
COILNQ   EQU   *-COIELD                                                         
         SPACE 1                                                                
OPDELD   DSECT                     ** OPTIONS DATA ELEMENT **                   
*++IDENTIFIER                                                                   
OPDEL    DS    XL1                 ELEMENT CODE                                 
OPDELQ   EQU   X'A4'                                                            
OPDLN    DS    XL1                 ELEMENT LENGTH                               
OPDNUM   DS    XL1                 OPTION NUMBER                                
OPDPERS  DS    CL8                 PERSON LAST CHANGING OPTION                  
OPDLAST  DS    PL3                 DATE OPTION WAS CHANGED                      
OPDGRP   DS    XL1                 THE GROUP THIS OPTION BELONGS TO             
         DS    XL1                 N/D                                          
*++ASSOCIATED OPDLN                                                             
OPDLN1Q  EQU   *-OPDELD                                                         
OPDDATA  DS    0C                  OPTIONAL DATA - DEPENDS ON NUMBER            
         SPACE 1                                                                
SCHELD   DSECT                     ** SCHEME DEFINITION ELEMENT **              
*++IDENTIFIER                                                                   
SCHEL    DS    XL1                 ELEMENT CODE                                 
SCHELQ   EQU   X'A5'                                                            
SCHLN    DS    XL1                 ELEMENT LENGTH                               
SCHNAME  DS    CL20                SCHEME NAME                                  
         DS    XL8                 N/D                                          
*++ASSOCIATED SCHLN                                                             
SCHLNQ   EQU   *-SCHELD            SCHEME DEFINITION ELEMENT LENGTH             
         SPACE 1                                                                
SCSELD   DSECT                     ** SCHEME CATEGORY SEQUENCE **               
*++IDENTIFIER                                                                   
SCSEL    DS    XL1                 ELEMENT CODE                                 
SCSELQ   EQU   X'A6'                                                            
SCSLN    DS    XL1                 ELEMENT LENGTH (N'CATGS*2+2)                 
*++ASSOCIATED SCSLN                                                             
SCSLN1Q  EQU   *-SCSELD                                                         
SCSCAT   DS    0CL2                CATEGORY LIST                                
         SPACE 1                                                                
CADELD   DSECT                     ** CATEGORY DESCRIPTION ELEMENT **           
*++IDENTIFIER                                                                   
CADEL    DS    XL1                 ELEMENT CODE                                 
CADELQ   EQU   X'A7'                                                            
CADLN    DS    XL1                 ELEMENT LENGTH                               
CADNAME  DS    CL20                CATEGORY NAME                                
CADSTAT  DS    XL1                 STATUS BYTE                                  
CADSSUPT EQU   X'80'               SUPPRESS TOTALS                              
CADSCONT EQU   X'40'               CATEGORY IS A CONTINUATION                   
CADSRHS  EQU   X'20'               CATEGORY PRINTS ON RHS                       
CADSNPRT EQU   X'10'               DO NOT PRINT CAT NAME ON ESTIMATE            
CADSFLAN EQU   X'08'               FOREIGN LANGUAGE NAMES PRESENT               
CADTNAM  DS    CL20                TOTAL NAME (OR SPACES)                       
CADLINO  DS    XL1                 CATEGORY TOTAL LINE NUMBER                   
         DS    XL7                 N/D                                          
CADTYPE  DS    XL1                 CATEGORY TYPE                                
CADTWORK EQU   1                   WORK CODE LIST                               
CADTAGY  EQU   2                   AGENCY COMMISSION LINE                       
CADTFORM EQU   3                   CATEGORY FORMULA                             
CADTTAX  EQU   4                   TAX LINE                                     
CADTGRS  EQU   5                   GROSS LINE                                   
*++ASSOCIATED CADLN                                                             
CADLN1Q  EQU   *-CADELD                                                         
CADINST  DS    0C                  INSTRUCTIONS - CATEGORY FORMULA              
CADLINP  DS    XL1                 LENGTH OF INPUT STRING                       
CADINP   DS    0C                  INPUT STRING                                 
CADLFOR  DS    XL1                 LENGTH OF FORMULA                            
CADFOR   DS    0C                  INTERNAL FORMULA-OPERATION/CATEGORY          
CADFONA  DS    0C                  FOREIGN LANGUAGE NAMES (GER ONLY)            
CADLFNA  DS    XL1                 LENGTH OF INPUT STRING                       
CADFNAM  DS    0C                  FOREIGN NAME                                 
CADLFTN  DS    XL1                 LENGTH OF INPUT STRING                       
CADFTNA  DS    0C                  FOREIGN TOTAL NAME                           
         SPACE 1                                                                
CWKELD   DSECT                     ** CATEGORY WORK CODE ELEMENT **             
*++IDENTIFIER                                                                   
CWKEL    DS    XL1                 ELEMENT CODE                                 
CWKELQ   EQU   X'A8'                                                            
CWKLN    DS    XL1                 ELEMENT LENGTH                               
CWKSEQ   DS    XL1                 SEQUENCE NUMBER                              
CWKTYPE  DS    XL1                 TYPE                                         
CWKTWORK EQU   1                   WORK-CODE                                    
CWKTSUBC EQU   2                   SUB-TOTAL AND CLEAR                          
CWKTRUNT EQU   3                   RUNNING TOTAL                                
CWKSTAT  DS    XL1                 STATUS BYTE                                  
CWKSPRE  EQU   X'80'               PRESTO ONLY (DO NOT UPLOAD)                  
         DS    XL1                 N/D                                          
CWKCAT   DS    CL2                 CATEGORY FOR CALCULATION                     
CWKDATA  DS    0C                                                               
CWKWORK  DS    CL2                 WORK CODE                                    
CWKSUFF  DS    XL1                 WORK CODE SUFFIX                             
*++ASSOCIATED CWKLN                                                             
CWKLN1Q  EQU   *-CWKELD                                                         
CWKDESC  DS    CL15                OVERRIDE DESCRIPTION                         
*++ASSOCIATED CWKLN                                                             
CWKLN2Q  EQU   *-CWKELD                                                         
         SPACE 1                                                                
EUPELD   DSECT                     ** ESTIMATE UPDATE ELEMENT **                
*++IDENTIFIER                                                                   
EUPEL    DS    XL1                 ELEMENT CODE                                 
EUPELQ   EQU   X'A9'                                                            
EUPLN    DS    XL1                 ELEMENT LENGTH                               
EUPADD   DS    PL3                 DATE ADDED                                   
EUPLAST  DS    PL3                 DATE LAST CHANGED                            
EUPERS   DS    CL8                 PERSON WHO ENTERED LAST CHANGE               
EUPTIME  DS    XL3                 TIME LAST CHANGED, BINARY SECONDS            
         DS    XL1                 N/D                                          
*++ASSOCIATED EUPLN                                                             
EUPLNQ   EQU   *-EUPELD            ESTIMATE UPDATE ELEMENT LENGTH               
         SPACE 1                                                                
ENAELD   DSECT                     ** ESTIMATE NAME ELEMENT **                  
*++IDENTIFIER                                                                   
ENAEL    DS    XL1                 ELEMENT CODE                                 
ENAELQ   EQU   X'AA'                                                            
ENALN    DS    XL1                 ELEMENT LENGTH (L'NAME + 3)                  
ENANUM   DS    XL1                 FIELD NUMBER                                 
ENAME    DS    0C                  ESTIMATE NAME                                
         SPACE 1                                                                
EAPELD   DSECT                     ** ESTIMATE APPROVAL ELEMENT **              
*++IDENTIFIER                                                                   
EAPEL    DS    XL1                 ELEMENT CODE                                 
EAPELQ   EQU   X'AB'                                                            
EAPLN    DS    XL1                 ELEMENT LENGTH                               
EAPINP   DS    PL3                 DATE INPUT                                   
EAPPBY   DS    CL8                 PERSON APPROVING (SPACE PADDED)              
EAPDATE  DS    PL3                 APPROVAL DATE                                
         DS    XL4                 N/D                                          
*++ASSOCIATED EAPLN                                                             
EAPLNQ   EQU   *-EAPELD            ESTIMATE APPROVAL ELEMENT LENGTH             
         SPACE 1                                                                
EDAELD   DSECT                     ** ESTIMATE DATA ELEMENT **                  
*++IDENTIFIER                                                                   
EDAEL    DS    XL1                 ELEMENT CODE                                 
EDAELQ   EQU   X'AC'                                                            
EDALN    DS    XL1                 ELEMENT LENGTH                               
EDATYPE  DS    XL1                 DATA TYPE                                    
EDATWORK EQU   X'01'               WORKCODE ESTIMATE IN CENTS                   
EDATSUB  EQU   X'02'               SUB-WORKCODE                                 
EDATPLIS EQU   X'04'               PRICE LISTS USED                             
EDATCOHE EQU   X'08'               COMMISSION HELD ON ELEMENT                   
EDATTEST EQU   X'10'               TIME ESTIMATE WORK CODE                      
EDATA    DS    0C                  ESTIMATE DATA                                
         ORG   EDATA                                                            
EDAWORK  DS    CL2                 WORKCODE                                     
EDACOMM  DS    PL6                 COMMISSIONABLE ESTIMATE                      
*++ASSOCIATED EDALN                                                             
EDALNQ1  EQU   *-EDAELD            ELEMENT LENGTH FOR COMM ESTIMATE             
EDANCOM  DS    PL6                 NON-COMMISSIONABLE ESTIMATE                  
*++ASSOCIATED EDALN                                                             
EDALNQ2  EQU   *-EDAELD            ELEMENT LENGTH FOR NON-COM EST               
EDASUBC  DS    XL1                 SUB-WORKCODE NUMBER                          
*++ASSOCIATED EDALN                                                             
EDALNQ3  EQU   *-EDAELD                                                         
EDAHOURS DS    PL4                 NUMBER OF HOURS (IF EDATTEST ON)             
*++ASSOCIATED EDALN                                                             
EDALN4Q  EQU   *-EDAELD                                                         
         ORG   EDAHOURS                                                         
EDAPLIST DS    0CL12               PRICE LIST                                   
EDAPCOD  DS    CL4                 PRICE LIST CODE                              
EDAPNUM  DS    XL2                 MULTIPLE                                     
EDAPAMT  DS    PL6                 PRICE LIST AMOUNT                            
*++ASSOCIATED EDALN                                                             
EDALN5Q  EQU   *-EDAELD                                                         
         SPACE 1                                                                
PPAELD   DSECT                     ** PANEL HEADER ELEMENT **                   
*++IDENTIFIER                                                                   
PPAEL    DS    XL1                 ELEMENT CODE                                 
PPAELQ   EQU   X'AD'                                                            
PPALN    DS    XL1                 ELEMENT LENGTH                               
PPANAME  DS    CL20                PANEL NAME                                   
PPAADD   DS    PL3                 DATE ADDED                                   
PPAPERS  DS    CL8                 PERSON WHO MADE LAST CHANGE                  
PPALAST  DS    PL3                 DATE LAST CHANGED                            
PPAWHAT  DS    CL1                 A=ADD,C=COPY,R=RENAME,F=FIELD MAINT          
         DS    XL8                 N/D                                          
*++ASSOCIATED PPALN                                                             
PPALNQ   EQU   *-PPAELD            ELEMENT LENGTH                               
         SPACE 1                                                                
FLDELD   DSECT                     ** FIELD DATA ELEMENT **                     
*++IDENTIFIER                                                                   
FLDEL    DS    XL1                 ELEMENT CODE                                 
FLDELQ   EQU   X'AE'                                                            
FLDLN    DS    XL1                 ELEMENT LENGTH                               
FLDSEQ   DS    XL1                 SEQUENCE NUMBER                              
FLDSROW  DS    XL1                 SCREEN ROW                                   
*                                  X'80' ON=AUTOMATIC ROW CALCULATION           
*                                  X'40' ON=PLUS N ROWS FEATURE ACTIVE          
*                                  9-24 = SPECIFIC ROW                          
FLDSCOL  DS    XL1                 SCREEN COLUMN                                
FLDSLEN  DS    XL1                 SCREEN FIELD LENGTH                          
FLDSATTR DS    XL1                 ATTRIBUTE BYTE                               
FLDKEY   DS    CL4                 FIELD DATA KEYWORD                           
         DS    XL3                 N/D                                          
*                                                                               
FLDPLIN  DS    XL1                 PRINT LINE                                   
FLDPCOL  DS    XL1                 PRINT COLUMN                                 
FLDPDTY  DS    CL1                 PRINT DATA TYPE                              
FLDPDCHR EQU   C'C'                CHARACTER STRING                             
FLDPDINT EQU   C'I'                INTERNALLY GENERATED                         
FLDPDLN  DS    XL1                 PRINT DATA LENGTH (OPTIONAL)                 
         DS    XL2                 N/D                                          
FLDSCR   DS    0C                  SCREEN DATA                                  
FLDPRT   DS    0C                  PRINT LINE DATA                              
         SPACE 1                                                                
THDELD   DSECT                     ** TEXT HEADER ELEMENT **                    
*++IDENTIFIER                                                                   
THDEL    DS    XL1                 ELEMENT CODE                                 
THDELQ   EQU   X'AF'                                                            
THDLN    DS    XL1                 ELEMENT LENGTH                               
THDPAN   DS    CL4                 PANEL CODE                                   
THDCOM   DS    CL6                 STANDARD COMMENT REFERENCE                   
         DS    XL6                 N/D                                          
*++ASSOCIATED THDLN                                                             
THDLNQ   EQU   *-THDELD            ELEMENT LENGTH                               
         SPACE 1                                                                
TFDELD   DSECT                     ** TEXT FIELD DATA ELEMENT **                
*++IDENTIFIER                                                                   
TFDEL    DS    XL1                 ELEMENT CODE                                 
TFDELQ   EQU   X'B0'                                                            
TFDLN    DS    XL1                 ELEMENT LENGTH                               
TFDTYPE  DS    XL1                 ELEMENT TYPE                                 
TFDTPAN  EQU   1                   PANEL                                        
TFDTREG  EQU   2                   REGULAR TEXT                                 
TFDFLD   DS    CL4                 FIELD KEYWORD (PANEL TEXT)                   
         ORG   TFDFLD                                                           
TFDSEQ   DS    XL1                 SEQUENCE NUMBER (REGULAR TEXT)               
         ORG                                                                    
TFDTEXT  DS    0C                  TEXT DATA                                    
         SPACE 1                                                                
EPRELD   DSECT                     ** ESTIMATE PREPARER ELEMENT **              
*++IDENTIFIER                                                                   
EPREL    DS    XL1                 ELEMENT CODE                                 
EPRELQ   EQU   X'B1'                                                            
EPRLN    DS    XL1                 ELEMENT LENGTH                               
EPRINP   DS    PL3                 DATE INPUT                                   
EPRPREP  DS    CL8                 PREPARER                                     
EPRDATE  DS    PL3                 PREPARED DATE                                
         DS    CL4                 N/D                                          
*++ASSOCIATED EPRLN                                                             
EPRLNQ   EQU   *-EPRELD            ELEMENT LENGTH                               
         SPACE 1                                                                
BESELD   DSECT                     ** BILLING ESTIMATE ELEMENT **               
*++IDENTIFIER                                                                   
BESEL    DS    XL1                 ELEMENT CODE                                 
BESELQ   EQU   X'B2'                                                            
BESLN    DS    XL1                 ELEMENT LENGTH                               
BESWC    DS    CL3                 WORKCODE                                     
         ORG   BESWC                                                            
BESWORK  DS    CL2                 WORKCODE                                     
         DS    XL1                                                              
BESPEBC  DS    PL6                 NET AMOUNT                                   
BESPEBCG DS    PL6                 GROSS AMOUNT                                 
BESVAT   DS    CL1                 VAT CODE                                     
*++ASSOCIATED BESLN                                                             
BESLNQ   EQU   *-BESELD            ELEMENT LENGTH                               
BESPST   DS    CL1                 PST CODE                                     
BESPRV   DS    CL2                 PROVINCE CODE                                
*++ASSOCIATED BESLN                                                             
BESLN2Q  EQU   *-BESELD            ELEMENT LENGTH                               
         SPACE 1                                                                
MNAELD   DSECT                     ** MEDIA NAME ELEMENT **                     
*++IDENTIFIER                                                                   
MNAEL    DS    XL1                 ELEMENT CODE                                 
MNAELQ   EQU   X'B3'               MEDIA NAME                                   
MNALN    DS    XL1                 ELEMENT LENGTH                               
MNACODE  DS    CL1                 MEDIA CODE                                   
MNATYPE  DS    CL1                 NAME TYPE                                    
MNABILL  EQU   C'B'                BILLING                                      
MNAEST   EQU   C'E'                ESTIMATE                                     
         DS    XL1                 N/D                                          
MNAME    DS    0CL36               NAME                                         
         SPACE 1                                                                
BDAELD   DSECT                     ** BILLING DATA ELEMENT **                   
*++IDENTIFIER                                                                   
BDAEL    DS    XL1                 ELEMENT CODE                                 
BDAELQ   EQU   X'B4'                                                            
BDALN    DS    XL1                 ELEMENT LENGTH                               
BDAFORM  DS    CL1                 FORMAT                                       
BDALVL   DS    CL1                 LEVEL                                        
BDAFDTE  DS    PL2                 FROM DATE (YM)                               
BDATDTE  DS    PL2                 TO DATE (YM)                                 
BDATYPE  DS    CL1                 BILLING TYPE                                 
BDARUN   DS    PL3                 RUN DATE (PWO)                               
BDADUE   DS    PL3                 DUE DATE (PWO)                               
BDARCVA  DS    CL15                RECEIVABLE ACCOUNT                           
BDARCVO  DS    CL2                 RECEIVABLE OFFICE                            
BDAUNUM  DS    CL6                 UNBILL NUMBER                                
BDAUNDT  DS    PL3                 UNBILL DATE (PWO)                            
         DS    XL6                 N/D                                          
BDAPAY   DS    PL6                 PAYABLE AMOUNT (SJ)                          
BDAREC   DS    PL6                 RECEIVABLE AMOUNT (SR)                       
BDAINC   DS    PL6                 INCOME AMOUNT (12-REVENUE)                   
BDAGRS   DS    PL6                 GROSS AMOUNT (11-BILLINGS)                   
BDACSH   DS    PL6                 CASH DISCOUNT                                
BDAINT   DS    PL6                 INTERNAL INCOME (SK REVERSAL)                
BDATME   DS    PL6                 TIME (WORKCODE TYPE=T)                       
BDAOOP   DS    PL6                 OUT-OF-POCKET (W/T=O)                        
BDAPRV   DS    PL6                 PREVIOUSLY BILLED (W/T=P, B/T=48)            
BDAPRE   DS    PL6                 PRE-BILLING (W/T=P)                          
         DS    XL12                N/D                                          
*++ASSOCIATED BDALN                                                             
BDALNQ   EQU   *-BDAELD                                                         
         SPACE 1                                                                
JNAELD   DSECT                     ** JOB NUMBER ELEMENT **                     
*++IDENTIFIER                                                                   
JNAEL    DS    XL1                 ELEMENT CODE                                 
JNAELQ   EQU   X'B5'                                                            
JNALN    DS    XL1                 ELEMENT LENGTH                               
JNAP2N   DS    CL18                NAME FOR POSITION 2                          
JN1P2    DS    CL2                 DATA TYPE FOR POSITION 2                     
JNAP3N   DS    CL18                NAME FOR POSITION 3                          
JNAP3    DS    CL2                 DATA TYPE FOR POSITION 3                     
JNAP4N   DS    CL18                NAME FOR POSITION 4                          
JNAP4    DS    CL2                 DATA TYPE FOR POSITION 4                     
JNAP5N   DS    CL18                NAME FOR POSITION 5                          
JNAP5    DS    CL2                 DATA TYPE FOR POSITION 5                     
JNAP6N   DS    CL18                NAME FOR POSITION 6                          
JNAP6    DS    CL2                 DATA TYPE FOR POSITION 6                     
JNASTRT  DS    CL5                 STARTING SEQUENTIAL NUMBER                   
JNALNUM  DS    CL12                LAST NUMBER USED                             
JNAMANS  DS    CL5                 MANUAL INVOICE START RANGE                   
JNAMANE  DS    CL5                 MANUAL INVOICE END RANGE                     
         DS    XL10                N/D                                          
*++ASSOCIATED JNALN                                                             
JNALNQ   EQU   *-JNAELD                                                         
         SPACE 1                                                                
BNCELD   DSECT                     ** BILL NUMBER CYCLE ELEMENT **              
*++IDENTIFIER                                                                   
BNCEL    DS    CL1                 ELEMENT CODE                                 
BNCELQ   EQU   X'B6'                                                            
BNCLN    DS    CL1                 ELEMENT LENGTH                               
BNCFBIL  DS    CL6                 FIRST BILL NUMBER                            
BNCLBIL  DS    CL6                 LAST BILL NUMBER                             
BNCRSET  DS    CL4                 RESET BILL NUMBER                            
*++ASSOCIATED BNCLN                                                             
BNCLN1Q  EQU   *-BNCELD                                                         
         SPACE 1                                                                
*&&US                                                                           
INCELD   DSECT                     ** INTERNAL INCOME ELEMENT **                
*++IDENTIFIER                                                                   
INCEL    DS    XL1                 ELEMENT CODE                                 
INCELQ   EQU   X'B7'                                                            
INCLN    DS    XL1                 ELEMENT LENGTH                               
INCWRKC  DS    CL3                 WORKCODE                                     
         ORG   INCWRKC                                                          
INCWORK  DS    CL2                 WORKCODE                                     
         DS    XL1                 N/D                                          
INCAMNT  DS    PL6                 CURRENT BILLING LESS PREVIOUS                
INCDATE  DS    PL3                 DATE USED                                    
INCACCT  DS    CL14                INCOME ACCOUNT                               
         DS    XL6                 N/D                                          
*++ASSOCIATED INCLN                                                             
INCLNQ   EQU   *-INCELD                                                         
         ORG   INCACCT                                                          
INCCACC  DS    CL14                CREDIT INCOME ACCOUNT                        
INCDACC  DS    CL14                DEBIT INCOME ACCOUNT                         
INCINAM  DS    PL6                 INCOME AMOUNT                                
*++ASSOCIATED INCLN                                                             
INCLN2Q  EQU   *-INCELD                                                         
*&&                                                                             
         SPACE 1                                                                
BCYELD   DSECT                     ** BILLING CYCLE ELEMENT **                  
*++IDENTIFIER                                                                   
BCYEL    DS    XL1                 ELEMENT CODE                                 
BCYELQ   EQU   X'B8'                                                            
BCYLN    DS    XL1                 ELEMENT LENGTH                               
BCYCLE   DS    XL1                 CYCLE NUMBER                                 
BCYMON   DS    PL2                 BILLING YEAR/MONTH (PWO)                     
BCYPER   DS    XL2                 CYCLE PERCENTAGE (0=TOTAL BILLING)           
BCYDESC  DS    CL20                CYCLE DESCRIPTION                            
BCYREF   DS    CL6                 BILLING REFERENCE NUMBER                     
BCYBILD  DS    XL2                 CYCLE BILLED DATE(COMPRESSED)                
BCYUNBD  DS    XL2                 CYCLE UNBILLED DATE(COMPRESSED)              
BCYESTA  DS    PL6                 CURRENT ESTIMATE AMOUNT WHEN BILLED          
BCYBILA  DS    PL6                 BILLED AMOUNT                                
BCYSTAT  DS    XL1                 STATUS BYTE                                  
BCYSMON  EQU   X'01'               BILL FOR BCYMON AND AFTER                    
         DS    XL10                N/D                                          
*++ASSOCIATED BCYLN                                                             
BCYLNQ   EQU   *-BCYELD                                                         
         SPACE 1                                                                
STUELD   DSECT                     ** STUDIO DATA ELEMENT **                    
*++IDENTIFIER                                                                   
STUEL    DS    XL1                 ELEMENT CODE                                 
STUELQ   EQU   X'B9'                                                            
STULN    DS    XL1                 ELEMENT LENGTH (N*L'STUOCLN+18)              
STUMED   DS    XL1                 MEDIA CODE                                   
STUVEND  DS    CL15                VENDOR NUMBER                                
STUOCLN  DS    0CL5                OFFICE/CLIENT LIST                           
STUOFF   DS    CL2                 OFFICE CODE                                  
STUCLN   DS    CL3                 CLIENT CODE                                  
*++ASSOCIATED STULN                                                             
STULNQ   EQU   *-STUELD                                                         
         SPACE 1                                                                
LNKELD   DSECT                     ** LINK DATA ELEMENT **                      
*++IDENTIFIER                                                                   
LNKEL    DS    XL1                 ELEMENT CODE                                 
LNKELQ   EQU   X'BA'                                                            
LNKLN    DS    XL1                 ELEMENT LENGTH                               
LNKSTUD  DS    XL4                 STUDIO TYPE                                  
LNKSTJB  DS    CL12                STUDIO JOB                                   
LNKAGJB  DS    CL12                AGENCY JOB                                   
*++ASSOCIATED LNKLN                                                             
LNKLNQ   EQU   *-LNKELD                                                         
         SPACE 1                                                                
PRCELD   DSECT                     ** PRICE LIST ELEMENT **                     
*++IDENTIFIER                                                                   
PRCEL    DS    XL1                 ELEMENT CODE                                 
PRCELQ   EQU   X'BB'                                                            
PRCLN    DS    XL1                 ELEMENT LENGTH                               
PRCSEQ   DS    XL1                 SEQUENCE NUMBER                              
PRCSUNT  DS    PL3                 START UNITS                                  
PRCEUNT  DS    PL3                 END UNITS                                    
PRCPRC1  DS    PL4                 PRICE 1                                      
PRCPRC2  DS    PL4                 PRICE 2                                      
PRCPRC3  DS    PL4                 PRICE 3                                      
PRCPRC4  DS    PL4                 PRICE 4                                      
*++ASSOCIATED PRCLN                                                             
PRCLNQ   EQU   *-PRCELD                                                         
         SPACE 1                                                                
EPTELD   DSECT                     ** ESTIMATE PERSON TIME **                   
*++IDENTIFIER                                                                   
EPTEL    DS    XL1                 ELEMENT CODE                                 
EPTELQ   EQU   X'BC'                                                            
EPTLN    DS    XL1                 ELEMENT LENGTH                               
EPTULA   DS    0XL14               PERSON ACCOUNT CODE                          
EPTUNT   DS    CL1                 UNIT                                         
EPTLDG   DS    CL1                 LEDGER                                       
EPTACT   DS    CL12                ACCOUNT                                      
EPTRDATE DS    PL3                 EFFECTIVE DATE FOR RATE OR ZEROES            
EPTINDS  DS    XL1                 INDICATORS                                   
EPTIOVER EQU   X'80'               RATE OVERRIDDEN ON INPUT SCREEN              
EPTIHOUR EQU   X'40'               HOURS INSTEAD OF DESCRIPTION                 
EPTHOURS DS    PL4                 NUMBER OF HOURS (2DP)                        
EPTRATE  DS    PL4                 COST/CHARGE RATE (2DP)                       
         DS    XL4                 N/D                                          
*++ASSOCIATED EPTLN                                                             
EPTLN1Q  EQU   *-EPTELD                                                         
EPTDESC  DS    0CL36               PERSON DESC. (NAME, TITLE ETC.)              
         ORG   EPTHOURS                                                         
EPTNHRS  DS    PL4                 N TIME HOURS (2DP) (PRESTO ONLY)             
EPTBHRS  DS    PL4                 B TIME HOURS (2DP) (PRESTO ONLY)             
EPTRHRS  DS    PL4                 R TIME HOURS (2DP) (PRESTO ONLY)             
EPTPRTE  DS    PL4                 PERSON RATE (2DP)  (PRESTO ONLY)             
EPTAMNT  DS    PL6                 EXTENDED AMOUNT (2DP) (PRESTO ONLY)          
*++ASSOCIATED EPTLN                                                             
EPTLN2Q  EQU   *-EPTELD                                                         
         SPACE 1                                                                
XTHELD   DSECT                     ** TEMPO HEADER ELEMENT **                   
*++IDENTIFIER                                                                   
XTHEL    DS    XL1                 ELEMENT CODE                                 
XTHELQ   EQU   X'BD'                                                            
XTHLN    DS    XL1                 ELEMENT LENGTH                               
XTHSTDTE DS    PL3                 START DATE                                   
XTHEND   DS    PL3                 END   DATE                                   
XTHSTAT  DS    XL1                 TIMESHEET STATUS                             
XTHWIP   EQU   1                   - WORK IN PROGRESS                           
XTHSNS   EQU   2                   - SIGN AND SUBMIT                            
XTHOAPP  EQU   3                   - OPTIONAL APPROVE                           
XTHQUE   EQU   4                   - QUEUED FOR UPLOAD                          
XTHSDTE  DS    PL3                 SUBMIT  DATE                                 
XTHSPID  DS    CL9                 SUBMIT  PERSONAL ID                          
XTHADTE  DS    PL3                 APPROVE DATE                                 
XTHAPID  DS    CL9                 APPROVE PERSONAL ID                          
XTHUDTE  DS    PL3                 UPLOAD  DATE                                 
XTHUPID  DS    CL9                 UPLOAD  PERSONAL ID                          
XTHPERD  DS    XL1                 PERIOD NUMBER                                
XTHERR   DS    CL6                 UPLOAD ERROR                                 
         DS    XL3                 N/D                                          
*++ASSOCIATED XTHEL                                                             
XTHLNQ   EQU   *-XTHELD                                                         
         SPACE 1                                                                
XTCELD   DSECT                     ** TEMPO COMMUTER CODE ELEMENT **            
*++IDENTIFIER                                                                   
XTCEL    DS    XL1                 ELEMENT CODE                                 
XTCELQ   EQU   X'BE'                                                            
XTCLN    DS    XL1                 ELEMENT LENGTH                               
XTCSEQ   DS    XL1                 SEQUENTIAL ELEMENTS                          
XTCMINI  DS    XL1                 NUMBER OF MINI ELEMENTS                      
*++ASSOCIATED XTCEL                                                             
XTCLN1Q  EQU   *-XTCELD                                                         
XTCDATA  DS    0C                  DAY AND COMMUTER CODE MINI ELEMENT           
XTCMLEN  DS    XL1                 LENGTH OF MINI ELEMENT                       
XTCDAY   DS    XL1                 DAY                                          
XTCCOM   DS    CL3                 COMMUTER CODE                                
*++ASSOCIATED XTCLN                                                             
XTCLN2Q  EQU   *-XTCDATA           LENGTH OF MINI ELEMENT OVERHEAD              
XTCNAR   DS    0C                  NARRATIVE (IF ANY)                           
         SPACE 1                                                                
XTMELD   DSECT                     ** TEMPO LINE DETAIL ELEMENT **              
*++IDENTIFIER                                                                   
XTMEL    DS    XL1                 ELEMENT CODE                                 
XTMELQ   EQU   X'BF'                                                            
XTMLN    DS    XL1                 ELEMENT LENGTH                               
XTMLIN   DS    XL2                 LINE NUMBER                                  
XTMTYP   DS    XL1                 LINE INFO TYPE                               
XTMTDET  EQU   1                   - DETAIL LINE INFO                           
XTMTNAR  EQU   2                   - COMMENT                                    
XTMTLIN  EQU   3                   - LINE ALLOCATION - DAY/SWIPE                
XTMACT   DS    CL14                SJ OR 1N ACCOUNTS                            
XTMTSK   DS    CL2                 TASK                                         
XTMTIM   DS    CL1                 TYPE OF TIME(B/R/N)                          
XTMIND   DS    CL1                 TIME INDICATOR                               
XTMIADJ  EQU   X'80'               - ADJUSTMENT                                 
XTMIWO   EQU   X'40'               - WRITE OFF                                  
XTMRTE   DS    PL4                 RATE                                         
XTMINC   DS    CL14                SI/SK ACCOUNTS                               
XTMPOFF  DS    CL2                 PRODUCTION OFFICE                            
XTMHRS   DS    PL3                 HOURS                                        
XTMMOA   DS    PL2                 MONTH OF ACTIVITY                            
*++ASSOCIATED XTMLN                                                             
XTMLN1Q  EQU   *-XTMELD                                                         
         ORG   XTMACT              LINE ALLOCATION - DAY                        
XTMMINI  DS    XL1                 NUMBER OF MINIS FOR DAY                      
*++ASSOCIATED XTMLN                                                             
XTMLN2Q  EQU   *-XTMELD                                                         
XTMDATA  DS    0C                  DAY AND HOURS                                
XTMMSTAT DS    XL1                 MINI STATUS                                  
XTMMSWPQ EQU   X'80'               MINI IS A SWIPE                              
XTMDAY   DS    XL1                 DAY                                          
XTMBLK   DS    0PL4                HOURS FOR DAY (NON-SWIPE)                    
XTMSTR   DS    XL2                 START OF SWIPE                               
XTMEND   DS    XL2                 END OF SWIPE                                 
*++ASSOCIATED XTMLN                                                             
XTMLN3Q  EQU   *-XTMDATA                                                        
         ORG   XTMACT              LINE ALLOCATION - COMMENT                    
*++ASSOCIATED XTMLN                                                             
XTMLN4Q  EQU   *-XTMELD            LENGTH OF NARRATIVE ELEMENT                  
XTMNAR   DS    0C                  NARRATIVE                                    
         SPACE 1                                                                
APEELD   DSECT                     ** ANALYSIS POINTER ELEMENT **               
*++IDENTIFIER                                                                   
APEEL    DS    XL1                 ELEMENT CODE                                 
APEELQ   EQU   X'C0'                                                            
APELN    DS    XL1                 ELEMENT LENGTH                               
APENUM   DS    XL1                 NUMBER OF ANALYSIS SUB-ELEMENTS              
*++ASSOCIATED APELN                                                             
APELN1Q  EQU   *-APEELD                                                         
*                                                                               
APENTRY  DS    0X                  ANALYSIS SUB-ELEMENT                         
APENLEN  DS    XL1                 LENGTH OF SUB-ELEMENT                        
APENSTAT DS    XL1                 STATUS                                       
APENSDR  EQU   X'80'               TRANSACTION IS A DEBIT                       
*++ASSOCIATED APELN                                                             
APELN2Q  EQU   *-APENTRY                                                        
APENACT  DS    0XL14               ACCOUNT CODE                                 
         SPACE 1                                                                
RHDELD   DSECT                     ** R.L. HEADLINE DATA **                     
*++IDENTIFIER                                                                   
RHDEL    DS    XL1                 ELEMENT CODE                                 
RHDELQ   EQU   X'C1'                                                            
RHDLN    DS    XL1                 ELEMENT LENGTH (VARIABLE)                    
RHDTYPE  DS    XL1                 DATA TYPE                                    
RHDTITL  EQU   1                   TITLE                                        
RHDCNTR  EQU   2                   CENTER                                       
RHDLFTH  EQU   3                   LEFT HEADLINE                                
RHDRHTH  EQU   4                   RIGHT HEADLINE                               
RHDFTLN  EQU   5                   FOOTLINE                                     
RHDLIST  EQU   15                  LIST FOR FILTERING                           
RHDSEQ   DS    XL1                 SEQUENCE (I.E. CENTER 1, 2 OR 3)             
RHDFRM   DS    XL1                 DATA FORM                                    
RHDFREE  EQU   X'80'               FREE FORM                                    
RHDDEF   EQU   X'40'               DATA DEFINITION                              
RHDROW   EQU   X'20'               HEADING FROM ROW                             
RHDADR   EQU   X'04'               NEED ADDRESS IN HEADING                      
RHDPRFX  EQU   X'02'               HEADING PREFIX DATA                          
RHDDICT  EQU   X'01'               DICTIONARY CONVERSION                        
RHDPSEQ  DS    XL1                 PRINTING SEQUENCE                            
         DS    XL8                 N/D                                          
RHDXDATA DS    XL1                                                              
*++ASSOCIATED RHDLN                                                             
RHDLNQ   EQU   *-RHDEL             LENGTH UP TO THE DATA                        
RHDDATA  DS    0CL36               DATA                                         
         SPACE 1                                                                
RRWELD   DSECT                     ** R.L. ROW DATA **                          
*++IDENTIFIER                                                                   
RRWEL    DS    XL1                 ELEMENT CODE                                 
RRWELQ   EQU   X'C2'                                                            
RRWLN    DS    XL1                 ELEMENT LENGTH                               
RRWSEQ   DS    XL1                 SEQUENCE (ROW NUMBER)                        
RRWOPT   DS    XL1                 ROW OPTIONS                                  
RRWTOT   EQU   X'80'               ROW TOTAL                                    
RRWPAGE  EQU   X'40'               HEADLINE ,NEW PAGE ON ROW CHANGE             
RRWNAME  EQU   X'20'               ROW NAME                                     
RRWCODE  EQU   X'10'               ROW CODE                                     
RRWTOTSP EQU   X'08'               ROW TOTAL, NEW PAGE FOR ROW TOTAL            
RRWADR   EQU   X'04'               ROW ADDRESS                                  
RRWMDTE  EQU   X'03'               ROW BY MOA DATE                              
RRWBDTE  EQU   X'02'               ROW BY BILL DATE                             
RRWDDTE  EQU   X'01'               ROW BY DUE DATE                              
RRWTYPE  DS    XL1                 (R,C,L)-HEADLINE  M-MIDLINE  BLANK           
RRWCOL   EQU   C'*'                ROW COLUMN                                   
RRWMID   EQU   C'M'                MIDLINE                                      
RRWLHEAD EQU   C'L'                LEFT HEADLINE                                
RRWCHEAD EQU   C'C'                CENTER HEADLINE                              
RRWRHEAD EQU   C'R'                RIGHT HEADLINE                               
RRWOPT2  DS    XL1                 OTHER ROW OPTIONS                            
RRWPGNO  EQU   X'80'               RESET PAGE NUMBERS                           
RRWBTM   EQU   X'40'               PRINT TOTAL ON BOTTOM OF PAGE                
RRWHIDE  EQU   X'20'               DON'T SHOW THIS ROW ON REPORT                
RRWMERGE EQU   X'10'               MERGE DATA IF SELECTED $COLS=ZERO            
RRWLVL   EQU   X'08'               ROW CODE LEVEL                               
RRWSHRT  EQU   X'02'               ROW WORK CODE SHORT DESCRIPTION              
RRWDICT  EQU   X'01'               DICTIONARY CONVERSION                        
RRWDATES DS    XL1                 DATE BASES                                   
RRWBMOA  EQU   1                   BILLED MOA                                   
RRWBLDT  EQU   2                   BILLED DATE                                  
RRWMODT  EQU   3                   MOA DATE                                     
RRWADTE  EQU   4                   ACTIVITY DATE                                
RRWTRDT  EQU   5                   TRANSACTION DATE                             
RRWDUDT  EQU   6                   DUE DATE                                     
RRWSADT  EQU   7                   STATEMENT DATE                               
RRWPHIS  EQU   8                   PAYROLL HISTORY DATE                         
RRWPSEQ  DS    XL1                 PRINT SEQUENCE                               
RRWSPCL  DS    XL1                 SPECIAL KEYWORD                              
RRWSPCTL EQU   RCLSPCTL            3 EMBEDDED # IN JOBBER KEYWORD               
RRWSPCT# EQU   RCLSPCT#            4 NON-JOBBER KEYWORD WITH EMBEDED #          
RRWSPLV1 EQU   RCLSPLV1            C'1' ACCOUNT LEVEL 1                         
RRWSPLV2 EQU   RCLSPLV2            C'2' ACCOUNT LEVEL 2                         
RRWSPLV3 EQU   RCLSPLV3            C'3' ACCOUNT LEVEL 3                         
RRWSPLV4 EQU   RCLSPLV4            C'4' ACCOUNT LEVEL 4                         
RRWDATLN DS    XL1                 LENGTH OF RRWNDATA                           
RRWPFXLN DS    XL1                                                              
         DS    XL2                 N/D                                          
RRWXDATA DS    XL1                                                              
RRWDATA  DS    CL12                ROW DATA                                     
*++ASSOCIATED RRWLN                                                             
RRWLNQ   EQU   *-RRWELD            ELEMENT LENGTH                               
RRWPRFX  DS    0CL14               ROW PREFIX                                   
         ORG   RRWDATA                                                          
         DS    XL3                                                              
*++ASSOCIATED RRWLN                                                             
RRWNLNQ  EQU   *-RRWEL                                                          
RRWNDATA DS    0CL21                                                            
RRWNPRFX DS    0CL14                                                            
         SPACE 1                                                                
RCLELD   DSECT                     ** R.L. COLUMN DATA **                       
*++IDENTIFIER                                                                   
RCLEL    DS    XL1                 ELEMENT CODE                                 
RCLELQ   EQU   X'C3'                                                            
RCLLN    DS    XL1                 ELEMENT LENGTH                               
RCLSEQ   DS    XL1                 SEQUENCE (COLUMN NUMBER)                     
RCLWDTH  DS    XL1                 COLUMN WIDTH                                 
RCLOPT   DS    XL1                 COLUMN OPTIONS                               
RCLACCM  EQU   X'80'               ACCUMULATED COLUMN                           
RCLEQU   EQU   X'40'               CALCULATED COLUMN                            
RCLHIDE  EQU   X'20'               HIDDEN COLUMN                                
RCLMDTE  EQU   X'18'               BY MOA DATE                                  
RCLBDTE  EQU   X'10'               BY BILL DATE                                 
RCLDDTE  EQU   X'08'               BY DUE DATE                                  
RCLPCT   EQU   X'04'               PERCENTAGE COLUMN                            
RCLNOTOT EQU   X'02'               SUPRESS TOTAL FOR COLUMN                     
RCLSUPP  EQU   X'01'               SUPPRESS COLUMN DETAIL                       
RCLOPT2  DS    XL1                 COLUMN ROW OPTIONS                           
RCLTOT   EQU   X'80'               TOTAL ON COLUMN                              
RCLJOBR  EQU   X'40'               JOBBER TYPE COLUMN                           
RCLNAME  EQU   X'20'               COLUMN NAME                                  
RCLCODE  EQU   X'10'               COLUMN CODE                                  
RCLLVL   EQU   X'08'               COLUMN LEVEL CODE                            
RCLDICT  EQU   X'04'               DICTIONARY CONVERSION                        
RCLSHRT  EQU   X'02'               COLUMN SHOURT WORK CODE DESCRIPTION          
RCLCZERO EQU   X'01'               ELIMINATE RECORDS IF COL=ZERO                
RCLSORTN DS    XL1                 SORT SEQUENCE NUMBER                         
*                                                                               
RCLPARA  DS    0XL8                PARAMETER LIST                               
RCLSPCL  DS    XL1                 SPECIAL COLUMN                               
RCLSPEXR EQU   1                   EXCHANGE RATE                                
RCLSPCME EQU   2                   CUME                                         
RCLSPCTL EQU   3                   EMBEDED # IN JOBBER KEYWORD                  
RCLSPCT# EQU   4                   NON-JOBBER KEYWORD WITH EMBEDED #            
RCLSPDTE EQU   8                   DATE1-DATE2 CALCULATION                      
RCLSPKY1 EQU   27                  DATE RANGE USED IN NON$ KEYWORD              
RCLSPLV1 EQU   C'1'                ACCOUNT LEVEL 1                              
RCLSPLV2 EQU   C'2'                ACCOUNT LEVEL 2                              
RCLSPLV3 EQU   C'3'                ACCOUNT LEVEL 3                              
RCLSPLV4 EQU   C'4'                ACCOUNT LEVEL 4                              
RCLSTACK DS    XL1                 STACK COLUMN UNDER COL#                      
RCLDATES DS    XL1                 DATE BASES                                   
RCLBMOA  EQU   1                   BILLED MOA                                   
RCLBLDT  EQU   2                   BILLED DATE                                  
RCLMODT  EQU   3                   MOA DATE                                     
RCLADTE  EQU   4                   ACTIVITY DATE                                
RCLTRDT  EQU   5                   TRANSACTION DATE                             
RCLDUDT  EQU   6                   DUE DATE                                     
RCLSADT  EQU   7                   STATEMENT DATE                               
RCLPHIS  EQU   8                   PAYROLL HISTORY DATE                         
RCLDTEFG DS    XL1                 DATE FLAG                                    
RCLTODTE EQU   X'80'               EITHER PERIOD OR YTD / QTD                   
RCLNROLL EQU   X'40'               NON-ROLLING PARAMETER (M1-M12,Q1-Q4)         
RCLCNDR  EQU   X'20'               CALANDER BASED (DEACTIVATED BIT)             
RCLBBF   EQU   X'20'               BALANCE FORWARD                              
RCLPERD  EQU   X'10'               CALANDER PERIODS                             
RCLYEAR  EQU   X'08'               YEAR FLAG                                    
RCLQTR   EQU   X'04'               QUARTER FLAG                                 
RCLMON   EQU   X'02'               MONTH FLAG                                   
RCLDAY   EQU   X'01'               DAY FLAG                                     
RCLSTDT  DS    XL2                 BINARY NUMBER FOR START DATE RANGE           
         ORG   RCLSTDT                                                          
RCLPDYR  DS    XL1                 CALANDER PERIOD + OR - ONE YEAR              
RCLPDN1  DS    XL1                 CALANDER PERIOD NUMBER                       
RCLENDT  DS    XL2                 BINARY NUMBER FOR END DATE RANGE             
*                                                                               
RCLDATA  DS    CL12                COLUMN DATA                                  
*++ASSOCIATED RCLLN                                                             
RCLLNQ   EQU   *-RCLELD            ELEMENT LENGTH (WITHOUT HEADLINE)            
RCLHDL1  DS    CL12                COLUMN HEADLINE 1                            
*++ASSOCIATED RCLLN                                                             
RCLLNQ1  EQU   *-RCLELD            ELEMENT LENGTH (WITH 1 HEADLINE)             
RCLHDL2  DS    CL12                COLUMN HEADLINE 2                            
*++ASSOCIATED RCLLN                                                             
RCLLNQ2  EQU   *-RCLELD            ELEMENT LENGTH (WITH 2 HEADLINES)            
         ORG   RCLDATA                                                          
RCLDATLN DS    XL1                 LENGTH OF DATA INPUT                         
RCLHD1LN DS    XL1                 LENGTH OF HEADING 1                          
RCLHD2LN DS    XL1                 LENGTH OF HEADING 2                          
RCLEDOPT DS    XL1                                                              
RCLEDCMY EQU   X'80'               YES - PRINT USING COMMAS                     
RCLEDTRL EQU   X'40'               TRAILING MINUS SIGN                          
RCLEDZRY EQU   X'20'               YES - ZERO AS NONBLANK                       
RCLEDCMN EQU   X'10'               NO - PRINT USING COMMAS                      
RCLEDBKT EQU   X'08'               MINUS SIGN AS BRACKETS                       
RCLEDZRN EQU   X'04'               NO - ZERO AS NONBLANK                        
RCLEDLED EQU   X'02'               LEADING MINUS SIGN                           
RCLEDCR  EQU   X'01'               PRINT MINUS AS CREDIT                        
RCLOPT3  DS    XL1                                                              
RCLKPSIG EQU   X'80'               KEEP SIGNIFICENCE WHEN ADDING TO TOT         
RCLUNLNA EQU   X'40'               UNDERLINE AMOUNTS ABOVE                      
RCLRDATN EQU   X'20'               NO -  PRINT REDUNDANT DATA                   
RCLRDATY EQU   X'10'               YES - PRINT REDUNDANT DATA                   
RCLUNLNB EQU   X'08'               UNDERLINE AMOUNTS BELOW                      
RCLZEROT EQU   X'04'               PRINT ZERO TOTALS                            
RCLUNLNN EQU   X'02'               UNDERLINE AMOUNTS NONE                       
RCLUNLDB EQU   X'01'               DOUBLE UNDERLINE                             
RCLOPT4  DS    XL1                                                              
RCLZRTTN EQU   X'80'               NO -  PRINT ZERO TOTALS                      
RCLZRTTY EQU   X'40'               YES - PRINT ZERO TOTALS                      
         DS    XL2                 N/D                                          
RCLDCMLS DS    XL1                 # OF DECIMALS TO PRINT 0-4                   
RCLXDATA DS    XL1                 XTRA DATA FOR KEYWORD                        
*++ASSOCIATED RCLLN                                                             
RCLNLNQ  EQU   *-RCLELD            BASE LENGTH OF NEW ELEMENT                   
RCLNDATA DS    0XL16               NEW DATA FIELD                               
RCLNHDL1 DS    0XL12               NEW HEADING 1                                
RCLNHDL2 DS    0XL12               NEW HEADING 2                                
         SPACE 1                                                                
RPFELD   DSECT                     ** R.L. PROFILE DATA **                      
*++IDENTIFIER                                                                   
RPFEL    DS    XL1                 ELEMENT CODE                                 
RPFELQ   EQU   X'C4'                                                            
RPFLN    DS    XL1                 ELEMENT LENGTH                               
RPFPOPT  DS    XL1                 PRINT PROFILE OPTIONS                        
RPFBOX   EQU   X'80'               PRINT BOXES                                  
RPFIACT  EQU   X'40'               PRINT INACTIVE ACCOUNTS                      
RPFRTOT  EQU   X'20'               PRINT REDUNDANT TOTALS                       
RPFRDAT  EQU   X'10'               PRINT REDUNDANT DATA IN COLS                 
RPFLFJT  EQU   X'08'               PRINT LEFT JUSTIFIED                         
RPFZEROT EQU   X'04'               PRINT ZERO TOTALS                            
RPFPORT  EQU   X'02'               PRINT USING PORTRAIT                         
RPFMCASE EQU   X'01'               PRINT USING MIXED CASE                       
RPFEDOPT DS    XL1                 EDITING AMOUNTS OPTIONS                      
RPFEDCMA EQU   X'80'               PRINT USING COMMAS                           
RPFEDTRL EQU   X'40'               TRAILING MINUS SIGN                          
RPFEDZRO EQU   X'20'               ZERO AS NONBLANK                             
*              X'10'               DO NOT USE, SEE RCLEDOPT                     
RPFEDBKT EQU   X'08'               MINUS SIGN AS BRACKETS                       
*              X'04'               DO NOT USE, SEE RCLEDOPT                     
RPFEDLED EQU   X'02'               LEADING MINUS SIGN                           
RPFEDCR  EQU   X'01'               PRINT MINUS AS CREDIT                        
RPFPCTS  DS    XL1                 DECIMAL PLACES FOR PERCENTS 0/1/2            
RPFRND   DS    XL1                 ROUNDING OPTION P/D/T/M                      
RPFLIST  DS    0CL6                BILLING SOURCE LIST                          
RPFNALPR DS    XL1                 NUM OF ADDRESS LINES TO PRINT    1-4         
RPFNALPV EQU   X'80'               NUM OF ADDRESS LINES TO PRINT    V           
RPFNALDW DS    XL1                 NUM OF ADDRESS LINES TO DOWNLOAD 0-4         
RPFAGMTH DS    XL1                 AGEING   METHOD                              
RPFAGADT EQU   C'A'                ACTIVITY DATE    AGEING                      
RPFAGFIF EQU   C'F'                FIFO             AGEING                      
RPFAGDLT EQU   C'N'                SYSTEM   DEFAULT AGEING                      
RPFAGOPN EQU   C'O'                OPEN     ITEM    AGEING                      
RPFAGUBL EQU   C'U'                UNBILLED ITEM    AGEING                      
         DS    CL3                 SPARE                                        
RPFRKON  DS    CL2                 RANK ON TOTAL FOR ROW LEVEL                  
RPFRKBY  DS    CL2                 RANK (NOT CURRENTLY USED)                    
RPFRKCL  DS    CL1                 RANK FOR COLUMN                              
RPFRKOR  DS    CL1                 RANK ORDER (ACCENDING/DECENDING)             
         DS    CL1                 SPARE                                        
         DS    CL1                 SPARE                                        
RPFFLT1  DS    CL1                 FILTER 1                                     
RPFFLT2  DS    CL1                 FILTER 2                                     
RPFFLT3  DS    CL1                 FILTER 3                                     
RPFFLT4  DS    CL1                 FILTER 4                                     
RPFROPT  DS    XL1                 REPORT OPTIONS                               
RPFBALO  EQU   X'80'               BALANCE OUT                                  
RPFXLOCK EQU   X'40'               EXCLUDE LOCKED ACCOUNTS                      
RPFXRVRS EQU   X'20'               EXCLUDE REVERSALS                            
RPFBALDR EQU   X'10'               DEBIT BALANCE                                
RPFORVRS EQU   X'08'               REVERSALS ONLY                               
RPFOLOCK EQU   X'04'               LOCKED ACCOUNTS ONLY                         
RPFBALZR EQU   X'02'               ZERO BALANCE ACCOUNTS ONLY                   
RPFTYP56 EQU   X'02'               INCLUDE TYPE 56                              
RPFBALCR EQU   X'01'               CREDIT BALANCE                               
RPFOPT1  DS    XL1                 MORE OPTIONS (EXCLUDE/INCLUDE/ONLY)          
RPFXOFFS EQU   X'80'               EXCLUDE OFFSET                               
RPFXHELD EQU   X'40'               EXCLUDE HELD                                 
RPFXAPRV EQU   X'20'               EXCLUDE APPROVED                             
RPFIDRFT EQU   X'10'               INCLUDE DRAFT ITEMS                          
RPFOOFFS EQU   X'08'               OFFSET ONLY                                  
RPFOHELD EQU   X'04'               HELD ONLY                                    
RPFOAPRV EQU   X'02'               APPROVED ONLY                                
RPFODRFT EQU   X'01'               DRAFT ITEMS ONLY                             
RPFOPT2  DS    XL1                 MORE OPTIONS (EXCLUDE/INCLUDE/ONLY)          
RPFXVNDR EQU   X'80'               EXCLUDE PAY=NO VENDOR                        
RPFXQRED EQU   X'40'               EXCLUDE QUERIED ITEMS (DEBTORS)              
RPFXUGNT EQU   X'20'               EXCLUDE URGENT                               
RPFOQRED EQU   X'10'               QUERIED ITEMS ONLY (DEBTORS)                 
RPFOVNDR EQU   X'08'               ONLY SHOW PAY=NO VENDOR                      
RPFOCD$  EQU   X'04'               CASH DISCOUNT TRANSACTION ONLY               
RPFOUGNT EQU   X'02'               URGENT ONLY                                  
RPFSPEC  EQU   X'01'               SPECS FOR CASH DISBURSEMENT/RECEIPTS         
RPFPOPT2 DS    XL1                 PRINT PROFILE OPTIONS 2                      
RPFEXCOL EQU   X'80'               PRINT MIDS/TOTALS ACCROSS COLUMNS            
RPFTOTSP EQU   X'40'               REQUEST TOTAL ON SEPARATE PAGE               
RPFIABUD EQU   X'20'               ELIMINATE INACTIVE BUDGETS                   
RPFIATRN EQU   X'10'               ELIMINATE INACTIVE ACTUALS                   
RPFDOWN  EQU   X'08'               FORCE DOWNLOADING OPTION                     
RPFSTRPE EQU   X'04'               PRINT STRIPES                                
RPFOSHDE EQU   X'02'               SHADE OUTSIDE BOX                            
RPFISHDE EQU   X'01'               SHADE INSIDE BOX                             
RPFFLT5  DS    CL1                 FILTER 5                                     
RPFIND   DS    XL1                 ANOTHER INDICATOR                            
RPFIPRFX EQU   X'80'               EDIT FOREIGN CURRENCY W/PREFIX               
RPFIXNFC EQU   X'20'               EXCLUDE NON-FOREIGN CURRENCY                 
RPFIDERR EQU   X'10'               PRINT DIVISION ERROR AS "EEEEEE"             
RPFICZRO EQU   X'08'               ELIMINATE REC. IF ALL AGE COLS=ZERO          
RPFACLVL EQU   X'04'               PRINT ALL ACCOUNT LEVELS                     
RPFSTERO EQU   X'01'               ADDED/AMENED THROUGH STEREO                  
RPFOPT3  DS    XL1                 MORE OPTIONS                                 
RPFXADPT EQU   X'80'               EXCLUDE ANALYZED BY DEPARTMENT               
RPFXASTF EQU   X'40'               EXCLUDE ANALYZED BY STAFF                    
RPFXACLI EQU   X'20'               EXCLUDE ANALYZED BY CLIENT                   
RPFXCLRD EQU   X'10'               EXCLUDE CLEARED ITEMS                        
RPFOADPT EQU   X'08'               ONLY ANALYZED BY DEPARTMENT                  
RPFOASTF EQU   X'04'               ONLY ANALYZED BY STAFF                       
RPFOACLI EQU   X'02'               ONLY ANALYZED BY CLIENT                      
RPFOCLRD EQU   X'01'               ONLY CLEARED ITEMS                           
RPFOPT4  DS    XL1                 MORE OPTIONS (EXCLUDE/INCLUDE/ONLY)          
RPFXESTO EQU   X'80'               EXCLUDE JOBS WITH ESTIMATES                  
RPFXALLC EQU   X'80'               EXCLUDE ALLOCATED ITEMS                      
RPFXCWOT EQU   X'40'               EXCLUDE CBIL W/O'S & TRANSFERS               
RPFXCLSE EQU   X'20'               EXCLUDE CLOSED JOBS                          
RPFIEXPS EQU   X'10'               INCLUDE EXPENSE JOBS                         
RPFOESTO EQU   X'08'               ONLY JOBS WITH ESTIMATES                     
RPFOALLC EQU   X'08'               ALLOCATED ITEMS ONLY                         
RPFOCWOT EQU   X'04'               CBIL W/O'S & TRANSFERS ONLY                  
RPFOCLSE EQU   X'02'               CLOSED JOBS ONLY                             
RPFOEXPS EQU   X'01'               EXPENSE JOBS ONLY                            
RPFOPT5  DS    XL1                 MORE OPTIONS (EXCLUDE/INCLUDE/ONLY)          
RPFXPORD EQU   X'80'               EXCLUDE PURCHASE ORDERS                      
RPFMRGPO EQU   X'40'               MERGE PURCHASE ORDER WORK CODES              
RPFXBRI  EQU   X'20'               EXCLUDE BANK RECONCILED ITEMS                
RPFISVTM EQU   X'10'               INCLUDE SAVED TIMESHEETS                     
RPFOPORD EQU   X'08'               PURCHASE ORDERS ONLY                         
RPFIWC99 EQU   X'04'               INCLUDE WC99 W/GRP OR TYPE FILTERS           
RPFOBRI  EQU   X'02'               ONLY BANK RECONCILED ITEMS                   
RPFOSVTM EQU   X'01'               ONLY SAVED TIMESHEETS                        
RPFBLTRN DS    XL1                 BILLED TRANSACTION(S)  Y/N/O/P               
RPFMETHD DS    XL1                 METHOD TYPE                                  
RPFDTFMT DS    XL1                 DOWNLOAD DATE FORMAT                         
RPFDNOPT DS    XL1                 DOWNLOAD OPTIONS                             
RPFDNDEC EQU   X'80'               NO DECIMALS                                  
RPFDNPAD EQU   X'40'               PAD $ COLS W/ LEADING ZEROS                  
RPFDNFXW EQU   X'20'               FIXED WIDTH FIELDS                           
RPFDDOWN EQU   X'10'               FORCE DOWNLOAD                               
RPFDNCOL EQU   X'08'               EXCLUDE COLUMN HEADINGS                      
RPFDNROW EQU   X'04'               INCLUDE ROWS                                 
RPFDNTOT EQU   X'02'               INCLUDE TOTALS                               
RPFDTXT# EQU   X'01'               DOWNLOAD $ AS TEXT                           
RPFCLIOF DS    0CL1                P,C,B,  VALUES   (PERSON)                    
RPFESTST DS    CL1                 U,A,R,N VALUES   (PRODUCTION)                
RPFPOPT3 DS    XL1                 PRINT OPTION 3                               
RPFNOUL  EQU   X'80'               DON'T UNDERLINE TOTALS                       
RPFTPUL  EQU   X'40'               UNDERLINE TOTALS ABOVE NOT BELOW             
RPFTEDIT EQU   X'20'               TIME SHEET EDIT REPORTING                    
RPFXTBOX EQU   X'10'               EXTRA BOXES FOR REPORTING                    
RPFNOCHD EQU   X'08'               NO COLUMN HEADINGS                           
RPFNORQT EQU   X'04'               NO REQUEST TOTALS FOR FORMAT                 
RPFDBUL  EQU   X'01'               DOUBLE UNDERLINE                             
         DS    XL1                 SPARE                                        
*++ASSOCIATED RPFLN                                                             
RPFLNQ   EQU   *-RPFELD            ELEMENT LENGTH                               
RPFFLDD  DS    CL1                 FIELD DELIMITER                              
RPFTXTD  DS    CL1                 TEXT  DELIMITER                              
RPFEOLD  DS    CL1                 EOL   DELIMITER                              
RPFEORD  DS    CL1                 EOR   DELIMITER                              
RPFXMIT  DS    XL1                 TRANSMIT FOR EDICT                           
RPFXFTP  EQU   X'80'               FTP TYPE TRANSMITION                         
RPFPITCH DS    XL1                 PITCH CONTROL 0=AUTO,10,12,15,18,20          
         DS    XL14                SPARE                                        
*++ASSOCIATED RPFLN                                                             
RPFLN2Q  EQU   *-RPFELD            NEW ELEMENT LENGTH                           
         SPACE 1                                                                
RFLELD   DSECT                     ** R.L. FILTER DATA **                       
*++IDENTIFIER                                                                   
RFLEL    DS    XL1                 ELEMENT CODE                                 
RFLELQ   EQU   X'C5'                                                            
RFLLN    DS    XL1                 ELEMENT LENGTH (VARIABLE)                    
RFLSEQ   DS    XL1                 COLUMN NUMBER OR ZERO FOR OVERALL            
*++IDENTIFIER                                                                   
RFLTYPE  DS    XL1                 TYPE OF FILTER OR DATA                       
RFLLDG   EQU   1                   LEDGERS                                      
RFLACC   EQU   2                   ACCOUNTS                                     
RFLOFF   EQU   3                   OFFICES                                      
RFLCLI   EQU   4                   CLIENTS                                      
RFLBSR   EQU   6                   BILLING SOURCE LIST                          
RFLCOST  EQU   7                   COST ACCOUNT LIST                            
RFL11BL  EQU   8                   11 BILLING                                   
RFL12RV  EQU   9                   12 REVENUE                                   
RFLDEPT  EQU   12                  DEPARTMENT (FROM 2D ACCOUNT)                 
RFLPRSN  EQU   13                  PERSON (FROM 2P ACCOUNT)                     
RFLVNDR  EQU   14                  VENDOR ACCOUNT (SV,SX,SY ACCOUNT)            
RFLXCAT  EQU   15                  EXPENSE CATEGORY (13 ACCOUNT)                
RFLFCUR  EQU   16                  FOREIGN CURRENCY TYPE                        
RFLPRTP  EQU   17                  PARTICIPANT ACCOUNT (3A-3Z)                  
RFLCNTR  EQU   18                  CONTRA LIST                                  
RFLBLGP  EQU   19                  BILL GROUP                                   
RFLWCGP  EQU   20                  WORK CODE GROUP                              
RFLWC    EQU   21                  WORK CODE                                    
RFLBTYP  EQU   22                  BILLING TYPE                                 
RFLOFGP  EQU   23                  OFFICE GROUP                                 
RFLMDGP  EQU   24                  MEDIA GROUP                                  
RFLMED   EQU   25                  MEDIA                                        
RFLSTTY  EQU   26                  STUDIO TYPE                                  
RFLUFLD  EQU   27                  USER FIELD                                   
RFLXCPT  EQU   28                  EXCEPTION REASON                             
RFLTWTP  EQU   29                  TIME WORKCODE TYPES                          
RFLWCTYP EQU   29                  WORKCODE TYPES                               
RFLOPTP  EQU   30                  OUT OF POCKET WORKCODE TYPES                 
RFLTTIME EQU   31                  TYPE OF TIME                                 
RFLTTYPE EQU   32                  TRANSACTION TYPE                             
RFLBUDGT EQU   33                  BUDGET                                       
RFLFILT1 EQU   35                  FILTER 1                                     
RFLFILT2 EQU   36                  FILTER 2                                     
RFLFILT3 EQU   37                  FILTER 3                                     
RFLFILT4 EQU   38                  FILTER 4                                     
RFLFILT5 EQU   39                  FILTER 5                                     
RFLCOFF  EQU   40                  CLIENT   OFFICE                              
RFLAOFF  EQU   41                  ANALYSIS OFFICE                              
RFLAPPRV EQU   42                  APPROVED                                     
RFLOFFST EQU   43                  OFFSET                                       
RFLURGNT EQU   44                  URGENT                                       
RFLMTHD  EQU   45                  COST METHOD                                  
RFLLOCS  EQU   46                  LOCATION STATUS  (1R)                        
RFLPRCLV EQU   47                  PRICE LEVEL                                  
RFL14DLB EQU   48                  14 POINTER/DIRECT LABOR                      
RFLCFLT1 EQU   49                  CONTRA FILTER 1                              
RFLCFLT2 EQU   50                  CONTRA FILTER 2                              
RFLCFLT3 EQU   51                  CONTRA FILTER 3                              
RFLCFLT4 EQU   52                  CONTRA FILTER 4                              
RFLCFLT5 EQU   53                  CONTRA FILTER 5                              
RFLDCNTR EQU   54                  DENOMINATOR CONTRA       (PCT)               
RFLDTTME EQU   55                  DENOMINATOR TYPE OF TIME (PCT)               
RFLDCLI  EQU   56                  DENOMINATOR CLIENT       (PCT)               
RFLDWC   EQU   57                  DENOMINATOR WORKCODE     (PCT)               
RFLRECON EQU   60                  RECONCILED ITEMS (SC)                        
RFLPCDE  EQU   61                  PAY CODES        (1R)                        
         DS    XL1                 N/D                                          
RFLIND   DS    XL1                 INDICATOR                                    
RFLXCLD  EQU   X'80'               EXCLUDE FILTER                               
RFLWILD  EQU   X'40'               WILD CARD USED                               
RFLDENO  EQU   X'20'               DENOMINATOR FILTER                           
RFLINTRL EQU   X'01'               INTERNALLY GENERATED (NOT ON FILE)           
*++ASSOCIATED RFLLN                                                             
RFLLNQ   EQU   *-RFLEL             LENGTH UP TO THE DATA                        
RFLDATA  DS    0CL36               DATA                                         
         SPACE 1                                                                
IPRELD   DSECT                     ** INTERAGENCY PROFILE ELEMENT **            
*++IDENTIFIER                                                                   
IPREL    DS    XL1                 ELEMENT CODE                                 
IPRELQ   EQU   X'C6'                                                            
IPRLN    DS    XL1                 ELEMENT LENGTH                               
IPRDES   DS    CL36                ESTIMATE DESCRIPTION                         
IPRPER   DS    0CL4                ESTIMATE PERIOD                              
IPRSTART DS    PL2                 ESTIMATE PERIOD START (YYMM) PWO             
IPREND   DS    PL2                 ESTIMATE PERIOD END (YYMM) PWO               
IPRNET   DS    PL3                 A.O.R. NET PCT (A/P FOR OTHER AGY)           
IPRFEE   DS    PL3                 A.O.R. FEE PCT (INC FOR OTHER AGY)           
IPRREC   DS    PL3                 CREATIVE RECV PCT (INC FOR OUR AGY)          
IPRORIG  DS    XL2                 OFFICE ORIGIN ID NO (TWAORIG)                
         DS    XL13                N/D                                          
*++ASSOCIATED IPRLN                                                             
IPRLNQ   EQU   *-IPRELD                                                         
         SPACE 1                                                                
IESELD   DSECT                     ** INTERAGENCY ESTIMATE ELEMENT **           
*++IDENTIFIER                                                                   
IESEL    DS    XL1                 ELEMENT CODE                                 
IESELQ   EQU   X'C7'                                                            
IESLN    DS    XL1                 ELEMENT LENGTH                               
IESMTH   DS    PL2                 ADVERTISING MONTH (YYMM) PWO                 
IESDAT   DS    XL2                 POSTING DATE (YMD) COMPRESSED                
IESFEE   DS    PL3                 A.O.R. FEE PCT ( 2 DEC. PLCS)                
IESRCV   DS    PL3                 CREATIVE RECV PCT (2 DEC. PLCS)              
IESGRS   DS    PL6                 GROSS BILLING                                
IESREC   DS    PL6                 RECEIVABLE AMOUNT                            
IESPD    DS    PL6                 PAID SO FAR                                  
IESDTO   DS    XL2                 ORIGINAL POSTING DATE (COMPRESSED)           
IESFEO   DS    PL3                 ORIGINAL A.O.R. FEE PCT                      
IESRCO   DS    PL3                 ORIGINAL CREATIVE RECV PCT.                  
IESGRO   DS    PL6                 ORIGINAL GROSS BILLING                       
IESRAO   DS    PL6                 ORIGINAL RECEIVABLE AMOUNT                   
IESSTAT  DS    XL1                 ESTIMATE STATUS                              
IESSPOST EQU   X'80'               RECEIVABLE DEBIT POSTED                      
IESUSED  DS    XL2                 USED DATE - COMPRESSED                       
         DS    XL17                N/D                                          
*++ASSOCIATED IESLN                                                             
IESLNQ   EQU   *-IESELD                                                         
         SPACE 1                                                                
RCPELD   DSECT                     ** SCRIBE RECAP ELEMENT **                   
*++IDENTIFIER                                                                   
RCPEL    DS    X                   ELEMENT CODE                                 
RCPELQ   EQU   X'C8'                                                            
RCPLN    DS    XL1                 ELEMENT LENGTH                               
RCPSEQ   DS    XL1                 SEQUENCE NUMBER                              
RCPCODE  DS    CL8                 FORMAT CODE                                  
         DS    XL2                 N/D                                          
RCPOPT1  DS    XL1                 RECAP OPTIONS                                
RCPSEP   EQU   X'80'               RECAP IS SEPERATE (NOT RECAPED)              
RCPPROF  EQU   X'40'               USE RECAP'S PROFILE NOT MAIN                 
RCPSPAGE EQU   X'10'               RECAPPED BUT FORCE SPERATE PAGES             
         DS    XL6                 N/D                                          
*++ASSOCIATED RCPLN                                                             
RCPLNQ   EQU   *-RCPELD                                                         
         SPACE 1                                                                
MNOELD   DSECT                     ** MESSAGE ELEMENT **                        
*++IDENTIFIER                                                                   
MNOEL    DS    X                   ELEMENT  CODE                                
MNOELQ   EQU   X'C9'                                                            
MNOLN    DS    XL1                 ELEMENT LENGTH                               
MNOSEQ   DS    XL1                 SEQUENCE NUMBER                              
MNOSTYPE DS    XL1                 SEQUENCE NUMBER TYPE                         
MNOSTCOL EQU   X'01'               COLUMN                                       
MNOSTROW EQU   X'02'               ROW                                          
MNOSTHDR EQU   X'03'               HEADER                                       
*++ASSOCIATED MNOLN                                                             
MNOLN1Q  EQU   *-MNOELD            HEADER LENGTH                                
MNOMLN   DS    XL1                 MESSAGE LENGTH                               
MNOMTYPE DS    C                   MESSAGE TYPE                                 
MNOMTERR EQU   C'E'                ERROR                                        
MNOMTINF EQU   C'I'                INFORMATION                                  
MNOMTSCR EQU   C'S'                SCREEN                                       
MNOMTTXT EQU   C'T'                TEXT                                         
MNOMTWRN EQU   C'W'                WARNING                                      
MNOMNUM  DS    XL2                 MESSAGE NUMBER                               
*++ASSOCIATED MNOLN                                                             
MNOLN2Q  EQU   *-MNOELD            BASE ELEMENT LENGTH                          
MNOMELQ  EQU   *-MNOMLN            BASE MESSAGE LENGTH                          
MNOMDTYP DS    XL1                 MESSAGE DATA TYPE                            
MNOMDCOL EQU   1                   COLUMN NUMBER                                
MNOMDTXT EQU   2                   TEXT                                         
MNOMDATA DS    0XL1                MESSAGE DATA                                 
         SPACE 1                                                                
*                                                                               
* X'CA' RESERVED FOR COST RATES                                                 
*                                                                               
CDEELD   DSECT                     ** COST RATES DETAIL ELEMENT **              
*++IDENTIFIER                                                                   
CDEEL    DS    XL1                                                              
CDEELQ   EQU   X'CA'                                                            
CDELN    DS    XL1                 ELEMENT LENGTH                               
CDTYP    DS    XL1                 RATE TYPE                                    
CDCRRTE  EQU   X'80'               CRATES                                       
CDDATA   DS    0CL1                REST OF INFO TO FOLLOW SOON                  
         SPACE 1                                                                
JCBELD   DSECT                     ** JOB CLIENT BILLING ELEMENT **             
*++IDENTIFIER                                                                   
JCBEL    DS    XL1                 ELEMENT CODE                                 
JCBELQ   EQU   X'CB'                                                            
JCBLN    DS    XL1                 ELEMENT LENGTH                               
JCBSEQ   DS    XL2                 JOB ACTIVITY SEQUENCE NUMBER                 
JCBPERS  DS    XL2                 PERSON CODE OF LAST ACTIVITY                 
JCBALL   DS    XL2                 NUMBER OF PENDING ALLOCATED ITEMS            
JCBWOF   DS    XL2                 NUMBER OF PENDING WRITE-OFFS                 
JCBRCV   DS    XL2                 NUMBER OF PENDING W/O  RECOVERIES            
JCBXFR   DS    XL2                 NUMBER OF PENDING TRANSFERS                  
JCBXTYP  DS    XL1                 EXCHANGE RATE TYPE (ON AFCELD)               
JCBXAGYQ EQU   C'A'                AGENCY RATE                                  
JCBXCLIQ EQU   C'C'                CLIENT RATE                                  
JCBXFTQ  EQU   C'F'                FT RATE                                      
JCBXINPQ EQU   C'I'                INPUT RATE                                   
JCBXEURQ EQU   C'E'                FIXED EURO RATE                              
JCBXDAT  DS    XL2                 DATE EXCHANGE RATE SET                       
JCBADV   DS    XL2                 NUMBER OF ADVANCE BILLS                      
JCBINDS1 DS    XL1                 INDICATOR BYTE                               
JCBIPEND EQU   X'80'               ACTIVITY PENDING ON JOB                      
JCBADVAL DS    PL6                 ALLOCATION PENDING ON ADVANCE ITEMS          
JCBFEE   DS    XL2                 NUMBER OF DRAFT FEE ADJUSTMENTS              
JCBFCUR  DS    CL3                 CURRENCY OF FEE ADJUSTMENTS                  
         DS    XL1                 N/D                                          
*++ASSOCIATED JCBLN                                                             
JCBLNQ   EQU   *-JCBELD                                                         
         SPACE 1                                                                
BSDELD   DSECT                     ** BILL SECTION DEFINITION EL **             
*++IDENTIFIER                                                                   
BSDEL    DS    XL1                 ELEMENT CODE                                 
BSDELQ   EQU   X'CC'                                                            
BSDLN    DS    XL1                 ELEMENT LENGTH                               
BSDSEC   DS    XL1                 SECTION NUMBER                               
BSDSTYP  DS    XL1                 SUB-TYPE               (DATA LENGTH)         
BSDSALL  EQU   0                   ALL CHARGES            (1)                   
BSDSWCT  EQU   1                   WORKCODE TYPE          (1)                   
BSDSWCG  EQU   2                   WORKCODE GROUP         (1)                   
BSDSWC   EQU   3                   WORKCODE               (2)                   
BSDSTRN  EQU   4                   TRANSACTION TYPE       (1)                   
BSDSCAC  EQU   5                   CONTRA ACCOUNT         (14)                  
BSDSCAT  EQU   6                   SCHEME / CATEGORY      (10)                  
*++ASSOCIATED BSDLN                                                             
BSDLN1Q  EQU   *-BSDEL                                                          
BSDDATA  DS    0X                  DATA                                         
BSDTIMEQ EQU   1                   WC TYPE TIME/INTERNAL                        
BSDCOSTQ EQU   2                   WC TYPE COST/EXTERNAL                        
         SPACE 1                                                                
CRDELD   DSECT                     ** CHECK REGISTER DETAIL **                  
*++IDENTIFIER                                                                   
CRDEL    DS    XL1                 ELEMENT CODE                                 
CRDELQ   EQU   X'CD'                                                            
CRDLN    DS    XL1                 ELEMENT LENGTH                               
*++IDENTIFIER                                                                   
CRDTYPE  DS    XL1                 DATA TYPE                                    
CRDFRST  EQU   1                   STARTING CHECK NUMBER                        
CRDVOID  EQU   2                   VOIDED CHECK NUMBERS                         
CRDSKIP  EQU   3                   SKIPPED CHECK NUMBERS                        
         DS    XL4                 N/D                                          
CRDDATA  DS    CL80                DATA                                         
*++ASSOCIATED CRDLN                                                             
CRDLNQ   EQU   *-CRDELD                                                         
         SPACE 1                                                                
RQCELD   DSECT                     ** REQUEST CARD ELEMENT **                   
*++IDENTIFIER                                                                   
RQCEL    DS    XL1                 ELEMENT CODE                                 
RQCELQ   EQU   X'CE'                                                            
RQCLN    DS    XL1                 ELEMENT LENGTH                               
RQCSEQ   DS    XL1                 REQUEST CARD SEQUENCE NUMBER                 
         DS    XL5                 N/D                                          
RQCCARD  DS    CL80                REQUEST CARD                                 
*++ASSOCIATED RQCLN                                                             
RQCLNQ   EQU   *-RQCELD                                                         
         SPACE 1                                                                
RQFELD   DSECT                     ** REQUEST FILTER ELEMENT **                 
*++IDENTIFIER                                                                   
RQFEL    DS    XL1                 ELEMENT CODE                                 
RQFELQ   EQU   X'CF'                                                            
RQFLN    DS    XL1                 ELEMENT LENGTH                               
RQFSTAT  DS    XL1                 FILTER STATUS                                
RQFEXCL  EQU   X'80'               EXCLUDE ITEMS MATCHING THIS FILTER           
RQFTYPE  DS    XL1                 REQUEST FILTER TYPE                          
*++ASSOCIATED RQFLN                                                             
RQFLNQ   EQU   *-RQFELD                                                         
RQFDATA  DS    0C                  FILTER FIELD DATA                            
         SPACE 1                                                                
JBPELD   DSECT                                                                  
*++IDENTIFIER                                                                   
JBPEL    DS    XL1                 ELEMENT CODE                                 
JBPELQ   EQU   X'D0'                                                            
JBPLN    DS    XL1                 ELEMENT LENGTH                               
JBPCLI   DS    CL5                 CLIENT CODE                                  
JBPPRO   DS    CL6                 PRODUCT CODE                                 
JBPJOB   DS    CL6                 JOB CODE                                     
JBPPERC  DS    PL4                 PERCENTAGE AMOUNT                            
         DS    XL3                 SPARE                                        
*++ASSOCIATED JBPLN                                                             
JBPLNQ   EQU   *-JBPELD                                                         
         SPACE 1                                                                
OFIELD   DSECT                     ** OFFICE INFO ELEMENT **                    
*++IDENTIFIER                                                                   
OFIEL    DS    XL1                 ELEMENT CODE                                 
OFIELQ   EQU   X'D1'                                                            
OFILN    DS    XL1                 ELEMENT LENGTH                               
OFISTAT  DS    XL1                 OFFICE STATUS                                
OFISLIST EQU   X'40'               OFFICE IS AN OFFICE LIST                     
OFIINC   DS    XL2                 NUMBER OF LISTS THIS IS INCLUDED IN          
OFIUSE   DS    XL2                 NUMBER OF REFERENCES (LEDG/ACC)              
*++ASSOCIATED OFILN                                                             
OFILNQ   EQU   *-OFIELD                                                         
         SPACE 1                                                                
OFLELD   DSECT                     ** OFFICE LIST ELEMENT **                    
*++IDENTIFIER                                                                   
OFLEL    DS    XL1                 ELEMENT CODE                                 
OFLELQ   EQU   X'D2'                                                            
OFLLN    DS    XL1                 ELEMENT LENGTH                               
OFLSEQ   DS    XL1                 ELEMENT SEQUENCE NUMBER                      
*++ASSOCIATED OFLLN                                                             
OFLLN1Q  EQU   *-OFLELD                                                         
OFLNTRY  DS    0CL2                LIST OF OFFICE CODES                         
         SPACE 1                                                                
OFAELD   DSECT                     ** OFFICE ACCESS ELEMENT **                  
*++IDENTIFIER                                                                   
OFAEL    DS    XL1                 ELEMENT CODE                                 
OFAELQ   EQU   X'D3'                                                            
OFALN    DS    XL1                 ELEMENT LENGTH                               
OFAOFFC  DS    CL2                 OFFICE OR LIST ATTACHED (ZEROS=ALL)          
*++ASSOCIATED OFALN                                                             
OFALN1Q  EQU   *-OFAELD                                                         
*                                                                               
OFAOVER  DS    0XL3                OFFICE OVERRIDE VALUES                       
OFAOQUAL DS    XL1                 OFFICE QUALIFIER                             
OFAOQLST EQU   X'80'               OFFICE IS IN OFAOFFC LIST                    
OFAOQPST EQU   X'02'               ALLOW OFFICE POSTINGS                        
OFAOQENQ EQU   X'01'               ALLOW OFFICE ENQUIRIES                       
OFAOOFFC DS    CL2                 OFFICE CODE                                  
         SPACE 1                                                                
SERELD   DSECT                     ** TERMINAL ID ELEMENT **                    
*++IDENTIFIER                                                                   
SEREL    DS    XL1                 ELEMENT CODE                                 
SERELQ   EQU   X'D5'                                                            
SERLN    DS    XL1                 ELEMENT LENGTH                               
SERNM    DS    XL4                 TRANSACTION SERIAL NUMBER                    
*++ASSOCIATED SERLN                                                             
SERLNQ   EQU   *-SERELD                                                         
         SPACE 1                                                                
TIDELD   DSECT                     ** TERMINAL ID ELEMENT **                    
*++IDENTIFIER                                                                   
TIDEL    DS    XL1                 ELEMENT CODE                                 
TIDELQ   EQU   X'D6'                                                            
TIDLN    DS    XL1                 ELEMENT LENGTH                               
TID      DS    CL8                 TERMINAL ID                                  
*++ASSOCIATED TIDLN                                                             
TIDLNQ   EQU   *-TIDELD                                                         
         SPACE 1                                                                
MPGELD   DSECT                     ** MEDIA PRODUCT GROUP ELEMENT**             
*++IDENTIFIER                                                                   
MPGEL    DS    XL1                 ELEMENT CODE                                 
MPGELQ   EQU   X'D7'                                                            
MPGLN    DS    XL1                 ELEMENT LENGTH                               
MPGCODE  DS    CL6                 MEDIA PRODUCT GROUP CODE                     
MPGNME   DS    CL24                MEDIA PRODUCT GROUP NAME                     
*++ASSOCIATED MPGLN                                                             
MPGLNQ   EQU   *-MPGELD                                                         
         SPACE 1                                                                
PIDELD   DSECT                     ** PERSON ID ELEMENT **                      
*++IDENTIFIER                                                                   
PIDEL    DS    XL1                 ELEMENT CODE                                 
PIDELQ   EQU   X'D8'                                                            
PIDLN    DS    XL1                 ELEMENT LENGTH                               
PIDNO    DS    XL2                 PERSON ID NUMBER                             
         DS    XL2                 N/D                                          
*++ASSOCIATED PIDLN                                                             
PIDLNQ   EQU   *-PIDELD                                                         
         SPACE 1                                                                
RALELD   DSECT                     ** RECEIVABLE ALLOCATION ELEMENT **          
*++IDENTIFIER                                                                   
RALEL    DS    XL1                 ELEMENT CODE                                 
RALELQ   EQU   X'D9'                                                            
RALLN    DS    XL1                 ELEMENT LENGTH                               
*++IDENTIFIER                                                                   
RALTYPE  DS    XL1                 TYPE OF ALLOCATION                           
RALTALC  EQU   1                   REGULAR ALLOCATION                           
RALTOFS  EQU   2                   OFFSET/CONTRA'D                              
RALTWOF  EQU   3                   WRITTEN-OFF                                  
RALTTTO  EQU   4                   TRANSFERRED TO                               
RALTTFR  EQU   5                   TRANSFERRED FROM                             
RALDATA  DS    0X                  VARIABLE DATA STARTS HERE                    
*                                                                               
         ORG   RALDATA                                                          
RALALC   DS    0X                  REGULAR ALLOCATION VALUES                    
RALAREF  DS    CL6                 CHECK NUMBER                                 
RALADAT  DS    PL3                 CHECK DATED (YYMMDD)                         
RALADEP  DS    PL3                 CHECK DEPOSITED ON (YYMMDD)                  
*++ASSOCIATED RALLN                                                             
RALALCLQ EQU   *-RALELD            LENGTH OF ELEMENT                            
*                                                                               
         ORG   RALDATA                                                          
RALOFS   DS    0X                  OFFSET/CONTRA VALUES                         
RALODAT  DS    PL3                 OFFSET ON (YYMMDD)                           
*++ASSOCIATED RALLN                                                             
RALOFSLQ EQU   *-RALELD            LENGTH OF ELEMENT                            
*                                                                               
         ORG   RALDATA                                                          
RALWOF   DS    0X                  WRITE-OFF VALUES                             
*&&UK                                                                           
RALWREF  DS    CL6                 WRITE-OFF REFERENCE NUMBER                   
RALWDAT  DS    PL3                 WRITTEN-OFF ON (YYMMDD)                      
RALWDEP  DS    PL3                 CHECK DEPOSITED ON (YYMMDD) OR ZERO          
RALWULA  DS    0CL14               WRITE-OFF UNIT/LEDGER/ACCOUNT                
RALWUNT  DS    CL1                 UNIT CODE                                    
RALWLDG  DS    CL1                 LEDGER CODE                                  
RALWACT  DS    CL12                ACCOUNT CODE                                 
*&&                                                                             
*&&US                                                                           
RALWREF  DS    CL6                 WRITE-OFF REFERENCE NUMBER                   
RALWDAT  DS    PL3                 WRITTEN-OFF ON (YYMMDD)                      
RALWULA  DS    0CL14               WRITE-OFF UNIT/LEDGER/ACCOUNT                
RALWUNT  DS    CL1                 UNIT CODE                                    
RALWLDG  DS    CL1                 LEDGER CODE                                  
RALWACT  DS    CL12                ACCOUNT CODE                                 
*&&                                                                             
*++ASSOCIATED RALLN                                                             
RALWOFLQ EQU   *-RALELD            LENGTH OF ELEMENT                            
*                                                                               
         ORG   RALDATA                                                          
RALTRF   DS    0X                  TRANSFER TO/FROM VALUES                      
RALTMOS  DS    PL2                 TRANSFER TO/FROM MONTH OF SERVICE            
RALTDAT  DS    PL3                 TRANSFERRED ON (YYMMDD)                      
RALTULA  DS    0CL14               TRANSFER TO/FROM UNIT/LEDGER/ACCOUNT         
RALTUNT  DS    CL1                 UNIT CODE                                    
RALTLDG  DS    CL1                 LEDGER CODE                                  
RALTACT  DS    CL12                ACCOUNT CODE                                 
*++ASSOCIATED RALLN                                                             
RALTRFLQ EQU   *-RALELD            LENGTH OF ELEMENT                            
         SPACE 1                                                                
XXPELD   DSECT                     ** PRODUCTION EXTRA EXTRA PROFILE **         
*++IDENTIFIER                                                                   
XXPEL    DS    XL1                 ELEMENT CODE                                 
XXPELQ   EQU   X'DA'                                                            
XXPLN    DS    XL1                 ELEMENT LENGTH (VARIABLE)                    
XXPDSCHM DS    CL2                 DATE SCHEME OR BINARY ZEROES                 
*++ASSOCIATED XXPLN                                                             
XXPLN1Q  EQU   *-XXPELD                                                         
XXPLAGN  DS    XL2                 HIGH ALLOCATION GRP NO. (LDGR RECD)          
         ORG   XXPLAGN                                                          
XXPJAGN  DS    XL2                 ALLOCATION GRP NO. (JOB RECD)                
*++ASSOCIATED XXPLN                                                             
XXPLN2Q  EQU   *-XXPELD                                                         
         SPACE 1                                                                
FFTELD   DSECT                     ** FREEFORM TEXT ELEMENT **                  
*++IDENTIFIER                                                                   
FFTEL    DS    XL1                 ELEMENT CODE                                 
FFTELQ   EQU   X'DB'                                                            
FFTLN    DS    XL1                 ELEMENT LENGTH (VARIABLE)                    
*++IDENTIFIER                                                                   
FFTTYPE  DS    XL1                 TEXT TYPE AS FOLLOWS:-                       
FFTTPSTA EQU   1                   CURRENT STATUS        (PROD'N DATES)         
FFTTPNXT EQU   2                   NEXT STAGE            (PROD'N DATES)         
FFTTPWHO EQU   3                   ACTION TO BE TAKEN BY (PROD'N DATES)         
FFTTPASS EQU   4                   PASSWD FOR ORDER VS INVOICE VARIANCE         
FFTTPSPE EQU   5                   JOB SPECIFICATION     (PROD'N DATES)         
FFTTPCON EQU   6                   MAIN CONTACT        (PROD'N CLI/PRO)         
FFTTPTEL EQU   7                   TELEPHONE NUMBER    (PROD'N CLI/PRO)         
FFTTPCOM EQU   8                   COMMENTS            (PROD'N CLI/PRO)         
FFTTPFAX EQU   9                   FAX NUMBER          (PROD'N CLI/PRO)         
FFTTEML  EQU   10                  EMAIL ADDRESS       (PROD'N CLI/PRO)         
FFTTAACT EQU   11                  ACTIVITY DATE- YYMMDD   (ACCOUNTING)         
FFTTAID  EQU   12                  ID (MAX CHARACTER 8)    (ACCOUNTING)         
FFTTAPNO EQU   13                  DSS PERMIT NUMBER               (UK)         
FFTTAECO EQU   14                  DSS EMPLOYER'S CODE             (UK)         
FFTTTFLT EQU   14                  FILTERS FOR SESSION ESTIMATE    (US)         
FFTTAACO EQU   15                  IR ACCOUNTS OFFICE REFERENCE#   (UK)         
FFTTAENO EQU   16                  IR EMPLOYER'S REFERENCE#        (UK)         
FFTTATAD EQU   17                  TAX DISTRICT                    (UK)         
FFTTATAN EQU   18                  TAX DISTRICT NAME               (UK)         
FFTTATAS EQU   19                  TAX DISTRICT SHORT NAME         (UK)         
FFTTAXNO EQU   20                  TAX (VAT/GST) NUMBER            (UK)         
FFTTAAGR EQU   21                  ACCOUNT GROUP NAME              (UK)         
FFTTBACC EQU   22                  BANK ACCOUNT CODE               (UK)         
FFTTBACN EQU   23                  BANK ACCOUNT NAME               (UK)         
FFTTBSOC EQU   24                  BANK SORT CODE                  (UK)         
FFTTBNAM EQU   25                  BANK NAME                       (UK)         
FFTTACNO EQU   26                  IR COMPANY REFERENCE#           (UK)         
FFTTPNAM EQU   27                  PAYEE NAME (CASH BATCHES)       (UK)         
FFTTSCDN EQU   28                  SUNDRY CREDITOR NAME            (UK)         
FFTTBSRN EQU   29                  BUILDING SOCIETY ROLL NUMBER    (UK)         
FFTTYOFF EQU   30                  'YOUR OFFER' (GERMAN ORDERS)    (UK)         
FFTTPNET EQU   31                  PRINT NAME FOR NET                           
FFTTPCMN EQU   32                  PRINT NAME FOR COMMISSION                    
FFTTPGRS EQU   33                  PRINT NAME FOR GROSS                         
FFTTPDIS EQU   34                  PRINT NAME FOR DISCOUNT                      
FFTTPSUR EQU   35                  PRINT NAME FOR SURCHARGE                     
FFTTTHED EQU   36                  TIME HEADING                                 
FFTTCHED EQU   37                  COST HEADING                                 
FFTTKREF EQU   38                  KEY REFERENCE NUMBER FOR BANK VOID           
FFTTVATO EQU   39                  PRINT NAME FOR VAT                           
FFTTIVTO EQU   40                  PRINT NAME FOR INVOICE TOTAL                 
FFTTCSTO EQU   41                  PRINT NAME FOR COST SUB-TOTAL                
FFTTTIMO EQU   42                  PRINT NAME FOR TIME SUB-TOTAL                
FFTTSQLI EQU   43                  SQL SERVER ID                                
FFTTINVN EQU   44                  SUPPLIER INVOICE NUMBER                      
FFTTSATN EQU   45                  SHIP TO ATTENTION NAME                       
FFTTCONV EQU   46                  CONVERSION ACCOUNT                           
FFTTVEND EQU   47                  COKE VENDOR NUMBER                           
FFTTGLNO EQU   48                  COKE GENERAL LEDGER PRODUCT NUMBER           
FFTTBSTO EQU   49                  PRINT NAME FOR BILL SUB-TOTAL                
FFTTPRBO EQU   50                  PRINT NAME FOR PREVIOUS BILLING              
FFTTCDPT EQU   51                  COKE DEPARTMENT NUMBER                       
FFTTTBSN EQU   52                  MEMO BILL NUMBER (TBS ONLY)                  
FFTTPPTA EQU   52                  PRINT NAME FOR PLEASE PAY THIS AMNT          
FFTTCRAM EQU   53                  PRINT NAME FOR CREDIT AMOUNT                 
FFTTCLIC EQU   54                  CLIENT CODE FOR GROUP LIST                   
FFTTBSNM EQU   55                  BILL SECTION NAME                            
FFTTSECN EQU   56                  PRINT NAME FOR BILL SECTION NAME             
FFTTSUBT EQU   57                  PRINT NAME FOR BILL SECTION SUBTOTAL         
FFTTORDC EQU   58                  ORDER CLOSE                                  
FFTTINDL EQU   59                  INDIRECT CLIENT LIST (NEW COST)              
FFTTVTAG EQU   60                  PRINT NAME FOR VAT AGENCY AMOUNT             
FFTTMRKT EQU   61                  MARKET CODE FOR MX TRANSFER                  
FFTTBACS EQU   62                  BACS HEADER APPLICATION                      
FFTTCOMR EQU   63                  SPECIAL COMMISSION RATE  (4DP)               
FFTTREGN EQU   64                  REGION CODE FOR PRINT MX TRANSFER            
FFTTDIST EQU   65                  DISTRICT CODE FOR PRINT MX TRANSFER          
FFTTTOSD EQU   66                  TRANSFER ORIGINAL SEQUENCE DATA              
FFTTMTRA EQU   67                  MEDIA TRANSFER INFO                          
FFTTWRKC EQU   68                  WORKCODE                                     
FFTTGLDA EQU   69                  GENERAL LEDGER DESTINATION ACCOUNT           
*                                                                               
*&&UK                                                                           
FFTTCAMN EQU   219                 CAMPAIGN NAME (ME14 SR POSTING)              
FFTTCAMR EQU   220                 CAMPAIGN REF. (ME14 SR POSTING)              
*&&                                                                             
FFTTFEER EQU   221                 FEE REPORT INCLUSION                         
FFTTATRB EQU   222                 ATTRIBUTE ACCOUNT (SEE ACGEN6E)              
FFTTAART EQU   223                 AGENT/ARTIST ACCOUNT                         
FFTTCBWO EQU   224                 CBIL WRITE-OFF REFERENCE                     
FFTTPEDT EQU   225                 PERIOD END DATE (FOR CONVERTED TMS)          
FFTTUSID EQU   226                 USER-ID (UK/GERMAN CHEQUE POSTINGS)          
FFTTDEPT EQU   227                 DEPT. CODE (1P HIGH ACCOUNT RECORD)          
FFTTPERS EQU   228                 PERSON CODE (1P LOW ACCOUNT RECORD)          
FFTTBFWD EQU   229                 SAVED BALANCE FORWARD VALUE                  
FFTTCHIN EQU   230                 INTERNAL CHEQUE NUMBER (NEW VOID)            
FFTTAUTR EQU   231                 AUTOREV BILL NUMBER (ON JOB RECORD)          
FFTTIACC EQU   232                 INVESTMENT ACCOUNT FOR SCANDINAVIA           
FFTTITAX EQU   233                 INVESTMENT TAX FOR SCANDINAVIA               
FFTTHGIN EQU   234                 HIGHEST GRP INV NO. (SV LEDGER RECD)         
FFTTVATC EQU   235                 VAT CODE                                     
FFTTOFFC EQU   236                 OFFICE CODE                                  
FFTTETYP EQU   237                 EXPENSE TYPE                                 
FFTTTAXI EQU   238                 TAX INDICATOR (DUTCH SE TRANSACTION)         
FFTTKSVE EQU   239                 KSV SE A/C   (GERMAN SE LEDGER RECD)         
FFTTKSVQ EQU   240                 KSV SQ A/C   (GERMAN SQ LEDGER RECD)         
FFTTKSVT EQU   241                 KSV TYPE     (GERMAN SV/SX ASTKSVTY)         
FFTTVATA EQU   242                 VAT ANALYSIS LINE      (PROD'N BILL)         
FFTTACUR EQU   243                 ASSOCIATED CURRENCY                          
FFTTBLIN EQU   244                 BILL DETAIL LINE       (PROD'N BILL)         
FFTTPGHC EQU   245                 BILL PARAGRAPH COMMENT (PROD'N BILL)         
FFTTEPBC EQU   246                 DUTCH PAYEE POSTBANK A/C CODE                
FFTTEPBT EQU   247                 DUTCH PAYEE POSTBANK TOWN                    
FFTTEPBN EQU   248                 DUTCH PAYEE (POST)BANK A/C NAME              
FFTTEBNC EQU   249                 DUTCH PAYEE BANK A/C CODE                    
FFTTENAM EQU   250                 DUTCH PAYEE A/C NAME                         
*                                                                               
FFTTRPBC EQU   251                 DUTCH PAYER POSTBANK A/C CODE                
FFTTRPBT EQU   252                 DUTCH PAYER POSTBANK TOWN                    
FFTTRPBN EQU   253                 DUTCH PAYER (POST)BANK A/C NAME              
FFTTRBNC EQU   254                 DUTCH PAYER BANK A/C CODE                    
*                                                                               
FFTTFREE EQU   255                 FREE FORM TEXT OR COMMENTS                   
FFTSEQ   DS    XL1                 ELEMENT SEQUENCE NUMBER                      
*++ASSOCIATED FFTLN                                                             
FFTLN1Q  EQU   *-FFTELD                                                         
*                                  ONE OR MORE SUB-ELEMENTS MAY FOLLOW          
*                                  IN THE FOLLOWING FORMAT                      
FFTDLEN  DS    XL1                 ACTUAL LENGTH OF TEXT                        
FFTDATA  DS    0C                  TEXT STRING                                  
         ORG   FFTDATA                                                          
FFTMRKTC DS    CL4                 CODE TYPE = FFTTMRKT                         
FFTMRKTN DS    0C                  NAME                                         
         ORG   FFTDATA                                                          
FFTREGNC DS    CL3                 CODE TYPE = FFTTREGN                         
FFTREGNN DS    0C                  NAME                                         
         ORG   FFTDATA                                                          
FFTDISTC DS    CL3                 CODE TYPE = FFTTDIST                         
FFTDISTN DS    0C                  NAME                                         
         ORG   FFTDATA                                                          
FFTSTDT  DS    PL2                 START DATE YYMM                              
FFTENDT  DS    PL2                 END DATE   YYMM                              
FFTCLT   DS    CL3                 CLIENT                                       
FFTSTAT  DS    XL1                 STATUS BYTE                                  
         ORG   FFTDATA             RESET                                        
FFTSUBSQ DS    XL1                 CODE TYPE = FFTTTOSD, SUB SEQUENCE           
FFTBTREF DS    CL6                 BATCH REFERENCE                              
FFTACTDT DS    XL2                 ACTIVITY DATE                                
FFTORGAM DS    PL6                 ORIGINAL AMOUNT                              
FFT2NDSQ DS    XL1                 2ND SEQUENCE                                 
*++ASSOCIATED FFTLN                                                             
FFTSQLNQ EQU   *-FFTSUBSQ                                                       
         ORG   FFTDATA             RESET                                        
FFTRSYS  DS    CL1                 REDEFINED SYSTEM CODE FROM B1 PROF           
FFTRMED  DS    CL1                 REDEFINED MEDIA CODE FROM B1 PROFILE         
         DS    CL30                SPARE                                        
*++ASSOCIATED FFTLN                                                             
FFTRLNQ  EQU   *-FFTRSYS                                                        
         ORG   FFTDATA             RESET                                        
FFTTGLAC DS    CL14                CODE TYPE = FFTTGLDA (GB/GP ACCT)            
         SPACE 1                                                                
DATELD   DSECT                     ** PROJECT DATE ELEMENT **                   
*++IDENTIFIER                                                                   
DATEL    DS    XL1                 ELEMENT CODE                                 
DATELQ   EQU   X'DC'                                                            
DATLN    DS    XL1                 ELEMENT LENGTH (VARIABLE)                    
DATNUM   DS    XL1                 PROJECT DATE NUMBER                          
DATDONE  DS    PL3                 PROJECT COMPLETION DATE (YYMMDD)             
DATSTAT  DS    XL1                 PROJECT STATUS                               
DATSDONE EQU   X'80'               PROJECT COMPLETED                            
         DS    XL8                 N/D                                          
*++ASSOCIATED DATLN                                                             
DATLN1Q  EQU   *-DATELD                                                         
DATCOMM  DS    0C                  PROJECT COMMENTS (OPTIONAL)                  
         SPACE 1                                                                
AFPELD   DSECT                     ** ARTISTE FEE PAYMENT ELEMENT **            
*++IDENTIFIER                                                                   
AFPEL    DS    XL1                 ELEMENT CODE                                 
AFPELQ   EQU   X'DD'                                                            
AFPLN    DS    XL1                 ELEMENT LENGTH (VARIABLE)                    
AFPPAYNO DS    XL2                 PAYMENT CYCLE NUMBER                         
*++ASSOCIATED AFPLN                                                             
AFPLN1Q  EQU   *-AFPELD                                                         
         SPACE 1                                                                
TAXELD   DSECT                     ** TAX RULES ELEMENT **                      
*++IDENTIFIER                                                                   
TAXEL    DS    XL1                 ELEMENT CODE                                 
TAXIELQ  EQU   X'DE'               INPUT TAX ELEMENTS                           
TAXOELQ  EQU   X'DF'               OUTPUT TAX ELEMENTS                          
TAXLN    DS    XL1                 ELEMENT LENGTH (VARIABLE)                    
TAXTYPE  DS    CL10                TAX TYPE (STANDARD, ZERO ETC.)               
TAXACT   DS    0CL14               TAX (VAT) ACCOUNT                            
TAXACTU  DS    CL1                 UNIT CODE                                    
TAXACTL  DS    CL1                 LEDGER CODE                                  
TAXACTA  DS    CL12                ACCOUNT CODE                                 
TAXRATE  DS    XL2                 TAX RATE (BINARY 2DP)                        
TAXCODE  DS    CL1                 TAX CODE (S, Z, X ETC.)                      
TAXINDS  DS    XL1                 TAX INDICATORS                               
TAXIDFLT EQU   X'80'               DEFAULT INPUT TAX RATE                       
TAXIXMPT EQU   X'40'               EXEMPT OUTPUT TAX RATE                       
         DS    XL2                 N/D                                          
*++ASSOCIATED TAXLN                                                             
TAXLN1Q  EQU   *-TAXELD                                                         
TAXNAME  DS    0CL36               TAX (VAT) ACCOUNT NAME                       
         SPACE 1                                                                
BHDELD   DSECT                     ** BATCH HEADER ELEMENT **                   
*++IDENTIFIER                                                                   
BHDEL    DS    XL1                 ELEMENT CODE                                 
BHDELQ   EQU   X'E0'                                                            
BHDLN    DS    XL1                 ELEMENT LENGTH                               
BHDNAME  DS    CL15                BATCH NAME                                   
BHDITEMC DS    XL2                 ITEM CONTROL TOTAL                           
BHDITEMA DS    XL2                 ITEMS INPUT SO FAR                           
BHDCASHC DS    PL8                 CASH CONTROL TOTAL                           
BHDCASHA DS    PL8                 CASH TOTAL SO FAR                            
BHDLUID  DS    CL8                 LUID OF INPUTTING TERMINAL                   
BHDIBNO  DS    XL2                 INPUT BATCHER NUMBER                         
BHDAPRVR DS    XL2                 BATCH APPROVER                               
BHDSTAT1 DS    XL1                 STATUS - 1                                   
BHDSACRU EQU   X'80'               ACCRUAL BATCH                                
BHDSACRV EQU   X'40'               ACCRUAL REVERSAL BATCH                       
BHDSCOPY EQU   X'20'               BATCH ITEMS COPIED FROM ANOTHER              
BHDSREVS EQU   X'10'               BATCH ITEMS REVERSED FROM ANOTHER            
BHDSGENE EQU   X'08'               BATCH GENERATED FROM ANOTHER                 
BHDSPEND EQU   X'04'               BATCH UPDATE PENDING - DUPLICATE PP          
BHDSDORD EQU   X'02'               DELETED SAVED/OPEN BATCH HAD ORDERS          
BHDSNREV EQU   X'01'               DON'T ALLOW BATCH/REVERSE                    
BHDSTAT2 DS    XL1                 STATUS - 2                                   
BHDSSPIN EQU   X'80'               BATCH CONTAINS SPLIT INVOICE ITEMS           
*&&UK                                                                           
BHDSSECC EQU   X'40'               BATCH CONTROL IN 2ND CURRENCY                
*&&                                                                             
BHDWDAYS DS    XL1                 NUMBER OF WARNING DAYS (FOR JOURNAL)         
BHDDELDT DS    XL2                 DATE BATCH DELETED                           
BHDDELER DS    XL2                 BATCH DELETER                                
BHDDELIT DS    XL2                 NUMBER OF DELETED ITEMS IN BATCH             
BHDHISNO DS    XL2                 HIGHEST ITEM SCREEN NUMBER                   
         DS    XL1                 N/D                                          
*++ASSOCIATED BHDLN                                                             
BHDLNQ   EQU   *-BHDELD                                                         
BHDTOTDR DS    PL8                 TOTAL DEBITS                                 
BHDTOTCR DS    PL8                 TOTAL CREDITS                                
*++ASSOCIATED BHDLN                                                             
BHDLN2Q  EQU   *-BHDELD                                                         
         SPACE 1                                                                
SFSELD   DSECT                     ** SCREEN FIELD SAVE ELEMENT **              
*++IDENTIFIER                                                                   
SFSEL    DS    XL1                 ELEMENT CODE                                 
SFSELQ   EQU   X'E1'                                                            
SFSLN    DS    XL1                 ELEMENT LENGTH (VARIABLE)                    
SFSFLDN  DS    XL1                 FIELD NUMBER                                 
SFSSYSQ  EQU   200                 HIGH VALUE OF SYSTEM GLOBAL FIELD            
*++ASSOCIATED SFSLN                                                             
SFSLN1Q  EQU   *-SFSELD                                                         
SFSFIELD DS    0C                  SCREEN FIELD VALUE                           
         SPACE 1                                                                
ASKELD   DSECT                     ** ACCOUNT SYSTEM KEY ELEMENT **             
*++IDENTIFIER                                                                   
ASKEL    DS    XL1                 ELEMENT CODE                                 
ASKELQ   EQU   X'E2'                                                            
ASKLN    DS    XL1                 ELEMENT LENGTH                               
ASKSEQN  DS    XL1                 ELEMENT SEQUENCE NUMBER                      
ASKKEY   DS    XL42                KEY VALUE                                    
*++ASSOCIATED ASKLN                                                             
ASKLNQ   EQU   *-ASKELD                                                         
         SPACE 1                                                                
BSCELD   DSECT                     ** BILLING SOURCE ELEMENT **                 
*++IDENTIFIER                                                                   
BSCEL    DS    XL1                 ELEMENT CODE                                 
BSCELQ   EQU   X'E3'                                                            
BSCLN    DS    XL1                 ELEMENT LENGTH                               
BSCBSRC  DS    0CL12               BILLING SOURCE                               
         SPACE 1                                                                
ITCELD   DSECT                     ** INPUT TAX TYPE ELEMENT **                 
*++IDENTIFIER                                                                   
ITCEL    DS    XL1                 ELEMENT CODE                                 
ITCELQ   EQU   X'E4'                                                            
ITCLN    DS    XL1                                                              
ITCEFFD  DS    PL3                 EFFECTIVE DATE                               
ITCTYPE  DS    CL1                 TAX TYPE                                     
ITCPROV  DS    XL2                 PROV, ZEROS FOR GST                          
*++ASSOCIATED ITCLN                                                             
ITCLNQ   EQU   *-ITCELD                                                         
         SPACE 1                                                                
GDAELD   DSECT                     ** GENERAL DATE ELEMENT **                   
*++IDENTIFIER                                                                   
GDAEL    DS    XL1                 ELEMENT CODE                                 
GDAELQ   EQU   X'E5'                                                            
GDALN    DS    XL1                 ELEMENT LENGTH                               
*++IDENTIFIER                                                                   
GDATYPE  DS    XL1                 DATE TYPE                                    
GDATTAXP EQU   1                   TAX POINT                                    
GDATMBD  EQU   2                   MEDIA BILLING DATE                           
GDATAHLD EQU   3                   DATE HELD BY AUTOHOLD PROGRAM                
GDATMHLD EQU   4                   DATE HELD BY MARKER                          
GDATCLR  EQU   5                   CLEARANCES - DATE ITEM WAS CLEARED           
GDATOSTA EQU   6                   ORDER STATUS CHANGE                          
GDATODAT EQU   7                   ORDER DATA CHANGED                           
GDATBILL EQU   8                   PRODUCTION BILL/UNBILL PAIR                  
*&&UK                                                                           
GDATCBWO EQU   9                   CBIL WRITE-OFF DATE                          
GDATBHLD EQU   10                  DATE HELD BY BILLING                         
*&&                                                                             
*&&US                                                                           
GDATBHLD EQU   9                   DATE HELD BY BILLING                         
GDATCBWO EQU   10                  CBIL WRITE-OFF DATE                          
*&&                                                                             
*                                                                               
GDATRTLS EQU   11                  RETAIL START DATE                            
GDATRTLE EQU   12                  RETAIL END DATE                              
GDATDLB  EQU   13                  DATE LAST BILLED                             
GDATERPD EQU   14                  EARLIEST PAYMENT DATE (CREDITORS)            
*&&UK                                                                           
GDAT2CNV EQU   15                  DATE OF 2ND STAGE EURO CONVERSION            
*&&                                                                             
GDATEDI  EQU   16                  EDI TRANSMISSION DATE                        
GDADATE  DS    PL3                 DATE                                         
*&&UK                                                                           
*        ORG   GDADATE                                                          
GDADTE   DS    XL2                 BINARY COMPRESSED DATE (GDAT2CNV)            
*        DS    XL1                 N/D                    (GDAT2CNV)            
*&&                                                                             
*++ASSOCIATED GDALN                                                             
GDALNQ   EQU   *-GDAELD                                                         
GDADATE2 DS    PL3                 DATE                                         
*++ASSOCIATED GDALN                                                             
GDALN2Q  EQU   *-GDAELD                                                         
         SPACE 1                                                                
GLRELD   DSECT                     ** GENERAL LEDGER OFFICE RULES **            
*++IDENTIFIER                                                                   
GLREL    DS    CL1                 ELEMENT CODE                                 
GLRELQ   EQU   X'E6'                                                            
GLRLN    DS    CL1                 ELEMENT LENGTH                               
GLRPRS   DS    CL1                 NUMBER OF OFFICE PAIRS (VARIABLE)            
GLROFFP  DS    0CL4                FOLLOWING IS 4-BYTE OFFICE PAIRS             
GLRSUBO  DS    CL2                 SUBSIDIARY OFFCIE                            
GLRGNLO  DS    CL2                 G/L OFFICE                                   
         SPACE 1                                                                
BICELD   DSECT                     ** BATCH ITEM CHECK ELEMENT **               
*++IDENTIFIER                                                                   
BICEL    DS    XL1                 ELEMENT CODE                                 
BICELQ   EQU   X'E7'                                                            
BICLN    DS    XL1                 ELEMENT LENGTH                               
BICACT   DS    0XL15               BANK ACCOUNT CODE                            
BICACTC  DS    XL1                 COMPANY CODE                                 
BICACTU  DS    CL1                 UNIT CODE                                    
BICACTL  DS    CL1                 LEDGER CODE                                  
BICACTA  DS    CL12                ACCOUNT CODE                                 
BICCAC   DS    0XL15               CONTRA-ACCOUNT CODE                          
BICCACC  DS    XL1                 COMPANY CODE                                 
BICCACU  DS    CL1                 UNIT CODE                                    
BICCACL  DS    CL1                 LEDGER CODE                                  
BICCACA  DS    CL12                ACCOUNT CODE                                 
BICOFF   DS    CL2                 OFFICE CODE                                  
BICCNO   DS    CL6                 CHECK NUMBER                                 
BICDAT   DS    PL3                 CHECK DATE                                   
BICSTA   DS    XL1                 TRANSACTION STATUS                           
BICDEP   DS    PL3                 DEPOSIT DATE                                 
BICAMT   DS    PL6                 CHECK AMOUNT                                 
*++ASSOCIATED BICLN                                                             
BICLN1Q  EQU   *-BICELD                                                         
BICCACN  DS    0CL36               CONTRA-ACCOUNT NAME                          
         SPACE 1                                                                
BIAELD   DSECT                     ** BATCH ITEM AMOUNT ELEMENT **              
*++IDENTIFIER                                                                   
BIAEL    DS    XL1                 ELEMENT CODE                                 
BIAELQ   EQU   X'E8'                                                            
BTAELQ   EQU   X'EC'               TOTAL AMOUNT (FROM BICELS)                   
BIALN    DS    XL1                 ELEMENT LENGTH                               
BIAAMT   DS    PL6                 ITEM AMOUNT                                  
BIAREF   DS    CL6                 ITEM REFERENCE                               
*++ASSOCIATED BIALN                                                             
BIALNQ   EQU   *-BIAELD                                                         
BIASNO   DS    XL2                 SCREEN NUMBER                                
BIASIS   DS    XL1                 SCREEN ITEM SEQUENCE                         
*++ASSOCIATED BIALN                                                             
BIALN2Q  EQU   *-BIAELD                                                         
         SPACE 1                                                                
BIOELD   DSECT                     ** BATCH ITEM ORDER ELEMENT **               
*++IDENTIFIER                                                                   
BIOEL    DS    XL1                 ELEMENT CODE                                 
BIOELQ   EQU   X'E9'                                                            
BIOLN    DS    XL1                 ELEMENT LENGTH                               
BIOONUM  DS    CL6                 ORDER NUMBER                                 
BIOSTAT  DS    CL1                 ORDER STATUS                                 
BIOSPTQ  EQU   FFNSPRTQ            PARTIAL ORDER                                
BIOAMNT  DS    PL6                 ORDER AMOUNT                                 
BIOWORK  DS    CL2                 ORDER WORKCODE                               
*++ASSOCIATED BIOLN                                                             
BIOLNQ   EQU   *-BIOELD            ELEMENT LENGTH                               
BIORTAMT DS    PL6                 RETAIL AMOUNT                                
BIOUTAMT DS    PL4                 USE TAX AMOUNT                               
BIOSTAMT DS    PL6                 SALES TAX/SHIP AMOUNT                        
         DS    XL6                 N/D                                          
*++ASSOCIATED BIOLN                                                             
BIOLN2Q  EQU   *-BIOELD            ELEMENT LENGTH                               
BIOSTOCK DS    CL8                 STOCK NUMBER                                 
BIOSQTY  DS    PL3                 QUANTITY                                     
BIOSAMT  DS    PL6                 PRICE                                        
*++PROCESS OFF                                                                  
BIOSUBQ  EQU   *-BIOSTOCK                                                       
*++PROCESS ON                                                                   
         SPACE 1                                                                
LGLELD   DSECT                     ** LEDGER LOCK ELEMENT **                    
*++IDENTIFIER                                                                   
LGLEL    DS    XL1                 ELEMENT CODE                                 
LGLELQ   EQU   X'EA'                                                            
LGLLN    DS    XL1                 ELEMENT LENGTH                               
LGLDATE  DS    XL3                 DATE LAST LOCKED                             
LGLTIME  DS    PL4                 TIME LAST LOCKED                             
LGLLUID  DS    CL8                 LUID OF LOCKER                               
LGLSTAT  DS    XL1                 STATUS                                       
LGLSLOCK EQU   X'80'               LEDGER IS LOCKED                             
*++ASSOCIATED LGLLN                                                             
LGLLNQ   EQU   *-LGLELD                                                         
         SPACE 1                                                                
LOKELD   DSECT                     ** LOCK ELEMENT **                           
*++IDENTIFIER                                                                   
LOKEL    DS    XL1                 ELEMENT CODE                                 
LOKELQ   EQU   X'EA'                                                            
LOKLN    DS    XL1                 ELEMENT LENGTH                               
LOKDATE  DS    XL3                 DATE LAST LOCKED                             
LOKTIME  DS    PL4                 TIME LAST LOCKED                             
LOKLUID  DS    CL8                 LUID OF LOCKER                               
LOKSTAT  DS    XL1                 STATUS                                       
LOKSLOCK EQU   X'80'               RECORD IS LOCKED                             
*++ASSOCIATED LOKLN                                                             
LOKLNQ   EQU   *-LOKELD                                                         
         SPACE 1                                                                
WFMELD   DSECT                     ** WFM JOURNAL POSTING **                    
*++IDENTIFIER                                                                   
WFMEL    DS    XL1                 ELEMENT CODE                                 
WFMELQ   EQU   X'EB'                                                            
WFMLN    DS    XL1                 ELEMENT LENGTH                               
WFMSIN   DS    XL3                 SYSTEM INPUT NUMBER                          
WFMPROG  DS    XL2                 PROGRAM DICTIONARY REFERENCE                 
         DS    XL1                 N/D                                          
*++ASSOCIATED WFMLN                                                             
WFMLNQ   EQU   *-WFMELD                                                         
         SPACE 1                                                                
HLDELD   DSECT                     ** HOLD STATUS ELEMENT **                    
*++IDENTIFIER                                                                   
HLDEL    DS    CL1                 ELEMENT CODE                                 
HLDELQ   EQU   X'ED'                                                            
HLDLN    DS    CL1                 ELEMENT LENGTH                               
HLDSTAT  DS    XL1                 HOLD STATUS                                  
HLDSHFP  EQU   X'80'               HOLD FROM PAYMENTS                           
HLDDATE  DS    XL2                 DATE HOLD STATUS LAST CHANGED                
*++ASSOCIATED HLDLN                                                             
HLDLNQ   EQU   *-HLDELD                                                         
         SPACE 1                                                                
* NOTE X'EC' IN USE ABOVE (BTAELQ)                                              
         SPACE 1                                                                
ASIELD   DSECT                     ** ACCOUNT SYSTEM INTERFACE INFO **          
*++IDENTIFIER                                                                   
ASIEL    DS    XL1                 ELEMENT CODE                                 
ASIELQ   EQU   X'EE'                                                            
ASILN    DS    XL1                 ELEMENT LENGTH                               
ASINDS1  DS    XL1                 INDICATOR BYTE 1                             
ASIUKBDC EQU   X'80'               UK B'CST SUPPLIER    (SETS RSTSBRDC)         
ASIUKPRT EQU   X'40'               UK PRINT SUPPLIER    (SETS RSTSPRNT)         
ASIGERDD EQU   X'20'               GERMAN DD SUPPLIER   (SETS RSTSPLOK)         
ASIMERGE EQU   X'10'               INVOICE MERGE FLAG   (SETS RSTSMSDR)         
*++ASSOCIATED ASILN                                                             
ASILN1Q  EQU   *-ASIELD                                                         
ASIFILT4 DS    CL1                 GERMAN INTERFACES    (SETS RSTFILT4)         
*++ASSOCIATED ASILN                                                             
ASILN2Q  EQU   *-ASIELD                                                         
         SPACE 1                                                                
FFRELD   DSECT                     ** FREE FORM RATE ELEMENT **                 
*++IDENTIFIER                                                                   
FFREL    DS    XL1                 ELEMENT CODE                                 
FFRELQ   EQU   X'EF'                                                            
FFRLN    DS    XL1                 ELEMENT LENGTH                               
*++IDENTIFIER                                                                   
FFRTYPE  DS    XL1                 RATE TYPE                                    
FFRTITAX EQU   1                   INVESTMENT TAX RATE                          
*++ASSOCIATED FFRLN                                                             
FFRLN1Q  EQU   *-FFRELD                                                         
*                                                                               
FFRATE   DS    0X                  RATE (DECIMAL PLACES DEPEND ON TYPE)         
         SPACE 1                                                                
ALAELD   DSECT                     ** ACCOUNT LIMIT ACCESS ELEMENT **           
*++IDENTIFIER                                                                   
ALAEL    DS    XL1                 ELEMENT CODE                                 
ALAELQ   EQU   X'F0'                                                            
ALALN    DS    XL1                 ELEMENT LENGTH                               
ALALN1Q  EQU   *-ALAELD                                                         
*                                                                               
ALAOFF   DS    0CL2                LIST OF OFFICE CODES                         
         SPACE 1                                                                
AOLELD   DSECT                     ** ACCOUNT OFFICE LOCK ELEMENT **            
*++IDENTIFIER                                                                   
AOLEL    DS    XL1                 ELEMENT CODE                                 
AOLELQ   EQU   X'F1'                                                            
AOLLN    DS    XL1                 ELEMENT LENGTH                               
*++ASSOCIATED AOLLN                                                             
AOLLN1Q  EQU   *-AOLELD                                                         
*                                                                               
AOLDATA  DS    0X                  LIST OF OFFICE/MONTHS                        
AOLOFF   DS    CL2                 OFFICE CODE                                  
AOLMOS   DS    PL2                 LAST POSTING MONTH ALLOWED                   
*++PROCESS OFF                                                                  
AOLDATAL EQU   *-AOLDATA           LENGTH OF LIST ENTRY                         
*++PROCESS ON                                                                   
         SPACE 1                                                                
RVNELD   DSECT                     ** RECORD REVISION NUMBER ELEMENT **         
*++IDENTIFIER                                                                   
RVNEL    DS    XL1                 ELEMENT CODE                                 
RVNELQ   EQU   X'F2'                                                            
RVNLN    DS    XL1                 ELEMENT LENGTH                               
RVNNO    DS    XL2                 REVISION NUMBER                              
*++ASSOCIATED RVNLN                                                             
RVNLNQ   EQU   *-RVNELD                                                         
         SPACE 1                                                                
MBIELD   DSECT                     ** NEW BILLING XFER(ONLY) ELEMENT **         
*++IDENTIFIER                                                                   
MBIEL    DS    XL1                 ELEMENT CODE                                 
MBIELQ   EQU   X'F3'                                                            
MBILN    DS    XL1                 ELEMENT LENGTH                               
MBISYS   DS    CL1                 MEDIA SYSTEM                                 
MBIMED   DS    CL1                 MEDIA                                        
MBICLI   DS    CL3                 MEDIA BILL CLIENT                            
MBIPRD   DS    CL3                 MEDIA BILL PRODUCT                           
MBIEST   DS    CL3                 MEDIA BILL ESTIMATE                          
MBIMOS   DS    PL2                 MEDIA BILL YM OF SERVICE                     
MBITDAT  DS    XL2                 DATE ACCOUNT ORIGINALLY TRANSFERRED          
MBIRDAT  DS    XL2                 DATE ACCOUNT REVERSED BY THE MY              
         DS    XL9                 N/D                                          
*++ASSOCIATED MBILN                                                             
MBILNQ   EQU   *-MBIELD                                                         
         SPACE 1                                                                
RSFELD   DSECT                     ** RSTFILT NAME/VALUE ELEMENT **             
*++IDENTIFIER                                                                   
RSFEL    DS    XL1                 ELEMENT CODE                                 
RSFELQ   EQU   X'F4'                                                            
RSFLN    DS    XL1                 ELEMENT LENGTH                               
RSFTYPE  DS    XL1                 FILTER VALUE                                 
RSFCODE  DS    CL8                 FILTER CODE                                  
RSFSNAM  DS    CL12                SHORT NAME                                   
RSFLNAM  DS    0CL36               START OF OPTIONAL LONG NAME                  
*++ASSOCIATED RSFLN                                                             
RSFLNQ   EQU   *-RSFELD                                                         
         SPACE 1                                                                
BFSELD   DSECT                     ** BILL FORMAT SORT ELEMENT **               
*++IDENTIFIER                                                                   
BFSEL    DS    XL1                 ELEMENT CODE                                 
BFSELQ   EQU   X'F4'                                                            
BFSLN    DS    XL1                 ELEMENT LENGTH                               
BFSLVL   DS    XL1                 LEVEL OF SUB-SECTION                         
         DS    XL2                 N/D                                          
*++ASSOCIATED BFSLN                                                             
BFSLNQ   EQU   *-BFSELD                                                         
BFSBODYS DS    0XL1                LIST OF BODY FIELD VALUES                    
         SPACE 1                                                                
SPYELD   DSECT                     ** SYSTEM PAYMENT ELEMENT **                 
*++IDENTIFIER                                                                   
SPYEL    DS    XL1                 ELEMENT CODE                                 
SPYELQ   EQU   X'F5'                                                            
SPYLN    DS    XL1                 ELEMENT LENGTH                               
SPYPAYNO DS    XL4                 PAYMENT NUMBER                               
*++IDENTIFIER                                                                   
SPYELTYP DS    XL1                 ELEMENT TYPE                                 
SPYELBNK EQU   1                   CREDIT POSTING TO BANK ACCOUNT               
SPYELCRS EQU   2                   CREDIT POSTING TO SUPPLIER                   
SPYELDRS EQU   3                   DEBIT POSTING TO SUPPLIER                    
SPYELOTH EQU   4                   OTHER POSTING (DISCOUNT ETC.)                
SPYELITE EQU   5                   BATCH ITEM RECORD                            
SPYDATA  DS    0X                                                               
*                                                                               
         ORG   SPYDATA                                                          
SPYOTH   DS    0X                  ** DATA FOR SPYELTYP=SPYELOTH **             
SPYOSUNT DS    CL1                 SUPPLIER UNIT CODE                           
SPYOSLDG DS    CL1                 SUPPLIER LEDGER CODE                         
*++ASSOCIATED SPYLN                                                             
SPYOLN1Q EQU   *-SPYELD                                                         
*                                                                               
         ORG   SPYDATA                                                          
SPYCRS   DS    0X                  ** DATA FOR SPYELTYP=SPYELCRS **             
SPYCSTAT DS    XL1                 PAYMENT STATUS                               
* THINGS LIKE:- CREATED BY A SYSTEM CHEQUE/VOID                                 
*               DRAFT/LIVE ALLOCATION                                           
*               ETC., ETC.                                                      
SPYCPYDT DS    XL2                 PAYMENT DATE                                 
SPYCAALO DS    PL6                 AGENCY AMOUNT ALLOCATED TO CHEQUE            
SPYCAWOF DS    PL6                 AGENCY AMOUNT WRITTEN-OFF                    
SPYCADSC DS    PL6                 AGENCY DISCOUNT AMOUNT TAKEN                 
SPYCDREF DS    CL6                 KEY REFERENCE OF DEBIT POSTING               
SPYCDSUB DS    XL1                 KEY SUB-REFERENCE OF DEBIT POSTING           
*++ASSOCIATED SPYLN                                                             
SPYCLN1Q EQU   *-SPYELD                                                         
SPYCLRAT DS    PL5                 LOCAL EXHANGE RATE USED                      
SPYCLALO DS    PL6                 LOCAL AMOUNT ALLOCATED TO CHEQUE             
SPYCLWOF DS    PL6                 LOCAL AMOUNT WRITTEN-OFF                     
SPYCLDSC DS    PL6                 LOCAL DISCOUNT AMOUNT TAKEN                  
*++ASSOCIATED SPYLN                                                             
SPYCLN2Q EQU   *-SPYELD                                                         
*                                                                               
         ORG   SPYDATA                                                          
SPYDRS   DS    0X                  ** DATA FOR SPYELTYP=SPYELDRS **             
SPYDSTAT DS    XL1                 PAYMENT STATUS                               
SPYDCREF DS    CL6                 KEY REFERENCE OF CREDIT POSTING              
SPYDCSUB DS    XL1                 KEY SUB-REFERENCE OF CREDIT POSTING          
*++ASSOCIATED SPYLN                                                             
SPYDLN1Q EQU   *-SPYELD                                                         
SPYDOPNO DS    XL4                 ORIGINAL PAYMENT NUMBER FOR VOID             
*++ASSOCIATED SPYLN                                                             
SPYDLN2Q EQU   *-SPYELD                                                         
*                                                                               
         ORG   SPYDATA                                                          
SPYBNK   DS    0X                  ** DATA FOR SPYELTYP=SPYELBNK **             
SPYBSTAT DS    XL1                 PAYMENT STATUS                               
SPYBVPND EQU   X'80'               VOID/UNVOID PENDING                          
SPYBSUNT DS    CL1                 SUPPLIER UNIT CODE                           
SPYBSLDG DS    CL1                 SUPPLIER LEDGER CODE                         
SPYBAMNT DS    PL6                 CHEQUE/PAYMENT TOTAL AMOUNT                  
SPYBVUDT DS    XL2                 VOID/UNVOID ACTIVITY DATE                    
*++ASSOCIATED SPYLN                                                             
SPYBLN1Q EQU   *-SPYELD                                                         
*                                                                               
         ORG   SPYDATA                                                          
SPYITE   DS    0X                  ** DATA FOR SPYELTYP=SPYELITE **             
SPYIOPNO DS    XL4                 ORIGINAL PAYMENT NUMBER                      
*++ASSOCIATED SPYLN                                                             
SPYILN1Q EQU   *-SPYELD                                                         
         SPACE 1                                                                
BFPELD   DSECT                     ** BILL FORMAT PARAGRAPH ELEMENT **          
*++IDENTIFIER                                                                   
BFPEL    DS    XL1                 ELEMENT CODE                                 
BFPELQ   EQU   X'F5'                                                            
BFPLN    DS    XL1                 ELEMENT LENGTH                               
BFPHGT   DS    XL1                 HEIGHT OF PARAGRAPH                          
BFPHGTMN DS    XL1                 MINUMUM HEIGHT (EXCL. BLANK LINES)           
BFPADV   DS    XL1                 PARAGRAPH IS ADVANCE (BFMKSEQ+1)             
         DS    XL9                 N/D                                          
*++ASSOCIATED BFPLN                                                             
BFPLNQ   EQU   *-BFPELD                                                         
         SPACE 1                                                                
FWTELD   DSECT                     ** FIELDS WITHIN TEXT ELEMENT **             
*++IDENTIFIER                                                                   
FWTEL    DS    XL1                 ELEMENT CODE                                 
FWTELQ   EQU   X'F6'                                                            
FWTLN    DS    XL1                 ELEMENT LENGTH                               
FWTFLD   DS    XL1                 FIELD TYPE (SEE BLFFLD)                      
FWTDATA  DS    0XL12                                                            
FWTCOLF  DS    XL1                 FIELD START (1-132)                          
FWTCOLN  DS    XL1                 FIELD SIZE                                   
FWTLINE  DS    XL1                 LINE NUMBER                                  
         DS    XL1                 N/D                                          
FWTAMT   DS    PL8                 FIELD AMOUNT                                 
*++ASSOCIATED FWTLN                                                             
FWTLNQ   EQU   *-FWTELD                                                         
         SPACE 1                                                                
BFMELD   DSECT                     ** BILLING FORMAT ELEMENT **                 
*++IDENTIFIER                                                                   
BFMEL    DS    XL1                 ELEMENT CODE                                 
BFMELQ   EQU   X'F7'                                                            
BFMLN    DS    XL1                 ELEMENT LENGTH                               
BFMSEQ   DS    XL2                 SEQUENCE NUMBER                              
BFMTYPE  DS    XL1                 ELEMENT TYPE                                 
BFMTFREE EQU   X'01'               ORIGINALLY FREE-FORM TEXT                    
BFMTDATA EQU   X'02'               ORIGINALLY TEXT FROM DATA                    
BFMSTAT1 DS    XL1                 STATUS BYTE                                  
BFMSATT  EQU   X'80'               ATTACHED TO BFMELD WITH SAME BFMSEQ          
BFMSTAG  EQU   X'40'               FREE-FORM TEXT IS TAG TO DATA                
BFMSHAST EQU   X'10'               DATA HAS FREE-FORM TEXT TAG                  
BFMSHEAD EQU   X'08'               TEXT IS HEADLINE                             
BFMSHASH EQU   X'04'               DATA HAS HEADLINE                            
BFMSNUM  EQU   X'02'               DATA IS NUMERICAL                            
BFMSTOT  EQU   X'01'               DATA IS TOTALLED AMOUNT                      
BFMPANEL DS    CL8                 PANEL FIELD KEYWORD                          
BFMBODY  DS    XL1                 BILL BODY FIELD EQUATE (SEE BLFFLD)          
BFMLEFT  DS    XL1                 LEFT COLUMN POSITION                         
BFMTOP   DS    XL1                 TOP LINE POSITION                            
BFMWTH   DS    XL1                 FIELD WIDTH                                  
BFMHGT   DS    XL1                 FORMAT HEIGHT                                
BFMALN   DS    XL1                 TEXT ALIGNMENT                               
BFMALFTQ EQU   0                   LEFT ALIGN                                   
BFMARGTQ EQU   1                   RIGHT ALIGN                                  
BFMACTRQ EQU   2                   CENTRE ALIGN                                 
BFMINDS1 DS    XL1                 INDICATOR BYTE                               
BFMIUND  EQU   X'80'               TEXT IS UNDERLINED                           
BFMDPER  DS    XL1                 DISPLAYED PER (BILL BODY ONLY)               
BFMDPDEF EQU   X'00'               DEFAULT - DISPLAY PER BFMBODY                
BFMDPTRN EQU   X'FF'               DISPLAY PER TRANSACTION                      
         DS    XL4                 N/D                                          
BFMTLEN  DS    XL2                 TOTAL TEXT LENGTH                            
*++ASSOCIATED BFMLN                                                             
BFMLNQ   EQU   *-BFMELD                                                         
BFMTEXT  DS    0C                  CHARACTER TEXT (EXTENDED IN BFXELD)          
BFMTMAXL EQU   160                 MAXIMUM LENGTH OF BFMTEXT                    
         SPACE 1                                                                
BFXELD   DSECT                     ** EXTRA BILLING FORMAT ELEMENT **           
*++IDENTIFIER                                                                   
BFXEL    DS    XL1                 ELEMENT CODE                                 
BFXELQ   EQU   X'F8'                                                            
BFXLN    DS    XL1                 ELEMENT LENGTH                               
*++ASSOCIATED BFXLN                                                             
BFXLNQ   EQU   *-BFXELD                                                         
BFXTEXT  DS    0C                  EXTENDED TEXT                                
BFXTMAXL EQU   160                 MAXIMUM LENGTH OF BFXTEXT                    
         SPACE 1                                                                
*                                  ** RECORD ACTIVITY ELEMENT **                
*              X'F9'               RESERVED FOR                                 
*                                  ELEMENT IN ACGENRAC                          
*                                                                               
         SPACE 1                                                                
PTRELD   DSECT                     ** POINTER ELEMENT **                        
*++IDENTIFIER                                                                   
PTREL    DS    XL1                 ELEMENT CODE                                 
PTRELQ   EQU   X'FA'                                                            
PTRLN    DS    XL1                 ELEMENT LENGTH                               
PTRTYPE  DS    XL1                 POINTER TYPE                                 
PTRTADV  EQU   1                   ADVERTISER POINTER                           
PTRTRAP  EQU   2                   RECORD ACTIVITY POINTER                      
PTRTREQ  EQU   3                   REQUEST ADDRESSES                            
*++ASSOCIATED PTRLN                                                             
PTRLN1Q  EQU   *-PTRELD                                                         
PTRCODE  DS    0X                  POINTER VALUE                                
         SPACE 1                                                                
DTSELD   DSECT                     ** DATE/TIME STAMP ELEMENT **                
*++IDENTIFIER                                                                   
DTSEL    DS    XL1                 ELEMENT CODE                                 
DTSELQ   EQU   X'FB'                                                            
DTSLN    DS    XL1                 ELEMENT LENGTH                               
DTSTYPE  DS    XL1                 DATA TYPE                                    
DTSTORD  EQU   1                   ORDER    (ON JOB/ORDER RECORDS)              
DTSTINV  EQU   2                   INVOICE  (ON JOB/INVOICE RECORDS)            
DTSTEST  EQU   3                   ESTIMATE (ON JOB/ESTIMATE RECORDS)           
DTSTREQ  EQU   4                   REQUESTED (ON SCRIBE FORMAT RECORDS)         
DTSDATE  DS    XL2                 DATE LAST CHANGED (COMPRESSED)               
DTSTIME  DS    XL3                 TIME LAST CHANGED (BINARY SECONDS)           
*++ASSOCIATED DTSLN                                                             
DTSLNQ   EQU   *-DTSELD                                                         
         SPACE 1                                                                
AGRELD   DSECT                     ** ACCOUNT GROUP POINTER ELEMENT **          
*++IDENTIFIER                                                                   
AGREL    DS    XL1                 ELEMENT CODE                                 
AGRELQ   EQU   X'FC'                                                            
AGRLN    DS    XL1                 ELEMENT LENGTH                               
AGRAGR1  DS    CL3                 ACCOUNT GROUP POINTER 1                      
*++ASSOCIATED AGRLN                                                             
AGRLN1Q  EQU   *-AGRELD                                                         
AGRAGR2  DS    CL3                 ACCOUNT GROUP POINTER 2                      
*++ASSOCIATED AGRLN                                                             
AGRLN2Q  EQU   *-AGRELD                                                         
         SPACE 1                                                                
BTTELD   DSECT                     ** BILLING TOTALS ELEMENT **                 
*++IDENTIFIER                                                                   
BTTEL    DS    XL1                 ELEMENT CODE                                 
BTTELQ   EQU   X'FD'                                                            
BTTLN    DS    XL1                 ELEMENT LENGTH                               
BTTMAINL DS    XL1                 MAIN TOTALS LEFT COLUMN                      
BTTMAINW DS    XL1                 MAIN TOTALS TEXT WIDTH                       
BTTVATL  DS    XL1                 VAT SUMMARY LEFT COLUMN                      
BTTPREVL DS    XL1                 PREVIOUS BILLS LEFT COLUMN                   
BTTINDS1 DS    XL1                 INDICATOR BYTE 1                             
BTTIAVAT EQU   X'80'               APPEND VAT SUMMARY                           
BTTIAVAG EQU   X'40'               APPEND VAT SUMMARY IN AGENCY CURR.           
BTTIAPRV EQU   X'20'               APPEND PREVIOUS BILLS                        
BTTINET  EQU   X'10'               SHOW NET TOTAL                               
BTTICOM  EQU   X'08'               SHOW COMMISSION TOTAL                        
BTTIGRS  EQU   X'04'               SHOW GROSS TOTAL                             
BTTISRCP EQU   X'02'               SHOW SURCHARGE PERCENTAGE                    
BTTIDSCP EQU   X'01'               SHOW DISCOUNT PERCENTAGE                     
BTTINDS2 DS    XL1                 INDICATOR BYTE 2                             
BTTICURT EQU   X'80'               SHOW CURRENCY CODE FOR INVOICE TOTAL         
BTTIPPAY EQU   X'40'               PRINT "PLEASE PAY THIS AMOUNT"               
BTTICRAM EQU   X'20'               PRINT "CREDIT AMOUNT" ON CREDIT BILL         
BTTIVATA EQU   X'10'               SHOW AGENCY VAT AMOUNT                       
         DS    XL8                 N/D                                          
*++ASSOCIATED BTTLN                                                             
BTTLNQ   EQU   *-BTTELD                                                         
         SPACE 1                                                                
OCAELD   DSECT                     ** OTHER CURRENCY AMOUNT ELEMENT **          
*++IDENTIFIER                                                                   
OCAEL    DS    XL1                 ELEMENT CODE                                 
OCAELQ   EQU   X'FE'                                                            
OCALN    DS    XL1                 ELEMENT LENGTH                               
OCANUM   DS    0XL1                NUMBER OF ENTRIES                            
OCAINDS  DS    XL1                 INDICATORS                                   
OCAIDSEC EQU   X'80'               RECORD DENOMINATED IN SECONDARY              
*        EQU   X'40'               N/D                                          
OCANLENB EQU   X'3F'               MAXIMUM NUMBER OF ENTRIES                    
*++ASSOCIATED OCALN                                                             
OCALN1Q  EQU   *-OCAELD                                                         
*                                                                               
OCANTRY  DS    0X                  ONE ENTRY PER VALUE IN RECORD:-              
OCANTYPE DS    XL1                 CASH VALUE TYPE (SEE ACTOBACCOD)             
OCANSEQN DS    XL1                 ELEMENT SEQUENCE NUMBER                      
OCANTR1L EQU   *-OCANTRY                                                        
OCANCASH DS    PL6                 VALUE IN OTHER BASE CURRENCY                 
OCANTRYL EQU   *-OCANTRY                                                        
