*          DATA SET ACMACFDD   AT LEVEL 003 AS OF 02/20/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T611FDD      DATE 02/20/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL78     5    2   78  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL78     6    2   78  A   P    H         T        Y              
MAFMARKH DS    CL8                                                              
MAFMARK  DS    CL1      7    2    1  A   U    H         T        Y              
MAFACCTH DS    CL8                                                              
MAFACCT  DS    CL50     7    5   50  A   P    H         T        Y              
MAFF1H   DS    CL8                                                              
MAFF1    DS    CL1      7   58    1  A   U    H         T        Y              
MAFF2H   DS    CL8                                                              
MAFF2    DS    CL1      7   61    1  A   U    H         T        Y              
MAFF3H   DS    CL8                                                              
MAFF3    DS    CL1      7   64    1  A   U    H         T        Y              
MAFSUBH  DS    CL8                                                              
MAFSUB   DS    CL1      7   67    1  A   U    H         T        Y              
MAFF5H   DS    CL8                                                              
MAFF5    DS    CL1      7   70    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1      8    2    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL50     8    5   50  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      8   58    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1      8   61    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1      8   64    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1      8   67    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1      8   70    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1      9    2    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL50     9    5   50  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1      9   58    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1      9   61    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1      9   64    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1      9   67    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1      9   70    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     10    2    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL50    10    5   50  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     10   58    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     10   61    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     10   64    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     10   67    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     10   70    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     11    2    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL50    11    5   50  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     11   58    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     11   61    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     11   64    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     11   67    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     11   70    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     12    2    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL50    12    5   50  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     12   58    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     12   61    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     12   64    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     12   67    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     12   70    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     13    2    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL50    13    5   50  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     13   58    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     13   61    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     13   64    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     13   67    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     13   70    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     14    2    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL50    14    5   50  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     14   58    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     14   61    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     14   64    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     14   67    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     14   70    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     15    2    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL50    15    5   50  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     15   58    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     15   61    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     15   64    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     15   67    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     15   70    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     16    2    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL50    16    5   50  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     16   58    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     16   61    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     16   64    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     16   67    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     16   70    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     17    2    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL50    17    5   50  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     17   58    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     17   61    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     17   64    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     17   67    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     17   70    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     18    2    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL50    18    5   50  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     18   58    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     18   61    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     18   64    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     18   67    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     18   70    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     19    2    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL50    19    5   50  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     19   58    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     19   61    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     19   64    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     19   67    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     19   70    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     20    2    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL50    20    5   50  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     20   58    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     20   61    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     20   64    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     20   67    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     20   70    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     21    2    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL50    21    5   50  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     21   58    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     21   61    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     21   64    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     21   67    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     21   70    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     22    2    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL50    22    5   50  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     22   58    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     22   61    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     22   64    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     22   67    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     22   70    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     23    2    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL50    23    5   50  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     23   58    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     23   61    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     23   64    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     23   67    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     23   70    1  A   U    H         T        Y              
MAFTBH   DS    CL8                                                              
MAFTB    DS    CL1     24    2    1  A   U    N         T        Y              
MAFLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
MAFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2088 BYTES                            
