*          DATA SET ACMACFFD   AT LEVEL 002 AS OF 07/24/86                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T611FFD      DATE 07/24/86                 
         SPACE 1                                                                
T611FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
MACMSGH  DS    CL8                                                              
MACMSG   DS    CL60     1    2   60  A   P    H         T        Y              
MACSERVH DS    CL8                                                              
MACSERV  DS    CL17     1   63   17  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL6      2    2    6  A   P    H         T        Y              
MACACTH  DS    CL8                                                              
MACACT   DS    CL14     2   12   14  A   U    N    M    T    I   Y              
         DS    CL8                                                              
         DS    CL3      2   28    3  A   P    N         T        Y              
MACKEYH  DS    CL8                                                              
MACKEY   DS    CL16     2   34   16  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      3    2    7  A   P    N         T        Y              
MACOPTH  DS    CL8                                                              
MACOPT   DS    CL68     3   12   68  A   U    N         T        Y              
MACHED1H DS    CL8                                                              
MACHED1  DS    CL78     5    2   78  A   P    H         T        Y              
MACHED2H DS    CL8                                                              
MACHED2  DS    CL78     6    2   78  A   P    H         T        Y              
MACLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
MACWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 430  BYTES                            
