*          DATA SET ACMACFED   AT LEVEL 003 AS OF 07/24/86                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T611FED      DATE 07/24/86                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL78     5    2   78  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL78     6    2   78  A   P    H         T        Y              
MALSTA1H DS    CL8                                                              
MALSTA1  DS    CL1      7    2    1  A   U    H         T        Y              
MALLYN1H DS    CL8                                                              
MALLYN1  DS    CL75     7    5   75  A   P    H         T        Y              
MALSTA2H DS    CL8                                                              
MALSTA2  DS    CL1      8    2    1  A   U    H         T        Y              
MALLYN2H DS    CL8                                                              
MALLYN2  DS    CL75     8    5   75  A   P    H         T        Y              
MALSTA3H DS    CL8                                                              
MALSTA3  DS    CL1      9    2    1  A   U    H         T        Y              
MALLYN3H DS    CL8                                                              
MALLYN3  DS    CL75     9    5   75  A   P    H         T        Y              
MALSTA4H DS    CL8                                                              
MALSTA4  DS    CL1     10    2    1  A   U    H         T        Y              
MALLYN4H DS    CL8                                                              
MALLYN4  DS    CL75    10    5   75  A   P    H         T        Y              
MALSTA5H DS    CL8                                                              
MALSTA5  DS    CL1     11    2    1  A   U    H         T        Y              
MALLYN5H DS    CL8                                                              
MALLYN5  DS    CL75    11    5   75  A   P    H         T        Y              
MALSTA6H DS    CL8                                                              
MALSTA6  DS    CL1     12    2    1  A   U    H         T        Y              
MALLYN6H DS    CL8                                                              
MALLYN6  DS    CL75    12    5   75  A   P    H         T        Y              
MALSTA7H DS    CL8                                                              
MALSTA7  DS    CL1     13    2    1  A   U    H         T        Y              
MALLYN7H DS    CL8                                                              
MALLYN7  DS    CL75    13    5   75  A   P    H         T        Y              
MALSTA8H DS    CL8                                                              
MALSTA8  DS    CL1     14    2    1  A   U    H         T        Y              
MALLYN8H DS    CL8                                                              
MALLYN8  DS    CL75    14    5   75  A   P    H         T        Y              
MALSTA9H DS    CL8                                                              
MALSTA9  DS    CL1     15    2    1  A   U    H         T        Y              
MALLYN9H DS    CL8                                                              
MALLYN9  DS    CL75    15    5   75  A   P    H         T        Y              
MALSTAAH DS    CL8                                                              
MALSTAA  DS    CL1     16    2    1  A   U    H         T        Y              
MALLYNAH DS    CL8                                                              
MALLYNA  DS    CL75    16    5   75  A   P    H         T        Y              
MALSTABH DS    CL8                                                              
MALSTAB  DS    CL1     17    2    1  A   U    H         T        Y              
MALLYNBH DS    CL8                                                              
MALLYNB  DS    CL75    17    5   75  A   P    H         T        Y              
MALSTACH DS    CL8                                                              
MALSTAC  DS    CL1     18    2    1  A   U    H         T        Y              
MALLYNCH DS    CL8                                                              
MALLYNC  DS    CL75    18    5   75  A   P    H         T        Y              
MALSTADH DS    CL8                                                              
MALSTAD  DS    CL1     19    2    1  A   U    H         T        Y              
MALLYNDH DS    CL8                                                              
MALLYND  DS    CL75    19    5   75  A   P    H         T        Y              
MALSTAEH DS    CL8                                                              
MALSTAE  DS    CL1     20    2    1  A   U    H         T        Y              
MALLYNEH DS    CL8                                                              
MALLYNE  DS    CL75    20    5   75  A   P    H         T        Y              
MALSTAFH DS    CL8                                                              
MALSTAF  DS    CL1     21    2    1  A   U    H         T        Y              
MALLYNFH DS    CL8                                                              
MALLYNF  DS    CL75    21    5   75  A   P    H         T        Y              
MALSTAGH DS    CL8                                                              
MALSTAG  DS    CL1     22    2    1  A   U    H         T        Y              
MALLYNGH DS    CL8                                                              
MALLYNG  DS    CL75    22    5   75  A   P    H         T        Y              
MALSTAHH DS    CL8                                                              
MALSTAH  DS    CL1     23    2    1  A   U    H         T        Y              
MALLYNHH DS    CL8                                                              
MALLYNH  DS    CL75    23    5   75  A   P    H         T        Y              
MALTABH  DS    CL8                                                              
MALTAB   DS    CL1     24    2    1  A   U    N         T        Y              
MALLAST  DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
MALWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1748 BYTES                            
