*          DATA SET ACMRKE1D   AT LEVEL 001 AS OF 04/24/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T616E1D      DATE 04/24/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL10     4    2   10  L  P N             T        Y              
INPACCH  DS    CL8                                                              
INPACC   DS    CL68     4   13   68  A  P H             T        Y              
INPHEDH  DS    CL8                                                              
INPHED   DS    CL75     5    2   75  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL3      5   78    3  L  P H             T        Y              
INPHD2H  DS    CL8                                                              
INPHD2   DS    CL75     6    2   75  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL3      6   78    3  A  P H             T        Y              
INPDETH  DS    CL8                                                              
INPDET   DS    CL75     7    2   75  A  P N             T        Y              
INPMRKH  DS    CL8                                                              
INPMRK   DS    CL1      7   78    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75     8    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      8   78    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75     9    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      9   78    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    10    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   78    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    11    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   78    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    12    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   78    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    13    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   78    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    14    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   78    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    15    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   78    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    16    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   78    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    17    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   78    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    18    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   78    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    19    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   78    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    20    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   78    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    21    2   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   78    1  A  U N             T        Y              
INPTOTH  DS    CL8                                                              
INPTOT   DS    CL78    22    2   78  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  A  P N             T        Y              
INPPFKH  DS    CL8                                                              
INPPFK   DS    CL78    24    2   78  A  P H             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1928 BYTES                            
