*          DATA SET ACMRKF3D   AT LEVEL 001 AS OF 04/24/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T616F3D      DATE 04/24/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL18     6    2   18  L  P H             T        Y              
AUTLDGH  DS    CL8                                                              
AUTLDG   DS    CL1      6   22    1  A  U H             T    I   Y    1         
AUTLDGX  DS    CL8                                                              
AUTLDGNH DS    CL8                                                              
AUTLDGN  DS    CL36     6   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18     7    2   18  L  P H             T        Y              
AUTSUPH  DS    CL8                                                              
AUTSUP   DS    CL56     7   22   56  A  U H             T        Y    2         
AUTSUPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     8    2   18  L  P N             T        Y              
AUTOFFH  DS    CL8                                                              
AUTOFF   DS    CL2      8   22    2  A  U H             T        Y    3         
AUTOFFX  DS    CL8                                                              
AUTOFFNH DS    CL8                                                              
AUTOFFN  DS    CL36     8   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18     9    2   18  L  P N             T        Y              
AUTSRCH  DS    CL8                                                              
AUTSRC   DS    CL14     9   22   14  A  U H             T        Y    4         
AUTSRCX  DS    CL8                                                              
AUTSRCNH DS    CL8                                                              
AUTSRCN  DS    CL36     9   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18    10    2   18  L  P N             T        Y              
AUTREFH  DS    CL8                                                              
AUTREF   DS    CL13    10   22   13  A  U H             T        Y    5         
AUTREFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    11    2   18  L  P N             T        Y              
AUTPERH  DS    CL8                                                              
AUTPER   DS    CL17    11   22   17  A  U H             T        Y    6         
AUTPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    12    2   18  L  P N             T        Y              
AUTADAH  DS    CL8                                                              
AUTADA   DS    CL17    12   22   17  A  U H             T        Y    7         
AUTADAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    13    2   18  L  P N             T        Y              
AUTMOAH  DS    CL8                                                              
AUTMOA   DS    CL13    13   22   13  A  U H             T        Y    8         
AUTMOAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    14    2   18  L  P N             T        Y              
AUTAUTH  DS    CL8                                                              
AUTAUT   DS    CL4     14   22    4  A  U H             T        Y    9         
AUTAUTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL25    24    2   25  L  P H             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 688  BYTES                            
