*          DATA SET ACMRKF9D   AT LEVEL 002 AS OF 06/18/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T616F9D      DATE 06/18/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL18     6    2   18  L  P H             T        Y              
RECBNKH  DS    CL8                                                              
RECBNK   DS    CL56     6   22   56  A  U H             T    I   Y    1         
RECBNKX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     7    2   18  L  P N             T        Y              
RECOFFH  DS    CL8                                                              
RECOFF   DS    CL2      7   22    2  A  U H             T        Y    2         
RECOFFX  DS    CL8                                                              
RECOFFNH DS    CL8                                                              
RECOFFN  DS    CL36     7   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL14     8    2   14  L  P N             T        Y              
RECCONH  DS    CL8                                                              
RECCON   DS    CL14     8   22   14  A  U H             T        Y    3         
RECCONX  DS    CL8                                                              
RECCONNH DS    CL8                                                              
RECCONN  DS    CL36     8   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18     9    2   18  L  P N             T        Y              
RECREFH  DS    CL8                                                              
RECREF   DS    CL13     9   22   13  A  U H             T        Y    4         
RECREFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    10    2   18  L  P N             T        Y              
RECPERH  DS    CL8                                                              
RECPER   DS    CL17    10   22   17  A  U H             T        Y    5         
RECPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    11    2   18  L  P N             T        Y              
RECADAH  DS    CL8                                                              
RECADA   DS    CL17    11   22   17  A  U H             T        Y    6         
RECADAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    12    2   18  L  P N             T        Y              
RECMOAH  DS    CL8                                                              
RECMOA   DS    CL13    12   22   13  A  U H             T        Y    7         
RECMOAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    13    2   18  L  P N             T        Y              
RECRECH  DS    CL8                                                              
RECREC   DS    CL4     13   22    4  A  U H             T        Y    8         
RECRECX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    14    2   18  L  P N             T        Y              
RECRCPH  DS    CL8                                                              
RECRCP   DS    CL4     14   22    4  A  U H             T        Y    9         
RECRCPX  DS    CL8                                                              
RECSDTTH DS    CL8                                                              
RECSDTT  DS    CL18    16    2   18  L  P N             T        Y              
RECSDTH  DS    CL8                                                              
RECSDT   DS    CL8     16   22    8  A  U H             T        Y   10         
RECSDTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL25    24    2   25  L  P H             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 688  BYTES                            
