*          DATA SET ACMRKFFD   AT LEVEL 010 AS OF 04/19/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T616FFD      DATE 04/19/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
MRKMSGH  DS    XL8                                                              
MRKMSG   DS    CL60     1    2   60  L  P H             T        Y              
MRKSRVH  DS    XL8                                                              
MRKSRV   DS    CL17     1   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     2    2   10  L  P H             T        Y              
MRKTYPH  DS    XL8                                                              
MRKTYP   DS    CL10     2   13   10  A  U N             T    I   Y    1         
MRKTYPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     2   32   10  L  P H             T        Y              
MRKACTH  DS    XL8                                                              
MRKACT   DS    CL10     2   43   10  A  U N             T        Y    2         
MRKACTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      2   64    8  L  P N             T        Y              
MRKREPH  DS    XL8                                                              
MRKREP   DS    CL3      2   73    3  A  U H             T        Y    3         
MRKREPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     3    2   10  L  P N             T        Y              
MRKOPTH  DS    XL8                                                              
MRKOPT   DS    CL48     3   13   48  A  U H        M    T        Y    4         
MRKOPTX  DS    XL8                                                              
MRKSCRLH DS    XL8                                                              
MRKSCRL  DS    CL8      3   64    8  L  P N             T        Y              
MRKSCRH  DS    XL8                                                              
MRKSCR   DS    CL8      3   73    8  A  U H        M    T        Y    5         
MRKSCRX  DS    XL8                                                              
MRKOLAYH DS    XL8                                                              
MRKOLAY  DS    CL1      4    2    1  A  P N             T        Y              
         DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 352  BYTES                            
