*          DATA SET ACMRKD7D   AT LEVEL 024 AS OF 04/19/06                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T616D7D      DATE 04/19/06                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL18     6    2   18  L  P H             T        Y              
MATLDGH  DS    XL8                                                              
MATLDG   DS    CL1      6   22    1  A  U H             T    I   Y    1         
MATLDGX  DS    XL8                                                              
MATLDGNH DS    XL8                                                              
MATLDGN  DS    CL36     6   42   36  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL18     7    2   18  L  P N             T        Y              
MATMEDH  DS    XL8                                                              
MATMED   DS    CL2      7   22    2  A  U N             T        Y    2         
MATMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18     8    2   18  L  P H             T        Y              
MATCLTH  DS    XL8                                                              
MATCLT   DS    CL3      8   22    3  A  U H             T        Y    3         
MATCLTX  DS    XL8                                                              
MATCLTNH DS    XL8                                                              
MATCLTN  DS    CL36     8   42   36  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL18     9    2   18  L  P N             T        Y              
MATPRDH  DS    XL8                                                              
MATPRD   DS    CL3      9   22    3  A  U N             T        Y    4         
MATPRDX  DS    XL8                                                              
MATPRDNH DS    XL8                                                              
MATPRDN  DS    CL36     9   42   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL18    10    2   18  L  P N             T        Y              
MATESTH  DS    XL8                                                              
MATEST   DS    CL6     10   22    6  A  U N             T        Y    5         
MATESTX  DS    XL8                                                              
MATESTNH DS    XL8                                                              
MATESTN  DS    CL36    10   42   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11    2   10  L  P H             T        Y              
MATMOSH  DS    XL8                                                              
MATMOS   DS    CL13    11   22   13  A  U H             T        Y    9         
MATMOSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    12    2   18  L  P N             T        Y              
MATSELH  DS    XL8                                                              
MATSEL   DS    CL4     12   22    4  A  U N             T        Y   10         
MATSELX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL25    24    2   25  L  P H             T        Y              
         DS    XL1                                                              
         DS    XL2    INDICS=11                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 536  BYTES                            
