*          DATA SET ACMRKEDD   AT LEVEL 001 AS OF 08/02/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T616EDD      DATE 08/02/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL18     6    2   18  L  P H             T        Y              
MANLDGH  DS    CL8                                                              
MANLDG   DS    CL1      6   22    1  A  U H             T    I   Y    9         
MANLDGX  DS    CL8                                                              
MANLDGNH DS    CL8                                                              
MANLDGN  DS    CL36     6   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18     7    2   18  L  P H             T        Y              
MANSUPH  DS    CL8                                                              
MANSUP   DS    CL56     7   22   56  A  U H             T        Y   10         
MANSUPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     8    2   18  L  P H             T        Y              
MANBNKH  DS    CL8                                                              
MANBNK   DS    CL56     8   22   56  A  U H             T        Y    1         
MANBNKX  DS    CL8                                                              
MANBOFTH DS    CL8                                                              
MANBOFT  DS    CL18     9    2   18  L  P H             T        Y              
MANBOFH  DS    CL8                                                              
MANBOF   DS    CL2      9   22    2  A  U H             T        Y    2         
MANBOFX  DS    CL8                                                              
MANBOFNH DS    CL8                                                              
MANBOFN  DS    CL36     9   42   36  A  P H             T        Y              
MANCHQTH DS    CL8                                                              
MANCHQT  DS    CL18    10    2   18  L  P H             T        Y              
MANCHQH  DS    CL8                                                              
MANCHQ   DS    CL6     10   22    6  A  U H             T        Y    3         
MANCHQX  DS    CL8                                                              
MANCDTTH DS    CL8                                                              
MANCDTT  DS    CL18    10   42   18  L  P H             T        Y              
MANCDTH  DS    CL8                                                              
MANCDT   DS    CL8     10   62    8  A  U H             T        Y    4         
MANCDTX  DS    CL8                                                              
MANCAMTH DS    CL8                                                              
MANCAMT  DS    CL18    11    2   18  L  P H             T        Y              
MANCAMH  DS    CL8                                                              
MANCAM   DS    CL13    11   22   13  A  U H             T        Y    5         
MANCAMX  DS    CL8                                                              
MANBRFTH DS    CL8                                                              
MANBRFT  DS    CL18    12    2   18  L  P N             T        Y              
MANBRFH  DS    CL8                                                              
MANBRF   DS    CL4     12   22    4  A  U H             T        Y    6         
MANBRFX  DS    CL8                                                              
MANBMOTH DS    CL8                                                              
MANBMOT  DS    CL18    12   42   18  L  P N             T        Y              
MANBMOH  DS    CL8                                                              
MANBMO   DS    CL6     12   62    6  A  U H             T        Y    7         
MANBMOX  DS    CL8                                                              
MANBNATH DS    CL8                                                              
MANBNAT  DS    CL18    13    2   18  L  P N             T        Y              
MANBNAH  DS    CL8                                                              
MANBNA   DS    CL15    13   22   15  A  U H             T        Y    8         
MANBNAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    15    2   18  L  P N             T        Y              
MANOFFH  DS    CL8                                                              
MANOFF   DS    CL2     15   22    2  A  U H             T        Y   11         
MANOFFX  DS    CL8                                                              
MANOFFNH DS    CL8                                                              
MANOFFN  DS    CL36    15   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL14    16    2   14  L  P N             T        Y              
MANCONH  DS    CL8                                                              
MANCON   DS    CL14    16   22   14  A  U H             T        Y   12         
MANCONX  DS    CL8                                                              
MANCONNH DS    CL8                                                              
MANCONN  DS    CL36    16   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL14    17    2   14  L  P N             T        Y              
MANSRCH  DS    CL8                                                              
MANSRC   DS    CL14    17   22   14  A  U H             T        Y   13         
MANSRCX  DS    CL8                                                              
MANSRCNH DS    CL8                                                              
MANSRCN  DS    CL36    17   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18    18    2   18  L  P N             T        Y              
MANREFH  DS    CL8                                                              
MANREF   DS    CL13    18   22   13  A  U H             T        Y   14         
MANREFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    19    2   18  L  P N             T        Y              
MANPERH  DS    CL8                                                              
MANPER   DS    CL17    19   22   17  A  U H             T        Y   15         
MANPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    20    2   18  L  P N             T        Y              
MANADAH  DS    CL8                                                              
MANADA   DS    CL17    20   22   17  A  U H             T        Y   16         
MANADAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    21    2   18  L  P N             T        Y              
MANMOAH  DS    CL8                                                              
MANMOA   DS    CL13    21   22   13  A  U H             T        Y   17         
MANMOAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL25    24    2   25  L  P H             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1224 BYTES                            
