*          DATA SET ACMRKF4D   AT LEVEL 001 AS OF 07/17/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T616F4D      DATE 07/17/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL18     6    2   18  L  P H             T        Y              
SELLDGH  DS    CL8                                                              
SELLDG   DS    CL1      6   22    1  A  U H             T    I   Y    1         
SELLDGX  DS    CL8                                                              
SELLDGNH DS    CL8                                                              
SELLDGN  DS    CL36     6   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18     7    2   18  L  P H             T        Y              
SELSUPH  DS    CL8                                                              
SELSUP   DS    CL56     7   22   56  A  U H             T        Y    2         
SELSUPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     8    2   18  L  P N             T        Y              
SELOFFH  DS    CL8                                                              
SELOFF   DS    CL2      8   22    2  A  U H             T        Y    3         
SELOFFX  DS    CL8                                                              
SELOFFNH DS    CL8                                                              
SELOFFN  DS    CL36     8   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18     9    2   18  L  P N             T        Y              
SELCONH  DS    CL8                                                              
SELCON   DS    CL14     9   22   14  A  U H             T        Y    4         
SELCONX  DS    CL8                                                              
SELCONNH DS    CL8                                                              
SELCONN  DS    CL36     9   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18    10    2   18  L  P N             T        Y              
SELSRCH  DS    CL8                                                              
SELSRC   DS    CL14    10   22   14  A  U H             T        Y    5         
SELSRCX  DS    CL8                                                              
SELSRCNH DS    CL8                                                              
SELSRCN  DS    CL36    10   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18    11    2   18  L  P N             T        Y              
SELREFH  DS    CL8                                                              
SELREF   DS    CL13    11   22   13  A  U H             T        Y    6         
SELREFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    12    2   18  L  P N             T        Y              
SELPERH  DS    CL8                                                              
SELPER   DS    CL17    12   22   17  A  U H             T        Y    7         
SELPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    13    2   18  L  P N             T        Y              
SELADAH  DS    CL8                                                              
SELADA   DS    CL17    13   22   17  A  U H             T        Y    8         
SELADAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    14    2   18  L  P N             T        Y              
SELMOAH  DS    CL8                                                              
SELMOA   DS    CL13    14   22   13  A  U H             T        Y    9         
SELMOAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    15    2   18  L  P N             T        Y              
SELSELH  DS    CL8                                                              
SELSEL   DS    CL4     15   22    4  A  U H             T        Y   10         
SELSELX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL25    24    2   25  L  P H             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 784  BYTES                            
