*          DATA SET ACMRKDAD   AT LEVEL 001 AS OF 08/02/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T616DAD      DATE 08/02/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL50     5    2   50  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL18     7    2   18  L  P N             T        Y              
PWIBANKH DS    CL8                                                              
PWIBANK  DS    CL12     7   22   12  L  P N             T        Y              
PWIBANNH DS    CL8                                                              
PWIBANN  DS    CL36     7   42   36  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL18     8    2   18  L  P N             T        Y              
PWISUPPH DS    CL8                                                              
PWISUPP  DS    CL14     8   22   14  L  P N             T        Y              
PWISUPNH DS    CL8                                                              
PWISUPN  DS    CL36     8   42   36  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL18     9    2   18  L  P N             T        Y              
PWICHQNH DS    CL8                                                              
PWICHQN  DS    CL6      9   22    6  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    10    2   18  L  P N             T        Y              
PWICHQDH DS    CL8                                                              
PWICHQD  DS    CL8     10   22    8  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    11    2   18  L  P N             T        Y              
PWICHQAH DS    CL8                                                              
PWICHQA  DS    CL13    11   22   13  L  P N             T        Y              
PWICU1TH DS    CL8                                                              
PWICU1T  DS    CL15    12    2   15  L  P N             T        Y              
PWICUC1H DS    CL8                                                              
PWICUC1  DS    CL3     12   18    3  L  P N             T        Y              
PWICHQCH DS    CL8                                                              
PWICHQC  DS    CL14    12   22   14  L  P N             T        Y              
PWIRATTH DS    CL8                                                              
PWIRATT  DS    CL18    12   42   18  L  P N             T        Y              
PWIRATH  DS    CL8                                                              
PWIRAT   DS    CL18    12   62   18  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    14    2   18  L  P H             T        Y              
PWIAMTH  DS    CL8                                                              
PWIAMT   DS    CL13    14   22   13  A  U H             T        Y              
PWICU2TH DS    CL8                                                              
PWICU2T  DS    CL15    15    2   15  L  P H             T        Y              
PWICUC2H DS    CL8                                                              
PWICUC2  DS    CL3     15   18    3  L  P H             T        Y              
PWIAMCH  DS    CL8                                                              
PWIAMC   DS    CL14    15   22   14  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL18    16    2   18  L  P H             T        Y              
PWIOFFH  DS    CL8                                                              
PWIOFF   DS    CL2     16   22    2  A  U H             T        Y              
PWIOFFNH DS    CL8                                                              
PWIOFFN  DS    CL36    16   42   36  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL18    18    2   18  L  P H             T        Y              
PWINARH  DS    CL8                                                              
PWINAR   DS    CL58    18   22   58  L  U H             T        Y              
PWITABH  DS    CL8                                                              
PWITAB   DS    CL1     19   22    1  A  U N             T        Y              
PWIPFKH  DS    CL8                                                              
PWIPFK   DS    CL78    24    2   78  L  P H             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 856  BYTES                            
