*          DATA SET ACMRKWRK   AT LEVEL 234 AS OF 03/08/18                      
WORKD    DSECT                     ** GLOBAL WORKING STORAGE **                 
*                                                                               
FF       EQU   X'FF'                                                            
BT1      EQU   1                   INVOICES                                     
BT3      EQU   3                   SYSTEM CHEQUE ON BANK LEDGER (CR)            
BT36     EQU   36                  MANUAL CHEQUE                                
BT37     EQU   37                  VOID CHEQUE                                  
BT57     EQU   57                  TRANSFER (GERMANY)                           
BT60     EQU   60                  PAYMENT (UK)                                 
BT64     EQU   64                  MEDIA RECONCILIATION                         
BT65     EQU   65                  DIFFERENCE ACCOUNT POSTINGS                  
BT21     EQU   21                  INVOICES                                     
BT129    EQU   129                 SYSTEM CHEQUE ON VENDOR LEDGER (DR)          
*                                                                               
*                                                                               
GRDPDATQ EQU   23                  POSITION OF DATA IN GRID MESSAGE             
GRDSTRTQ EQU   15                  POSITION OF GRID START LINE                  
CTRYALLQ EQU   X'FF'               EVERY COUNTRY IN THE KNOWN UNIVERSE          
*                                                                               
TMPEXDF  DS    PL6                                                              
NUMELEMS DS    XL1                 NUMBER OF ELEMENTS FOUND                     
ELTOSKIP DS    XL1                 ELEMENTS TO SKIP THIS TIME                   
RNDING   EQU   10                                                               
DUB      DS    D                                                                
DUB1     DS    D                                                                
DUB2     DS    D                                                                
PKWK16A  DS    PL16                                                             
PKWK16B  DS    PL16                                                             
FULL     DS    F                                                                
FULL2    DS    F                                                                
DMCB     DS    6F                                                               
HALF     DS    H                                                                
FLAG     DS    XL1                                                              
BYTE     DS    XL1                                                              
CHAR     DS    XL1                                                              
BYTE2    DS    XL1                                                              
FLAG2    DS    XL1                                                              
CHAR2    DS    XL1                                                              
PARM     DS    6F                                                               
RELO     DS    F                                                                
SAVERD   DS    F                                                                
SAVER3   DS    F                                                                
SAVERF   DS    F                                                                
THREE    DS    XL3                                                              
LINSUSED DS    XL1                 NUM OF LINES USED BY DATA ITEM               
         DS    5F                  N/D                                          
*                                                                               
AINP     DS    A                                                                
ATWA     DS    A                                                                
ATIA     DS    A                                                                
ACOM     DS    A                                                                
AUTL     DS    A                                                                
OVERLAY  DS    A                   A(OVERLAY PHASE)                             
OVERSPEC DS    A                   A(OVERLAY SPEC PHASE)                        
OVERHOOK DS    A                   A(OVERLAY PRINTING HOOK)                     
         DS    8A                  N/D                                          
*                                                                               
ATABLES  DS    0A                  ** ROOT TABLE ADDRESSES **                   
AKEYTAB  DS    A                   A(KEY BUILD TABLE)                           
ADISTAB  DS    A                   A(DISPLAY BUILD TABLE)                       
AMIDTAB  DS    A                   A(MARKER ID TABLE)                           
ASUDTAB  DS    A                   A(SUBSTITUTE DISPLAY BUILD TABLE)            
ADCLISTU DS    A                   A(UPPER CASE DICTIONARY)                     
ADCLISTL DS    A                   A(LOWER CASE DICTIONARY)                     
ATYPTAB  DS    A                   A(RECORD TABLE)                              
AAPFTAB  DS    A                   A(ACTION PFKEY TABLE)                        
AACTTAB  DS    A                   A(ACTION TABLE)                              
ASPFTAB  DS    A                   A(SCROLL PFKEY TABLE)                        
ASCRTAB  DS    A                   A(SCROLL TABLE)                              
AOPTTAB  DS    A                   A(OPTIONS TABLE)                             
APROFDFT DS    A                   A(DEFAULT PROFILES TABLE)                    
AREPSPEC DS    A                   A(REPORT SPEC POOL)                          
AZPFTAB  DS    A                   A(ZOOM PFKEY TABLE)                          
AIOCNTL  DS    A                   A(I/O CONTROL BLOCK)                         
         DS    4A                  N/D                                          
*                                                                               
ALEDGTAB DS    A                   A(LEDGER TABLE)                              
ACURRTAB DS    A                   A(CURRENCY TABLE)                            
AUSEDTAB DS    A                   A(USED MOS TABLE)                            
ATSBINFO DS    A                   A(TSAR BUFFER INFORMATION)                   
ASECBLK  DS    A                   A(SECRET BLOCK)                              
ASCUTOTS DS    A                   A(SECONDARY CURRENCY TOTALS)                 
         DS    5A                  N/D                                          
*                                                                               
AACTTOT  DS    A                   A(ACTION TOTALS TABLE)                       
*                                                                               
AOFFBLK  DS    A                   A(OFFAL BLOCK)                               
APQBUFF  DS    A                   A(PRINT QUEUE BUFFER)                        
AOVERWRK DS    A                   A(OVERLAY WORKING STORAGE)                   
AREPWRK  DS    A                   A(REPORT WORKING STORAGE)                    
ATSARBLK DS    A                   A(TSAR BLOCK)                                
AIOAS    DS    A                   A(I/O AREAS)                                 
ADLCB    DS    A                   A(DOWNLOAD CONTROL BLOCK)                    
ADUMLINE DS    A                   A(DUMMY LINE SCREEN BLOCK)                   
         DS    2A                  N/D                                          
*                                                                               
ROUTS    DS    0A                  ** ROOT ROUTINE ADDRESSES **                 
                                                                                
ROU40    DS    0A                  ** ROOT ROUTINES - 1 **                      
AACCELS  DS    A                   GET ACCOUNT ELEMENTS                         
ABLDCURT DS    A                   BUILD A CURRENCY TABLE ENTRY                 
ABLDCURR DS    A                   BUILD CURRENCIES                             
ABLDDIS  DS    A                   BUILD DISPLAY DISPLACEMENTS                  
ABLDLIN  DS    A                   BUILD A DISPLAY LINE                         
ABLDPFK  DS    A                   BUILD PFKEY DISPLAY LINE                     
ABLDSRC  DS    A                   BUILD SOURCE ULACC FROM CPJEL                
ABLDTOT  DS    A                   BUILD TOTALS HEADINGS & AMOUNTS              
ADISPLAY DS    A                   BUILD & DISPLAY DETAIL LINES                 
AEXTRSL  DS    A                   EXTEND TRANSACTION STATUS ELEMENT            
AFILTER  DS    A                   FILTER TRANSACTIONS                          
AGENFILT DS    A                   GENERAL FILTERS                              
ABLDINV  DS    A                   GET LONG INVOICE AND PUT IN TSARFINV         
ABLDMOS  DS    A                   GET MEDIA MOS AND PUT IT IN TSARFMMD         
ABLDWRKC DS    A                   GET WORK CODE AND PUT IT IN TSARFWRK         
ROU40N   EQU   (*-ROU40)/L'ROU40                                                
                                                                                
ROU41    DS    0A                  ** ROOT ROUTINES - 2 **                      
AGETACC  DS    A                   READ ACCOUNT                                 
AGETLDG  DS    A                   READ LEDGER/PROCESS LEDGER TABLE             
AIOEXEC  DS    A                   IO READ                                      
AOVRSCR  DS    A                   LOAD A SCREEN                                
APROFILE DS    A                   EXTRACT TYPE/ACTION PROFILE                  
APRTCLO  DS    A                   CLOSE REPORT                                 
APRTINI  DS    A                   INITIALISE REPORT & PRINT FIRST PAGE         
AREPTRN  DS    A                   REPORT TRANSACTION POSTING                   
AREPINI  DS    A                   INITIALISE TRANSACTION REPORTING             
ATCLOSE  DS    A                   TEST FOR CLOSED TRANS                        
ATSARADD DS    A                   ADD A TSAR RECORD                            
ATSARGET DS    A                   GET A TSAR RECORD                            
AXMTSCR  DS    A                   XMIT ALL FIELDS ON SCREEN                    
         DS    10A                 N/D                                          
ROU41N   EQU   (*-ROU41)/L'ROU41                                                
                                                                                
ROUTSN   EQU   (*-ROUTS)/L'ROUTS                                                
                                                                                
ROUVS    DS    0A                  ** ROOT VALIDATION ROUTINES **               
ROU42    DS    0A                  ** ROOT ROUTINES - 3 **                      
ABLDBAL  DS    A                   BUILD & DISPLAY ACC NAME & BALANCE           
AEDTRAT  DS    A                   EDIT EXCHANGE RATE                           
AEXCHDF  DS    A                   EXCHANGE DIFFERENCE                          
AFLDVAL  DS    A                   GENERAL FIELD VALIDATION                     
ASETFORE DS    A                   SET FOREIGN CURRENCY ENTRY                   
ASETELAD DS    A                   SET ELEMENT ADDRESSES                        
AVAL1FC  DS    A                   VALIDATE ONE FOREIGN CURRENCY                
AVALACC  DS    A                   VALIDATE ACCOUNT                             
AVALADA  DS    A                   VALIDATE ACTIVITY DATE PERIOD                
AVALAMT  DS    A                   VALIDATE AMOUNT                              
AVALBMO  DS    A                   VALIDATE BATCH MONTH                         
AVALBNA  DS    A                   VALIDATE BATCH NAME                          
AVALBNK  DS    A                   VALIDATE BANK ACCOUNT                        
AVALBRF  DS    A                   VALIDATE BATCH REFERENCE                     
AVALCDT  DS    A                   VALIDATE CHEQUE DATE                         
AVALCHQ  DS    A                   VALIDATE CHEQUE NUMBER                       
AVALCHT  DS    A                   VALIDATE CHEQUE TYPE                         
AVALCLI  DS    A                   VALIDATE CLIENT                              
AVALCOB  DS    A                   VALIDATE BANK ACCOUNT AS CONTRA              
AVALCON  DS    A                   VALIDATE CONTRA ACCOUNT                      
AVALCUR  DS    A                   VALIDATE CURRENCY FILTER                     
AVALDAT  DS    A                   VALIDATE SINGLE DATE                         
AVALICL  DS    A                   VALIDATE INCLUDE                             
AVALIRC  DS    A                   VALIDATE INCLUDE RECEIPTS                    
AVALITE  DS    A                   VALIDATE BATCH ITEM COUNT                    
AVALJOB  DS    A                   VALIDATE JOB                                 
AVALLDG  DS    A                   VALIDATE UNIT & LEDGER (VENDOR)              
AVALMOS  DS    A                   VALIDATE MONTH OF SERVICE RANGE              
AVALMRK  DS    A                   VALIDATE MARK FIELD                          
AVALOFF  DS    A                   VALIDATE OFFICE                              
AVALPER  DS    A                   VALIDATE TRANSACTION DATE PERIOD             
AVALPRO  DS    A                   VALIDATE PRODUCT                             
AVALREF  DS    A                   VALIDATE REFERENCE RANGE                     
AVALSRC  DS    A                   VALIDATE SOURCE ACCOUNT (CPJEL)              
AVALSUP  DS    A                   VALIDATE SUPPLIER                            
AVALWRK  DS    A                   VALIDATE WORKCODE                            
AVALZMRK DS    A                   VALIDATE ZOOM MARK                           
ASTATOUT DS    A                   BUILD A STATUS LINE                          
AZOOMFAC DS    A                   ZOOM FACILITY ROUTINE                        
AVALPUB  DS    A                   TEST/SET SPECIAL PUBLICATION NUMBER          
AVALGAC  DS    A                   VALIDATE ACCOUNT                             
ATSTEUR  DS    A                   TEST IF CURRENCY IS EURO/MEMBER              
AVALUDA  DS    A                   VALIDATE USED DATE PERIOD                    
         DS    7A                  N/D                                          
ROU42N   EQU   (*-ROU42)/L'ROU42                                                
ROUVSN   EQU   (*-ROUVS)/L'ROUVS                                                
*                                                                               
ROU43    DS    0A                  ** ROOT ROUTINES - 4 **                      
AGRDINIT DS    A                   INITIALISE GRID                              
ADISGRID DS    A                   DISPLAY CALL FOR GRID                        
AFGRTSAR DS    A                   FORMAT TSAR TO GRID LINES                    
ADISPDUM DS    A                   DISPLAY DUMMY LINES                          
AUPDGRID DS    A                   UPDATE TSAR RECORDS FROM GRID                
AREPELEM DS    A                   REPLACE ELEMENT ON A RECORD                  
ASCRNCLR DS    A                   CLEAR SCREEN                                 
ASCRNDIM DS    A                   GET SCREEN DIMENSION                         
ATSTCOL  DS    A                   TEST COLUMN                                  
ASUBDIS  DS    A                   TEST SUBSTITUTE COLUMN                       
AGETMID  DS    A                   GET MARKER ID NUMBER FOR GRID                
         DS    3A                  N/D                                          
ROU43N   EQU   (*-ROU43)/L'ROU43                                                
*                                                                               
VCALLOV  DS    V                                                                
VCASHVAL DS    V                                                                
VCUREDIT DS    V                                                                
CUREDIT  EQU   VCUREDIT            FOR USE IN CURED MACRO                       
VDATAMGR DS    V                                                                
VDATCON  DS    V                                                                
VDATVAL  DS    V                                                                
VDICTATE DS    V                                                                
VGETFACT DS    V                                                                
VGETPROF DS    V                                                                
VGETTXT  DS    V                                                                
VHELLO   DS    V                                                                
VHEXIN   DS    V                                                                
VHEXOUT  DS    V                                                                
VPERVAL  DS    V                                                                
VREPORT  DS    V                                                                
VSCANNER DS    V                                                                
VSWITCH  DS    V                                                                
VUNSCAN  DS    V                                                                
VACCEMU  DS    V                   FROM ACCFACS                                 
VADDAY   DS    V                                                                
VBLDCUR  DS    V                                                                
VSECRET  DS    V                                                                
VGETCUR  DS    V                                                                
VPRORATA DS    V                                                                
VEUREKA  DS    V                                                                
VGETDAY  DS    V                                                                
VDLFLD   DS    V                                                                
VXTRAINF DS    V                                                                
         DS    2A                  N/D                                          
*                                                                               
VTSAR    DS    V                   TSAR IS CORERES                              
VOFFAL   DS    V                   OFFAL IS CORERES                             
VSQASHER DS    V                   SQASHER IS CORERES                           
VADDTRN  DS    V                   ADDTRN IS CORERES                            
VGETOPT  DS    V                   GETOPT IS CORERES                            
*                                                                               
VCONVMOS DS    V                   RELOCATED V(CONVMOS)                         
VBMONVAL DS    V                   RELOCATED V(BMONVAL)                         
VPUBVAL  DS    V                   RELOCATED V(PUBVAL)                          
VGETBRD  DS    V                   RELOCATED V(GETBROAD)                        
VACSRCHC DS    V                   RELOCATED V(ACSRCHC)                         
*&&UK                                                                           
VTOBACCO DS    V                   RELOCATED V(TOBACCO)                         
*&&                                                                             
*&&US                                                                           
         DS    A                   N/D (US)                                     
*&&                                                                             
         DS    3A                  N/D                                          
*                                                                               
ADISHEAD DS    A                   INPUT SCREEN A(HEAD LINE)                    
ADISHEA2 DS    A                                A(HEAD2LINE)                    
ADISDET1 DS    A                                A(FIRST DETAIL LINE)            
ADISTOTS DS    A                                A(TOTALS LINE)                  
ADISPFKS DS    A                                A(PFKEY LINE)                   
*                                                                               
AIOSAVE  DS    A                   A(SAVED D/A IODA/IOWORK)                     
AIOBUFF  DS    A                   A(DATA RECORD AREA)                          
AIOBUFFA DS    A                   A(DATA RECORD AREA)                          
AIOSAVE1 DS    A                   A(SAVED D/A IODA/IOWORK 1 )                  
AIOBUFF1 DS    A                   A(DATA RECORD AREA 1)                        
AIOSAVE2 DS    A                   A(SAVED D/A IODA/IOWORK 2 )                  
AIOBUFF2 DS    A                   A(DATA RECORD AREA 2)                        
AIOSAVE3 DS    A                   A(SAVED D/A IODA/IOWORK 3)                   
AIOBUFF3 DS    A                   A(DATA RECORD AREA 3)                        
         DS    4A                  N/D                                          
*                                                                               
LARE     DS    H                   FOR EXECUTED LOAD ADDRESS                    
LAREADDR DS    S                                                                
LARF     DS    H                   FOR EXECUTED LOAD ADDRESS                    
LARFADDR DS    S                                                                
*                                                                               
RECALDGT DS    A                   A(LEDGER TABLE ENTRY)                        
RECVALS  DS    0X                  RECORD VALUES                                
RECCPYEL DS    A                   A(COMPANY ELEMENT)                           
RECRSTEL DS    A                   A(STATUS ELEMENT)                            
RECABLEL DS    A                   A(ACCOUNT BALANCE ELEMENT)                   
RECPPREL DS    A                   A(PRODUCTION PROFILE ELEMENT)                
RECNAME  DS    CL(L'NAMEREC)       RECORD NAME                                  
RECOFFC  DS    CL(L'TRNOFFC)       OFFICE CODE                                  
RECBAL   DS    PL8                 BALANCE                                      
RECASTS1 DS    XL(L'ASTSTAT1)      STATUS BYTE 1                                
RECCURR  DS    XL(L'ASTCUR)        CURRENCY                                     
RECANAL  DS    XL(L'ACTKACT)       ANALYSIS ACCOUNT                             
RECEXDF  DS    XL(L'ACTKULA)       EXCHANGE DIFFERENCE ACCOUNT                  
RECBCHA  DS    XL(L'ACTKULA)       BANK CHARGES ACCOUNT                         
RECCDSC  DS    XL(L'ACTKULA)       CASH DISCOUNT ACCOUNT                        
RECDTAX  DS    XL(L'ACTKULA)       DISCOUNT TAX ADJUSTMENT ACCOUNT              
RECVALSL EQU   *-RECVALS                                                        
*                                                                               
ELEMT    DS    XL256                                                            
WORK     DS    XL64                                                             
SRCHACC  DS    XL64                                                             
TEMP     DS    XL256                                                            
SPACES   DS    CL256                                                            
UNDERLN  DS    CL80                                                             
BYTE3    DS    XL1                                                              
BYTE4    DS    XL1                                                              
CHAR3    DS    XL1                                                              
CHAR4    DS    XL1                                                              
*                                                                               
COLSUBS  DS    0X                  COLUMN SUBSTITUTION LIST                     
COLFR1   DS    XL1                 FROM COLUMN ONE                              
COLFR2   DS    XL1                 FROM COLUMN TWO                              
COLFR3   DS    XL1                 FROM COLUMN THREE                            
COLFR4   DS    XL1                 FROM COLUMN FOUR                             
COLFR5   DS    XL1                 FROM COLUMN FIVE                             
COLFR6   DS    XL1                 FROM COLUMN SIX                              
COLFR7   DS    XL1                 FROM COLUMN SEVEN                            
COLFR8   DS    XL1                 FROM COLUMN EIGHT                            
COLTO1   DS    XL1                 TO COLUMN ONE                                
COLTO2   DS    XL1                 TO COLUMN TWO                                
COLTO3   DS    XL1                 TO COLUMN THREE                              
COLTO4   DS    XL1                 TO COLUMN FOUR                               
COLTO5   DS    XL1                 TO COLUMN FIVE                               
COLTO6   DS    XL1                 TO COLUMN SIX                                
COLTO7   DS    XL1                 TO COLUMN SEVEN                              
COLTO8   DS    XL1                 TO COLUMN EIGHT                              
COLSUBSL EQU   *-COLSUBS                                                        
*                                                                               
INDS1    DS    XL1                 GLOBAL INDICATORS - BYTE 1                   
INDSVOPT EQU   X'80'               OPTION VALIDATION IN PROGRESS                
INDSZACT EQU   X'40'               ZOOM FACILITY ACTIVITY                       
INDS2    DS    XL1                 GLOBAL INDICATORS - BYTE 1                   
INDS3    DS    XL1                 GLOBAL INDICATORS - BYTE 2                   
INDS4    DS    XL1                 GLOBAL INDICATORS - BYTE 3                   
*                                                                               
AREA64   DS    0XL64                                                            
WRKSPAEL DS    XL(SPALNQ)          DUMMY SPAEL                                  
OLDAFCEL DS    XL(AFCLNQ)          OLD AFCEL (AFCEL CONVERTED TO EUROS)         
TMPEXDFS DS    PL6                 EXCHANGE DIFFERENCE (2ND CURRENCY)           
N31BMB   DS    XL1                 # MB OF 31 BIT W/S FOR FACPAK TASK           
A31BWS   DS    A                   A(31 BIT W/S FOR FACKPAK TASK)               
         DS    XL(64-(*-AREA64))                                                
*                                                                               
LITVALS  DS    0X                  ** LITERAL VALUES **                         
LACCFIL  DS    CL8                 ACCOUNT                                      
LACCDIR  DS    CL8                 ACCDIR                                       
LACCMST  DS    CL8                 ACCMST                                       
PZERO    DS    PL1                 P'0'                                         
PONE     DS    PL1                 P'1'                                         
PONENEG  DS    PL1                 P'-1'                                        
ONERATE  DS    XL(L'AFCX)          EXCHANGE RATE OF ONE                         
GRDACNM  DS    CL4                 PREFIX FOR ACCOUNT NAME FOR GRID             
GRDMSG1  DS    CL19                MESSAGES FOR GRIDS                           
GRDMSG2  DS    CL35                                                             
GRDMSG3  DS    CL13                                                             
GRDPROC  DS    CL2                                                              
LITVALSL EQU   *-LITVALS                                                        
*                                                                               
GETIND   DS    XL1                 GETACC INDICATOR                             
GETIABLQ EQU   X'80'               ACCOUNT BALANCE ELEMENT REQUIRED             
GETICCBQ EQU   X'40'               ERROR IF CLIENT BILLING JOB                  
GETIRTXQ EQU   X'20'               SET ACCIFRTX IF RATETAXQ ELEMENT             
GETINLOK EQU   X'10'               TEST IF ACCOUNT IS LOCKED                    
GETINOSV EQU   X'08'               DON'T SET SAVED VALUES                       
GETINCLO EQU   X'04'               TEST IF ACCOUNT IS CLOSED                    
*                                                                               
UPDIND1  DS    XL1                 UPDATE INDICATOR1                            
UPDIBANK EQU   X'80'               POST TO BANK                                 
UPDICDSC EQU   X'40'               POST TO DISCOUNT                             
UPDIDTAX EQU   X'20'               POST TO DISCOUNT TAX ADJUSTMENT              
UPDIEXDF EQU   X'10'               POST TO EXCHANGE DIFFERENCE                  
UPDIBCHA EQU   X'08'               POST TO BANK CHARGE                          
*                                                                               
UPDIND2  DS    XL1                 UPDATE INDICATOR2                            
UPDIADDQ EQU   X'80'               ITEM(S) ADDED VIA ADDTRN                     
UPDIMRGE EQU   X'40'               MERGE OFFICE TABLE INTO ONE POSTING          
UPDIWRIT EQU   X'20'               WRITE OFF POSTING                            
UPDIREC  EQU   X'10'               UPDATE THE RECORD                            
*                                                                               
FVADDR   DS    A                   A(INPUT FIELD HEADER) SET BY FLDVAL          
FVFLAG   DS    XL1                 FLAG BYTE USED BY FLDVAL ROUTINE             
FVHELP   DS    XL1                 HELP INDEX (ZERO=NO HELP AVAILABLE)          
FVMINL   DS    XL1                 MINIMUM INPUT LENGTH (ZERO=OPTIONAL)         
FVMAXL   DS    XL1                 MAXIMUM INPUT LENGTH (ZERO=MAXIMUM)          
FVNUMER  DS    XL1                 TREAT AS NUMERIC IF FOUND AS NUMERIC         
FVOSYS   DS    XL1                 OVERRIDE SYSTEM FOR GETTXT CALLS             
FVOMTYP  DS    XL1                 OVERRIDE MESSAGE TYPE FOR GETTXT             
FVMSGNO  DS    XL2                 MESSAGE NUMBER                               
         ORG   *-1                                                              
FVFERN   DS    XL1                                                              
FVINDX   DS    XL1                 MULTIPLE FIELD INDEX NUMBER                  
FVSUBX   DS    XL1                 MULTIPLE FIELD SUB-INDEX NUMBER              
FVCURS   DS    XL1                 DISPLACEMENT TO CURSOR WITHIN FIELD          
FVXTRA   DS    CL40                TACKED ON TO ERROR MESSAGE IF ROOM           
FVIHDR   DS    0XL8                ** EXTRACTED INPUT FIELD HEADER **           
FVTLEN   DS    XL1                 L'FIELD HEADER+L'FIELD                       
FVATRB   DS    XL1                 FIELD ATTRIBUTE                              
FVAPROT  EQU   X'20'               PROTECTED FIELD                              
FVAZERO  EQU   X'0C'               ZERO INTENSITY                               
FVAHIGH  EQU   X'08'               HIGH INTENSITY                               
FVAXTND  EQU   X'02'               EXTENDED HEADER                              
FVAMODF  EQU   X'01'               MODIFIED INPUT FIELD                         
FVABSA   DS    XL2                 SCREEN ABSOLUTE ADDRESS                      
FVIIND   DS    XL1                 INPUT VALIDATION INDICATORS                  
FVITHIS  EQU   X'80'               FIELD INPUT THIS TIME                        
FVILAST  EQU   X'40'               FIELD HAS BEEN INPUT PREVIOUSLY              
FVIVAL   EQU   X'20'               FIELD HAS BEEN VALIDATED PREVIOUSLY          
FVIINV   EQU   X'10'               FIELD IS INVALID                             
FVINUM   EQU   X'08'               FIELD IS VALID NUMERIC                       
FVIALF   EQU   X'04'               FIELD IS VALID ALPHA                         
FVIHEX   EQU   X'02'               FIELD IS VALID HEXADECIMAL                   
FVILEN   DS    XL1                 ACTUAL INPUT DATA LENGTH                     
FVOIND   DS    XL1                 OUTPUT INDICATORS                            
FVOXMT   EQU   X'80'               TRANSMIT FIELD                               
FVOCUR   EQU   X'40'               INSERT CURSOR TO FIELD                       
FVXLEN   DS    XL1                 ACTUAL INPUT DATA LENGTH-1                   
FVIFLD   DS    CL80                EXTRACTED & SPACE FILLED INPUT FIELD         
FVOMSG   DS    CL60                OUTPUT MESSAGE MAY BE BUILT HERE             
FVUNLD   DS    CL2                 UNIT/LEDGER OR FFFF FOR SEARCH OR 0          
FVPREF   DS    CL1                 PREFIX CHARACTER FOR OVERRIDE UL             
FVMAMI   DS    CL1                 MAXIMUM/MINIMUM ACCOUNT LEVELS               
         DS    XL12                N/D                                          
*                                                                               
AGYOPTS  DS    XL1                 AGENCY OPTIONS                               
AGYCTRY  DS    XL1                 AGENCY COUNTRY                               
AGYLANG  DS    XL1                 AGENCY LANGUAGE                              
AGYCURR  DS    CL3                 AGENCY CURRENCY                              
COMPANY  DS    XL1                 COMPANY FROM FACPAK PARAMETER LIST           
ANYADD   DS    XL1                 1=TSAR RECORD(S) ADDED, 0=NONE ADDED         
ANYMARK  DS    XL1                 1=DISPLAY TSAR RECORD(S) MARKED,             
*                                  0=NONE MARKED                                
OBATMON  DS    XL(L'BATMON)        OPTION OVERRIDE BATCH MONTH                  
OBATREF  DS    XL(L'BATREF)        OPTION OVERRIDE BATCH REFERENCE              
OBATNAM  DS    XL(L'BATNAM)        OPTION OVERRIDE BATCH NAME                   
OBATMONP DS    PL2                 OPTION OVERRIDE PWOS BATCH MONTH             
*                                                                               
         DS    XL16                N/D                                          
         EJECT                                                                  
AELEMS   DS    0A                  A(ELEMENTS) SET BY SETELAD                   
         DS    A                   SPARE A(ELEM)                                
*NMALIK  DS    A                   SPARE A(ELEM)                                
AFFTCREF DS    A                   USED FOR CR REF IN DR TRAN NMALIK            
AOCAEL   DS    A                   OTHER CURRENCY ELEMENT                       
AAPEEL   DS    A                   ANALYSIS POINTER ELEMENT                     
ATRNEL   DS    A                   TRANSACTION ELEMENT                          
ANXTEL   DS    A                   ADDRESS OF NEXT ELEMENT                      
AAFCEL   DS    A                   ACCOUNT FOREIGN CURRENCY                     
ABNDEL   DS    A                   BILL NUMBER / DATE ELEMENT                   
ACEDEL   DS    A                   CHEQUE EXTRA DETAIL ELEMENT                  
ACPJELS  DS    0A                  UPTO 4 CLI/PRO/JOB ELEMENTS                  
ACPJEL1  DS    A                                                                
ACPJEL2  DS    A                                                                
ACPJEL3  DS    A                                                                
ACPJEL4  DS    A                                                                
ACPJELN  EQU   (*-ACPJELS)/L'ACPJELS                                            
ACPJEL   DS    A                   LAST CLI/PRO/JOB ELEMENT FOUND               
ADUEEL   DS    A                   DUEDATE                                      
AFFTEL   DS    A                   LAST FREE FORM TEXT ELEMENT                  
AFFTACUR DS    A                   FREE FORM TEXT ASSOCIATED CURRENCY           
AFFTKREF DS    A                   FREE FORM TEXT KEY REFERENCE                 
AFFTKWRK DS    A                   FREE FORM TEXT WORK CODE                     
AGINEL   DS    A                   GROUP INVOICE NUMBER ELEMENT                 
AMPYELS  DS    0A                  UPTO 6 MANUAL PAYMENT ELEMENTS               
AMPYEL1  DS    A                                                                
AMPYEL2  DS    A                                                                
AMPYEL3  DS    A                                                                
AMPYEL4  DS    A                                                                
AMPYEL5  DS    A                                                                
AMPYEL6  DS    A                                                                
AMPYELN  EQU   (*-AMPYELS)/L'AMPYELS                                            
AMPYEL   DS    A                   LAST MANUAL PAYMENT ELEMENT FOUND            
AMRHEL   DS    A                   MEDIA RECONCILATION HOLLAND                  
AMRXEL   DS    A                   MEDIA RECONCILE EXTRA DETAIL                 
AMXCELS  DS    0A                  UPTO 6 MEDIA EXTRA CHARGES                   
AMXCEL1  DS    A                                                                
AMXCEL2  DS    A                                                                
AMXCEL3  DS    A                                                                
AMXCEL4  DS    A                                                                
AMXCEL5  DS    A                                                                
AMXCEL6  DS    A                                                                
AMXCELN  EQU   (*-AMXCELS)/L'AMXCELS                                            
AMXPEL   DS    A                   MEDLINE EXTRA PAYMENT ELEMENT                
ANAMEL   DS    A                   NAME ELEMENT                                 
ANOTELS  DS    0A                  UPTO 4 TRANSACTION NOTES                     
ANOTEL1  DS    A                                                                
ANOTEL2  DS    A                                                                
ANOTEL3  DS    A                                                                
ANOTEL4  DS    A                                                                
ANOTELN  EQU   (*-ANOTELS)/L'ANOTELS                                            
AOTHEL   DS    A                   OTHERS ELEMENT                               
APTAEL   DS    A                   PRODUCTION ACTIVITY ELEMENT                  
ARAVEL   DS    A                   RATE OF VAT                                  
ARADEL   DS    A                   RATE OF DISCOUNT                             
ARRNEL   DS    A                   RECORD REVISION#                             
ASCIELS  DS    0A                  SUBSIDIARY CASH INFO                         
ASCIEL   DS    A                                                                
ASCIEL2  DS    A                                                                
ASCIEL3  DS    A                                                                
ASCIEL4  DS    A                                                                
ASCIELN  EQU   (*-ASCIELS)/L'ASCIELS                                            
ASCICDSC DS    A                   SUBSIDIARY CASH - DISCOUNT                   
ASCINOCD DS    A                   SUBSIDIARY CASH - NO DISCOUNT                
ASCIVERN DS    A                   SUBSIDIARY CASH - VERSCHIL NUMBER            
ASCICHQT DS    A                   SUBSIDIARY CASH - CHEQUE TOTAL               
ASIDEL   DS    A                   SUPPLIER INVOICE DETAILS                     
ASOREL   DS    A                   SOURCE ELEMENT                               
ASPAEL   DS    A                   SPECIAL POSTING ACCOUNT ELEMENT              
ASPACDSC DS    A                   SPECIAL CASH DISCOUNT                        
ASPAITAX DS    A                   SPECIAL INPUT TAX A/C                        
ATRSEL   DS    A                   TRANSACTION STATUS ELEMENT                   
ATRXEL   DS    A                   TRANSACTION EXTRA STATUS ELEMENT             
AXPYEL   DS    A                   EXTRA PAYMENT ELEMENT                        
ATRPEL1  DS    A                   FIRST TRANSACTION POINTER ELEMENT            
AGDAERPD DS    A                   GENERAL DATE - EARLIEST PAY DATE             
ASORPROD DS    A                   SOURCE ELEMENT - PRODUCTION                  
ASPACOSG DS    A                   SPECIAL COSTING ACCOUNT/GROUP                
AGDAERP2 DS    A                   GEN DATE-REC/CLRED DATE - BANK/REC           
AFFTLEL  DS    A                   LONG INVOICE NUMBER ELEMENT                  
AGDAMMOS DS    A                   MEDIA MOS (PAYABLES)                         
AMBIEL   DS    A                   MEDIA BILL TRANSFER                          
AGDAAPPR DS    A                   GENERAL DATE APPROVAL                        
AELEMSL  EQU   *-AELEMS                                                         
*                                                                               
ACCXTRA  DS    0X                                                               
BANK     DS    XL(L'ACTKCULA)      BANK C/U/L/ACCOUNT                           
BANKCOST DS    CL(L'RSTCOSTG)      COSTING GROUP OR SPACE                       
BANKNAME DS    XL(L'NAMEREC)       ACCOUNT NAME                                 
BANKOPIK DS    XL1                 OFFICE POSITION IN KEY OR 0                  
SUPP     DS    XL(L'ACTKCULA)      SUPPLIER C/U/L/ACCOUNT                       
SUPPCOST DS    CL(L'RSTCOSTG)      COSTING GROUP OR SPACE                       
SUPPNAME DS    XL(L'NAMEREC)       ACCOUNT NAME                                 
SUPPOPIK DS    XL1                 OFFICE POSITION IN KEY OR 0                  
CDSC     DS    XL(L'ACTKCULA)      CASH DISCOUNT C/U/L/ACCOUNT                  
CDSCCOST DS    CL(L'RSTCOSTG)      COSTING GROUP OR SPACE                       
CDSCNAME DS    XL(L'NAMEREC)       ACCOUNT NAME                                 
CDSCOPIK DS    XL1                 OFFICE POSITION IN KEY OR 0                  
DTAX     DS    XL(L'ACTKCULA)      TAX ADJUSTMENT C/U/L/ACCOUNT                 
DTAXCOST DS    CL(L'RSTCOSTG)      COSTING GROUP OR SPACE                       
DTAXNAME DS    XL(L'NAMEREC)       BANK CHARGE ACCOUNT NAME                     
DTAXOPIK DS    XL1                 OFFICE POSITION IN KEY OR ZERO               
BCHA     DS    XL(L'ACTKCULA)      BANK CHARGE C/U/L/ACCOUNT                    
BCHACOST DS    CL(L'RSTCOSTG)      COSTING GROUP OR SPACE                       
BCHANAME DS    XL(L'NAMEREC)       ACCOUNT NAME                                 
BCHAOPIK DS    XL1                 OFFICE POSITION IN KEY OR 0                  
EXDF     DS    XL(L'ACTKCULA)      EXCHANGE DIFFERENCE C/U/L/ACCOUNT            
EXDFCOST DS    CL(L'RSTCOSTG)      COSTING GROUP OR SPACE                       
EXDFNAME DS    XL(L'NAMEREC)       ACCOUNT NAME                                 
EXDFOPIK DS    XL1                 OFFICE POSITION IN KEY OR 0                  
ACCXTRL  EQU   *-ACCXTRA                                                        
*                                                                               
         DS    XL16                N/D                                          
         EJECT                                                                  
TSARREC  DS    0H                  ** TSAR RECORD **                            
TSARLEN  DS    H                   RECORD LENGTH                                
TSARKEY  DS    XL32                DYNAMIC KEY                                  
         ORG   TSARKEY                                                          
TSARKEY1 DS    XL1                 KEY FOR NEW RECORDS (MR)                     
TSARKEY2 DS    XL1                                                              
TSARKSEQ DS    XL2                                                              
         ORG                                                                    
         ORG   *-L'TSARCNT                                                      
TSARCNT  DS    XL2                 COUNTER TO MAKE TSARKEYS UNIQUE              
*                                                                               
TSARBODY DS    0X                                                               
TSAROFF  DS    CL(L'TRNKOFF)                                                    
TSARCON  DS    CL(L'TRNKCULC)                                                   
         ORG   TSARCON+(ACTKACT-ACTRECD)                                        
TSARCPUB DS    CL6                 PUBLICATION NUMBER EBCDIC (MR)               
         DS    XL1                 N/D                                          
TSARCCLI DS    CL5                 MEDIA CLIENT CODE EBCDIC (MR)                
         ORG   TSARCON+L'TSARCON                                                
TSARDAT  DS    PL(L'TRNKDATE)                                                   
TSARREF  DS    CL(L'TRNKREF)                                                    
TSARSBR  DS    CL(L'TRNKSBR)                                                    
TSARMOS  DS    PL(L'TRNKSMOS)                                                   
TSARBAT  DS    CL(L'TRNBTCH)                                                    
TSARSTA  DS    XL(L'TRNSTAT)                                                    
TSARRSTA DS    XL(L'TRNRSTAT)      TRNRSTAT AND TRNRSTA2 AMALGAMATED            
TSARCHA  DS    XL(L'TSARSTA)       NEW STATUS VALUE                             
TSARAMNT DS    PL6                 TRANSACTION AMOUNT                           
TSARADAT DS    XL(L'TRSDATE)       ACTIVITY DATE                                
TSARSSTA DS    XL(L'TRSSTAT)       STATUS ELEMENT STATUS BYTE                   
TSARBTY  DS    XL1                 TRANSACTION BATCH TYPE                       
TSARDADR DS    XL(L'TRNKDA)        D/A RECORD DISK ADDRESS                      
TSARFOTH DS    CL(L'OTHNUM)        OTHEL NO. (WH,WN,CA,CS,CO,CD,CH,BV)          
TSARINDS DS    XL1                 RECORD INDICATOR                             
TSARDRQ  EQU   X'80'               DEBIT TRANSACTION                            
TSARMKQ  EQU   X'40'               RECORD IS MARKED                             
TSARDISQ EQU   X'20'               RECORD IS FOR DISPLAY ONLY                   
TSARASTQ EQU   X'10'               ALTERNATIVE STATUS CHANGE BASIS              
TSARINMQ EQU   X'08'               INCOMING RECORD MARKED ON FILE               
TSARCHGQ EQU   X'04'               RECORD MARK STATUS HAS CHANGED               
TSARMCHQ EQU   X'02'               MANUAL CHEQUE -CR, BANK C/A (CC)             
TSARHITQ EQU   X'01'               RECORD HIT BY CHKVAL (CO/GO/GR)              
TSARIND2 DS    XL1                 RECORD INDICATOR BYTE TWO                    
TSARLDSC EQU   X'80'               RECORD CARRIES LIVE DISCOUNT                 
TSARJEST EQU   X'40'               SOURCE A/C IS GENUINE JOB/ESTIMATE           
TSARMISB EQU   X'20'               MISSING BUY VERSCHILLEN (MR)                 
TSARGRSS EQU   X'10'               PAY GROSS OF LIVE CASH DISCOUNT (CM)         
TSARMMPI EQU   X'08'               MULTIPLE MPYELS ON INVOICE                   
TSARALCR EQU   X'04'               ALLOCATED RECEIVABLE                         
TSARDIFP EQU   X'02'               DIFFERENCE POSTING                           
TSARMEMO EQU   X'01'               MEMO ITEMS ATTACHED                          
TSARIND3 DS    XL1                 RECORD INDICATOR BYTE THREE                  
TSARMATC EQU   X'80'               INVOICE OR CHEQUE IS MATCHED (CC)            
TSARPWOI EQU   X'40'               PAYMENT WITHOUT INVOICE (CM)                 
TSARDIFF EQU   X'20'               DIFFERENCE (CM)                              
TSARZEPD EQU   X'10'               ZOOM ALTERED EARLIEST PAYMENT DATE           
TSARZDUE EQU   X'08'               ZOOM ALTERED DUE DATE                        
TSARINDL EQU   *-TSARINDS                                                       
TSARWHL  EQU   *-TSARREC           ** WH TSAR RECORD LENGTH                     
                                                                                
TSARFREE DS    XL160               FREE-FORM AREA                               
                                                                                
         ORG   TSARFREE            WIP/NUMBER                                   
TSARAST  DS    XL1                 ALTERNATIVE STATUS CHANGE BYTE               
         DS    XL1                 N/D                                          
TSARFSAC DS    CL(L'TRNKCULC-1)    CPJEL JOB/EXPENSE                            
TSARFDIS DS    PL6                 SCIEL DISCOUNT                               
*&&UK                                                                           
TSARFDFC DS    PL6                 SCIEL DISC IN FOREIGN CURRENCY               
TSARAFCA DS    PL(L'AFCAMNT)       AFCEL FOREIGN CURRENCY AMOUNT                
TSARAFCC DS    CL(L'AFCCURR)       AFCEL FOREIGN CURRENCY CODE                  
TSARAFCX DS    CL(L'AFCX)          AFCEL FOREIGN CURRENCY RATE/STATUS           
*&&                                                                             
*&&US                                                                           
TSARFINV DS    CL20                MEDIA/OR LONG INVOICE                        
TSARFMMD DS    XL3                 MEDIA MONTH/DATE                             
TSARFTAX DS    PL6                 GST (VENDOR) GST BASIS (GST LEDGER)          
*&&                                                                             
TSARFDUE DS    XL(L'DUEDATE)       DUE DATE                                     
TSARFDIC DS    PL6                 CURRENCY DISCOUNT                            
TSARWNL  EQU   *-TSARREC           ** WN TSAR RECORD LENGTH                     
                                                                                
         ORG   TSARFREE            BANK/RECONCILE                               
TSARBSDT DS    XL2                 BANK STATEMENT DATE                          
         DS    CL(L'TRNKCULC-1)    CPJEL JOB/EXPENSE                            
         DS    PL6                 SCIEL DISCOUNT                               
*&&UK*&& DS    PL6                 SCIEL DISC IN FOREIGN CURRENCY               
*&&UK*&& DS    PL(L'AFCAMNT)       AFCEL FOREIGN CURRENCY AMOUNT                
*&&UK*&& DS    CL(L'AFCCURR)       AFCEL FOREIGN CURRENCY CODE                  
*&&UK*&& DS    CL(L'AFCX)          AFCEL FOREIGN CURRENCY RATE/STATUS           
*&&US*&& DS    CL(L'TSARFINV)      MEDIA/LONG INVOICE NUMBER                    
*&&US*&& DS    XL3                 MEDIA MONTH/DATE                             
*&&US*&& DS    PL6                 GST (VENDOR) GST BASIS (GST LEDGER)          
         DS    XL(L'DUEDATE)       DUE DATE                                     
         DS    PL6                 CURRENCY DISCOUNT                            
TSARRCDT DS    PL6                 BANK RECONCILED DATE                         
TSARCLDT DS    PL6                 BANK CLEARED DATE                            
TSARBRL  EQU   *-TSARREC           ** BR TSAR RECORD LENGTH                     
                                                                                
         ORG   TSARFREE            CREDITOR/AUTH/SELECT/HOLD                    
TSARFWRK DS    CL(L'CPJWRK)        CPJEL WORKCODE                               
         DS    CL(L'TRNKCULC-1)    CPJEL JOB/EXPENSE                            
         DS    PL6                 SCIEL DISCOUNT                               
*&&UK*&& DS    PL6                 SCIEL DISC IN FOREIGN CURRENCY               
*&&UK*&& DS    PL(L'AFCAMNT)       AFCEL FOREIGN CURRENCY AMOUNT                
*&&UK*&& DS    CL(L'AFCCURR)       AFCEL FOREIGN CURRENCY CODE                  
*&&UK*&& DS    CL(L'AFCX)          AFCEL FOREIGN CURRENCY RATE/STATUS           
*&&US*&& DS    CL(L'TSARFINV)      MEDAI/LONG INVOICE NUMBER                    
*&&US*&& DS    XL3                 MEDIA MONTH/DATE                             
*&&US*&& DS    PL6                 GST (VENDOR) GST BASIS (GST LEDGER)          
         DS    XL(L'DUEDATE)       DUE DATE                                     
         DS    PL6                 CURRENCY DISCOUNT                            
*&&UK                                                                           
         DS    XL(TSARFEPQ-(*-TSARFREE))                                        
TSARERPD DS    PL(L'GDADATE)       PWOS EARLIEST PAYMENT DATE                   
*&&                                                                             
TSARCAL  EQU   *-TSARREC           ** CA TSAR RECORD LENGTH                     
TSARCSL  EQU   *-TSARREC           ** CS TSAR RECORD LENGTH                     
TSARCHL  EQU   *-TSARREC           ** CH TSAR RECORD LENGTH                     
         DS    XL(L'TSARFREE-(*-TSARFREE))                                      
                                                                                
*&&UK                                                                           
         ORG   TSARFREE            CREDITOR/DISCOUNT                            
         DS    CL(L'CPJWRK)        CPJEL WORKCODE                               
         DS    CL(L'TRNKCULC-1)    CPJEL JOB/EXPENSE                            
         DS    PL6                 SCIEL DISCOUNT                               
         DS    PL6                 SCIEL DISC IN FOREIGN CURRENCY               
         DS    PL(L'AFCAMNT)       AFCEL FOREIGN CURRENCY AMOUNT                
         DS    CL(L'AFCCURR)       AFCEL FOREIGN CURRENCY CODE                  
         DS    CL(L'AFCX)          AFCEL FOREIGN CURRENCY RATE/STATUS           
         DS    XL(L'DUEDATE)       DUE DATE                                     
         DS    PL6                 CURRENCY DISCOUNT                            
TSARDST  DS    XL(L'SCITYPE)       DISCOUNT STATUS FROM SCIEL                   
         DS    XL(TSARFEPQ-(*-TSARFREE))                                        
         DS    PL(L'GDADATE)       PWOS EARLIEST PAYMENT DATE                   
TSARCDL  EQU   *-TSARREC           ** CD TSAR RECORD LENGTH                     
         DS    XL(L'TSARFREE-(*-TSARFREE))                                      
*&&                                                                             
                                                                                
         ORG   TSARFREE            GENERAL/REVERSE                              
         DS    CL(L'CPJWRK)        CPJEL WORKCODE                               
         DS    CL(L'TRNKCULC-1)    CPJEL JOB/EXPENSE                            
         DS    PL6                 SCIEL DISCOUNT                               
*&&UK*&& DS    PL6                 SCIEL DISC IN FOREIGN CURRENCY               
*&&UK*&& DS    PL(L'AFCAMNT)       AFCEL FOREIGN CURRENCY AMOUNT                
*&&UK*&& DS    CL(L'AFCCURR)       AFCEL FOREIGN CURRENCY CODE                  
*&&UK*&& DS    CL(L'AFCX)          AFCEL FOREIGN CURRENCY RATE/STATUS           
*&&US*&& DS    CL(L'TSARFINV)      MEDAI/LONG INVOICE NUMBER                    
*&&US*&& DS    XL3                 MEDIA MONTH/DATE                             
*&&US*&& DS    PL6                 GST (VENDOR) GST BASIS (GST LEDGER)          
         DS    XL(L'DUEDATE)       DUE DATE                                     
         DS    PL6                 CURRENCY DISCOUNT                            
         DS    XL(L'SCITYPE)       DISCOUNT STATUS FROM SCIEL                   
TSARFUSE DS    PL(L'TRNRSUSE)      PWOS USED MOS                                
TSARFREV DS    PL(L'TRSRMOS)       REVERSING MOS                                
*&&UK                                                                           
         DS    XL(TSARFEPQ-(*-TSARFREE))                                        
         DS    PL(L'GDADATE)       PWOS EARLIEST PAYMENT DATE                   
*&&                                                                             
TSARGRL  EQU   *-TSARREC           ** GR TSAR RECORD LENGTH                     
         DS    XL(L'TSARFREE-(*-TSARFREE))                                      
                                                                                
         ORG   TSARFREE            CREDITOR/MANUAL                              
         DS    CL(L'CPJWRK)        CPJEL WORKCODE                               
         DS    CL(L'TRNKCULC-1)    CPJEL JOB/EXPENSE                            
         DS    PL6                 SCIEL DISCOUNT                               
*&&UK*&& DS    PL6                 SCIEL DISC IN FOREIGN CURRENCY               
*&&UK*&& DS    PL(L'AFCAMNT)       AFCEL FOREIGN CURRENCY AMOUNT                
*&&UK*&& DS    CL(L'AFCCURR)       AFCEL FOREIGN CURRENCY CODE                  
*&&UK*&& DS    CL(L'AFCX)          AFCEL FOREIGN CURRENCY RATE/STATUS           
*&&US*&& DS    CL(L'TSARFINV)      MEDAI/LONG INVOICE NUMBER                    
*&&US*&& DS    XL3                 MEDIA MONTH/DATE                             
*&&US*&& DS    PL6                 GST (VENDOR) GST BASIS (GST LEDGER)          
         DS    XL(L'DUEDATE)       DUE DATE                                     
         DS    PL6                 CURRENCY DISCOUNT                            
TSARDNAR DS    XL2                 Y(NARR-SOVRWRK2) (CM EXTRA RECORDS)          
*&&UK                                                                           
         DS    XL(TSARFEPQ-(*-TSARFREE))                                        
         DS    PL(L'GDADATE)       PWOS EARLIEST PAYMENT DATE                   
TSARSCUA DS    PL6                 SECONDARY CURRENCY AMOUNT                    
TSARSCUD DS    PL6                 SECONDARY CURRENCY DISCOUNT                  
*&&                                                                             
TSARCML  EQU   *-TSARREC           ** CM TSAR RECORD LENGTH                     
         DS    XL(L'TSARFREE-(*-TSARFREE))                                      
                                                                                
         ORG   TSARFREE            CREDITOR/OFFSET                              
         DS    CL(L'CPJWRK)        CPJEL WORKCODE                               
         DS    CL(L'TRNKCULC-1)    CPJEL JOB/EXPENSE                            
         DS    PL6                 SCIEL DISCOUNT                               
*&&UK*&& DS    PL6                 SCIEL DISC IN FOREIGN CURRENCY               
*&&UK*&& DS    PL(L'AFCAMNT)       AFCEL FOREIGN CURRENCY AMOUNT                
*&&UK*&& DS    CL(L'AFCCURR)       AFCEL FOREIGN CURRENCY CODE                  
*&&UK*&& DS    CL(L'AFCX)          AFCEL FOREIGN CURRENCY RATE/STATUS           
*&&US*&& DS    CL(L'TSARFINV)      MEDAI/LONG INVOICE NUMBER                    
*&&US*&& DS    XL3                 MEDIA MONTH/DATE                             
*&&US*&& DS    PL6                 GST (VENDOR) GST BASIS (GST LEDGER)          
         DS    XL(L'DUEDATE)       DUE DATE                                     
         DS    PL6                 CURRENCY DISCOUNT                            
         DS    XL(L'SCITYPE)       DISCOUNT STATUS FROM SCIEL                   
         DS    PL(L'TRNRSUSE)      PWOS USED MOS                                
TSARUSDT DS    XL(L'TRSUDAT)       USED DATE                                    
TSARFDU2 DS    XL(L'DUEDATE)       DUE DATE FOR C/O                             
*&&UK                                                                           
         DS    XL(TSARFEPQ-(*-TSARFREE))                                        
         DS    PL(L'GDADATE)       PWOS EARLIEST PAYMENT DATE                   
*&&                                                                             
TSARCOL  EQU   *-TSARREC           ** CO TSAR RECORD LENGTH                     
         DS    XL(L'TSARFREE-(*-TSARFREE))                                      
                                                                                
         ORG   TSARFREE            BANK/VOID                                    
         DS    CL(L'CPJWRK)        CPJEL WORKCODE                               
         DS    CL(L'TRNKCULC-1)    CPJEL JOB/EXPENSE                            
         DS    PL6                 SCIEL DISCOUNT                               
*&&UK*&& DS    PL6                 SCIEL DISC IN FOREIGN CURRENCY               
*&&UK*&& DS    PL(L'AFCAMNT)       AFCEL FOREIGN CURRENCY AMOUNT                
*&&UK*&& DS    CL(L'AFCCURR)       AFCEL FOREIGN CURRENCY CODE                  
*&&UK*&& DS    CL(L'AFCX)          AFCEL FOREIGN CURRENCY RATE/STATUS           
*&&US*&& DS    CL(L'TSARFINV)      MEDIA/LONG INVOICE NUMBER                    
*&&US*&& DS    XL3                 MEDIA MONTH/DATE                             
*&&US*&& DS    PL6                 GST (VENDOR) GST BASIS (GST LEDGER)          
         DS    XL(L'DUEDATE)       DUE DATE                                     
         DS    PL6                 CURRENCY DISCOUNT                            
         DS    XL(L'SCITYPE)       DISCOUNT STATUS FROM SCIEL                   
         DS    PL(L'TRNRSUSE)      PWOS USED MOS                                
         DS    XL(L'TRSUDAT)       USED DATE                                    
TSARCHQT DS    PL6                 CROSS-OFFICE CHEQUE TOTAL                    
TSARSST2 DS    XL(L'TRSSTAT2)      STATUS ELEMENT STATUS BYTE 2                 
TSARSST3 DS    XL(L'TRSSTAT3)      STATUS ELEMENT STATUS BYTE 3                 
TSARCHQC DS    PL6                 CROSS-OFFICE CHEQUE CURRENCY TOTAL           
TSARCADV DS    PL6                 CHEQUE PORTION POSTED AS ADVANCE             
TSARCDIF DS    PL6                 CHEQUE PORTION POSTED AS DIFFERENCE          
TSAR#INV DS    XL2                 NUMBER OF INVOICES PAID BY CHEQUE            
*&&UK                                                                           
         DS    XL(TSARFEPQ-(*-TSARFREE))                                        
         DS    PL(L'GDADATE)       PWOS EARLIEST PAYMENT DATE                   
*&&                                                                             
TSARBVL  EQU   *-TSARREC           ** BV TSAR RECORD LENGTH                     
         DS    XL(L'TSARFREE-(*-TSARFREE))                                      
                                                                                
*&&UK                                                                           
         ORG   TSARFREE            CREDITOR/CHEQUE - BY CHEQUE                  
         DS    CL(L'CPJWRK)        CPJEL WORKCODE                               
         DS    CL(L'TRNKCULC-1)    CPJEL JOB/EXPENSE                            
         DS    PL6                 SCIEL DISCOUNT                               
         DS    PL6                 SCIEL DISC IN FOREIGN CURRENCY               
         DS    PL(L'AFCAMNT)       AFCEL FOREIGN CURRENCY AMOUNT                
         DS    CL(L'AFCCURR)       AFCEL FOREIGN CURRENCY CODE                  
         DS    CL(L'AFCX)          AFCEL FOREIGN CURRENCY RATE/STATUS           
         DS    XL(L'DUEDATE)       DUE DATE                                     
         DS    PL6                 CURRENCY DISCOUNT                            
         DS    XL(L'SCITYPE)       DISCOUNT STATUS FROM SCIEL                   
         DS    PL(L'TRNRSUSE)      PWOS USED MOS                                
         DS    XL(L'TRSUDAT)       USED DATE                                    
TSARFSBR DS    XL1                 CHEQUE TRNKSBR (INVOICES ONLY)               
TSARFCHN DS    CL(L'MPYNO)         MANUAL CHEQUE NO.                            
TSARFCHD DS    XL(L'MPYDTE)        MANUAL CHEQUE DATE                           
TSARFCHA DS    PL6                 MANUAL CHEQUE AMOUNT                         
TSARFCHF DS    PL6                 MANUAL CHEQUE FOREIGN AMOUNT                 
TSARFCHB DS    CL(L'MPYBNK)        MANUAL CHEQUE BANK ACCOUNT                   
TSARFNOC DS    XL2                 TSAR NUMBER OF MATCHING CHEQUE               
         DS    XL(TSARFEPQ-(*-TSARFREE))                                        
         DS    PL(L'GDADATE)       PWOS EARLIEST PAYMENT DATE                   
TSARCCL  EQU   *-TSARREC           ** CC L'RECORD - SELECT BY CHEQUE            
         DS    XL(L'TSARFREE-(*-TSARFREE))                                      
                                                                                
         ORG   TSARFREE            CREDITOR/CHEQUE - BY INVOICE                 
TSARFEP  DS    0X                                                               
         DS    CL(L'CPJWRK)        CPJEL WORKCODE                               
         DS    CL(L'TRNKCULC-1)    CPJEL JOB/EXPENSE                            
         DS    PL6                 SCIEL DISCOUNT                               
         DS    PL6                 SCIEL DISC IN FOREIGN CURRENCY               
         DS    PL(L'AFCAMNT)       AFCEL FOREIGN CURRENCY AMOUNT                
         DS    CL(L'AFCCURR)       AFCEL FOREIGN CURRENCY CODE                  
         DS    CL(L'AFCX)          AFCEL FOREIGN CURRENCY RATE/STATUS           
         DS    XL(L'DUEDATE)       DUE DATE                                     
         DS    PL6                 CURRENCY DISCOUNT                            
         DS    XL(L'SCITYPE)       DISCOUNT STATUS FROM SCIEL                   
         DS    PL(L'TRNRSUSE)      PWOS USED MOS                                
         DS    XL(L'TRSUDAT)       USED DATE                                    
         DS    XL1                 CHEQUE TRNKSBR (INVOICES ONLY)               
TSARFCHS DS    0XL(CHQMAX*L'TSARFCH1)  UP TO SIX MATCHING CHEQUES               
TSARFCH1 DS    XL2                 TSAR NO. OF MATCHING CHEQUE #1               
TSARFCH2 DS    XL2                 TSAR NO. OF MATCHING CHEQUE #2               
TSARFCH3 DS    XL2                 TSAR NO. OF MATCHING CHEQUE #3               
TSARFCH4 DS    XL2                 TSAR NO. OF MATCHING CHEQUE #4               
TSARFCH5 DS    XL2                 TSAR NO. OF MATCHING CHEQUE #5               
TSARFCH6 DS    XL2                 TSAR NO. OF MATCHING CHEQUE #6               
CHQMAX   EQU   6                                                                
TSARFAMS DS    0XL(CHQMAX*L'TSARFAM1)                                           
TSARFAM1 DS    PL6                 PORTION OF CHEQUE #1 MATCHED                 
TSARFAM2 DS    PL6                 PORTION OF CHEQUE #2 MATCHED                 
TSARFAM3 DS    PL6                 PORTION OF CHEQUE #3 MATCHED                 
TSARFAM4 DS    PL6                 PORTION OF CHEQUE #4 MATCHED                 
TSARFAM5 DS    PL6                 PORTION OF CHEQUE #5 MATCHED                 
TSARFAM6 DS    PL6                 PORTION OF CHEQUE #6 MATCHED                 
TSARFAFS DS    0XL(CHQMAX*L'TSARFAF1)                                           
TSARFAF1 DS    PL6                 AFC PORTION OF CHEQUE #1 MATCHED             
TSARFAF2 DS    PL6                 AFC PORTION OF CHEQUE #2 MATCHED             
TSARFAF3 DS    PL6                 AFC PORTION OF CHEQUE #3 MATCHED             
TSARFAF4 DS    PL6                 AFC PORTION OF CHEQUE #4 MATCHED             
TSARFAF5 DS    PL6                 AFC PORTION OF CHEQUE #5 MATCHED             
TSARFAF6 DS    PL6                 AFC PORTION OF CHEQUE #6 MATCHED             
TSARFCHL EQU   *-TSARFCHS                                                       
TSARFEPQ EQU   *-TSARFEP           DISPLACEMENT TO EARLY PAYMENT DATE           
         DS    PL(L'GDADATE)       PWOS EARLIEST PAYMENT DATE                   
         DS    XL(L'TSARFREE-(*-TSARFREE))                                      
                                                                                
         ORG   TSARFCHS            CHEQUES - REDEFINITION                       
TSARFREM DS    PL6                 AMOUNT REMAINING FOR MATCHING                
TSARFREF DS    PL6                 AMOUNT REMAINING FOR MATCHING                
         DS    XL(TSARFEPQ-(*-TSARFREE))                                        
         DS    PL(L'GDADATE)       PWOS EARLIEST PAYMENT DATE                   
TSARCC2L EQU   *-TSARREC           ** CC L'RECORD - SELECT BY INVOICE           
         DS    XL(L'TSARFREE-(*-TSARFREE))                                      
                                                                                
         ORG   TSARFREE            MEDIA/RECONCILE                              
TSARFTYL DS    XL1                 LATEST MRH RECORD TYPE                       
TSARFTY2 DS    XL1                 MRH RECORD TYPE - 2                          
         DS    CL(L'TRNKCULC-1)    CPJEL JOB/EXPENSE                            
TSARFGRS DS    PL6                 GROSS PRICE                                  
         DS    PL6                 SCIEL DISC IN FOREIGN CURRENCY               
         DS    PL(L'AFCAMNT)       AFCEL FOREIGN CURRENCY AMOUNT                
         DS    CL(L'AFCCURR)       AFCEL FOREIGN CURRENCY CODE                  
         DS    CL(L'AFCX)          AFCEL FOREIGN CURRENCY RATE/STATUS           
         DS    XL(L'DUEDATE)       DUE DATE                                     
         DS    PL6                 CURRENCY DISCOUNT                            
         DS    XL(L'SCITYPE)       DISCOUNT STATUS FROM SCIEL                   
         DS    PL(L'TRNRSUSE)      PWOS USED MOS                                
         DS    XL(L'TRSUDAT)       USED DATE                                    
TSARFUNP DS    PL6                 UNIT PRICE                                   
TSARFSER DS    XL(L'MRHSER)        BUY SERIAL NUMBER                            
TSARFCMR DS    XL2                 MEDIA COMMISION RATE                         
TSARFTAX DS    XL(L'MRHTAXR)       TAX RATE                                     
TSARFRDA DS    XL(L'IODA)          RECONCILIATION TRANSACTION D/A               
TSARFRKS DS    XL1                 MRHPKSTA BYTE 1                              
TSARFLDA DS    XL(L'IODA)          LATEST TRANSACTION D/A                       
TSARFLKS DS    XL1                 MRHPKSTA BYTE 1                              
TSARXSEQ DS    XL2                 EXTENSION UNIQUE SEQUENCE NUMBER             
TSARXTYP DS    XL1                 EXTENSION RECORD TYPE OR 0                   
TSARXVER EQU   1                   VERSCHILLEN NOTE GENERATED                   
TSARXWOF EQU   2                   WRITE-OFF GENERATED                          
TSARXXFR EQU   3                   TRANSFER GENERATED                           
TSARXCNT DS    XL1                 EXTRA RECORD COUNT (FROM FILE)               
TSARFIDT DS    XL(L'MRHDAT)        MEDIA INSERTION DATE                         
TSARFCLI DS    XL(L'MRHCLIC)       MEDIA CLIENT CODE                            
TSARSUPN DS    CL(L'MRHSUPN)       MEDIA SUPPLIER SHORT NAME                    
         DS    XL(L'TSARFREE-(*-TSARFREE))                                      
TSARMRL  EQU   *-TSARREC           ** MR TSAR RECORD LENGTH                     
*&&                                                                             
* - - - - - - - - - - - - - - - - - - - - - - - - - -                           
         ORG   TSARFREE            VENDOR MATCH                                 
TSARAASY DS    CL1                 SYSTEM                                       
TSARAAMD DS    CL1                 MEDIA                                        
TSARAACL DS    CL3                 CLIENT                                       
TSARAAPR DS    CL3                 PRODUCT                                      
TSARAAES DS    CL6                 ESTIMATE                                     
TSARAALT DS    CL12                LINE TYPE                                    
TSARAAVN DS    CL14                VENDOR                                       
TSARAAVI DS    CL11                VENDOR  INVOICE NUMBER                       
TSARAAAB DS    PL6                 AMOUNT BILLED                                
TSARAACR DS    PL6                 CASH RECEIVED                                
TSARAACD DS    PL6                 CHECKS DISBURSED                             
TSARAACP DS    PL6                 CASH POSITION (RECEIVED-DISBURSED)           
TSARAATC DS    PL6                 TOTAL CLEARED                                
TSARAACU DS    PL6                 CLEARED BUT UNDISBURSED                      
TSARAACA DS    PL6                 CASH AVAILABLE                               
TSARVNME DS    CL36                VENDOR NAME                                  
TSARVTL  EQU   *-TSARREC                                                        
         DS    XL(L'TSARFREE-(*-TSARFREE))                                      
* - - - - - - - - - - - - - - - - - - - - - - - - - -                           
         ORG   TSARFREE+L'TSARFREE                                              
TSARBODL EQU   *-TSARBODY          MAXIMUM RECORD BODY LENGTH                   
TSARRECL EQU   *-TSARREC           MAXIMUM ROOT-BUILT RECORD LENGTH             
TSARMAXL EQU   300                 ACMRK0E HAS LONGER RECORDS                   
*                                                                               
TSARVAR  DS    XL1                 VARIABLE BYTE FOR TSAR KEY                   
*                                                                               
SCRVALS  DS    0X                  ** SCROLL CONTROL **                         
SCRLAMT  DS    XL2                 SCROLL AMOUNT                                
SCRPAGE  EQU   LINES               SCROLL A PAGE                                
SCRHALF  EQU   LINES/2             SCROLL HALF A PAGE                           
SCRMAXI  EQU   X'FFFF'             SCROLL MAXIMUM                               
SCRLDIR  DS    CL1                 SCROLL DIRECTION +/-                         
SCRDOWN  EQU   C'+'                SCROLL DOWN                                  
SCRUP    EQU   C'-'                SCROLL UP                                    
SCRFIND  EQU   C'*'                SCROLL TO A KEY                              
SCRVALSL EQU   *-SCRVALS                                                        
*                                                                               
SRCWORK  DS    CL(L'ACTKCULA-1)    SOURCE ULACC WORK AREA                       
         DS    XL64                N/D                                          
*                                                                               
         DS    0D                                                               
IOCTRL   DS    0F                  CONTROL BYTE FOR IO CALLS                    
         DS    H                   N/D                                          
IOCTFILE DS    XL1                 FILE NUMBER                                  
IOCTCOMM DS    XL1                 COMMAND NUMBER                               
IOCTINDS DS    XL2                 I/O INDICATORS                               
IOCTIGET EQU   X'80'               GETREC                                       
IODA     DS    XL4                 DISK ADDRESS                                 
IOWORK   DS    XL96                DATAMGR D/A WORK AREA                        
IOFILE   DS    CL7                 IO FILE NAME                                 
IOCOMM   DS    CL7                 IO COMMAND                                   
IOQUAL   DS    XL1                 QUALIFIER FOR DATAMGR IO                     
IOQLOCK  EQU   X'80'               READ FOR UPDATE                              
IOQDELT  EQU   X'08'               READ DELETES                                 
IOERROR  DS    XL1                 ERROR RETURN BYTE                            
IOEEOF   EQU   X'80'               END OF FILE                                  
IOEDSK   EQU   X'40'               NON-RECOVERABLE DISK ERROR                   
IOEDUP   EQU   X'20'               DUPLICATE KEY ON ADD                         
IOERNF   EQU   X'10'               RECORD NOT FOUND                             
IOEDEL   EQU   X'02'               RECORD DELETED                               
IOEALL   EQU   X'FF'               ALL ERROR BITS (CONTROLLER USE ONLY)         
*                                                                               
LACCOUNT DS    CL(L'ACCOUNT)       LAST TYPE/ACTION MAIN ACCOUNT                
*                                                                               
         ORG   WORKD+(4095-L'KEY)  SPARE ADDRESSABLE GENERAL W/S                
*                                                                               
KEY      DS    XL(ACCKLEN)                                                      
KEYSAVE  DS    XL(ACCKLEN)         BYTE ONE IS ADDRESSABLE                      
***********************************************************************         
* NON-ADDRESSABLE GENERAL WORKING STORAGE                             *         
***********************************************************************         
SCANOUT  DS    XL(SCANLTAB)        SCANNER OUTPUT BLOCK                         
*                                                                               
IOAS     DS    0X                  IO AREAS 1/2/3                               
IOSAVE   DS    CL(L'IODA+L'IOWORK)                                              
IOBUFF   DS    XL2048              IO BUFFER 1                                  
IOALQ    EQU   *-IOAS                                                           
         DS    (IOALQ*2)X          IO AREAS 2/3                                 
IOAMAX   EQU   (*-IOAS)/IOALQ      MAX IO AREAS                                 
*                                                                               
OVERWORK DS    XL2048              OVERLAY WORK AREA                            
OFFBLK   DS    XL(OFFALLEN)        OFFAL BLOCK                                  
TSARBLK  DS    XL(TSARDL2)         TSAR BLOCK                                   
REPWORK  DS    XL(REPL)            REPORT WORK AREA                             
DUMLINE  DS    CL(DUMLINLN)        DUMMY SCREEN LINE BLOCK                      
DLCB     DS    XL(DLCBXLX)         DOWNLOAD CONTROL BLOCK                       
PQBUFF   DS    (14*1024)X          PRINT QUEUE BUFFER AREA                      
WORKX    EQU   *                                                                
         EJECT                                                                  
* MISCELLANEOUS EQUATES                                                         
*                                                                               
LINES    EQU   15                  NUMBER OF TWA LINES                          
INCLUDE  EQU   X'01'               OPTION IS INCLUDE                            
EXCLUDE  EQU   X'80'               OPTION IS EXCLUDE                            
EOT      EQU   0                   END OF TABLE                                 
ALL      EQU   X'FF'                                                            
GLNOSECY EQU   X'80'               GETLDG - DON'T TEST LEDGER SECURITY          
         SPACE 1                                                                
* EXECUTED BRANCH EQUATES                                                       
*                                                                               
BEQ      EQU   X'80'                                                            
BNEQ     EQU   X'70'                                                            
BZQ      EQU   X'80'                                                            
BNZQ     EQU   X'70'                                                            
BOQ      EQU   X'10'                                                            
BNOQ     EQU   X'E0'                                                            
BHQ      EQU   X'20'                                                            
BNHQ     EQU   X'D0'                                                            
BMQ      EQU   X'40'                                                            
BNMQ     EQU   X'B0'                                                            
         SPACE 1                                                                
* KEY BUILD ROUTINE EQUATES                                                     
*                                                                               
SETACC   EQU   X'80'                                                            
SETOFF   EQU   X'40'                                                            
SETWRK   EQU   SETOFF                                                           
SETCON   EQU   X'20'                                                            
SETSDT   EQU   X'10'                                                            
SETREF   EQU   X'08'                                                            
SETALL   EQU   SETACC+SETOFF+SETCON+SETSDT+SETREF                               
NXTOFF   EQU   X'04'                                                            
NXTWRK   EQU   NXTOFF                                                           
NXTCON   EQU   X'02'                                                            
NXTSDT   EQU   X'01'                                                            
*                                                                               
* COMBINED DATE ASSUMPTION EQUATES                                              
*                                                                               
STARTASS EQU   PVALASD+PVALASM+PVALASY                                          
ENDASS   EQU   PVALAED+PVALAEM+PVALAEY                                          
*                                                                               
* PFKEY EQUATES                                                                 
*                                                                               
PFK01    EQU   1                                                                
PFK02    EQU   2                                                                
PFK03    EQU   3                                                                
PFK04    EQU   4                                                                
PFK05    EQU   5                                                                
PFK06    EQU   6                                                                
PFK07    EQU   7                                                                
PFK08    EQU   8                                                                
PFK09    EQU   9                                                                
PFK10    EQU   10                                                               
PFK11    EQU   11                                                               
PFK12    EQU   12                                                               
PFK13    EQU   13                                                               
PFK14    EQU   14                                                               
PFK15    EQU   15                                                               
PFK16    EQU   16                                                               
PFK17    EQU   17                                                               
PFK18    EQU   18                                                               
PFK19    EQU   19                                                               
PFK20    EQU   20                                                               
PFK21    EQU   21                                                               
PFK22    EQU   22                                                               
PFK23    EQU   23                                                               
PFK24    EQU   24                                                               
         EJECT                                                                  
* IO ROUTINE EQUATES                                                            
*                                                                               
IOFILES  EQU   X'0F00'             RESERVED FOR CONTROLLER USE                  
IOACCDIR EQU   X'0100'             I/O TO ACCOUNT DIRECTORY                     
IOACCMST EQU   X'0200'             I/O TO ACCOUNT MASTER FILE                   
IOACCARC EQU   X'0300'             I/O TO ACCOUNT ARCHIVE FILE                  
IOACCIS  EQU   X'01'               INDEX SEQUENTIAL IO FILE                     
IOACCDA  EQU   X'02'               DIRECT ACCESS IO FILE                        
         SPACE 1                                                                
*                                  ** I/O AREA EQUATES **                       
IO1Q     EQU   X'0040'             I/O TO AREA 1                                
IO2Q     EQU   X'0080'             I/O TO AREA 2                                
IO3Q     EQU   X'00C0'             I/O TO AREA 3                                
         SPACE 1                                                                
*                                  ** I/O COMMAND EQUATES **                    
IOCMNDS  EQU   X'000F'             RESERVED FOR CONTROLLER USE                  
*                                  COMMAND QUALIFIERS                           
IOLOCK   EQU   X'0010'             READ FOR UPDATE                              
IORDEL   EQU   X'0020'             READ DELETED RECORDS                         
*                                  I/S COMMANDS                                 
IOHIGH   EQU   X'0001'             DMRDHI                                       
IOHI     EQU   IOHIGH              DMRDHI                                       
IOHID    EQU   IOHI+IORDEL         DMRDHI (FOR DELETES)                         
IOHIUP   EQU   IOHI+IOLOCK         DMRDHI (FOR UPDATE)                          
IOHIUPD  EQU   IOHI+IOLOCK+IORDEL  DMRDHI (FOR UPDATE & DELETES)                
IOREAD   EQU   X'0002'             DMREAD                                       
IORD     EQU   IOREAD              DMREAD                                       
IORDD    EQU   IORD+IORDEL         DMREAD (FOR DELETES)                         
IORDUP   EQU   IORD+IOLOCK         DMREAD (FOR UPDATE)                          
IORDUPD  EQU   IORD+IOLOCK+IORDEL  DMREAD (FOR UPDATE & DELETES)                
IOSEQ    EQU   X'0003'             DMRSEQ                                       
IOSEQD   EQU   IOSEQ+IORDEL        DMRSEQ (FOR DELETES)                         
IOSEQUP  EQU   IOSEQ+IOLOCK        DMRSEQ (FOR UPDATE)                          
IOSEQUPD EQU   IOSEQ+IOLOCK+IORDEL DMRSEQ (FOR UPDATE & DELETES)                
IOADD    EQU   X'0004'             DMADD                                        
IOWRITE  EQU   X'0005'             DMWRT                                        
*                                  D/A COMMANDS                                 
IOGET    EQU   X'0001'             GETREC                                       
IOGETRUP EQU   IOGET+IOLOCK        GETREC FOR UPDATE                            
IOPUTREC EQU   X'0002'             PUTREC                                       
IOPUT    EQU   IOPUTREC            PUTREC                                       
IOADDREC EQU   X'0003'             ADDREC                                       
IOADFR   EQU   X'0004'             ADFREC (MOVE FROM ACCARC TO ACCMST)          
         EJECT                                                                  
* ERROR, INFORMATION, REPORT AND SCREEN MESSAGE EQUATES                         
*                                                                               
EARNGGYR EQU   0134                DATE RANGE IS GREATER THAN ONE YEAR          
EAINVCUR EQU   0280                INVALID CURRENCY CODE                        
EAINVPFK EQU   0313                INVALID PFKEY FOR THIS SCREEN                
EAPRDREQ EQU   0861                PRODUCT REQUIRED WITH ESTIMATE               
EALDGINV EQU   1000                INVALID LEDGER                               
EAACCINV EQU   1001                INVALID ACCOUNT                              
EAAMTINV EQU   1003                INVALID AMOUNT                               
EASECLOC EQU   1005                SECURITY LOCKOUT                             
EASCRINV EQU   1006                INVALID SCROLL AMOUNT                        
EATRNMAX EQU   1008                TOO MANY TRANSACTIONS                        
EARNGINV EQU   1009                RANGE INVALID - START GT END                 
EAACCDUP EQU   1012                DUPLICATED ACCOUNT CODE                      
EAACMCRE EQU   1086                ACC CURRENCY MUST MATCH CREDITOR CUR         
EANOTHIN EQU   1100                NOTHING DONE YET (CAN'T UPDATE)              
EANOJOBS EQU   1101                NO MORE JOBS                                 
EANOACCS EQU   1102                NO MORE ACCOUNTS                             
EAMIXOF1 EQU   1103                MIXED OFFICES                                
EAMIXOF2 EQU   1104                MIXED OFFICES - TRY OFFICE OPTION            
EAMUMTNZ EQU   1105                MATCHED/UNMATCHED TOTALS NOT ZERO            
EAMINECH EQU   1106                MATCHED INVOICE TOTAL NOT EQUAL CHQ          
EAWIOFCH EQU   1107                WRONG INVOICE OFFICE FOR CHEQUE              
EARDIFNZ EQU   1108                REVERSAL DIFFERENCE NOT ZERO                 
EATUNSEL EQU   1109                TRANSACTION IS SELECTED FOR PAYMENT          
EATRNSEL EQU   1110                TRANSACTION NOT SELECTED FOR PAYMENT         
EASELMIX EQU   1111                MIXED SELECT STATUS - TRY SEL OPTION         
EANOTLOW EQU   1112                NOT A LOW LEVEL ACCOUNT                      
EALOCKED EQU   1113                ACCOUNT IS LOCKED                            
EACLOSED EQU   1114                ACCOUNT IS CLOSED                            
EACLOJOB EQU   1115                JOB IS CLOSED                                
EASTTMIX EQU   1116                TRANSACTION STATUS MISMATCHED                
EARVPEND EQU   1117                REVERSING/UNREVERSING INCOMPLETE             
EATRNMX2 EQU   1118                TOO MANY PENDING TRANSACTIONS                
EAMCHNEI EQU   1119                MATCHED CHEQUES NEQ INVOICE                  
EACHQMAX EQU   1120                ONLY SIX CHEQUES PER INVOICE                 
EAPARMAX EQU   1121                ONLY ONE CHEQUE PART MATCHED PER INV         
EACHQMKD EQU   1122                CHEQUE IS ALREADY MATCHED                    
EAWCHOFI EQU   1123                WRONG CHEQUE OFFICE FOR INVOICE              
EABALXPT EQU   1124                BALANCE > AMOUNT FOR PART MATCHING           
EAOVKILL EQU   1125                BALANCE NEGATIVE - CAN'T PART MATCH          
EAUNMPAR EQU   1126                UNMATCH PART UNMATCHED CHEQUE(S)             
EAMATPAR EQU   1127                MATCH PART MATCHED CHEQUES                   
EANOMULT EQU   1128                CAN'T UNMATCH MULTIPLE MPYEL INVOICE         
EACHQMUL EQU   1129                CAN'T UNMATCH MULTIPLE INV. CHEQUE           
EAMISBMO EQU   1130                NO BATCH MONTH - USE OPTIONS                 
EAMISBRF EQU   1131                NO BATCH REFERENCE - USE OPTIONS             
EAMISBNA EQU   1132                NO BATCH NAME - USE OPTIONS                  
EABATDUP EQU   1133                BATCH RECORD EXITS - OVERRIDE PLEASE         
EALUPINV EQU   1134                CAN'T UPDATE LIVE FROM INV. SCREEN           
EALIMACC EQU   1135                CAN'T MARK - LIMIT ACCESS PRESENT            
EAOFFILT EQU   1136                CAN'T MARK - OFFICE FILTER PRESENT           
EABATTOT EQU   1137                BATCH TOTALS DIFFER - CAN'T UPDATE           
EABATITE EQU   1138                BATCH ITEMS DIFFER - CAN'T UPDATE            
EANOTUPD EQU   1139                NOTHING UPDATED                              
EANOTUPR EQU   1140                NOTHING UPDATED - REPORT &T SPOOLED          
EAREMOFF EQU   1141                REMOVE OFFICE FOR CROSS-OFFICE CHQS          
EACLIBIL EQU   1142                CLIENT BILLING TYPE                          
EAFUSTDT EQU   1143                STATEMENT DATE CAN'T BE IN FUTURE            
*                                                                               
EGIFMISS EQU   200+X'FF00'         NO DATA INPUT                                
EGIFSHRT EQU   201+X'FF00'         NOT ENOUGH DATA INPUT                        
EGIFLONG EQU   202+X'FF00'         TOO MUCH DATA INPUT                          
EGIFNOTV EQU   203+X'FF00'         INVALID INPUT FIELD                          
EGOPTDUP EQU   208+X'FF00'         DUPLICATED OPTION KEYWORD                    
EGINVASQ EQU   212+X'FF00'         INVALID ACTION SEQUENCE                      
EGRECNOF EQU   213+X'FF00'         RECORD NOT ON FILE                           
EGRECAOF EQU   214+X'FF00'         RECORD ALREADY ON FILE                       
EGDATINV EQU   233+X'FF00'         INVALID DATE                                 
*                                                                               
IAENTCHA EQU   1007                ENTER CHANGES OR NO DATA TO EXIT             
*&&UK                                                                           
IATRNWRN EQU   1100                SOME TRANSACTIONS DROPPED                    
*&&                                                                             
*&&US                                                                           
IATRNWRN EQU   1124                SOME TRANSACTIONS DROPPED / FILTER           
*&&                                                                             
IANOTRAN EQU   1101                NO TRANSACTIONS SELECTED                     
IAUPDCUT EQU   1102                UPDATE CUT SHORT RECD. BEING AMENDED         
IAUPCUTR EQU   1103                UPDATE CUT SHORT (REPORT &T SPOOLED)         
IAMKTEPA EQU   1104                MARK TRANSACTIONS - ENTER TO PAGE            
IATRNUPS EQU   1105                TRANSACTIONS UPDATED SUCCESSFULLY            
IATRNUPR EQU   1106                TRANS UPDATED - REPORT &T SPOOLED            
IAHDRECH EQU   1107                HEADER RESTORED - NOW ENTER CHANGES          
IAENTHDD EQU   1108                ENTER HEADER DETAILS                         
IAMKTNOM EQU   1109                MARK TRANSACTIONS - NO MORE TO COME          
IAEPAP1N EQU   1110                ENTER TO PROCESS A/C OR PF1 FOR NEXT         
IAEPJP1N EQU   1111                ENTER TO PROCESS JOB OR PF1 FOR NEXT         
IANOINVS EQU   1112                NO INVOICES SELECTED                         
IANOCHQS EQU   1113                NO CHEQUES SELECTED                          
IAMINECH EQU   1114                WARNING MATCHED INVOICES NEQ CHEQUE          
IAMCHNEI EQU   1115                WARNING MATCHED CHEQUES NEQ INVOICE          
IAINVDIS EQU   1116                INVOICES DISPLAYED - ENTER TO PAGE           
IAINVMIS EQU   1117                CANNOT DISPLAY ALL INVOICES                  
IAINVNOM EQU   1118                INVOICES DISPLAYED - NO MORE                 
IAINVANY EQU   1119                CANNOT DISPLAY ANY INVOICES                  
*                                                                               
IGREPSPL EQU   027+X'FF00'         REPORT &T HAS BEEN SPOOLED                   
IGOK     EQU   255+X'FF00'         FIELD IS VALID                               
*                                                                               
RARAEUCS EQU   1000                REC AMENDED ELSEWHERE - UPDATE CUT           
*                                                                               
SAENTCMA EQU   1000                ENTER CONFIRMATION                           
*                                                                               
COLEQUS  DS    0X                  DISPLAY COLUMN EQUATES                       
COLIDGQ  EQU   255                 GRID IDENTIFIER - TSAR NUM                   
COLOFFQ  EQU   1                   OFFICE                                       
COLWRKQ  EQU   2                   WORKCODE IN SJ                               
COLCONQ  EQU   3                   U/L/CONTRA                                   
COLDATQ  EQU   4                   DATE                                         
COLREFQ  EQU   5                   REFERENCE                                    
COLMOSQ  EQU   6                   MONTH OF SERVICE                             
COLBATQ  EQU   7                   BATCH REFERENCE                              
COLAMTQ  EQU   8                   AMOUNT                                       
COLDRSQ  EQU   9                   DEBIT                                        
COLCRSQ  EQU   10                  CREDIT                                       
COLSUPQ  EQU   11                  SUPPLIER                                     
COLJOBQ  EQU   12                  JOB                                          
COLSRCQ  EQU   13                  SOURCE ACCOUNT                               
COLCHQQ  EQU   14                  CHEQUE NUMBER                                
COLTYPQ  EQU   15                  TYPE (DEBIT/CREDIT)                          
COLFWKQ  EQU   16                  FREEFORM WORKCODE IN CPJEL (CA)              
COLFOTQ  EQU   17                  FREEFORM NUMBER IN OTHEL (CA)                
COLNUMQ  EQU   18                  TSAR RECORD NUMBER                           
COLDSCQ  EQU   19                  DISCOUNT AMOUNT (CD,BV)                      
COLOMOQ  EQU   20                  OFFSET MOS (CO,GO)                           
COLSTAQ  EQU   21                  STATUS                                       
COLADAQ  EQU   22                  ACTIVITY DATE                                
COLBTYQ  EQU   23                  BATCH TYPE                                   
COLRMOQ  EQU   24                  REVERSED MOS                                 
COLDUEQ  EQU   25                  PAYMENT DUE DATE (CA,CS,CD,CH)               
COLXSTQ  EQU   26                  EXTRA STATUS DETAIL                          
COLUSEQ  EQU   27                  USED DATE                                    
*&&US                                                                           
COLINVQ  EQU   28                  MEDIA/LONG INVOICE NUMBER                    
*&&                                                                             
*&&UK                                                                           
COLFXRQ  EQU   28                  FIXED REFERENCE (BV)                         
*&&                                                                             
COLBSDQ  EQU   29                  BANK STATEMENT DATE (BR)                     
*&&US                                                                           
COLTAXQ  EQU   30                  TAX/TAX BASIS (ALL CREDITOR,GR)              
COLMMDQ  EQU   31                  MEDIA MONTH/DATE                             
COLNARQ  EQU   32                  TRANSACTION NARRATIVE                        
COLRCDT  EQU   33                  STATEMENT RECONCILED DATE                    
COLCLDT  EQU   34                  BANK CLEARED DATE                            
*&&                                                                             
*&&UK                                                                           
COLNARQ  EQU   30                  TRANSACTION NARRATIVE                        
COLSERQ  EQU   31                  BUY SERIAL NUMBER (MR)                       
COLUNPQ  EQU   32                  UNIT PRICE (MR)                              
COLIDTQ  EQU   33                  INSERTION DATE (MR)                          
COLSDCQ  EQU   34                  SUNDRY CREDITOR NAME                         
COLAFCQ  EQU   35                  ACCOUNT FOREIGN CURRENCY                     
COLEXDQ  EQU   36                  EXCHANGE DIFFERENCES                         
COLRATQ  EQU   37                  EXCHANGE RATE                                
*&&                                                                             
COLSNMQ  EQU   38                  SOURCE NAME                                  
COLADVQ  EQU   39                  ADVANCE                                      
COLDIFQ  EQU   40                  DIFFERENCE                                   
*&&UK                                                                           
COLSAMQ  EQU   41                  AMOUNT - SECOND CURRENCY                     
COLSDRQ  EQU   42                  DEBIT AMOUNT SECOND CURRENCY                 
COLSCRQ  EQU   43                  CREDIT AMOUNT SECOND CURRENCY                
COLSDSQ  EQU   44                  DISCOUNT AMOUNT SECOND CURRENCY              
COLSDIQ  EQU   45                  DIFFERENCE PORTION - SECOND CURRENCY         
COLSADQ  EQU   46                  ADVANCE PORTION - SECOND CURRENCY            
*&&                                                                             
COLHSTQ  EQU   48                  TRANSACTION STATUS IN HEX                    
COLSEQQ  EQU   49                  SYSTEM SEQUENCE NO. (TRNKSBR/TRNSUB)         
COLDADQ  EQU   50                  TRANSACTION DISK ADDRESS                     
COLSELQ  EQU   56                  SELECTED                                     
COLHLDQ  EQU   57                  HELD                                         
COLOFSQ  EQU   58                  OFFSET                                       
* - - - - - - - - - - - - - - - - - *                                           
* COLUMNS BELOW ARE FOR VC/APPROVE  *                                           
* - - - - - - - - - - - - - - - - - *                                           
COLSYSQ  EQU   59                  SYSTEM                                       
COLMEDQ  EQU   60                  MEDIA                                        
COLCLIQ  EQU   61                  CLIENT                                       
COLPROQ  EQU   62                  PRODUCT                                      
COLESTQ  EQU   63                  ESTIMATE                                     
COLALTQ  EQU   64                  APPROVE LINE TYPE                            
COLVNDQ  EQU   65                  VENDOR                                       
COLVNIQ  EQU   66                  VENDOR INVOICE NUMBER                        
COLAABQ  EQU   67                                                               
COLACRQ  EQU   68                                                               
COLACDQ  EQU   69                                                               
COLACPQ  EQU   70                                                               
COLATCQ  EQU   71                                                               
COLACUQ  EQU   72                                                               
COLACAQ  EQU   73                                                               
COLVNMQ  EQU   74                  VENDOR NAME                                  
* - - - - - - - - -                                                             
         EJECT                                                                  
SAVED    DSECT                     ** SAVED STORAGE **                          
XTYPVALS DS    0X                  ** THIS TIME TYPE VALUES **                  
XTYPNAME DS    CL(TYPADLQ)         NAME                                         
XTYPE    DS    XL1                 NUMBER                                       
XTYPINDS DS    XL1                 INDICATORS                                   
*                                                                               
XACTVALS DS    0X                  ** ACTION VALUES REAL/INTERIM **             
XACTNAME DS    CL(ACTADLQ)         NAME                                         
XACTION  DS    XL1                 NUMBER                                       
XACTINDS DS    XL1                 INDICATORS                                   
XACTIND2 DS    XL1                 INDICATORS 2                                 
*                                  ** ACTION VALUES REAL ONLY **                
XACTOLAY DS    XL1                 OVERLAY NUMBER                               
XACTSCR1 DS    XL1                 HEADER SCREEN NUMBER                         
XACTSCR2 DS    XL1                 INPUT SCREEN NUMBER                          
XACTALFA DS    CL2                 ALPHA CODE FOR PROFILE LOOK-UP               
         DS    XL2                                                              
XACTYTOT DS    Y                   Y(ACTION TOTALS-MARKER)                      
SACTNAME DS    CL(ACTADLQ)         SAVED NAME                                   
SACTION  DS    XL1                 SAVED NUMBER                                 
SACTINDS DS    XL1                 SAVED INDICATORS                             
SACTIND2 DS    XL1                 SAVED INDICATORS 2                           
*                                                                               
DISVALS  DS    0X                  ** INPUT DISPLAY VALUES **                   
DISIND   DS    XL1                 DISPLAY STATUS                               
DISIRST  EQU   X'80'               RESTART FROM BEGINNING                       
DISIBOF  EQU   X'40'               INDICATES BOF                                
DISIEOF  EQU   X'20'               INDICATES EOF                                
DISIOFLO EQU   X'10'               ALLOW/INDICATE OVERFLOW                      
DISINCOL EQU   X'08'               NEW COLUMN DISPLAY OPTION                    
DISIFFLT EQU   X'04'               FORCE RE-FILTERING OF DISLIST                
DISINIT  EQU   X'02'               DISPLAY INITIALIZED FOR GRIDS                
DISIND2  DS    XL1                 DISPLAY STATUS                               
DISNOTFS EQU   X'80'               NOT FIRST TIME                               
DISMULT  EQU   X'40'               MULTIPLE ROWS FOR SAME TSAR REC              
DISEOGR  EQU   X'20'               END OF GRID DATA BIT                         
DISMAX   DS    H                   HIGHEST TSAR RECORD NUMBER                   
DISNUM   DS    H                   CURRENT RECORD NUMBER                        
DISNEXT  DS    H                   NEXT RECORD NUMBER                           
DISLCNT  DS    H                   COUNT OF LINES DISPLAYED ON SCREEN           
DISLIST  DS    (LINES)H            TSARRECS DISPLAYED/TO BE DISPLAYED           
DISLISTL EQU   *-DISLIST                                                        
DISHEAD  DS    2CL(L'DISLLINE)     INPUT SCREEN LEFT HAND HEADINGS              
DISPHED  DS    H                   DISPLACEMENT OF DISPLAY HEADLINE             
DISPHED2 DS    H                   DISPLACEMENT OF 2ND HEADLINE                 
DISPDET  DS    H                   DISPLACEMENT OF FIRST DETAIL LINE            
DISPTOT  DS    H                   DISPLACEMENT OF TOTALS LINE                  
DISPPFK  DS    H                   DISPLACEMENT OF PF KEY LINE                  
*                                                                               
DISSTART DS    X                   START POSITION FOR DATA DISPLAY              
DISEND   DS    X                   END POSITION FOR DATA DISPLAY                
MAXLINES DS    X                   MAX LINES ON SCREEN                          
DISLINE  DS    X                   NEXT POSITION AVAILABLE FOR DATA             
*SNEXTST DS    H                   TSAR REC NO FOR NEXT DISPLAY START           
*SLSTLIN DS    H                   TSAR REC NO AT END OF SCREEN                 
*SLSTREC DS    H                   LAST REC NO IN TSAR BLOCK -DISMAX            
LINE     DS    H                   LINE NUMBER (ENQDATA = 1)                    
LINEMAX  DS    X                   MAX LINE NUMBER                              
GRDNDOR  DS    X                                                                
*                                                                               
PROFILE1 DS    0XL16               ** TYPE/ACTION PROFILE PAGE 1 **             
PROFSEQ  DS    0XL8                SORT SEQUENCE (VALUES=0-8)                   
PROFS1   DS    XL1                 1ST KEY FIELD                                
PROFS2   DS    XL1                 2ND KEY FIELD                                
PROFS3   DS    XL1                 3RD KEY FIELD                                
PROFS4   DS    XL1                 4TH KEY FIELD                                
PROFS5   DS    XL1                 5TH KEY FIELD                                
PROFS6   DS    XL1                 6TH KEY FIELD                                
PROFS7   DS    XL1                 7TH KEY FIELD                                
PROFS8   DS    XL1                 8TH KEY FIELD                                
PROFDIS  DS    0XL12               UP TO 12 DISPLAY COLUMNS (0-21)              
PROFD1   DS    XL1                 1ST DISPLAY VALUE                            
PROFD2   DS    XL1                 2ND DISPLAY VALUE                            
PROFD3   DS    XL1                 3RD DISPLAY VALUE                            
PROFD4   DS    XL1                 4TH DISPLAY VALUE                            
PROFD5   DS    XL1                 5TH DISPLAY VALUE                            
PROFD6   DS    XL1                 6TH DISPLAY VALUE                            
PROFD7   DS    XL1                 7TH DISPLAY VALUE                            
PROFD8   DS    XL1                 8TH DISPLAY VALUE                            
PROFILE2 DS    0XL16               ** TYPE/ACTION PROFILE PAGE 2 **             
PROFD9   DS    XL1                 9TH DISPLAY VALUE                            
PROFD10  DS    XL1                 10TH DISPLAY VALUE                           
PROFD11  DS    XL1                 11TH DISPLAY VALUE                           
PROFD12  DS    XL1                 12TH DISPLAY VALUE                           
PROFDISC DS    XL1                 CA - ADD CASH DISC. (NOT USED IN UK)         
PROFBATY EQU   PROFDISC            GR - TEST BATCH TYPE                         
PROFXREC EQU   PROFDISC            BV - EXCLUDE RECONCILED ITEMS                
PROFBSDT EQU   PROFDISC            BR - BANK STATEMENT DATE COMPULSORY          
PROFSXFR EQU   PROFDISC            MR - SHOW PRIOR TRANSFERS                    
PROFCRNT EQU   PROFDISC            CM - ALLOW CREDIT NOTE (-VE CHQAMT)          
PROFREPT DS    XL1                 REPORT REQUIRED ON UPDATE                    
PROFDUED DS    XL1                 CA CS CD CH - SORT DATE IS DUE DATE          
PROFNREC EQU   PROFDUED            BV - DON'T AUTO-RECONCILE                    
PROFXALR EQU   PROFDUED            GR - EXCLUDE ALLOCATED RECEIVABLES           
PROFDFAV EQU   PROFDUED            CM - DIFFERENCES/ADVANCES                    
PROFCFRM DS    XL1                 QUIT/UPDATE CONFIRMATION RULE                
PROFBTIC DS    XL1                 BV CM BATCH TOTAL/ITEM COUNT RULE            
PROFVPAY DS    XL1                 BV ALLOW VOID/UNVOID OF PAYMENTS             
PROFCLEX EQU   PROFVPAY            CM CLEAR EXCHANGE RATE FIELD                 
PROFMXDF DS    XL1                 CM MAXIMUM DIFFERENCE (PENNIES)              
*        DS    XL5                 SPARE PROFILES                               
*                                                                               
PRTSUB   DS    CL3                 REPORT-ID FOR ONLINE JOURNAL                 
*                                                                               
*                                                                               
FILTERS  DS    0X                  INTERNAL TSAR RECORD FILTERS                 
FILTCHQ  DS    XL1                 SHOW CHEQUES OR INVOICES (CC,BV)             
*                                  FILTERS FOR CHEQUE-STYLE (CC,BV)             
FILTCHN  DS    CL(L'MPYNO)         CHEQUE NUMBER                                
FILTCHD  DS    CL(L'MPYDTE)        CHEQUE DATE                                  
FILTCHB  DS    CL(L'MPYBNK)        CHEQUE BANK U/L/ACCOUNT                      
FILTCHA  DS    PL6                 CHEQUE AMOUNT                                
FILTCHAF DS    PL6                 CHEQUE AMOUNT IN FOREIGN CURRENCY            
FILTSBR  DS    XL1                 CHEQUE SUB-REFERENCE                         
FILTEHN  DS    CL(L'MPYNO)         CHEQUE NUMBER  (EX. DIFF FILTER)             
FILTEHD  DS    CL(L'MPYDTE)        CHEQUE DATE    (EX. DIFF FILTER)             
FILTEHB  DS    CL(L'MPYBNK)        CHEQUE BANK U/L/ACCOUNT (EX. DIFF)           
*&&UK                                                                           
         ORG   FILTCHN                                                          
FILTCHS  DS    0XL(CHQMAX*L'TSARFCH1)  FILTERS FOR INVOICE-STYLE (CC)           
FILTCH1  DS    XL(L'TSARFCH1)      MATCHED CHEQUE 1                             
FILTCH2  DS    XL(L'TSARFCH1)      MATCHED CHEQUE 2                             
FILTCH3  DS    XL(L'TSARFCH1)      MATCHED CHEQUE 3                             
FILTCH4  DS    XL(L'TSARFCH1)      MATCHED CHEQUE 4                             
FILTCH5  DS    XL(L'TSARFCH1)      MATCHED CHEQUE 5                             
FILTCH6  DS    XL(L'TSARFCH1)      MATCHED CHEQUE 6                             
         ORG                                                                    
*&&                                                                             
XACTVAL2 DS    0X                  THIS TIME ACTION VALUES - 2                  
XACTBTYP DS    XL1                 ACTION BATCH TYPE OR 0                       
XACTOPEV DS    XL3                 BIT VALUE FOR OPTION VALIDATION              
COMPSTAD DS    CL(L'CPYSTATD)      13TH STATUS BYTE                             
         DS    XL1                 N/D                                          
COMPGMOA DS    XL2                 GL MOA DATE FOR ADDTRNS                      
*                                                                               
SSAVE    DS    0X                  SUPER SAVE AREA                              
PCDRIVEN DS    XL1                 PC ACCOUNTING FLAG                           
PCMODEQ  EQU   X'80'               APPLICATION IN PC ACCOUNTING MODE            
PCGDATQ  EQU   X'40'               GRID DATA POSSIBLE                           
PCGRIDQ  EQU   X'20'               PASS GRID DATA                               
PCGSCRQ  EQU   X'10'               GRID DATA TO SCREEN                          
PCGRMSG1 EQU   X'08'               GRID MESSAGE TYPE 1                          
PCGRMSG2 EQU   X'04'               GRID MESSAGE TYPE 2                          
TSA2MODE DS    XL1                 TSAR 2 MODE                                  
TSA2MINI EQU   X'80'               TSAR 2 INITIALISED                           
TSA2MRSV EQU   X'40'               TSAR 2 TEMPEST RESERVED                      
TSA2TSIN DS    XL1                 TSAR 2 TSAR INDICATOR                        
TSA2PAGL DS    XL1                 TSAR 2 TSPAGL                                
TSA2PAGN DS    XL1                 TSAR 2 TSPAGN                                
SSAVOLY  DS    XL20                AVAILABLE TO OVERLAY                         
SSAVEL   EQU   *-SSAVE                                                          
*                                                                               
*        DS    XL8                 N/D                                          
*                                                                               
SOPTDIS  DS    XL(1+L'OPTDIS)      SAVED CHAR. DISPLAY OPT FROM SCREEN          
*                                                                               
CHQCNT   DS    H                   CHEQUE COUNTER (CC)                          
STSARNUM DS    H                   SAVED TSAR RECORD NUMBER (CC)                
STSARKEY DS    XL(L'TSARKEY)       SAVED TSAR KEY FOR SINGLE CHQ (CC)           
STSARFLG DS    XL1                 FLAG BYTE                                    
STSAVEQ  EQU   X'80'               SAVE TSAR KEY BEFORE ADD (CC)                
STSARCNT DS    XL(L'TSARCNT)       SAVED REC. COUNT (RECORD NO.)                
STSARHIT DS    XL2                 HITS ON SAVED TSAROFF/STT (CO/GO/GR)         
STSAROFF DS    XL2                 SAVED TSAR OFFICE (CO/GO/GR)                 
STSARSTT DS    XL1                 SAVED TSAR STAT (VARIOUS) (CO/GO/GR)         
*&&UK                                                                           
STSARAFC DS    CL(L'TSARAFCC)      SAVED TSAR CURRENCY (CO/GO/GR/CC)            
*&&                                                                             
*                                                                               
SSCRCOLL DS    XL1                 LEFT SCROLL DISPLACEMENT                     
         DS    XL1                 RIGHT SCROLL DISPLACEMENT                    
SSCROLL  DS    XL1                                                              
SSCROLLR EQU   X'80'               BUILD FROM RIGHT                             
SSCROLLV EQU   X'40'               VERTICAL SCROLL                              
*        DS    XL28                N/D                                          
*&&UK                                                                           
FILTVAL  DS    XL(FILTDL)          GENERAL FILTERS                              
SAFCIND1 DS    XL1                 SAVED AFC INDICATOR                          
SAFCI1ON EQU   X'80'               DISPLAY FOREIGN CURRENCY TOTALS              
SAFCI1AL EQU   X'40'               ALL CURRENCIES INCLUDED                      
SAFCI1BC EQU   X'20'               BANK ACCOUNT IN CURRENCY                     
SAFCI1SC EQU   X'10'               SINGLE FORIEGN CURRENCY IN USE               
SAFCIALT EQU   X'08'               DISPLAY ALTERNATE TOTAL ITEM                 
SAFCIGBP EQU   X'04'               ITEMS WITHOUT AFCEL'S                        
SAFCIEUR EQU   X'02'               EUR IS THE SINGLE FOREIGN CURRENCY           
SAVROUND DS    PL3                 SAVED ROUNDING ERROR TOTAL                   
SAVROUNS DS    PL3                 SAVED ROUNDING ERROR TOTAL (2ND)             
         DS    XL10                N/D                                          
*&&                                                                             
         DS    0H                                                               
SZDADDR  DS    XL4                 SAVED DISK ADDRESS FOR ZOOM                  
SZSTATS  DS    XL1                 SAVED DISK STATUS                            
SZTWASC  DS    XL1                 SAVED SCREEN # PRIOR TO ZOOM                 
SZOOMRK  DS    H                   SAVED DISPLACEMENT OF ZOOM MARK              
SZFLAGS  DS    XL1                 SAVED ZOOM FLAGS                             
SZFMRK   EQU   X'80'               ZOOM TRANSACTION MARKED                      
SZFNMS   EQU   X'40'               NO ROOM FOR MARK STATUS                      
SZFERP   EQU   X'20'               EARLIEST PAYMENT DATE CHANGED                
SZFSWP   EQU   X'10'               AFCEL/OLDAFCEL SWAPPED                       
SZFNAR   EQU   X'08'               NARRATVE ALTERED                             
SZFDDT   EQU   X'04'               DUE DATE ALTERED                             
STAIND1  DS    XL1                 STATUS INDICATOR                             
STA1LID  EQU   X'80'               LAST ITEM DELETABLE                          
STA1PROD EQU   X'08'               PRODUCTION                                   
STA1VEN  EQU   X'04'               VENDER LEDGER                                
STA1BANK EQU   X'02'               BANK LEDGER                                  
STWAPAS# DS    XL2                 PASSWORD NUMBER                              
SZOORNUM DS    XL2                 SAVE TSAR RECORD NUMBER FOR ZOOM             
*        DS    XL6                 N/D                                          
*                                                                               
TOTALS   DS    8PL8                UP TO 8 TOTALS DEFINED BY OVERLAY            
*&&UK                                                                           
CURTOTS  DS    8PL8                UP TO 8 CURRENCY TOTALS                      
*&&                                                                             
TOTALSN  EQU   (*-TOTALS)/L'TOTALS                                              
*                                                                               
TODAYP   DS    PL3                 TODAY'S DATE P'YYMMDD'                       
TODAYC   DS    XL2                 TODAY'S DATE COMPRESSED BINARY               
TODAYB   DS    XL3                 TODAY'S DATE B'YYMMDD'                       
MOSSTA   DS    CL(L'TRNKSMOS)      START MOS                                    
MOSEND   DS    CL(L'TRNKSMOS)      END MOS                                      
PERSTA   DS    CL(L'TRNKDATE)      PWOS START DATE                              
PEREND   DS    CL(L'TRNKDATE)      PWOS END DATE                                
ADASTA   DS    XL(L'TRSDATE)       COMPRESSED START DATE                        
ADAEND   DS    XL(L'TRSDATE)       COMPRESSED END DATE                          
REFVALS  DS    0X                                                               
REFSTA   DS    CL(L'TRNKREF)       START REFERENCE (ABSOLUTE IF NO END)         
REFSTAXL DS    XL1                 EXECUTE L'START REFERENCE                    
REFEND   DS    CL(L'TRNKREF)       END REFERENCE                                
REFENDXL DS    XL1                 EXECUTE L'END REFERENCE                      
REFVALSL EQU   *-REFVALS                                                        
*                                                                               
BATMON   DS    XL2                 BATCH MONTH                                  
BATREF   DS    XL4                 BATCH REFERENCE                              
BATNAM   DS    CL15                BATCH NAME                                   
BATMONP  DS    PL2                 PWOS BATCH YYMM                              
*                                                                               
HICMONP  DS    PL2                 PWOS BATCH YYMM                              
*                                                                               
ERPDSTA  DS    CL(L'GDADATE)       PWOS EARLIEST PAYMENT START DATE             
ERPDEND  DS    CL(L'GDADATE)       PWOS EARLIEST PAYMENT END DATE               
*                                                                               
UDASTA   DS    XL(L'TRSUDAT)       START USED DATE                              
UDAEND   DS    XL(L'TRSUDAT)       END USED DATE                                
*                                                                               
*        DS    XL4                 N/D                                          
*                                                                               
CHQAMS   DS    PL6                 CHEQUE AMOUNT (SECOND CURRENCY)              
*                                                                               
INTNUM   DS    CL7                 INTERNAL REFERENCE NUMBER (MR)               
*                                                                               
INVDATB  DS    XL2                 INVOICE VALUES (MR)                          
INVDATE  DS    CL6                                                              
INVDATP  DS    PL3                                                              
INVNUM   DS    CL6                                                              
         ORG   INVDATB                                                          
CHQDATB  DS    XL2                                                              
CHQDATE  DS    CL6                                                              
CHQDATP  DS    PL3                                                              
CHQNUM   DS    CL6                                                              
CHQTYPE  DS    XL1                                                              
CHQTDRS  EQU   X'00'               DEBITS (RECEIPTS) - DEFAULT                  
CHQTCRS  EQU   X'80'               CREDITS (PAYMENTS)                           
CHQTBTH  EQU   X'40'               BOTH                                         
CHQAMT   DS    PL6                 CHEQUE AMOUNT                                
CHQAMC   DS    PL6                 CHEQUE AMOUNT (CURRENCY)                     
*                                                                               
BATCTOT  DS    PL6                 BATCH CONTROL TOTAL                          
BATCTOTC DS    PL6                 BATCH CONTROL TOTAL                          
BATITEM  DS    XL2                 BATCH ITEM COUNT                             
*                                                                               
ICLMARK  DS    XL1                 INCLUDE MARKED TRANSACTIONS                  
ICLMNO   EQU   X'80'               UNMARKED ONLY - DEFAULT                      
ICLMYES  EQU   X'40'               UNMARKED & MARKED                            
ICLMONLY EQU   X'20'               MARKED ONLY                                  
ICLCRO   EQU   X'08'               CREDITS ONLY - DEFAULT (BR)                  
ICLDRCR  EQU   X'04'               CREDITS & DEBITS (BR)                        
ICLDRO   EQU   X'02'               DEBITS ONLY (BR)                             
*                                                                               
COMPVALS DS    0X                  ** EXTRACTED COMPANY VALUES **               
COMPALFA DS    CL(L'CPYALPHA)      ALPHA CODE                                   
COMPSTAT DS    CL(L'CPYSTAT1)      1ST STATUS BYTE                              
COMPSTA2 DS    CL(L'CPYSTAT2)      2ND STATUS BYTE                              
COMPSTA3 DS    CL(L'CPYSTAT3)      3RD STATUS BYTE                              
COMPSTA4 DS    CL(L'CPYSTAT4)      4TH STATUS BYTE                              
COCDPASS DS    CL(L'CPYCDC)        N=NO CASH DISCOUNT TO CLIENTS                
BATCHSEC DS    CL(L'CPYBSEC)       BATCH SECURITY LEVEL                         
VATRATES DS    CL(CPYVATL)         VAT RATES/DATES                              
TENO     DS    CL(L'CPYTENO)       TE POSITION IN CONTRA                        
COMPSTA5 DS    CL(L'CPYSTAT5)      5TH STATUS BYTE                              
COMPSTA6 DS    CL(L'CPYSTAT6)      6TH STATUS BYTE                              
COMPSTA7 DS    CL(L'CPYSTAT7)      7TH STATUS BYTE                              
COMPSTA8 DS    CL(L'CPYSTAT8)      8TH STATUS BYTE                              
COMPSTA9 DS    CL(L'CPYSTAT9)      9TH STATUS BYTE                              
*&&UK                                                                           
COMPSCMO DS    PL2                 PWOS SECOND CURRENCY START MOA               
SCNDCURT DS    XL(CURTABL)         SECONDARY CURRENCY CURTAB ENTRY              
SCURIND1 DS    XL1                 SECONDARY CURRENCY INDICATOR - 1             
SCURITOT EQU   X'80'               SECONDARY CURRENCY TOTALS REQUESTED          
SCURIOMT EQU   X'40'               OVERLAY MAINTAINS SECOND CURR TOTALS         
*&&                                                                             
*&&US                                                                           
*        DS    XL11                N/D                                          
*&&                                                                             
COMPSTAA DS    CL(L'CPYSTATA)      10TH STATUS BYTE                             
*        DS    XL3                 N/D                                          
*&&UK                                                                           
COMPCURT DS    XL(CURTABL)         COMPANY CURTAB ENTRY                         
FORECURT DS    XL(CURTABL)         FOREIGN CURTAB ENTRY - SAFCI1FC ON           
PRSTCURT DS    XL(CURTABL)         PRESET CURTAB ENTRY                          
*&&                                                                             
BANKCUR  DS    CL(L'CURTCUR)       BANK ACCOUNT CURRENCY                        
*                                                                               
EXACT    DS    CL(L'GEKACT)        EXCHANGE RATE ACCOUNT                        
ATLX     DS    0XL(L'AFCX)         AGENCY TO LOCAL EXCHANGE RATE RULES          
ATLXSTAT DS    XL(L'AFCXSTAT)      EXCHANGE RATE STATUS                         
ATLXSFIX EQU   AFCXSFIX            FIXED EXCHANGE RATE (NOT APPLICABLE)         
ATLXSDIV EQU   AFCXSDIV            DIVIDE BY ATLXRATE                           
ATLXRATE DS    PL(L'AFCXRATE)      LOCAL TO BANK EXCHANGE RATE PWOS             
ATLXSHFT DS    XL(L'AFCXSHFT)      SHIFT VALUE (SRP FORMAT)                     
*                                                                               
PALAREA  DS    XL20                P&L BUCKET AREA                              
*        DS    XL12                N/D                                          
*                                                                               
LEDGER   DS    CL2                 ** KEY VALUES **  UNIT/LEDGER                
LEDGBRCC DS    XL1                 BRANCH CC (TO FILTER DR/CR ETC.)             
*                                                                               
ACCOUNT  DS    CL(L'ACTKCULA)      C/U/L/ACCOUNT                                
ACCNAME  DS    CL(L'NAMEREC)       ACCOUNT NAME FOR INPUT SCREEN                
ACCBAL   DS    PL8                 ACCOUNT BALANCE FOR INPUT SCREEN             
*                                                                               
OFFICE   DS    CL(L'OFFKOFF)       OFFICE                                       
OFFICEXL DS    XL1                 EXECUTE L'OFFICE                             
*                                                                               
WORKCODE DS    CL(L'WCOKWRK)       WORKCODE                                     
*                                                                               
CONTRA   DS    CL(L'TRNKCULC)      C/U/L/CONTRA-ACCOUNT                         
CONTRAXL DS    XL1                 EXECUTE L'C/U/L/CONTRA-ACCOUNT               
CONTIND  DS    XL1                 CONTRA ACCOUNT INDICATOR                     
CONTILOQ EQU   X'80'               CONTRA IS A BONA FIDE LOW LEVEL A/C          
*                                  SEE ACCIND EQUS FOR SUPPLIER C/A'S           
*                                                                               
CONBNK   DS    CL(L'TRNKCULC)      BANK ACCOUNT AS CONTRA/MPYBNK                
CONBNKXL DS    XL1                 EXECUTE L'CONTRA BANK A/C                    
CONBIND  DS    XL1                 CONTRA BANK A/C INDICATOR                    
*                                                                               
ARTFUL   DS    XL2                 ARTISTS' FEES UNIT/LEDGER                    
*                                                                               
BANKUL   DS    CL(L'CPYBANK)       BANK ACCOUNT UNIT/LEDGER                     
*                                                                               
EXPSUL   DS    XL2                 EXPENSES UNIT/LEDGER                         
*                                                                               
FOLIUL   DS    XL2                 FOLIO UNIT/LEDGER                            
*                                                                               
PRODVALS DS    0X                  PRODUCTION LEDGER VALUES                     
PRODUL   DS    XL2                 PRODUCTION UNIT/LEDGER                       
PRODLEVS DS    0XL3                LEDGER LEVEL LENGTHS                         
PRODALEN DS    XL(L'ACLVLEN)       L'LEVA                                       
PRODBLEN DS    XL(L'ACLVLEN)       L'LEVA+L'LEVB                                
PRODCLEN DS    XL(L'ACLVLEN)       L'LEVA+L'LEVB+L'LEVC                         
PRODSOFC DS    XL(L'PPRGAOFF)      SAVED COMPOSITE OFFICE CODE                  
PRODVALL EQU   *-PRODVALS                                                       
*                                                                               
RECVUL   DS    CL(L'CPYRECV)       RECEIVABLES UNIT/LEDGER                      
*                                                                               
SRCACC   DS    CL(L'ACTKCULA-1)    SOURCE ACCOUNT UNIT/LEDGER/ACCOUNT           
SRCACCXL DS    XL1                 EXECUTE L'SOURCE ACCOUNT                     
*                                                                               
SUPPUL   DS    CL(L'CPYSUPP)       SUPPLIER UNIT/LEDGER                         
*                                                                               
SUPXUL   DS    CL(L'CPYSUPP)       SUPPLIER EXPENSE UNIT/LEDGER                 
*                                                                               
ACCINDS  DS    0XL2                ** ACCOUNT INDICATORS **                     
ACCIND1  DS    XL1                 ACCOUNT INDICATOR - BYTE 1                   
ACCIREPC EQU   X'80'               SPOT/PRINT REP                               
ACCISPOT EQU   X'40'               SPOT VENDOR                                  
ACCIPRNT EQU   X'20'               PRINT VENDOR                                 
ACCIPROD EQU   X'10'               PRODUCTION VENDOR                            
ACCIPUBN EQU   X'08'               PRINT VENDOR SPECIAL PUBLICATION NO.         
ACCINETW EQU   X'04'               SPOT VENDOR IS NETWORK                       
*                                  BITS SHARED BY CONTIND                       
ACCISVLS EQU   ACCISPOT+ACCIPRNT+ACCIPROD+ACCINETW                              
*                                                                               
ACCIND2  DS    XL1                 ACCOUNT INDICATOR - BYTE 2                   
ACCIFRTX EQU   X'80'               FREELANCE TAX RATE ON SUPPLIER               
ACCISUND EQU   X'40'               SUPPLIER IS A SUNDRY CREDITOR                
*                                                                               
VOIDIND1 DS    XL1                 BANK/VOID INDICATORS - 1                     
VOIDVOID EQU   X'80'               ACTION IS VOID                               
VOIDUVOI EQU   X'40'               ACTION IS UNVOID                             
VOIDANBP EQU   X'20'               ANALYSED BANK POSTINGS                       
VOIDBCHA EQU   X'10'               (UN)VOID BANK CHARGES                        
*                                                                               
FLTAMOS  DS    0XL8                CONTIGUOUS FILTER AMT/MOS                    
FLTAMT   DS    PL6                 FILTER AMOUNT SET BY OVERLAY (GR)            
FLTMOS   DS    PL2                 FILTER MOS SET BY OVERLAY (GR)               
*                                                                               
TAXAUL   DS    XL2                 VAT UNIT/LEDGER                              
*                                                                               
RCNBAL   DS    PL8                 BANK A/C RECONCILED BALANCE                  
*                                                                               
SUPPACC  DS    XL(L'ACTKCULA)      SUPPLIER C/U/L/ACCOUNT                       
*                                                                               
FILEFORM DS    XL1                 FILE FORMAT                                  
VLISQ    EQU   1                   VARIABLE LENGTH INDEXED SEQUENTIAL           
ISDAQ    EQU   2                   INDEXED SEQUENTIAL/DIRECT ACCESS             
*                                                                               
XSUBOLAY DS    XL1                 CURRENT SUBSIDIARY OVERLAY NUMBER            
XSUBO71  EQU   X'71'               SELECT BY CHEQUE                             
XSUBO72  EQU   X'72'               SELECT BY INVOICE                            
*                                                                               
DSLISTU  DS    0CL1100             ** UPPER CASE DICTIONARY **                  
OP3ACC   DS    CL3                                                              
OP3ALCTD DS    CL3                                                              
OP3ALL   DS    CL3                                                              
OP3AMT   DS    CL3                                                              
AC3AUTH  DS    CL3                                                              
OP3AUTH  EQU   AC3AUTH                                                          
OP3BAL   DS    CL3                                                              
OP3BATM  DS    CL3                                                              
OP3BATRF DS    CL3                                                              
AC3BNK   DS    CL3                                                              
AC3CHEQ  DS    CL3                                                              
OP3CHGD  DS    CL3                                                              
OP3CLI   DS    CL3                                                              
OP3CMM   DS    CL3                                                              
AC3CRD   DS    CL3                                                              
AC3VCA   DS    CL3                                                              
OP3CTD   DS    CL3                                                              
OP3CTR   DS    CL3                                                              
AC3CURRY DS    CL3                                                              
OP3CURRY EQU   AC3CURRY                                                         
OP3DATAD DS    CL3                                                              
OP3DATE  DS    CL3                                                              
AC3DISC  DS    CL3                                                              
OP3DSC   EQU   AC3DISC                                                          
AC3DRAFT DS    CL3                                                              
OP3DSP   DS    CL3                                                              
OP3DUEDT DS    CL3                                                              
OP3EST   DS    CL3                                                              
OP3FXDRF DS    CL3                                                              
AC3GEN   DS    CL3                                                              
OP3HELD  DS    CL3                                                              
AC3HOLD  DS    CL3                                                              
*&&UK                                                                           
AC3INTNL DS    CL3                                                              
*&&                                                                             
AC3INV   DS    CL3                                                              
OP3INV   EQU   AC3INV                                                           
OP3JOB   DS    CL3                                                              
OP3MARKD DS    CL3                                                              
OP3MAT   DS    CL3                                                              
AC3MED   DS    CL3                                                              
AC3MEMO  DS    CL3                                                              
OP3MMODT DS    CL3                                                              
OP3MOA   DS    CL3                                                              
OP3NAME  DS    CL3                                                              
AC3NUMB  DS    CL3                                                              
OP3NUM   EQU   AC3NUMB                                                          
OP3OFF   DS    CL3                                                              
AC3OFFS  DS    CL3                                                              
OP3PAG   DS    CL3                                                              
OP3PND   EQU   AC@PENDG                                                         
OP3PRO   DS    CL3                                                              
OP3PUB   DS    CL3                                                              
AC3QUIT  DS    CL3                                                              
AC3RECN  DS    CL3                                                              
OP3REC   EQU   AC3RECN                                                          
OP3REF   DS    CL3                                                              
AC3REVS  DS    CL3                                                              
OP3REV   EQU   AC3REVS                                                          
OP3SBR   DS    CL3                                                              
AC3SEL   DS    CL3                                                              
OP3SEL   EQU   AC3SEL                                                           
AC3SELC  DS    CL3                                                              
OP3SRC   DS    CL3                                                              
OP3STMDT DS    CL3                                                              
OP3SUP   DS    CL3                                                              
AC3TUNIT DS    CL3                                                              
OP3TYP   DS    CL3                                                              
AC3UPD   DS    CL3                                                              
AC3URG   DS    CL3                                                              
OP3URG   EQU   AC3URG                                                           
AC3VOID  DS    CL3                                                              
OP3VOI   EQU   AC3VOID                                                          
OP3WRK   DS    CL3                                                              
AC3WIP   DS    CL3                                                              
OP3RECDT DS    CL3                                                              
OP3CLRDT DS    CL3                                                              
AC8ACC   DS    CL8                                                              
OP8ACC   EQU   AC8ACC                                                           
OP8ALCTD DS    CL8                                                              
OP8ALL   DS    CL8                                                              
OP8AMT   DS    CL8                                                              
OP8AUTH  DS    CL8                                                              
OP8BAL   DS    CL8                                                              
OP8BATM  DS    CL8                                                              
OP8BATRF DS    CL8                                                              
AC8CHEQ  DS    CL8                                                              
OP8CHGD  DS    CL8                                                              
OP8CLI   DS    CL8                                                              
OP8CMM   DS    CL8                                                              
OP8CTD   DS    CL8                                                              
OP8CTR   DS    CL8                                                              
OP8DATAD DS    CL8                                                              
OP8DATE  DS    CL8                                                              
OP8DSC   DS    CL8                                                              
OP8DSP   DS    CL8                                                              
OP8EST   DS    CL8                                                              
OP8FXDRF DS    CL8                                                              
OP8HELD  DS    CL8                                                              
OP8INV   DS    CL8                                                              
OP8JOB   DS    CL8                                                              
OP8MARKD DS    CL8                                                              
OP8MAT   DS    CL8                                                              
OP8MMODT DS    CL8                                                              
OP8MOA   DS    CL8                                                              
OP8NAME  DS    CL8                                                              
OP8NUM   DS    CL8                                                              
OP8OFF   DS    CL8                                                              
OP8PAG   DS    CL8                                                              
OP8PND   DS    CL8                                                              
OP8PRO   DS    CL8                                                              
OP8PUB   DS    CL8                                                              
OP8REC   DS    CL8                                                              
OP8REF   DS    CL8                                                              
OP8REV   DS    CL8                                                              
OP8SBR   DS    CL8                                                              
OP8SEL   DS    CL8                                                              
OP8SRC   DS    CL8                                                              
OP8STMDT DS    CL8                                                              
OP8SUP   DS    CL8                                                              
OP8TYP   DS    CL8                                                              
OP8URG   DS    CL8                                                              
OP8VOI   DS    CL8                                                              
OP8WRK   DS    CL8                                                              
OP8RECDT DS    CL8                                                              
OP8CLRDT DS    CL8                                                              
AC10ATH  DS    CL10                                                             
AC10BNK  DS    CL10                                                             
AC10CHQ  DS    CL10                                                             
AC10CRD  DS    CL10                                                             
AC10VCA  DS    CL10                                                             
AC10DSC  DS    CL10                                                             
AC10DRF  DS    CL10                                                             
AC10GEN  DS    CL10                                                             
AC10HLD  DS    CL10                                                             
AC10MAN  DS    CL10                                                             
AC10MED  DS    CL10                                                             
AC10NUM  DS    CL10                                                             
AC10OFS  DS    CL10                                                             
AC10QUI  DS    CL10                                                             
AC10RCN  DS    CL10                                                             
AC10REV  DS    CL10                                                             
AC10SEL  DS    CL10                                                             
AC10UPD  DS    CL10                                                             
AC10VOI  DS    CL10                                                             
AC10WIP  DS    CL10                                                             
AC@ACC   DS    CL14                ENTRIES MUST BE >= 4 BYTES LONG              
AC@ALTPF DS    CL6                                                              
AC@AMT   DS    CL13                                                             
AC@BATCH DS    CL6                                                              
AC@BOTH  DS    CL6                                                              
AC@CHKC  DS    CL6                                                              
AC@CR    DS    CL2                                                              
OP2CR    EQU   AC@CR                                                            
AC@CRS   DS    CL13                                                             
AC@CTRA  DS    CL14                                                             
AC@DR    DS    CL2                                                              
AC@DRS   DS    CL13                                                             
AC@END   DS    CL3                                                              
AC@FACC  DS    CL7                                                              
SCR@FRST DS    CL8                                                              
AC4GROSS DS    CL4                                                              
SCR@HALF DS    CL7                                                              
AC@JOB   DS    CL12                                                             
SCR@LAST DS    CL8                                                              
AC@MARK  DS    CL5                                                              
AC@MOS   DS    CL5                                                              
AC@MSNG  DS    CL8                                                              
AC@NO    DS    CL3                                                              
AC@NXT   DS    CL3                                                              
AC@OFF   DS    CL2                                                              
AC@ONLY  DS    CL4                                                              
SCR@PAGE DS    CL7                                                              
AC@PENDG DS    CL3                                                              
AC@PFK   DS    CL3                                                              
AC@PRINT DS    CL8                                                              
AC@REF   DS    CL6                                                              
AC@SAVE  DS    CL3                                                              
AC@SRC   DS    CL14                                                             
AC@SUP   DS    CL14                                                             
AC@TYPE  DS    CL2                                                              
AC@WC    DS    CL2                                                              
OP2WRK   DS    CL2                                                              
AC@YES   DS    CL3                                                              
AC@ZOOM  DS    CL6                                                              
OP3ERPYD DS    CL3                                                              
AC3BALN  DS    CL3                                                              
AC10BAL  DS    CL10                                                             
OP82CUR  DS    CL8                                                              
OP32CUR  DS    CL3                                                              
AC@INSRT DS    CL4                                                              
AC@RPLC  DS    CL4                                                              
OP8UDAT  DS    CL8                                                              
OP3UDAT  DS    CL3                                                              
OP8CTRDD DS    CL8                                                              
OP3CTRDD DS    CL3                                                              
DSLISTUS DS    XL(L'DSLISTU-(*-DSLISTU))  SPARE UPPER CASE DICTIONARY           
*                                                                               
*SLISTL  DS    0CL1477             ** MIXED CASE DICTIONARY **                  
DSLISTL  DS    0CL1490             ** MIXED CASE DICTIONARY **                  
LC8ACC   DS    CL8                                                              
LC@ACRL  DS    CL7                                                              
LC@ACRRV DS    CL16                                                             
LC@ADR   DS    CL8                                                              
LC@ALTPF DS    CL6                                                              
LC@AMT   DS    CL13                                                             
LC@AMTR  DS    CL13                                                             
LC@ATHED DS    CL13                                                             
LC@AUTHD DS    CL10                                                             
LC@BAL   DS    CL13                                                             
LC@BATCH DS    CL6                                                              
LC@BATTS DS    CL15                                                             
*&&UK                                                                           
LC@BKGDT DS    CL25                                                             
*&&                                                                             
LC@BLD   DS    CL6                                                              
LC@CALC  DS    CL10                                                             
LC13CHK  DS    CL13                                                             
LC@CHK   DS    CL6                                                              
LC@CHKS  DS    CL13                                                             
LC@CLOSE DS    CL5                                                              
LC@CLSD  DS    CL6                                                              
LC@CR    DS    CL2                                                              
LC@CRS   DS    CL13                                                             
LC@CRSR  DS    CL13                                                             
LC@CRSMK DS    CL13                                                             
LC@CTRA  DS    CL14                                                             
LC@CTRD  DS    CL12                                                             
LC8CTRD  DS    CL8                                                              
LC@CURRY DS    CL8                                                              
LC@CURYR DS    CL8                                                              
LC@ACTY  DS    CL8                                                              
*LC@DATAD DS    CL8                                                             
LC@DATE  DS    CL8                                                              
LC@DATED DS    CL5                                                              
LC@DEF   DS    CL8                                                              
LC@DFRNC DS    CL13                                                             
LC@DSC   DS    CL13                                                             
LC@DSCR  DS    CL13                                                             
LC@DR    DS    CL2                                                              
LC@DRFT  DS    CL8                                                              
LC@DRS   DS    CL13                                                             
LC@DRSR  DS    CL13                                                             
LC@DRSMK DS    CL13                                                             
LC@DUEDT DS    CL8                                                              
LC@END   DS    CL8                                                              
*&&UK                                                                           
LC@ENTRD DS    CL10                                                             
*&&                                                                             
LC@EXCHR DS    CL11                                                             
LC@EXDIF DS    CL13                                                             
LC@EXDF  DS    CL7                                                              
LC@FRST  DS    CL8                                                              
LC@FILT  DS    CL8                                                              
LC@FTRAT DS    CL10                                                             
LC@FXDRF DS    CL6                                                              
LC@GRSR  DS    CL13                                                             
LC@HALF  DS    CL8                                                              
LC@HELD  DS    CL13                                                             
LC@INTRD DS    CL8                                                              
LC20INV  DS    CL20                                                             
LC3INV   DS    CL3                                                              
LC@INVS  DS    CL13                                                             
LC@JOB   DS    CL12                                                             
LC@LAST  DS    CL8                                                              
LC@LEFT  DS    CL8                                                              
LC@MARK  DS    CL8                                                              
LC@MARKD DS    CL13                                                             
LC@MCHED DS    CL13                                                             
LC@MMODT DS    CL8                                                              
LC@MOA   DS    CL6                                                              
LC@MOS   DS    CL5                                                              
LC@MSNG  DS    CL8                                                              
LC@NCOM  DS    CL14                                                             
LC4NO    DS    CL4                                                              
LC@NOTAK DS    CL13                                                             
LC@NRTV  DS    CL25                                                             
LC@COUNT DS    CL7                                                              
LC@NUM   DS    CL9                                                              
LC@NXT   DS    CL8                                                              
*                                                                               
LC@OFF3  DS    0CL3                                                             
LC@OFF   DS    CL2                                                              
         DS    CL1                                                              
*                                                                               
LC@OFFST DS    CL13                                                             
LC@PAGE  DS    CL8                                                              
LC@PAID  DS    CL8                                                              
LC@PELED DS    CL6                                                              
LC@PENDG DS    CL8                                                              
LC@PSTGS DS    CL10                                                             
LC@PRD   DS    CL10                                                             
LC@QUIT  DS    CL8                                                              
LC@RCND  DS    CL13                                                             
*                                                                               
LC@REF   DS    0CL6                                                             
LC@REF3  DS    CL3                                                              
         DS    CL3                                                              
*                                                                               
LC@RIGHT DS    CL8                                                              
LC@RVRSD DS    CL13                                                             
LC5RVRSD DS    CL5                                                              
LC@RVRSL DS    CL8                                                              
LC@SEL   DS    CL8                                                              
LC@SELED DS    CL13                                                             
LC8SELED DS    CL8                                                              
LC@SERNO DS    CL8                                                              
LC@SRC   DS    CL14                                                             
LC@SUPN  DS    CL20                                                             
LC@STMDT DS    CL8                                                              
LC@STAT  DS    CL2                                                              
LC4STAT  DS    CL4                                                              
LC8STAT  DS    CL8                                                              
LC3SUBR  DS    CL3                                                              
LC@SUBR  DS    CL9                                                              
*&&UK                                                                           
LC@SUNCR DS    CL25                                                             
*&&                                                                             
LC@SUP   DS    CL14                                                             
LC@SWTCH DS    CL8                                                              
LC@TAKEN DS    CL13                                                             
LC@TAXBS DS    CL13                                                             
LC@TOTCU DS    CL8                                                              
LC@TOTLS DS    CL8                                                              
LC@TYPE  DS    CL2                                                              
LC3TYPE  DS    CL3                                                              
LC8TYPE  DS    CL8                                                              
LC@UATH  DS    CL10                                                             
LC@USDT  DS    CL8                                                              
LC@UNM   DS    CL13                                                             
LC@UNPR  DS    CL13                                                             
LC@UNMKD DS    CL13                                                             
LC@UPDT  DS    CL8                                                              
LC@UPDGL DS    CL14                                                             
LC@URG   DS    CL6                                                              
LC@USED  DS    CL4                                                              
LC@VOID  DS    CL13                                                             
LC4VOID  DS    CL4                                                              
LC@VSCHD DS    CL13                                                             
LC3VSCH  DS    CL3                                                              
LC@VSCHN DS    CL8                                                              
LC@WC    DS    CL2                                                              
LC3WRTF  DS    CL3                                                              
LC@WRTNF DS    CL13                                                             
LC3XFER  DS    CL3                                                              
LC@XFRD  DS    CL13                                                             
LC4YES   DS    CL4                                                              
LC@EXCD  DS    CL8                                                              
LC@AVNPA DS    CL13                                                             
LC@SPLIT DS    CL5                                                              
LC@RECDT DS    CL8                                                              
LC@CLRDT DS    CL8                                                              
*C@BAREF DS    CL15                                                             
*C@MEDTE DS    CL15                                                             
*C@MEREF DS    CL15                                                             
*C@MENOT DS    CL15                                                             
LC@ERPYD DS    CL30                                                             
LC@ACC   DS    CL15                                                             
LC@ON    DS    CL5                                                              
LC@AND   DS    CL5                                                              
LC@UDET  DS    CL5                  USING                                       
LC@OPTS  DS    CL10                                                             
LC@NONE  DS    CL5                                                              
LC@2CUR  DS    CL8                                                              
LC@CROR  DS    CL8                                                              
LC@ATH   DS    CL10                                                             
LC@HOLD  DS    CL8                                                              
LC@TRN   DS    CL6             TRANS                                            
LC@APRVD DS    CL8             APPROVED                                         
*LC@CLINT DS    CL6             CLIENT                                          
LC@SYSC  DS    CL3             SYSTEM                                           
LC@MEDC  DS    CL3             MEDIA                                            
LC@CLIC  DS    CL3             CLIENT                                           
LC@PRO   DS    CL3             PRODUCT                                          
LC@EST   DS    CL3             ESTIMATE                                         
LC@MMOS  DS    CL3             MOS                                              
LC@VNDR  DS    CL6             VENDOR                                           
LC@INVC2 DS    CL9             INVOICE #                                        
LC@RSBNT DS    CL10            BILLED NET                                       
LC@CASH  DS    CL4             CASH                                             
LC@RCVNT DS    CL12            RECEIVED NET                                     
LC@DISB  DS    CL9             DISBURSED                                        
LC@POSN  DS    CL8             POSITION                                         
LC@TOTAL DS    CL5             TOTAL                                            
LC@APG38 DS    CL7             CLEARED                                          
LC@CLRUI DS    CL11            CLEARED BUT                                      
LC@UNDIS DS    CL11            UNDISBURSED                                      
LC@AVAIL DS    CL9             AVAILABLE                                        
LC@CODE  DS    CL4             CODE                                             
LC@NAME  DS    CL4             NAME                                             
*                                                                               
LTYPACT  DS    0XL(L'XTYPE+L'XACTION)                                           
LTYPE    DS    XL(L'XTYPE)         LAST VALID TYPE                              
LACTION  DS    XL(L'XACTION)       LAST VALID ACTION                            
*                                                                               
FACTOR   DS    XL14                FACTORING COMPANY (PAYABLES)                 
*        DS    XL2                 N/D                                          
*                                                                               
SOVRWRK  DS    XL512               SAVED WORK AREA FOR OVERLAYS                 
*                                                                               
USEDTAB  DS    (MONTHS*YEARS)XL2   ** USED MOS TABLE **                         
USEDNTRY EQU   L'USEDTAB           LENGTH OF ONE ENTRY                          
USEDTABL EQU   *-USEDTAB           LENGTH OF TABLE                              
MONTHS   EQU   12                  12 MONTHS IN A YEAR                          
YEARS    EQU   20                  NEXT YEAR+THIS YEAR+18 PRIOR YEARS           
*                                  ** CURRENCY TABLE **                         
CURRTAB  DS    (CURRTABN)XL(CURTABL+L'CURTIND1)                                 
CURRTABN EQU   40                                                               
*                                                                               
LEDGTAB  DS    XL(LEDGLTAB)        ** LEDGER TABLE **                           
*                                                                               
SOVRWRK2 DS    XL1024              SAVED WORK AREA 2 FOR OVERLAYS               
*                                                                               
TSBINFO  DS    XL300               TSAR BUFFER INFORMATION                      
*                                                                               
SECBLK   DS    XL1024              SECRET BLOCK                                 
*&&UK                                                                           
SCUTOTS  DS    8PL8                UP TO 8 SECOND CURRENCY TOTALS               
SCUTOTL  EQU   *-SCUTOTS                                                        
*&&                                                                             
SAVEDLEN EQU   *-SAVED                                                          
*                                                                               
         ORG   SAVED+(SAVEAREL-TWASAVAL) ORG TILL END OF SAVE AREA              
SAVEDX   DS    0X                                                               
         EJECT                                                                  
APFTABD  DSECT                     ** ACTION PFKEY TABLE **                     
APFTPFK  DS    XL1                 PFKEY NUMBER                                 
APFTACT  DS    XL1                 ACTION NUMBER                                
APFTADDR DS    S                   ACTION SCON                                  
APFTLCAD DS    S                   ACTION SCON (LOWER CASE)                     
APFTACTI DS    XL1                 ACTION INDICATORS (SEE ACTINDS EQUS)         
APFTOVR  DS    XL1                 PFKEY RESTRICTED TO THIS OVERLAY             
APFTMODE DS    XL1                 CHEQUE/INVOICE MODE                          
APFTIND1 DS    XL1                 INDICATOR - 1                                
APFTINUQ EQU   X'80'               OBSERVE TWAMODE2,TWAM2NUQ                    
APFTI1FC EQU   X'40'               ONLY ONE FOREIGN CURRENCY                    
APFTICOD EQU   X'20'               INSERT CURRENCY CODE                         
APFTIALT EQU   X'10'               ALTERNATIVE TOTAL ITEM                       
APFTILFT EQU   X'08'               SCROLL COLUMNS LEFT                          
APFTIRGH EQU   X'04'               SCROLL COLUMNS RIGHT                         
APFTILNG EQU   X'02'               LONG ACTION WORD                             
APFTIP26 EQU   X'01'               DEPENDS ON PROFILE 26                        
APFTIND2 DS    XL1                 INDICATOR - 2                                
APFT2GRD EQU   X'80'               VALID FOR GRIDS                              
APFTIND3 DS    XL1                 INDICATOR - 3                                
APFTABL  EQU   *-APFTABD                                                        
         SPACE 1                                                                
MIDTABD  DSECT                                                                  
MIDACT   DS    AL3                 ACTION NUMBER                                
MIDLN    DS    XL2                 EIDTAB LENGTH                                
MIDLN1Q  EQU   *-MIDTABD                                                        
MIDSUB   DS    0X                                                               
MIDREF   DS    CL7                 ENQUIRY ID NUMBER                            
MIDCTRY  DS    XL1                 COUNTRY CODE                                 
MIDNLDG  DS    XL1                 NUMBER OF LEDGERS IN LEDGER LIST             
MIDALDGQ EQU   X'00'               ALL LEDGERS                                  
MIDSLNQ  EQU   *-MIDSUB            LENGTH OF SUB-ELEM WITHOUT LDG LIST          
MIDLEDG  DS    0CL2                LIST OF LEDGERS                              
         SPACE 1                                                                
DUMLINED DSECT                                                                  
DUMLIN1  DS    CL78                                                             
DUMLIN2  DS    CL78                                                             
DUMLIN3  DS    CL78                                                             
DUMLIN4  DS    CL78                                                             
DUMLIN5  DS    CL78                                                             
DUMLIN6  DS    CL78                                                             
DUMLIN7  DS    CL78                                                             
DUMLIN8  DS    CL78                                                             
DUMLIN9  DS    CL78                                                             
DUMLIN10 DS    CL78                                                             
DUMLIN11 DS    CL78                                                             
DUMLIN12 DS    CL78                                                             
DUMLIN13 DS    CL78                                                             
DUMLIN14 DS    CL78                                                             
DUMLIN15 DS    CL78                                                             
DUMLIN16 DS    CL78                                                             
DUMLIN17 DS    CL78                                                             
DUMLIN18 DS    CL78                                                             
DUMLIN19 DS    CL78                                                             
DUMLIN20 DS    CL78                                                             
NDUMLINE EQU   (*-DUMLINED)/L'DUMLIN1                                           
DUMLINLN EQU   *-DUMLINED                                                       
         SPACE 1                                                                
SPFTABD  DSECT                     ** SCROLL PFKEY TABLE **                     
SPFTPFK  DS    XL1                 PFKEY NUMBER                                 
SPFTDIR  DS    CL(L'SCRLDIR)       SCROLL DIRECTION                             
SPFTADDR DS    S                   SCOLL SCON                                   
SPFTLCAD DS    S                   SCROLL SCON (LOWER CASE)                     
SPFTABL  EQU   *-SPFTABD                                                        
         SPACE 1                                                                
SCRTABD  DSECT                     ** SCROLL KEYWORD TABLE **                   
SCRTSCR  DS    S                   SCROLL SCON                                  
SCRTAMT  DS    XL(L'SCRLAMT)       SCROLL AMOUNT                                
SCRTDIR  DS    CL(L'SCRLDIR)       SCROLL OVERRIDE DIRECTION                    
         DS    XL1                 N/D (DO NOT REMOVE)                          
SCRTABL  EQU   *-SCRTABD                                                        
         EJECT                                                                  
TYPTABD  DSECT                     ** TYPE TABLE **                             
TYPE     DS    XL1                 INTERNAL TYPE NUMBER                         
TYPINDS  DS    XL1                 TYPE INDICATORS                              
TYPIC2ND EQU   X'80'               CURSOR TO 2ND UNPROT FIELD ON HEADER         
TYPIC3RD EQU   X'40'               CURSOR TO 3RD UNPROT FIELD ON HEADER         
TYPAACT  DS    AL2                 AL2(ACTION TABLE-TABLES)                     
TYPADDRL DS    S                   LONG TYPE SCON                               
TYPADDRS DS    S                   SHORT TYPE SCON                              
TYPTABL  EQU   *-TYPTABD                                                        
*                                  ** TYPE TABLE EQUATES **                     
*                                                                               
TYPINIT  EQU   0                   INITIALISATION                               
TYPWIP   EQU   1                   WORK IN PROGRESS                             
TYPCRD   EQU   2                   CREDITOR                                     
TYPBNK   EQU   3                   BANK                                         
TYPGEN   EQU   4                   GENERAL                                      
TYPMED   EQU   5                   MEDIA                                        
TYPVCA   EQU   6                   VC VENDOR CASHFLOW                           
*                                                                               
TYPADLQ  EQU   L'MRKTYP            LONG TYPE NAME MAX LENGTH                    
TYPADSQ  EQU   3                   SHORT TYPE NAME MAX LENGTH                   
         SPACE 2                                                                
ACTTABD  DSECT                     ** ACTION TABLE **                           
ACTADDRL DS    S                   LONG ACTION SCON                             
ACTADDRS DS    S                   SHORT ACTION SCON                            
ACTION   DS    XL1                 INTERNAL ACTION NUMBER                       
ACTOLAY  DS    XL1                 ACTION OVERLAY NUMBER                        
ACTSCR1  DS    XL1                 ACTION SCREEN 1 - HEADER SCREEN              
ACTSCR2  DS    XL1                 ACTION SCREEN 2 - INPUT SCREEN               
ACTALFA  DS    CL2                 ALPHA CODE FOR PROFILE LOOK-UP               
ACTOPEV  DS    XL3                 ACTION EQUATE FOR OPTION VALIDATION          
ACTSECY  DS    XL1                 TWAAUTH SECURITY BIT MASK                    
ACTINDS  DS    XL1                 ACTION INDICATOR BYTE                        
         DS    XL1                 N/D                                          
ACTYCTR  DS    Y                   Y(VALID COUNTRY TABLE-MARKER) OR 0           
ACTYTOT  DS    Y                   Y(ACTION TOTAL TABLE-MARKER)                 
ACTBTYP  DS    XL1                 ACTION BATCH TYPE OR 0                       
ACTIND2  DS    XL1                 ACTION INDICATOR BYTE TWO                    
         DS    XL6                 N/D                                          
ACTTABL  EQU   *-ACTTABD                                                        
         SPACE 1                                                                
*                                  ** ACTION TABLE EQUATES **                   
ACTADLQ  EQU   L'MRKACT            LONG ACTION NAME MAX LENGTH                  
ACTADSQ  EQU   3                   SHORT ACTION NAME MAX LENGTH                 
*                                  ** ACTION NUMBER EQUATES **                  
ACTINIT  EQU   0                   INITIALISATION                               
ACTHOLD  EQU   1                   HOLD                                         
ACTNUMB  EQU   2                   NUMBER                                       
ACTAUTH  EQU   3                   AUTHORISE                                    
ACTSELC  EQU   4                   SELECT FOR PAYMENT/ APPROVE                  
ACTOFFS  EQU   5                   OFFSET                                       
ACTDISC  EQU   6                   DISCOUNT                                     
ACTCHEQ  EQU   7                   CHEQUE                                       
ACTRECN  EQU   8                   RECONCILE                                    
ACTREVS  EQU   9                   REVERSE                                      
ACTVOID  EQU   10                  VOID                                         
ACTMANU  EQU   11                  MANUAL                                       
ACTBALN  EQU   12                  BALANCE                                      
ACTDRFT  EQU   14                  DRAFT JOURNAL                                
ACTQUIT  EQU   15                  QUIT                                         
ACTUPDT  EQU   16                  UPDATE                                       
ACTCURR  EQU   17                  CURRENCY                                     
ACTZOOM  EQU   18                  ZOOM                                         
* - - - - - - - - - - - - - - - - -                                             
* ACTMTCH  EQU   19                  MATCH                                      
* - - - - - - - - - - - - - - - - -                                             
*                                  ** FIELD EQUATES **                          
FLDNARR  EQU   1                   NARRATIVE FIELD                              
FLDDUEDT EQU   2                   DUE DATE FIELD                               
FLDERPD  EQU   3                   EARLIEST PAYMENT DATE                        
*                                  ** ACTOLAY EQUATES **                        
WHOLAY   EQU   X'01'               WIP HOLD                                     
WNOLAY   EQU   X'02'               WIP NUMBER                                   
WAOLAY   EQU   X'0C'               WIP AUTHORISE                                
WEOLAY   EQU   X'0F'               WIP CONTRA                                   
CAOLAY   EQU   X'03'               CREDITOR AUTHORISE                           
CSOLAY   EQU   X'04'               CREDITOR SELECT FOR PAYMENT                  
COOLAY   EQU   X'05'               CREDITOR OFFSET                              
CDOLAY   EQU   X'06'               CREDITOR DISCOUNT                            
CCOLAY   EQU   X'07'               CREDITOR CHEQUE                              
CHOLAY   EQU   X'08'               CREDITOR HOLD FROM PAYMENT                   
CMOLAY   EQU   X'0D'               CREDITOR MANUAL                              
BROLAY   EQU   X'09'               BANK RECONCILE                               
GROLAY   EQU   X'0A'               GENERAL REVERSE                              
GOOLAY   EQU   COOLAY              GENERAL OFFSET                               
BVOLAY   EQU   X'0B'               BANK VOID                                    
MROLAY   EQU   X'0E'               MEDIA RECONCILE                              
CBOLAY   EQU   X'10'               CREDITOR BALANCE                             
* - - - - - - - - - - - - - - - - -                                             
VTOLAY   EQU   X'12'               VENDOR MATCH FOR PAYMENT                     
* - - - - - - - - - - - - - - - - -                                             
*                                  ** ACTSCR1 EQUATES **                        
WHSCR1   EQU   X'F1'               WIP/HOLD                                     
WNSCR1   EQU   X'F2'               WIP/NUMBER                                   
WASCR1   EQU   WHSCR1              WIP/AUTHORISE                                
WESCR1   EQU   X'DB'               WIP/CONTRA                                   
CASCR1   EQU   X'F3'               CREDITOR/AUTHORISE                           
CSSCR1   EQU   X'F4'               CREDITOR/SELECT FOR PAYMENT                  
COSCR1   EQU   X'F5'               CREDITOR/OFFSET                              
CDSCR1   EQU   X'F6'               CREDITOR/DISCOUNT                            
CCSCR1   EQU   X'F7'               CREDITOR/CHEQUE                              
CHSCR1   EQU   X'F8'               CREDITOR/HOLD FROM PAYMENT                   
BRSCR1   EQU   X'F9'               BANK/RECONCILE                               
GRSCR1   EQU   X'FA'               GENERAL/REVERSE                              
GOSCR1   EQU   X'FB'               GENERAL/OFFSET                               
BVSCR1   EQU   X'FC'               BANK/VOID                                    
CMSCR1   EQU   X'ED'               CREDITOR/MANUAL                              
MRSCR1   EQU   X'EE'               MEDIA/RECONCILE                              
CBSCR1   EQU   X'E5'               CREDITOR/BALANCE                             
*                                  ** ACTSCR2 EQUATES **                        
WHSCR2   EQU   X'E1'               WIP/HOLD                                     
WNSCR2   EQU   X'E2'               WIP/NUMBER                                   
WASCR2   EQU   WHSCR2              WIP/AUTHORISE                                
WESCR2   EQU   WHSCR2              WIP/CONTRA                                   
CASCR2   EQU   X'E3'               CREDITOR/AUTHORISE                           
CSSCR2   EQU   CASCR2              CREDITOR/SELECT FOR PAYMENT                  
COSCR2   EQU   CASCR2              CREDITOR/OFFSET                              
CDSCR2   EQU   CASCR2              CREDITOR/DISCOUNT                            
CCSCR2   EQU   X'E7'               CREDITOR/CHEQUE                              
CHSCR2   EQU   CASCR2              CREDITOR/HOLD FROM PAYMENT                   
BRSCR2   EQU   X'E9'               BANK/RECONCILE                               
GRSCR2   EQU   X'EA'               GENERAL/REVERSE                              
GOSCR2   EQU   CASCR2              GENERAL/OFFSET                               
BVSCR2   EQU   CCSCR2              BANK/VOID                                    
CMSCR2   EQU   CSSCR2              CREDITOR/MANUAL                              
MRSCR2   EQU   CCSCR2              MEDIA/RECONCILE                              
CBSCR2   EQU   CASCR2              CREDITOR/BALANCE                             
*                                  ** OTHER SCREEN EQUATES **                   
MRSCR3   EQU   X'DF'               MEDIA/RECONCILE, VERSCHILLEN                 
MRSCR4   EQU   X'DE'               MEDIA/RECONCILE, WRITE-OFF                   
MRSCR5   EQU   X'DD'               MEDIA/RECONCILE, TRANSFER                    
ZFSCR1   EQU   X'DC'               ZOOM FACILITY                                
CMSCR3   EQU   X'DA'               CREDITOR/MANUAL, PAYMENT W/O INVOICE         
CMSCR4   EQU   X'D9'               CREDITOR/MANUAL, DIFFERENCE                  
GRDSCR   EQU   X'D8'               GRID SCREEN                                  
* - - - - - - - - - - - - - - - - -                                             
VTSCR1   EQU   X'D7'               VENDOR/MATCH                                 
* - - - - - - - - - - - - - - - - -                                             
*                                  ** ACTOPTV EQUATES **                        
WHOPEQ   EQU   X'800000'           WIP/HOLD                                     
WNOPEQ   EQU   X'400000'           WIP/NUMBER                                   
CAOPEQ   EQU   X'200000'           CREDITOR/AUTHORISE                           
CSOPEQ   EQU   X'100000'           CREDITOR/SELECT FOR PAYMENT                  
COOPEQ   EQU   X'080000'           CREDITOR/OFFSET                              
CDOPEQ   EQU   X'040000'           CREDITOR/DISCOUNT                            
CCOPEQ   EQU   X'020000'           CREDITOR/CHEQUE                              
CHOPEQ   EQU   X'010000'           CREDITOR/HOLD FROM PAYMENT                   
BROPEQ   EQU   X'008000'           BANK/RECONCILIATION                          
GROPEQ   EQU   X'004000'           GENERAL/REVERSE                              
GOOPEQ   EQU   X'002000'           GENERAL/OFFSET                               
BVOPEQ   EQU   X'001000'           BANK/VOID                                    
WAOPEQ   EQU   X'000800'           WIP/AUTHORISE                                
CMOPEQ   EQU   X'000400'           CREDITOR/MANUAL                              
MROPEQ   EQU   X'000200'           MEDIA/RECONCILE                              
WEOPEQ   EQU   X'000100'           WIP/CONTRA                                   
CBOPEQ   EQU   X'000080'           CREDITOR/BALANCE                             
* - - - - - - - - - - - - - - - - -                                             
VTOPEQ   EQU   X'000040'           VENDOR/MATCH                                 
* - - - - - - - - - - - - - - - - -                                             
*                                  ** ACTSECY BIT MASK EQUATES **               
SECWIPSQ EQU   X'80'               WIP ACTIONS                                  
SECCRAUQ EQU   X'40'               CREDITOR/AUTHORISE                           
SECSODCQ EQU   X'20'               CRED. SELECT/OFFSET/DISC/CHEQUE/MANU         
SECCRHOQ EQU   X'10'               CREDITOR/HOLD                                
SECBRECQ EQU   X'08'               BANK/RECONCILE                               
SECGREVQ EQU   X'04'               GENERAL/REVERSE                              
SECGOFFQ EQU   X'02'               GENERAL/OFFSET                               
SECBVOIQ EQU   X'01'               BANK/VOID                                    
SECWIAUQ EQU   SECCRAUQ            WIP/AUTHORISE                                
SECMRECQ EQU   SECSODCQ            MEDIA/RECONCILE                              
*                                  ** ACTINDS/APFTACTI EQUATES **               
ACTIXSET EQU   X'80'               INTERIM ACTION                               
ACTICFRM EQU   X'40'               INTERIM ACTION REQUIRES CONFIRMATION         
ACTIDDSQ EQU   X'20'               DDS ONLY ACTION                              
ACTIPRVL EQU   X'10'               CALL OVERLAY TO PRE-VALIDATE HEADER          
ACTICHUP EQU   X'08'               CALL OVERLAY TO CHECK UPDATE IS OK           
ACTIPOST EQU   X'04'               ACTION MAKES POSTINGS                        
*                                  ** ACTIND2 EQUATES **                        
ACTI2ZOO EQU   X'80'               ACTION SUPPORTS ZOOM PROCESSING              
ACTI2GRD EQU   X'40'               ACTION SUPPORTS GRID PROCESSING              
ACTI2GRO EQU   X'20'+ACTI2GRD      ACTION SUPPORTS GRID PROCESSING ONLY         
         EJECT                                                                  
KEYTABD  DSECT                     ** KEY ELEMENT TABLE **                      
KEYMASK  DS    XL1                 BIT MASK                                     
KEYLEN   DS    AL1                 L'KEY ELEMENT                                
KEYTABL  EQU   *-KEYTABD                                                        
         SPACE 2                                                                
PROFKEYD DSECT                     ** PROFILE KEY FOR GETPROF **                
PROFKEY  DS    0CL16                                                            
PROFKSYS DS    CL1                 SYSTEM                                       
PROFKPGM DS    CL3                 PROGRAM                                      
         ORG   PROFKPGM                                                         
PROFKXAC DS    CL(L'XACTALFA)      TYPE/ACTION                                  
PROFKPAG DS    CL1                 PAGE                                         
         DS    CL1                                                              
PROFKULA DS    0CL5                UNIT/LEDGER/ACCOUNT                          
PROFKUNL DS    CL2                 UNIT/LEDGER                                  
PROFKACC DS    CL3                 ACCOUNT                                      
PROFKIND DS    CL1                 OFFICE INDICATOR                             
PROFKOLD EQU   C'*'                C'*' INDICATES 1 CHARACTER OFFICE            
PROFKNEW EQU   C'+'                C'+' INDICATES 2 CHARACTER OFFICE            
PROFKOFF DS    CL1                 OFFICE CODE                                  
PROFKAGY DS    CL2                 AGENCY ALPHA-ID                              
PROFKOF2 DS    CL2                 2 CHARACTER OFFICE CODE                      
         SPACE 2                                                                
PROFDFTD DSECT                     ** DEFAULT PROFILES TABLE **                 
PROFALFA DS    CL(L'XACTALFA)                                                   
PROFDFKS DS    XL(L'PROFSEQ)       KEY SORT FIELDS                              
PROFDFDS DS    XL(L'PROFDIS)       DISPLAY FIELDS                               
PROFDFTL EQU   *-PROFDFTD                                                       
         SPACE 2                                                                
OPTTABD  DSECT                     ** OPTION KEYWORD TABLE **                   
OPTOPT   DS    S                   LONG OPTION SCON                             
OPTLONG  EQU   8                   LONG KEYWORD MAX                             
OPTOPSH  DS    S                   SHORT OPTION SCON                            
OPTSHRT  EQU   3                   SHORT KEYWORD MAX                            
OPTADDR  DS    S                   A(FIELD DISP) OR ROUTINE SCON                
OPTIND   DS    XL1                                                              
OPTI1PT  EQU   X'01'               OPTION VALUE FIXED                           
OPTI2PT  EQU   X'02'               OPTION HAS FILTER VALUE ON RIGHT             
OPTINOT  EQU   X'04'               OPTION CAN BE PRECEDED WITH NOT              
OPTIDDS  EQU   X'08'               OPTION IS DDS-ONLY                           
OPTIGRD  EQU   X'10'               OPTION IS NOT VALID WITH GRIDS               
OPTRMAX  DS    XL1                 MAX LENGTH OF RHS, IF TWO-PART               
OPTVACM  DS    XL3                 MASK - OPTION/ACTION VALIDITY                
         DS    XL1                 N/D                                          
OPTTABL  EQU   *-OPTTABD                                                        
         SPACE 1                                                                
SCANOUTD DSECT                     ** SCANNER BLOCK ENTRY **                    
SCANLEN1 DS    XL1                 L'FIELD (1ST PART IF 2-PART)                 
SCANLEN2 DS    XL1                 L'2ND PART OF 2-PART OPTION                  
SCANIND1 DS    XL1                 VALIDITY BITS 1ST PART                       
SCANIND2 DS    XL1                 VALIDITY BITS 2ND PART                       
SCANBIN1 DS    CL4                 BINARY VALUE OF NUMERIC 1ST PART             
SCANBIN2 DS    CL4                 BINARY VALUE OF NUMERIC 2ND PART             
SCANTXT1 DS    CL10                1ST PART TEXT/DATA                           
SCANTXT2 DS    CL41                2ND PART TEXT/DATA                           
SCANOUTL EQU   *-SCANOUTD          SCANNER ENTRY LENGTH                         
SCANMAXN EQU   12                  MAXIMUM N'SCANNER LINES                      
SCANLTAB EQU   (SCANOUTL*SCANMAXN)                                              
         SPACE 2                                                                
DISTABD  DSECT                     ** DISPLAY ELEMENT TABLE **                  
DISCOL   DS    XL1                 COLUMN NUMBER                                
DISLN    DS    XL1                 LENGTH OF TABLE ENTRY FOR THIS COL           
DISLEN   DS    AL1                 L'DISPLAY ELEMENT                            
DISLEN2  DS    AL1                 L'DISPLAY ELEMENT 2ND LINE                   
DISADDR  DS    S                   DISPLAY ELEMENT SCON                         
DISADD2  DS    S                   DISPLAY ELEMENT SCON 2ND LINE                
DISDDATA DS    S                   DISPLAY DATA TSAR SCON                       
DISDLEN  DS    AL1                 DISPLAY DATA LENGTH                          
DISDFORM EQU   DISDLEN             DATE FORMAT FOR DATE COLUMNS                 
DISDFRM1 EQU   1                   DATE FORMAT IS PWOS                          
DISDFRM2 EQU   2                   DATE FORMAT IS COMPRESSED                    
DISELEQ  DS    AL1                 ELEMENT CODE FOR                             
DISEDISP DS    AL1                 DISPLACEMENT TO DATA ON ELEMENT              
DISNTYPE EQU   DISEDISP            NUMERICAL TYPE                               
DISNPCKD EQU   C'P'                PACKED                                       
DISNBINY EQU   C'B'                BINARY                                       
DISISTAT EQU   DISEDISP            STATUS BIT WE NEED TO CHECK AGAINST          
*                                  IF DATA IS AN INDICATOR BYTE                 
DISELEN  DS    XL1                 LENTGH OF STANDARD ELEMENT                   
DISETYPE DS    AL1                 ELEMENT TYPE                                 
         DS    XL1                 SPARE                                        
DISCIND  DS    XL1                 COLUMN INDICATOR                             
DISCIPCQ EQU   X'80'               COLUMN IS USUALLY PRIMARY CURRENCY           
DISCIFCQ EQU   X'40'               COLUMN MAY BE FOREIGN CURRENCY               
DISCI2CQ EQU   X'20'               COLUMN IS SECONDARY CURRENCY                 
DISCIGER EQU   X'10'               COLUMN IS FOR GERMANY ONLY                   
DISCIUK  EQU   X'08'               COLUMN IS FOR UK ONLY                        
DISCIXLG EQU   X'04'               COLUMN EXCLUDES LEDGERS IN LIST              
DISCIGRD EQU   X'02'               COLUMN IS NOT ALLOWED FOR GRIDS              
DISCIOGR EQU   X'01'               COLUMN IS GRID ONLY                          
DISVACM  DS    XL3                 MASK - DISP OPTION/ACTION VALIDITY           
DISALLQ  EQU   X'FFFFFF'           OPTION VALID WITH ALL ACTIONS                
DISALWQ  EQU   WHOPEQ+WNOPEQ+WAOPEQ+WEOPEQ ALL WIP ACTIONS                      
DISALCQ  EQU   CAOPEQ+CSOPEQ+COOPEQ+CDOPEQ+CCOPEQ+CHOPEQ+CMOPEQ+CBOPEQ          
DISALBQ  EQU   BROPEQ+BVOPEQ       OPTION VALID WITH ALL BANK ACTIONS           
DISALGQ  EQU   GROPEQ+GOOPEQ       OPTION VALID WITH ALL GEN ACTIONS            
DISALMQ  EQU   MROPEQ              OPTION VALID WITH ALL MEDIA ACTIONS          
DISPPCQ  EQU   CAOPEQ+CSOPEQ+CDOPEQ+CHOPEQ  PRE-PAYMENT CRD ACTIONS             
DISAAPQ  EQU   VTOPEQ              OPTION VALID WITH AUTO APPROVE               
DISSECU  DS    XL1                 SECURITY BIT FOR EDITABLE FIELD              
DISRELA  DS    XL1                 RELATIONSHIP NUMBER - COLUMNS LINKED         
DISCINF  DS    0XL3                                                             
DISCIND2 DS    XL1                 COLUMN INDICATOR 2                           
DISI2DTE EQU   X'80'               DATE                                         
DISI2NUM EQU   X'40'               NUMERIC                                      
DISI2EDT EQU   X'20'               EDITABLE                                     
DISI2REL EQU   X'10'               HAS RELATIONSHIP WITH OTHER COLUMN           
DISI2CKB EQU   X'08'               CHECK BOX COLUMN                             
DISI2REN EQU   X'04'               RENAME                                       
DISI2NTO EQU   X'02'               NO TOTAL                                     
DISI2RGH EQU   X'01'               RIGHT JUSTIFIED                              
DISCIND3 DS    XL1                 COLUMN INDICATOR 3                           
DISI3TRE EQU   X'80'               TREE VIEW COLUMN                             
DISI3MUL EQU   X'40'               ELEMENT CAN APPEAR SEVERAL TIMES             
DISI3MOS EQU   X'20'               DATE IS JUST MONTH AND YEAR                  
DISI3DAY EQU   X'10'               DAY MAY BE MISSING FROM DATE                 
DISI3DR  EQU   X'08'               DATA IS ONLY FOR DR TRANS                    
DISI3CR  EQU   X'04'               DATA IS ONLY FOR CR TRANS                    
DISI3EDR EQU   X'02'               EDIT EXCHANGE RATE                           
DISI3SEC EQU   X'01'               SECOND CURRENCY VALUE FROM CALC              
DISCIND4 DS    XL1                 COLUMN INDICATOR 4                           
DISI4VAR EQU   X'80'               VARAIBLE DATA LENGTH ON ELEMENT              
DISI4STA EQU   X'40'               DATA IS STATUS BIT BASED                     
DISI4HDE EQU   X'20'               HIDE COLUMN                                  
DISI4ID  EQU   X'10'               ID COLUMN                                    
DISI4MST EQU   X'08'               MASTER COLUMN IN RELATIONSHIP                
DISOTSAR DS    XL1                 OR CHARACTERS WITH TSARIND3                  
DISTABL  EQU   *-DISTABD                                                        
DISLDG   DS    0CL2                LEDGER LIST                                  
         EJECT                                                                  
*        SPACE 2                                                                
*ISTABD  DSECT                     ** DISPLAY ELEMENT TABLE **                  
*ISCOL   DS    XL1                 COLUMN NUMBER                                
*ISCIND  DS    XL1                 COLUMN INDICATOR                             
*ISCIPCQ EQU   X'80'               COLUMN IS USUALLY PRIMARY CURRENCY           
*ISCIFCQ EQU   X'40'               COLUMN MAY BE FOREIGN CURRENCY               
*ISCI2CQ EQU   X'20'               COLUMN IS SECONDARY CURRENCY                 
*ISLEN   DS    AL1                 L'DISPLAY ELEMENT                            
*ISLEN2  DS    AL1                 L'DISPLAY ELEMENT 2ND LINE                   
*ISADDR  DS    S                   DISPLAY ELEMENT SCON                         
*ISADD2  DS    S                   DISPLAY ELEMENT SCON 2ND LINE                
*ISVACM  DS    XL3                 MASK - DISP OPTION/ACTION VALIDITY           
*ISALLQ  EQU   X'FFFFFF'           OPTION VALID WITH ALL ACTIONS                
*ISALWQ  EQU   WHOPEQ+WNOPEQ+WAOPEQ+WEOPEQ ALL WIP ACTIONS                      
*ISALCQ  EQU   CAOPEQ+CSOPEQ+COOPEQ+CDOPEQ+CCOPEQ+CHOPEQ+CMOPEQ ALL CRD         
*ISALBQ  EQU   BROPEQ+BVOPEQ       OPTION VALID WITH ALL BANK ACTIONS           
*ISALGQ  EQU   GROPEQ+GOOPEQ       OPTION VALID WITH ALL GEN ACTIONS            
*ISALMQ  EQU   MROPEQ              OPTION VALID WITH ALL MEDIA ACTIONS          
*ISPPCQ  EQU   CAOPEQ+CSOPEQ+CDOPEQ+CHOPEQ  PRE-PAYMENT CRD ACTIONS             
*ISBKRC  EQU   BROPEQ              OPTION VALID WITH BANK REC                   
*        DS    XL1                 N/D                                          
*ISTABL  EQU   *-DISTABD                                                        
         EJECT                                                                  
LEDGTABD DSECT                     ** LEDGER TABLE **                           
LEDGTUL  DS    CL2                 UNIT/LEDGER CODE                             
LEDGTTYP DS    0CL(L'LDGTYPE)      LEDGER TYPE                                  
LEDGTST2 DS    XL(L'LDGSTAT2)      LEDGER STATUS BYTE 2                         
LEDGTLIK DS    CL(L'LDGLIKE)       LEDGER IS LIKE                               
LEDGTOFF DS    XL(L'LDGOPOS)       OFFICE POSITION                              
LEDGTCLO DS    XL(L'LDGCLOS)       LEDGER CLOSE-OUT TYPE                        
LEDGTLVA DS    XL(L'ACLVLEN)       LEVEL A LENGTH                               
LEDGTLVB DS    XL(L'ACLVLEN)       LEVEL B LENGTH                               
LEDGTLVC DS    XL(L'ACLVLEN)       LEVEL C LENGTH                               
LEDGTLVD DS    XL(L'ACLVLEN)       LEVEL D LENGTH                               
LEDGTSEC DS    XL1                 SECURITY NUMBER                              
LEDGCDSC DS    XL(L'ACTKULA)       CASH DISCOUNT ACCOUNT                        
LEDGDTAX DS    XL(L'ACTKULA)       DISCOUNT TAX ADJUSTMENT ACCOUNT              
LEDGEXDF DS    XL(L'ACTKULA)       EXCHANGE DIFFERENE ACCOUNT                   
         DS    XL(L'ACTKULA)       N/D                                          
         DS    XL1                 N/D                                          
LEDGTABL EQU   *-LEDGTABD                                                       
LEDGMAXN EQU   16                  MAXIMUM NUMER OF TABLE ENTRIES               
LEDGLTAB EQU   (LEDGTABL*LEDGMAXN)                                              
         SPACE 1                                                                
DISLINED DSECT                     ** DISPLAY LINE **                           
DISLHDR1 DS    XL(L'FVIHDR)        DESCRIPTION HEADER                           
DISLLINE DS    CL75                LINE DESCRIPTION (DYNAMIC)                   
DISLHDR2 DS    XL(L'FVIHDR)        MARK HEADER                                  
DISLMARK DS    CL1                 MARK FIELD                                   
DISLINEL EQU   *-DISLINED                                                       
         ORG   DISLHDR1                                                         
D2SLINED DS    0C                  ** DISPLAY LINE **                           
D2SLHDR1 DS    XL(L'FVIHDR)        DESCRIPTION HEADER                           
D2SLLINE DS    CL66                LINE DESCRIPTION (DYNAMIC)                   
D2SLHDR2 DS    XL(L'FVIHDR)        MARK HEADER                                  
D2SLMARK DS    CL1                 MARK FIELD (RECONCILED)                      
         DS    CL1                 SPACE                                        
D2SLDATE DS    CL8                 RECONCILED DATE                              
D2SLINEL EQU   *-D2SLINED                                                       
         SPACE 1                                                                
TOTLINED DSECT                     ** TOTALS LINE **                            
         DS    XL(L'FVIHDR)        TOTALS HEADER                                
         DS    CL78                TOTALS (DYNAMIC)                             
TOTLINEL EQU   *-TOTLINED                                                       
         SPACE 1                                                                
TOTTABD  DSECT                     ** TOTALS TABLE **                           
TOTDISP  DS    0XL2                DISPLACEMENTS                                
TOTSDIS  DS    XL1                 SCREEN LINE DISPLACEMENT                     
TOTSALT  EQU   X'80'               DISPLAY ONLY IF SAFCIALT ON                  
TOTPDIS  DS    XL1                 PRINT LINE DISPLACEMENT                      
TOTSTXT  DS    S                   S(TOTAL TEXT)                                
TOTAMTL  EQU   13                  L'TOTAL                                      
TOTTXTL  EQU   13                  L'TOTAL TEXT                                 
TOTTABL  EQU   *-TOTTABD                                                        
         SPACE 1                                                                
IOCNTLD  DSECT                     ** I/O CONTROL BLOCK **                      
ACCFIL   DS    CL8                 DATAMGR LITERALS                             
ACCDIR   DS    CL8                                                              
ACCMST   DS    CL8                                                              
ACCARC   DS    CL8                                                              
TEMPSTR  DS    CL8                                                              
*                                                                               
IOCIS    DS    0X                  INDEX SEQUENTIAL COMMANDS                    
DMRDHI   DS    CL7,CL7,AL1,AL1                                                  
DMREAD   DS    CL7,CL7,AL1,AL1                                                  
DMRSEQ   DS    CL7,CL7,AL1,AL1                                                  
DMADD    DS    CL7,CL7,AL1,AL1                                                  
DMWRT    DS    CL7,CL7,AL1,AL1                                                  
*                                                                               
IOCDA    DS    0X                  DIRECT ACCESS COMMANDS                       
GETREC   DS    CL7,CL7,AL1,AL1                                                  
PUTREC   DS    CL7,CL7,AL1,AL1                                                  
ADDREC   DS    CL7,CL7,AL1,AL1                                                  
ADFREC   DS    CL7,CL7,AL1,AL1                                                  
         EJECT                                                                  
       ++INCLUDE FATWA                                                          
         ORG   TWAUSER                                                          
TWAFULL  DS    F                   FULL WORD                                    
TWAHALF  DS    H                   HALF WORD                                    
TWAMODE  DS    XL1                 CONTROL MODE INDICATOR - BYTE ONE            
TWAMFRST EQU   X'00'               FIRST TIME                                   
TWAMINIT EQU   X'01'               INITIALISED                                  
TWAMDRFT EQU   X'02'               DRAFT UPDATE (ONLINE JOURNAL)                
TWAMALTP EQU   X'04'               DISPLAY ALTERNATE PF KEYS                    
TWAMHDRS EQU   X'08'               VALID BATCH HEADER SAVED                     
TWAMSETP EQU   X'10'               SET DEFAULT PF KEY ON EXIT                   
TWAMCFRM EQU   X'20'               CONFIRMATION OVERLAY LOADED                  
TWAMDOIT EQU   X'40'               ACTION CONFIRMED BY USER                     
TWAMRSRV EQU   X'80'               TEMPEST RESERVE ISSUED                       
*                                                                               
TWAMODE2 DS    XL1                 CONTROL MODE INDICATOR - BYTE TWO            
TWAM2HED EQU   X'01'               HEADER SCREEN LOADED                         
TWAM2CHG EQU   X'02'               USER HAS MADE CHANGES                        
TWAM2DIS EQU   X'04'               DISPLAY ONLY                                 
TWAM2NXA EQU   X'08'               NEXT ACCOUNT MODE, AFTER QUIT/UPDATE         
TWAM2SKP EQU   X'10'               SKIP VALINP IF OPTALL/OPTPAG IN USE          
TWAM2INV EQU   X'20'               USER IS SELECTING INVOICES                   
TWAM2MUL EQU   X'40'               MULTIPLE MPYEL INVOICE ON DISPLAY            
TWAM2NUQ EQU   X'80'               IGNORE UPDATE/QUIT                           
*                                                                               
TWAMODE3 DS    XL1                 CONTROL MODE INDICATOR - BYTE THREE          
TWAM3ZOO EQU   X'01'               ZOOM SCREEN PROCESSING                       
TWAM3UWD EQU   X'02'               UNWIND TRANSACTION POSTINGS - ERROR          
TWAM3ASC EQU   X'04'               APPLICATION SCREEN PROCESSING                
TWAM3WRN EQU   X'08'               WARNING MESSAGE FOR CURRENCY                 
TWAM3CFM EQU   X'10'               CONFIRMATION HAS BEEN PROCESSED ONCE         
TWAM3UPD EQU   X'20'               UPDATE FINISHED FOR GRIDS                    
TWAM3INT EQU   X'40'               HAS WE INITALISED THE UPDATE - GRIDS         
TWAM3WRM EQU   X'80'               WARNING MESSAGE FOR MOA CHECKING             
*                                                                               
TWASTYAC DS    0XL2                SAVED 'REAL' TYPE/ACTION                     
TWASTYP  DS    XL1                                                              
TWASACT  DS    XL1                                                              
*                                                                               
TWASCROV DS    XL1                 SCREEN NUMBER                                
TWASCRTP EQU   X'FE'               TOTALS/PFK OVERLAY SCREEN                    
TWASCRCA EQU   X'FD'               CONFIRMATION OVERLAY SCREEN                  
*                                                                               
         DS    XL10                                                             
TWATSARI DS    XL1                 SAVED TSAR INDICATORS                        
TWALOWPG DS    XL1                 SAVED TSPAGL VALUE                           
TWANUMPG DS    XL1                 SAVED TSPAGN VALUE                           
TWAOFFSV DS    XL(OFFASAVL)        SAVED OFFAL VALUES                           
TWACOLS  EQU   80                  TWA COLUMNS                                  
TWAROWS  EQU   24                  TWA ROWS                                     
TWAPFK   DS    XL1                 TEMPORARY PF KEY ACTION (CC)                 
TWASKEY  DS    XL(L'ACTKCULA-1)    SAVED ACCOUNT FROM HEADER SCREEN             
         ORG   TWAD+64                                                          
       ++INCLUDE ACMRKFFD                                                       
         ORG   MRKOLAYH                                                         
       ++INCLUDE ACMRKDCD          ZOOM FACILITY SCREEN DSECT                   
         ORG   MRKOLAYH                                                         
       ++INCLUDE ACMRKD8D          GRID SCREEN DSECT                            
TWAMAXL  EQU   1024*17             17K OF TWA0 AVAILABLE (1K RESERVED)          
SAVEAREL EQU   1024*11             11K SAVED STORAGE AREA                       
SAVESCRL EQU   1024*3              3K SAVED SCREEN AREA                         
         ORG   TWAD+(TWAMAXL-SAVEAREL-SAVESCRL)                                 
SAVHEADL EQU   *-MRKOLAYH          SAVE HEADER FROM MRKOLAYH-*                  
TWASAVAR DS    0X                  SAVE AREA WITH TWAD ADDRESSIBILITY           
KEYDISP  DS    0X                  ** KEY ELEMENT DISPLACEMENTS **              
KEYOFFD  DS    XL1                 OFFICE                                       
         ORG   KEYOFFD                                                          
KEYWRKD  DS    XL1                 WORKCODE IN SJ                               
KEYCOND  DS    XL1                 CULCONTRA                                    
KEYDATD  DS    XL1                 DATE                                         
KEYREFD  DS    XL1                 REFERENCE                                    
KEYSBRD  DS    XL1                 SUB-REFERENCE                                
KEYMOSD  DS    XL1                 MONTH OF SERVICE                             
KEYBATD  DS    XL1                 BATCH REFERENCE                              
KEYVARD  DS    XL1                 VARIABLE BYTE (EG. STATUS)                   
KEYDISPL EQU   *-KEYDISP                                                        
*                                                                               
DISDISP  DS    0X            COL   ** DISPLAY ELEMENT DISPLACEMENTS **          
DISOFFD  DS    XL1           1     OFFICE                                       
DISWRKD  DS    XL1           2     WORKCODE IN SJ                               
DISCOND  DS    XL1           3     U/L/CONTRA                                   
DISDATD  DS    XL1           4     DATE                                         
DISREFD  DS    XL1           5     REFERENCE                                    
DISMOSD  DS    XL1           6     MONTH OF SERVICE                             
DISBATD  DS    XL1           7     BATCH REFERENCE                              
DISAMTD  DS    XL1           8     AMOUNT                                       
DISDRSD  DS    XL1           9     DEBIT                                        
DISCRSD  DS    XL1           10    CREDIT                                       
DISSUPD  DS    XL1           11    SUPPLIER                                     
DISJOBD  DS    XL1           12    JOB                                          
DISSRCD  DS    XL1           13    SOURCE ACCOUNT                               
DISCHQD  DS    XL1           14    CHEQUE NUMBER                                
DISTYPD  DS    XL1           15    TYPE (DEBIT/CREDIT)                          
DISFWKD  DS    XL1           16    FREEFORM WORKCODE IN CPJEL (CA)              
DISFOTD  DS    XL1           17    FREEFORM NUMBER IN OTHEL (CA)                
DISNUMD  DS    XL1           18    TSAR RECORD NUMBER                           
DISDSCD  DS    XL1           19    DISCOUNT AMOUNT (CD,BV)                      
DISOMOD  DS    XL1           20    OFFSET MOS (CO,GO)                           
DISSTAD  DS    XL1           21    STATUS                                       
DISADAD  DS    XL1           22    ACTIVITY DATE                                
DISBTYD  DS    XL1           23    BATCH TYPE                                   
DISRMOD  DS    XL1           24    REVERSED MOS                                 
DISDUED  DS    XL1           25    PAYMENT DUE DATE (CA,CS,CD,CH)               
DISXSTD  DS    XL1           26    EXTRA STATUS DETAIL                          
DISUSED  DS    XL1           27    USED DATE                                    
*&&UK                                                                           
DISPRFD  DS    XL1           28    PAYMENT REFERENCE (BV)                       
*&&                                                                             
*&&US                                                                           
DISINVD  DS    XL1           28    MEDIA/LONG INVOICE NUMBER                    
*&&                                                                             
DISBSDD  DS    XL1           29    BANK STATEMENT DATE (BR)                     
*&&UK                                                                           
DISNARD  DS    XL1           30    TRANSACTION NARRATIVE                        
DISSERD  DS    XL1           31    BUY SERIAL NUMBER (MR)                       
DISUNPD  DS    XL1           32    UNIT PRICE (MR)                              
DISIDTD  DS    XL1           33    INSERTION DATE (MR)                          
DISSDCD  DS    XL1           34    SUNDRY CREDITOR NAME                         
DISAFCD  DS    XL1           35    ACCOUNT FOREIGN CURRENCY DATA                
DISEXDD  DS    XL1           36    EXCHANGE DIFFERENCE                          
DISRATD  DS    XL1           37    EXCHANGE RATE                                
*&&                                                                             
*&&US                                                                           
DISTAXD  DS    XL1           30    TAX/BASIS                                    
DISMMDD  DS    XL1           31    MEDIA MONTH/DATE                             
DISNARD  DS    XL1           32    NARRATIVE                                    
DISRCDT  DS    XL1           33    BANK RECONCILED DATE                         
DISCLDT  DS    XL1           34    BANK CLEARED DATE                            
         DS    XL3           35-37 N/D                                          
*&&                                                                             
DISSNMD  DS    XL1           38    SOURCE NAME                                  
DISADVD  DS    XL1           39    ADVANCE PORTION OF CHEQUE                    
DISDIFD  DS    XL1           40    DIFFERENCE PORTION OF CHEQUE                 
*&&UK                                                                           
DISSCC   DS    0X                  SECOND CURRENCY COLUMNS                      
DISSAMD  DS    XL1           41    AMOUNT - SECOND CURRENCY                     
DISSDRD  DS    XL1           42    DEBIT AMOUNT - SECOND CURRENCY               
DISSCRD  DS    XL1           43    CREDIT AMOUNT - SECOND CURRENCY              
DISSDSD  DS    XL1           44    DISCOUNT - SECOND CURRENCY                   
DISSDID  DS    XL1           45    DIFFERENCE PORTION - SECOND CURRENCY         
DISSADD  DS    XL1           46    ADVANCE PORTION - SECOND CURRENCY            
DISSCCN  EQU   *-DISSCC                                                         
*&&                                                                             
*&&US*&& DS    XL7           41-47 N/D                                          
DISHSTD  DS    XL1           48    TRANSACTION STATUS IN HEX                    
DISSEQD  DS    XL1           49    SYSTEM SEQUENCE NO. (TRNKSBR/TRNSUB)         
DISDADD  DS    XL1           50    TRANSACTION DISK ADDRESS                     
*&&US*&& DS    XL7                                                              
DISOFFST DS    XL1           58    OFFSET                                       
DISSYSD  DS    XL1           59    SYSTEM                                       
DISMEDD  DS    XL1           60    MEDIA                                        
DISCLID  DS    XL1           61    CLIENT                                       
DISPROD  DS    XL1           62    PRODUCT                                      
DISESTD  DS    XL1           63    ESTIMATE                                     
DISMMOSD DS    XL1           64    MEDIA MOS                                    
DISVEND  DS    XL1           65    VENDOR                                       
DISVIND  DS    XL1           66    VENDOR INVOICE                               
         DS    XL7           67-73                                              
DISDISPL EQU   *-DISDISP                                                        
*                                                                               
REPDISP  DS    XL(DISDISPL)        REPORT ELEMENT DISPS - SEE DISDISP           
*                                                                               
BANKXTRA DS    0X                                                               
BANKACC  DS    XL(L'ACTKCULA)      BANK C/U/L/ACCOUNT                           
CDSCACC  DS    XL(L'ACTKCULA)      CASH DISCOUNT C/U/L/ACCOUNT                  
DTAXACC  DS    XL(L'ACTKCULA)      TAX DISCOUNT C/U/L/ACCOUNT                   
EXDFACC  DS    XL(L'ACTKCULA)      EXCHANGE DIFFERENCE C/U/L/ACCOUNT            
BCHAACC  DS    XL(L'ACTKCULA)      BANK CHARGE C/U/L/ACCOUNT                    
BCHAAMT  DS    PL6                 BANK CHARGE AMOUNT                           
BCHAAM2  DS    PL6                 BANK CHARGE AMOUNT (CURRENCY)                
BNKASTS1 DS    XL1                 BANK ACCOUNT ASTSTAT1                        
BANKXTRL EQU   *-BANKXTRA                                                       
*                                                                               
OPTIONS  DS    0X                  USER TSAR RECORD FILTERS                     
*                                                                               
OPTDATR  DS    0XL(L'OPTSDT+L'OPTEDT)                                           
OPTSDT   DS    XL(L'TRNKDATE)      START TRANSACTION DATE                       
OPTEDT   DS    XL(L'TRNKDATE)      END TRANSACTION DATE                         
*                                                                               
OPTADAR  DS    0XL(L'OPTADS+L'OPTADE)                                           
OPTADS   DS    XL(L'TRSDATE)       START DATE ADDED                             
OPTADE   DS    XL(L'TRSDATE)       END DATE ADDED                               
*                                                                               
OPTMOSR  DS    0PL(L'OPTSMO+L'OPTEMO)                                           
OPTSMO   DS    PL(L'TRNKSMOS)      START MOS                                    
OPTEMO   DS    PL(L'TRNKSMOS)      END MOS                                      
*                                                                               
OPTBSDR  DS    0XL(L'OPTSBS+L'OPTEBS)                                           
OPTSBS   DS    XL(L'TRSBSTDT)      START BANK STATEMENT DATE                    
OPTEBS   DS    XL(L'TRSBSTDT)      END BANK STATEMENT DATE                      
*                                                                               
OPTCON   DS    XL(L'TRNKCULC-1)    CONTRA ACCOUNT                               
OPTCONXL DS    XL1                                                              
OPTCONI  DS    XL1                 INDICATOR                                    
*                                                                               
OPTSRC   DS    XL(L'TSARFSAC)      SOURCE ACCOUNT                               
OPTSRCXL DS    XL1                                                              
OPTSRCI  DS    XL1                 INDICATOR                                    
*                                                                               
OPTREFR  DS    0CL(L'OPTSRF+L'OPTERF)                                           
OPTSRF   DS    CL6                 START REFERENCE (ABSOLUTE IF NO END)         
OPTERF   DS    CL6                 END REFERENCE                                
OPTSRFXL DS    XL1                                                              
OPTERFXL DS    XL1                                                              
                                                                                
*&&US                                                                           
OPTINVR  DS    0CL(L'OPTSINV+L'OPTEINV)                                         
OPTSINV  DS    CL(L'TSARFINV)      START INVOICE (ABSOLUTE IF NO END)           
OPTEINV  DS    CL(L'TSARFINV)      END INVOICE#                                 
OPTSINXL DS    XL1                                                              
OPTEINXL DS    XL1                                                              
                                                                                
OPTPUB   DS    XL11                PUBLICATION AS INPUT OR FROM PUBVAL          
OPTPUBXL DS    XL1                                                              
OPTMMDR  DS    0XL(L'OPTSMM+L'OPTEMM)                                           
OPTSMM   DS    XL(L'TRNDATE)       START MEDIA MONTH/DATE                       
OPTEMM   DS    XL(L'TRNDATE)       END MEDIA MONTH/DATE                         
*&&                                                                             
OPTSUBR  DS    0CL(L'OPTSSR+L'OPTESR)  NB. SUBREFERENCE = OTHNUM                
OPTSSR   DS    CL9                 START SUBREF  (ABSOLUTE IF NO END)           
OPTESR   DS    CL9                 END SUBREF                                   
OPTSSRXL DS    XL1                                                              
OPTESRXL DS    XL1                                                              
*                                                                               
OPTFXRR  DS    0CL(L'OPTSFR+L'OPTEFR)                                           
OPTSFR   DS    CL6                 START FIXED# (ABSOLUTE IF NO END)            
OPTEFR   DS    CL6                 END FIXED#                                   
OPTSFRXL DS    XL1                                                              
OPTEFRXL DS    XL1                                                              
*                                                                               
OPTAMT   DS    PL6                 AMOUNT                                       
*&&UK                                                                           
OPTAMTC  DS    CL(L'CURTCUR)       AMOUNT'S CURRENCY CODE                       
*&&                                                                             
OPTAMTM  DS    XL1                                                              
*                                                                               
OPTOFF   DS    XL(L'TRNKOFF)       OFFICE                                       
OPTOFFI  DS    XL1                 INDICATOR                                    
*                                                                               
OPTWRK   DS    XL(L'TRNKWORK)      WORKCODE                                     
OPTWRKI  DS    XL1                 INDICATOR                                    
*                                                                               
OPTCPJ   DS    CL(L'ACTKCULA-1)    SOURCE CLIENT/PRODUCT/JOB                    
OPTCPJXL DS    XL1                 EXECUTE L'CLIENT/PRODUCT/JOB                 
OPTCPJI  DS    XL1                 INDICATOR                                    
*                                                                               
OPTBAT   DS    XL1                 BATCH TYPE                                   
OPTBATI  DS    XL1                 INDICATOR                                    
*                                                                               
OPTMRK   DS    XL1                 MARKED/UNMARKED                              
OPTAUT   DS    XL1                 AUTHORISED                                   
OPTHLD   DS    XL1                 HELD                                         
OPTSEL   DS    XL1                 SELECTED                                     
OPTCHG   DS    XL1                 CHANGED                                      
OPTCTD   DS    XL1                 CONTRA'D                                     
OPTMAT   DS    XL1                 MATCHED                                      
OPTREC   DS    XL1                 RECONCILED                                   
OPTREV   DS    XL1                 REVERSED                                     
OPTPND   DS    XL1                 PENDING REVERSE/UNREVERSE                    
OPTDSC   DS    XL1                 DISCOUNT                                     
OPTVOI   DS    XL1                 VOID                                         
OPTCMM   DS    XL1                 COMMISSIONABLE                               
OPTURG   DS    XL1                 URGENT                                       
OPTALC   DS    XL1                 ALLOCATED (RECEIVABLE)                       
*                                                                               
OPTDUER  DS    0XL(L'OPTSDU+L'OPTEDU)                                           
OPTSDU   DS    XL(L'DUEDATE)       START DUE DATE                               
OPTEDU   DS    XL(L'DUEDATE)       END DUE DATE                                 
OPTCR    DS    XL(L'AC@ONLY)       CREDIT                                       
*&&UK                                                                           
OPTCUR   DS    XL(L'CURTCUR)       CURRENCY                                     
OPTCUALL EQU   X'FF'               ALL NON-COMPANY CURRENCIES                   
*&&                                                                             
OPTEPDR  DS    0XL(L'OPTSEPD+L'OPTEEPD)                                         
OPTSEPD  DS    CL(L'GDADATE)       PWOS EARLIEST PAYMENT START DATE             
OPTEEPD  DS    CL(L'GDADATE)       PWOS EARLIEST PAYMENT END DATE               
*                                                                               
OPTUDAR  DS    0XL(L'OPTUDS+L'OPTUDE)                                           
OPTUDS   DS    XL(L'TRSUDAT)       START USED DATE                              
OPTUDE   DS    XL(L'TRSUDAT)       END USED DATE                                
*                                                                               
OPTRCDR  DS    0XL(L'OPTSREC+L'OPTEREC)                                         
OPTSREC  DS    XL(L'GDADATE)       START RECONCILED DATE                        
OPTEREC  DS    XL(L'GDADATE)       END RECONCILED DATE                          
*                                                                               
OPTCLDR  DS    0XL(L'OPTSCLR+L'OPTECLR)                                         
OPTSCLR  DS    XL(L'GDADATE2)      START CLEARED DATE                           
OPTECLR  DS    XL(L'GDADATE2)      END CLEARED DATE                             
*                                                                               
KEYOPTSL EQU   *-OPTIONS                                                        
*                                                                               
OPTDIS   DS    XL(L'PROFDIS)       DISPLAY                                      
                                                                                
OPTDIND  DS    XL1                 INDICATOR FOR DISPLAY OPTION                 
OPTDISIQ EQU   X'20'               INSERT 2ND CURRENCY WITH AMOUNTS             
OPTDISRQ EQU   X'10'               REPLACE AMOUNTS WITH 2ND CURRENCY            
                                                                                
OPTALPG  DS    0XL2                ALL=/PAGE=                                   
OPTALL   DS    XL1                 ALL                                          
OPTPAG   DS    XL1                 PAGE                                         
*                                                                               
*        DS    XL16                N/D KEY OPTIONS                              
         DS    XL8                 N/D KEY OPTIONS                              
*                                                                               
OPTIONSL EQU   *-OPTIONS                                                        
TWASAVAL EQU   *-TWASAVAR                                                       
*                                                                               
SAVEAREA DS    XL(SAVEAREL-TWASAVAL)  11K SAVE AREA MINUS STUFF ABOVE           
         SPACE 1                                                                
TWATPFKD DSECT                     ** TOTALS/PFKEY SCREEN LAYOUT                
       ++INCLUDE ACMRKFED                                                       
TWACFRMD DSECT                     ** CONFIRMATION SCREEN LAYOUT **             
       ++INCLUDE ACMRKFDD                                                       
         EJECT                                                                  
* ACDDEQUS                                                                      
         PRINT OFF                                                              
       ++INCLUDE ACDDEQUS                                                       
         PRINT ON                                                               
         SPACE 1                                                                
* ACGENFILE                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACGENFILE                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* DDACCFACS                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDACCFACS                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* DDCOMFACS                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDCOMFACS                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* DDPERVALD                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDPERVALD                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* DDTSARD                                                                       
         PRINT OFF                                                              
       ++INCLUDE DDTSARD                                                        
         PRINT ON                                                               
         SPACE 1                                                                
* DDDLCB                                                                        
         PRINT OFF                                                              
       ++INCLUDE DDDLCB                                                         
         PRINT ON                                                               
         SPACE 1                                                                
* DDTSBUFFD                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDTSBUFFD                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* FAGETTXTD                                                                     
         PRINT OFF                                                              
       ++INCLUDE FAGETTXTD                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* FASECRETD                                                                     
         PRINT OFF                                                              
       ++INCLUDE FASECRETD                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* FATIOB                                                                        
         PRINT OFF                                                              
       ++INCLUDE FATIOB                                                         
         PRINT ON                                                               
         SPACE 1                                                                
* FAUTL                                                                         
         PRINT OFF                                                              
       ++INCLUDE FAUTL                                                          
         PRINT ON                                                               
         SPACE 1                                                                
* GEGENEXC                                                                      
         PRINT OFF                                                              
       ++INCLUDE GEGENEXC                                                       
         PRINT ON                                                               
         SPACE 1                                                                
* DMDTFPH                                                                       
         PRINT OFF                                                              
       ++INCLUDE DMDTFPH                                                        
         PRINT ON                                                               
         SPACE 1                                                                
* DDCTRYEQUS/DDLANGEQUS                                                         
         PRINT OFF                                                              
       ++INCLUDE DDCTRYEQUS                                                     
       ++INCLUDE DDLANGEQUS                                                     
         PRINT ON                                                               
         SPACE 1                                                                
* DDCURTABD                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDCURTABD                                                      
         PRINT ON                                                               
         ORG   CURTOTHR                                                         
CURTIND1 DS    XL1                                                              
         SPACE 1                                                                
* ACOFFALD                                                                      
         PRINT OFF                                                              
       ++INCLUDE ACOFFALD                                                       
         PRINT ON                                                               
         SPACE 1                                                                
* DDFLDHDR                                                                      
         PRINT OFF                                                              
       ++INCLUDE DDFLDHDR                                                       
         PRINT ON                                                               
         SPACE 1                                                                
* ACBMONVALD                                                                    
         PRINT OFF                                                              
       ++INCLUDE ACBMONVALD                                                     
         PRINT ON                                                               
         SPACE 1                                                                
* ACMSGEQUS                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACMSGEQUS                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* DDEUREKAD                                                                     
*&&UK                                                                           
         PRINT OFF                                                              
       ++INCLUDE DDEUREKAD                                                      
         PRINT ON                                                               
*&&                                                                             
         SPACE 1                                                                
* ACTOBACCOD                                                                    
         PRINT OFF                                                              
       ++INCLUDE ACTOBACCOD                                                     
         PRINT ON                                                               
         SPACE 1                                                                
* ACPAY2JD                                                                      
         PRINT OFF                                                              
       ++INCLUDE ACPAY2JD                                                       
         PRINT ON                                                               
         SPACE 1                                                                
* FAREPBLK                                                                      
         PRINT OFF                                                              
REPD     DSECT                                                                  
       ++INCLUDE FAREPBLK                                                       
         EJECT                                                                  
REPHS    DS    0CL132              ** REPORT HEAD LINES **                      
REPH1    DS    CL132                                                            
REPH2    DS    CL132                                                            
REPH3    DS    CL132                                                            
REPH4    DS    CL132                                                            
REPH5    DS    CL132                                                            
REPH6    DS    CL132                                                            
REPH7    DS    CL132                                                            
REPH8    DS    CL132                                                            
REPH9    DS    CL132                                                            
REPHA    DS    CL132                                                            
REPHB    DS    CL132                                                            
REPHC    DS    CL132                                                            
REPHN    EQU   (*-REPHS)/L'REPHS                                                
*                                                                               
REPMS    DS    0CL132              ** REPORT MID LINES **                       
REPMN    EQU   (*-REPMS)/L'REPMS                                                
*                                                                               
REPPS    DS    0CL132              ** REPORT PRINT LINES **                     
REPP1    DS    CL132                                                            
REPP2    DS    CL132                                                            
REPP3    DS    CL132                                                            
REPP4    DS    CL132                                                            
REPP5    DS    CL132                                                            
REPP6    DS    CL132                                                            
REPP7    DS    CL132                                                            
REPP8    DS    CL132                                                            
REPP9    DS    CL132                                                            
REPPA    DS    CL132                                                            
REPPB    DS    CL132                                                            
REPPC    DS    CL132                                                            
REPPD    DS    CL132                                                            
REPPE    DS    CL132                                                            
REPPF    DS    CL132                                                            
REPPG    DS    CL132                                                            
REPPH    DS    CL132                                                            
REPPI    DS    CL132                                                            
REPPJ    DS    CL132                                                            
REPPK    DS    CL132                                                            
REPPN    EQU   (*-REPPS)/L'REPPS                                                
*                                                                               
REPFS    DS    0XL132              ** REPORT FOOT LINES **                      
REPF1    DS    CL132                                                            
REPF2    DS    CL132                                                            
REPFN    EQU   (*-REPFS)/L'REPFS                                                
*                                                                               
REPX     EQU   *                                                                
REPL     EQU   *-REPD                                                           
         PRINT ON                                                               
         SPACE 1                                                                
STATABD  DSECT                     STATUS TABLE DESECT                          
STABIT   DS    XL1                 STATUS BIT TO TEST                           
STATEST  DS    XL1                 SPECIFIC TESTS                               
STABZ    EQU   X'80'               **RESERVED** EQUATES TO BZ                   
STAIR    EQU   X'40'               TEST INVOICE REGISTER                        
STACTRD  EQU   X'20'               TEST CONTRA'D (SET STATEST2 ALSO)            
STABO    EQU   X'10'               **RESERVED** EQUATES TO BO                   
STAPROD  EQU   X'08'               TEST PRODUCTION                              
STAVEN   EQU   X'04'               TEST VENDER LEDGER                           
STABANK  EQU   X'02'               TEST BANK LEDGER                             
STASD    EQU   X'01'               STATUS DELETABLE                             
STATXT   DS    S                   ADDRESS OF TEXT                              
STATXTL  DS    XL1                 TEXT LENGTH (MACHINE LENGTH)                 
STATEST2 DS    XL1                 BO/Z CONTRA'D                                
STANCON  EQU   X'80'               **RESERVED** EQUATES TO BZ                   
STAACTN  EQU   X'40'               TEST ACTION, LOWER 4 BITS                    
STANACTN EQU   X'20'               TEST NOT ACTION, LOWER 4 BITS                
STACON   EQU   X'10'               **RESERVED** EQUATES TO BO                   
STANPRD  EQU   X'08'               TEST NOT PRODUCTION                          
STANVEN  EQU   X'04'               TEST NOT VENDER LEDGER                       
STANBNK  EQU   X'02'               TEST NOT BANK LEDGER                         
STALEN   EQU   *-STATABD                                                        
*                                                                               
FILTD    DSECT                                                                  
FILT1    DS    XL1                                                              
FILTFC   EQU   X'80'               FOREIGN CURRENCY FILTER                      
FILTAC   EQU   X'40'               AGENCY CURRENCY FILTER                       
FILTXD   EQU   X'20'               EXCHANGE DIFFERENCE FILTER                   
FILT2    DS    XL1                                                              
FILT3    DS    XL1                                                              
FILTDL   EQU   *-FILTD                                                          
*                                                                               
RPTPOST  DSECT                     REPORT TRANSACTION POSTING                   
RPTLINE  DS    0CL132                                                           
RPTULA   DS    CL(L'TRNKULA)                                                    
         DS    CL1                                                              
RPTULC   DS    CL(L'TRNKULC)                                                    
         DS    CL1                                                              
RPTDATE  DS    CL8                                                              
         DS    CL1                                                              
RPTREF   DS    CL(L'TRNKREF)                                                    
         DS    CL1                                                              
RPTSBR   DS    CL3                                                              
         DS    CL1                                                              
RPTAMNT  DS    CL11                                                             
         DS    CL1                                                              
RPTCRDR  DS    CL2                                                              
         DS    CL1                                                              
RPTAFCA  DS    CL15                                                             
         DS    CL1                                                              
RPTOFFC  DS    CL2                                                              
         DS    CL1                                                              
RPTSTAT  DS    CL(L'RPTLINE-(*-RPTLINE))                                        
*                                                                               
ACCXD    DSECT                     ACCOUNT EXTRA DETAILS                        
ACCX     DS    XL(L'ACTKCULA)      C/U/L/ACCOUNT                                
ACCXCOST DS    CL(L'RSTCOSTG)      COSTING GROUP OR SPACE                       
ACCXNAME DS    XL(L'NAMEREC)       ACCOUNT NAME                                 
ACCXOPIK DS    XL1                 OFFICE POSITION IN KEY OR 0                  
ACCXL    EQU   *-ACCXD                                                          
*                                                                               
SVR31BD  DSECT ,                   31 BIT W/S PASSED FROM ROOT ONLINE           
JARAY    DS    XL(JARAYQ)                                                       
JARAY#   EQU   1000                                                             
JARAYQ   EQU   (JARAY#*JARAYLQ)+1                                               
         DS    XL64                                                             
*                                                                               
