*          DATA SET ACMRKF5D   AT LEVEL 001 AS OF 08/02/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T616F5D      DATE 08/02/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL18     6    2   18  L  P H             T        Y              
OFSLDGH  DS    CL8                                                              
OFSLDG   DS    CL1      6   22    1  A  U H             T    I   Y    1         
OFSLDGX  DS    CL8                                                              
OFSLDGNH DS    CL8                                                              
OFSLDGN  DS    CL36     6   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18     7    2   18  L  P H             T        Y              
OFSSUPH  DS    CL8                                                              
OFSSUP   DS    CL56     7   22   56  A  U H             T        Y    2         
OFSSUPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     8    2   18  L  P N             T        Y              
OFSOFFH  DS    CL8                                                              
OFSOFF   DS    CL2      8   22    2  A  U H             T        Y    3         
OFSOFFX  DS    CL8                                                              
OFSOFFNH DS    CL8                                                              
OFSOFFN  DS    CL36     8   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18     9    2   18  L  P N             T        Y              
OFSCONH  DS    CL8                                                              
OFSCON   DS    CL14     9   22   14  A  U H             T        Y    4         
OFSCONX  DS    CL8                                                              
OFSCONNH DS    CL8                                                              
OFSCONN  DS    CL36     9   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18    10    2   18  L  P N             T        Y              
OFSSRCH  DS    CL8                                                              
OFSSRC   DS    CL14    10   22   14  A  U H             T        Y    5         
OFSSRCX  DS    CL8                                                              
OFSSRCNH DS    CL8                                                              
OFSSRCN  DS    CL36    10   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18    11    2   18  L  P N             T        Y              
OFSREFH  DS    CL8                                                              
OFSREF   DS    CL13    11   22   13  A  U H             T        Y    6         
OFSREFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    12    2   18  L  P N             T        Y              
OFSPERH  DS    CL8                                                              
OFSPER   DS    CL17    12   22   17  A  U H             T        Y    7         
OFSPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    13    2   18  L  P N             T        Y              
OFSADAH  DS    CL8                                                              
OFSADA   DS    CL17    13   22   17  A  U H             T        Y    8         
OFSADAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    14    2   18  L  P N             T        Y              
OFSMOAH  DS    CL8                                                              
OFSMOA   DS    CL13    14   22   13  A  U H             T        Y    9         
OFSMOAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    15    2   18  L  P N             T        Y              
OFSOFSH  DS    CL8                                                              
OFSOFS   DS    CL4     15   22    4  A  U H             T        Y   10         
OFSOFSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    16    2   18  L  P N             T        Y              
OFSODAH  DS    CL8                                                              
OFSODA   DS    CL17    16   22   17  A  U H             T        Y   12         
OFSODAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL25    24    2   25  L  P H             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 848  BYTES                            
