*          DATA SET ACMRKFAD   AT LEVEL 001 AS OF 04/24/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T616FAD      DATE 04/24/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL18     6    2   18  L  P H             T        Y              
RVSLDGH  DS    CL8                                                              
RVSLDG   DS    CL2      6   22    2  A  U H             T    I   Y    1         
RVSLDGX  DS    CL8                                                              
RVSLDGNH DS    CL8                                                              
RVSLDGN  DS    CL36     6   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18     7    2   18  L  P H             T        Y              
RVSACCH  DS    CL8                                                              
RVSACC   DS    CL56     7   22   56  A  U H             T        Y    2         
RVSACCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     8    2   18  L  P N             T        Y              
RVSOFFH  DS    CL8                                                              
RVSOFF   DS    CL2      8   22    2  A  U H             T        Y    3         
RVSOFFX  DS    CL8                                                              
RVSOFFNH DS    CL8                                                              
RVSOFFN  DS    CL36     8   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18     9    2   18  L  P N             T        Y              
RVSCONH  DS    CL8                                                              
RVSCON   DS    CL14     9   22   14  A  U H             T        Y    4         
RVSCONX  DS    CL8                                                              
RVSCONNH DS    CL8                                                              
RVSCONN  DS    CL36     9   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18    10    2   18  L  P N             T        Y              
RVSSRCH  DS    CL8                                                              
RVSSRC   DS    CL14    10   22   14  A  U H             T        Y    5         
RVSSRCX  DS    CL8                                                              
RVSSRCNH DS    CL8                                                              
RVSSRCN  DS    CL36    10   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18    11    2   18  L  P N             T        Y              
RVSREFH  DS    CL8                                                              
RVSREF   DS    CL13    11   22   13  A  U H             T        Y    6         
RVSREFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    12    2   18  L  P N             T        Y              
RVSPERH  DS    CL8                                                              
RVSPER   DS    CL17    12   22   17  A  U H             T        Y    7         
RVSPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    13    2   18  L  P N             T        Y              
RVSADAH  DS    CL8                                                              
RVSADA   DS    CL17    13   22   17  A  U H             T        Y    8         
RVSADAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    14    2   18  L  P N             T        Y              
RVSMOAH  DS    CL8                                                              
RVSMOA   DS    CL13    14   22   13  A  U H             T        Y    9         
RVSMOAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    15    2   18  L  P N             T        Y              
RVSRVSH  DS    CL8                                                              
RVSRVS   DS    CL4     15   22    4  A  U H             T        Y   10         
RVSRVSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL25    24    2   25  L  P H             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 784  BYTES                            
