*          DATA SET ACMRKFCD   AT LEVEL 001 AS OF 04/24/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T616FCD      DATE 04/24/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL18     6    2   18  L  P H             T        Y              
VOIBNKH  DS    CL8                                                              
VOIBNK   DS    CL56     6   22   56  A  U H             T    I   Y    1         
VOIBNKX  DS    CL8                                                              
VOIITETH DS    CL8                                                              
VOIITET  DS    CL18     8    2   18  L  P N             T        Y              
VOIITEH  DS    CL8                                                              
VOIITE   DS    CL4      8   22    4  A  U H             T        Y    2         
VOIITEX  DS    CL8                                                              
VOITOTTH DS    CL8                                                              
VOITOTT  DS    CL15     8   42   15  L  P N             T        Y              
VOITOTH  DS    CL8                                                              
VOITOT   DS    CL13     8   63   13  A  U H             T        Y    3         
VOITOTX  DS    CL8                                                              
VOIBRFTH DS    CL8                                                              
VOIBRFT  DS    CL18     9    2   18  L  P N             T        Y              
VOIBRFH  DS    CL8                                                              
VOIBRF   DS    CL4      9   22    4  A  U H             T        Y    4         
VOIBRFX  DS    CL8                                                              
VOIBMOTH DS    CL8                                                              
VOIBMOT  DS    CL18     9   42   18  L  P N             T        Y              
VOIBMOH  DS    CL8                                                              
VOIBMO   DS    CL6      9   63    6  A  U H             T        Y    5         
VOIBMOX  DS    CL8                                                              
VOIBNATH DS    CL8                                                              
VOIBNAT  DS    CL18    10    2   18  L  P N             T        Y              
VOIBNAH  DS    CL8                                                              
VOIBNA   DS    CL15    10   22   15  A  U H             T        Y    6         
VOIBNAX  DS    CL8                                                              
VOIOFFTH DS    CL8                                                              
VOIOFFT  DS    CL18    12    2   18  L  P N             T        Y              
VOIOFFH  DS    CL8                                                              
VOIOFF   DS    CL2     12   22    2  A  U H             T        Y    7         
VOIOFFX  DS    CL8                                                              
VOIOFFNH DS    CL8                                                              
VOIOFFN  DS    CL36    12   42   36  A  P H             T        Y              
VOICONTH DS    CL8                                                              
VOICONT  DS    CL14    13    2   14  L  P N             T        Y              
VOICONH  DS    CL8                                                              
VOICON   DS    CL14    13   22   14  A  U H             T        Y    8         
VOICONX  DS    CL8                                                              
VOICONNH DS    CL8                                                              
VOICONN  DS    CL36    13   42   36  A  P H             T        Y              
VOIREFTH DS    CL8                                                              
VOIREFT  DS    CL18    14    2   18  L  P N             T        Y              
VOIREFH  DS    CL8                                                              
VOIREF   DS    CL13    14   22   13  A  U H             T        Y    9         
VOIREFX  DS    CL8                                                              
VOIPERTH DS    CL8                                                              
VOIPERT  DS    CL18    15    2   18  L  P N             T        Y              
VOIPERH  DS    CL8                                                              
VOIPER   DS    CL17    15   22   17  A  U H             T        Y   10         
VOIPERX  DS    CL8                                                              
VOIADATH DS    CL8                                                              
VOIADAT  DS    CL18    16    2   18  L  P N             T        Y              
VOIADAH  DS    CL8                                                              
VOIADA   DS    CL17    16   22   17  A  U H             T        Y   11         
VOIADAX  DS    CL8                                                              
VOIMOATH DS    CL8                                                              
VOIMOAT  DS    CL18    17    2   18  L  P N             T        Y              
VOIMOAH  DS    CL8                                                              
VOIMOA   DS    CL13    17   22   13  A  U H             T        Y   12         
VOIMOAX  DS    CL8                                                              
VOIVOITH DS    CL8                                                              
VOIVOIT  DS    CL18    18    2   18  L  P N             T        Y              
VOIVOIH  DS    CL8                                                              
VOIVOI   DS    CL4     18   22    4  A  U H             T        Y   13         
VOIVOIX  DS    CL8                                                              
VOIANPTH DS    CL8                                                              
VOIANPT  DS    CL18    19    2   18  L  P N             T        Y              
VOIANPH  DS    CL8                                                              
VOIANP   DS    CL4     19   22    4  A  U H             T        Y   14         
VOIANPX  DS    CL8                                                              
VOIBCHTH DS    CL8                                                              
VOIBCHT  DS    CL18    20    2   18  L  P N             T        Y              
VOIBCHH  DS    CL8                                                              
VOIBCH   DS    CL4     20   22    4  A  U H             T        Y   16         
VOIBCHX  DS    CL8                                                              
VOIFXRTH DS    CL8                                                              
VOIFXRT  DS    CL18    21    2   18  L  P N             T        Y              
VOIFXRH  DS    CL8                                                              
VOIFXR   DS    CL13    21   22   13  A  U H             T        Y   15         
VOIFXRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL25    24    2   25  L  P H             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 992  BYTES                            
