*          DATA SET ACMRKFED   AT LEVEL 001 AS OF 04/24/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T616FED      DATE 04/24/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
MRKTOTH  DS    CL8                                                              
MRKTOT   DS    CL78    22    2   78  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  A  P N             T        Y              
MRKPFKH  DS    CL8                                                              
MRKPFK   DS    CL78    24    2   78  A  P H             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 264  BYTES                            
