*          DATA SET ACMRKF2D   AT LEVEL 001 AS OF 04/24/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T616F2D      DATE 04/24/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL18     6    2   18  L  P H             T        Y              
NUMCLIH  DS    CL8                                                              
NUMCLI   DS    CL56     6   22   56  A  U H             T    I   Y    1         
NUMCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     7    2   18  L  P H             T        Y              
NUMPROH  DS    CL8                                                              
NUMPRO   DS    CL56     7   22   56  A  U H             T        Y    2         
NUMPROX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     8    2   18  L  P H             T        Y              
NUMJOBH  DS    CL8                                                              
NUMJOB   DS    CL56     8   22   56  A  U H             T        Y    3         
NUMJOBX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     9    2   18  L  P N             T        Y              
NUMWRKH  DS    CL8                                                              
NUMWRK   DS    CL2      9   22    2  A  U H             T        Y    4         
NUMWRKX  DS    CL8                                                              
NUMWRKNH DS    CL8                                                              
NUMWRKN  DS    CL36     9   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18    10    2   18  L  P N             T        Y              
NUMCONH  DS    CL8                                                              
NUMCON   DS    CL14    10   22   14  A  U H             T        Y    5         
NUMCONX  DS    CL8                                                              
NUMCONNH DS    CL8                                                              
NUMCONN  DS    CL36    10   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18    11    2   18  L  P N             T        Y              
NUMREFH  DS    CL8                                                              
NUMREF   DS    CL13    11   22   13  A  U H             T        Y    6         
NUMREFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    12    2   18  L  P N             T        Y              
NUMPERH  DS    CL8                                                              
NUMPER   DS    CL17    12   22   17  A  U H             T        Y    7         
NUMPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    13    2   18  L  P N             T        Y              
NUMADAH  DS    CL8                                                              
NUMADA   DS    CL17    13   22   17  A  U H             T        Y    8         
NUMADAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    14    2   18  L  P N             T        Y              
NUMMOAH  DS    CL8                                                              
NUMMOA   DS    CL13    14   22   13  A  U H             T        Y    9         
NUMMOAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    15    2   18  L  P N             T        Y              
NUMNUMH  DS    CL8                                                              
NUMNUM   DS    CL4     15   22    4  A  U H             T        Y   10         
NUMNUMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL25    24    2   25  L  P H             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 792  BYTES                            
