*          DATA SET ACMRKF1D   AT LEVEL 002 AS OF 04/24/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T616F1D      DATE 04/24/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL18     6    2   18  L  P H             T        Y              
HLDCLIH  DS    CL8                                                              
HLDCLI   DS    CL56     6   22   56  A  U H             T    I   Y    1         
HLDCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     7    2   18  L  P H             T        Y              
HLDPROH  DS    CL8                                                              
HLDPRO   DS    CL56     7   22   56  A  U H             T        Y    2         
HLDPROX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     8    2   18  L  P H             T        Y              
HLDJOBH  DS    CL8                                                              
HLDJOB   DS    CL56     8   22   56  A  U H             T        Y    3         
HLDJOBX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     9    2   18  L  P N             T        Y              
HLDWRKH  DS    CL8                                                              
HLDWRK   DS    CL2      9   22    2  A  U H             T        Y    4         
HLDWRKX  DS    CL8                                                              
HLDWRKNH DS    CL8                                                              
HLDWRKN  DS    CL36     9   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18    10    2   18  L  P N             T        Y              
HLDCONH  DS    CL8                                                              
HLDCON   DS    CL14    10   22   14  A  U H             T        Y    5         
HLDCONX  DS    CL8                                                              
HLDCONNH DS    CL8                                                              
HLDCONN  DS    CL36    10   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18    11    2   18  L  P N             T        Y              
HLDREFH  DS    CL8                                                              
HLDREF   DS    CL13    11   22   13  A  U H             T        Y    6         
HLDREFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    12    2   18  L  P N             T        Y              
HLDPERH  DS    CL8                                                              
HLDPER   DS    CL17    12   22   17  A  U H             T        Y    7         
HLDPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    13    2   18  L  P N             T        Y              
HLDADAH  DS    CL8                                                              
HLDADA   DS    CL17    13   22   17  A  U H             T        Y    8         
HLDADAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    14    2   18  L  P N             T        Y              
HLDMOAH  DS    CL8                                                              
HLDMOA   DS    CL13    14   22   13  A  U H             T        Y    9         
HLDMOAX  DS    CL8                                                              
HLDHLDTH DS    CL8                                                              
HLDHLDT  DS    CL18    15    2   18  L  P N             T        Y              
HLDHLDH  DS    CL8                                                              
HLDHLD   DS    CL4     15   22    4  A  U H             T        Y   10         
HLDHLDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL25    24    2   25  L  P H             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 792  BYTES                            
