*          DATA SET ACMRKF8D   AT LEVEL 001 AS OF 04/24/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T616F8D      DATE 04/24/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL18     6    2   18  L  P H             T        Y              
HOLLDGH  DS    CL8                                                              
HOLLDG   DS    CL1      6   22    1  A  U H             T    I   Y    1         
HOLLDGX  DS    CL8                                                              
HOLLDGNH DS    CL8                                                              
HOLLDGN  DS    CL36     6   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18     7    2   18  L  P H             T        Y              
HOLSUPH  DS    CL8                                                              
HOLSUP   DS    CL56     7   22   56  A  U H             T        Y    2         
HOLSUPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     8    2   18  L  P N             T        Y              
HOLOFFH  DS    CL8                                                              
HOLOFF   DS    CL2      8   22    2  A  U H             T        Y    3         
HOLOFFX  DS    CL8                                                              
HOLOFFNH DS    CL8                                                              
HOLOFFN  DS    CL36     8   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18     9    2   18  L  P N             T        Y              
HOLCONH  DS    CL8                                                              
HOLCON   DS    CL14     9   22   14  A  U H             T        Y    4         
HOLCONX  DS    CL8                                                              
HOLCONNH DS    CL8                                                              
HOLCONN  DS    CL36     9   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18    10    2   18  L  P N             T        Y              
HOLSRCH  DS    CL8                                                              
HOLSRC   DS    CL14    10   22   14  A  U H             T        Y    5         
HOLSRCX  DS    CL8                                                              
HOLSRCNH DS    CL8                                                              
HOLSRCN  DS    CL36    10   42   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL18    11    2   18  L  P N             T        Y              
HOLREFH  DS    CL8                                                              
HOLREF   DS    CL13    11   22   13  A  U H             T        Y    6         
HOLREFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    12    2   18  L  P N             T        Y              
HOLPERH  DS    CL8                                                              
HOLPER   DS    CL17    12   22   17  A  U H             T        Y    7         
HOLPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    13    2   18  L  P N             T        Y              
HOLADAH  DS    CL8                                                              
HOLADA   DS    CL17    13   22   17  A  U H             T        Y    8         
HOLADAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    14    2   18  L  P N             T        Y              
HOLMOAH  DS    CL8                                                              
HOLMOA   DS    CL13    14   22   13  A  U H             T        Y    9         
HOLMOAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    15    2   18  L  P N             T        Y              
HOLHOLH  DS    CL8                                                              
HOLHOL   DS    CL4     15   22    4  A  U H             T        Y   10         
HOLHOLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL25    24    2   25  L  P H             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 784  BYTES                            
