*          DATA SET ACMRKE9D   AT LEVEL 015 AS OF 09/17/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T616E9D      DATE 09/17/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL10     4    2   10  L  P N             T        Y              
INPACCH  DS    XL8                                                              
INPACC   DS    CL68     4   13   68  A  P H             T        Y              
INPHEDH  DS    XL8                                                              
INPHED   DS    CL66     5    2   66  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10     5   70   10  L  P H             T        Y              
INPHD2H  DS    XL8                                                              
INPHD2   DS    CL66     6    2   66  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10     6   70   10  A  P H             T        Y              
INPDETH  DS    XL8                                                              
INPDET   DS    CL66     7    2   66  A  P N             T        Y              
INPMRKH  DS    XL8                                                              
INPMRK   DS    CL10     7   70   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL66     8    2   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     8   70   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL66     9    2   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     9   70   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL66    10    2   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    10   70   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL66    11    2   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   70   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL66    12    2   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   70   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL66    13    2   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   70   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL66    14    2   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   70   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL66    15    2   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   70   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL66    16    2   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   70   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL66    17    2   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   70   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL66    18    2   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   70   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL66    19    2   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   70   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL66    20    2   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   70   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL66    21    2   66  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   70   10  A  U N             T        Y              
INPTOTH  DS    XL8                                                              
INPTOT   DS    CL78    22    2   78  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL78    23    2   78  A  P N             T        Y              
INPPFKH  DS    XL8                                                              
INPPFK   DS    CL78    24    2   78  A  P H             T        Y              
         DS    XL1                                                              
         DS    XL2    INDICS=11                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1920 BYTES                            
