*          DATA SET ACNVWORK   AT LEVEL 045 AS OF 06/25/98                      
ACRECTYP DC    V(ACRECTYP)                                                      
BOXAREA  DC    V(BOXAREA)                                                       
BUFFALO  DC    V(BUFFALO)                                                       
CARDS    DC    V(CARDS)                                                         
CENTER   DC    V(CENTER)                                                        
CHOPPER  DC    V(CHOPPER)                                                       
CPRINT   DC    V(CPRINT)                                                        
DATAMGR  DC    V(DATAMGR)                                                       
DATCON   DC    V(DATCON)                                                        
DATVAL   DC    V(DATVAL)                                                        
DECODE   DC    V(DECODE)                                                        
HELEN    DC    V(HELEN)                                                         
HELLO    DC    V(HELLO)                                                         
HEXIN    DC    V(HEXIN)                                                         
HEXOUT   DC    V(HEXOUT)                                                        
LOADER   DC    V(LOADER)                                                        
PDUMPER  DC    V(PDUMPER)                                                       
PRINT    DC    V(PRINT)                                                         
PRINTER  DC    V(PRINTER)                                                       
PRNTBL   DC    V(PRNTBL)                                                        
SCANNER  DC    V(SCANNER)                                                       
STXITER  DC    V(STXITER)                                                       
SORTER   DC    V(SORTER)                                                        
SQUASHER DC    V(SQUASHER)                                                      
XSORT    DC    V(XSORT)                                                         
DUMMY    DC    V(DUMMY)                                                         
         DC    5AL4(0)                                                          
*                                                                               
AINIT    DC    V(INIT)             A(INITIALIZATION ROUTINE)                    
*                                                                               
ASRCH    DC    V(SRCH)             A(SEARCH ROUTINE)                            
SRCHL    EQU   1                   LEDGER                                       
SRCHA    EQU   2                   ACCOUNT                                      
SRCHC    EQU   3                   CONTRA                                       
SRCHO    EQU   4                   OFFICE                                       
SRCHEA   EQU   5                   ACCOUNT(ELEMENT DATA)                        
SRCHEO   EQU   6                   OFFICE(ELEMENT DATA)                         
SRCHCC   EQU   7                   CLIENT CODE                                  
SRCHMC   EQU   8                   MEDIA CODE                                   
SRCHWC   EQU   9                   WORKCODE                                     
SRCHCO   EQU   10                  CLIENT/OFFICE                                
SRCHBS   EQU   11                  BILLING SOURCE                               
*                                                                               
APAR     DC    V(PAR)              A(PARSE ROUTINE)                             
ARPT     DC    V(RPT)              A(REPORT ROUTINE)                            
*                                                                               
ACNVPHS  DS    0F                                                               
ACNVELM  DC    A(0)                1 A(ELEMENT CONVERSION ROUTINE)              
ACNVKEYS DC    A(0)                2 A(KEYSORT ROUTINE)                         
ACNVMRGE DC    A(0)                3 A(MERGE ROUTINE)                           
ACNVCNT  DC    A(0)                4 A(RECORD COUNT ROUTINE)                    
ACNVHOOK DC    A(0)                5 A(USER HOOK)                               
ACNVLIST DC    A(0)                6 A(AGENCY LISTS)                            
         DC    3A(0)                                                            
*                                                                               
ACNVOFAC DC    A(0)                A(OFFICE AND ACCOUNT) TABLES                 
ACNVPROD DC    A(0)                A(PRODUCTION) TABLES                         
         DC    3A(0)                                                            
*                                                                               
ARECT    DC    V(RECT)             A(RECORD TABLE)                              
AXXXK    DC    V(XXXK)             A(DEFAULT KEY FIELD TABLE)                   
APERT    DC    V(PERT)             A(PERSON KEY TABLE)                          
AELMT    DC    A(0)                A(ELEMENT TABLE)                             
ABATT    DC    A(0)                A(BATCH SCREEN TABLE)                        
APOPT    DC    A(0)                A(PROD OPTIONS TABLE)                        
         DC    3A(0)                                                            
*                                                                               
AUPREC   DC    A(0)                A(RECORD TO BE UPDATED)                      
         DC    3A(0)               N/D                                          
*                                                                               
ADMGR    DC    V(DMGR)             A(DATAMGER)                                  
DMRD     EQU   1                   READ                                         
DMHI     EQU   2                   HIGH                                         
DMSEQ    EQU   3                   SEQUENTIAL                                   
DMGET    EQU   4                   GET RECORD                                   
DMWRT    EQU   5                   WRITE RECORD                                 
DMPUT    EQU   6                   PUTREC RECORD                                
DMADD    EQU   7                   ADDREC RECORD                                
*                                                                               
AINPL    DC    V(INPL)             INPUT                                        
AINP     DC    V(INP)                                                           
*                                                                               
AOUTL    DC    V(OUTL)             OUTPUT                                       
AOUT     DC    V(OUT)                                                           
*                                                                               
ACINP    DC    V(CINP)             DCB'S                                        
AXINP    DC    V(XINP)                                                          
ATINT    DC    V(TINT)                                                          
ATOUT    DC    V(TOUT)                                                          
ATTRN    DC    V(TTRN)                                                          
ATACC    DC    V(TACC)                                                          
ATKEY    DC    V(TKEY)                                                          
*                                                                               
AIO3L    DC    V(IO3L)             IO3                                          
AIO3     DC    V(IO3)                                                           
*                                                                               
ACHDRL   DC    V(CHDRL)            CONTRA HEADER                                
ACHDR    DC    V(CHDR)                                                          
*                                                                               
ALGRTAB  DC    V(LGRTABL)          A(LEDGER TABLE)                              
ACHDTAB  DC    V(CHDTABL)          A(CONTRA HEADER TABLE)                       
AOFATAB  DC    V(OFATABL)          A(OFFICE ACCOUNT)                            
ABUFC    DC    V(BUFFALOC)         A(BUFFALO CSECT)                             
AHCARD   DC    V(HCARD)            A(HELD CARDS)                                
AHSCAN   DC    V(HSCAN)            A(HELD SCAN DATA)                            
         DC    5F'0'                                                            
*                                                                               
FPRMS    DS    0F                  PARAMETERS FOR INPUT FILE/TABLE              
FDCB     DC    CL8' '              DCB NAME                                     
FTAB     DC    A(0)                A(START OF THE TABLE)                        
FNUM     DC    A(0)                NUMBER OF RECORDS                            
FRLN     DC    A(0)                L'RECORD                                     
FKLN     DC    A(0)                L'KEY                                        
FDSP     DC    A(0)                DISPLACEMENT TO KEY                          
FBIN     DC    5F'0'               BINARY SEARCH PARAMETERS                     
FBINL    DS    0XL20                                                            
FDPK     DC    AL1(0)              DISP. TO 5 BYTE PACKED COUNTER               
FDOD     DC    AL1(0)              DISP. TO OLD DATA                            
FDND     DC    AL1(0)              DISP. TO NEW DATA                            
         DC    AL1(0)              N/D                                          
FPLNQ    EQU   *-FPRMS                                                          
*                                                                               
LGRPRMS  DS    0F                  LEDGER TABLE                                 
LGRDCB   DC    CL8' '              DCB NAME                                     
LGRTAB   DC    A(0)                A(START OF THE TABLE)                        
LGRNUM   DC    A(0)                NUMBER OF RECORDS                            
LGRRLN   DC    A(LGRLNQ)           L'RECORD                                     
LGRKLN   DC    A(L'LGRCDE)         L'KEY                                        
LGRDSP   DC    A(0)                DISPLACEMENT TO KEY                          
LGRBIN   DC    5F'0'               BINARY SEARCH PARAMETERS                     
LGRDPK   DC    AL1(0)              DISP. TO 5 BYTE PACKED COUNTER               
LGRDOD   DC    AL1(0)              DISP. TO OLD DATA (INPUT FILE)               
LGRDND   DC    AL1(0)              DISP. TO NEW DATA (INPUT FILE)               
         DC    AL1(0)              N/D                                          
LGRPLNQ  EQU   *-LGRPRMS                                                        
*                                                                               
         DS    0F                                                               
LGRS     DS    0XL(LGRLNQ)         * LEDGER ENTRY *                             
LGRCDE   DC    CL2'  '             LEDGER CODE                                  
         DC    AL2(0)              ND                                           
LGRREG   DC    XL20'00'            SEARCH REGISTERS                             
LGRLNQ   EQU   *-LGRCDE                                                         
LGRFND   DC    C' '                FOUND/ NOT FOUND INDICATOR                   
LGRADDR  DC    A(0)                ADDRESS OF TABLE ENTRY                       
*                                                                               
         DS    0F                                                               
CLGS     DS    0XL(CLGLNQ)         * CONTRA LEDGER *                            
CLGCDE   DC    CL2'  '             LEDGER CODE                                  
         DC    XL2'00'             ND                                           
CLGREG   DC    XL20'00'            SEARCH PARAMETERS FOR THE ACCOUNT            
CLGLNQ   EQU   *-CLGCDE                                                         
CLGFND   DC    C' '                FOUND/ NOT FOUND INDICATOR                   
CLGADDR  DC    A(0)                ADDRESS OF TABLE ENTRY                       
*                                                                               
         DS    0F                                                               
ELGS     DS    0XL(ELGLNQ)         * ELEMENT LEDGER *                           
ELGCDE   DC    CL2'  '             LEDGER CODE                                  
         DC    XL2'00'             ND                                           
ELGREG   DC    XL20'00'            SEARCH PARAMETERS FOR THE ACCOUNT            
ELGLNQ   EQU   *-ELGCDE                                                         
ELGFND   DC    C' '                FOUND/ NOT FOUND INDICATOR                   
ELGADDR  DC    A(0)                ADDRESS OF TABLE ENTRY                       
*                                                                               
OFFPRMS  DS    0F                  OFFICE FILE/TABLE                            
OFFDCB   DC    CL8' '              DCB NAME                                     
OFFTAB   DC    A(0)                A(START OF THE TABLE)                        
OFFNUM   DC    A(0)                NUMBER OF RECORDS                            
OFFRLN   DC    A(OFFLNQ)           L'RECORD                                     
OFFKLN   DC    A(L'OFFO)           L'KEY                                        
OFFDSP   DC    A(0)                DISPLACEMENT TO KEY                          
OFFBIN   DC    5F'0'               BINARY SEARCH PARAMETERS                     
OFFDPK   DC    AL1(OFFH-OFFS)      DISPL. TO 5 BYTE PACKED COUNTER              
OFFDOD   DC    AL1(0)              DISP. TO OLD DATA                            
OFFDND   DC    AL1(0)              DISP. TO NEW DATA                            
         DC    AL1(0)              N/D                                          
OFFPLNQ  EQU   *-OFFPRMS                                                        
*                                                                               
OFFS     DS    0XL(OFFLNQ)         * OFFICE CONVERSION *                        
OFFO     DC    CL1' '              OLD CODE                                     
OFFN     DC    CL2' '              NEW ACCOUNT                                  
OFFH     DC    PL5'0'              NUMBER OF HITS                               
OFFLNQ   EQU   *-OFFO                                                           
OFFFND   DC    C' '                FOUND/ NOT FOUND INDICATOR                   
OFFADDR  DC    A(0)                ADDRESS OF TABLE ENTRY                       
*                                                                               
OFES     DS    0XL(OFELNQ)         * OFFICE CONVERSION (ELEMENT) *              
OFEO     DC    CL1' '              OLD CODE                                     
OFEN     DC    CL2' '              NEW ACCOUNT                                  
OFELNQ   EQU   *-OFEO                                                           
OFEFND   DC    C' '                FOUND/ NOT FOUND INDICATOR                   
OFEADDR  DC    A(0)                ADDRESS OF TABLE ENTRY                       
*                                                                               
ACCPRMS  DS    0F                  ACCOUNT FILE/TABLE                           
ACCDCB   DC    CL8' '              DCB NAME                                     
ACCTAB   DC    A(0)                A(START OF THE TABLE)                        
ACCNUM   DC    A(0)                NUMBER OF RECORDS                            
ACCRLN   DC    A(ACCLNQ)           L'RECORD                                     
ACCKLN   DC    A(L'ACCO)           L'KEY                                        
ACCDSP   DC    A(0)                DISPLACEMENT TO KEY                          
ACCBIN   DC    5F'0'               BINARY SEARCH PARAMETERS                     
ACCDPK   DC    AL1(ACCH-ACCS)      DISPL. TO 5 BYTE PACKED COUNTER              
ACCDOD   DC    AL1(0)              DISP. TO OLD DATA                            
ACCDND   DC    AL1(0)              DISP. TO NEW DATA                            
         DC    AL1(0)              N/D                                          
ACCPLNQ  EQU   *-ACCPRMS                                                        
*                                                                               
ACCS     DS    0XL(ACCLNQ)         * ACCOUNT CONVERSION *                       
ACCO     DC    CL14' '             OLD ACCOUNT                                  
ACCN     DC    CL14' '             NEW ACCOUNT                                  
ACCNME   DC    CL36' '             ACCOUNT NAME                                 
ACCH     DC    PL5'0'              NUMBER OF HITS                               
ACCLNQ   EQU   *-ACCO                                                           
ACCFND   DC    C' '                FOUND/ NOT FOUND INDICATOR                   
ACCADDR  DC    A(0)                ADDRESS OF TABLE ENTRY                       
*                                                                               
CONS     DS    0XL(CONLNQ)         * CONTRA / OR SECOND ACCOUNT *               
CONO     DC    CL14' '             OLD ACCOUNT                                  
CONN     DC    CL14' '             NEW ACCOUNT                                  
CONNME   DC    CL36' '             ACCOUNT NAME                                 
CONLNQ   EQU   *-CONO                                                           
CONFND   DC    C' '                FOUND/ NOT FOUND INDICATOR                   
CONADDR  DC    A(0)                ADDRESS OF TABLE ENTRY                       
*                                                                               
ACES     DS    0XL(ACELNQ)         * ACCOUNT CONVERSION (ELEMENT) *             
ACEO     DC    CL14' '             OLD ACCOUNT                                  
ACEN     DC    CL14' '             NEW ACCOUNT                                  
ACELNQ   EQU   *-ACEO                                                           
ACEFND   DC    C' '                FOUND/ NOT FOUND INDICATOR                   
ACEADDR  DC    A(0)                ADDRESS OF TABLE ENTRY                       
*                                                                               
WRKPRMS  DS    0F                  WORKCODE FILE/TABLE                          
WRKDCB   DC    CL8' '              DCB NAME                                     
WRKTAB   DC    A(0)                A(START OF THE TABLE)                        
WRKNUM   DC    A(0)                NUMBER OF RECORDS                            
WRKRLN   DC    A(WRKLNQ)           L'RECORD                                     
WRKKLN   DC    A(L'WRKO)           L'KEY                                        
WRKDSP   DC    A(0)                DISPLACEMENT TO KEY                          
WRKBIN   DC    5F'0'               BINARY SEARCH PARAMETERS                     
WRKDPK   DC    AL1(WRKH-WRKS)      DISPL. TO 5 BYTE PACKED COUNTER              
WRKDOD   DC    AL1(0)              DISP. TO OLD DATA                            
WRKDND   DC    AL1(0)              DISP. TO NEW DATA                            
         DC    AL1(0)              N/D                                          
WRKPLNQ  EQU   *-WRKPRMS                                                        
*                                                                               
WRKS     DS    0XL(WRKLNQ)         * WORKCODE CONVERSION *                      
WRKO     DC    CL2' '              OLD CODE                                     
WRKN     DC    CL2' '              NEW ACCOUNT                                  
WRKH     DC    PL5'0'              NUMBER OF HITS                               
WRKLNQ   EQU   *-WRKO                                                           
WRKFND   DC    C' '                FOUND/ NOT FOUND INDICATOR                   
WRKADDR  DC    A(0)                ADDRESS OF TABLE ENTRY                       
*                                                                               
MEDPRMS  DS    0F                  MEDIA FILE/TABLE                             
MEDDCB   DC    CL8' '              DCB NAME                                     
MEDTAB   DC    A(0)                A(START OF THE TABLE)                        
MEDNUM   DC    A(0)                NUMBER OF RECORDS                            
MEDRLN   DC    A(MEDLNQ)           L'RECORD                                     
MEDKLN   DC    A(L'MEDO)           L'KEY                                        
MEDDSP   DC    A(0)                DISPLACEMENT TO KEY                          
MEDBIN   DC    5F'0'               BINARY SEARCH PARAMETERS                     
MEDDPK   DC    AL1(MEDH-MEDS)      DISPL. TO 5 BYTE PACKED COUNTER              
MEDDOD   DC    AL1(0)              DISP. TO OLD DATA                            
MEDDND   DC    AL1(0)              DISP. TO NEW DATA                            
         DC    AL1(0)              N/D                                          
MEDPLNQ  EQU   *-MEDPRMS                                                        
*                                                                               
MEDS     DS    0XL(MEDLNQ)         * MEDIA CONVERSION *                         
MEDO     DC    CL1' '              OLD CODE                                     
MEDN     DC    CL1' '              NEW ACCOUNT                                  
MEDH     DC    PL5'0'              NUMBER OF HITS                               
MEDLNQ   EQU   *-MEDO                                                           
MEDFND   DC    C' '                FOUND/ NOT FOUND INDICATOR                   
MEDADDR  DC    A(0)                ADDRESS OF TABLE ENTRY                       
*                                                                               
CLIPRMS  DS    0F                  CLIENT FILE/TABLE                            
CLIDCB   DC    CL8' '              DCB NAME                                     
CLITAB   DC    A(0)                A(START OF THE TABLE)                        
CLINUM   DC    A(0)                NUMBER OF RECORDS                            
CLIRLN   DC    A(CLILNQ)           L'RECORD                                     
CLIKLN   DC    A(L'CLIO)           L'KEY                                        
CLIDSP   DC    A(0)                DISPLACEMENT TO KEY                          
CLIBIN   DC    5F'0'               BINARY SEARCH PARAMETERS                     
CLIDPK   DC    AL1(CLIH-CLIS)      DISPL. TO 5 BYTE PACKED COUNTER              
CLIDOD   DC    AL1(0)              DISP. TO OLD DATA                            
CLIDND   DC    AL1(0)              DISP. TO NEW DATA                            
         DC    AL1(0)              N/D                                          
CLIPLNQ  EQU   *-CLIPRMS                                                        
*                                                                               
CLIS     DS    0XL(CLILNQ)         * CLIENT CONVERSION *                        
CLIO     DC    CL3' '              OLD CODE                                     
CLIN     DC    CL3' '              NEW ACCOUNT                                  
CLIH     DC    PL5'0'              NUMBER OF HITS                               
CLILNQ   EQU   *-CLIO                                                           
CLIFND   DC    C' '                FOUND/ NOT FOUND INDICATOR                   
CLIADDR  DC    A(0)                ADDRESS OF TABLE ENTRY                       
*                                                                               
CLOPRMS  DS    0F                  CLIENT OFFICE FILE/TABLE                     
CLODCB   DC    CL8' '              DCB NAME                                     
CLOTAB   DC    A(0)                A(START OF THE TABLE)                        
CLONUM   DC    A(0)                NUMBER OF RECORDS                            
CLORLN   DC    A(CLOLNQ)           L'RECORD                                     
CLOKLN   DC    A(L'CLOC)           L'KEY                                        
CLODSP   DC    A(0)                DISPLACEMENT TO KEY                          
CLOBIN   DC    5F'0'               BINARY SEARCH PARAMETERS                     
CLODPK   DC    AL1(CLOH-CLOS)      DISPL. TO 5 BYTE PACKED COUNTER              
CLODOD   DC    AL1(0)              DISP. TO OLD DATA                            
CLODND   DC    AL1(0)              DISP. TO NEW DATA                            
         DC    AL1(0)              N/D                                          
CLOPLNQ  EQU   *-CLOPRMS                                                        
*                                                                               
CLOS     DS    0XL(CLOLNQ)         * CLIENT OFFICE *                            
CLOC     DC    CL3' '              CLIENT CODE                                  
CLOO     DC    CL2' '              CLIENT OFFICE                                
CLOH     DC    PL5'0'              NUMBER OF HITS                               
CLOLNQ   EQU   *-CLOC                                                           
CLOFND   DC    C' '                FOUND/ NOT FOUND INDICATOR                   
CLOADDR  DC    A(0)                ADDRESS OF TABLE ENTRY                       
*                                                                               
BLSPRMS  DS    0F                  BILLING SOURCE                               
BLSDCB   DC    CL8' '              DCB NAME                                     
BLSTAB   DC    A(0)                A(START OF THE TABLE)                        
BLSNUM   DC    A(0)                NUMBER OF RECORDS                            
BLSRLN   DC    A(BLSLNQ)           L'RECORD                                     
BLSKLN   DC    A(L'BLSO)           L'KEY                                        
BLSDSP   DC    A(0)                DISPLACEMENT TO KEY                          
BLSBIN   DC    5F'0'               BINARY SEARCH PARAMETERS                     
BLSDPK   DC    AL1(BLSH-BLSS)      DISPL. TO 5 BYTE PACKED COUNTER              
BLSDOD   DC    AL1(0)              DISP. TO OLD DATA                            
BLSDND   DC    AL1(0)              DISP. TO NEW DATA                            
         DC    AL1(0)              N/D                                          
BLSPLNQ  EQU   *-BLSPRMS                                                        
*                                                                               
BLSS     DS    0XL(BLSLNQ)         * BILLING SOURCE *                           
BLSO     DC    CL12' '             OLD BILLING SOURCE                           
BLSN     DC    CL12' '             NEW BILLING SOURCE                           
BLSH     DC    PL5'0'              NUMBER OF HITS                               
BLSLNQ   EQU   *-BLSO                                                           
BLSFND   DC    C' '                FOUND/ NOT FOUND INDICATOR                   
BLSADDR  DC    A(0)                ADDRESS OF TABLE ENTRY                       
*                                                                               
RDMPS    DS    0XL(RDMPLNQ)        * RECORD  CONTROL *                          
RDCDE    DC    AL1(0)              TYPE CODE                                    
RDFLDT   DC    AL3(0)              A(FIELD TABLE)                               
RDNME    DC    CL8'  '             RECORD TYPE NAME                             
RDLNME   DC    CL30' '             RECORD DESCRIPTION                           
RDINDS   DC    X'00'               RECORD INDICATORS                            
RDDMPUN  DC    AL1(0)              REMAINING DUMP COUNT UNCHANGED               
RDDMPOK  DC    AL1(0)                                   CHANGED                 
RDDMPNO  DC    AL1(0)                                   NOT OK                  
RDDMPCP  DC    AL1(0)                                   COPIED                  
RDDMPDL  DC    AL1(0)                                   DELETED                 
RDDMPNW  DC    AL1(0)                                   NEW                     
         DC    AL2(0)              SPARE                                        
RDUNKEY  DC    AL1(0)              UNKOWN KEY                                   
         DC    XL12'00'            SPARE                                        
RDMPLNQ  EQU   *-RDCDE                                                          
RDMPADDR DC    A(0)                ADDRESS OF CURRENT ENTRY                     
*                                                                               
         DS    10F'0'                ND                                         
*                                                                               
KTABS    DS    0XL(KTABLNQ)        * KEY STATUS *                               
KTABUL   DC    CL2'  '             DEFAULT U/L CODE (WHEN NOT IN KEY)           
KTABDUL  DC    XL1'00'             DISP. TO U/L                                 
KTABDAC  DC    XL1'00'             DISP. ACCOUNT                                
KTABUL2  DC    CL2'  '             DEFAULT 2ND UL                               
KTABDUL2 DC    XL1'00'             DISP. TO 2ND U/L                             
KTABDAC2 DC    XL1'00'             DISP. 2ND ACCOUNT                            
KTABOF   DC    XL1'00'             DISP. TO OFFICE CODE                         
KTABOF2  DC    XL1'00'             DISP. TO SECOND OFFICE CODE                  
KTABCP2  DC    XL1'00'             DISP. TO SECOND COMPANY CODE                 
KTABSP1R DC    XL1'00'             DISP. TO SPLIT 1R ACCOUNT                    
KTABMC   DC    AL1(0)              DISP. MEDIA CODE                             
KTABWC   DC    AL1(0)              DISP. WORK CODE                              
KTABCC   DC    AL1(0)              DISP. TO CLIENT CODE                         
KTABJC   DC    AL1(0)              DISP. TO JOB CODE                            
KTABLNQ  EQU   *-KTABUL                                                         
*                                                                               
ETABS    DS    0XL(ETABLNQ)        * ELEMENT STATUS *                           
ETABQ    DS    XL1                 ELEMENT CODE                                 
ETABA    DS    XL1                 DISP. TO ACCOUNT CODE                        
ETABO    DS    XL1                 DISP. TO OFFICE CODE                         
ETABR    DS    XL1                 SPECIAL ROUTINE                              
ETABLNQ  EQU   *-ETABQ                                                          
*                                                                               
         DS    0F                                                               
AGYLST   DC    AL1(CNVSOF),AL3(OFFPRMS)     LIST IN AGENCY PHASE                
         DC    AL1(CNVSAC),AL3(ACCPRMS)                                         
         DC    AL1(CNVSCO),AL3(CLOPRMS)                                         
         DC    AL1(CNVSWC),AL3(WRKPRMS)                                         
         DC    AL1(CNVSMC),AL3(MEDPRMS)                                         
         DC    AL1(CNVSCC),AL3(CLIPRMS)                                         
         DC    AL1(CNVSBS),AL3(BLSPRMS)                                         
         DC    X'FF'                                                            
CURPRM   DS    F                   A(CURRENT PARAMS)                            
*                                                                               
ELMCB    DC    XL8'00'             ELEMENT CONTROL BLOCK                        
*                                                                               
HOOKSW   DC    X'00'               HOOK SWITCH                                  
HOOKIT   EQU   X'80'               HOOK IS LOADED                               
HOOKCB   DC    XL11'00'            HOOK CONTROL BLOCK                           
         ORG   HOOKCB                                                           
HKSTA    DC    X'00'               HOOK STATUS                                  
HKSDEL   EQU   X'80'               DELETE THE RECORD                            
HKSELM   EQU   X'40'               CALL HOOK FOR EACH ELEMENT ENTRY             
HKSENO   EQU   X'20'               DON'T CHANGE ITEM                            
HKSTA2   DC    X'00'               HOOK STATUS 2                                
HKSDMP   EQU   X'80'               DUMP THE RECORD                              
         DS    XL1                 N/D                                          
HKNEWA   DC    AL4(0)              A(NEW ACCOUNT FIELD)                         
HKNREC   DS    AL4(0)              A(NEW RECORD ADDED BY HOOK)                  
*                                                                               
SRCHARG  DC    CL14' '             SEARCH ARGUMENT                              
OLDARG   DC    CL14' '             PREVIOUS SEARCH ARGUMENT                     
FOUND    DC    C' '                FOUND/ NOT FOUND INDICATOR                   
FND      EQU   C'Y'                FOUND                                        
NFND     EQU   C'N'                NOT                                          
*                                                                               
         DS    0D                                                               
OLDKEY   DC    XL42'00'            OLD KEY                                      
         ORG   OLDKEY                                                           
OLDCMP   DS    XL1                 COMPANY                                      
OLDUL    DS    CL2                 UNIT LEDGER                                  
OLDCC    DS    CL3                 CLIENT CODE                                  
OLDPC    DS    CL3                 PRODUCT CODE                                 
OLDMC    DS    CL1                 MEDIA CODE                                   
OLDJC    DS    CL5                 JOB CODE                                     
         ORG   OLDCC                                                            
OLDACC   DS    CL12                ACCOUNT                                      
         ORG   OLDUL                                                            
OLDULA   DS    CL14                U/L ACCOUNT                                  
         ORG   OLDCMP                                                           
OLDULC   DS    CL15                CPY/UL/ACC                                   
OLDOFF   DS    CL2                 OFFICE                                       
         ORG   OLDOFF                                                           
OLDWC    DS    CL2                 WORKCODE                                     
OLDCCMP  DS    XL1                 CONTRA COMPAMY                               
OLDCUL   DS    CL2                 CONTRA U/L                                   
OLDCCC   DS    CL3                 CLIENT CODE                                  
OLDCPC   DS    CL3                 PRODUCT CODE                                 
OLDCMC   DS    CL1                 MEDIA CODE                                   
OLDCJC   DS    CL5                 JOB CODE                                     
         ORG   OLDCCC                                                           
OLDCACC  DS    CL12                CONTRA ACCOUNT                               
         ORG   OLDCUL                                                           
OLDCULA  DS    CL14                CONTRA U/L ACCOUNT                           
         ORG   OLDCCMP                                                          
OLDCULC  DS    CL15                CONTRA CPY/UL/AC                             
OLDDTRFS DS    XL10                DATE, REFERENCE, SUB                         
         ORG   OLDCCMP                                                          
OLDCDTL  DS    CL25                CONTRA AND DETAIL                            
*                                                                               
         DS    0D                                                               
NEWKEY   DC    XL42'00'            NEW KEY                                      
         ORG   NEWKEY                                                           
NEWCMP   DS    XL1                 COMPANY                                      
NEWUL    DS    CL2                 UNIT LEDGER                                  
NEWCC    DS    CL3                 CLIENT CODE                                  
NEWPC    DS    CL3                 PRODUCT CODE                                 
NEWMC    DS    CL1                 MEDIA CODE                                   
NEWJC    DS    CL5                 JOB CODE                                     
         ORG   NEWCC                                                            
NEWACC   DS    CL12                ACCOUNT                                      
         ORG   NEWUL                                                            
NEWULA   DS    CL14                U/L ACCOUNT                                  
         ORG   NEWCMP                                                           
NEWULC   DS    CL15                CPY/UL/ACC                                   
NEWOFF   DS    CL2                 OFFICE                                       
         ORG   NEWOFF                                                           
NEWWC    DS    CL2                 WORKCODE                                     
NEWCCMP  DS    XL1                 CONTRA COMPAMY                               
NEWCUL   DS    CL2                 CONTRA U/L                                   
NEWCCC   DS    CL3                 CLIENT CODE                                  
NEWCPC   DS    CL3                 PRODUCT CODE                                 
NEWCMC   DS    CL1                 MEDIA CODE                                   
NEWCJC   DS    CL5                 JOB CODE                                     
         ORG   NEWCCC                                                           
NEWCACC  DS    CL12                CONTRA ACCOUNT                               
         ORG   NEWCUL                                                           
NEWCULA  DS    CL14                CONTRA U/L ACCOUNT                           
         ORG   NEWCCMP                                                          
NEWCULC  DS    CL15                CONTRA CPY/UL/AC                             
NEWDTRFS DS    XL10                DATE, REFERENCE, SUB                         
         ORG   NEWCCMP                                                          
NEWCDTL  DS    CL25                CONTRA AND DETAIL                            
*                                                                               
KEYWRK   DS    CL(KEYCLNQ)         KEY CHANGE FILE                              
ELEMENT  DC    XL255'00'                                                        
*                                                                               
ACTSTA   DC    X'00'               ACCOUNT STATUS                               
ACTSDEL  EQU   X'80'               ACCOUNT IS DELETED                           
*                                                                               
RECSTA   DC    X'00'               RECORD STATUS                                
RECTRN   EQU   X'80'               TREAT AS TRANSACTION RECORD                  
*                                                                               
DMCB     DC    6F'0'                                                            
FULL     DC    F'0'                                                             
DUB      DC    D'0'                                                             
HALF     DC    H'0'                                                             
BYTE     DC    X'00'                                                            
WORK     DC    CL100' '                                                         
*                                                                               
CARDH    DS    XL8                 HEADER FOR CARD                              
         ORG   CARDH                                                            
         DC    AL1(L'CARDH+L'CARDIO)                                            
         DC    XL4'00'                                                          
         DC    AL1(L'CARDIO)                                                    
         DC    XL2'00'                                                          
CARDIO   DC    CL80' '                                                          
*                                                                               
KEYSTRT  DC    XL42'00'                                                         
KEYEND   DC    42X'FF'                                                          
*                                                                               
SENUM    DS    XL1                 SE NUMBER                                    
DKEY     DS    CL42                                                             
DIR      DS    CL60                                                             
DA       DS    F                                                                
DAOUT    DS    CL11                DA=XXXXXXXX                                  
*                                                                               
DMWORK   DC    24F'0'                                                           
DMBYTE   DC    X'00'                                                            
SPACE    DC    CL132' '                                                         
*                                                                               
UTL      DC    F'0',X'0A'                                                       
         ORG   UTL+4                                                            
SE       DS    X                                                                
*                                                                               
ACCDIR   DC    C'ACCDIR '                                                       
ACCMST   DC    C'ACCMST '                                                       
DMREAD   DC    C'DMREAD '                                                       
DMRDHI   DC    C'DMRDHI '                                                       
DMRSEQ   DC    C'DMRSEQ '                                                       
DMRWRT   DC    C'DMWRT  '                                                       
GETREC   DC    C'GETREC '                                                       
PUTREC   DC    C'PUTREC '                                                       
ADDREC   DC    C'ADDREC '                                                       
OPEN     DC    C'OPEN   '                                                       
CONTROL  DC    C'CONTROL'                                                       
CTFILE   DC    C'CTFILE '                                                       
CTFILEL  DC    C'NCTFILE X'                                                     
ACCOUNT  DC    C'ACCOUNT'                                                       
ACFILEL  DC    C'NACCDIR NACCMST X'                                             
*                                                                               
INPUT    DC    AL1(TAPE)                                                        
DISKI    EQU   X'80'                                                            
TAPE     EQU   X'40'                                                            
START    EQU   X'08'                                                            
NEXT     EQU   X'01'                                                            
*                                                                               
NFLS     DC    X'01'               NUMBER OF INPUT FILES                        
*                                                                               
         DS    0F                                                               
DMPL1    DC    VL4(ACNV00),X'00',VL3(DUMMY)   BASE                              
DMPL2    DC    AL4(0),X'80',AL3(0)                                              
DMPL3    DC    AL4(0),X'80',AL3(0)                                              
DMPN     EQU   (*-DMPL1)/8                                                      
*                                                                               
LGRTYP   DC    X'00'               LEDGER TYPE                                  
LTPROD   EQU   X'80'               PRODUCTION                                   
LTPCON   EQU   X'40'               PROJECT CONTROL                              
LTMPAY   EQU   X'20'               MEDIA PAYABLE                                
LTPPAY   EQU   X'10'               PRODUCTION PAYABLE                           
LTXPAY   EQU   X'08'               EXPENSE PAYABLE                              
LTRECV   EQU   X'04'               RECEIVABLE LEDGER                            
CLGTYP   DC    X'00'               CONTRA LEDGER TYPE                           
*                                                                               
PMOS     DC    XL2'00'                                                          
*                                                                               
COMPDSP  DC    X'00'               DISPLACMENT TO COMPANY CODE                  
ALPHA    DC    C'  '               ALPHA CODE                                   
COMPANY  DC    X'00'               HEXCOMP OF MAIN AGENCY                       
COMPNME  DC    CL36' '             COMPANY NAME                                 
COMPSTA  DC    X'00'               COMPANY STATUS                               
COMPNOFF EQU   X'80'               COMPANY IS ON NEW OFFICES                    
COMPOTON EQU   X'40'               CONVERTING FROM OLD TO NEW                   
*                                                                               
XCOPMRG  DS    0XL4                COPY/MERGE                                   
XALPHA   DC    C'  '               ALPHA CODE OF COPIED/MERGED                  
XCOMPANY DC    X'00'               HEXCOMP OF COPIED/MERGED                     
XSTAT    DC    X'00'               STATUS                                       
XSTAMRG  EQU   X'80'               MERGE                                        
XSTACOP  EQU   X'40'               COPY                                         
*                                                                               
XTABL    EQU   (5*L'XCOPMRG)       LENGTH OF COPY MERGE TABLE                   
XTAB     DC    XL(XTABL+1)'00'     TABLE OF COPY/MERGE COMPANIES                
*                                                                               
CURCOMP  DC    X'00'               COMPANY CODE OF CURRENT RECORD               
LOCOMP   DC    X'00'               LOW COMPANY CODE                             
HICOMP   DC    X'00'               HIGH COMPANY CODE                            
LKCOMP   DC    X'00'               THE 'NEW' LINKED COMPANY                     
*                                                                               
OUTPUT   DC    XL1'00'             OUTPUT                                       
DISKO    EQU   X'80'               OUTPUT=DISK                                  
WRTNO    EQU   X'40'               WRITE=NO                                     
CHNGO    EQU   X'20'               OUTPUT RECORD HAS CHANGE                     
DIRO     EQU   X'10'               CREATE TEST DIRECTORY                        
TEST     EQU   X'08'               ONLY OUTPUT THE TEST AGENCY                  
*                                                                               
SAVTYP   DC    X'00'               SAVE RECORD TYPE                             
RECTYP   DC    X'00'               RECORD TYPE                                  
*                                                                               
ACTNSW   DC    X'00'               ACTION                                       
ACTNCON  EQU   1                   FILE CONVERSION                              
ACTNMRG  EQU   2                   ACCOUNT MERGE                                
ACTNKEY  EQU   3                   TRANSACTION KEY SORT                         
ACTNCHG  EQU   4                   ACCOUNT/DATA CHANGE                          
*                                                                               
OPTSW    DC    X'00'               OPTIONS                                      
STRIPES  EQU   X'80'               STRIPES - PRINT STRIPES                      
NOANAL   EQU   X'40'               NOANAL  - DON'T CONVERT ANALYSIS             
NOLIST   EQU   X'20'               NOLIST  - DO PRINT OUTPUT REPORTS            
*                                                                               
CNVSW    DC    X'00'               CONVERSION CONTROL                           
CNVSOF   EQU   X'80'               CONVERT OFFICES                              
CNVSAC   EQU   X'40'               CONVERT ACCOUNTS                             
CNVSCO   EQU   X'20'               CONVERT CLIENT OFFICE                        
CNVSBS   EQU   X'10'               BILLING SOURCE                               
CNVSNP   EQU   CNVSOF+CNVSAC+CNVSCO+CNVSBS NON-PROD CONVERSION                  
CNVSWC   EQU   X'08'               CONVERT WORKCODES                            
CNVSMC   EQU   X'04'               CONVERT MEDIA CODES                          
CNVSCC   EQU   X'02'               CONVERT CLIENT CODES                         
CNVSPR   EQU   CNVSWC+CNVSMC+CNVSCC PROD CONVERSION                             
*                                                                               
MODE     DC    X'00'               PROCESSING MODE                              
PROCBFR  EQU   1                   PROCESS BEFORE CONVERT                       
PROCAFT  EQU   2                   PROCESS AFTER  CONVERT                       
CHNGCMP  EQU   3                   CHANGE COMPANY CODE                          
MRGEPRO  EQU   4                   MERGE PROFILES                               
PROCCPY  EQU   5                   PROCESS COPY RECORD                          
CHNGACC  EQU   6                   CHANGE ACCOUNT CODE                          
CHNGELM  EQU   7                   CHANGE ELEMENT ITEM                          
PROCOUT  EQU   8                   PROCESS FINAL OUTPUT                         
INITTAB  EQU   9                   INITIALIZE TABLES                            
*                                                                               
ERRNUM   DC    X'00'               ERROR NUMBER                                 
ERROFF   EQU   1                   OFFICE                                       
ERRACC   EQU   2                   ACCOUNT                                      
ERRCLI   EQU   3                   CLIENT                                       
ERRMED   EQU   4                   MEDIA                                        
ERRWRK   EQU   5                   WORKCODE                                     
ERRCLO   EQU   6                   CLIENT OFFICE                                
ERRBLS   EQU   7                   BILLING SOURCE                               
ERRCAC   EQU   8                   CONTRA ACCOUNT                               
ERRACE   EQU   9                   ACCOUNT IN ELEMENT                           
ERROFE   EQU   10                  OFFICE  IN ELEMENT                           
*                                                                               
ERRKEY   EQU   X'80'               ERROR IN KEY                                 
ERRCON   EQU   X'40'               ERROR IN CONTRA                              
ERRELM   EQU   X'20'               ERROR IN ELEMENT                             
ERRIGN   EQU   X'08'               DON'T COUNT IT                               
*                                                                               
ERRCB    DC    XL30'00'            ERROR CONTROL BLOCK                          
         ORG   ERRCB+(ERROFF*2)    OFFICE                                       
         DC    AL1(BUFTOFF),AL1(ERRKEY)                                         
         ORG   ERRCB+(ERRACC*2)    ACCOUNT                                      
         DC    AL1(BUFTACC),AL1(ERRKEY)                                         
         ORG   ERRCB+(ERRCLI*2)    CLIENT                                       
         DC    AL1(BUFTCLI),AL1(ERRKEY)                                         
         ORG   ERRCB+(ERRMED*2)    MEDIA                                        
         DC    AL1(BUFTMED),AL1(ERRKEY)                                         
         ORG   ERRCB+(ERRWRK*2)    WORKCODE                                     
         DC    AL1(BUFTWRK),AL1(ERRKEY)                                         
         ORG   ERRCB+(ERRCLO*2)    CLIENT OFFICE                                
         DC    AL1(BUFTCLO),AL1(ERRKEY)                                         
         ORG   ERRCB+(ERRBLS*2)    BILLING SOURCE                               
         DC    AL1(BUFTBLS),AL1(ERRKEY)                                         
         ORG   ERRCB+(ERROFE*2)    OFFICE CODE IN ELEMENT                       
         DC    AL1(BUFTOFF),AL1(ERRELM)                                         
         ORG   ERRCB+(ERRCAC*2)    CONTRA ACCOUNT                               
         DC    AL1(BUFTACC),AL1(ERRCON)                                         
         ORG   ERRCB+(ERRACE*2)    ACCOUNT CODE IN ELEMENT                      
         DC    AL1(BUFTACC),AL1(ERRELM)                                         
         ORG   ERRCB+L'ERRCB                                                    
*                                                                               
ITEMERR  DC    C'N'                ANY ERRORS ON THIS ITEM                      
DUPERR   DC    X'00'               DUPLICATE KEY ERROR(SEE CNVSW)               
*                                                                               
LASTACT  DC    XL15'00'                                                         
*                                                                               
BUFREC   DS    0X                  BUFFALO RECORDS FOR ERRORS                   
BUFRTYP  DC    X'00'               RECORD TYPE                                  
BUFETYP  DC    X'00'               ERROR TYPE                                   
BUFTOFF  EQU   1                   OFFICE                                       
BUFTACC  EQU   2                   ACCOUNT                                      
BUFTCLI  EQU   3                   CLIENT                                       
BUFTMED  EQU   4                   MEDIA                                        
BUFTWRK  EQU   5                   WORKCODE                                     
BUFTCLO  EQU   6                   CLIENT/OFFICE                                
BUFTBLS  EQU   7                   BILLING SOURCE                               
BUFDATA  DC    CL14' '             SEARCH ARGUMENT                              
BUFKLNQ  EQU   *-BUFREC                                                         
BUFBUCK  DS    0XL(4*3)            4 BYTE BINARY ACCUMS                         
BUFBACC  DC    XL4'00'             IN ACCOUNT                                   
         ORG   BUFBACC                                                          
BUFBKEY  DC    XL4'00'             IN KEY                                       
BUFBCON  DC    XL4'00'             IN CONTRA                                    
BUFBELM  DC    XL4'00'             IN ELEMENT                                   
BUFRLNQ  EQU   *-BUFREC                                                         
*                                                                               
SRCHFLG  DS    XL1                 SEARCH FLAG                                  
SRCHIGN  EQU   X'80'               IGNORE SEARCH ERROR                          
SRCHTRC  EQU   X'40'               TRACE SEARCH                                 
         DS    XL9                 N/D                                          
*                                                                               
CNTS     DS    0CL30                                                            
CNTCPY   DC    PL5'0',CL25'NEW FILE COPIED IN       '                           
CNTIN    DC    PL5'0',CL25'INPUT RECORDS            '                           
CNTACC   DC    PL5'0',CL25'ACCOUNT FILE OUTPUT      '                           
CNTTRN   DC    PL5'0',CL25'TRANSACTION FILE         '                           
CNTOTH   DC    PL5'0',CL25'OUTPUT OTHERS            '                           
CNTOUT   DC    PL5'0',CL25'TOTAL OUTPUT             '                           
CNTDEL   DC    PL5'0',CL25'DELETED RECORDS          '                           
CNTKFL   DC    PL5'0',CL25'KEY FILE RECORDS         '                           
CNTERR   DC    PL5'0',CL25'ERRORS                   '                           
CNTNOF   DC    PL5'0',CL25'BAD TRANSACTION OFFICE   '                           
         DC    PL5'0',CL25'                         '                           
         DC    PL5'0',CL25'                         '                           
CNTHK1   DC    PL5'0',CL25'                         '                           
CNTHK2   DC    PL5'0',CL25'                         '                           
CNTHK3   DC    PL5'0',CL25'                         '                           
         DC    X'FF'                                                            
*                                                                               
MAXERR   DC    F'0'                MAX ERRORS TO PRINT                          
MAXKFL   DC    F'0'                MAX KEY FILE RECORDS                         
*                                                                               
PDMP     DS    0F                  PRNTBL PARAMETERS                            
PDMP1    DS    F                                                                
         ORG   PDMP1                                                            
PDMPLC   DC    AL1(L'PCAPTION)     LENGTH OF CAPTION                            
PDMPAC   DC    AL3(PCAPTION)       ADDRESS OF CAPTION                           
PDMP2    DS    F                                                                
         ORG   PDMP2                                                            
PDMPREC  DC    AL4(0)              ADDRESS OF RECORD                            
PDMP3    DS    CL4                                                              
         ORG   PDMP3                                                            
PDMPDMP  DC    C'DUMP'             CONSTANT                                     
PDMP4    DS    F                                                                
         ORG   PDMP4                                                            
PDMPLREC DC    AL4(0)              LENGTH OF RECORD                             
PDMP5    DS    F                                                                
         ORG   PDMP5                                                            
PDMP2D   DC    AL4(P2D)            CONSTANT A(2D)                               
PDMP6    DS    F                                                                
         ORG   PDMP6                                                            
PDMPP    DC    C'P'                CONSTANT 'P'                                 
PDMPPRT  DC    VL3(PRINT)          A(PRINT)                                     
*                                                                               
PCAPTION DS    CL60                                                             
         ORG   PCAPTION                                                         
PCAP1    DC    CL8' '              RECORD EQUATE                                
         DC    C' '                                                             
PCAP2    DC    CL8' '              ACTION(INPUT/OUTPUT/NEW/COPIED)              
         DC    C' '                                                             
PCAP3    DC    CL30' '             RECORD LONG NAME                             
         DC    C' '                                                             
PCAP4    DC    CL11' '             DA=XXXXXXXX                                  
P2D      DC    C'2D'                                                            
*                                                                               
ALL      EQU   X'FF'                                                            
EOT      EQU   X'FF'                                                            
EFFS     DC    X'FFFFFFFFFFFFFF'                                                
PONE     DC    P'1'                                                             
FONE     DC    F'1'                                                             
*                                                                               
DFLTOFF  DC    CL2' '              DEFAULT OFFICE                               
*                                                                               
TRCCNT   DC    X'00'               ERRORS IN BLOCK                              
TRCBLK   DC    CL110' '            ERROR TRACE BLOCK                            
TRCNEXT  DC    A(0)                A(NEXT TRACE AREA)                           
*                                                                               
ACCERSW  DC    X'00'                                                            
SUPACER  EQU   X'80'               SUPPRESS ACCOUNTS NOT ON FILE                
*                                                                               
CCNTL    DC    X'00'               COPY CONTROL                                 
CCNTLS   EQU   X'80'               COPY START/END CARDS INPUT                   
CCNTLM   EQU   X'08'               COPY START/END MODE                          
*                                                                               
CKEYSTRT DC    XL42'00'            COPY START KEY                               
CKEYEND  DC    42X'FF'             COPY END KEY                                 
*                                                                               
OLD1RLVS DC    XL4'00'              OLD 1R LENGTHS                              
NEW1RLVS DC    XL4'00'              NEW 1R LENGTHS                              
*                                                                               
PARCTAB  DC    A(0)                A(PARSE CONTROL TABLE)                       
PARINP   DC    A(0)                A(1R INPUT DATA)                             
PAROUT   DC    A(0)                A(1R OUTPUT DATA)                            
*                                                                               
TRCARG   DC    CL14' '             TRACE SEARCHES OF THIS DATA                  
TRCARGN  DC    PL2'0'              COUNT THE DUMPS                              
