*          DATA SET ACOFFBUFF  AT LEVEL 001 AS OF 04/24/89                      
OFFBLEN  DS    XL2                 ACTUAL LENGTH OF ENTRY (ZERO=E-O-B)          
OFFBCODE DS    CL2                 OFFICE CODE                                  
OFFBINDS DS    XL1                 OFFICE INDICATORS                            
OFFBILST EQU   X'80'               OFFICE IS AN OFFICE LIST                     
OFFBSHRT DS    CL12                OFFICE SHORT NAME                            
OFFBNAME DS    CL36                OFFICE (LONG) NAME                           
OFFBLENQ EQU   *-OFFBLEN           MINIMUM LENGTH OF ENTRY                      
OFFBNUM  DS    XL1                 OFFICE LIST ENTRIES                          
OFFBLIST DS    256CL2              OFFICE LIST (ZERO=E-O-L)                     
OFFBMAXL EQU   *-OFFBLEN           MAXIMUM LENGTH OF ENTRY                      
