*          DATA SET ACOPTTAB   AT LEVEL 056 AS OF 07/01/20                      
* OPTION TABLE - COVERED BY OPTBD (ACOPTTABD)                                   
*                                                                               
         DS    0D                                                               
OPTTAB   DS    0CL(OPTBL)                                                       
*                                                                               
         DC    AL1(OPNCOM),X'00'                                                
         DC    CL27'AGENCY COMMISSION RATE     ',CL3'COM'                       
         DC    X'04',CL8'COMRATE',X'00'                                         
         DC    Y(GOAGYCOM-GOPTIONS),AL1(L'GOAGYCOM)                             
         DC    AL1(1,1)                                                         
         DC    B'11111111',X'00'                                                
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNUNBWC),X'00'                                              
         DC    CL27'UNBILLABLE WORK CODE LIST  ',CL3'UWC'                       
         DC    X'04',CL8'UNBILLWC',X'00'                                        
         DC    Y(GOUWLIST-GOPTIONS),AL1(L'GOUWLIST)                             
         DC    AL1(2,2)                                                         
         DC    B'11111100',X'00'                                                
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNBT),X'00'                                                 
         DC    CL27'BILLING TYPE               ',CL3'BT '                       
         DC    X'05',CL8'BILLTYPE',X'00'                                        
         DC    Y(GOBILTYP-GOPTIONS),AL1(L'GOBILTYP+12)                          
         DC    AL1(3,3)                                                         
         DC    B'11111100',X'00'                                                
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNDUE),AL1(OPTBZERO)                                        
         DC    CL27'NUMBER OF DAYS BILL DUE    ',CL3'DUE'                       
         DC    X'04',CL8'DUEDAYS',X'00'                                         
         DC    Y(GODUEDAY-GOPTIONS),AL1(L'GODUEDAY)                             
         DC    AL1(4,4)                                                         
         DC    B'11111100',X'00'                                                
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNOVPER),X'00'                                              
         DC    CL27'MAX PERCENT OF ESTIMATE    ',CL3'MPE'                       
         DC    X'05',CL8'OVERPER',X'00'                                         
         DC    Y(GOOVRPER-GOPTIONS),AL1(L'GOOVRPER)                             
         DC    AL1(10,10)                                                       
         DC    B'11111100',X'00'                                                
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNOVAMT),X'00'                                              
         DC    CL27'MAX $AMOUNT OVER ESTIMATE  ',CL3'MAE'                       
         DC    X'05',CL8'OVERAMT',X'00'                                         
         DC    Y(GOOVRAMT-GOPTIONS),AL1(L'GOOVRAMT)                             
         DC    AL1(5,5)                                                         
         DC    B'11111100',X'00'                                                
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNEEDES),X'00'                                              
         DC    CL27'ESTIMATE NEEDED FOR BILLS? ',CL3'ENB'                       
         DC    X'04',CL8'ESTNEED',X'00'                                         
         DC    Y(GONEEDES-GOPTIONS),AL1(L'GONEEDES)                             
         DC    AL1(6,6)                                                         
         DC    B'11111100',X'00'                                                
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNMIN),X'00'                                                
         DC    CL27'MINIMUM BILL AMOUNT        ',CL3'MIN'                       
         DC    X'04',CL8'MINBILL',X'00'                                         
         DC    Y(GOMINBIL-GOPTIONS),AL1(L'GOMINBIL)                             
         DC    AL1(5,5)                                                         
         DC    B'11111100',X'00'                                                
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNCLSUM),X'00'                                              
         DC    CL27'PRINT CLT SUMMARY ON BILLS?',CL3'CSU'                       
         DC    X'04',CL8'CLISUM',X'00'                                          
         DC    Y(GOCLISUM-GOPTIONS),AL1(L'GOCLISUM)                             
         DC    AL1(6,6)                                                         
         DC    B'11111100',B'00001100'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNPRSUM),X'00'                                              
         DC    CL27'PRINT PRO SUMMARY ON BILLS?',CL3'PSU'                       
         DC    X'04',CL8'PROSUM',X'00'                                          
         DC    Y(GOPROSUM-GOPTIONS),AL1(L'GOPROSUM)                             
         DC    AL1(6,6)                                                         
         DC    B'00011100',B'00000100'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNDET),X'00'                                                
         DC    CL27'SHOW DETAIL LINES ON BILLS?',CL3'DET'                       
         DC    X'04',CL8'DETAIL',X'00'                                          
         DC    Y(GOBILDET-GOPTIONS),AL1(L'GOBILDET)                             
         DC    AL1(6,6)                                                         
         DC    B'11111100',B'00001100'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNWCNES),X'00'                                              
         DC    CL27'SHOW WORKCODE ON EST BILLS?',CL3'WCE'                       
         DC    X'04',CL8'WCEST',X'00'                                           
         DC    Y(GOWCONES-GOPTIONS),AL1(L'GOWCONES)                             
         DC    AL1(7,50)                                                        
         DC    B'11111100',B'00001100'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNCD),X'00'                                                 
         DC    CL27'PASS CASH DISC. TO CLIENT? ',CL3'CD '                       
         DC    X'04',CL8'CDPASS',X'00'                                          
         DC    Y(GOCLICD-GOPTIONS),AL1(L'GOCLICD)                               
         DC    AL1(6,6)                                                         
         DC    B'11111100',B'00001100'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNET),X'00'                                                 
         DC    CL27'PAYMENTS ARE NET?          ',CL3'NET'                       
         DC    X'04',CL8'PAYNET',X'00'                                          
         DC    Y(GOPAYNET-GOPTIONS),AL1(L'GOPAYNET)                             
         DC    AL1(6,6)                                                         
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNSUPAG),X'00'                                              
         DC    CL27'NET PAYMENTS-NO COMMISSION?',CL3'NNC'                       
         DC    X'04',CL8'NETNOCOM',X'00'                                        
         DC    Y(GOSUPAGY-GOPTIONS),AL1(L'GOSUPAGY)                             
         DC    AL1(6,6)                                                         
         DC    B'11111100',B'00001100'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNAUTTA),X'00'                                              
         DC    CL27'AUTO ESTIMATE TURN-AROUND? ',CL3'ETA'                       
         DC    X'04',CL8'ESTTA   ',X'00'                                        
         DC    Y(GOAUTOTA-GOPTIONS),AL1(L'GOAUTOTA)                             
         DC    AL1(6,6)                                                         
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNZERO),X'00'                                               
         DC    CL27'ZERO BILLINGS AMOUNT?      ',CL3'ZBA'                       
         DC    X'04',CL8'ZEROB   ',X'00'                                        
         DC    Y(GOZERO-GOPTIONS),AL1(L'GOZERO)                                 
         DC    AL1(6,6)                                                         
         DC    B'11111100',B'00011100'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNESCM),X'00'                                               
         DC    CL27'EST BILLS COMMISSIONABLE?  ',CL3'ECO'                       
         DC    X'04',CL8'ESTCOMM ',X'00'                                        
         DC    Y(GOESTCOM-GOPTIONS),AL1(L'GOESTCOM)                             
         DC    AL1(6,6)                                                         
         DC    B'11111100',B'00001100'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNEWJUN),X'00'                                              
         DC    CL27'JOBS=UNAPPROVED (OLD EST)  ',CL3'UNA'                       
         DC    X'04',CL8'UNAPPROV',X'00'                                        
         DC    Y(GONEWJUN-GOPTIONS),AL1(L'GONEWJUN)                             
         DC    AL1(6,6)                                                         
         DC    B'11111100',B'00001100'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNAUTUN),X'00'                                              
         DC    CL27'AUTO UNHOLD WHEN BILLING?  ',CL3'UNH'                       
         DC    X'04',CL8'UNHOLD  ',X'00'                                        
         DC    Y(GOAUTOUN-GOPTIONS),AL1(L'GOAUTOUN)                             
         DC    AL1(6,6)                                                         
         DC    B'11111100',B'00001100'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNEWBT),X'00'                                               
         DC    CL27'NEW BILL TYPE FOR %EST     ',CL3'NBT'                       
         DC    X'04',CL8'NEWBILL ',X'00'                                        
         DC    Y(GONEWBT-GOPTIONS),AL1(L'GONEWBT)                               
         DC    AL1(8,8)                                                         
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNFILT2),X'00'                                              
         DC    CL27'FILT2 WHEN TYPE 47 BILLED  ',CL3'FI2'                       
         DC    X'04',CL8'FILT2   ',X'00'                                        
         DC    Y(GOFILT2-GOPTIONS),AL1(L'GOFILT2)                               
         DC    AL1(7,7)                                                         
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNGST),X'00'                                                
         DC    CL27'GST OUTPUT TYPE CODE       ',CL3'GST'                       
         DC    X'04',CL8'GSTCODE ',X'00'                                        
         DC    Y(GOTAXCOD-GOPTIONS),AL1(L'GOTAXCOD)                             
         DC    AL1(7,20)                                                        
         DC    B'11111111',B'00000100'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNSUPST),X'00'                                              
         DC    CL27'SUPPRESS STICKY LABELS?    ',CL3'LAB'                       
         DC    X'04',CL8'SUPLAB  ',X'00'                                        
         DC    Y(GOSUPSTI-GOPTIONS),AL1(L'GOSUPSTI)                             
         DC    AL1(7,45)                                                        
         DC    B'11111100',B'00001100'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNAUADD),X'00'                                              
         DC    CL27'DAYS FOR AUTO JOB CLOSE    ',CL3'AUT'                       
         DC    X'05',CL8'AUTOCLOS',X'00'                                        
         DC    Y(GOAUTADD-GOPTIONS),AL1(L'GOAUTADD)                             
         DC    AL1(11,11)                                                       
         DC    B'11111100',B'00001100'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNSCH),X'00'                                                
         DC    CL27'SCHEME FOR ESTIMATING      ',CL3'SCH'                       
         DC    X'03',CL8'SCHEME  ',X'00'                                        
         DC    Y(GOSCHEME-GOPTIONS),AL1(L'GOSCHEME)                             
         DC    AL1(07,12)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNAUTO),AL1(0)                                              
         DC    CL27'AUTO JOB NUMBERING         ',CL3'AJN'                       
         DC    X'04',CL8'AUTO    ',X'00'                                        
         DC    Y(GOAUTNUM-GOPTIONS),AL1(L'GOAUTNUM)                             
         DC    AL1(6,6)                                                         
         DC    B'11111000',B'00000100'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPN1LBIL),X'00'                                              
         DC    CL27'1-LINE PER WRK CD ON BILLS?',CL3'1LB'                       
         DC    X'05',CL8'1LINBILL',X'00'                                        
         DC    Y(GO1LINBL-GOPTIONS),AL1(L'GO1LINBL)                             
         DC    AL1(06,06)                                                       
         DC    B'00000011',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPN1LP1),X'00'                                               
         DC    CL27'1-LINE PER WRK CD ON P1?   ',CL3'1LP'                       
         DC    X'05',CL8'1LINP1  ',X'00'                                        
         DC    Y(GO1LINP1-GOPTIONS),AL1(L'GO1LINP1)                             
         DC    AL1(06,06)                                                       
         DC    B'00000011',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNPST),X'00'                                                
         DC    CL27'PST PROVINCE/OUTPUT CODE   ',CL3'PST'                       
         DC    X'04',CL8'PSTOPTS ',X'00'                                        
         DC    Y(GOPSTOPT-GOPTIONS),AL1(L'GOPSTOPT)                             
         DC    AL1(12,41)                                                       
         DC    B'11111111',B'00000100'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNWKTY),X'00'                                               
         DC    CL27'WORKCODE TYPE              ',CL3'WKT'                       
         DC    X'04',CL8'WORKTYP ',X'00'                                        
         DC    Y(GOWRKTY-GOPTIONS),AL1(L'GOWRKTY)                               
         DC    AL1(07,42)                                                       
         DC    B'11111111',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNMAT),X'00'                                                
         DC    CL27'MATERIAL CODE              ',CL3'MAT'                       
         DC    X'03',CL8'MATERIAL',X'00'                                        
         DC    Y(GOMAT-GOPTIONS),AL1(L'GOMAT)                                   
         DC    AL1(07,17)                                                       
         DC    B'00000011',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPN99S),X'00'                                                
         DC    CL27'SUPPRESS PREVIOUS BILLING  ',CL3'S99'                       
         DC    X'03',CL8'SUPPRESS',X'00'                                        
         DC    Y(GOSUP99S-GOPTIONS),AL1(L'GOSUP99S)                             
         DC    AL1(06,06)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNEDI),X'00'                                                
         DC    CL27'EDI ELIGIBLE?              ',CL3'EDI'                       
         DC    X'03',CL8'EDI ELIG',X'00'                                        
         DC    Y(GOEDI-GOPTIONS),AL1(L'GOEDI)                                   
         DC    AL1(06,06)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNDIST),AL1(0)                                              
         DC    CL27'DISTRIBUTION SCHEME CODE   ',CL3'DIS'                       
         DC    X'03',CL8'DISTRIB ',X'00'                                        
         DC    Y(GODIST-GOPTIONS),AL1(L'GODIST)                                 
         DC    AL1(13,13)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNEEDAE),X'00'                                              
         DC    CL27'NEED APPROVED EST. TO BILL ',CL3'NAE'                       
         DC    X'03',CL8'NEEDAPP ',X'00'                                        
         DC    Y(GONEEDAE-GOPTIONS),AL1(L'GONEEDAE)                             
         DC    AL1(06,06)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNBFUN),X'00'                                               
         DC    CL27'NEED JOB FUNDING TO BILL',CL3'NJF'                          
         DC    X'03',CL8'NEEDFUN ',X'00'                                        
         DC    Y(GOBILFUN-GOPTIONS),AL1(L'GOBILFUN)                             
         DC    AL1(06,06)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNPAB),AL1(OPTBEXT)                                         
         DC    CL27'PRINT AUTHORIZATION ON BILL',CL3'PAB'                       
         DC    X'03',CL8'PRNTAUTH',X'00'                                        
         DC    Y(GOPAB-GOXBLOCK),AL1(L'GOPAB)                                   
         DC    AL1(06,06)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNANT),AL1(OPTBEXT)                                         
         DC    CL27'AUTHORIZATION NUMBER TITLE',CL3'ANT'                        
         DC    X'03',CL8'AUTHTITL',X'00'                                        
         DC    Y(GOANT-GOXBLOCK),AL1(L'GOANT)                                   
         DC    AL1(07,07)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNESTYP),X'00'                                              
         DC    CL27'ESTIMATE TYPE FOR NEW JOBS ',CL3'ETY'                       
         DC    X'03',CL8'ESTTYPE ',X'00'                                        
         DC    Y(GOESTTYP-GOPTIONS),AL1(L'GOESTTYP)                             
         DC    AL1(07,15)                                                       
         DC    B'11111100',B'00000100'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNPROD),X'00'                                               
         DC    CL27'PRODUCTION JOBS OK TO ADD? ',CL3'PRO'                       
         DC    X'04',CL8'PRODPAK ',X'00'                                        
         DC    Y(GOPROD-GOPTIONS),AL1(L'GOPROD)                                 
         DC    AL1(06,06)                                                       
         DC    B'11110000',B'00001000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNJG),X'00'                                                 
         DC    CL27'JOB GROUP                  ',CL3'JG '                       
         DC    X'03',CL8'JOBGROUP',X'00'                                        
         DC    Y(GOJG-GOPTIONS),AL1(L'GOJG)                                     
         DC    AL1(07,17)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNTBC),X'00'                                                
         DC    CL27'BILLING COMMISSION ACCOUNT ',CL3'BCA'                       
         DC    X'04',CL8'BILCOMAC',X'00'                                        
         DC    Y(GOTBC-GOPTIONS),AL1(L'GOTBC)                                   
         DC    AL1(15,18)                                                       
         DC    B'11111100',B'00011100'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNADDP),AL1(OPTBZERO)                                       
         DC    CL27'ADD P''S (1-9) AT JOB ADD  ',CL3'ADP'                       
         DC    X'04',CL8'ADDP    ',X'00'                                        
         DC    Y(GOADDPLN-GOPTIONS),AL1(L'GOADDPLN)                             
         DC    AL1(4,21)                                                        
         DC    B'11111100',B'00000100'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNADDR),AL1(0)                                              
         DC    CL27'ADD R1 WHEN ADDING JOB?    ',CL3'ADR'                       
         DC    X'04',CL8'ADDR    ',X'00'                                        
         DC    Y(GOADDREV-GOPTIONS),AL1(L'GOADDREV)                             
         DC    AL1(6,6)                                                         
         DC    B'11111100',B'00000100'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNESTRE),AL1(OPTBEXT)                                       
         DC    CL27'ESTIMATE REPORT DEFAULT    ',CL3'ER '                       
         DC    X'06',CL8'ESTREP  ',X'00'                                        
         DC    Y(GOESTREP-GOXBLOCK),AL1(L'GOESTREP)                             
         DC    AL1(7,22)                                                        
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNTXTSC),AL1(OPTBEXT)                                       
         DC    CL27'TEXT SCROLLING SEQUENCE    ',CL3'TXS'                       
         DC    X'05',CL8'TEXTSCR ',X'00'                                        
         DC    Y(GOTXTSCR-GOXBLOCK),AL1(L'GOTXTSCR)                             
         DC    AL1(16,23)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNETIP),AL1(OPTBPAN)                                        
         DC    CL27'ESTIMATE TITLE PANEL       ',CL3'ET '                       
         DC    X'05',CL8'ESTTIPAN',X'00'                                        
         DC    Y(GOPANETI-GOPANBLK),AL1(L'GOPANETI)                             
         DC    AL1(07,14)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNESTP),AL1(OPTBPAN)                                        
         DC    CL27'ESTIMATE SUB-TITLE PANEL   ',CL3'EST'                       
         DC    X'05',CL8'ESTSTPAN',X'00'                                        
         DC    Y(GOPANEST-GOPANBLK),AL1(L'GOPANEST)                             
         DC    AL1(07,14)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNEHDP),AL1(OPTBPAN)                                        
         DC    CL27'ESTIMATE HEADER PANEL      ',CL3'EH '                       
         DC    X'05',CL8'ESTHDPAN',X'00'                                        
         DC    Y(GOPANEHD-GOPANBLK),AL1(L'GOPANEHD)                             
         DC    AL1(07,14)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNESHP),AL1(OPTBPAN)                                        
         DC    CL27'ESTIMATE SUB-HEADER PANEL  ',CL3'ESH'                       
         DC    X'05',CL8'ESTSHPAN',X'00'                                        
         DC    Y(GOPANESH-GOPANBLK),AL1(L'GOPANESH)                             
         DC    AL1(07,14)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNEFTP),AL1(OPTBPAN)                                        
         DC    CL27'ESTIMATE FOOTER PANEL      ',CL3'EF '                       
         DC    X'05',CL8'ESTFTPAN',X'00'                                        
         DC    Y(GOPANEFT-GOPANBLK),AL1(L'GOPANEFT)                             
         DC    AL1(07,14)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNESFP),AL1(OPTBPAN)                                        
         DC    CL27'ESTIMATE SUB-FOOTER PANEL  ',CL3'ESF'                       
         DC    X'05',CL8'ESTSFPAN',X'00'                                        
         DC    Y(GOPANESF-GOPANBLK),AL1(L'GOPANESF)                             
         DC    AL1(07,14)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNEAPP),X'00'                                               
         DC    CL27'APPROVAL IN MF OR PRESTO   ',CL3'AMP'                       
         DC    X'05',CL8'APPMFORP',X'00'                                        
         DC    Y(GOAPPMFP-GOPTIONS),AL1(L'GOAPPMFP)                             
         DC    AL1(07,09)                                                       
         DC    B'11111100',B'11111100'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNEPRP),X'00'                                               
         DC    CL27'ADD PREPARER MF OR PRESTO  ',CL3'PMP'                       
         DC    X'05',CL8'PRPMFORP',X'00'                                        
         DC    Y(GOPRPMFP-GOPTIONS),AL1(L'GOPRPMFP)                             
         DC    AL1(07,09)                                                       
         DC    B'11100000',B'11100000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNBATCH),X'00'                                              
         DC    CL27'NEED APPROVED EST. TO BATCH',CL3'NEB'                       
         DC    X'04',CL8'BATCHD  ',X'00'                                        
         DC    Y(GOBATCH-GOPTIONS),AL1(L'GOBATCH)                               
         DC    AL1(14,16)                                                       
         DC    B'11111100',B'00001100'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNCLITY),X'00'                                              
         DC    CL27'NEW BUSINESS OR PRO BONO   ',CL3'NBP'                       
         DC    X'04',CL8'NEWBUS  ',X'00'                                        
         DC    Y(GOCTYPE-GOPTIONS),AL1(L'GOCTYPE)                               
         DC    AL1(07,19)                                                       
         DC    B'00011100',B'11101111'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNCLIST),AL1(OPTBEXT)                                       
         DC    CL27'COLUMN LIST FOR JOB INQUIRY',CL3'INQ'                       
         DC    X'05',CL8'COLLIST ',X'00'                                        
         DC    Y(GOINQ-GOXBLOCK),AL1(L'GOINQ)                                   
         DC    AL1(7,24)                                                        
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNEPER),X'00'                                               
         DC    CL27'ESTIMATE PERCENTAGE        ',CL3'ESP'                       
         DC    X'04',CL8'ESTPERC',X'00'                                         
         DC    Y(GOESTPER-GOPTIONS),AL1(L'GOESTPER)                             
         DC    AL1(1,1)                                                         
         DC    B'00000011',X'00'                                                
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNJSUM),AL1(OPTBEXT)                                        
         DC    CL27'JOB SUMMARY COLUMNS        ',CL3'JSU'                       
         DC    X'05',CL8'JOBSUM  ',X'00'                                        
         DC    Y(GOJSUM-GOXBLOCK),AL1(L'GOJSUM)                                 
         DC    AL1(7,25)                                                        
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNJSUMC),AL1(OPTBEXT)                                       
         DC    CL27'JOB SUMMARY COLUMNS (CONT) ',CL3'JS2'                       
         DC    X'05',CL8'JOBSUM2 ',X'00'                                        
         DC    Y(GOJSUMC-GOXBLOCK),AL1(L'GOJSUMC)                               
         DC    AL1(7,25)                                                        
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNAWO),AL1(OPTBEXT)                                         
         DC    CL27'AUTOMATIC WRITE-OFF  (AWO) ',CL3'AWO'                       
         DC    X'03',CL8'AWO     ',X'00'                                        
         DC    Y(GOAWOO-GOXBLOCK),AL1(L'GOAWOO)                                 
         DC    AL1(6,6)                                                         
         DC    B'11111100',B'00000100'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNAWA),AL1(OPTBEXT)                                         
         DC    CL27'AWO ACCOUNT                ',CL3'AWA'                       
         DC    X'03',CL8'AWACCT  ',X'00'                                        
         DC    Y(GOAWOA-GOXBLOCK),AL1(L'GOAWOA)                                 
         DC    AL1(7,28)                                                        
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNAWFOF),AL1(OPTBEXT)                                       
         DC    CL27'AWO FINANCIAL OFFICE       ',CL3'AWF'                       
         DC    X'03',CL8'AWFOFF  ',X'00'                                        
         DC    Y(GOAWOFOF-GOXBLOCK),AL1(L'GOAWOFOF)                             
         DC    AL1(7,27)                                                        
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNAWAOF),AL1(OPTBEXT)                                       
         DC    CL27'AWO ANALYSIS OFFICE        ',CL3'AAO'                       
         DC    X'03',CL8'AWANOFF ',X'00'                                        
         DC    Y(GOAWOAOF-GOXBLOCK),AL1(L'GOAWOAOF)                             
         DC    AL1(7,26)                                                        
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNTOT),AL1(OPTBEXT)                                         
         DC    CL27'DEFAULT TYPE FOR TIMESHEET ',CL3'TOT'                       
         DC    X'04',CL8'DEFTOTS ',X'00'                                        
         DC    Y(GOTOT-GOXBLOCK),AL1(L'GOTOT)                                   
         DC    AL1(7,30)                                                        
         DC    B'11111111',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNFPT),AL1(OPTBEXT)                                         
         DC    CL27'FORCE PRODUCT ON TIMESHEET ',CL3'FPT'                       
         DC    X'04',CL8'FRCPRO  ',X'00'                                        
         DC    Y(GOFPT-GOXBLOCK),AL1(L'GOFPT)                                   
         DC    AL1(7,31)                                                        
         DC    B'11111100',B'00001100'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNFJT),AL1(OPTBEXT)                                         
         DC    CL27'FORCE JOB ON TIMESHEET     ',CL3'FJT'                       
         DC    X'04',CL8'FRCJOB  ',X'00'                                        
         DC    Y(GOFJT-GOXBLOCK),AL1(L'GOFJT)                                   
         DC    AL1(7,31)                                                        
         DC    B'11111100',B'00000100'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNAWDEP),AL1(OPTBEXT)                                       
         DC    CL27'AWO ANALYSIS DEPARTMENT    ',CL3'AWD'                       
         DC    X'03',CL8'AWANDEP ',X'00'                                        
         DC    Y(GOAWODEP-GOXBLOCK),AL1(L'GOAWODEP)                             
         DC    AL1(7,32)                                                        
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                  PANELS FOR BILLING PROGRAM                   
         DC    AL1(OPNAWSTF),AL1(OPTBEXT)                                       
         DC    CL27'AWO ANALYSIS PERSON        ',CL3'APE'                       
         DC    X'03',CL8'AWANSTAF',X'00'                                        
         DC    Y(GOAWOSTF-GOXBLOCK),AL1(L'GOAWOSTF)                             
         DC    AL1(7,33)                                                        
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNINCCR),AL1(OPTBEXT)                                       
         DC    CL27'BILL INTERNAL INC ACCOUNT  ',CL3'BII'                       
         DC    X'04',CL8'BILININ ',X'00'                                        
         DC    Y(GOINCCR-GOXBLOCK),AL1(L'GOINCCR)                               
         DC    AL1(15,18)                                                       
         DC    B'11111111',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNINCDR),AL1(OPTBEXT)                                       
         DC    CL27'BILL INTERNAL DR ACCOUNT   ',CL3'BID'                       
         DC    X'04',CL8'BILINDR ',X'00'                                        
         DC    Y(GOINCDR-GOXBLOCK),AL1(L'GOINCDR)                               
         DC    AL1(15,49)                                                       
         DC    B'11111111',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNTAX),AL1(OPTBEXT)                                         
         DC    CL27'IS TAX REQUIRED?           ',CL3'TAX'                       
         DC    X'04',CL8'TAXREQ  ',X'00'                                        
         DC    Y(GOTAX-GOXBLOCK),AL1(L'GOTAX)                                   
         DC    AL1(6,6)                                                         
         DC    B'11111111',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNTXWC),AL1(OPTBEXT)                                        
         DC    CL27'TAX WORKCODE               ',CL3'TWC'                       
         DC    X'04',CL8'TAXWORK ',X'00'                                        
         DC    Y(GOTXWC-GOXBLOCK),AL1(L'GOTXWC)                                 
         DC    AL1(7,35)                                                        
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNTXLOC),AL1(OPTBEXT)                                       
         DC    CL27'TAX LOCALITY               ',CL3'TLO'                       
         DC    X'04',CL8'TAXLOCAL',X'00'                                        
         DC    Y(GOTXLOC-GOXBLOCK),AL1(L'GOTXLOC)                               
         DC    AL1(7,39)                                                        
         DC    B'11111111',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNBASE),AL1(OPTBEXT)                                        
         DC    CL27'WORKCODE BASIS-UNITS/HOURS ',CL3'WBA'                       
         DC    X'04',CL8'WBASIS  ',X'00'                                        
         DC    Y(GOBASE-GOXBLOCK),AL1(L'GOBASE)                                 
         DC    AL1(7,34)                                                        
         DC    B'11111111',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNICA),AL1(OPTBEXT)                                         
         DC    CL27'INPUT CREDIT ACCOUNT       ',CL3'ICA'                       
         DC    X'04',CL8'INPUTCR ',X'00'                                        
         DC    Y(GOICA-GOXBLOCK),AL1(L'GOICA)                                   
         DC    AL1(15,36)                                                       
         DC    B'11111111',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNBDB),AL1(OPTBEXT)                                         
         DC    CL27'INTERCOMPANY DEBIT ACCOUNT ',CL3'IDR'                       
         DC    X'04',CL8'INTERDR ',X'00'                                        
         DC    Y(GOBDB-GOXBLOCK),AL1(L'GOBDB)                                   
         DC    AL1(15,37)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNICR),AL1(OPTBEXT)                                         
         DC    CL27'INTERCOMPANY CREDIT ACCOUNT',CL3'ICR'                       
         DC    X'04',CL8'ICREDIT ',X'00'                                        
         DC    Y(GOICR-GOXBLOCK),AL1(L'GOICR)                                   
         DC    AL1(15,38)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNSTUD),AL1(OPTBEXT)                                        
         DC    CL27'STUDIO?                    ',CL3'STU'                       
         DC    X'04',CL8'STUDIO  ',X'00'                                        
         DC    Y(GOSTUDIO-GOXBLOCK),AL1(L'GOSTUDIO)                             
         DC    AL1(6,6)                                                         
         DC    B'11111100',B'00111100'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNAGWC),AL1(OPTBEXT)                                        
         DC    CL27'INTERCOMPANY AGY WORKCODE  ',CL3'AWC'                       
         DC    X'04',CL8'AWORK   ',X'00'                                        
         DC    Y(GOAGWC-GOXBLOCK),AL1(L'GOAGWC)                                 
         DC    AL1(7,35)                                                        
         DC    B'11111111',B'11111110'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNHOLD),AL1(OPTBEXT)                                        
         DC    CL27'HOLD INTERCOMPANY AGY DEBIT',CL3'HDB'                       
         DC    X'04',CL8'HOLDEBIT',X'00'                                        
         DC    Y(GOHOLD-GOXBLOCK),AL1(L'GOHOLD)                                 
         DC    AL1(6,6)                                                         
         DC    B'11111100',B'11111000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNTYPE),AL1(OPTBEXT)                                        
         DC    CL27'STUDIO TYPE FOR JOB LINK   ',CL3'TYP'                       
         DC    X'04',CL8'TYPECODE',X'00'                                        
         DC    Y(GOTYPE-GOXBLOCK),AL1(L'GOTYPE)                                 
         DC    AL1(7,40)                                                        
         DC    B'11111100',B'11111000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNINT),AL1(OPTBEXT)                                         
         DC    CL27'STUDIO INTERCOMPANY POSTING',CL3'SIP'                       
         DC    X'04',CL8'INTERPST',X'00'                                        
         DC    Y(GOINTPST-GOXBLOCK),AL1(L'GOINTPST)                             
         DC    AL1(6,6)                                                         
         DC    B'11111100',B'00001111'                                          
         DC    3X'00'                                                           
*                                  OPTIONS FOR BILLING PROGRAM                  
         DC    AL1(OPNEXTAC),AL1(OPTBBIL)                                       
         DC    CL27'WRITE-OFF ACCOUNT (TIME)   ',CL3'WAT'                       
         DC    X'03',CL8'WATACCNT',X'00'                                        
         DC    Y(GOEXPTAC-GOBBLOCK),AL1(L'GOEXPTAC)                             
         DC    AL1(15,18)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNEXOAC),AL1(OPTBBIL)                                       
         DC    CL27'WRITE-OFF ACCOUNT (OTHER)  ',CL3'WAO'                       
         DC    X'03',CL8'WAOACCNT',X'00'                                        
         DC    Y(GOEXPOAC-GOBBLOCK),AL1(L'GOEXPOAC)                             
         DC    AL1(15,47)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNWOTAC),AL1(OPTBBIL)                                       
         DC    CL27'WRITE-OFF CLEARING ACCOUNT ',CL3'WOC'                       
         DC    X'03',CL8'WOCACCNT',X'00'                                        
         DC    Y(GOWOFTAC-GOBBLOCK),AL1(L'GOWOFTAC)                             
         DC    AL1(15,18)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNWOOAC),AL1(OPTBBIL)                                       
         DC    CL27'WRITE-OFF CONTROL ACCOUNT  ',CL3'WCA'                       
         DC    X'03',CL8'WCAACCNT',X'00'                                        
         DC    Y(GOWOFOAC-GOBBLOCK),AL1(L'GOWOFOAC)                             
         DC    AL1(15,48)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNTWCTP),XL1'00'                                            
         DC    CL27'TIME WORKCODE TYPES        ',CL3'TWT'                       
         DC    X'06',CL8'TIMWCTYP',X'00'                                        
         DC    AL2(GOTWO-GOPTIONS),AL1(L'GOTWO)                                 
         DC    AL1(7,46)                                                        
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNASPCT),X'00'                                              
         DC    CL27'ADMINISTRATION SURCHARGE % ',CL3'ASP'                       
         DC    X'03',CL8'ASPERCNT',X'00'                                        
         DC    Y(GOASPCT-GOPTIONS),AL1(L'GOASPCT)                               
         DC    AL1(10,10)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNASACC),X'00'                                              
         DC    CL27'INCOME ACCOUNT TO POST ASP ',CL3'IAP'                       
         DC    X'03',CL8'INCACCNT',X'00'                                        
         DC    Y(GOASACC-GOPTIONS),AL1(L'GOASACC)                               
         DC    AL1(15,43)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNASWRK),X'00'                                              
         DC    CL27'WORKCODE TO POST ASP       ',CL3'WAP'                       
         DC    X'03',CL8'ASWORK  ',X'00'                                        
         DC    Y(GOASWRK-GOPTIONS),AL1(L'GOASWRK)                               
         DC    AL1(7,35)                                                        
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNASBIL),X'00'                                              
         DC    CL27'INCLUDE ASP ON CURRENT BILL',CL3'IAS'                       
         DC    X'03',CL8'ASBILL  ',X'00'                                        
         DC    Y(GOASBIL-GOPTIONS),AL1(L'GOASBIL)                               
         DC    AL1(6,6)                                                         
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNPBPCT),AL1(OPTBEXT)                                       
         DC    CL27'PERCENT OF BILLING %       ',CL3'PBP'                       
         DC    X'03',CL8'PBPERCNT',X'00'                                        
         DC    Y(GOPBPCT-GOXBLOCK),AL1(L'GOPBPCT)                               
         DC    AL1(18,52)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNPBACC),AL1(OPTBEXT)                                       
         DC    CL27'PERCENT OF BILLING ACCOUNT ',CL3'PBA'                       
         DC    X'03',CL8'PBACCNT ',X'00'                                        
         DC    Y(GOPBACC-GOXBLOCK),AL1(L'GOPBACC)                               
         DC    AL1(15,51)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNPBWRK),AL1(OPTBEXT)                                       
         DC    CL27'PERCENT OF BILLING WORKCODE',CL3'PBW'                       
         DC    X'03',CL8'PBWORK  ',X'00'                                        
         DC    Y(GOPBWRK-GOXBLOCK),AL1(L'GOPBWRK)                               
         DC    AL1(7,35)                                                        
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNORDER),X'00'                                              
         DC    CL27'ALLOW ORDER TO BE BACKDATED',CL3'BDO'                       
         DC    X'03',CL8'BDORDER ',X'00'                                        
         DC    Y(GOORDER-GOPTIONS),AL1(L'GOORDER)                               
         DC    AL1(6,6)                                                         
         DC    B'11111100',B'11111111'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNREPFO),AL1(OPTBEXT)                                       
         DC    CL27'ESTIMATE FORMAT CODE',CL3'EFC'                              
         DC    X'03',CL8'ESTFORM ',X'00'                                        
         DC    Y(GOREPFOR-GOXBLOCK),AL1(L'GOREPFOR)                             
         DC    AL1(7,53)                                                        
         DC    B'11111100',B'00000011'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNSELES),X'00'                                              
         DC    CL27'AUTOMATIC BILLING ESTIMATE',CL3'ABE'                        
         DC    X'03',CL8'ESTAUTO ',X'00'                                        
         DC    Y(GOSELEST-GOPTIONS),AL1(L'GOSELEST)                             
         DC    AL1(19,54)                                                       
         DC    B'11111100',B'00000011'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNFNT),AL1(OPTBEXT)                                         
         DC    CL27'FORCE NARRATIVE ON TIME',CL3'FNT'                           
         DC    X'03',CL8'TFNARR  ',X'00'                                        
         DC    Y(GOTFNARR-GOXBLOCK),AL1(L'GOTFNARR)                             
         DC    AL1(20,55)                                                       
         DC    B'10111100',B'01000011'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNINACT),AL1(OPTBZERO)                                      
         DC    CL27'EMAIL WHEN DAYS INACTIVE',CL3'JIN'                          
         DC    X'03',CL8'OPTJIN  ',X'00'                                        
         DC    Y(GOINACTV-GOPTIONS),AL1(L'GOINACTV)                             
         DC    AL1(11,11)                                                       
         DC    B'11111100',B'00000011'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNTIMSH),X'00'                                              
         DC    CL27'TIMESHEETS FOR NEW CLIENTS',CL3'TMS'                        
         DC    X'03',CL8'OPTTMS  ',X'00'                                        
         DC    Y(GOTMSDEF-GOPTIONS),AL1(L'GOTMSDEF)                             
         DC    AL1(6,6)                                                         
         DC    B'11100000',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNCERCH),AL1(OPTBEXT)                                       
         DC    CL27'EMAIL WHEN REACH CE%         ',CL3'ERM'                     
         DC    X'03',CL8'OPTERM  ',X'00'                                        
         DC    Y(GOCERCHD-GOXBLOCK),AL1(L'GOCERCHD)                             
         DC    AL1(22,56)                                                       
         DC    B'11111100',B'00000011'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNCEAMB),AL1(OPTBEXT)                                       
         DC    CL27'JDASH AMBER WHEN REACH CE %',CL3'EAM'                       
         DC    X'03',CL8'OPTEAM  ',X'00'                                        
         DC    Y(GOCEAMBR-GOXBLOCK),AL1(L'GOCEAMBR)                             
         DC    AL1(22,56)                                                       
         DC    B'11111100',B'00000011'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNCERED),AL1(OPTBEXT)                                       
         DC    CL27'JDASH RED WHEN REACH',CL3'ERD'                              
         DC    X'03',CL8'OPTERD  ',X'00'                                        
         DC    Y(GOCERED-GOXBLOCK),AL1(L'GOCERED)                               
         DC    AL1(22,56)                                                       
         DC    B'11111100',B'00000011'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNTTA),AL1(OPTBEXT)                                         
         DC    CL27'TIME TYPE ALLOWED',CL3'TTA'                                 
         DC    X'03',CL8'OPTTTA  ',X'00'                                        
         DC    Y(GOTTALLW-GOXBLOCK),AL1(L'GOTTALLW)                             
         DC    AL1(21,55)                                                       
         DC    B'10011100',B'01100011'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNNJB),AL1(OPTBEXT)                                         
         DC    CL27'JOB INPUT ALLOWED FOR TIME',CL3'JBT'                        
         DC    X'03',CL8'OPTJBT  ',X'00'                                        
         DC    Y(GOTNOJOB-GOXBLOCK),AL1(L'GOTNOJOB)                             
         DC    AL1(6,6)                                                         
         DC    B'10111000',B'01000111'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNLDEST),AL1(OPTBBIL)                                       
         DC    CL27'JOB LOCKED FROM ESTIMATES',CL3'JLE'                         
         DC    X'03',CL8'OPTJLE  ',X'00'                                        
         DC    Y(GOJLDEST-GOBBLOCK),AL1(L'GOJLDEST)                             
         DC    AL1(6,6)                                                         
         DC    B'11111000',B'00000111'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNLDORD),AL1(OPTBBIL)                                       
         DC    CL27'JOB LOCKED FROM ORDERS   ',CL3'JLO'                         
         DC    X'03',CL8'OPTJLO  ',X'00'                                        
         DC    Y(GOJLDORD-GOBBLOCK),AL1(L'GOJLDORD)                             
         DC    AL1(6,6)                                                         
         DC    B'11111000',B'00000111'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNLDBIL),AL1(OPTBBIL)                                       
         DC    CL27'JOB LOCKED FROM BILLING  ',CL3'JLB'                         
         DC    X'03',CL8'OPTJLB  ',X'00'                                        
         DC    Y(GOJLDBIL-GOBBLOCK),AL1(L'GOJLDBIL)                             
         DC    AL1(6,6)                                                         
         DC    B'11111000',B'00000111'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNLDTSI),AL1(OPTBBIL)                                       
         DC    CL27'JOB LOCKED FROM TIMESHEETS',CL3'JLT'                        
         DC    X'03',CL8'OPTJLT  ',X'00'                                        
         DC    Y(GOJLDTSI-GOBBLOCK),AL1(L'GOJLDTSI)                             
         DC    AL1(6,6)                                                         
         DC    B'11111000',B'00000111'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNLDADJ),AL1(OPTBBIL)                                       
         DC    CL27'JOB LOCKED FROM ADJUSTMENTS',CL3'JLA'                       
         DC    X'03',CL8'OPTJLA  ',X'00'                                        
         DC    Y(GOJLDADJ-GOBBLOCK),AL1(L'GOJLDADJ)                             
         DC    AL1(6,6)                                                         
         DC    B'11111000',B'00000111'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNLDEXT),AL1(OPTBBIL)                                       
         DC    CL27'JOB LOCKED FROM EXT. COSTS',CL3'JLX'                        
         DC    X'03',CL8'OPTJLX  ',X'00'                                        
         DC    Y(GOJLDEXT-GOBBLOCK),AL1(L'GOJLDEXT)                             
         DC    AL1(6,6)                                                         
         DC    B'11111000',B'00000111'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNJLE),AL1(OPTBEXT)                                         
         DC    CL27'JOB ALLOWED FOR NON-BILL? ',CL3'NJL'                        
         DC    X'03',CL8'OPTNJL  ',X'00'                                        
         DC    Y(GONJLE-GOXBLOCK),AL1(L'GONJLE)                                 
         DC    AL1(6,6)                                                         
         DC    B'11111000',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNBIO),AL1(OPTBEXT)                                         
         DC    CL27'ITEM IS BILLABLE ONLY     ',CL3'BIO'                        
         DC    X'03',CL8'OPTBIO  ',X'00'                                        
         DC    Y(GOBILO-GOXBLOCK),AL1(L'GOBILO)                                 
         DC    AL1(6,6)                                                         
         DC    B'00011000',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNDIOS),AL1(OPTBEXT)                                        
         DC    CL27'B/O INCL PROD ORDER STATUS',CL3'DIO'                        
         DC    X'03',CL8'OPTDIOS ',X'00'                                        
         DC    AL2(GODIOS-GOXBLOCK),AL1(L'GODIOS)                               
         DC    AL1(35,69)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNDITSR),AL1(OPTBEXT)                                       
         DC    CL27'B/O INCL R TIME STATUS    ',CL3'DIR'                        
         DC    X'03',CL8'OPTDITSR',X'00'                                        
         DC    AL2(GODITSR-GOXBLOCK),AL1(L'GODITSR)                             
         DC    AL1(36,70)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNDITSB),AL1(OPTBEXT)                                       
         DC    CL27'B/O INCL B TIME STATUS    ',CL3'DIB'                        
         DC    X'03',CL8'OPTDITSB',X'00'                                        
         DC    AL2(GODITSB-GOXBLOCK),AL1(L'GODITSB)                             
         DC    AL1(37,71)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNDITSN),AL1(OPTBEXT)                                       
         DC    CL27'B/O INCL N TIME STATUS    ',CL3'DTN'                        
         DC    X'03',CL8'DITSNO  ',X'00'                                        
         DC    AL2(GODITSN-GOXBLOCK),AL1(L'GODITSN)                             
         DC    AL1(36,70)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNDIEN),AL1(OPTBEXT)                                        
         DC    CL27'B/O INCL N-BILL EXP STATUS',CL3'DIN'                        
         DC    X'03',CL8'OPTDIEN ',X'00'                                        
         DC    AL2(GODIEN-GOXBLOCK),AL1(L'GODIEN)                               
         DC    AL1(24,57)                                                       
         DC    B'11111111',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNDIEB),AL1(OPTBEXT)                                        
         DC    CL27'B/O INCL BILL EXP STATUS  ',CL3'DBE'                        
         DC    X'03',CL8'OPTDIEB ',X'00'                                        
         DC    AL2(GODIEB-GOXBLOCK),AL1(L'GODIEB)                               
         DC    AL1(35,69)                                                       
         DC    B'11111111',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNDIEO),AL1(OPTBEXT)                                        
         DC    CL27'B/O INCL EXP ORDER STATUS ',CL3'DIE'                        
         DC    X'03',CL8'OPTDIEO ',X'00'                                        
         DC    AL2(GODIEO-GOXBLOCK),AL1(L'GODIEO)                               
         DC    AL1(24,57)                                                       
         DC    B'11111111',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNDEIS),AL1(OPTBEXT)                                        
         DC    CL27'B/O INCL NON-BILL INVOICES',CL3'DEI'                        
         DC    X'03',CL8'OPTDEIS ',X'00'                                        
         DC    AL2(GODEIS-GOXBLOCK),AL1(L'GODEIS)                               
         DC    AL1(39,75)                                                       
         DC    B'11111111',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNIAES),AL1(OPTBEXT)                                        
         DC    CL27'INTERNAL APPROVAL IN EST  ',CL3'IAE'                        
         DC    X'03',CL8'OPTIAES ',X'00'                                        
         DC    AL2(GOIAES-GOXBLOCK),AL1(L'GOIAES)                               
         DC    AL1(06,06)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNIUSO),AL1(OPTBEXT)                                        
         DC    CL27'INTERNAL USE ONLY DEF. ST ',CL3'IUS'                        
         DC    X'03',CL8'OPTIUSO ',X'00'                                        
         DC    AL2(GOIUSO-GOXBLOCK),AL1(L'GOIUSO)                               
         DC    AL1(06,06)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNIDRF),AL1(OPTBEXT)                                        
         DC    CL27'DRAFT JOBS                ',CL3'DRF'                        
         DC    X'03',CL8'OPTIDRF ',X'00'                                        
         DC    AL2(GODRFT-GOXBLOCK),AL1(L'GODRFT)                               
         DC    AL1(30,66)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNACUA),AL1(OPTBEXT)                                        
         DC    CL27'AUTO COPY FROM UNCOM AMTS ',CL3'ACU'                        
         DC    X'03',CL8'OPTACUA ',X'00'                                        
         DC    AL2(GOACUA-GOXBLOCK),AL1(L'GOACUA)                               
         DC    AL1(38,73)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNNTJA),AL1(OPTBEXT)                                        
         DC    CL27'NOTIFY TEAM WHEN JOB APP  ',CL3'NTA'                        
         DC    X'03',CL8'OPTNTJA ',X'00'                                        
         DC    AL2(GONTJA-GOXBLOCK),AL1(L'GONTJA)                               
         DC    AL1(06,06)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNAEDT),AL1(OPTBEXT)                                        
         DC    CL27'ALLOW EST WITH DRAFT JOB ',CL3'AED'                         
         DC    X'03',CL8'OPTAEDJ ',X'00'                                        
         DC    AL2(GOAEDT-GOXBLOCK),AL1(L'GOAEDT)                               
         DC    AL1(06,06)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNSRQ),AL1(OPTBEXT)                                         
         DC    CL27'SUPPLIER REQUIRED TO SUBMIT',CL3'SRQ'                       
         DC    X'03',CL8'OPTSRQ  ',X'00'                                        
         DC    AL2(GOSRQ-GOXBLOCK),AL1(L'GOSRQ)                                 
         DC    AL1(06,06)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNXRQ),AL1(OPTBEXT)                                         
         DC    CL27'EXPENSE REQUIRED TO SUBMIT',CL3'XRQ'                        
         DC    X'03',CL8'OPTXRQ  ',X'00'                                        
         DC    AL2(GOXRQ-GOXBLOCK),AL1(L'GOXRQ)                                 
         DC    AL1(06,06)                                                       
         DC    B'11100000',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNEVS),AL1(OPTBEXT)                                         
         DC    CL27'EXP A/C VIS TO SUBMITTER  ',CL3'EVS'                        
         DC    X'03',CL8'OPTEVS  ',X'00'                                        
         DC    AL2(GOEVS-GOXBLOCK),AL1(L'GOEVS)                                 
         DC    AL1(06,06)                                                       
         DC    B'11100000',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNSAP),AL1(OPTBEXT)                                         
         DC    CL27'SEQUENTIAL APPROVERS      ',CL3'SAP'                        
         DC    X'03',CL8'OPTSAP  ',X'00'                                        
         DC    AL2(GOSAP-GOXBLOCK),AL1(L'GOSAP)                                 
         DC    AL1(06,06)                                                       
         DC    B'11100000',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNEWE),AL1(OPTBEXT)                                         
         DC    CL27'EST CHECK ERROR WARNING   ',CL3'EWE'                        
         DC    X'03',CL8'OPTEWE  ',X'00'                                        
         DC    Y(GOEWE-GOXBLOCK),AL1(L'GOEWE)                                   
         DC    AL1(25,58)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNECE),AL1(OPTBEXT)                                         
         DC    CL27'EST CHECK TYPE            ',CL3'ECE'                        
         DC    X'03',CL8'OPTECE  ',X'00'                                        
         DC    AL2(GOECE-GOXBLOCK),AL1(L'GOECE)                                 
         DC    AL1(34,59)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNEORM),AL1(OPTBEXT)                                        
         DC    CL27'EST CHECK EXPENSE ORDER   ',CL3'EOM'                        
         DC    X'03',CL8'OPTEORM ',X'00'                                        
         DC    AL2(GOEORM-GOXBLOCK),AL1(L'GOEORM)                               
         DC    AL1(24,57)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNEORN),AL1(OPTBEXT)                                        
         DC    CL27'EST CHECK PRODUCTION ORDERS',CL3'EON'                       
         DC    X'03',CL8'OPTEORN ',X'00'                                        
         DC    AL2(GOEORN-GOXBLOCK),AL1(L'GOEORN)                               
         DC    AL1(24,57)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNETMR),AL1(OPTBEXT)                                        
         DC    CL27'EST CHECK R TYPE TIME     ',CL3'ETR'                        
         DC    X'03',CL8'OPTETMR ',X'00'                                        
         DC    AL2(GOETMR-GOXBLOCK),AL1(L'GOETMR)                               
         DC    AL1(36,76)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNETMB),AL1(OPTBEXT)                                        
         DC    CL27'EST CHECK. B TYPE TIME    ',CL3'ETB'                        
         DC    X'03',CL8'OPTETMB ',X'00'                                        
         DC    AL2(GOETMB-GOXBLOCK),AL1(L'GOETMB)                               
         DC    AL1(37,71)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNEXPN),AL1(OPTBEXT)                                        
         DC    CL27'EST CHECK NON-BILL EXP    ',CL3'EEE'                        
         DC    X'03',CL8'OPTEXPN ',X'00'                                        
         DC    AL2(GOEXPN-GOXBLOCK),AL1(L'GOEXPN)                               
         DC    AL1(24,57)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNEXPB),AL1(OPTBEXT)                                        
         DC    CL27'EST CHECK BILLABLE EXPENSES',CL3'EBE'                       
         DC    X'03',CL8'OPTEXPB ',X'00'                                        
         DC    AL2(GOEXPB-GOXBLOCK),AL1(L'GOEXPB)                               
         DC    AL1(35,69)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNEMIN),AL1(OPTBEXT)                                        
         DC    CL27'EST CHECK NON-BILL INVOICES',CL3'EMI'                       
         DC    X'03',CL8'OPTEMIN ',X'00'                                        
         DC    AL2(GOEMIN-GOXBLOCK),AL1(L'GOEMIN)                               
         DC    AL1(06,06)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNSLA),AL1(OPTBEXT)                                         
         DC    CL27'ALLOW SELF APPROVAL       ',CL3'SLA'                        
         DC    X'03',CL8'OPTSLA  ',X'00'                                        
         DC    AL2(GOSLA-GOXBLOCK),AL1(L'GOSLA)                                 
         DC    AL1(31,60)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNRQU),AL1(OPTBEXT)                                         
         DC    CL27'REQUISITION NO. IN USE    ',CL3'RQU'                        
         DC    X'03',CL8'OPTRQU  ',X'00'                                        
         DC    AL2(GORQU-GOXBLOCK),AL1(L'GORQU)                                 
         DC    AL1(31,60)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNRQP),AL1(OPTBEXT)                                         
         DC    CL27'REQUISITION PREFIX        ',CL3'RQP'                        
         DC    X'03',CL8'OPTRQP  ',X'00'                                        
         DC    AL2(GORQP-GOXBLOCK),AL1(L'GORQP)                                 
         DC    AL1(08,72)                                                       
         DC    B'11100000',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNRQS),AL1(OPTBEXT)                                         
         DC    CL27'REQUISITION SUFFIX        ',CL3'RQS'                        
         DC    X'03',CL8'OPTRQS  ',X'00'                                        
         DC    AL2(GORQS-GOXBLOCK),AL1(L'GORQS)                                 
         DC    AL1(08,72)                                                       
         DC    B'11100000',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNENC),AL1(OPTBEXT)                                         
         DC    CL27'ESTIMATE NO. REQUIRED     ',CL3'ENC'                        
         DC    X'03',CL8'OPTENC  ',X'00'                                        
         DC    AL2(GOENC-GOXBLOCK),AL1(L'GOENC)                                 
         DC    AL1(32,67)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNEWC),AL1(OPTBEXT)                                         
         DC    CL27'EXP W/C INPUT             ',CL3'EWC'                        
         DC    X'03',CL8'OPTEWC  ',X'00'                                        
         DC    AL2(GOEWC-GOXBLOCK),AL1(L'GOEWC)                                 
         DC    AL1(09,61)                                                       
         DC    B'11100000',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNPAU),AL1(OPTBEXT)                                         
         DC    CL27'PROD AUTO APPROVAL        ',CL3'PAU'                        
         DC    X'03',CL8'OPTPAU  ',X'00'                                        
         DC    AL2(GOPAU-GOXBLOCK),AL1(L'GOPAU)                                 
         DC    AL1(26,62)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNEAU),AL1(OPTBEXT)                                         
         DC    CL27'EXP AUTO APPROVAL         ',CL3'EAU'                        
         DC    X'03',CL8'OPTEAU  ',X'00'                                        
         DC    AL2(GOEAU-GOXBLOCK),AL1(L'GOEAU)                                 
         DC    AL1(26,62)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNWCF),AL1(OPTBEXT)                                         
         DC    CL27'USE W/C FLAG FOR EST CHECK',CL3'WCF'                        
         DC    X'03',CL8'OPTWCF  ',X'00'                                        
         DC    AL2(GOWCF-GOXBLOCK),AL1(L'GOWCF)                                 
         DC    AL1(06,06)                                                       
         DC    B'11100000',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNPZO),AL1(OPTBEXT)                                         
         DC    CL27'PREVENT ZERO ORDER AMOUNT ',CL3'PZO'                        
         DC    X'03',CL8'OPTPZO  ',X'00'                                        
         DC    AL2(GOPZO-GOXBLOCK),AL1(L'GOPZO)                                 
         DC    AL1(31,60)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNOIT),AL1(OPTBEXT)                                         
         DC    CL27'USE ITEMS IN ORDERS       ',CL3'OIT'                        
         DC    X'03',CL8'OPTOIT  ',X'00'                                        
         DC    AL2(GOOIT-GOXBLOCK),AL1(L'GOOIT)                                 
         DC    AL1(31,60)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNOAN),AL1(OPTBEXT)                                         
         DC    CL27'ORDER ANALYSIS            ',CL3'OAN'                        
         DC    X'03',CL8'OPTOAN  ',X'00'                                        
         DC    AL2(GOOAN-GOXBLOCK),AL1(L'GOOAN)                                 
         DC    AL1(28,64)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNOAI),AL1(OPTBEXT)                                         
         DC    CL27'ORDERS ALL ITEMS          ',CL3'OAI'                        
         DC    X'03',CL8'OPTOAI  ',X'00'                                        
         DC    AL2(GOOAI-GOXBLOCK),AL1(L'GOOAI)                                 
         DC    AL1(06,06)                                                       
         DC    B'11100000',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNCECE),AL1(OPTBEXT)                                        
         DC    CL27'COPY EST. COPY EXTRA DATA ',CL3'CEC'                        
         DC    X'03',CL8'OPTECE  ',X'00'                                        
         DC    AL2(GOCECE-GOXBLOCK),AL1(L'GOCECE)                               
         DC    AL1(06,06)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNUESOA),AL1(OPTBEXT)                                       
         DC    CL27'USE EST STAT IN ORDER APPR',CL3'UEO'                        
         DC    X'03',CL8'OPTUESOA',X'00'                                        
         DC    AL2(GOUESOA-GOXBLOCK),AL1(L'GOUESOA)                             
         DC    AL1(31,60)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNCOES),AL1(OPTBEXT)                                        
         DC    CL27'CREATE ORD FROM EST STATUS',CL3'COE'                        
         DC    X'03',CL8'OPTCOES',X'00'                                         
         DC    AL2(GOCOES-GOXBLOCK),AL1(L'GOCOES)                               
         DC    AL1(31,74)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNDCTEO),AL1(OPTBEXT)                                       
         DC    CL27'COPY TXT FROM EST TO ORDER',CL3'DCT'                        
         DC    X'03',CL8'OPTDCTEO',X'00'                                        
         DC    AL2(GODCTEO-GOXBLOCK),AL1(L'GODCTEO)                             
         DC    AL1(6,6)                                                         
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNBIEA),AL1(OPTBEXT)                                        
         DC    CL27'AMT TO BYPASS INT. EST APP',CL3'BIA'                        
         DC    X'03',CL8'OPTBIEA',X'00'                                         
         DC    AL2(GOBIEA-GOXBLOCK),AL1(L'GOBIEA)                               
         DC    AL1(26,62)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNBCEA),AL1(OPTBEXT)                                        
         DC    CL27'AMT TO BYPASS CLI EST APP ',CL3'BCE'                        
         DC    X'03',CL8'OPTBCEA',X'00'                                         
         DC    AL2(GOBCEA-GOXBLOCK),AL1(L'GOBCEA)                               
         DC    AL1(26,62)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNINCR),AL1(OPTBEXT)                                        
         DC    CL27'INCLUDE R TIME IN ACTUALS ',CL3'INR'                        
         DC    X'03',CL8'OPTINCR',X'00'                                         
         DC    AL2(GOINCR-GOXBLOCK),AL1(L'GOINCR)                               
         DC    AL1(6,6)                                                         
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNGAPS),AL1(OPTBEXT)                                        
         DC    CL27'EXT. APP. IN EST. IN USE? ',CL3'EAE'                        
         DC    X'03',CL8'OPTGAP',X'00'                                          
         DC    AL2(GOGAPS-GOXBLOCK),AL1(L'GOGAPS)                               
         DC    AL1(06,06)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNDFEXS),AL1(OPTBEXT)                                       
         DC    CL27'DEFAULT EXPIR. PERD. EST. ',CL3'DXS'                        
         DC    X'03',CL8'OPTDXS',X'00'                                          
         DC    AL2(GOGDES-GOXBLOCK),AL1(L'GOGDES)                               
         DC    AL1(04,77)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNDNDVC),AL1(OPTBEXT)                                       
         DC    CL27'DFT NO. OF DAYS. AFT COMPL',CL3'DND'                        
         DC    X'03',CL8'OPTDND',X'00'                                          
         DC    AL2(GODNDV-GOXBLOCK),AL1(L'GODNDV)                               
         DC    AL1(04,77)                                                       
         DC    B'11111000',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNGAPRA),AL1(OPTBEXT)                                       
         DC    CL27'APP. REQU. BY ALL RECIPNTS?',CL3'ARQ'                       
         DC    X'03',CL8'OPTARQ',X'00'                                          
         DC    AL2(GOGARA-GOXBLOCK),AL1(L'GOGARA)                               
         DC    AL1(06,06)                                                       
         DC    B'11111000',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNSPWPD),AL1(OPTBEXT)                                       
         DC    CL27'SUPPRESS W/C PRINT DEFAULT',CL3'SWP'                        
         DC    X'03',CL8'OPTSWP',X'00'                                          
         DC    AL2(GOSWPD-GOXBLOCK),AL1(L'GOSWPD)                               
         DC    AL1(04,78)                                                       
         DC    B'11111000',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNDFEXO),AL1(OPTBEXT)                                       
         DC    CL27'DEF EXP. PERD. ORD',CL3'DXO'                                
         DC    X'03',CL8'OPTDXO',X'00'                                          
         DC    AL2(GOGDEO-GOXBLOCK),AL1(L'GOGDEO)                               
         DC    AL1(04,77)                                                       
         DC    B'11000000',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNGEMEX),AL1(OPTBEXT)                                       
         DC    CL27'EXT APP. EMAIL EXT?',CL3'GEX'                               
         DC    X'03',CL8'OPTGEX',X'00'                                          
         DC    AL2(GOGEMX-GOXBLOCK),AL1(L'GOGEMX)                               
         DC    AL1(6,6)                                                         
         DC    B'11111000',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNGEMDS),AL1(OPTBEXT)                                       
         DC    CL27'EXT APP. EMAIL DSC?',CL3'GED'                               
         DC    X'03',CL8'OPTGED',X'00'                                          
         DC    AL2(GOGEMD-GOXBLOCK),AL1(L'GOGEMD)                               
         DC    AL1(40,79)                                                       
         DC    B'11111000',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNUCWC),AL1(OPTBEXT)                                        
         DC    CL27'USE ACTUALS FOR CALC W/C?',CL3'UAC'                         
         DC    X'03',CL8'OPTUWC',X'00'                                          
         DC    AL2(GOGUWC-GOXBLOCK),AL1(L'GOGUWC)                               
         DC    AL1(6,6)                                                         
         DC    B'11111000',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNDDSC),AL1(OPTBEXT)                                        
         DC    CL27'DISP JOB DSCR ON PDF',CL3'DJD'                              
         DC    X'03',CL8'OPTDJD',X'00'                                          
         DC    AL2(GOGDSC-GOXBLOCK),AL1(L'GOGDSC)                               
         DC    AL1(6,6)                                                         
         DC    B'11111000',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNPBT),AL1(OPTBEXT)                                         
         DC    CL27'DO NOT MOVE BILLED TIME',CL3'PBT'                           
         DC    X'03',CL8'OPTPBT',X'00'                                          
         DC    AL2(GOPBT-GOXBLOCK),AL1(L'GOPBT)                                 
         DC    AL1(6,6)                                                         
         DC    B'11111000',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNPROE),AL1(OPTBEXT)                                        
         DC    CL27'PRINT RATES ON ESTIMATES',CL3'PRE'                          
         DC    X'03',CL8'OPTPRE',X'00'                                          
         DC    AL2(GOGPRE-GOXBLOCK),AL1(L'GOGPRE)                               
         DC    AL1(06,06)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNJ3RD),AL1(OPTBEXT)                                        
         DC    CL27'JOB AVAILABLE TO 3RD PARTY',CL3'J3D'                        
         DC    X'03',CL8'OPTJ3D',X'00'                                          
         DC    AL2(GOGJ3D-GOXBLOCK),AL1(L'GOGJ3D)                               
         DC    AL1(06,06)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNCCW),AL1(OPTBEXT)                                         
         DC    CL27'COLOR CODE EST WORKCODES  ',CL3'CCW'                        
         DC    X'03',CL8'OPTCCW  ',X'00'                                        
         DC    AL2(GOCCW-GOXBLOCK),AL1(L'GOCCW)                                 
         DC    AL1(6,6)                                                         
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNEXM),AL1(OPTBEXT)                                         
         DC    CL27'EXCLUDE MEMO FROM COMMISN ',CL3'EXM'                        
         DC    X'03',CL8'OPTEXM  ',X'00'                                        
         DC    AL2(GOEXM-GOXBLOCK),AL1(L'GOEXM)                                 
         DC    AL1(6,6)                                                         
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNPPORE),AL1(OPTBEXT)                                       
         DC    CL27'PART APPROVED PO RESUBMIT ',CL3'PPR'                        
         DC    X'03',CL8'OPTPPR  ',X'00'                                        
         DC    AL2(GOPPORES-GOXBLOCK),AL1(L'GOPPORES)                           
         DC    AL1(27,63)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNMPORE),AL1(OPTBEXT)                                       
         DC    CL27'MATCHED PO RESUBMIT       ',CL3'MPR'                        
         DC    X'03',CL8'OPTMPR  ',X'00'                                        
         DC    AL2(GOMPORES-GOXBLOCK),AL1(L'GOMPORES)                           
         DC    AL1(27,63)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNFPORE),AL1(OPTBEXT)                                       
         DC    CL27'FULLY APPRVD PO RESUBMIT  ',CL3'FPR'                        
         DC    X'03',CL8'OPTFPR  ',X'00'                                        
         DC    AL2(GOFPORES-GOXBLOCK),AL1(L'GOFPORES)                           
         DC    AL1(27,63)                                                       
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNUSD),AL1(OPTBEXT)                                         
         DC    CL27'PRINT USD ON BILL         ',CL3'USD'                        
         DC    X'03',CL8'OPTUSD  ',X'00'                                        
         DC    AL2(GOUSD-GOXBLOCK),AL1(L'GOUSD)                                 
         DC    AL1(6,6)                                                         
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNSJOF),AL1(OPTBEXT)                                        
         DC    CL27'USE SJ OFFICE FOR RATES   ',CL3'SJO'                        
         DC    X'03',CL8'OPTUSD  ',X'00'                                        
         DC    AL2(GOSJOF-GOXBLOCK),AL1(L'GOSJOF)                               
         DC    AL1(6,6)                                                         
         DC    B'11111100',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNEPAJ),AL1(OPTBEXT)                                        
         DC    CL27'EMAIL PERSN ASSIGNED TO JOB',CL3'EPA'                       
         DC    X'03',CL8'OPTEPA  ',X'00'                                        
         DC    AL2(GOEPAJ-GOXBLOCK),AL1(L'GOEPAJ)                               
         DC    AL1(06,06)                                                       
         DC    B'11111000',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    AL1(OPNEEDT),AL1(OPTBEXT)                                        
         DC    CL27'DATE EST IN LAST FISCAL YR ',CL3'EDT'                       
         DC    X'03',CL8'OPTEDT  ',X'00'                                        
         DC    AL2(GOEEDT-GOXBLOCK),AL1(L'GOEEDT)                               
         DC    AL1(06,06)                                                       
         DC    B'11111000',B'00000000'                                          
         DC    3X'00'                                                           
*                                                                               
         DC    X'00'               EOT                                          
