*          DATA SET ACOPTLIST  AT LEVEL 079 AS OF 02/11/21                      
*----------------------------------------------------------------------         
* GHOA 077 2019APR22 DSRD-22283 JBT - REMOVE DDS ONLY RESTRICTION               
* ASAX 078 2020MAY26 DSRD-25987 EDT - DATE EST IN LAST FISCAL YEAR              
* GHOA 079 2021FEB11 DSRD-22448 FNT SHOW FOR ALL                                
*----------------------------------------------------------------------         
* OPTION LIST TABLES                                                            
*                                                                               
         DC    Y((AGYTABX-AGYTAB)/L'AGYTAB)                                     
AGYTAB   DS    0CL(OPTLISTL)          AGENCY LEVEL OPTIONS                      
         DC    AL1(OPNCOM),C'U'       AGENCY COMMISSION RATE                    
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNUNBWC),C'U'     UNBILLABLE WORK CODE LIST                 
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNBT),C'U'        BILLING TYPE                              
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNDUE),C'U'       NUMBER OF DAYS BILL DUE                   
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNOVPER),C'U'     MAXIMUM PERCENT OVER ESTIMATE             
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNOVAMT),C'U'     MAXIMUM AMOUNT OVER ESTIMATE              
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNEEDES),C'U'     ESTIMATE NEEDED FOR BILLS                 
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNBFUN),C'U'      NEED JOB FUNDING TO BILL                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPAB),C'U'      PRINT AUTHORIZATION # ON BILL              
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNANT),C'U'      AUTHORZATION NUMBER TITLE                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNMIN),C'U'       MINIMUM BILL AMOUNT                       
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNCLSUM),C'U'     CLIENT SUMMARY ON BILLS                   
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPRSUM),C'U'     PRODUCT SUMMARY ON BILLS                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNDET),C'U'       SHOW DETAIL LINES ON BILLS                
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPN99S),C'U'       SUPPRESS PREVIOUS BILLING                 
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNWCNES),C'U'     SHOW WORK CODE ON EST. BILLS              
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNCD),C'U'        PASS CASH DISCOUNT TO CLIENT              
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNET),C'U'        PAY AGENCY NET                            
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNSUPAG),C'U'     SUPPRESS AGENCY COMMISSION                
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNJG),C'U'        JOB GROUP                                 
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNTBC),C'U'       TIME BILLING COMMISSION ACCOUNT           
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNAUTTA),C'U'     AUTOMATIC ESTIMATE TURN-AROUND            
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESCM),C'U'      ESTIMATE BILLS COMMISSIONABLE             
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNEWJUN),C'U'     NEW JOBS ARE UNAPPROVED?                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNZERO),C'U'      ZERO BILLINGS AMOUNT                      
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNAUTUN),C'U'     AUTO UNHOLD WHEN BILLING                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNEWBT),C'U'      NEW BILL TYPE FOR % ESTIMATE              
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNFILT2),C'U'     FILTER 2 WHEN EST TO TOTAL                
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNWCA21),C'U'     PRINT WORK CODE NO. ON AC21               
         DC    AL1(OPTLBILL),C'C',AL1(CTRYGBR,0)                                
         DC    AL1(OPNGST),C'U'       GST OUTPUT TAX CODE                       
         DC    AL1(OPTLBILL),C'A',AL1(CTRYCAN,0)                                
         DC    AL1(OPNPST),C'U'       PST PROVINCE/OUTPUT CODE                  
         DC    AL1(OPTLBILL),C'A',AL1(CTRYCAN,0)                                
         DC    AL1(OPNPROD),C'U'      PRODUCTION JOBS OK TO ADD?                
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNEDI),C'U'       ELIGIBLE FOR EDI?                         
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNSUPST),C'U'     SUPPRESS STICKY LABELS?                   
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNAUADD),C'U'     DAYS TO ADD FOR AUTO JOB CLOSE            
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNAUTO),C'U'      AUTO JOB JUMBERING ALLOWED                
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNDIST),C'U'      DISTRIBUTION SCHEME CODE                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNINCCR),C'U'     BILLING INCOME ACCOUNT                    
         DC    AL1(OPTLBILL+OPTLDDS),C'C',AL1(CTRYANY,0)                        
         DC    AL1(OPNINCDR),C'U'     BILLING DEBIT ACCOUNT                     
         DC    AL1(OPTLBILL+OPTLDDS),C'C',AL1(CTRYANY,0)                        
         DC    AL1(OPNEEDAE),C'U'     NEED APPROVED ESTIMATE TO BILL            
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNBATCH),C'U'     NEED APPROVED ESTIMATE TO BATCH           
         DC    AL1(OPTLFILE),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNESTYP),C'U'     ESTIMATE TYPE FOR NEW JOBS                
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNADDP),C'U'      ADD HOW MANY P'S AT JOB ADD               
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNADDR),C'U'      ADD R1 WHEN ADDING JOB?                   
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNCLIST),C'U'     DEFAULT COLUMN LIST                       
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNJSUM),C'U'      JOB SUMMARY COLUMN LIST                   
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNJSUMC),C'U'     JOB SUMMARY COLUMN LIST (CONT)            
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNTIMSH),C'U'  ENABLE TIMESHEETS ON CLIENT ADD              
         DC    AL1(OPTLFILE+OPTLDDS),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNESTRE),C'U'     ESTIMATE REPORT DEFAULT                   
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNSCH),C'U'       SCHEME FOR ESTIMATING                     
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNETIP),C'U'      ESTIMATE TITLE PANEL                      
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESTP),C'U'      ESTIMATE SUB-TITLE PANEL                  
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEHDP),C'U'      ESTIMATE HEADER PANEL                     
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESHP),C'U'      ESTIMATE SUB-HEADER PANEL                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEFTP),C'U'      ESTIMATE FOOTER PANEL                     
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESFP),C'U'      ESTIMATE SUB-FOOTER PANEL                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNREPFO),C'U'     BRAND OCEAN REPORT FORMAT CODE            
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEAPP),C'U'      APPROVE ESTIMATE MF OR PRESTO             
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEPRP),C'U'      ADD PREPARER MF OR PRESTO                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNTXTSC),C'U'     TEXT SCROLLING SEQUENCE                   
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNAWO),C'U'       AWO AUTOMATIC WRITE OFF                   
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWA),C'U'       AWO ACCOUNT                               
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWFOF),C'U'     AWO FINANCIAL OFFICE                      
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWAOF),C'U'     AWO ANALYSIS OFFICE                       
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWDEP),C'U'     AWO ANALYSIS DEPARTMENT                   
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWSTF),C'U'     AWO ANALYSIS STAFF                        
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNTOT),C'U'       DEFAULT TYPE FOR TIME SHEETS              
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNFPT),C'U'       FORCE PRODUCT ON TIME SHEETS              
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNFJT),C'U'       FORCE JOB ON TIME SHEETS                  
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNTAX),C'U'       TAX REQUIRED                              
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNTXWC),C'U'      TAX WORKCODE                              
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNTXLOC),C'U'     TAX LOCALITY CODE                         
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNBASE),C'U'      WORKCODE BASIS UNITS/HOURS                
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNICA),C'U'       INPUT CREDIT ACCOUNT                      
         DC    AL1(OPTLSTUD+OPTLFILE),C'A',AL1(CTRYANY,0)                       
         DC    AL1(OPNINT),C'U'       STUDIO INTERCOMPANY POSTINGS              
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNBDB),C'U'       INTERCOMPANY DEBIT ACCOUNT                
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNICR),C'U'       INTERCOMPANY CREDIT ACCOUNT               
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNSTUD),C'U'      IS THIS STUDIO JOB                        
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNHOLD),C'U'      HOLD AGENCY DEBITS                        
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNTYPE),C'U'      STUDIO TYPE CODE                          
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNORDER),C'U'     ALLOW BACK DATED ORDER                    
         DC    AL1(OPTLORD),C'A',AL1(CTRYANY,0)                                 
*                                                                               
*                                  CLIENT BILLING OPTIONS                       
*                                                                               
         DC    AL1(OPNTWCTP),C'U'     TIME WORKCODE TYPES                       
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNEXTAC),C'U'     WRITE-OFF ACCOUNT (TIME)                  
         DC    AL1(OPTLBILL),C'F',AL1(CTRYANY,0)                                
         DC    AL1(OPNEXOAC),C'U'     WRITE-OFF ACCOUNT (OTHER)                 
         DC    AL1(OPTLBILL),C'F',AL1(CTRYANY,0)                                
         DC    AL1(OPNWOOAC),C'U'     WRITE-OFF CONTROL ACCOUNT (OTHER)         
         DC    AL1(OPTLBILL),C'F',AL1(CTRYANY,0)                                
         DC    AL1(OPNASPCT),C'U'     ADMINISTRATIVE SURCHARGE %                
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNASACC),C'U'     INCOME ACCOUNT TO POST S/C TO             
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNASWRK),C'U'     WORKCODE TO POST S/C TO                   
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNASBIL),C'U'     POST ASP ON CURRENT BILL                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPBPCT),C'U'     PERCENT OF BILLING PERCENTAGE             
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPBACC),C'U'     PERCENT OF BILLING ACCOUNT                
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPBWRK),C'U'     PERCENT OF BILLING WORKCODE               
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNFNT),C'U'       FORCE NARRATIVE IN TIME                   
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNTTA),C'U'    (MCS) TYPE OF TIME ALLOWED                   
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNNJB),C'U'    (MCS) NO JOB INPUT ALLOWED IN TIME           
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNCEAMB),C'U'  JDASH AMBER WHEN REACH CE %                  
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNCERED),C'U'  JDASH RED WHEN REACH CE %                    
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNCERCH),C'U'  EMAIL WHEN REACH CE %                        
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNINACT),C'U'  EMAIL WHEN DAYS INACTIVE                     
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
*                                                                               
         DC    AL1(OPNLDEST),C'U'  JOB LOCK DEFAULT ESTIMATES                   
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNLDORD),C'U'  JOB LOCK DEFAULT ORDERS                      
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNLDBIL),C'U'  JOB LOCK DEFAULT BILLING                     
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNLDTSI),C'U'  JOB LOCK DEFAULT TIMESHEETS                  
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNLDADJ),C'U'  JOB LOCK DEFAULT ADJUSTMENTS                 
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNLDEXT),C'U'  JOB LOCK DEFAULT EXTERNAL COSTS              
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNJLE),C'U'  NO JOB LEVEL ENTRY FOR HOUSE                   
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
*                                                                               
         DC    AL1(OPNDIOS),C'U'  DASHBOARD INCLUDE ORDER STATUS                
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDITSR),C'U' DASHBOARD INCL R TIME STATUS                  
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDITSB),C'U' DASHBOARD INCL B TIME STATUS                  
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDITSN),C'U' DASHBOARD INCL N TIME STATUS                  
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDIEN),C'U'  DASHBOARD INCL N-BILL EXPENSE                 
         DC    AL1(OPTLFILE+OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                
         DC    AL1(OPNDIEB),C'U'  DASHBOARD INCL BILL EXPENSE                   
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDIEO),C'U'  DASHBOARD INCL EXPENSE ORDERS                 
         DC    AL1(OPTLFILE+OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                
         DC    AL1(OPNDEIS),C'U'  DISPLAY EXPENSE INVOICES                      
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNIAES),C'U'  INTERNAL APPROVAL IN ESTIMATES                
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNIUSO),C'U'  INTERNAL USE ONLY DRAFT STATUS                
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNIDRF),C'U'  DRAFT JOBS                                    
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNACUA),C'U'  AUTO COPY FROM UNCOMMIT AMTS                  
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNAEDT),C'U'  ALLOW ESTIMATES WITH DRFT JOB                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNSRQ),C'U'   ORDERS-SUPPLIER REQ TO SUBMIT                 
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNXRQ),C'U'   EXPENSE REQ'D TO SUBMIT                       
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEVS),C'U'   EXPENSE A/C VIS TO SUBMITTER                  
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNSAP),C'U'   SEQUENTIAL APPROVERS                          
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEWE),C'U'   EST CHECK ERROR WARNING                       
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNECE),C'U'   EST CHECK TYPE                                
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEORM),C'U'  ESTIMATE CHECK MEMO ORDERS                    
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEORN),C'U'  ESTIMATE CHECK NON-MEM ORD                    
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNETMR),C'U'  ESTIMATE CHECK R TIME                         
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNETMB),C'U'  ESTIMATE CHECK B TIME                         
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEXPN),C'U'  EST CHECK NON BILL EXPENSES                   
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEXPB),C'U'  EST CHECK BILLABLE EXPENSES                   
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEMIN),C'U'  ESTIMATE CHECK MEMO INVOICES                  
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNSLA),C'U'   ALLOW SELF APPROVAL                           
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNRQU),C'U'   REQUISITION NO. IN USE                        
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNRQP),C'U'   REQUISITION PREFIX                            
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNRQS),C'U'   REQUISITION SUFFIX                            
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNENC),C'U'   EST NO COMPLUSORY                             
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEWC),C'U'   EST W/C INPUT                                 
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNPAU),C'U'   PRODUCTION AUTO APPROVAL                      
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEAU),C'U'   EXPENSE AUTO APPROVAL                         
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNWCF),C'U'   USE WC FLAG FOR EST CHECK                     
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNPZO),C'U'   PREVENT ZERO ORDER AMOUNT                     
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNOIT),C'U'   USE ITEMS IN ORDERS                           
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNOAN),C'U'   ORDER ANALYSIS                                
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNOAI),C'U'   ORDERS ALL ITEMS                              
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNNTJA),C'U'  NOTIFY TEAM WHEN JOB APPROVED                 
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNCECE),C'U'  COPT ESTIMATE COPY EXTRA DATA                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNUESOA),C'U' USE ESTIMATE STATUS IN ORD APP                
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNCOES),C'U'  (MCS) CREATE ORDER FROM EST STATUS            
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNDCTEO),C'U'  (MCS) DEFT COPY TXT FROM EST TO ORD          
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNBIEA),C'U'  (MCS) BYPASS INTERNAL ESTIMATE APP            
         DC    AL1(OPTLBILL+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNBCEA),C'U'  (MCS) BYPASS CLIENT ESTIMATE APP              
         DC    AL1(OPTLBILL+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNINCR),C'U'  (MCS) INCLUDE R TIME IN EST, % COMM           
         DC    AL1(OPTLBILL),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNGAPS),C'U'  (MCS) GAP SERVICE IN USE?                     
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNDFEXS),C'U' (MCS) DEFAULT EXPIRATION PERIOD?              
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNDNDVC),C'U' (MCS) DEFAULT # DAYS TO VIEW EST              
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNGAPRA),C'U' (MCS) GAP APPROVAL REQUIRED BY ALL            
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNSPWPD),C'U' (MCS) SUPPRESS W/C PRINTING DEFAULT           
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNDFEXO),C'U' MCS) DEFAULT EXP PERIOD ORDERS?               
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNGEMEX),C'U' (MCS) EMAIL ESTENSION REQUIRED?               
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNGEMDS),C'U' (MCS) EMAIL DISCLAIMER REQUIRED?              
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNUCWC),C'U'  (MCS) USE ACTUALS FOR W/C WHEN ACTUAL         
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNDDSC),C'U' (MCS) DISPLAY JOB DESCRIPTION ON PDF           
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNJ3RD),C'U' JOB AVAILABLE TO 3RD PARTY                     
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNPBT),C'U'  DO NOT MOVE BILLED TIME                        
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY),AL1(OPTL53)                      
         DC    AL1(OPNPROE),C'U' (MCS) PRINT RATES ON ESTIMATES                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNCCW),C'U'  (MCS) COLOR CODED WCS IN ESTIMATES             
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEXM),C'U'   (MCS) EXCLUDE MEMO CHARGES                    
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNFPORE),C'U' (MCS) FULLY APPROVED ORDER RESUBMIT           
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNPPORE),C'U' (MCS) PART APPROVED ORDER RESUBMIT            
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNMPORE),C'U' (MCS) MATCHED ORDER RESUBMIT                  
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNUSD),C'U' PRINT USD ON BILL                               
         DC    AL1(OPTLBILL),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNSJOF),C'U' USE SJ OFFICE FOR RATES                        
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY),AL1(0)                            
         DC    AL1(OPNEPAJ),C'U' EMAIL IF PERSON ASSIGNED TO JOB                
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNEEDT),C'U' DATE EST IN LAST FISCAL YEAR                   
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
*                                                                               
AGYTABX  DC    X'FF'                                                            
         EJECT                                                                  
         DC    Y((OGTABX-OGTAB)/L'OGTAB)                                        
OGTAB    DS    0CL(OPTLISTL)          OFFICE GROUP OPTIONS                      
         DC    AL1(OPNCOM),C'U'       AGENCY COMMISSION RATE                    
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNUNBWC),C'U'     UNBILLABLE WORK CODE LIST                 
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNBT),C'U'        BILLING TYPE                              
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNDUE),C'U'       NUMBER OF DAYS BILL DUE                   
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNOVPER),C'U'     MAXIMUM PERCENT OVER ESTIMATE             
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNOVAMT),C'U'     MAXIMUM AMOUNT OVER ESTIMATE              
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNEEDES),C'U'     ESTIMATE NEEDED FOR BILLS                 
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNBFUN),C'U'      NEED JOB FUNDING TO BILL                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPAB),C'U'      PRINT AUTHORIZATION # ON BILL              
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNANT),C'U'      AUTHORZATION NUMBER TITLE                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNMIN),C'U'       MINIMUM BILL AMOUNT                       
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNCLSUM),C'U'     CLIENT SUMMARY ON BILLS                   
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPRSUM),C'U'     PRODUCT SUMMARY ON BILLS                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNDET),C'U'       SHOW DETAIL LINES ON BILLS                
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPN99S),C'U'       SUPPRESS PREVIOUS BILLING                 
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNWCNES),C'U'     SHOW WORK CODE ON EST. BILLS              
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNCD),C'U'        PASS CASH DISCOUNT TO CLIENT              
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNET),C'U'        PAY AGENCY NET                            
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNSUPAG),C'U'     SUPPRESS AGENCY COMMISSION                
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNJG),C'U'        JOB GROUP                                 
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNTBC),C'U'       TIME BILLING COMMISSION ACCOUNT           
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNAUTTA),C'U'     AUTOMATIC ESTIMATE TURN-AROUND            
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESCM),C'U'      ESTIMATE BILLS COMMISSIONABLE             
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNEWJUN),C'U'     NEW JOBS ARE UNAPPROVED?                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNZERO),C'U'      ZERO BILLINGS AMOUNT                      
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNAUTUN),C'U'     AUTO UNHOLD WHEN BILLING                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNEWBT),C'U'      NEW BILL TYPE FOR % ESTIMATE              
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNFILT2),C'U'     FILTER 2 WHEN EST TO TOTAL                
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNWCA21),C'U'     PRINT WORK CODE NO. ON AC21               
         DC    AL1(OPTLBILL),C'C',AL1(CTRYGBR,0)                                
         DC    AL1(OPNGST),C'U'       GST OUTPUT TYPE                           
         DC    AL1(OPTLBILL),C'A',AL1(CTRYCAN,0)                                
         DC    AL1(OPNPST),C'U'       PST PROVINCE/OUTPUT CODE                  
         DC    AL1(OPTLBILL),C'A',AL1(CTRYCAN,0)                                
         DC    AL1(OPNPROD),C'U'      PRODUCTION JOBS OK TO ADD?                
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNEDI),C'U'       ELIGIBLE FOR EDI?                         
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNSUPST),C'U'     SUPPRESS STICKY LABELS?                   
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNAUADD),C'U'     DAYS TO ADD FOR AUTO JOB CLOSE            
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNAUTO),C'U'      AUTO JOB JUMBERING ALLOWED                
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNDIST),C'U'      DISTRIBUTION SCHEME CODE                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNINCCR),C'U'     BILLING INCOME ACCOUNT                    
         DC    AL1(OPTLBILL+OPTLDDS),C'C',AL1(CTRYANY,0)                        
         DC    AL1(OPNINCDR),C'U'     BILLING DEBIT ACCOUNT                     
         DC    AL1(OPTLBILL+OPTLDDS),C'C',AL1(CTRYANY,0)                        
         DC    AL1(OPNEEDAE),C'U'     NEED APPROVED ESTIMATE TO BILL            
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNBATCH),C'U'     NEED APPROVED ESTIMATE TO BATCH           
         DC    AL1(OPTLFILE),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNESTYP),C'U'     ESTIMATE TYPE FOR NEW JOBS                
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNADDP),C'U'      ADD HOW MANY P'S AT JOB ADD               
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNADDR),C'U'      ADD R1 WHEN ADDING JOB?                   
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNCLIST),C'U'     DEFAULT COLUMN LIST                       
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNJSUM),C'U'      JOB SUMMARY COLUMN LIST                   
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNJSUMC),C'U'     JOB SUMMARY COLUMN LIST (CONT)            
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESTRE),C'U'     ESTIMATE REPORT DEFAULT                   
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNSCH),C'U'       SCHEME FOR ESTIMATING                     
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNETIP),C'U'      ESTIMATE TITLE PANEL                      
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESTP),C'U'      ESTIMATE SUB-TITLE PANEL                  
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEHDP),C'U'      ESTIMATE HEADER PANEL                     
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESHP),C'U'      ESTIMATE SUB-HEADER PANEL                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEFTP),C'U'      ESTIMATE FOOTER PANEL                     
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESFP),C'U'      ESTIMATE SUB-FOOTER PANEL                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNREPFO),C'U'     BRAND OCEAN REPORT FORMAT CODE            
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEAPP),C'U'      APPROVE ESTIMATE MF OR PRESTO             
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEPRP),C'U'      ADD PREPARER MF OR PRESTO                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNTXTSC),C'U'     TEXT SCROLLING SEQUENCE                   
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNAWO),C'U'       AWO AUTOMATIC WRITE OFF                   
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWA),C'U'       AWO ACCOUNT                               
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWFOF),C'U'     AWO FINANCIAL OFFICE                      
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWAOF),C'U'     AWO ANALYSIS OFFICE                       
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWDEP),C'U'     AWO ANALYSIS DEPARTMENT                   
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWSTF),C'U'     AWO ANALYSIS STAFF                        
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNTOT),C'U'       DEFAULT TYPE FOR TIME SHEETS              
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNFPT),C'U'       FORCE PRODUCT ON TIME SHEETS              
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNFJT),C'U'       FORCE JOB ON TIME SHEETS                  
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNTAX),C'U'       TAX REQUIRED                              
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNTXWC),C'U'      TAX WORKCODE                              
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNTXLOC),C'U'     TAX LOCALITY CODE                         
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNBASE),C'U'      WORKCODE BASIS UNITS/HOURS                
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNICA),C'U'       INPUT CREDIT ACCOUNT                      
         DC    AL1(OPTLSTUD+OPTLFILE),C'A',AL1(CTRYANY,0)                       
         DC    AL1(OPNINT),C'U'       STUDIO INTERCOMPANY POSTINGS              
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNBDB),C'U'       INTERCOMPANY DEBIT ACCOUNT                
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNICR),C'U'       INTERCOMPANY CREDIT ACCOUNT               
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNSTUD),C'U'      IS THIS STUDIO JOB                        
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNHOLD),C'U'      HOLD AGENCY DEBITS                        
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNTYPE),C'U'      STUDIO TYPE CODE                          
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNORDER),C'P'     ALLOW BACK DATED ORDER                    
         DC    AL1(OPTLORD),C'A',AL1(CTRYANY,0)                                 
*                                                                               
*                                  CLIENT BILLING OPTIONS                       
*                                                                               
         DC    AL1(OPNTWCTP),C'U'     TIME WORKCODE TYPES                       
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNEXTAC),C'U'     WRITE-OFF ACCOUNT (TIME)                  
         DC    AL1(OPTLBILL),C'F',AL1(CTRYANY,0)                                
         DC    AL1(OPNEXOAC),C'U'     WRITE-OFF ACCOUNT (OTHER)                 
         DC    AL1(OPTLBILL),C'F',AL1(CTRYANY,0)                                
         DC    AL1(OPNWOOAC),C'U'     WRITE-OFF CONTROL ACCOUNT (OTHER)         
         DC    AL1(OPTLBILL),C'F',AL1(CTRYANY,0)                                
         DC    AL1(OPNASPCT),C'U'     ADMINISTRATIVE SURCHARGE %                
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNASACC),C'U'     INCOME ACCOUNT TO POST S/C TO             
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNASWRK),C'U'     WORKCODE TO POST S/C TO                   
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNASBIL),C'U'     POST ASP ON CURRENT BILL                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPBPCT),C'U'     PERCENT OF BILLING PERCENTAGE             
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPBACC),C'U'     PERCENT OF BILLING ACCOUNT                
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPBWRK),C'U'     PERCENT OF BILLING WORKCODE               
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNFNT),C'U'       FORCE NARRATIVE IN TIME                   
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNTIMSH),C'U'  ENABLE TIMESHEETS ON CLIENT ADD              
         DC    AL1(OPTLFILE+OPTLDDS),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNCEAMB),C'U'  JDASH AMBER WHEN REACH CE %                  
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNCERED),C'U'  JDASH RED WHEN REACH CE %                    
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNCERCH),C'U'  EMAIL WHEN REACH CE %                        
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNINACT),C'U'  EMAIL WHEN DAYS INACTIVE                     
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
*                                                                               
         DC    AL1(OPNLDEST),C'U'  JOB LOCK DEFAULT ESTIMATES                   
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNLDORD),C'U'  JOB LOCK DEFAULT ORDERS                      
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNLDBIL),C'U'  JOB LOCK DEFAULT BILLING                     
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNLDTSI),C'U'  JOB LOCK DEFAULT TIMESHEETS                  
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNLDADJ),C'U'  JOB LOCK DEFAULT ADJUSTMENTS                 
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNLDEXT),C'U'  JOB LOCK DEFAULT EXTERNAL COSTS              
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNJLE),C'U'  NO JOB LEVEL ENTRY FOR HOUSE                   
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
*                                                                               
         DC    AL1(OPNDIOS),C'U'  DASHBOARD INCLUDE ORDER STATUS                
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDITSR),C'U' DASHBOARD INCL R TIME STATUS                  
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDITSB),C'U' DASHBOARD INCL B TIME STATUS                  
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDITSN),C'U' DASHBOARD INCL N TIME STATUS                  
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDIEN),C'U'  DASHBOARD INCL N-BILL EXPENSE                 
         DC    AL1(OPTLFILE+OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                
         DC    AL1(OPNDIEB),C'U'  DASHBOARD INCL BILL EXPENSE                   
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDIEO),C'U'  DASHBOARD INCL EXPENSE ORDERS                 
         DC    AL1(OPTLFILE+OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                
         DC    AL1(OPNDEIS),C'U'  DISPLAY EXPENSE INVOICES                      
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNIAES),C'U'  INTERNAL APPROVAL IN ESTIMATES                
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNIUSO),C'U'  NTERNAL USE ONLY DRAFT STATUS                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNIDRF),C'U'  DRAFT JOBS                                    
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNACUA),C'U'  AUTO COPY FROM UNCOMMIT AMTS                  
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNAEDT),C'U'  ALLOW ESTIMATES WITH DRFT JOB                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNSRQ),C'U'   ORDERS-SUPPLIER REQ TO SUBMIT                 
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNXRQ),C'U'   EXPENSE REQ'D TO SUBMIT                       
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEVS),C'U'   EXPENSE A/C VIS TO SUBMITTER                  
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNSAP),C'U'   SEQUENTIAL APPROVERS                          
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEWE),C'U'   EST CHECK ERROR WARNING                       
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNECE),C'U'   EST CHECK TYPE                                
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEORM),C'U'  ESTIMATE CHECK MEMO ORDERS                    
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEORN),C'U'  ESTIMATE CHECK NON-MEM ORD                    
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNETMR),C'U'  ESTIMATE CHECK R TIME                         
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNETMB),C'U'  ESTIMATE CHECK B TIME                         
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEXPN),C'U'  EST CHECK NON BILL EXPENSES                   
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEXPB),C'U'  EST CHECK BILLABLE EXPENSES                   
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEMIN),C'U'  ESTIMATE CHECK MEMO INVOICES                  
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNSLA),C'U'   ALLOW SELF APPROVAL                           
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNRQU),C'U'   REQUISITION NO. IN USE                        
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNRQP),C'U'   REQUISITION PREFIX                            
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNRQS),C'U'   REQUISITION SUFFIX                            
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNENC),C'U'   EST NO COMPLUSORY                             
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEWC),C'U'   EST W/C INPUT                                 
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNPAU),C'U'   PRODUCTION AUTO APPROVAL                      
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEAU),C'U'   EXPENSE AUTO APPROVAL                         
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNWCF),C'U'   USE WC FLAG FOR EST CHECK                     
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNPZO),C'U'   PREVENT ZERO ORDER AMOUNT                     
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNOIT),C'U'   USE ITEMS IN ORDERS                           
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNOAN),C'U'   ORDER ANALYSIS                                
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNOAI),C'U'   ORDERS ALL ITEMS                              
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNNTJA),C'U'  NOTIFY TEAM WHEN JOB APPROVED                 
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNCECE),C'U'  COPT ESTIMATE COPY EXTRA DATA                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNUESOA),C'U' USE ESTIMATE STATUS IN ORD APP                
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNCOES),C'U'  (MCS) CREATE ORDER FROM EST STATUS            
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNDCTEO),C'U'  (MCS) DEFT COPY TXT FROM EST TO ORD          
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNINCR),C'U'  (MCS) INCLUDE R TIME IN EST, % COMM           
         DC    AL1(OPTLBILL),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNGAPS),C'U'  (MCS) GAP SERVICE IN USE?                     
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNDFEXS),C'U' (MCS) DEFAULT EXPIRATION PERIOD?              
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNDNDVC),C'U' (MCS) DEFAULT # DAYS TO VIEW EST              
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNGAPRA),C'U' (MCS) GAP APPROVAL REQUIRED BY ALL            
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNSPWPD),C'U' (MCS) SUPPRESS W/C PRINTING DEFAULT           
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNDFEXO),C'U' MCS) DEFAULT EXP PERIOD ORDERS?               
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNGEMEX),C'U' (MCS) EMAIL ESTENSION REQUIRED?               
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNGEMDS),C'U' (MCS) EMAIL DISCLAIMER REQUIRED?              
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNUCWC),C'U'  (MCS) USE ACTUALS FOR W/C WHEN ACTUAL         
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNDDSC),C'U' (MCS) DISPLAY JOB DESCRIPTION ON PDF           
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNJ3RD),C'U' JOB AVAILABLE TO 3RD PARTY                     
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNPBT),C'U'  DO NOT MOVE BILLED TIME                        
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY),AL1(OPTL53)                      
         DC    AL1(OPNPROE),C'U' (MCS) PRINT RATES ON ESTIMATES                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNCCW),C'U'  (MCS) COLOR CODED WCS IN ESTIMATES             
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEXM),C'U'   (MCS) EXCLUDE MEMO CHARGES                    
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNFPORE),C'U' (MCS) FULLY APPROVED ORDER RESUBMIT           
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNPPORE),C'U' (MCS) PART APPROVED ORDER RESUBMIT            
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNMPORE),C'U' (MCS) MATCHED ORDER RESUBMIT                  
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNUSD),C'U' PRINT USD ON BILL                               
         DC    AL1(OPTLBILL),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNSJOF),C'U' USE SJ OFFICE FOR RATES                        
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY),AL1(0)                            
         DC    AL1(OPNEPAJ),C'U' EMAIL IF PERSON ASSIGNED TO JOB                
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNEEDT),C'U' DATE EST IN LAST FISCAL YEAR                   
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
*                                                                               
OGTABX   DC    X'FF'                                                            
         EJECT                                                                  
         DC    Y((OFFTABX-OFFTAB)/L'OFFTAB)                                     
OFFTAB   DS    0CL(OPTLISTL)          OFFICE OPTIONS                            
         DC    AL1(OPNCOM),C'U'       AGENCY COMMISSION RATE                    
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNUNBWC),C'U'     UNBILLABLE WORK CODE LIST                 
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNBT),C'U'        BILLING TYPE                              
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNDUE),C'U'       NUMBER OF DAYS BILL DUE                   
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNOVPER),C'U'     MAXIMUM PERCENT OVER ESTIMATE             
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNOVAMT),C'U'     MAXIMUM AMOUNT OVER ESTIMATE              
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNEEDES),C'U'     ESTIMATE NEEDED FOR BILLS                 
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNBFUN),C'U'      NEED JOB FUNDING TO BILL                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPAB),C'U'      PRINT AUTHORIZATION # ON BILL              
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNANT),C'U'      AUTHORZATION NUMBER TITLE                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNMIN),C'U'       MINIMUM BILL AMOUNT                       
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNCLSUM),C'U'     CLIENT SUMMARY ON BILLS                   
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPRSUM),C'U'     PRODUCT SUMMARY ON BILLS                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNDET),C'U'       SHOW DETAIL LINES ON BILLS                
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPN99S),C'U'       SUPPRESS PREVIOUS BILLING                 
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNWCNES),C'U'     SHOW WORK CODE ON EST. BILLS              
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNCD),C'U'        PASS CASH DISCOUNT TO CLIENT              
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNET),C'U'        PAY AGENCY NET                            
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNSUPAG),C'U'     SUPPRESS AGENCY COMMISSION                
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNJG),C'U'        JOB GROUP                                 
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNTBC),C'U'       TIME BILLING COMMISSION ACCOUNT           
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNAUTTA),C'U'     AUTOMATIC ESTIMATE TURN-AROUND            
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESCM),C'U'      ESTIMATE BILLS COMMISSIONABLE             
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNEWJUN),C'U'     NEW JOBS ARE UNAPPROVED?                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNZERO),C'U'      ZERO BILLINGS AMOUNT                      
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNAUTUN),C'U'     AUTO UNHOLD WHEN BILLING                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNEWBT),C'U'      NEW BILL TYPE FOR % ESTIMATE              
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNFILT2),C'U'     FILTER 2 WHEN EST TO TOTAL                
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNWCA21),C'U'     PRINT WORK CODE NO. ON AC21               
         DC    AL1(OPTLBILL),C'C',AL1(CTRYGBR,0)                                
         DC    AL1(OPNGST),C'U'       GST OUTPUT TYPE                           
         DC    AL1(OPTLBILL),C'A',AL1(CTRYCAN,0)                                
         DC    AL1(OPNPST),C'U'       PST PROVINCE/OUTPUT CODE                  
         DC    AL1(OPTLBILL),C'A',AL1(CTRYCAN,0)                                
         DC    AL1(OPNPROD),C'U'      PRODUCTION JOBS OK TO ADD?                
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNEDI),C'U'       ELIGIBLE FOR EDI?                         
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNSUPST),C'U'     SUPPRESS STICKY LABELS?                   
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNAUADD),C'U'     DAYS TO ADD FOR AUTO JOB CLOSE            
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNAUTO),C'U'      AUTO JOB JUMBERING ALLOWED                
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNDIST),C'U'      DISTRIBUTION SCHEME CODE                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNINCCR),C'U'     BILLING INCOME ACCOUNT                    
         DC    AL1(OPTLBILL+OPTLDDS),C'C',AL1(CTRYANY,0)                        
         DC    AL1(OPNINCDR),C'U'     BILLING DEBIT ACCOUNT                     
         DC    AL1(OPTLBILL+OPTLDDS),C'C',AL1(CTRYANY,0)                        
         DC    AL1(OPNEEDAE),C'U'     NEED APPROVED ESTIMATE TO BILL            
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNBATCH),C'U'     NEED APPROVED ESTIMATE TO BATCH           
         DC    AL1(OPTLFILE),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNESTYP),C'U'     ESTIMATE TYPE FOR NEW JOBS                
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNADDP),C'U'      ADD HOW MANY P'S AT JOB ADD               
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNADDR),C'U'      ADD R1 WHEN ADDING JOB?                   
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNCLIST),C'U'     DEFAULT COLUMN LIST                       
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNJSUM),C'U'      JOB SUMMARY COLUMN LIST                   
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNJSUMC),C'U'     JOB SUMMARY COLUMN LIST (CONT)            
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESTRE),C'U'     ESTIMATE REPORT DEFAULT                   
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNSCH),C'U'       SCHEME FOR ESTIMATING                     
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNETIP),C'U'      ESTIMATE TITLE PANEL                      
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESTP),C'U'      ESTIMATE SUB-TITLE PANEL                  
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEHDP),C'U'      ESTIMATE HEADER PANEL                     
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESHP),C'U'      ESTIMATE SUB-HEADER PANEL                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEFTP),C'U'      ESTIMATE FOOTER PANEL                     
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESFP),C'U'      ESTIMATE SUB-FOOTER PANEL                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNREPFO),C'U'     BRAND OCEAN REPORT FORMAT CODE            
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEAPP),C'U'      APPROVE ESTIMATE MF OR PRESTO             
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEPRP),C'U'      ADD PREPARER MF OR PRESTO                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNTXTSC),C'U'     TEXT SCROLLING SEQUENCE                   
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNAWO),C'U'       AWO AUTOMATIC WRITE OFF                   
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWA),C'U'       AWO ACCOUNT                               
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWFOF),C'U'     AWO FINANCIAL OFFICE                      
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWAOF),C'U'     AWO ANALYSIS OFFICE                       
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWDEP),C'U'     AWO ANALYSIS DEPARTMENT                   
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWSTF),C'U'     AWO ANALYSIS STAFF                        
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNTOT),C'U'       DEFAULT TYPE FOR TIME SHEETS              
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNFPT),C'U'       FORCE PRODUCT ON TIME SHEETS              
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNFJT),C'U'       FORCE JOB ON TIME SHEETS                  
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNTIMSH),C'U'  ENABLE TIMESHEETS ON CLIENT ADD              
         DC    AL1(OPTLFILE+OPTLDDS),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNTAX),C'U'       TAX REQUIRED                              
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNTXWC),C'U'      TAX WORKCODE                              
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNTXLOC),C'U'     TAX LOCALITY CODE                         
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNBASE),C'U'      WORKCODE BASIS UNITS/HOURS                
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNICA),C'U'       INPUT CREDIT ACCOUNT                      
         DC    AL1(OPTLSTUD+OPTLFILE),C'A',AL1(CTRYANY,0)                       
         DC    AL1(OPNINT),C'U'       STUDIO INTERCOMPANY POSTINGS              
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNBDB),C'U'       INTERCOMPANY DEBIT ACCOUNT                
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNICR),C'U'       INTERCOMPANY CREDIT ACCOUNT               
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNSTUD),C'U'      IS THIS STUDIO JOB                        
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNHOLD),C'U'      HOLD AGENCY DEBITS                        
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNTYPE),C'U'      STUDIO TYPE CODE                          
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNORDER),C'P'     ALLOW BACK DATED ORDER                    
         DC    AL1(OPTLORD),C'A',AL1(CTRYANY,0)                                 
*                                                                               
*                                  CLIENT BILLING OPTIONS                       
*                                                                               
         DC    AL1(OPNTWCTP),C'U'     TIME WORKCODE TYPES                       
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNEXTAC),C'U'     WRITE-OFF ACCOUNT (TIME)                  
         DC    AL1(OPTLBILL),C'F',AL1(CTRYANY,0)                                
         DC    AL1(OPNEXOAC),C'U'     WRITE-OFF ACCOUNT (OTHER)                 
         DC    AL1(OPTLBILL),C'F',AL1(CTRYANY,0)                                
         DC    AL1(OPNWOOAC),C'U'     WRITE-OFF CONTROL ACCOUNT (OTHER)         
         DC    AL1(OPTLBILL),C'F',AL1(CTRYANY,0)                                
         DC    AL1(OPNASPCT),C'U'     ADMINISTRATIVE SURCHARGE %                
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNASACC),C'U'     INCOME ACCOUNT TO POST S/C TO             
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNASWRK),C'U'     WORKCODE TO POST S/C TO                   
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNASBIL),C'U'     POST ASP ON CURRENT BILL                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPBPCT),C'U'     PERCENT OF BILLING PERCENTAGE             
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPBACC),C'U'     PERCENT OF BILLING ACCOUNT                
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPBWRK),C'U'     PERCENT OF BILLING WORKCODE               
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNFNT),C'U'       FORCE NARRATIVE IN TIME                   
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNNJB),C'U'    (MCS) NO JOB INPUT ALLOWED IN TIME           
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNCEAMB),C'U'  JDASH AMBER WHEN REACH CE %                  
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNCERED),C'U'  JDASH RED WHEN REACH CE %                    
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNCERCH),C'U'  EMAIL WHEN REACH CE %                        
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNINACT),C'U'  EMAIL WHEN DAYS INACTIVE                     
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
*                                                                               
         DC    AL1(OPNLDEST),C'U'  JOB LOCK DEFAULT ESTIMATES                   
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNLDORD),C'U'  JOB LOCK DEFAULT ORDERS                      
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNLDBIL),C'U'  JOB LOCK DEFAULT BILLING                     
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNLDTSI),C'U'  JOB LOCK DEFAULT TIMESHEETS                  
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNLDADJ),C'U'  JOB LOCK DEFAULT ADJUSTMENTS                 
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNLDEXT),C'U'  JOB LOCK DEFAULT EXTERNAL COSTS              
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNJLE),C'U'  NO JOB LEVEL ENTRY FOR HOUSE                   
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
*                                                                               
         DC    AL1(OPNDIOS),C'U'  DASHBOARD INCLUDE ORDER STATUS                
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDITSR),C'U' DASHBOARD INCL R TIME STATUS                  
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDITSB),C'U' DASHBOARD INCL B TIME STATUS                  
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDITSN),C'U' DASHBOARD INCL N TIME STATUS                  
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDIEN),C'U'  DASHBOARD INCL N-BILL EXPENSE                 
         DC    AL1(OPTLFILE+OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                
         DC    AL1(OPNDIEB),C'U'  DASHBOARD INCL BILL EXPENSE                   
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDIEO),C'U'  DASHBOARD INCL EXPENSE ORDERS                 
         DC    AL1(OPTLFILE+OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                
         DC    AL1(OPNDEIS),C'U'  DISPLAY EXPENSE INVOICES                      
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNIAES),C'U'  INTERNAL APPROVAL IN ESTIMATES                
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNIUSO),C'U'  NTERNAL USE ONLY DRAFT STATUS                 
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNIDRF),C'U'  DRAFT JOBS                                    
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNACUA),C'U'  AUTO COPY FROM UNCOMMIT AMTS                  
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNAEDT),C'U'  ALLOW ESTIMATES WITH DRFT JOB                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNSRQ),C'U'   ORDERS-SUPPLIER REQ TO SUBMIT                 
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNXRQ),C'U'   EXPENSE REQ'D TO SUBMIT                       
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEVS),C'U'   EXPENSE A/C VIS TO SUBMITTER                  
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNSAP),C'U'   SEQUENTIAL APPROVERS                          
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEWE),C'U'   EST CHECK ERROR WARNING                       
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNECE),C'U'   EST CHECK TYPE                                
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEORM),C'U'  ESTIMATE CHECK MEMO ORDERS                    
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEORN),C'U'  ESTIMATE CHECK NON-MEM ORD                    
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNETMR),C'U'  ESTIMATE CHECK R TIME                         
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNETMB),C'U'  ESTIMATE CHECK B TIME                         
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEXPN),C'U'  EST CHECK NON BILL EXPENSES                   
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEXPB),C'U'  EST CHECK BILLABLE EXPENSES                   
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEMIN),C'U'  ESTIMATE CHECK MEMO INVOICES                  
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNSLA),C'U'   ALLOW SELF APPROVAL                           
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNRQU),C'U'   REQUISITION NO. IN USE                        
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNRQP),C'U'   REQUISITION PREFIX                            
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNRQS),C'U'   REQUISITION SUFFIX                            
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNENC),C'U'   EST NO COMPLUSORY                             
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEWC),C'U'   EST W/C INPUT                                 
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNPAU),C'U'   PRODUCTION AUTO APPROVAL                      
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEAU),C'U'   EXPENSE AUTO APPROVAL                         
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNWCF),C'U'   USE WC FLAG FOR EST CHECK                     
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNPZO),C'U'   PREVENT ZERO ORDER AMOUNT                     
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNOIT),C'U'   USE ITEMS IN ORDERS                           
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNOAN),C'U'   ORDER ANALYSIS                                
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNOAI),C'U'   ORDERS ALL ITEMS                              
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNNTJA),C'U'  NOTIFY TEAM WHEN JOB APPROVED                 
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNCECE),C'U'  COPT ESTIMATE COPY EXTRA DATA                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNUESOA),C'U' USE ESTIMATE STATUS IN ORD APP                
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNCOES),C'U'  (MCS) CREATE ORDER FROM EST STATUS            
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNDCTEO),C'U'  (MCS) DEFT COPY TXT FROM EST TO ORD          
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNBIEA),C'U'  (MCS) BYPASS INTERNAL ESTIMATE APP            
         DC    AL1(OPTLBILL+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNBCEA),C'U'  (MCS) BYPASS CLIENT ESTIMATE APP              
         DC    AL1(OPTLBILL+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNINCR),C'U'  (MCS) INCLUDE R TIME IN EST, % COMM           
         DC    AL1(OPTLBILL),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNGAPS),C'U'  (MCS) GAP SERVICE IN USE?                     
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNDFEXS),C'U' (MCS) DEFAULT EXPIRATION PERIOD?              
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNDNDVC),C'U' (MCS) DEFAULT # DAYS TO VIEW EST              
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNGAPRA),C'U' (MCS) GAP APPROVAL REQUIRED BY ALL            
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNSPWPD),C'U' (MCS) SUPPRESS W/C PRINTING DEFAULT           
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNDFEXO),C'U' MCS) DEFAULT EXP PERIOD ORDERS?               
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNGEMEX),C'U' (MCS) EMAIL ESTENSION REQUIRED?               
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNGEMDS),C'U' (MCS) EMAIL DISCLAIMER REQUIRED?              
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNUCWC),C'U'  (MCS) USE ACTUALS FOR W/C WHEN ACTUAL         
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNDDSC),C'U' (MCS) DISPLAY JOB DESCRIPTION ON PDF           
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNJ3RD),C'U' JOB AVAILABLE TO 3RD PARTY                     
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNPBT),C'U'  DO NOT MOVE BILLED TIME                        
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY),AL1(OPTL53)                      
         DC    AL1(OPNPROE),C'U' (MCS) PRINT RATES ON ESTIMATES                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNCCW),C'U'  (MCS) COLOR CODED WCS IN ESTIMATES             
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEXM),C'U'   (MCS) EXCLUDE MEMO CHARGES                    
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNFPORE),C'U' (MCS) FULLY APPROVED ORDER RESUBMIT           
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNPPORE),C'U' (MCS) PART APPROVED ORDER RESUBMIT            
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNMPORE),C'U' (MCS) MATCHED ORDER RESUBMIT                  
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNUSD),C'U' PRINT USD ON BILL                               
         DC    AL1(OPTLBILL),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNSJOF),C'U' USE SJ OFFICE FOR RATES                        
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY),AL1(0)                            
         DC    AL1(OPNEPAJ),C'U' EMAIL IF PERSON ASSIGNED TO JOB                
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNEEDT),C'U' DATE EST IN LAST FISCAL YEAR                   
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
*                                                                               
OFFTABX  DC    X'FF'                                                            
         EJECT                                                                  
         DC    Y((CLITABX-CLITAB)/L'CLITAB)                                     
CLITAB   DS    0CL(OPTLISTL)          CLIENT OPTIONS                            
         DC    AL1(OPNCOM),C'U'       AGENCY COMMISSION RATE                    
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNUNBWC),C'U'     UNBILLABLE WORK CODE LIST                 
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNBT),C'U'        BILLING TYPE                              
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNDUE),C'U'       NUMBER OF DAYS BILL DUE                   
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNOVPER),C'U'     MAXIMUM PERCENT OVER ESTIMATE             
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNOVAMT),C'U'     MAXIMUM AMOUNT OVER ESTIMATE              
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNEEDES),C'U'     ESTIMATE NEEDED FOR BILLS                 
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNBFUN),C'U'      NEED JOB FUNDING TO BILL                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPAB),C'U'      PRINT AUTHORIZATION # ON BILL              
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNANT),C'U'      AUTHORZATION NUMBER TITLE                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNMIN),C'U'       MINIMUM BILL AMOUNT                       
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNCLSUM),C'U'     CLIENT SUMMARY ON BILLS                   
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPRSUM),C'U'     PRODUCT SUMMARY ON BILLS                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNDET),C'U'       SHOW DETAIL LINES ON BILLS                
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPN99S),C'U'       SUPPRESS PREVIOUS BILLING                 
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNWCNES),C'U'     SHOW WORK CODE ON EST. BILLS              
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNCD),C'U'        PASS CASH DISCOUNT TO CLIENT              
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNET),C'U'        PAY AGENCY NET                            
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNSUPAG),C'U'     SUPPRESS AGENCY COMMISSION                
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNJG),C'U'        JOB GROUP                                 
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNCLITY),C'U'     NEW BUSINESS OR PRO BONO                  
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNTBC),C'U'       TIME BILLING COMMISSION ACCOUNT           
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNAUTTA),C'U'     AUTOMATIC ESTIMATE TURN-AROUND            
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESCM),C'U'      ESTIMATE BILLS COMMISSIONABLE             
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNEWJUN),C'U'     NEW JOBS ARE UNAPPROVED?                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNZERO),C'U'      ZERO BILLINGS AMOUNT                      
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNAUTUN),C'U'     AUTO UNHOLD WHEN BILLING                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNEWBT),C'U'      NEW BILL TYPE FOR % ESTIMATE              
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNFILT2),C'U'     FILTER 2 WHEN EST TO TOTAL                
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNWCA21),C'U'     PRINT WORK CODE NO. ON AC21               
         DC    AL1(OPTLBILL),C'C',AL1(CTRYGBR,0)                                
         DC    AL1(OPNGST),C'U'       GST OUTPUT TYPE                           
         DC    AL1(OPTLBILL),C'A',AL1(CTRYCAN,0)                                
         DC    AL1(OPNPST),C'U'       PST PROVINCE/OUTPUT CODE                  
         DC    AL1(OPTLBILL),C'A',AL1(CTRYCAN,0)                                
         DC    AL1(OPNPROD),C'U'      PRODUCTION JOBS OK TO ADD?                
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNEDI),C'U'       ELIGIBLE FOR EDI?                         
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNSUPST),C'U'     SUPPRESS STICKY LABELS?                   
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNAUADD),C'U'     DAYS TO ADD FOR AUTO JOB CLOSE            
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNAUTO),C'U'      AUTO JOB JUMBERING ALLOWED                
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNDIST),C'U'      DISTRIBUTION SCHEME CODE                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNINCCR),C'U'     BILLING INCOME ACCOUNT                    
         DC    AL1(OPTLBILL+OPTLDDS),C'C',AL1(CTRYANY,0)                        
         DC    AL1(OPNINCDR),C'U'     BILLING DEBIT ACCOUNT                     
         DC    AL1(OPTLBILL+OPTLDDS),C'C',AL1(CTRYANY,0)                        
         DC    AL1(OPNEEDAE),C'U'     NEED APPROVED ESTIMATE TO BILL            
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNBATCH),C'U'     NEED APPROVED ESTIMATE TO BATCH           
         DC    AL1(OPTLFILE),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNESTYP),C'U'     ESTIMATE TYPE FOR NEW JOBS                
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNADDP),C'U'      ADD HOW MANY P'S AT JOB ADD               
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNADDR),C'U'      ADD R1 WHEN ADDING JOB?                   
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNCLIST),C'U'     DEFAULT COLUMN LIST                       
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNJSUM),C'U'      JOB SUMMARY COLUMN LIST                   
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNJSUMC),C'U'      JOB SUMMARY COLUMN LIST (CONT)           
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESTRE),C'U'     ESTIMATE REPORT DEFAULT                   
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNSCH),C'U'       SCHEME FOR ESTIMATING                     
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNETIP),C'U'      ESTIMATE TITLE PANEL                      
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESTP),C'U'      ESTIMATE SUB-TITLE PANEL                  
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEHDP),C'U'      ESTIMATE HEADER PANEL                     
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESHP),C'U'      ESTIMATE SUB-HEADER PANEL                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEFTP),C'U'      ESTIMATE FOOTER PANEL                     
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESFP),C'U'      ESTIMATE SUB-FOOTER PANEL                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNREPFO),C'U'     BRAND OCEAN REPORT FORMAT CODE            
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEAPP),C'U'      APPROVE ESTIMATE                          
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEPRP),C'P'      ADD PREPARER MF OR PRESTO                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNTXTSC),C'U'     TEXT SCROLLING SEQUENCE                   
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNAWO),C'U'       AWO AUTOMATIC WRITE OFF                   
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWA),C'U'       AWO ACCOUNT                               
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWFOF),C'U'     AWO FINANCIAL OFFICE                      
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWAOF),C'U'     AWO ANALYSIS OFFICE                       
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWDEP),C'U'     AWO ANALYSIS DEPARTMENT                   
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWSTF),C'U'     AWO ANALYSIS STAFF                        
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNTOT),C'U'       DEFAULT TYPE FOR TIME SHEETS              
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNFPT),C'U'       FORCE PRODUCT ON TIME SHEETS              
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNFJT),C'U'       FORCE JOB ON TIME SHEETS                  
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNTAX),C'U'       TAX REQUIRED                              
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNTXWC),C'U'      TAX WORKCODE                              
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNTXLOC),C'U'     TAX LOCALITY CODE                         
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNBASE),C'U'      WORKCODE BASIS UNITS/HOURS                
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNICA),C'U'       INPUT CREDIT ACCOUNT                      
         DC    AL1(OPTLSTUD+OPTLFILE),C'A',AL1(CTRYANY,0)                       
         DC    AL1(OPNINT),C'U'       STUDIO INTERCOMPANY POSTINGS              
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNBDB),C'U'       INTERCOMPANY DEBIT ACCOUNT                
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNICR),C'U'       INTERCOMPANY CREDIT ACCOUNT               
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNSTUD),C'P'      IS THIS STUDIO JOB                        
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNHOLD),C'U'      HOLD AGENCY DEBITS                        
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNTYPE),C'U'      STUDIO TYPE CODE                          
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNORDER),C'P'     ALLOW BACK DATED ORDER                    
         DC    AL1(OPTLORD),C'A',AL1(CTRYANY,0)                                 
*                                                                               
*                                  CLIENT BILLING OPTIONS                       
*                                                                               
         DC    AL1(OPNTWCTP),C'U'     TIME WORKCODE TYPES                       
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNEXTAC),C'U'     WRITE-OFF ACCOUNT (TIME)                  
         DC    AL1(OPTLBILL),C'F',AL1(CTRYANY,0)                                
         DC    AL1(OPNEXOAC),C'U'     WRITE-OFF ACCOUNT (OTHER)                 
         DC    AL1(OPTLBILL),C'F',AL1(CTRYANY,0)                                
         DC    AL1(OPNWOOAC),C'U'     WRITE-OFF CONTROL ACCOUNT (OTHER)         
         DC    AL1(OPTLBILL),C'F',AL1(CTRYANY,0)                                
         DC    AL1(OPNASPCT),C'U'     ADMINISTRATIVE SURCHARGE %                
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNASACC),C'U'     INCOME ACCOUNT TO POST S/C TO             
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNASWRK),C'U'     WORKCODE TO POST S/C TO                   
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNASBIL),C'U'     POST ASP ON CURRENT BILL                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPBPCT),C'U'     PERCENT OF BILLING PERCENTAGE             
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPBACC),C'U'     PERCENT OF BILLING ACCOUNT                
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPBWRK),C'U'     PERCENT OF BILLING WORKCODE               
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNFNT),C'U'       FORCE NARRATIVE IN TIME                   
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNTTA),C'U'    (MCS) TYPE OF TIME ALLOWED                   
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNNJB),C'U'    (MCS) NO JOB INPUT ALLOWED IN TIME           
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNCEAMB),C'U'  JDASH AMBER WHEN REACH CE %                  
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNCERED),C'U'  JDASH RED WHEN REACH CE %                    
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNCERCH),C'U'  EMAIL WHEN REACH CE %                        
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNINACT),C'U'  EMAIL WHEN DAYS INACTIVE                     
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
*                                                                               
         DC    AL1(OPNLDEST),C'U'  JOB LOCK DEFAULT ESTIMATES                   
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNLDORD),C'U'  JOB LOCK DEFAULT ORDERS                      
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNLDBIL),C'U'  JOB LOCK DEFAULT BILLING                     
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNLDTSI),C'U'  JOB LOCK DEFAULT TIMESHEETS                  
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNLDADJ),C'U'  JOB LOCK DEFAULT ADJUSTMENTS                 
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNLDEXT),C'U'  JOB LOCK DEFAULT EXTERNAL COSTS              
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNJLE),C'U'  NO JOB LEVEL ENTRY FOR HOUSE                   
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNBIO),C'U'  ITEM IS BILLABLE ONLY                          
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
*                                                                               
         DC    AL1(OPNDIOS),C'U'  DASHBOARD INCLUDE ORDER STATUS                
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDITSR),C'U' DASHBOARD INCL R TIME STATUS                  
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDITSB),C'U' DASHBOARD INCL B TIME STATUS                  
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDITSN),C'U' DASHBOARD INCL N TIME STATUS                  
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDIEN),C'U'  DASHBOARD INCL N-BILL EXPENSE                 
         DC    AL1(OPTLFILE+OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                
         DC    AL1(OPNDIEB),C'U'  DASHBOARD INCL BILL EXPENSE                   
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDIEO),C'U'  DASHBOARD INCL EXPENSE ORDERS                 
         DC    AL1(OPTLFILE+OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                
         DC    AL1(OPNDEIS),C'U'  DISPLAY EXPENSE INVOICES                      
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNIAES),C'U'  INTERNAL APPROVAL IN ESTIMATES                
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNIUSO),C'U'  NTERNAL USE ONLY DRAFT STATUS                 
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNIDRF),C'U'  DRAFT JOBS                                    
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNACUA),C'U'  AUTO COPY FROM UNCOMMIT AMTS                  
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNAEDT),C'U'  ALLOW ESTIMATES WITH DRFT JOB                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNSRQ),C'U'   ORDERS-SUPPLIER REQ TO SUBMIT                 
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEVS),C'U'   EXPENSE A/C VIS TO SUBMITTER                  
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEWE),C'U'   EST CHECK ERROR WARNING                       
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNECE),C'U'   EST CHECK TYPE                                
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEORM),C'U'  ESTIMATE CHECK MEMO ORDERS                    
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEORN),C'U'  ESTIMATE CHECK NON-MEM ORD                    
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNETMR),C'U'  ESTIMATE CHECK R TIME                         
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNETMB),C'U'  ESTIMATE CHECK B TIME                         
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEXPN),C'U'  EST CHECK NON BILL EXPENSES                   
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEXPB),C'U'  EST CHECK BILLABLE EXPENSES                   
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEMIN),C'U'  ESTIMATE CHECK MEMO INVOICES                  
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNSLA),C'U'   ALLOW SELF APPROVAL                           
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNRQU),C'U'   REQUISITION NO. IN USE                        
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNENC),C'U'   EST NO COMPLUSORY                             
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNPAU),C'U'   PRODUCTION AUTO APPROVAL                      
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEAU),C'U'   EXPENSE AUTO APPROVAL                         
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNWCF),C'U'   USE WC FLAG FOR EST CHECK                     
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNPZO),C'U'   PREVENT ZERO ORDER AMOUNT                     
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNOIT),C'U'   USE ITEMS IN ORDERS                           
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNOAN),C'U'   ORDER ANALYSIS                                
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNNTJA),C'U'  NOTIFY TEAM WHEN JOB APPROVED                 
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNCECE),C'U'  COPT ESTIMATE COPY EXTRA DATA                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNUESOA),C'U' USE ESTIMATE STATUS IN ORD APP                
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNCOES),C'U'  (MCS) CREATE ORDER FROM EST STATUS            
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNDCTEO),C'U'  (MCS) DEFT COPY TXT FROM EST TO ORD          
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNBIEA),C'U'  (MCS) BYPASS INTERNAL ESTIMATE APP            
         DC    AL1(OPTLBILL+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNBCEA),C'U'  (MCS) BYPASS CLIENT ESTIMATE APP              
         DC    AL1(OPTLBILL+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNINCR),C'U'  (MCS) INCLUDE R TIME IN EST, % COMM           
         DC    AL1(OPTLBILL),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNGAPS),C'U'  (MCS) GAP SERVICE IN USE?                     
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNDFEXS),C'U' (MCS) DEFAULT EXPIRATION PERIOD?              
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNDNDVC),C'U' (MCS) DEFAULT # DAYS TO VIEW EST              
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNGAPRA),C'U' (MCS) GAP APPROVAL REQUIRED BY ALL            
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNSPWPD),C'U' (MCS) SUPPRESS W/C PRINTING DEFAULT           
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
*        DC    AL1(OPNDFEXO),C'U' MCS) DEFAULT EXP PERIOD ORDERS?               
*        DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNGEMEX),C'U' (MCS) EMAIL ESTENSION REQUIRED?               
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNGEMDS),C'U' (MCS) EMAIL DISCLAIMER REQUIRED?              
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNUCWC),C'U'  (MCS) USE ACTUALS FOR W/C WHEN ACTUAL         
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNDDSC),C'U' (MCS) DISPLAY JOB DESCRIPTION ON PDF           
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNJ3RD),C'U' JOB AVAILABLE TO 3RD PARTY                     
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNPBT),C'U'  DO NOT MOVE BILLED TIME                        
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY),AL1(OPTL53)                      
         DC    AL1(OPNPROE),C'U' (MCS) PRINT RATES ON ESTIMATES                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNCCW),C'U'  (MCS) COLOR CODED WCS IN ESTIMATES             
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEXM),C'U'   (MCS) EXCLUDE MEMO CHARGES                    
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNFPORE),C'U' (MCS) FULLY APPROVED ORDER RESUBMIT           
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNPPORE),C'U' (MCS) PART APPROVED ORDER RESUBMIT            
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNMPORE),C'U' (MCS) MATCHED ORDER RESUBMIT                  
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNUSD),C'U' PRINT USD ON BILL                               
         DC    AL1(OPTLBILL),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNSJOF),C'U' USE SJ OFFICE FOR RATES                        
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY),AL1(0)                            
         DC    AL1(OPNEPAJ),C'U' EMAIL IF PERSON ASSIGNED TO JOB                
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNEEDT),C'U' DATE EST IN LAST FISCAL YEAR                   
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
*                                                                               
CLITABX  DC    X'FF'                                                            
         EJECT                                                                  
         DC    Y((PROTABX-PROTAB)/L'PROTAB)                                     
PROTAB   DS    0CL(OPTLISTL)          PRODUCT LEVEL OPTIONS                     
         DC    AL1(OPNCOM),C'U'       AGENCY COMMISSION RATE                    
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNUNBWC),C'U'     UNBILLABLE WORK CODE LIST                 
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNBT),C'U'        BILLING TYPE                              
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNDUE),C'U'       NUMBER OF DAYS BILL DUE                   
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNOVPER),C'U'     MAXIMUM PERCENT OVER ESTIMATE             
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNOVAMT),C'U'     MAXIMUM AMOUNT OVER ESTIMATE              
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNEEDES),C'U'     ESTIMATE NEEDED FOR BILLS                 
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNBFUN),C'U'      NEED JOB FUNDING TO BILL                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPAB),C'U'      PRINT AUTHORIZATION # ON BILL              
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNANT),C'U'      AUTHORZATION NUMBER TITLE                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNMIN),C'U'       MINIMUM BILL AMOUNT                       
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNCLSUM),C'P'     CLIENT SUMMARY ON BILLS                   
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPRSUM),C'U'     PRODUCT SUMMARY ON BILLS                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNDET),C'U'       SHOW DETAIL LINES ON BILLS                
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPN99S),C'U'       SUPPRESS PREVIOUS BILLING                 
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNWCNES),C'P'     SHOW WORK CODE ON EST. BILLS              
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNCD),C'P'        PASS CASH DISCOUNT TO CLIENT              
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNET),C'U'        PAYMENTS ARE NET?                         
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNSUPAG),C'P'     SUPPRESS AGENCY COMMISSION                
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNJG),C'U'        JOB GROUP                                 
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNCLITY),C'P'     NEW BUSINESS OR PRO BONO                  
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNTBC),C'P'       TIME BILLING COMMISSION ACCOUNT           
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNAUTTA),C'U'     AUTOMATIC ESTIMATE TURN-AROUND            
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESCM),C'U'      ESTIMATE BILLS COMMISSIONABLE             
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNEWJUN),C'P'     NEW JOBS ARE UNAPPROVED?                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNZERO),C'P'      ZERO BILLINGS AMOUNT                      
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNAUTUN),C'P'     AUTO UNHOLD WHEN BILLING                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNEWBT),C'U'      NEW BILL TYPE FOR % ESTIMATE              
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNFILT2),C'U'     FILTER 2 WHEN EST TO TOTAL                
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNWCA21),C'U'     PRINT WORK CODE NO. ON AC21               
         DC    AL1(OPTLBILL),C'C',AL1(CTRYGBR,0)                                
         DC    AL1(OPNGST),C'U'       GST OUTPUT TAX TYPE                       
         DC    AL1(OPTLBILL),C'A',AL1(CTRYCAN,0)                                
         DC    AL1(OPNPST),C'U'       PST PROVINCE/OUTPUT CODE                  
         DC    AL1(OPTLBILL),C'A',AL1(CTRYCAN,0)                                
         DC    AL1(OPNPROD),C'U'      PRODUCTION JOBS OK TO ADD?                
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNEDI),C'U'       ELIGIBLE FOR EDI?                         
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNSUPST),C'P'     SUPPRESS STICKY LABELS?                   
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNAUADD),C'P'     DAYS TO ADD FOR AUTO JOB CLOSE            
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNAUTO),C'U'      AUTO JOB JUMBERING ALLOWED                
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNDIST),C'U'      DISTRIBUTION SCHEME CODE                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNINCCR),C'U'     BILLING INCOME ACCOUNT                    
         DC    AL1(OPTLBILL+OPTLDDS),C'C',AL1(CTRYANY,0)                        
         DC    AL1(OPNINCDR),C'U'     BILLING DEBIT ACCOUNT                     
         DC    AL1(OPTLBILL+OPTLDDS),C'C',AL1(CTRYANY,0)                        
         DC    AL1(OPNEEDAE),C'U'     NEED APPROVED ESTIMATE TO BILL            
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNBATCH),C'U'     NEED APPROVED ESTIMATE TO BATCH           
         DC    AL1(OPTLFILE),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNESTYP),C'U'     ESTIMATE TYPE FOR NEW JOBS                
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNADDP),C'U'      ADD HOW MANY P'S AT JOB ADD               
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNADDR),C'U'      ADD R1 WHEN ADDING JOB?                   
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNCLIST),C'U'     DEFAULT COLUMN LIST                       
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNJSUM),C'U'      JOB SUMMARY COLUMN LIST                   
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNJSUMC),C'U'     JOB SUMMARY COLUMN LIST (CONT)            
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESTRE),C'U'     ESTIMATE REPORT DEFAULT                   
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNSCH),C'U'       SCHEME FOR ESTIMATING                     
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNETIP),C'U'      ESTIMATE TITLE PANEL                      
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESTP),C'U'      ESTIMATE SUB-TITLE PANEL                  
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEHDP),C'U'      ESTIMATE HEADER PANEL                     
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESHP),C'U'      ESTIMATE SUB-HEADER PANEL                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEFTP),C'U'      ESTIMATE FOOTER PANEL                     
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNREPFO),C'U'     BRAND OCEAN REPORT FORMAT CODE            
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESFP),C'U'      ESTIMATE SUB-FOOTER PANEL                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEAPP),C'U'      APPROVE ESTIMATE                          
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEPRP),C'P'      ADD PREPARER MF OR PRESTO                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNTXTSC),C'U'     TEXT SCROLLING SEQUENCE                   
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNAWO),C'U'       AWO AUTOMATIC WRITE OFF                   
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWA),C'U'       AWO ACCOUNT                               
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWFOF),C'U'     AWO FINANCIAL OFFICE                      
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWAOF),C'U'     AWO ANALYSIS OFFICE                       
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWDEP),C'U'     AWO ANALYSIS DEPARTMENT                   
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWSTF),C'U'     AWO ANALYSIS STAFF                        
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNTOT),C'U'       DEFAULT TYPE FOR TIME SHEETS              
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNFPT),C'P'       FORCE PRODUCT ON TIME SHEETS              
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNFJT),C'U'       FORCE JOB ON TIME SHEETS                  
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNTAX),C'U'       TAX REQUIRED                              
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNTXWC),C'U'      TAX WORKCODE                              
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNTXLOC),C'U'     TAX LOCALITY CODE                         
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNBASE),C'U'      WORKCODE BASIS UNITS/HOURS                
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNICA),C'U'       INPUT CREDIT ACCOUNT                      
         DC    AL1(OPTLSTUD+OPTLFILE),C'A',AL1(CTRYANY,0)                       
         DC    AL1(OPNINT),C'P'       STUDIO INTERCOMPANY POSTINGS              
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNBDB),C'U'       INTERCOMPANY DEBIT ACCOUNT                
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNICR),C'U'       INTERCOMPANY CREDIT ACCOUNT               
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNSTUD),C'P'      IS THIS STUDIO JOB                        
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNHOLD),C'U'      HOLD AGENCY DEBITS                        
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNTYPE),C'U'      STUDIO TYPE CODE                          
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNORDER),C'P'     ALLOW BACK DATED ORDER                    
         DC    AL1(OPTLORD),C'A',AL1(CTRYANY,0)                                 
*                                                                               
*                                  CLIENT BILLING OPTIONS                       
*                                                                               
         DC    AL1(OPNTWCTP),C'U'     TIME WORKCODE TYPES                       
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNEXTAC),C'U'     WRITE-OFF ACCOUNT (TIME)                  
         DC    AL1(OPTLBILL),C'F',AL1(CTRYANY,0)                                
         DC    AL1(OPNEXOAC),C'U'     WRITE-OFF ACCOUNT (OTHER)                 
         DC    AL1(OPTLBILL),C'F',AL1(CTRYANY,0)                                
         DC    AL1(OPNWOOAC),C'U'     WRITE-OFF CONTROL ACCOUNT (OTHER)         
         DC    AL1(OPTLBILL),C'F',AL1(CTRYANY,0)                                
         DC    AL1(OPNASPCT),C'U'     ADMINISTRATIVE SURCHARGE %                
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNASACC),C'U'     INCOME ACCOUNT TO POST S/C TO             
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNASWRK),C'U'     WORKCODE TO POST S/C TO                   
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNASBIL),C'U'     POST ASP ON CURRENT BILL                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPBPCT),C'U'     PERCENT OF BILLING PERCENTAGE             
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPBACC),C'U'     PERCENT OF BILLING ACCOUNT                
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPBWRK),C'U'     PERCENT OF BILLING WORKCODE               
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNFNT),C'U'       FORCE NARRATIVE IN TIME                   
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNTTA),C'U'    (MCS) TYPE OF TIME ALLOWED                   
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNNJB),C'U'    (MCS) NO JOB INPUT ALLOWED IN TIME           
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNCEAMB),C'U'  JDASH AMBER WHEN REACH CE %                  
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNCERED),C'U'  JDASH RED WHEN REACH CE %                    
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNCERCH),C'U'  EMAIL WHEN REACH CE %                        
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNINACT),C'U'  EMAIL WHEN DAYS INACTIVE                     
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
*                                                                               
         DC    AL1(OPNLDEST),C'U'  JOB LOCK DEFAULT ESTIMATES                   
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNLDORD),C'U'  JOB LOCK DEFAULT ORDERS                      
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNLDBIL),C'U'  JOB LOCK DEFAULT BILLING                     
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNLDTSI),C'U'  JOB LOCK DEFAULT TIMESHEETS                  
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNLDADJ),C'U'  JOB LOCK DEFAULT ADJUSTMENTS                 
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNLDEXT),C'U'  JOB LOCK DEFAULT EXTERNAL COSTS              
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNJLE),C'U'  NO JOB LEVEL ENTRY FOR HOUSE                   
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNBIO),C'U'  ITEM IS BILLABLE ONLY                          
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
*                                                                               
         DC    AL1(OPNDIOS),C'U'  DASHBOARD INCLUDE ORDER STATUS                
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDITSR),C'U' DASHBOARD INCL R TIME STATUS                  
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDITSB),C'U' DASHBOARD INCL B TIME STATUS                  
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDITSN),C'U' DASHBOARD INCL N TIME STATUS                  
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDIEN),C'U'  DASHBOARD INCL N-BILL EXPENSE                 
         DC    AL1(OPTLFILE+OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                
         DC    AL1(OPNDIEB),C'U'  DASHBOARD INCL BILL EXPENSE                   
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDIEO),C'U'  DASHBOARD INCL EXPENSE ORDERS                 
         DC    AL1(OPTLFILE+OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                
         DC    AL1(OPNDEIS),C'U'  DISPLAY EXPENSE INVOICES                      
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNIAES),C'U'  INTERNAL APPROVAL IN ESTIMATES                
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNIUSO),C'U'  NTERNAL USE ONLY DRAFT STATUS                 
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNIDRF),C'U'  DRAFT JOBS                                    
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNACUA),C'U'  AUTO COPY FROM UNCOMMIT AMTS                  
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNAEDT),C'U'  ALLOW ESTIMATES WITH DRFT JOB                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNSRQ),C'U'   ORDERS-SUPPLIER REQ TO SUBMIT                 
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEVS),C'U'   EXPENSE A/C VIS TO SUBMITTER                  
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEWE),C'U'   EST CHECK ERROR WARNING                       
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNECE),C'U'   EST CHECK TYPE                                
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEORM),C'U'  ESTIMATE CHECK MEMO ORDERS                    
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEORN),C'U'  ESTIMATE CHECK NON-MEM ORD                    
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNETMR),C'U'  ESTIMATE CHECK R TIME                         
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNETMB),C'U'  ESTIMATE CHECK B TIME                         
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEXPN),C'U'  EST CHECK NON BILL EXPENSES                   
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEXPB),C'U'  EST CHECK BILLABLE EXPENSES                   
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEMIN),C'U'  ESTIMATE CHECK MEMO INVOICES                  
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNSLA),C'U'   ALLOW SELF APPROVAL                           
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNRQU),C'U'   REQUISITION NO. IN USE                        
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNENC),C'U'   EST NO COMPLUSORY                             
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNPAU),C'U'   PRODUCTION AUTO APPROVAL                      
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEAU),C'U'   EXPENSE AUTO APPROVAL                         
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNWCF),C'U'   USE WC FLAG FOR EST CHECK                     
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNPZO),C'U'   PREVENT ZERO ORDER AMOUNT                     
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNOIT),C'U'   USE ITEMS IN ORDERS                           
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNOAN),C'U'   ORDER ANALYSIS                                
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNNTJA),C'U'  NOTIFY TEAM WHEN JOB APPROVED                 
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNCECE),C'U'  COPT ESTIMATE COPY EXTRA DATA                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNUESOA),C'U' USE ESTIMATE STATUS IN ORD APP                
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNCOES),C'U'  (MCS) CREATE ORDER FROM EST STATUS            
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNDCTEO),C'U' (MCS) DEFT COPY TXT FROM EST TO ORD           
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNBIEA),C'U'  (MCS) BYPASS INTERNAL ESTIMATE APP            
         DC    AL1(OPTLBILL+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNBCEA),C'U'  (MCS) BYPASS CLIENT ESTIMATE APP              
         DC    AL1(OPTLBILL+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNINCR),C'U'  (MCS) INCLUDE R TIME IN EST, % COMM           
         DC    AL1(OPTLBILL),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNGAPS),C'U'  (MCS) GAP SERVICE IN USE?                     
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNDFEXS),C'U' (MCS) DEFAULT EXPIRATION PERIOD?              
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNDNDVC),C'U' (MCS) DEFAULT # DAYS TO VIEW EST              
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNGAPRA),C'U' (MCS) GAP APPROVAL REQUIRED BY ALL            
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNSPWPD),C'U' (MCS) SUPPRESS W/C PRINTING DEFAULT           
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
*        DC    AL1(OPNDFEXO),C'U' MCS) DEFAULT EXP PERIOD ORDERS?               
*        DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNGEMEX),C'U' (MCS) EMAIL ESTENSION REQUIRED?               
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNGEMDS),C'U' (MCS) EMAIL DISCLAIMER REQUIRED?              
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNUCWC),C'U'  (MCS) USE ACTUALS FOR W/C WHEN ACTUAL         
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNDDSC),C'U' (MCS) DISPLAY JOB DESCRIPTION ON PDF           
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNJ3RD),C'U' JOB AVAILABLE TO 3RD PARTY                     
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNPBT),C'U'  DO NOT MOVE BILLED TIME                        
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY),AL1(OPTL53)                      
         DC    AL1(OPNPROE),C'U' (MCS) PRINT RATES ON ESTIMATES                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNCCW),C'U'  (MCS) COLOR CODED WCS IN ESTIMATES             
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEXM),C'U'   (MCS) EXCLUDE MEMO CHARGES                    
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNFPORE),C'U' (MCS) FULLY APPROVED ORDER RESUBMIT           
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNPPORE),C'U' (MCS) PART APPROVED ORDER RESUBMIT            
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNMPORE),C'U' (MCS) MATCHED ORDER RESUBMIT                  
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNUSD),C'U' PRINT USD ON BILL                               
         DC    AL1(OPTLBILL),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNSJOF),C'U' USE SJ OFFICE FOR RATES                        
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY),AL1(0)                            
         DC    AL1(OPNEPAJ),C'U' EMAIL IF PERSON ASSIGNED TO JOB                
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNEEDT),C'U' DATE EST IN LAST FISCAL YEAR                   
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
*                                                                               
PROTABX  DC    X'FF'                                                            
         EJECT                                                                  
         DC    Y((JOBTABX-JOBTAB)/L'JOBTAB)                                     
JOBTAB   DS    0CL(OPTLISTL)          JOB LEVEL OPTIONS                         
         DC    AL1(OPNCOM),C'U'       AGENCY COMMISSION RATE                    
         DC    AL1(OPTLFILE),C'B',AL1(CTRYANY,0)                                
         DC    AL1(OPNUNBWC),C'U'     UNBILLABLE WORK CODE LIST                 
         DC    AL1(OPTLFILE),C'B',AL1(CTRYANY,0)                                
         DC    AL1(OPNBT),C'U'        BILLING TYPE                              
         DC    AL1(OPTLBILL),C'D',AL1(CTRYANY,0)                                
         DC    AL1(OPNDUE),C'U'       NUMBER OF DAYS BILL DUE                   
         DC    AL1(OPTLBILL),C'D',AL1(CTRYANY,0)                                
         DC    AL1(OPNOVPER),C'U'     MAXIMUM PERCENT OVER ESTIMATE             
         DC    AL1(OPTLBILL),C'D',AL1(CTRYANY,0)                                
         DC    AL1(OPNOVAMT),C'U'     MAXIMUM AMOUNT OVER ESTIMATE              
         DC    AL1(OPTLBILL),C'D',AL1(CTRYANY,0)                                
         DC    AL1(OPNEEDES),C'U'     ESTIMATE NEEDED FOR BILLS                 
         DC    AL1(OPTLBILL),C'D',AL1(CTRYANY,0)                                
         DC    AL1(OPNBFUN),C'U'      NEED JOB FUNDING TO BILL                  
         DC    AL1(OPTLBILL),C'D',AL1(CTRYANY,0)                                
         DC    AL1(OPNPAB),C'U'      PRINT AUTHORIZATION # ON BILL              
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNANT),C'U'      AUTHORZATION NUMBER TITLE                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNMIN),C'U'       MINIMUM BILL AMOUNT                       
         DC    AL1(OPTLBILL),C'D',AL1(CTRYANY,0)                                
         DC    AL1(OPNCLSUM),C'P'     CLIENT SUMMARY ON BILLS                   
         DC    AL1(OPTLBILL),AL1(0),AL1(CTRYANY,0)                              
         DC    AL1(OPNPRSUM),C'P'     PRODUCT SUMMARY ON BILLS                  
         DC    AL1(OPTLBILL),AL1(0),AL1(CTRYANY,0)                              
         DC    AL1(OPNDET),C'P'       SHOW DETAIL LINES ON BILLS                
         DC    AL1(OPTLBILL),AL1(0),AL1(CTRYANY,0)                              
         DC    AL1(OPN99S),C'U'       SUPPRESS PREVIOUS BILLING                 
         DC    AL1(OPTLBILL),C'D',AL1(CTRYANY,0)                                
         DC    AL1(OPNWCNES),C'P'     SHOW WORK CODE ON EST. BILLS              
         DC    AL1(OPTLBILL),AL1(0),AL1(CTRYANY,0)                              
         DC    AL1(OPNCD),C'P'        PASS CASH DISCOUNT TO CLIENT              
         DC    AL1(OPTLFILE),AL1(0),AL1(CTRYANY,0)                              
         DC    AL1(OPNET),C'U'        PAYMENTS ARE NET?                         
         DC    AL1(OPTLBILL),C'D',AL1(CTRYANY,0)                                
         DC    AL1(OPNSUPAG),C'P'     SUPPRESS AGENCY COMMISSION                
         DC    AL1(OPTLBILL),AL1(0),AL1(CTRYANY,0)                              
         DC    AL1(OPNJG),C'U'        JOB GROUP                                 
         DC    AL1(OPTLBILL),C'D',AL1(CTRYANY,0)                                
         DC    AL1(OPNCLITY),C'P'     NEW BUSINESS OR PRO BONO                  
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNTBC),C'P'       TIME BILLING COMMISSION ACCOUNT           
         DC    AL1(OPTLBILL),C'D',AL1(CTRYANY,0)                                
         DC    AL1(OPNAUTTA),C'U'     AUTOMATIC ESTIMATE TURN-AROUND            
         DC    AL1(OPTLEST),C'F',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESCM),C'U'      ESTIMATE BILLS COMMISSIONABLE             
         DC    AL1(OPTLBILL),AL1(0),AL1(CTRYANY,0)                              
         DC    AL1(OPNEWJUN),C'P'     NEW JOBS ARE UNAPPROVED?                  
         DC    AL1(OPTLBILL),C'D',AL1(CTRYANY,0)                                
         DC    AL1(OPNZERO),C'P'      ZERO BILLINGS AMOUNT                      
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNAUTUN),C'P'     AUTO UNHOLD WHEN BILLING                  
         DC    AL1(OPTLBILL),AL1(0),AL1(CTRYANY,0)                              
         DC    AL1(OPNEWBT),C'P'      NEW BILL TYPE FOR % ESTIMATE              
         DC    AL1(OPTLBILL),AL1(0),AL1(CTRYANY,0)                              
         DC    AL1(OPNFILT2),C'P'     FILTER 2 WHEN EST TO TOTAL                
         DC    AL1(OPTLFILE),AL1(0),AL1(CTRYANY,0)                              
         DC    AL1(OPNWCA21),C'U'     PRINT WORK CODE NO. ON AC21               
         DC    AL1(OPTLBILL),C'D',AL1(CTRYGBR,0)                                
         DC    AL1(OPNGST),C'U'       GST OUTPUT TAX TYPE                       
         DC    AL1(OPTLBILL),C'B',AL1(CTRYCAN,0)                                
         DC    AL1(OPNPST),C'U'       PST PROVINCE/OUTPUT CODE                  
         DC    AL1(OPTLBILL),C'B',AL1(CTRYCAN,0)                                
         DC    AL1(OPNEDI),C'U'       ELIGIBLE FOR EDI?                         
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNSUPST),C'P'     SUPPRESS STICKY LABELS?                   
         DC    AL1(OPTLFILE),AL1(0),AL1(CTRYANY,0)                              
         DC    AL1(OPNAUADD),C'P'     DAYS TO ADD FOR AUTO JOB CLOSE            
         DC    AL1(OPTLFILE),AL1(0),AL1(CTRYANY,0)                              
         DC    AL1(OPNDIST),C'U'      DISTRIBUTION SCHEME CODE                  
         DC    AL1(OPTLBILL),C'D',AL1(CTRYANY,0)                                
         DC    AL1(OPNINCCR),C'U'     BILLING INCOME ACCOUNT                    
         DC    AL1(OPTLBILL+OPTLDDS),C'C',AL1(CTRYANY,0)                        
         DC    AL1(OPNINCDR),C'U'     BILLING DEBIT ACCOUNT                     
         DC    AL1(OPTLBILL+OPTLDDS),C'C',AL1(CTRYANY,0)                        
         DC    AL1(OPNEEDAE),C'U'     NEED APPROVED ESTIMATE TO BILL            
         DC    AL1(OPTLBILL),C'D',AL1(CTRYANY,0)                                
         DC    AL1(OPNBATCH),C'U'     NEED APPROVED ESTIMATE TO BATCH           
         DC    AL1(OPTLFILE),C'D',AL1(CTRYANY,0)                                
         DC    AL1(OPNESTYP),C'P'     ESTIMATE TYPE FOR NEW JOBS                
         DC    AL1(OPTLEST),C'D',AL1(CTRYANY,0)                                 
         DC    AL1(OPNADDP),C'P'      ADD HOW MANY P'S AT JOB ADD               
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNADDR),C'P'      ADD R1 WHEN ADDING JOB?                   
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNCLIST),C'U'     DEFAULT COLUMN LIST                       
         DC    AL1(OPTLEST),C'F',AL1(CTRYANY,0)                                 
         DC    AL1(OPNJSUM),C'U'      JOB SUMMARY COLUMN LIST                   
         DC    AL1(OPTLEST),C'F',AL1(CTRYANY,0)                                 
         DC    AL1(OPNJSUMC),C'U'     JOB SUMMARY COLUMN LIST (CONT)            
         DC    AL1(OPTLEST),C'F',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESTRE),C'U'     ESTIMATE REPORT DEFAULT                   
         DC    AL1(OPTLEST),C'F',AL1(CTRYANY,0)                                 
         DC    AL1(OPNSCH),C'U'       SCHEME FOR ESTIMATING                     
         DC    AL1(OPTLEST),C'F',AL1(CTRYANY,0)                                 
         DC    AL1(OPNETIP),C'U'      ESTIMATE TITLE PANEL                      
         DC    AL1(OPTLEST),C'F',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESTP),C'U'      ESTIMATE SUB-TITLE PANEL                  
         DC    AL1(OPTLEST),C'F',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEHDP),C'U'      ESTIMATE HEADER PANEL                     
         DC    AL1(OPTLEST),C'F',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESHP),C'U'      ESTIMATE SUB-HEADER PANEL                 
         DC    AL1(OPTLEST),C'F',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEFTP),C'U'      ESTIMATE FOOTER PANEL                     
         DC    AL1(OPTLEST),C'F',AL1(CTRYANY,0)                                 
         DC    AL1(OPNESFP),C'U'      ESTIMATE SUB-FOOTER PANEL                 
         DC    AL1(OPTLEST),C'F',AL1(CTRYANY,0)                                 
         DC    AL1(OPNREPFO),C'U'     BRAND OCEAN REPORT FORMAT CODE            
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEAPP),C'U'      APPROVE ESTIMATE                          
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEPRP),C'P'      ADD PREPARER MF OR PRESTO                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNTXTSC),C'U'     TEXT SCROLLING SEQUENCE                   
         DC    AL1(OPTLEST),C'F',AL1(CTRYANY,0)                                 
         DC    AL1(OPNAWO),C'U'       AWO AUTOMATIC WRITE OFF                   
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWA),C'U'       AWO ACCOUNT                               
         DC    AL1(OPTLFILE+OPTLEMU),C'B',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWFOF),C'U'     AWO FINANCIAL OFFICE                      
         DC    AL1(OPTLFILE+OPTLEMU),C'B',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWAOF),C'U'     AWO ANALYSIS OFFICE                       
         DC    AL1(OPTLFILE+OPTLEMU),C'B',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWDEP),C'U'     AWO ANALYSIS DEPARTMENT                   
         DC    AL1(OPTLFILE+OPTLEMU),C'B',AL1(CTRYANY,0)                        
         DC    AL1(OPNAWSTF),C'U'     AWO ANALYSIS STAFF                        
         DC    AL1(OPTLFILE+OPTLEMU),C'B',AL1(CTRYANY,0)                        
         DC    AL1(OPNTOT),C'U'       DEFAULT TYPE FOR TIME SHEETS              
         DC    AL1(OPTLFILE+OPTLEMU),C'B',AL1(CTRYANY,0)                        
         DC    AL1(OPNFPT),C'P'       FORCE PRODUCT ON TIME SHEETS              
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNFJT),C'P'       FORCE JOB ON TIME SHEETS                  
         DC    AL1(OPTLFILE+OPTLEMU),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPNTAX),C'U'       TAX REQUIRED                              
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNTXWC),C'U'      TAX WORKCODE                              
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNTXLOC),C'U'     TAX LOCALITY CODE                         
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNBASE),C'U'      WORKCODE BASIS UNITS/HOURS                
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNICA),C'U'       INPUT CREDIT ACCOUNT                      
         DC    AL1(OPTLSTUD+OPTLFILE),C'A',AL1(CTRYANY,0)                       
         DC    AL1(OPNINT),C'P'       STUDIO INTERCOMPANY POSTINGS              
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNBDB),C'U'       INTERCOMPANY DEBIT ACCOUNT                
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNICR),C'U'       INTERCOMPANY CREDIT ACCOUNT               
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNSTUD),C'P'      IS THIS STUDIO JOB                        
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNHOLD),C'U'      HOLD AGENCY DEBITS                        
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNTYPE),C'P'      STUDIO TYPE CODE                          
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNORDER),C'P'     ALLOW BACK DATED ORDER                    
         DC    AL1(OPTLORD),C'A',AL1(CTRYANY,0)                                 
*                                                                               
*                                  CLIENT BILLING OPTIONS                       
*                                                                               
         DC    AL1(OPNTWCTP),C'U'     TIME WORKCODE TYPES                       
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNEXTAC),C'U'     WRITE-OFF ACCOUNT (TIME)                  
         DC    AL1(OPTLBILL),C'F',AL1(CTRYANY,0)                                
         DC    AL1(OPNEXOAC),C'U'     WRITE-OFF ACCOUNT (OTHER)                 
         DC    AL1(OPTLBILL),C'F',AL1(CTRYANY,0)                                
         DC    AL1(OPNWOOAC),C'U'     WRITE-OFF CONTROL ACCOUNT (OTHER)         
         DC    AL1(OPTLBILL),C'F',AL1(CTRYANY,0)                                
         DC    AL1(OPNASPCT),C'U'     ADMINISTRATIVE SURCHARGE %                
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNASACC),C'U'     INCOME ACCOUNT TO POST S/C TO             
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNASWRK),C'U'     WORKCODE TO POST S/C TO                   
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNASBIL),C'U'     POST ASP ON CURRENT BILL                  
         DC    AL1(OPTLBILL),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNPBPCT),C'U'     PERCENT OF BILLING PERCENTAGE             
         DC    AL1(OPTLBILL),C'D',AL1(CTRYANY,0)                                
         DC    AL1(OPNPBACC),C'U'     PERCENT OF BILLING ACCOUNT                
         DC    AL1(OPTLBILL),C'D',AL1(CTRYANY,0)                                
         DC    AL1(OPNPBWRK),C'U'     PERCENT OF BILLING WORKCODE               
         DC    AL1(OPTLBILL),C'D',AL1(CTRYANY,0)                                
         DC    AL1(OPNSELES),C'U'     BRAND OCEAN SELECTED ESTIMATES            
         DC    AL1(OPTLBILL+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNFNT),C'U'       FORCE NARRATIVE IN TIME                   
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNTTA),C'U'    (MCS) TYPE OF TIME ALLOWED                   
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNCEAMB),C'U'  JDASH AMBER WHEN REACH CE %                  
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNCERED),C'U'  JDASH RED WHEN REACH CE %                    
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNCERCH),C'U'  EMAIL WHEN REACH CE %                        
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNINACT),C'U'  EMAIL WHEN DAYS INACTIVE                     
         DC    AL1(OPTLFILE+OPTLDDS),C'E',AL1(CTRYANY,0)                        
*                                                                               
         DC    AL1(OPNDIOS),C'U'  DASHBOARD INCLUDE ORDER STATUS                
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDITSR),C'U' DASHBOARD INCL R TIME STATUS                  
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDITSB),C'U' DASHBOARD INCL B TIME STATUS                  
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDITSN),C'U' DASHBOARD INCL N TIME STATUS                  
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDIEN),C'U'  DASHBOARD INCL N-BILL EXPENSE                 
         DC    AL1(OPTLFILE+OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                
         DC    AL1(OPNDIEB),C'U'  DASHBOARD INCL BILL EXPENSE                   
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNDIEO),C'U'  DASHBOARD INCL EXPENSE ORDERS                 
         DC    AL1(OPTLFILE+OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                
         DC    AL1(OPNDEIS),C'U'  DISPLAY EXPENSE INVOICES                      
         DC    AL1(OPTLFILE+OPTLEST),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNIAES),C'U'  INTERNAL APPROVAL IN ESTIMATES                
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNIUSO),C'U'  NTERNAL USE ONLY DRAFT STATUS                 
         DC    AL1(OPTLEST+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNIDRF),C'U'  DRAFT JOBS                                    
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNACUA),C'U'  AUTO COPY FROM UNCOMMIT AMTS                  
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNAEDT),C'U'  ALLOW ESTIMATES WITH DRFT JOB                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNSRQ),C'U'   ORDERS-SUPPLIER REQ TO SUBMIT                 
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEVS),C'U'   EXPENSE A/C VIS TO SUBMITTER                  
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEWE),C'U'   EST CHECK ERROR WARNING                       
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNECE),C'U'   EST CHECK TYPE                                
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEORM),C'U'  ESTIMATE CHECK MEMO ORDERS                    
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEORN),C'U'  ESTIMATE CHECK NON-MEM ORD                    
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNETMR),C'U'  ESTIMATE CHECK R TIME                         
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNETMB),C'U'  ESTIMATE CHECK B TIME                         
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEXPN),C'U'  EST CHECK NON BILL EXPENSES                   
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEXPB),C'U'  EST CHECK BILLABLE EXPENSES                   
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEMIN),C'U'  ESTIMATE CHECK MEMO INVOICES                  
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNSLA),C'U'   ALLOW SELF APPROVAL                           
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNRQU),C'U'   REQUISITION NO. IN USE                        
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNENC),C'U'   EST NO COMPLUSORY                             
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNPAU),C'U'   PRODUCTION AUTO APPROVAL                      
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNEAU),C'U'   EXPENSE AUTO APPROVAL                         
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNWCF),C'U'   USE WC FLAG FOR EST CHECK                     
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNPZO),C'U'   PREVENT ZERO ORDER AMOUNT                     
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNOIT),C'U'   USE ITEMS IN ORDERS                           
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNOAN),C'U'   ORDER ANALYSIS                                
         DC    AL1(OPTLORD+OPTLDDS),C'E',AL1(CTRYANY,0)                         
         DC    AL1(OPNNTJA),C'U'  NOTIFY TEAM WHEN JOB APPROVED                 
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNCECE),C'U'  COPT ESTIMATE COPY EXTRA DATA                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNUESOA),C'U' USE ESTIMATE STATUS IN ORD APP                
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNCOES),C'U'  (MCS) CREATE ORDER FROM EST STATUS            
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNDCTEO),C'U'  (MCS) DEFT COPY TXT FROM EST TO ORD          
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNBIEA),C'U'  (MCS) BYPASS INTERNAL ESTIMATE APP            
         DC    AL1(OPTLBILL+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNBCEA),C'U'  (MCS) BYPASS CLIENT ESTIMATE APP              
         DC    AL1(OPTLBILL+OPTLDDS),C'E',AL1(CTRYANY,0)                        
         DC    AL1(OPNINCR),C'U'  (MCS) INCLUDE R TIME IN EST, % COMM           
         DC    AL1(OPTLBILL),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNUCWC),C'U'  (MCS) USE ACTUALS FOR W/C WHEN ACTUAL         
         DC    AL1(OPTLBILL),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNDDSC),C'U' (MCS) DISPLAY JOB DESCRIPTION ON PDF           
         DC    AL1(OPTLBILL),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNPBT),C'U'  DO NOT MOVE BILLED TIME                        
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY),AL1(OPTL53)                      
         DC    AL1(OPNPROE),C'U' (MCS) PRINT RATES ON ESTIMATES                 
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNCCW),C'U'  (MCS) COLOR CODED WCS IN ESTIMATES             
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNEXM),C'U'   (MCS) EXCLUDE MEMO CHARGES                    
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNFPORE),C'U' (MCS) FULLY APPROVED ORDER RESUBMIT           
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNPPORE),C'U' (MCS) PART APPROVED ORDER RESUBMIT            
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNMPORE),C'U' (MCS) MATCHED ORDER RESUBMIT                  
         DC    AL1(OPTLORD),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNUSD),C'U' PRINT USD ON BILL                               
         DC    AL1(OPTLBILL),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNSJOF),C'U' USE SJ OFFICE FOR RATES                        
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY),AL1(0)                            
         DC    AL1(OPNEPAJ),C'U' EMAIL IF PERSON ASSIGNED TO JOB                
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNEEDT),C'U' DATE EST IN LAST FISCAL YEAR                   
         DC    AL1(OPTLFILE),C'E',AL1(CTRYANY,0)                                
*                                                                               
JOBTABX  DC    X'FF'                                                            
         EJECT                                                                  
         DC    Y((WGTABX-WGTAB)/L'WGTAB)                                        
WGTAB    DS    0CL(OPTLISTL)          WORK GROUP OPTIONS (ANY LEVEL)            
         DC    AL1(OPNCOM),C'U'       AGENCY COMMISSION RATE                    
         DC    AL1(OPTLFILE),AL1(0),AL1(CTRYANY,0)                              
         DC    AL1(OPNGST),C'U'       GST OUTPUT TAX TYPE                       
         DC    AL1(OPTLBILL),C'A',AL1(CTRYCAN,0)                                
         DC    AL1(OPNPST),C'U'       PST PROVINCE/OUTPUT CODE                  
         DC    AL1(OPTLBILL),C'A',AL1(CTRYCAN,0)                                
         DC    AL1(OPNINCCR),C'U'     BILLING INCOME ACCOUNT                    
         DC    AL1(OPTLBILL+OPTLDDS),C'C',AL1(CTRYANY,0)                        
         DC    AL1(OPNINCDR),C'U'     BILLING DEBIT ACCOUNT                     
         DC    AL1(OPTLBILL+OPTLDDS),C'C',AL1(CTRYANY,0)                        
         DC    AL1(OPNWKTY),C'U'      WORKCODE TYPE                             
         DC    AL1(OPTLBILL),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNMAT),C'U'       MATERIAL CODE                             
         DC    AL1(OPTLBILL+OPTLDDS),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPN1LBIL),C'U'     ONE LINE ON BILLS?                        
         DC    AL1(OPTLBILL),AL1(0),AL1(CTRYANY,0)                              
         DC    AL1(OPN1LP1),C'U'      ONE LINE ON P1?                           
         DC    AL1(0),AL1(0),AL1(CTRYANY,0)                                     
         DC    AL1(OPNBATCH),C'U'     NEED APPROVED ESTIMATE TO BATCH           
         DC    AL1(OPTLFILE),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNAGWC),C'U'      AGENCY WORKCODE                           
         DC    AL1(OPTLSTUD),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNTOT),C'U'       DEFAULT TYPE FOR TIME SHEETS              
         DC    AL1(OPTLFILE+OPTLEMU),C'B',AL1(CTRYANY,0)                        
         DC    AL1(OPNTAX),C'U'       TAX REQUIRED                              
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNBASE),C'U'      WORKCODE BASIS UNITS/HOURS                
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNICA),C'U'       INPUT CREDIT ACCOUNT                      
         DC    AL1(OPTLSTUD+OPTLFILE),C'A',AL1(CTRYANY,0)                       
         DC    AL1(OPNWOTAC),C'U'     WRITE-OFF CLEARING                        
         DC    AL1(OPTLFILE),C'F',AL1(CTRYANY,0)                                
         DC    AL1(OPNEXTAC),C'U'     WRITE-OFF ACCOUNT (TIME)                  
         DC    AL1(OPTLBILL),C'F',AL1(CTRYANY,0)                                
*                                                                               
WGTABX   DC    X'FF'                                                            
         EJECT                                                                  
         DC    Y((WCTABX-WCTAB)/L'WCTAB)                                        
WCTAB    DS    0CL(OPTLISTL)          WORK CODE                                 
         DC    AL1(OPNCOM),C'U'       AGENCY COMMISSION RATE                    
         DC    AL1(OPTLFILE),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNGST),C'U'       GST OUTPUT TAX TYPE                       
         DC    AL1(OPTLBILL),C'A',AL1(CTRYCAN,0)                                
         DC    AL1(OPNPST),C'U'       PST PROVINCE/OUTPUT CODE                  
         DC    AL1(OPTLBILL),C'A',AL1(CTRYCAN,0)                                
         DC    AL1(OPNINCCR),C'U'     BILLING INCOME ACCOUNT                    
         DC    AL1(OPTLBILL+OPTLDDS),C'C',AL1(CTRYANY,0)                        
         DC    AL1(OPNINCDR),C'U'     BILLING DEBIT ACCOUNT                     
         DC    AL1(OPTLBILL+OPTLDDS),C'C',AL1(CTRYANY,0)                        
         DC    AL1(OPNWKTY),C'U'      WORKCODE TYPE                             
         DC    AL1(OPTLBILL),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNMAT),C'U'       MATERIAL CODE                             
         DC    AL1(OPTLBILL+OPTLDDS),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPN1LBIL),C'U'     ONE LINE ON BILLS?                        
         DC    AL1(OPTLBILL),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPN1LP1),C'U'      ONE LINE ON P1?                           
         DC    AL1(0),C'A',AL1(CTRYANY,0)                                       
         DC    AL1(OPNBATCH),C'U'     NEED APPROVED ESTIMATE TO BATCH           
         DC    AL1(OPTLFILE),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNEPER),C'U'      ESTIMATE PERCENTAGE                       
         DC    AL1(OPTLEST),C'E',AL1(CTRYANY,0)                                 
         DC    AL1(OPNAGWC),C'U'      AGENCY WORKCODE                           
         DC    AL1(OPTLSTUD),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNTOT),C'U'       DEFAULT TYPE FOR TIME SHEETS              
         DC    AL1(OPTLFILE+OPTLEMU),C'B',AL1(CTRYANY,0)                        
         DC    AL1(OPNTAX),C'U'       TAX REQUIRED                              
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNBASE),C'U'      WORKCODE BASIS UNITS/HOURS                
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNICA),C'U'       INPUT CREDIT ACCOUNT                      
         DC    AL1(OPTLSTUD+OPTLFILE),C'A',AL1(CTRYANY,0)                       
         DC    AL1(OPNWOTAC),C'U'     WRITE-OFF CLEARING                        
         DC    AL1(OPTLFILE),C'F',AL1(CTRYANY,0)                                
         DC    AL1(OPNEXTAC),C'U'     WRITE-OFF ACCOUNT (TIME)                  
         DC    AL1(OPTLBILL),C'F',AL1(CTRYANY,0)                                
*                                                                               
WCTABX   DC    X'FF'                                                            
*                                                                               
         DC    Y((JWGTABX-JWGTAB)/L'JWGTAB)                                     
JWGTAB   DS    0CL(OPTLISTL)          WORK GROUP OPTIONS (ANY LEVEL)            
         DC    AL1(OPNCOM),C'U'       AGENCY COMMISSION RATE                    
         DC    AL1(OPTLFILE),C'B',AL1(CTRYANY,0)                                
         DC    AL1(OPNGST),C'U'       GST OUTPUT TAX TYPE                       
         DC    AL1(OPTLBILL),C'B',AL1(CTRYCAN,0)                                
         DC    AL1(OPNPST),C'U'       PST PROVINCE/OUTPUT CODE                  
         DC    AL1(OPTLBILL),C'B',AL1(CTRYCAN,0)                                
         DC    AL1(OPNINCCR),C'U'     BILLING INCOME ACCOUNT                    
         DC    AL1(OPTLBILL+OPTLDDS),C'C',AL1(CTRYANY,0)                        
         DC    AL1(OPNINCDR),C'U'     BILLING DEBIT ACCOUNT                     
         DC    AL1(OPTLBILL+OPTLDDS),C'C',AL1(CTRYANY,0)                        
         DC    AL1(OPNWKTY),C'U'      WORKCODE TYPE                             
         DC    AL1(OPTLBILL),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNMAT),C'U'       MATERIAL CODE                             
         DC    AL1(OPTLBILL+OPTLDDS),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPN1LBIL),C'U'     ONE LINE ON BILLS?                        
         DC    AL1(OPTLBILL),C'B',AL1(CTRYANY,0)                                
         DC    AL1(OPN1LP1),C'U'      ONE LINE ON P1?                           
         DC    AL1(0),C'B',AL1(CTRYANY,0)                                       
         DC    AL1(OPNBATCH),C'U'     NEED APPROVED ESTIMATE TO BATCH           
         DC    AL1(OPTLFILE),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNTOT),C'U'       DEFAULT TYPE FOR TIME SHEETS              
         DC    AL1(OPTLFILE+OPTLEMU),C'B',AL1(CTRYANY,0)                        
         DC    AL1(OPNTAX),C'U'       TAX REQUIRED                              
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNAGWC),C'U'      AGENCY WORKCODE                           
         DC    AL1(OPTLSTUD),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNBASE),C'U'      WORKCODE BASIS UNITS/HOURS                
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNICA),C'U'       INPUT CREDIT ACCOUNT                      
         DC    AL1(OPTLSTUD+OPTLFILE),C'A',AL1(CTRYANY,0)                       
         DC    AL1(OPNWOTAC),C'U'     WRITE-OFF CLEARING                        
         DC    AL1(OPTLFILE),C'F',AL1(CTRYANY,0)                                
         DC    AL1(OPNEXTAC),C'U'     WRITE-OFF ACCOUNT (TIME)                  
         DC    AL1(OPTLBILL),C'F',AL1(CTRYANY,0)                                
*                                                                               
JWGTABX  DC    X'FF'                                                            
         EJECT                                                                  
         DC    Y((JWCTABX-JWCTAB)/L'JWCTAB)                                     
JWCTAB   DS    0CL(OPTLISTL)          WORK CODE                                 
         DC    AL1(OPNCOM),C'U'       AGENCY COMMISSION RATE                    
         DC    AL1(OPTLFILE),C'B',AL1(CTRYANY,0)                                
         DC    AL1(OPNGST),C'U'       GST OUTPUT TAX TYPE                       
         DC    AL1(OPTLBILL),C'B',AL1(CTRYCAN,0)                                
         DC    AL1(OPNPST),C'U'       PST PROVINCE/OUTPUT CODE                  
         DC    AL1(OPTLBILL),C'B',AL1(CTRYCAN,0)                                
         DC    AL1(OPNINCCR),C'U'     BILLING INCOME ACCOUNT                    
         DC    AL1(OPTLBILL+OPTLDDS),C'C',AL1(CTRYANY,0)                        
         DC    AL1(OPNINCDR),C'U'     BILLING DEBIT ACCOUNT                     
         DC    AL1(OPTLBILL+OPTLDDS),C'C',AL1(CTRYANY,0)                        
         DC    AL1(OPNWKTY),C'U'      WORKCODE TYPE                             
         DC    AL1(OPTLBILL),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNMAT),C'U'       MATERIAL CODE                             
         DC    AL1(OPTLBILL+OPTLDDS),C'A',AL1(CTRYANY,0)                        
         DC    AL1(OPN1LBIL),C'U'     ONE LINE ON BILLS?                        
         DC    AL1(OPTLBILL),C'B',AL1(CTRYANY,0)                                
         DC    AL1(OPN1LP1),C'U'      ONE LINE ON P1?                           
         DC    AL1(0),C'B',AL1(CTRYANY,0)                                       
         DC    AL1(OPNBATCH),C'U'     NEED APPROVED ESTIMATE TO BATCH           
         DC    AL1(OPTLFILE),C'C',AL1(CTRYANY,0)                                
         DC    AL1(OPNEPER),C'U'      ESTIMATE PERCENTAGE                       
         DC    AL1(OPTLEST),C'F',AL1(CTRYANY,0)                                 
         DC    AL1(OPNAGWC),C'U'      AGENCY WORKCODE                           
         DC    AL1(OPTLSTUD),C'E',AL1(CTRYANY,0)                                
         DC    AL1(OPNTOT),C'U'       DEFAULT TYPE FOR TIME SHEETS              
         DC    AL1(OPTLFILE+OPTLEMU),C'B',AL1(CTRYANY,0)                        
         DC    AL1(OPNTAX),C'U'       TAX REQUIRED                              
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNBASE),C'U'      WORKCODE BASIS UNITS/HOURS                
         DC    AL1(OPTLSTUD),C'A',AL1(CTRYANY,0)                                
         DC    AL1(OPNICA),C'U'       INPUT CREDIT ACCOUNT                      
         DC    AL1(OPTLSTUD+OPTLFILE),C'A',AL1(CTRYANY,0)                       
         DC    AL1(OPNWOTAC),C'U'     WRITE-OFF CLEARING                        
         DC    AL1(OPTLFILE),C'F',AL1(CTRYANY,0)                                
         DC    AL1(OPNEXTAC),C'U'     WRITE-OFF ACCOUNT (TIME)                  
         DC    AL1(OPTLBILL),C'F',AL1(CTRYANY,0)                                
*                                                                               
JWCTABX  DC    X'FF'                                                            
         EJECT                                                                  
* DSECT TO COVER OPTION LIST ENTRIES                                            
*                                                                               
OPTLISTD DSECT                                                                  
OPTLNUM  DS    X                   OPTION NUMBER                                
OPTLTYPE DS    C                   FIELD TYPE(P=PROTECTED,U=UNPROT.)            
OPTLIND  DS    X                   INDICATOR/FILTER                             
OPTLEST  EQU   X'80'               ESTIMATE OPTION                              
OPTLBILL EQU   X'40'               BILLING OPTION                               
OPTLFILE EQU   X'20'               FILE OPTION                                  
OPTLDDS  EQU   X'10'               DDS ONLY OPTION                              
OPTLEMU  EQU   X'08'               EMULATED FILE ONLY OPTION                    
OPTLSTUD EQU   X'04'               STUDIO JOB OPTION                            
*        EQU   X'02'               NEW BILL OPTION                              
OPTLORD  EQU   X'01'               ORDERS                                       
OPTLSEC  DS    C                   SECURITY TYPE                                
OPTLCTRY DS    XL1                 COUNTRY FILTER                               
OPTLAGY  DS    XL1                 AGENCY SPECIFIC OPTION                       
OPTL53   EQU   X'53'               GHG                                          
OPTLE8   EQU   X'E8'               DNCH                                         
OPTLD1   EQU   X'D1'               MCST                                         
OPTLISTL EQU   *-OPTLISTD          ENTRY LENGTH                                 
