*          DATA SET ACORDFAX   AT LEVEL 039 AS OF 09/11/92                      
*              DSECT DEFINING APPLICATION TRANSACTION DATA FOR                  
*              FAXED REPORTS CREATED BY =ORD                                    
*                                                                               
ACFXREC  DS    0CL58                                                            
ACFXTYPE DS    CL1                 TYPE, P=PRODUCTION, E=EXPENSE                
ACFXCOMP DS    XL1                 COMPANY CODE                                 
ACFXEXP  DS    CL14                                                             
         ORG   ACFXEXP                                                          
ACFXUL   DS    CL2                                                              
ACFXCLI  DS    CL3                                                              
ACFXPRO  DS    CL3                                                              
ACFXJOB  DS    CL6                                                              
ACFXONUM DS    CL6                                                              
ACFXVEND DS    CL14                                                             
