*          DATA SET ACORDFFD   AT LEVEL 020 AS OF 03/29/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60FFFD      DATE 03/29/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
APOMSGH  DS    CL8                                                              
APOMSG   DS    CL60     1    2   60  A  P N             T        Y              
APOSRVH  DS    CL8                                                              
APOSRV   DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      2    2    6  A  P H             T        Y              
APOACTH  DS    CL8                                                              
APOACT   DS    CL52     2   16   52  A  U N        M    T    I   Y              
         DS    CL8                                                              
         DS    CL12     3    2   12  A  P H             T        Y              
APONUMH  DS    CL8                                                              
APONUM   DS    CL6      3   16    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     3   32   10  A  P N             T        Y              
APODATH  DS    CL8                                                              
APODAT   DS    CL8      3   43    8  A  U N             T        Y              
APODATSH DS    CL8                                                              
APODATS  DS    CL28     3   52   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      4    2    6  A  P N             T        Y              
APOCLIH  DS    CL8                                                              
APOCLI   DS    CL64     4   16   64  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
APOPROH  DS    CL8                                                              
APOPRO   DS    CL64     5   16   64  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      6    2    3  A  P N             T        Y              
APOJOBH  DS    CL8                                                              
APOJOB   DS    CL64     6   16   64  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      7    2    8  A  P N             T        Y              
APOSUPH  DS    CL8                                                              
APOSUP   DS    CL64     7   16   64  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
APOEXPH  DS    CL8                                                              
APOEXP   DS    CL51     8   16   51  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      8   68    9  A  P N             T        Y              
APOTAXH  DS    CL8                                                              
APOTAX   DS    CL1      8   78    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13     9    2   13  A  P N             T        Y              
APOAUTH  DS    CL8                                                              
APOAUT   DS    CL15     9   16   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      9   32    8  A  P N             T        Y              
APODDTEH DS    CL8                                                              
APODDTE  DS    CL9      9   43    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      9   53    9  A  P N             T        Y              
APOATTNH DS    CL8                                                              
APOATTN  DS    CL15     9   63   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    10    2   11  A  P N             T        Y              
APOFRSTH DS    CL8                                                              
APOFRST  DS    CL60    10   16   60  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1     11   12    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    11   16   60  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1     12   12    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    12   16   60  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1     13   12    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    13   16   60  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1     14   12    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    14   16   60  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1     15   12    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    15   16   60  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1     16   12    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    16   16   60  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1     17   12    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    17   16   60  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1     18   12    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60    18   16   60  A  U N             T        N              
         DS    CL8                                                              
         DS    CL2     19   11    2  A  P N             T        Y              
APOFINLH DS    CL8                                                              
APOFINL  DS    CL60    19   16   60  A  U N             T        N              
         DS    CL8                                                              
         DS    CL8     20    2    8  A  P N             T        Y              
APOFOOTH DS    CL8                                                              
APOFOOT  DS    CL60    20   16   60  A  U N             T        N              
         DS    CL8                                                              
         DS    CL12    21    2   12  A  P N             T        Y              
APOWRKCH DS    CL8                                                              
APOWRKC  DS    CL11    21   16   11  A  U N             T        Y              
APOWNACH DS    CL8                                                              
APOWNAC  DS    CL49    21   32   49  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     22    2    9  A  P N             T        Y              
APOVALCH DS    CL8                                                              
APOVALC  DS    CL40    22   16   40  A  U N             T        Y              
APOEXTCH DS    CL8                                                              
APOEXTC  DS    CL12    22   66   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    23    2   12  A  P N             T        Y              
APOWRKNH DS    CL8                                                              
APOWRKN  DS    CL11    23   16   11  A  U N             T        Y              
APOWNANH DS    CL8                                                              
APOWNAN  DS    CL49    23   32   49  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9     24    2    9  A  P N             T        Y              
APOVALNH DS    CL8                                                              
APOVALN  DS    CL40    24   16   40  A  U N             T        Y              
APOEXTNH DS    CL8                                                              
APOEXTN  DS    CL12    24   66   12  A  P N             T        Y              
APOTABH  DS    CL8                                                              
APOTAB   DS    CL1     24   79    1  A  U N             T        Y              
APOLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
APOWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2080 BYTES                            
