*          DATA SET ACPAYSEQD  AT LEVEL 004 AS OF 09/20/06                      
***********************************************************************         
* PAYABLE SEQUENCE NUMBER TABLE                                       *         
***********************************************************************         
         SPACE 1                                                                
SEQTBD   DSECT                                                                  
SEQNUM   DS    XL1                 SEQUENCE NUMBER                              
SEQAMNT  DS    PL8                 PAYABLE AMOUNT                               
SEQCLRDT DS    XL2                 CLEARED DATE                                 
SEQSTA   DS    CL5                 SPOT STATION                                 
         DS    CL1                                                              
         ORG   SEQSTA                                                           
SEQPUB   DS    CL6                 PRINT PUB                                    
SEQSCLI  DS    XL2                 SPOT CLIENT                                  
         DS    XL1                                                              
         ORG   SEQSCLI                                                          
SEQPCLI  DS    CL3                 PRINT CLIENT                                 
SEQINV#  DS    CL12                INVOICE NUMBER                               
SEQPRO   DS    CL3                 PRODUCT 1                                    
SEQPRO2  DS    CL3                 PRODUCT 2                                    
SEQEST   DS    XL2                 ESTIMATE NUMBER                              
SEQBMKT  DS    XL2                 BINARY MARKET NUMBER                         
SEQTLNQ  EQU   *-SEQTBD                                                         
*                                                                               
SEQTMAX  EQU   1000                MAXIMUM ENTRIES IN SEQUENCE TAB              
         EJECT                                                                  
