*          DATA SET ACPANBLOCK AT LEVEL 003 AS OF 06/29/93                      
*                                                                               
* OUTPUT BLOCK FOR PANEL VALUES                                                 
*                                                                               
GOPANBLK DS    0CL200                                                           
*                                                                               
GOPANETI DS    CL4                 ESTIMATE TITLE PANEL                         
GOPANEST DS    CL4                 ESTIMATE SUB-TITLE PANEL                     
GOPANEHD DS    CL4                 ESTIMATE HEADER PANEL                        
GOPANESH DS    CL4                 ESTIMATE SUB-HEADER PANEL                    
GOPANEFT DS    CL4                 ESTIMATE FOOTER PANEL                        
GOPANESF DS    CL4                 ESTIMATE SUB-FOOTER PANEL                    
GOPANECT DS    CL4                 ESTIMATE CATEGORY PANEL                      
GOPANEWC DS    CL4                 ESTIMATE WORKCODE PANEL                      
*                                                                               
GOPANBIL EQU   *                                                                
GOPANBTI DS    CL4                 BILL TITLE PANEL                             
GOPANBST DS    CL4                 BILL SUB-TITLE PANEL                         
GOPANBHD DS    CL4                 BILL HEADER PANEL                            
GOPANBSH DS    CL4                 BILL SUB-HEADER PANEL                        
GOPANBFT DS    CL4                 BILL FOOTER PANEL                            
GOPANBSF DS    CL4                 BILL SUB-FOOTER PANEL                        
*                                                                               
         DS    CL(L'GOPANBLK-(*-GOPANBLK)) SPARE                                
GOPANBLX DS    0C                  END OF PANEL BLOCK                           
