*          DATA SET ACPOPFFBD  AT LEVEL 002 AS OF 06/13/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60AFFD      DATE 06/13/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
APOMSGH  DS    XL8                                                              
APOMSG   DS    CL60     1    2   60  A  P N             T        Y              
APOSRVH  DS    XL8                                                              
APOSRV   DS    CL17     1   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      2    2    6  A  P H             T        Y              
APOACTH  DS    XL8                                                              
APOACT   DS    CL52     2   16   52  A  U N        M    T    I   Y    1         
APOACTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     3    2   12  A  P H             T        Y              
APONUMH  DS    XL8                                                              
APONUM   DS    CL6      3   16    6  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10     3   32   10  A  P N             T        Y              
APODATH  DS    XL8                                                              
APODAT   DS    CL8      3   43    8  A  U N             T        Y              
APODATSH DS    XL8                                                              
APODATS  DS    CL28     3   52   28  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P N             T        Y              
APOCLIH  DS    XL8                                                              
APOCLI   DS    CL64     4   16   64  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
APOPROH  DS    XL8                                                              
APOPRO   DS    CL64     5   16   64  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6    2    3  A  P N             T        Y              
APOJOBH  DS    XL8                                                              
APOJOB   DS    CL64     6   16   64  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
APOSUPH  DS    XL8                                                              
APOSUP   DS    CL64     7   16   64  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
APOEXPH  DS    XL8                                                              
APOEXP   DS    CL51     8   16   51  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      8   68    8  A  P N             T        Y              
APOTAXH  DS    XL8                                                              
APOTAX   DS    CL1      8   78    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL13     9    2   13  A  P N             T        Y              
APOAUTH  DS    XL8                                                              
APOAUT   DS    CL15     9   16   15  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   32    8  A  P N             T        Y              
APODDTEH DS    XL8                                                              
APODDTE  DS    CL9      9   43    9  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      9   53    9  A  P N             T        Y              
APOATTNH DS    XL8                                                              
APOATTN  DS    CL15     9   63   15  A  U N             T        Y              
APOWRKTH DS    XL8                                                              
APOWRKT  DS    CL35    10    2   35  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL35    10   40   35  A  P N             T        Y              
APOWRKH  DS    XL8                                                              
APOWRK   DS    CL2     11    2    2  A  U N             T        Y              
APOAMTH  DS    XL8                                                              
APOAMT   DS    CL11    11    6   11  A  U N             T        Y              
APOCOMH  DS    XL8                                                              
APOCOM   DS    CL1     11   19    1  A  U N             T        Y              
APODESH  DS    XL8                                                              
APODES   DS    CL15    11   22   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     11   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    11   44   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     11   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    11   60   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    12    6   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    12   22   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    12   44   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     12   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    12   60   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     13    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    13    6   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    13   22   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     13   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    13   44   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    13   60   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     14    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    14    6   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    14   22   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     14   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    14   44   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    14   60   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     15    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    15    6   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    15   22   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     15   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    15   44   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    15   60   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    16    6   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    16   22   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    16   44   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    16   60   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     17    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    17    6   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    17   22   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     17   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    17   44   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    17   60   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     18    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    18    6   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    18   22   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    18   44   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    18   60   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     19    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    19    6   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    19   22   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     19   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    19   44   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    19   60   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     20    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    20    6   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    20   22   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    20   44   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    20   60   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    24    2   17  A  P N             T        Y              
APOTABH  DS    XL8                                                              
APOTAB   DS    CL1     24   79    1  A  U N             T        Y              
APOLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
APOWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2184 BYTES                            
