*          DATA SET ACPOPFEBD  AT LEVEL 008 AS OF 05/04/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60AFED      DATE 05/04/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL78    10    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    11    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    12    2   11  A  P N             T        Y              
AP2FRSTH DS    XL8                                                              
AP2FRST  DS    CL60    12   16   60  A  U N             T        N              
         DS    XL8                                                              
         DS    CL1     13   12    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    13   16   60  A  U N             T        N              
         DS    XL8                                                              
         DS    CL1     14   12    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    14   16   60  A  U N             T        N              
         DS    XL8                                                              
         DS    CL1     15   12    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    15   16   60  A  U N             T        N              
         DS    XL8                                                              
         DS    CL1     16   12    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    16   16   60  A  U N             T        N              
         DS    XL8                                                              
         DS    CL1     17   12    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    17   16   60  A  U N             T        N              
         DS    XL8                                                              
         DS    CL1     18   12    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    18   16   60  A  U N             T        N              
         DS    XL8                                                              
         DS    CL1     19   12    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    19   16   60  A  U N             T        N              
         DS    XL8                                                              
         DS    CL1     20   12    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL60    20   16   60  A  U N             T        N              
         DS    XL8                                                              
         DS    CL2     21   12    2  A  P N             T        Y              
AP2FINLH DS    XL8                                                              
AP2FINL  DS    CL60    21   16   60  A  U N             T        N              
         DS    XL8                                                              
         DS    CL8     22    2    8  A  P N             T        Y              
AP2FOOTH DS    XL8                                                              
AP2FOOT  DS    CL60    22   16   60  A  U N             T        N              
AP2ENDH  DS    XL8                                                              
AP2END   DS    CL78    23    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    24    2   12  A  P N             T        Y              
AP2TABH  DS    XL8                                                              
AP2TAB   DS    CL1     24   79    1  A  U N             T        Y              
AP2LAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
AP2WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1160 BYTES                            
