*          DATA SET ACPOSTBD   AT LEVEL 001 AS OF 04/18/05                      
POSTABD  DSECT                                                                  
POSREC   DS    0C                                                               
POSFRM   DS    AL4                 FORMAT                                       
POSID    DS    CL2                 ALPHA ID                                     
POSNUM   DS    CL4                 ACCNUM                                       
POSUID   DS    CL7                 USRID                                        
POSLNQ   EQU   *-POSREC                                                         
