*          DATA SET ACPOPFDD   AT LEVEL 019 AS OF 01/30/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60AFDD      DATE 01/30/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
AP1WRKTH DS    XL8                                                              
AP1WRKT  DS    CL35    12    2   35  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL35    12   40   35  L  P N             T        Y              
AP1WRKH  DS    XL8                                                              
AP1WRK   DS    CL2     13    2    2  A  U N             T        Y              
AP1AMTH  DS    XL8                                                              
AP1AMT   DS    CL11    13    6   11  A  U N             T        Y              
AP1COMH  DS    XL8                                                              
AP1COM   DS    CL1     13   19    1  A  U N             T        Y              
AP1DESH  DS    XL8                                                              
AP1DES   DS    CL15    13   22   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     13   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    13   44   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    13   60   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     14    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    14    6   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    14   22   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     14   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    14   44   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    14   60   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     15    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    15    6   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    15   22   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     15   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    15   44   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    15   60   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    16    6   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    16   22   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     16   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    16   44   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    16   60   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     17    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    17    6   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    17   22   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     17   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    17   44   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    17   60   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     18    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    18    6   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    18   22   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     18   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    18   44   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    18   60   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     19    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    19    6   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    19   22   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     19   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    19   44   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    19   60   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     20    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    20    6   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    20   22   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     20   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    20   44   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    20   60   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     21    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    21    6   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    21   22   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     21   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    21   44   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    21   60   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     22    2    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    22    6   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   19    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    22   22   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     22   40    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    22   44   11  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   57    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    22   60   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    24    2   30  L  P N             T        Y              
AP1TABH  DS    XL8                                                              
AP1TAB   DS    CL1     24   79    1  A  P N             T        Y              
AP1LAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
AP1WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1360 BYTES                            
