*          DATA SET ACPROD3D   AT LEVEL 004 AS OF 07/02/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BD3D      DATE 07/02/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL12     6    2   12  A  P N             T        Y              
PROOFGH  DS    XL8                                                              
PROOFG   DS    CL1      6   27    1  A  U N             T    I   Y    2         
PROOFGX  DS    XL8                                                              
PROOFGNH DS    XL8                                                              
PROOFGN  DS    CL36     6   37   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
PROOFFH  DS    XL8                                                              
PROOFF   DS    CL2      7   27    2  A  U N             T        Y    4         
PROOFFX  DS    XL8                                                              
PROOFFNH DS    XL8                                                              
PROOFFN  DS    CL36     7   37   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
PROCLIH  DS    XL8                                                              
PROCLI   DS    CL6      8   27    6  A  U N             T        Y   16         
PROCLIX  DS    XL8                                                              
PROCLINH DS    XL8                                                              
PROCLIN  DS    CL36     8   37   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
PROPROH  DS    XL8                                                              
PROPRO   DS    CL8      9   27    8  A  U N             T        Y   18         
PROPROX  DS    XL8                                                              
PROPRONH DS    XL8                                                              
PROPRON  DS    CL36     9   37   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
PROJOBH  DS    XL8                                                              
PROJOB   DS    CL8     10   27    8  A  U N             T        Y   20         
PROJOBX  DS    XL8                                                              
PROJOBNH DS    XL8                                                              
PROJOBN  DS    CL36    10   37   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     11    2    6  A  P N             T        Y              
PROFIL1H DS    XL8                                                              
PROFIL1  DS    CL2     11   12    2  A  U H             T        Y   21         
PROFIL1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     11   27    6  A  P N             T        Y              
PROFIL2H DS    XL8                                                              
PROFIL2  DS    CL2     11   37    2  A  U H             T        Y   22         
PROFIL2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     11   47    6  A  P N             T        Y              
PROFIL3H DS    XL8                                                              
PROFIL3  DS    CL2     11   56    2  A  U H             T        Y   23         
PROFIL3X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     12    2    6  A  P N             T        Y              
PROFIL4H DS    XL8                                                              
PROFIL4  DS    CL2     12   12    2  A  U H             T        Y   24         
PROFIL4X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     12   27    6  A  P N             T        Y              
PROFIL5H DS    XL8                                                              
PROFIL5  DS    CL2     12   37    2  A  U H             T        Y   25         
PROFIL5X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     13    2    6  A  P N             T        Y              
PROFORMH DS    XL8                                                              
PROFORM  DS    CL1     13   27    1  A  U N             T        Y   50         
PROFORMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL42    13   37   42  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL21    14    2   21  A  P N             T        Y              
PROICLOH DS    XL8                                                              
PROICLO  DS    CL1     14   27    1  A  U N             T        Y   52         
PROICLOX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL38    14   37   38  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL21    15    2   21  A  P N             T        Y              
PROXLOCH DS    XL8                                                              
PROXLOC  DS    CL1     15   27    1  A  U N             T        Y   54         
PROXLOCX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL38    15   37   38  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    16    2   17  A  P N             T        Y              
PRODEFH  DS    XL8                                                              
PRODEF   DS    CL1     16   27    1  A  U N             T        Y   56         
PRODEFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL30    16   37   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17    17    2   17  A  P N             T        Y              
PROWCH   DS    XL8                                                              
PROWC    DS    CL1     17   27    1  A  U N             T        Y   58         
PROWCX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL30    17   37   30  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    18    2   23  A  P N             T        Y              
PRONOPH  DS    XL8                                                              
PRONOP   DS    CL1     18   27    1  A  U N             T        Y   60         
PRONOPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     18   37    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    19    2   13  A  P N             T        Y              
PRONOJH  DS    XL8                                                              
PRONOJ   DS    CL1     19   27    1  A  U N             T        Y   62         
PRONOJX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9     19   37    9  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23    20    2   23  A  P N             T        Y              
PRONODH  DS    XL8                                                              
PRONOD   DS    CL1     20   27    1  A  U N             T        Y   64         
PRONODX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL36    20   37   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21    2    1  A  P N             T        Y              
PROLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1216 BYTES                            
