*          DATA SET ACPROODTAB AT LEVEL 033 AS OF 07/01/20                      
         SPACE 1                                                                
*                                  OUTPUT DIRECTION TABLE                       
*                                BYTE 1   = FIELD NUMBER                        
*                                BYTE 2   = MAX LENGTH                          
*                                BYTE 3   = INDICATORS                          
*                                BYTE 4-5 = DISPLACEMENT INTO GOPTIONS          
OUTTAB   DS    0CL5                                                             
         DC    AL1(OPNCOM),AL1(04),AL1(0),AL2(GOAGYCOM-GOPTIONS)                
         DC    AL1(OPNUNBWC),AL1(12),AL1(0),AL2(GOUWLIST-GOPTIONS)              
         DC    AL1(OPNBT),AL1(13),AL1(0),AL2(GOBILTYP-GOPTIONS)                 
         DC    AL1(OPNDUE),AL1(01),AL1(0),AL2(GODUEDAY-GOPTIONS)                
         DC    AL1(OPNOVPER),AL1(04),AL1(0),AL2(GOOVRPER-GOPTIONS)              
         DC    AL1(OPNOVAMT),AL1(04),AL1(0),AL2(GOOVRAMT-GOPTIONS)              
         DC    AL1(OPNEEDES),AL1(01),AL1(0),AL2(GONEEDES-GOPTIONS)              
         DC    AL1(OPNMIN),AL1(04),AL1(0),AL2(GOMINBIL-GOPTIONS)                
         DC    AL1(OPNCLSUM),AL1(01),AL1(0),AL2(GOCLISUM-GOPTIONS)              
         DC    AL1(OPNPRSUM),AL1(01),AL1(0),AL2(GOPROSUM-GOPTIONS)              
         DC    AL1(OPNDET),AL1(01),AL1(0),AL2(GOBILDET-GOPTIONS)                
         DC    AL1(OPNWCNES),AL1(01),AL1(0),AL2(GOWCONES-GOPTIONS)              
         DC    AL1(OPNCD),AL1(01),AL1(0),AL2(GOCLICD-GOPTIONS)                  
         DC    AL1(OPNET),AL1(01),AL1(0),AL2(GOPAYNET-GOPTIONS)                 
         DC    AL1(OPNSUPAG),AL1(01),AL1(0),AL2(GOSUPAGY-GOPTIONS)              
         DC    AL1(OPNAUTTA),AL1(01),AL1(0),AL2(GOAUTOTA-GOPTIONS)              
         DC    AL1(117),AL1(01),AL1(0),AL2(GOTRANS-GOPTIONS)                    
         DC    AL1(OPNESCM),AL1(01),AL1(0),AL2(GOESTCOM-GOPTIONS)               
         DC    AL1(119),AL1(01),AL1(0),AL2(GOGRPLCD-GOPTIONS)                   
         DC    AL1(OPNEWJUN),AL1(01),AL1(0),AL2(GONEWJUN-GOPTIONS)              
         DC    AL1(OPNZERO),AL1(01),AL1(0),AL2(GOZERO-GOPTIONS)                 
         DC    AL1(OPNAUTUN),AL1(01),AL1(0),AL2(GOAUTOUN-GOPTIONS)              
         DC    AL1(OPNEWBT),AL1(01),AL1(0),AL2(GONEWBT-GOPTIONS)                
         DC    AL1(OPNFILT2),AL1(01),AL1(0),AL2(GOFILT2-GOPTIONS)               
*                                                                               
* START UK ONLY                                                                 
         DC    AL1(OPNWCA21),AL1(01),AL1(0),AL2(GOWCAC21-GOPTIONS)              
* UK ONLY                                                                       
*                                                                               
         DC    AL1(OPNGST),AL1(01),AL1(0),AL2(GOTAXCOD-GOPTIONS)                
         DC    AL1(OPNSUPST),AL1(01),AL1(0),AL2(GOSUPSTI-GOPTIONS)              
         DC    AL1(OPNAUADD),AL1(02),AL1(0),AL2(GOAUTADD-GOPTIONS)              
         DC    AL1(OPNSCH),AL1(08),AL1(0),AL2(GOSCHEME-GOPTIONS)                
         DC    AL1(OPNEWE),AL1(1),X'40',AL2(GOEWE-GOXBLOCK)                     
         DC    AL1(OPNECE),AL1(1),X'40',AL2(GOECE-GOXBLOCK)                     
         DC    AL1(OPN1LBIL),AL1(01),AL1(0),AL2(GO1LINBL-GOPTIONS)              
         DC    AL1(OPN1LP1),AL1(01),AL1(0),AL2(GO1LINP1-GOPTIONS)               
         DC    AL1(OPNPST),AL1(03),AL1(0),AL2(GOPSTOPT-GOPTIONS)                
         DC    AL1(OPNMAT),AL1(10),AL1(0),AL2(GOMAT-GOPTIONS)                   
         DC    AL1(OPNWKTY),AL1(01),AL1(0),AL2(GOWRKTY-GOPTIONS)                
         DC    AL1(OPNTWCTP),AL1(04),AL1(0),AL2(GOTWO-GOPTIONS)                 
         DC    AL1(OPNDIST),AL1(03),AL1(0),AL2(GODIST-GOPTIONS)                 
         DC    AL1(OPNEEDAE),AL1(01),AL1(0),AL2(GONEEDAE-GOPTIONS)              
         DC    AL1(OPNBFUN),AL1(01),AL1(0),AL2(GOBILFUN-GOPTIONS)               
         DC    AL1(OPNPAB),AL1(01),X'40',AL2(GOPAB-GOXBLOCK)                    
         DC    AL1(OPNANT),AL1(20),X'40',AL2(GOANT-GOXBLOCK)                    
         DC    AL1(OPNESTYP),AL1(01),AL1(0),AL2(GOESTTYP-GOPTIONS)              
         DC    AL1(OPNREPFO),AL1(08),X'40',AL2(GOREPFOR-GOXBLOCK)               
         DC    AL1(OPNSELES),AL1(09),AL1(0),AL2(GOSELEST-GOPTIONS)              
         DC    AL1(OPNFNT),AL1(03),X'40',AL2(GOTFNARR-GOXBLOCK)                 
         DC    AL1(OPNPROD),AL1(01),AL1(0),AL2(GOPROD-GOPTIONS)                 
         DC    AL1(OPNJG),AL1(03),AL1(0),AL2(GOJG-GOPTIONS)                     
         DC    AL1(OPNTBC),AL1(15),AL1(0),AL2(GOTBC-GOPTIONS)                   
         DC    AL1(OPNETIP),AL1(04),X'80',AL2(GOPANETI-GOPANBLK)                
         DC    AL1(OPNESTP),AL1(04),X'80',AL2(GOPANEST-GOPANBLK)                
         DC    AL1(OPNEHDP),AL1(04),X'80',AL2(GOPANEHD-GOPANBLK)                
         DC    AL1(OPNESHP),AL1(04),X'80',AL2(GOPANESH-GOPANBLK)                
         DC    AL1(OPNEFTP),AL1(04),X'80',AL2(GOPANEFT-GOPANBLK)                
         DC    AL1(OPNESFP),AL1(04),X'80',AL2(GOPANESF-GOPANBLK)                
*                                                                               
* START NOT USED                                                                
         DC    AL1(OPNECTP),AL1(04),X'80',AL2(GOPANECT-GOPANBLK)                
         DC    AL1(OPNEWCP),AL1(04),X'80',AL2(GOPANEWC-GOPANBLK)                
* END NOT USED                                                                  
*                                                                               
         DC    AL1(OPNEAPP),AL1(01),AL1(0),AL2(GOAPPMFP-GOPTIONS)               
         DC    AL1(OPNEPRP),AL1(01),AL1(0),AL2(GOPRPMFP-GOPTIONS)               
         DC    AL1(OPNBATCH),AL1(01),AL1(0),AL2(GOBATCH-GOPTIONS)               
         DC    AL1(OPNCLITY),AL1(01),AL1(0),AL2(GOCTYPE-GOPTIONS)               
         DC    AL1(OPNADDP),AL1(01),AL1(0),AL2(GOADDPLN-GOPTIONS)               
         DC    AL1(OPNADDR),AL1(01),AL1(0),AL2(GOADDREV-GOPTIONS)               
         DC    AL1(OPNESTRE),AL1(08),X'40',AL2(GOESTREP-GOXBLOCK)               
         DC    AL1(OPNTXTSC),AL1(12),X'40',AL2(GOTXTSCR-GOXBLOCK)               
         DC    AL1(OPNCLIST),AL1(20),X'40',AL2(GOINQ-GOXBLOCK)                  
         DC    AL1(OPNEPER),AL1(04),AL1(0),AL2(GOESTPER-GOPTIONS)               
         DC    AL1(OPNJSUM),AL1(20),X'40',AL2(GOJSUM-GOXBLOCK)                  
         DC    AL1(OPNJSUMC),AL1(20),X'40',AL2(GOJSUMC-GOXBLOCK)                
         DC    AL1(OPNAUTO),AL1(01),AL1(0),AL2(GOAUTNUM-GOPTIONS)               
         DC    AL1(OPNORDER),AL1(1),AL1(0),AL2(GOORDER-GOPTIONS)                
         DC    AL1(OPN99S),AL1(01),AL1(0),AL2(GOSUP99S-GOPTIONS)                
         DC    AL1(OPNEDI),AL1(01),AL1(0),AL2(GOEDI-GOPTIONS)                   
         DC    AL1(OPNAWO),AL1(1),X'40',AL2(GOAWOO-GOXBLOCK)                    
         DC    AL1(OPNAWA),AL1(14),X'40',AL2(GOAWOA-GOXBLOCK)                   
         DC    AL1(OPNAWFOF),AL1(2),X'40',AL2(GOAWOFOF-GOXBLOCK)                
         DC    AL1(OPNAWAOF),AL1(2),X'40',AL2(GOAWOAOF-GOXBLOCK)                
         DC    AL1(OPNAWDEP),AL1(3),X'40',AL2(GOAWODEP-GOXBLOCK)                
         DC    AL1(OPNAWSTF),AL1(6),X'40',AL2(GOAWOSTF-GOXBLOCK)                
         DC    AL1(OPNAW8),AL1(1),X'40',AL2(GOAWOT8-GOXBLOCK)                   
         DC    AL1(OPNTOT),AL1(1),X'40',AL2(GOTOT-GOXBLOCK)                     
         DC    AL1(OPNFPT),AL1(1),X'40',AL2(GOFPT-GOXBLOCK)                     
         DC    AL1(OPNFJT),AL1(1),X'40',AL2(GOFJT-GOXBLOCK)                     
         DC    AL1(OPNTAX),AL1(1),X'40',AL2(GOTAX-GOXBLOCK)                     
         DC    AL1(OPNTXWC),AL1(2),X'40',AL2(GOTXWC-GOXBLOCK)                   
         DC    AL1(OPNTXLOC),AL1(8),X'40',AL2(GOTXLOC-GOXBLOCK)                 
         DC    AL1(OPNBASE),AL1(1),X'40',AL2(GOBASE-GOXBLOCK)                   
         DC    AL1(OPNICA),AL1(15),X'40',AL2(GOICA-GOXBLOCK)                    
         DC    AL1(OPNBDB),AL1(15),X'40',AL2(GOBDB-GOXBLOCK)                    
         DC    AL1(OPNICR),AL1(15),X'40',AL2(GOICR-GOXBLOCK)                    
         DC    AL1(OPNSTUD),AL1(1),X'40',AL2(GOSTUDIO-GOXBLOCK)                 
         DC    AL1(OPNAGWC),AL1(2),X'40',AL2(GOAGWC-GOXBLOCK)                   
         DC    AL1(OPNHOLD),AL1(1),X'40',AL2(GOHOLD-GOXBLOCK)                   
         DC    AL1(OPNTYPE),AL1(4),X'40',AL2(GOTYPE-GOXBLOCK)                   
         DC    AL1(OPNINT),AL1(1),X'40',AL2(GOINTPST-GOXBLOCK)                  
         DC    AL1(OPNINCCR),AL1(15),X'40',AL2(GOINCCR-GOXBLOCK)                
         DC    AL1(OPNINCDR),AL1(15),X'40',AL2(GOINCDR-GOXBLOCK)                
         DC    AL1(OPNINACT),AL1(2),AL1(0),AL2(GOINACTV-GOPTIONS)               
         DC    AL1(OPNTIMSH),AL1(1),AL1(0),AL2(GOTMSDEF-GOPTIONS)               
         DC    AL1(OPNCERCH),AL1(3),X'40',AL2(GOCERCHD-GOXBLOCK)                
         DC    AL1(OPNCEAMB),AL1(3),X'40',AL2(GOCEAMBR-GOXBLOCK)                
         DC    AL1(OPNCERED),AL1(3),X'40',AL2(GOCERED-GOXBLOCK)                 
         DC    AL1(OPNTTA),AL1(3),X'40',AL2(GOTTALLW-GOXBLOCK)                  
         DC    AL1(OPNNJB),AL1(1),X'40',AL2(GOTNOJOB-GOXBLOCK)                  
         DC    AL1(OPNLDEST),AL1(1),X'20',AL2(GOJLDEST-GOBBLOCK)                
         DC    AL1(OPNLDORD),AL1(1),X'20',AL2(GOJLDORD-GOBBLOCK)                
         DC    AL1(OPNLDBIL),AL1(1),X'20',AL2(GOJLDBIL-GOBBLOCK)                
         DC    AL1(OPNLDTSI),AL1(1),X'20',AL2(GOJLDTSI-GOBBLOCK)                
         DC    AL1(OPNLDADJ),AL1(1),X'20',AL2(GOJLDADJ-GOBBLOCK)                
         DC    AL1(OPNLDEXT),AL1(1),X'20',AL2(GOJLDEXT-GOBBLOCK)                
*                                                                               
* START UK ONLY                                                                 
         DC    AL1(OPNBTIP),AL1(04),X'80',AL2(GOPANBTI-GOPANBLK)                
         DC    AL1(OPNBSTP),AL1(04),X'80',AL2(GOPANBST-GOPANBLK)                
         DC    AL1(OPNBHDP),AL1(04),X'80',AL2(GOPANBHD-GOPANBLK)                
         DC    AL1(OPNBSHP),AL1(04),X'80',AL2(GOPANBSH-GOPANBLK)                
         DC    AL1(OPNBFTP),AL1(04),X'80',AL2(GOPANBFT-GOPANBLK)                
         DC    AL1(OPNBSFP),AL1(04),X'80',AL2(GOPANBSF-GOPANBLK)                
         DC    AL1(OPNCBALL),AL1(04),X'20',AL2(GOCBDALL-GOBBLOCK)               
         DC    AL1(OPNCBWOF),AL1(04),X'20',AL2(GOCBDWOF-GOBBLOCK)               
         DC    AL1(OPNCBREV),AL1(04),X'20',AL2(GOCBDREV-GOBBLOCK)               
         DC    AL1(OPNCBRVL),AL1(04),X'20',AL2(GOCBDRVL-GOBBLOCK)               
         DC    AL1(OPNCBXFR),AL1(04),X'20',AL2(GOCBDXFR-GOBBLOCK)               
         DC    AL1(OPNCBMTC),AL1(04),X'20',AL2(GOCBDMTC-GOBBLOCK)               
         DC    AL1(OPNCBINV),AL1(04),X'20',AL2(GOCBDINV-GOBBLOCK)               
         DC    AL1(OPNCBAAU),AL1(04),X'20',AL2(GOCBDAAU-GOBBLOCK)               
         DC    AL1(OPNCBSUM),AL1(04),X'20',AL2(GOCBDSUM-GOBBLOCK)               
         DC    AL1(OPNCBRCV),AL1(04),X'20',AL2(GOCBDRCV-GOBBLOCK)               
         DC    AL1(OPNCBLST),AL1(04),X'20',AL2(GOCBDLST-GOBBLOCK)               
         DC    AL1(OPNCBFMT),AL1(04),X'20',AL2(GOCBDFMT-GOBBLOCK)               
         DC    AL1(OPNCBPRV),AL1(04),X'20',AL2(GOCBDPRV-GOBBLOCK)               
         DC    AL1(OPNBFMT),AL1(4),X'20',AL2(GOBILFRM-GOBBLOCK)                 
         DC    AL1(OPNBLCUR),AL1(4),X'20',AL2(GOBILCUR-GOBBLOCK)                
         DC    AL1(OPNINCAC),AL1(4),X'20',AL2(GOINCAC-GOBBLOCK)                 
* END UK ONLY                                                                   
*                                                                               
         DC    AL1(OPNEXTAC),AL1(4),X'20',AL2(GOEXPTAC-GOBBLOCK)                
         DC    AL1(OPNEXOAC),AL1(4),X'20',AL2(GOEXPOAC-GOBBLOCK)                
         DC    AL1(OPNWOTAC),AL1(4),X'20',AL2(GOWOFTAC-GOBBLOCK)                
         DC    AL1(OPNWOOAC),AL1(4),X'20',AL2(GOWOFOAC-GOBBLOCK)                
*                                                                               
* START UK ONLY                                                                 
         DC    AL1(OPNSRGAC),AL1(4),X'20',AL2(GOSRGAC-GOBBLOCK)                 
         DC    AL1(OPNDSCAC),AL1(4),X'20',AL2(GODSCAC-GOBBLOCK)                 
         DC    AL1(OPNSRGPT),AL1(4),X'20',AL2(GOSRGPCT-GOBBLOCK)                
         DC    AL1(OPNDSCPT),AL1(4),X'20',AL2(GODSCPCT-GOBBLOCK)                
* END UK ONLY                                                                   
*                                                                               
         DC    AL1(OPNASPCT),AL1(4),X'00',AL2(GOASPCT-GOPTIONS)                 
         DC    AL1(OPNASACC),AL1(15),X'00',AL2(GOASACC-GOPTIONS)                
         DC    AL1(OPNASWRK),AL1(2),X'00',AL2(GOASWRK-GOPTIONS)                 
         DC    AL1(OPNASBIL),AL1(1),X'00',AL2(GOASBIL-GOPTIONS)                 
         DC    AL1(OPNTRACK),AL1(1),X'00',AL2(GOTRACK-GOPTIONS)                 
         DC    AL1(OPNPBPCT),AL1(4),X'40',AL2(GOPBPCT-GOXBLOCK)                 
         DC    AL1(OPNPBACC),AL1(15),X'40',AL2(GOPBACC-GOXBLOCK)                
         DC    AL1(OPNPBWRK),AL1(2),X'40',AL2(GOPBWRK-GOXBLOCK)                 
         DC    AL1(OPNJLE),AL1(1),X'40',AL2(GONJLE-GOXBLOCK)                    
         DC    AL1(OPNBIO),AL1(1),X'40',AL2(GOBILO-GOXBLOCK)                    
         DC    AL1(OPNIUSO),AL1(1),X'40',AL2(GOIUSO-GOXBLOCK)                   
         DC    AL1(OPNIDRF),AL1(1),X'40',AL2(GODRFT-GOXBLOCK)                   
         DC    AL1(OPNACUA),AL1(1),X'40',AL2(GOACUA-GOXBLOCK)                   
         DC    AL1(OPNNTJA),AL1(1),X'40',AL2(GONTJA-GOXBLOCK)                   
         DC    AL1(OPNAEDT),AL1(1),X'40',AL2(GOAEDT-GOXBLOCK)                   
         DC    AL1(OPNCECE),AL1(1),X'40',AL2(GOCECE-GOXBLOCK)                   
         DC    AL1(OPNSRQ),AL1(1),X'40',AL2(GOSRQ-GOXBLOCK)                     
         DC    AL1(OPNXRQ),AL1(1),X'40',AL2(GOXRQ-GOXBLOCK)                     
         DC    AL1(OPNEVS),AL1(1),X'40',AL2(GOEVS-GOXBLOCK)                     
         DC    AL1(OPNSAP),AL1(1),X'40',AL2(GOSAP-GOXBLOCK)                     
         DC    AL1(OPNEORM),AL1(1),X'40',AL2(GOEORM-GOXBLOCK)                   
         DC    AL1(OPNEORN),AL1(1),X'40',AL2(GOEORN-GOXBLOCK)                   
         DC    AL1(OPNETMR),AL1(1),X'40',AL2(GOETMR-GOXBLOCK)                   
         DC    AL1(OPNETMB),AL1(1),X'40',AL2(GOETMB-GOXBLOCK)                   
         DC    AL1(OPNEXPN),AL1(1),X'40',AL2(GOEXPN-GOXBLOCK)                   
         DC    AL1(OPNEXPB),AL1(1),X'40',AL2(GOEXPB-GOXBLOCK)                   
         DC    AL1(OPNSLA),AL1(4),X'40',AL2(GOSLA-GOXBLOCK)                     
         DC    AL1(OPNRQU),AL1(4),X'40',AL2(GORQU-GOXBLOCK)                     
         DC    AL1(OPNRQP),AL1(1),X'40',AL2(GORQP-GOXBLOCK)                     
         DC    AL1(OPNRQS),AL1(1),X'40',AL2(GORQS-GOXBLOCK)                     
         DC    AL1(OPNENC),AL1(8),X'40',AL2(GOENC-GOXBLOCK)                     
         DC    AL1(OPNEWC),AL1(1),X'40',AL2(GOEWC-GOXBLOCK)                     
         DC    AL1(OPNPAU),AL1(3),X'40',AL2(GOPAU-GOXBLOCK)                     
         DC    AL1(OPNEAU),AL1(3),X'40',AL2(GOEAU-GOXBLOCK)                     
         DC    AL1(OPNWCF),AL1(1),X'40',AL2(GOWCF-GOXBLOCK)                     
         DC    AL1(OPNPZO),AL1(4),X'40',AL2(GOPZO-GOXBLOCK)                     
         DC    AL1(OPNOIT),AL1(4),X'40',AL2(GOOIT-GOXBLOCK)                     
         DC    AL1(OPNOAN),AL1(1),X'40',AL2(GOOAN-GOXBLOCK)                     
         DC    AL1(OPNOAI),AL1(1),X'40',AL2(GOOAI-GOXBLOCK)                     
         DC    AL1(OPNDIOS),AL1(1),X'40',AL2(GODIOS-GOXBLOCK)                   
         DC    AL1(OPNDITSR),AL1(1),X'40',AL2(GODITSR-GOXBLOCK)                 
         DC    AL1(OPNDITSB),AL1(1),X'40',AL2(GODITSB-GOXBLOCK)                 
         DC    AL1(OPNDITSN),AL1(1),X'40',AL2(GODITSN-GOXBLOCK)                 
         DC    AL1(OPNDIEN),AL1(1),X'40',AL2(GODIEN-GOXBLOCK)                   
         DC    AL1(OPNDIEB),AL1(1),X'40',AL2(GODIEB-GOXBLOCK)                   
         DC    AL1(OPNDIEO),AL1(1),X'40',AL2(GODIEO-GOXBLOCK)                   
         DC    AL1(OPNDEIS),AL1(1),X'40',AL2(GODEIS-GOXBLOCK)                   
         DC    AL1(OPNIAES),AL1(1),X'40',AL2(GOIAES-GOXBLOCK)                   
         DC    AL1(OPNEMIN),AL1(1),X'40',AL2(GOEMIN-GOXBLOCK)                   
         DC    AL1(OPNUESOA),AL1(1),X'40',AL2(GOUESOA-GOXBLOCK)                 
         DC    AL1(OPNCOES),AL1(1),X'40',AL2(GOCOES-GOXBLOCK)                   
         DC    AL1(OPNDCTEO),AL1(1),X'40',AL2(GODCTEO-GOXBLOCK)                 
         DC    AL1(OPNBIEA),AL1(3),X'40',AL2(GOBIEA-GOXBLOCK)                   
         DC    AL1(OPNBCEA),AL1(3),X'40',AL2(GOBCEA-GOXBLOCK)                   
         DC    AL1(OPNINCR),AL1(1),X'40',AL2(GOINCR-GOXBLOCK)                   
         DC    AL1(OPNGAPS),AL1(1),X'40',AL2(GOGAPS-GOXBLOCK)                   
         DC    AL1(OPNDFEXS),AL1(1),X'40',AL2(GOGDES-GOXBLOCK)                  
         DC    AL1(OPNDNDVC),AL1(1),X'40',AL2(GODNDV-GOXBLOCK)                  
         DC    AL1(OPNGAPRA),AL1(1),X'40',AL2(GOGARA-GOXBLOCK)                  
         DC    AL1(OPNSPWPD),AL1(1),X'40',AL2(GOSWPD-GOXBLOCK)                  
         DC    AL1(OPNDFEXO),AL1(1),X'40',AL2(GOGDEO-GOXBLOCK)                  
         DC    AL1(OPNGEMEX),AL1(1),X'40',AL2(GOGEMX-GOXBLOCK)                  
         DC    AL1(OPNGEMDS),AL1(1),X'40',AL2(GOGEMD-GOXBLOCK)                  
         DC    AL1(OPNUCWC),AL1(1),X'40',AL2(GOGUWC-GOXBLOCK)                   
         DC    AL1(OPNDDSC),AL1(1),X'40',AL2(GOGDSC-GOXBLOCK)                   
         DC    AL1(OPNJ3RD),AL1(1),X'40',AL2(GOGJ3D-GOXBLOCK)                   
         DC    AL1(OPNPBT),AL1(1),X'40',AL2(GOPBT-GOXBLOCK)                     
         DC    AL1(OPNPROE),AL1(1),X'40',AL2(GOGPRE-GOXBLOCK)                   
         DC    AL1(OPNCCW),AL1(1),X'40',AL2(GOCCW-GOXBLOCK)                     
         DC    AL1(OPNEXM),AL1(1),X'40',AL2(GOEXM-GOXBLOCK)                     
         DC    AL1(OPNPPORE),AL1(1),X'40',AL2(GOPPORES-GOXBLOCK)                
         DC    AL1(OPNMPORE),AL1(1),X'40',AL2(GOMPORES-GOXBLOCK)                
         DC    AL1(OPNFPORE),AL1(1),X'40',AL2(GOFPORES-GOXBLOCK)                
         DC    AL1(OPNUSD),AL1(1),X'40',AL2(GOUSD-GOXBLOCK)                     
         DC    AL1(OPNSJOF),AL1(1),X'40',AL2(GOSJOF-GOXBLOCK)                   
         DC    AL1(OPNEPAJ),AL1(1),X'40',AL2(GOEPAJ-GOXBLOCK)                   
         DC    AL1(OPNEEDT),AL1(1),X'40',AL2(GOEEDT-GOXBLOCK)                   
         DC    X'FF'                                                            
