*          DATA SET ACPROFED   AT LEVEL 003 AS OF 03/21/12                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BFED      DATE 03/21/12                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL11     6    2   11  A  P H             T        Y              
PROWRKH  DS    XL8                                                              
PROWRK   DS    CL2      6   22    2  A  U H             T    I   Y   12         
PROWRKX  DS    XL8                                                              
PROLACTH DS    XL8                                                              
PROLACT  DS    CL40     6   38   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     8    2   11  A  P H             T        Y              
PRODESCH DS    XL8                                                              
PRODESC  DS    CL15     8   22   15  A  U H             T        Y   50         
PRODESCX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      9    2    9  A  P N             T        Y              
PROLNMH  DS    XL8                                                              
PROLNM   DS    CL36     9   22   36  A  U N             T        Y    0         
PROLNMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    10    2   12  A  P N             T        Y              
PROWGRH  DS    XL8                                                              
PROWGR   DS    CL2     10   22    2  A  U N             T        Y   10         
PROWGRX  DS    XL8                                                              
PROWGRNH DS    XL8                                                              
PROWGRN  DS    CL36    10   28   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15    11    2   15  A  P N             T        Y              
PROCOMH  DS    XL8                                                              
PROCOM   DS    CL1     11   22    1  A  U N             T        Y   52         
PROCOMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     12    2    6  A  P N             T        Y              
PROTYPH  DS    XL8                                                              
PROTYP   DS    CL1     12   22    1  A  U N             T        Y   54         
PROTYPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    13    2   15  A  P N             T        Y              
PROTRANH DS    XL8                                                              
PROTRAN  DS    CL1     13   22    1  A  U N             T        Y   56         
PROTRANX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     14    2    7  A  P N             T        Y              
PROSTATH DS    XL8                                                              
PROSTAT  DS    CL1     14   22    1  A  U N             T        Y   58         
PROSTATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    15    2   12  A  P N             T        Y              
PROARATH DS    XL8                                                              
PROARAT  DS    CL1     15   22    1  A  U N             T        Y   60         
PROARATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    16    2   14  A  P N             T        Y              
PROINCH  DS    XL8                                                              
PROINC   DS    CL1     16   22    1  A  U N             T        Y    0         
PROINCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    17    2   18  A  P N             T        Y              
PROTHRH  DS    XL8                                                              
PROTHR   DS    CL1     17   22    1  A  U N             T        Y    0         
PROTHRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18    2    1  A  P N             T        Y              
PROLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 576  BYTES                            
