*          DATA SET ACPROF9D   AT LEVEL 001 AS OF 02/01/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BF9D      DATE 02/01/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL14     6    2   14  A  P H             T        Y              
PROCOMH  DS    XL8                                                              
PROCOM   DS    CL6      6   20    6  A  U H             T    I   Y   14         
PROCOMX  DS    XL8                                                              
PROLACTH DS    XL8                                                              
PROLACT  DS    CL40     6   38   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
PRODESCH DS    XL8                                                              
PRODESC  DS    CL15     7   20   15  A  U N             T        Y   50         
PRODESCX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      8    2    6  A  P N             T        Y              
PROFILTH DS    XL8                                                              
PROFILT  DS    CL4      8   20    4  A  U N             T        Y   52         
PROFILTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL19     8   38   19  A  P N             T        Y              
PROABOH  DS    XL8                                                              
PROABO   DS    CL3      8   59    3  A  U N             T        Y   52         
PROABOX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL20    10    2   20  A  P N             T        Y              
PROACTH  DS    XL8                                                              
PROACT   DS    CL3     12    2    3  A  U N             T        Y   54         
PROACTX  DS    XL8                                                              
PROTEXTH DS    XL8                                                              
PROTEXT  DS    CL72    12    7   72  A  U H             T        Y   56         
PROTEXTX DS    XL8                                                              
PROACT2H DS    XL8                                                              
PROACT2  DS    CL3     13    2    3  A  U N             T        Y   54         
PROACT2X DS    XL8                                                              
PROTEX2H DS    XL8                                                              
PROTEX2  DS    CL72    13    7   72  A  U H             T        Y   56         
PROTEX2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y   54         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL72    14    7   72  A  U H             T        Y   56         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y   54         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL72    15    7   72  A  U H             T        Y   56         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y   54         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL72    16    7   72  A  U H             T        Y   56         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y   54         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL72    17    7   72  A  U H             T        Y   56         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y   54         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL72    18    7   72  A  U H             T        Y   56         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y   54         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL72    19    7   72  A  U H             T        Y   56         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y   54         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL72    20    7   72  A  U H             T        Y   56         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y   54         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL72    21    7   72  A  U H             T        Y   56         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y   54         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL72    22    7   72  A  U H             T        Y   56         
         DS    XL8                                                              
PROACTCH DS    XL8                                                              
PROACTC  DS    CL3     23    2    3  A  U N             T        Y   54         
PROACTCX DS    XL8                                                              
PROTEXCH DS    XL8                                                              
PROTEXC  DS    CL72    23    7   72  A  U H             T        Y   56         
PROTEXCX DS    XL8                                                              
PROENDH  DS    XL8                                                              
PROEND   DS    CL1     24    2    1  A  P N             T        Y              
PROLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1560 BYTES                            
