*          DATA SET ACPROE0D   AT LEVEL 003 AS OF 04/30/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BE0D      DATE 04/30/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
PRCOFGH  DS    CL8                                                              
PRCOFG   DS    CL1      5   10    1  A  U N             T    I   Y    2         
PRCOFGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   20    6  A  P N             T        Y              
PRCOFFH  DS    CL8                                                              
PRCOFF   DS    CL2      5   28    2  A  U N             T        Y    4         
PRCOFFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
PRCCLIH  DS    CL8                                                              
PRCCLI   DS    CL6      5   46    6  A  U N             T        Y    6         
PRCCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
PRCPROH  DS    CL8                                                              
PRCPRO   DS    CL6      5   64    6  A  U N             T        Y    8         
PRCPROX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
PRCJOBH  DS    CL8                                                              
PRCJOB   DS    CL6      6   10    6  A  U N             T        Y   10         
PRCJOBX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
PRCMGRH  DS    CL8                                                              
PRCMGR   DS    CL1      6   28    1  A  U N             T        Y   12         
PRCMGRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      6   38    5  A  P N             T        Y              
PRCMEDH  DS    CL8                                                              
PRCMED   DS    CL1      6   46    1  A  U N             T        Y   14         
PRCMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   56    7  A  P N             T        Y              
PRCWGRH  DS    CL8                                                              
PRCWGR   DS    CL1      6   64    1  A  U N             T        Y   16         
PRCWGRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7    2    4  A  P N             T        Y              
PRCWRKH  DS    CL8                                                              
PRCWRK   DS    CL2      7   10    2  A  U N             T        Y   18         
PRCWRKX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      7   20    8  A  P N             T        Y              
PRCEFFH  DS    CL8                                                              
PRCEFF   DS    CL8      7   33    8  A  U N             T        Y   20         
PRCEFFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   50    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78     8    2   78  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL73     9    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL73    10    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL73    11    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL73    12    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL73    13    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL73    14    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL73    15    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL73    16    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL73    17    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL73    18    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL73    19    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL73    20    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL73    21    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL73    22    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL73    23    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P H             T        Y              
PRCLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PRCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2024 BYTES                            
