*          DATA SET ACPROB5D   AT LEVEL 025 AS OF 04/25/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BB5D      DATE 04/25/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL13     6    2   13  A  P H             T        Y              
PROSCLIH DS    CL8                                                              
PROSCLI  DS    CL6      6   16    6  A  U N             T    I   Y    2         
PROSCLIX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   23    7  A  P H             T        Y              
PROSPROH DS    CL8                                                              
PROSPRO  DS    CL6      6   31    6  A  U N             T        Y    4         
PROSPROX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      6   39    3  A  P H             T        Y              
PROSJOBH DS    CL8                                                              
PROSJOB  DS    CL6      6   46    6  A  U N             T        Y    6         
PROSJOBX DS    CL8                                                              
PROSJNMH DS    CL8                                                              
PROSJNM  DS    CL27     6   53   27  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     7    2   11  A  P H             T        Y              
PROSTYPH DS    CL8                                                              
PROSTYP  DS    CL4      7   16    4  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1      7   22    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13     8    2   13  A  P H             T        Y              
PROACLIH DS    CL8                                                              
PROACLI  DS    CL6      8   16    6  A  U N             T        Y   10         
PROACLIX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   23    7  A  P H             T        Y              
PROAPROH DS    CL8                                                              
PROAPRO  DS    CL6      8   31    6  A  U N             T        Y   12         
PROAPROX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      8   39    3  A  P H             T        Y              
PROAJOBH DS    CL8                                                              
PROAJOB  DS    CL6      8   46    6  A  U N             T        Y   14         
PROAJOBX DS    CL8                                                              
PROAJNMH DS    CL8                                                              
PROAJNM  DS    CL27     8   53   27  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     10    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     10    4    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   11    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   20    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   29    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   42    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   44    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   51    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   60    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   69    6  A  P N             T        Y              
PROACT1H DS    CL8                                                              
PROACT1  DS    CL1     11    2    1  A  U N             T        Y   16         
PROACT1X DS    CL8                                                              
PROPON1H DS    CL8                                                              
PROPON1  DS    CL6     11    4    6  A  U N             T        Y   18         
PROPON1X DS    CL8                                                              
PROOPE1H DS    CL8                                                              
PROOPE1  DS    CL8     11   11    8  A  P N             T        Y              
PRODUE1H DS    CL8                                                              
PRODUE1  DS    CL8     11   20    8  A  P N             T        Y              
PROAMT1H DS    CL8                                                              
PROAMT1  DS    CL11    11   29   11  A  P N             T        Y              
PROACT2H DS    CL8                                                              
PROACT2  DS    CL1     11   42    1  A  U N             T        Y   16         
PROACT2X DS    CL8                                                              
PROPON2H DS    CL8                                                              
PROPON2  DS    CL6     11   44    6  A  U N             T        Y   18         
PROPON2X DS    CL8                                                              
PROOPE2H DS    CL8                                                              
PROOPE2  DS    CL8     11   51    8  A  P N             T        Y              
PRODUE2H DS    CL8                                                              
PRODUE2  DS    CL8     11   60    8  A  P N             T        Y              
PROAMT2H DS    CL8                                                              
PROAMT2  DS    CL11    11   69   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12    2    1  A  U N             T        Y   16         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     12    4    6  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     12   11    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   20    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   29   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   42    1  A  U N             T        Y   16         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     12   44    6  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     12   51    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   60    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   69   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     13    2    1  A  U N             T        Y   16         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     13    4    6  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     13   11    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   20    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   29   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   42    1  A  U N             T        Y   16         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     13   44    6  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     13   51    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   60    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   69   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14    2    1  A  U N             T        Y   16         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14    4    6  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     14   11    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   20    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   29   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   42    1  A  U N             T        Y   16         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14   44    6  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     14   51    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   60    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   69   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15    2    1  A  U N             T        Y   16         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     15    4    6  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     15   11    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   20    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   29   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   42    1  A  U N             T        Y   16         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     15   44    6  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     15   51    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   60    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   69   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16    2    1  A  U N             T        Y   16         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     16    4    6  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     16   11    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   20    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   29   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   42    1  A  U N             T        Y   16         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     16   44    6  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     16   51    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   60    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   69   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17    2    1  A  U N             T        Y   16         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     17    4    6  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     17   11    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   20    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   29   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   42    1  A  U N             T        Y   16         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     17   44    6  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     17   51    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   60    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   69   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     18    2    1  A  U N             T        Y   16         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     18    4    6  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     18   11    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   20    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   29   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   42    1  A  U N             T        Y   16         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     18   44    6  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     18   51    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   60    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   69   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19    2    1  A  U N             T        Y   16         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     19    4    6  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     19   11    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   20    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   29   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   42    1  A  U N             T        Y   16         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     19   44    6  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     19   51    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   60    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   69   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20    2    1  A  U N             T        Y   16         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     20    4    6  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     20   11    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   20    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   29   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   42    1  A  U N             T        Y   16         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     20   44    6  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     20   51    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   60    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   69   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21    2    1  A  U N             T        Y   16         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     21    4    6  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     21   11    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   20    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   29   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   42    1  A  U N             T        Y   16         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     21   44    6  A  U N             T        Y   18         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     21   51    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   60    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   69   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28    24    2   28  A  P H             T        Y              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2584 BYTES                            
