*          DATA SET ACPRODFREC AT LEVEL 058 AS OF 07/01/20                      
*              DEFAULT RECORD                                                   
*                                                                               
DEFREC   DC    49X'00'                 KEY ETC                                  
*                                                                               
         DC    X'A4',AL1(17,OPNIAES)   INTERNAL APPROVAL IN EST                 
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(20,OPNRQU)    REQUISITION NO. IN USE                   
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    CL4' '                  BLANK                                    
*                                                                               
         DC    X'A4',AL1(17,OPNRQP)    REQUISITION PREFIX                       
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    C' '                    BLANK                                    
*                                                                               
         DC    X'A4',AL1(17,OPNRQS)    REQUISITION SUFFIX                       
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    C' '                    BLANK                                    
*                                                                               
         DC    X'A4',AL1(17,OPNOAN)    ORDER ANALYSIS                           
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    XL1'03'                 NONE                                     
*                                                                               
         DC    X'A4',AL1(17,OPNOAI)    ORDERS ALL ITEMS                         
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNEVS)    EXP A/C VIS TO SUBMITTER                 
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    C'Y'                    YES                                      
*                                                                               
         DC    X'A4',AL1(17,OPNSAP)    SEQUENTIAL APPROVERS                     
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNCECE)   COPY EST. COPY EXTRA DATA                
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    C'Y'                    YES                                      
*                                                                               
         DC    X'A4',AL1(20,OPNUESOA)  USE EST STAT IN ORDER APPR               
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    CL4' '                  BLANK                                    
*                                                                               
         DC    X'A4',AL1(17,OPNEMIN)   EST CHECK NON-BILL INVOICES              
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNDIOS)   B/O INCL ORDER STATUS                    
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    X'04'                   SUBMITTED                                
*                                                                               
         DC    X'A4',AL1(17,OPNDITSR)  B/O INCL R TIME STATUS                   
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    X'04'                   SUBMITTED                                
*                                                                               
         DC    X'A4',AL1(17,OPNDITSB)  B/O INCL B TIME STATUS                   
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    X'04'                   APPROVED                                 
*                                                                               
         DC    X'A4',AL1(17,OPNDITSN)  B/O INCL N TIME STATUS                   
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    X'04'                   SUBMITTED                                
*                                                                               
         DC    X'A4',AL1(17,OPNDIEN)   B/O INCL N-BILL EXP STATUS               
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    X'01'                   NONE                                     
*                                                                               
         DC    X'A4',AL1(17,OPNDIEB)   B/O INCL BILL EXP STATUS                 
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    X'04'                   SUBMITTED                                
*                                                                               
         DC    X'A4',AL1(17,OPNDIEO)   B/O INCL EXP ORDER STATUS                
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    X'01'                   NONE                                     
*                                                                               
         DC    X'A4',AL1(17,OPNDEIS)   B/O INCL NON-BILL INVOICES               
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNSRQ)    SUPPLIER REQUIRED TO SUBMIT              
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    C'Y'                    YES                                      
*                                                                               
         DC    X'A4',AL1(17,OPNXRQ)    EXPENSE REQUIRED TO SUBMIT               
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNEORM)   EST CHECK EXPENSE ORDER                  
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    X'01'                   NONE                                     
*                                                                               
         DC    X'A4',AL1(17,OPNEORN)   EST CHECK PRODUCTION ORDERS              
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    X'02'                   APPROVED                                 
*                                                                               
         DC    X'A4',AL1(17,OPNETMR)   EST CHECK R TYPE TIME                    
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    X'01'                   NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNETMB)   EST CHECK. B TYPE TIME                   
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    X'02'                   APPROVED                                 
*                                                                               
         DC    X'A4',AL1(17,OPNEXPN)   EST CHECK NON-BILL EXP                   
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    X'01'                   NONE                                     
*                                                                               
         DC    X'A4',AL1(17,OPNEXPB)   EST CHECK BILLABLE EXPENSES              
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    X'02'                   APPROVED                                 
*                                                                               
         DC    X'A4',AL1(20,OPNSLA)    ALLOW SELF APPROVAL                      
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    CL4' '                  BLANK                                    
*                                                                               
         DC    X'A4',AL1(20,OPNCOM)    AGENCY COMMISSION                        
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    PL4'176500'             17.6500%                                 
*                                                                               
         DC    X'A4',AL1(17,OPNBT)     BILLING TYPE                             
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'P'                    PROGRESSIVE                              
*                                                                               
         DC    X'A4',AL1(17,OPNDUE)    NUMBER OF DAYS BILL DUE                  
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    AL1(10)                 10                                       
*                                                                               
         DC    X'A4',AL1(20,OPNOVPER)  MAXIMUM PERCENT OF ESTIMATE              
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    PL4'10000'              100.00%                                  
*                                                                               
         DC    X'A4',AL1(20,OPNOVAMT)  MAXIMUM AMOUNT OVER ESTIMATE             
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    PL4'0000'               000.00                                   
*                                                                               
         DC    X'A4',AL1(17,OPNEEDES)  ESTIMATE NEEDED FOR BILL                 
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'Y'                    YES                                      
*                                                                               
         DC    X'A4',AL1(20,OPNMIN)    MINIMUM AMOUNT OF BILL                   
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    PL4'5000'               $50.00                                   
*                                                                               
         DC    X'A4',AL1(17,OPNCLSUM)  CLIENT SUMMARY ON BILLS                  
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'Y'                    YES                                      
*                                                                               
         DC    X'A4',AL1(17,OPNPRSUM)  PRODUCT SUMMARY ON BILLS                 
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'Y'                    YES                                      
*                                                                               
         DC    X'A4',AL1(17,OPNDET)    SHOW DETAIL LINES ON BILLS               
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'Y'                    YES                                      
*                                                                               
         DC    X'A4',AL1(17,OPNWCNES)  SHOW WORK CODE ON ESTIMATE BILLS         
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNCD)     PASS CASH DISCOUNT TO CLIENT             
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'Y'                    YES                                      
*                                                                               
         DC    X'A4',AL1(17,OPNET)     PAY AGENCY NET                           
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNSUPAG)  SUPPRESS AGENCY COMMISSION               
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,117)       TRANSFER TO SPOT/PRINT                   
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'Y'                    YES                                      
*                                                                               
         DC    X'A4',AL1(17,OPNESCM)   ESTIMATE BILLS COMMISSIONABLE            
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'Y'                    YES                                      
*                                                                               
         DC    X'A4',AL1(17,119)       GROSS + CD TO COSTING                    
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNEWJUN)  NEW JOBS ARE UNAPPROVED                  
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNZERO)   ZERO BILLINGS AMOUNT                     
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNAUTUN)  AUTO UNHOLD WHEN BILLING                 
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNSUPST)  SUPPRESS STICKY LABELS                   
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNEWE)    EST CHECK ERROR WARNING                  
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    X'01'                   NONE                                     
*                                                                               
         DC    X'A4',AL1(17,OPNECE)    EST CHECK TYPE                           
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    XL1'03'                 3                                        
*                                                                               
         DC    X'A4',AL1(17,133)       1-LINE PER WORK CODE ON BILLS            
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,134)       1-LINE PER WORK CODE ON P1               
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNEEDAE)  NEED APPROVED ESTIMATE TO BILL           
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNESTYP)  ESTIMATE TYPE FOR NEW JOBS               
         DC    CL8'DDS',X'890601'                                               
         DC    X'0000'                                                          
         DC    C'N'                    N=NEW                                    
*                                                                               
         DC    X'A4',AL1(17,OPNPROD)   PRODUCTION JOBS ALLOWED                  
         DC    CL8'DDS',X'900101'                                               
         DC    X'0000'                                                          
         DC    C'Y'                    YES                                      
*                                                                               
         DC    X'A4',AL1(20,OPNETIP)   ESTIMATE TITLE PANEL                     
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'9999'                 9999                                     
*                                                                               
         DC    X'A4',AL1(20,OPNESTP)   ESTIMATE SUB-TITLE PANEL                 
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'9999'                 9999                                     
*                                                                               
         DC    X'A4',AL1(20,OPNEHDP)   ESTIMATE HEADER PANEL                    
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'9999'                 9999                                     
*                                                                               
         DC    X'A4',AL1(20,OPNESHP)   ESTIMATE SUB-HEADER PANEL                
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'9999'                 9999                                     
*                                                                               
         DC    X'A4',AL1(20,OPNEFTP)   ESTIMATE FOOTER PANEL                    
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'9999'                 9999                                     
*                                                                               
         DC    X'A4',AL1(20,OPNESFP)   ESTIMATE SUB-FOOTER PANEL                
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'9999'                 9999                                     
*                                                                               
         DC    X'A4',AL1(20,OPNECTP)   ESTIMATE CATEGORY PANEL                  
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'9999'                 9999                                     
*                                                                               
         DC    X'A4',AL1(20,OPNEWCP)   ESTIMATE WORKCODE PANEL                  
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'9999'                 9999                                     
*                                                                               
         DC    X'A4',AL1(17,OPNEAPP)   APPROVE ESTIMATE                         
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'M'                    M(AIN FRAME)                             
*                                                                               
         DC    X'A4',AL1(17,OPNEPRP)   ADD PREPARER MF OR PRESTO                
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'M'                    M(AIN FRAME)                             
*                                                                               
         DC    X'A4',AL1(17,OPNBATCH)  NEED APPROVED ESTIMATE TO BATCH          
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(20,163)       ESTIMATE PERCENTAGE                      
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    PL4'000000'             00.0000%                                 
*                                                                               
         DC    X'A4',AL1(17,OPNAWO)    AUTOMATIC WRITE OFF                      
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'N'                                                             
*                                                                               
         DC    X'A4',AL1(19,OPNCERCH)  EMAIL WHEN REACH CE%                     
         DC    CL8'DDS',X'A90312'                                               
         DC    X'0000'                                                          
         DC    PL3'000000'             0000.00%                                 
*                                                                               
         DC    X'A4',AL1(18,OPNINACT)  EMAIL WHEN DAYS INACTIVE                 
         DC    CL8'DDS',X'A90312'                                               
         DC    X'0000'                                                          
         DC    XL2'00'                 00                                       
*                                                                               
         DC    X'A4',AL1(19,OPNCEAMB)  JOB DASH AMBER WHEN REACH CE%            
         DC    CL8'DDS',X'A90312'                                               
         DC    X'0000'                                                          
         DC    PL3'000000'             0000.00%                                 
*                                                                               
         DC    X'A4',AL1(19,OPNCERED)  JOB DASH RED WHEN REACH CE%              
         DC    CL8'DDS',X'A90312'                                               
         DC    X'0000'                                                          
         DC    PL3'000000'             0000.00%                                 
*                                                                               
         DC    X'A4',AL1(17,OPNNJB)    JOB INPUT ALLOWED FOR TIME               
         DC    CL8'DDS',X'A90312'                                               
         DC    X'0000'                                                          
         DC    C'Y'                    YES                                      
*                                                                               
         DC    X'A4',AL1(19,OPNPAU)    PROD AUTO APPROVAL                       
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    XL3'00'                 XL3'0'                                   
*                                                                               
         DC    X'A4',AL1(19,OPNEAU)    EXP AUTO APPROVAL                        
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    XL3'0'                  XL3'0'                                   
*                                                                               
         DC    X'A4',AL1(17,OPNWCF)    USE W/C FLAG FOR EST CHECK               
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(20,OPNPZO)    PREVENT ZERO ORDER AMOUNT                
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    CL4' '                  BLANK                                    
*                                                                               
         DC    X'A4',AL1(21,OPNPBPCT)  PERCENT OF BILLING %                     
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    PL5'0000'               00.00%                                   
*                                                                               
         DC    X'A4',AL1(17,OPNIUSO)   INTERNAL USE ONLY DEF. ST                
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNTAX)    TAX REQUIRED                             
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'N'                                                             
*                                                                               
         DC    X'A4',AL1(17,OPNSTUD)   STUDIO JOB                               
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'N'                                                             
*                                                                               
         DC    X'A4',AL1(17,OPNHOLD)   HOLD AGENCY DEBITS                       
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'N'                                                             
*                                                                               
         DC    X'A4',AL1(17,OPNINT)    INTERCOMPANY POSTINGS                    
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    C'N'                                                             
*                                                                               
         DC    X'A4',AL1(17,OPNLDEST)  JOB LOCKED FROM ESTIMATES                
         DC    CL8'DDS',X'A90312'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNLDORD)  JOB LOCKED FROM ORDERS                   
         DC    CL8'DDS',X'A90312'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNLDBIL)  JOB LOCKED FROM BILLING                  
         DC    CL8'DDS',X'A90312'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNLDTSI)  JOB LOCKED FROM TIMESHEETS               
         DC    CL8'DDS',X'A90312'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNLDADJ)  JOB LOCKED FROM ADJUSTMENTS              
         DC    CL8'DDS',X'A90312'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNLDEXT)  JOB LOCKED FROM EXTERNAL COSTS           
         DC    CL8'DDS',X'A90312'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(24,OPNENC)    ESTIMATE NO. REQUIRED                    
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    CL8' '                  BLANK                                    
*                                                                               
         DC    X'A4',AL1(17,OPNEWC)    EXP W/C INPUT                            
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(20,OPNOIT)    USE ITEMS IN ORDERS                      
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    CL4' '                  BLANK                                    
*                                                                               
         DC    X'A4',AL1(17,OPNIDRF)   DRAFT JOBS                               
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNACUA)   AUTO COPY FROM UNCOM AMTS                
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNNTJA)   NOTIFY TEAM WHEN JOB APP                 
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(20,OPNASPCT)  ADMINISTRATIVE SURCHARGE %               
         DC    CL8'DDS',X'871001'                                               
         DC    X'0000'                                                          
         DC    PL4'0000'               00.00%                                   
*                                                                               
         DC    X'A4',AL1(17,OPNPAB)    PRINT AUTHORZATION # ON BILL             
         DC    CL8'DDS',X'A01201'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(29,OPNANT)    AUTHORIZATION NUMBER TITLE               
         DC    CL8'DDS',X'A01201'                                               
         DC    X'0000'                                                          
         DC    C'AUTHORIZATION'        DEFAULT TITLE                            
*                                                                               
         DC    X'A4',AL1(17,OPNORDER)  ALLOW BACKDATED ORDERS                   
         DC    CL8'DDS',X'A30512'                                               
         DC    X'0000'                                                          
         DC    C'Y'                    YES                                      
*                                                                               
         DC    X'A4',AL1(17,OPNJLE)    NO JOB LEVEL ENTRY FOR HOUSE             
         DC    CL8'DDS',X'A90706'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNBIO)    ITEM IS BILLABLE ONLY                    
         DC    CL8'DDS',X'A90707'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNAEDT)   ALLOW EST WITH DRAFT JOB                 
         DC    CL8'DDS',X'B00308'                                               
         DC    X'0000'                                                          
         DC    C'Y'                    YES                                      
*                                                                               
         DC    X'A4',AL1(21,OPNCOES)   CREATE ORDER FROM EST                    
         DC    CL8'DDS',X'B00413'                                               
         DC    X'0000'                                                          
         DC    CL5'SA'                 APP/SUB                                  
*                                                                               
         DC    X'A4',AL1(17,OPNDCTEO)  COPY TXT FROM EST                        
         DC    CL8'DDS',X'B00413'                                               
         DC    X'0000'                                                          
         DC    C'Y'                    YES                                      
*                                                                               
         DC    X'A4',AL1(19,OPNBIEA)   AMT TO BYPASS INT EST APP                
         DC    CL8'DDS',X'B00602'                                               
         DC    X'0000'                                                          
         DC    XL3'00'                 ZERO                                     
*                                                                               
         DC    X'A4',AL1(19,OPNBCEA)   AMT TO BYPASS CLI EST APP                
         DC    CL8'DDS',X'B00602'                                               
         DC    X'0000'                                                          
         DC    XL3'00'                 ZERO                                     
*                                                                               
         DC    X'A4',AL1(17,OPNINCR)   INCLUDE R TIME IN EST% COMM.             
         DC    CL8'DDS',X'B00602'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(19,OPNTTA)    TYPE OF TIME                             
         DC    CL8'DDS',X'B00902'                                               
         DC    X'0000'                                                          
         DC    CL3'NRB'                TYPES                                    
*                                                                               
         DC    X'A4',AL1(17,OPNGAPS)   GAP SERVICE IN USE                       
         DC    CL8'DDS',X'B01028'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNDFEXS)  DEFAULT EXPIRATION PERIOD                
         DC    CL8'DDS',X'B01028'                                               
         DC    X'0000'                                                          
         DC    X'1E'                   30 DAYS                                  
*                                                                               
         DC    X'A4',AL1(17,OPNDNDVC)  DEFAULT NO. OF DAYS TO VIEW              
         DC    CL8'DDS',X'B01028'                                               
         DC    X'0000'                                                          
         DC    X'0E'                   14 DAYS                                  
*                                                                               
         DC    X'A4',AL1(17,OPNGAPRA)  GAP APPROVAL REQUIRED BY ALL             
         DC    CL8'DDS',X'B01028'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNSPWPD)  SUPPRESS WORKCODE PRINT                  
         DC    CL8'DDS',X'B01028'                                               
         DC    X'0000'                                                          
         DC    X'01'                   NEVER                                    
*                                                                               
         DC    X'A4',AL1(17,OPNDFEXO)  DEFAULT EXP PERIOD ORDERS                
         DC    CL8'DDS',X'B10217'                                               
         DC    X'0000'                                                          
         DC    X'1E'                   30 DAYS                                  
*                                                                               
         DC    X'A4',AL1(17,OPNGEMEX)  GAP ESTIMATES EMAIL EXTENSION            
         DC    CL8'DDS',X'B10217'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNUCWC)   ESTIMATE USE ACTUAL WHEN W/C             
         DC    CL8'DDS',X'B10217'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNDDSC)   EST DISPLAY JOB DESC ON PDF              
         DC    CL8'DDS',X'B10218'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNJ3RD)   JOB AVAILABLE TO 3RD PARTY               
         DC    CL8'DDS',X'B20327'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNPBT)    DO NOT MOVE BILLED TIME                  
         DC    CL8'DDS',X'B10927'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNPROE)   PRINT RATES ON ESTIMATES                 
         DC    CL8'DDS',X'B11129'                                               
         DC    X'0000'                                                          
         DC    C'Y'                    YES                                      
*                                                                               
         DC    X'A4',AL1(17,OPNCCW)    COLOR CODED WORKCODES                    
         DC    CL8'DDS',X'B21010'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNEXM)    EXCLUDE MEMO CHARGES                     
         DC    CL8'DDS',X'B21010'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNPPORE)  PART APPROVED PO RESUBMIT                
         DC    CL8'DDS',X'B21010'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNMPORE)  MATCHED PO RESUBMIT                      
         DC    CL8'DDS',X'B21010'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNFPORE)  FULLY APPROVED PO RESUBMIT               
         DC    CL8'DDS',X'B21010'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNUSD)    PRINT USD ON BILL                        
         DC    CL8'DDS',X'B40421'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNSJOF)   USE SJ OFFICE FOR RATE                   
         DC    CL8'DDS',X'B50818'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNEPAJ)   AURA EMAIL PERSON ASSIGN TO JOB          
         DC    CL8'DDS',X'B80214'                                               
         DC    X'0000'                                                          
         DC    C'N'                    NO                                       
*                                                                               
         DC    X'A4',AL1(17,OPNEEDT)   DATE EST IN LAST FISCAL YEAR             
         DC    CL8'DDS',X'C00518'                                               
         DC    X'0000'                                                          
         DC    C'Y'                    YES                                      
*                                                                               
         DC    X'00'               END OF RECORD                                
