*          DATA SET ACPROE2D   AT LEVEL 009 AS OF 11/04/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BE2D      DATE 11/04/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P N             T        Y              
PROCLIH  DS    XL8                                                              
PROCLI   DS    CL3      5   10    3  A  U N             T    I   Y   16         
PROCLIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
PROSTAH  DS    XL8                                                              
PROSTA   DS    CL3      5   28    3  A  U N             T        Y   34         
PROSTAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   38    6  A  P N             T        Y              
PROOFFH  DS    XL8                                                              
PROOFF   DS    CL2      5   46    2  A  U N             T        Y    4         
PROOFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2      5   49    2  A  P N             T        Y              
PROFILTH DS    XL8                                                              
PROFILT  DS    CL2      5   52    2  A  U N             T        Y   50         
PROFILTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2      5   55    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      5   58    2  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2      5   61    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      5   64    2  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2      5   67    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      5   70    2  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2      5   73    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      5   76    2  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
PROOPTH  DS    XL8                                                              
PROOPT   DS    CL11     6   10   11  A  U N             T        Y   54         
PROOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   22    6  A  P N             T        Y              
PROSTATH DS    XL8                                                              
PROSTAT  DS    CL15     6   29   15  A  U N             T        Y   52         
PROSTATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2      6   45    2  A  P N             T        Y              
PRODTYPH DS    XL8                                                              
PRODTYP  DS    CL1      6   48    1  A  U N             T        Y   20         
PRODTYPX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   50    4  A  P N             T        Y              
PRODATEH DS    XL8                                                              
PRODATE  DS    CL17     6   55   17  A  U N             T        Y   20         
PRODATEX DS    XL8                                                              
PROTITH  DS    XL8                                                              
PROTIT   DS    CL79     7    2   79  A  P H             T        Y              
PROTAGH  DS    XL8                                                              
PROTAG   DS    CL1      8    2    1  A  P N             T        Y              
PROLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 496  BYTES                            
