*          DATA SET ACPROCFD   AT LEVEL 001 AS OF 01/26/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BCFD      DATE 01/26/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      6    2    8  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      6   38    8  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8    2    6  L  P H             T        Y              
SCHFCODH DS    CL8                                                              
SCHFCOD  DS    CL8      8   10    8  A  U N             T    I   Y   40         
SCHFCODX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      8   38    6  L  P H             T        Y              
SCHTCODH DS    CL8                                                              
SCHTCOD  DS    CL8      8   46    8  A  U N             T        Y   41         
SCHTCODX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     10    2    6  L  P N             T        Y              
SCHFNAMH DS    CL8                                                              
SCHFNAM  DS    CL20    10   10   20  A  U N             T        Y   50         
SCHFNAMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     10   38    6  L  P H             T        Y              
SCHTNAMH DS    CL8                                                              
SCHTNAM  DS    CL20    10   46   20  A  U N             T        Y   51         
SCHTNAMX DS    CL8                                                              
SCHPFAH  DS    CL8                                                              
SCHPFA   DS    CL78    24    2   78  A  P H             T        Y              
SCHLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SCHWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 304  BYTES                            
