*          DATA SET ACPROBED   AT LEVEL 002 AS OF 08/22/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BBED      DATE 08/22/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
AUTOGRH  DS    XL8                                                              
AUTOGR   DS    CL1      6   10    1  A  U N             T    I   Y    2         
AUTOGRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
AUTOFCH  DS    XL8                                                              
AUTOFC   DS    CL2      6   28    2  A  U N             T        Y    4         
AUTOFCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   38    6  A  P N             T        Y              
AUTCLIH  DS    XL8                                                              
AUTCLI   DS    CL6      6   46    6  A  U N             T        Y   16         
AUTCLIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   56    7  A  P N             T        Y              
AUTPROH  DS    XL8                                                              
AUTPRO   DS    CL6      6   64    6  A  U N             T        Y   18         
AUTPROX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
AUTMGRH  DS    XL8                                                              
AUTMGR   DS    CL1      7   10    1  A  U N             T        Y    6         
AUTMGRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7   20    7  A  P N             T        Y              
AUTMEDH  DS    XL8                                                              
AUTMED   DS    CL1      7   28    1  A  U N             T        Y    8         
AUTMEDX  DS    XL8                                                              
AUTLACTH DS    XL8                                                              
AUTLACT  DS    CL40     7   38   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20     9    2   20  A  P H             T        Y              
AUTNUMH  DS    XL8                                                              
AUTNUM   DS    CL19     9   24   19  A  U N             T        Y   10         
AUTNUMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      9   45    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17     9   47   17  A  P H             T        Y              
AUTAMTH  DS    XL8                                                              
AUTAMT   DS    CL12     9   66   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11    10    2   11  A  P N             T        Y              
AUTAUTDH DS    XL8                                                              
AUTAUTD  DS    CL36    10   14   36  A  U N             T        Y   14         
AUTAUTDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     11    2    6  A  P N             T        Y              
AUTSTATH DS    XL8                                                              
AUTSTAT  DS    CL1     11    9    1  A  U N             T        Y              
AUTUSEHH DS    XL8                                                              
AUTUSEH  DS    CL8     13    2    8  A  P N             T        Y              
AUTUSEDH DS    XL8                                                              
AUTUSED  DS    CL30    13   11   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   42    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    13   51   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    14   11   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   42    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    14   51   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    15   11   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   42    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    15   51   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    16   11   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   42    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    16   51   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    17   11   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   42    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30    17   51   30  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    19    2   15  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL10    20    3   10  A  P N             T        Y              
AUTAAMTH DS    XL8                                                              
AUTAAMT  DS    CL12    20   20   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     21    3    6  A  P N             T        Y              
AUTFAMTH DS    XL8                                                              
AUTFAMT  DS    CL12    21   20   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15    22    3   15  A  P N             T        Y              
AUTUAMTH DS    XL8                                                              
AUTUAMT  DS    CL12    22   20   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   69    1  A  P N             T        Y              
AUTPFH   DS    XL8                                                              
AUTPF    DS    CL21    24    2   21  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL11    24   70   11  A  P H             T        Y              
AUTLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
AUTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1200 BYTES                            
