*          DATA SET ACPROF6D   AT LEVEL 012 AS OF 02/12/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BF6D      DATE 02/12/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
PROOGRH  DS    XL8                                                              
PROOGR   DS    CL3      6   10    3  A  U N             T    I   Y    2         
PROOGRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
PROOFFH  DS    XL8                                                              
PROOFF   DS    CL2      6   28    2  A  U N             T        Y    4         
PROOFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   38    6  A  P N             T        Y              
PROCLIH  DS    XL8                                                              
PROCLI   DS    CL6      6   46    6  A  U N             T        Y   16         
PROCLIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   56    7  A  P N             T        Y              
PROPROH  DS    XL8                                                              
PROPRO   DS    CL6      6   64    6  A  U N             T        Y   18         
PROPROX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
PROMGRH  DS    XL8                                                              
PROMGR   DS    CL1      7   10    1  A  U N             T        Y    6         
PROMGRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7   20    7  A  P N             T        Y              
PROMEDH  DS    XL8                                                              
PROMED   DS    CL1      7   28    1  A  U N             T        Y    8         
PROMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      7   38    3  A  P N             T        Y              
PROJOBH  DS    XL8                                                              
PROJOB   DS    CL6      7   46    6  A  U N             T        Y   20         
PROJOBX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      8    2    1  A  P N             T        Y              
PROLACTH DS    XL8                                                              
PROLACT  DS    CL40     9    2   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL38    11    2   38  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL39    11   41   39  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL40    12    2   40  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL37    12   42   37  A  P H             T        Y              
PROFLDH  DS    XL8                                                              
PROFLD   DS    CL2     13    3    2  A  U N             T        Y   38         
PROFLDX  DS    XL8                                                              
PROFHEDH DS    XL8                                                              
PROFHED  DS    CL12    13    8   12  A  U N             T        Y   50         
PROFHEDX DS    XL8                                                              
PROEDITH DS    XL8                                                              
PROEDIT  DS    CL1     13   22    1  A  U N             T        Y   52         
PROEDITX DS    XL8                                                              
PROMAXH  DS    XL8                                                              
PROMAX   DS    CL2     13   27    2  A  U N             T        Y   54         
PROMAXX  DS    XL8                                                              
PROREQH  DS    XL8                                                              
PROREQ   DS    CL1     13   31    1  A  U N             T        Y   56         
PROREQX  DS    XL8                                                              
PRONFBH  DS    XL8                                                              
PRONFB   DS    CL1     13   36    1  A  U N             T        Y   58         
PRONFBX  DS    XL8                                                              
PROSOEH  DS    XL8                                                              
PROSOE   DS    CL1     13   44    1  A  U N             T        Y   60         
PROSOEX  DS    XL8                                                              
PROSOBH  DS    XL8                                                              
PROSOB   DS    CL1     13   52    1  A  U N             T        Y   62         
PROSOBX  DS    XL8                                                              
PRORECH  DS    XL8                                                              
PROREC   DS    CL1     13   60    1  A  U N             T        Y   66         
PRORECX  DS    XL8                                                              
PROAUTH  DS    XL8                                                              
PROAUT   DS    CL1     13   68    1  A  U N             T        Y   67         
PROAUTX  DS    XL8                                                              
PROCUTH  DS    XL8                                                              
PROCUT   DS    CL8     13   73    8  A  U N             T        Y   64         
PROCUTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     14    3    2  A  U N             T        Y   38         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    14    8   12  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     14   22    1  A  U N             T        Y   52         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     14   27    2  A  U N             T        Y   54         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     14   31    1  A  U N             T        Y   56         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     14   36    1  A  U N             T        Y   58         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     14   44    1  A  U N             T        Y   60         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     14   52    1  A  U N             T        Y   62         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     14   60    1  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     14   68    1  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     14   73    8  A  U N             T        Y   64         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     15    3    2  A  U N             T        Y   38         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    15    8   12  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   22    1  A  U N             T        Y   52         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     15   27    2  A  U N             T        Y   54         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   31    1  A  U N             T        Y   56         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   36    1  A  U N             T        Y   58         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   44    1  A  U N             T        Y   60         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   52    1  A  U N             T        Y   62         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   60    1  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   68    1  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     15   73    8  A  U N             T        Y   64         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     16    3    2  A  U N             T        Y   38         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    16    8   12  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   22    1  A  U N             T        Y   52         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     16   27    2  A  U N             T        Y   54         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   31    1  A  U N             T        Y   56         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   36    1  A  U N             T        Y   58         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   44    1  A  U N             T        Y   60         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   52    1  A  U N             T        Y   62         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   60    1  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     16   68    1  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     16   73    8  A  U N             T        Y   64         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     17    3    2  A  U N             T        Y   38         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    17    8   12  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17   22    1  A  U N             T        Y   52         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     17   27    2  A  U N             T        Y   54         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17   31    1  A  U N             T        Y   56         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17   36    1  A  U N             T        Y   58         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17   44    1  A  U N             T        Y   60         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17   52    1  A  U N             T        Y   62         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17   60    1  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     17   68    1  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     17   73    8  A  U N             T        Y   64         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     18    3    2  A  U N             T        Y   38         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    18    8   12  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18   22    1  A  U N             T        Y   52         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     18   27    2  A  U N             T        Y   54         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18   31    1  A  U N             T        Y   56         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18   36    1  A  U N             T        Y   58         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18   44    1  A  U N             T        Y   60         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18   52    1  A  U N             T        Y   62         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18   60    1  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     18   68    1  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     18   73    8  A  U N             T        Y   64         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     19    3    2  A  U N             T        Y   38         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    19    8   12  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     19   22    1  A  U N             T        Y   52         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     19   27    2  A  U N             T        Y   54         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     19   31    1  A  U N             T        Y   56         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     19   36    1  A  U N             T        Y   58         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     19   44    1  A  U N             T        Y   60         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     19   52    1  A  U N             T        Y   62         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     19   60    1  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     19   68    1  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     19   73    8  A  U N             T        Y   64         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     20    3    2  A  U N             T        Y   38         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    20    8   12  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20   22    1  A  U N             T        Y   52         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     20   27    2  A  U N             T        Y   54         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20   31    1  A  U N             T        Y   56         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20   36    1  A  U N             T        Y   58         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20   44    1  A  U N             T        Y   60         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20   52    1  A  U N             T        Y   62         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20   60    1  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     20   68    1  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     20   73    8  A  U N             T        Y   64         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     21    3    2  A  U N             T        Y   38         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    21    8   12  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21   22    1  A  U N             T        Y   52         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     21   27    2  A  U N             T        Y   54         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21   31    1  A  U N             T        Y   56         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21   36    1  A  U N             T        Y   58         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21   44    1  A  U N             T        Y   60         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21   52    1  A  U N             T        Y   62         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21   60    1  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21   68    1  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     21   73    8  A  U N             T        Y   64         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     22    3    2  A  U N             T        Y   38         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    22    8   12  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22   22    1  A  U N             T        Y   52         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     22   27    2  A  U N             T        Y   54         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22   31    1  A  U N             T        Y   56         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22   36    1  A  U N             T        Y   58         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22   44    1  A  U N             T        Y   60         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22   52    1  A  U N             T        Y   62         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22   60    1  A  U N             T        Y   66         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     22   68    1  A  U N             T        Y   67         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     22   73    8  A  U N             T        Y   64         
         DS    XL8                                                              
PROLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2560 BYTES                            
