*          DATA SET ACPROD7D   AT LEVEL 006 AS OF 06/11/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BD7D      DATE 06/11/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
PROOGRH  DS    CL8                                                              
PROOGR   DS    CL1      6   15    1  A   U    N         T    I   Y    2         
PROOGRX  DS    CL8                                                              
PROOGRNH DS    CL8                                                              
PROOGRN  DS    CL36     6   23   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
PROOFFH  DS    CL8                                                              
PROOFF   DS    CL3      7   15    3  A   U    N         T        Y    4         
PROOFFX  DS    CL8                                                              
PROOFFNH DS    CL8                                                              
PROOFFN  DS    CL36     7   23   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
PROCLIH  DS    CL8                                                              
PROCLI   DS    CL3      8   15    3  A   U    N         T        Y   16         
PROCLIX  DS    CL8                                                              
PROCLINH DS    CL8                                                              
PROCLIN  DS    CL36     8   23   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    N         T        Y              
PROPROH  DS    CL8                                                              
PROPRO   DS    CL3      9   15    3  A   U    N         T        Y   18         
PROPROX  DS    CL8                                                              
PROPRONH DS    CL8                                                              
PROPRON  DS    CL36     9   23   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    N         T        Y              
PROJOBH  DS    CL8                                                              
PROJOB   DS    CL6     10   15    6  A   U    N         T        Y   20         
PROJOBX  DS    CL8                                                              
PROJOBNH DS    CL8                                                              
PROJOBN  DS    CL36    10   23   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A   P    N         T        Y              
PROMGRH  DS    CL8                                                              
PROMGR   DS    CL1     11   15    1  A   U    N         T        Y    6         
PROMGRX  DS    CL8                                                              
PROMGRNH DS    CL8                                                              
PROMGRN  DS    CL36    11   23   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5     12    2    5  A   P    N         T        Y              
PROMEDH  DS    CL8                                                              
PROMED   DS    CL1     12   15    1  A   U    N         T        Y    8         
PROMEDX  DS    CL8                                                              
PROMEDNH DS    CL8                                                              
PROMEDN  DS    CL36    12   23   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9     13    2    9  A   P    N         T        Y              
PROUSRH  DS    CL8                                                              
PROUSR   DS    CL3     13   15    3  A   U    N         T        Y   38         
PROUSRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14    2    6  A   P    N         T        Y              
PROUPTH  DS    CL8                                                              
PROUPT   DS    CL1     14   15    1  A   U    N         T        Y   50         
PROUPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL26    14   23   26  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    15    2   12  A   P    N         T        Y              
PROCLOH  DS    CL8                                                              
PROCLO   DS    CL1     15   15    1  A   U    N         T        Y   54         
PROCLOX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL26    15   23   26  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     16    2    4  A   P    N         T        Y              
PROTYPH  DS    CL8                                                              
PROTYP   DS    CL1     16   15    1  A   U    N         T        Y   52         
PROTYPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL39    16   23   39  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL43    17   23   43  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2     18    2    2  A   P    N         T        Y              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 856  BYTES                            
