*          DATA SET ACPRVTAB   AT LEVEL 006 AS OF 08/12/97                      
* THIS MODULE IS INCLUDED IN THE FOLLOWING PROGRAMS::                           
* ACBAT41, ACBAT48, ACENQ01, ACENQ02, ACENQ06, ACLFM03 AND ACVATICAN            
*                                                                               
         DS    0F                                                               
PRVTAB   DS    0CL4                                                             
         DC    C'BC',S(AC@QST)       BRITISH COLUMBIA                           
         DC    C'AL',S(AC@QST)       ALBERTA                                    
         DC    C'SA',S(AC@QST)       SASKATCHEWAN                               
         DC    C'MA',S(AC@QST)       MANITOBA                                   
         DC    C'PQ',S(AC@QST)       QUEBEC                                     
         DC    C'ON',S(AC@ONT)       ONTARIO                                    
         DC    C'PE',S(AC@PST)       PRINCE EDWARD ISLAND                       
         DC    C'NB',S(AC@HST)       NEW BRUNSWICK                              
         DC    C'NS',S(AC@HST)       NOVA SCOTIA                                
         DC    C'NF',S(AC@HST)       NEWFOUNDLAND                               
         DC    X'FF'                 END OF TABLE                               
