*          DATA SET ACPROE3D   AT LEVEL 004 AS OF 11/04/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BE3D      DATE 11/04/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P N             T        Y              
PROCLIH  DS    XL8                                                              
PROCLI   DS    CL8      5   10    8  A  U N             T    I   Y   16         
PROCLIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   20    7  A  P N             T        Y              
PROPROH  DS    XL8                                                              
PROPRO   DS    CL8      5   28    8  A  U N             T        Y   18         
PROPROX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   38    5  A  P N             T        Y              
PROSTAH  DS    XL8                                                              
PROSTA   DS    CL6      5   46    6  A  U N             T        Y   34         
PROSTAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   56    5  A  P N             T        Y              
PROMEDH  DS    XL8                                                              
PROMED   DS    CL1      5   64    1  A  U N             T        Y    8         
PROMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
PROOFFH  DS    XL8                                                              
PROOFF   DS    CL2      6   10    2  A  U N             T        Y    4         
PROOFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2      6   15    2  A  P N             T        Y              
PROFILTH DS    XL8                                                              
PROFILT  DS    CL2      6   18    2  A  U N             T        Y   50         
PROFILTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2      6   21    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      6   24    2  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2      6   27    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      6   30    2  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2      6   33    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      6   36    2  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2      6   39    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2      6   42    2  A  U N             T        Y   50         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   52    6  A  P N             T        Y              
PROSTATH DS    XL8                                                              
PROSTAT  DS    CL20     6   60   20  A  U N             T        Y   52         
PROSTATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
PROOPTH  DS    XL8                                                              
PROOPT   DS    CL17     7   10   17  A  U N             T        Y   54         
PROOPTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      7   29    4  A  P N             T        Y              
PROUSERH DS    XL8                                                              
PROUSER  DS    CL3      7   34    3  A  U N             T        Y   38         
PROUSERX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      7   45    5  A  P N             T        Y              
PRODTYPH DS    XL8                                                              
PRODTYP  DS    CL1      7   51    1  A  U N             T        Y   20         
PRODTYPX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      7   54    4  A  P N             T        Y              
PRODATEH DS    XL8                                                              
PRODATE  DS    CL17     7   59   17  A  U N             T        Y   20         
PRODATEX DS    XL8                                                              
PROTITH  DS    XL8                                                              
PROTIT   DS    CL79     8    2   79  A  P H             T        Y              
PROTAGH  DS    XL8                                                              
PROTAG   DS    CL1      9    2    1  A  P N             T        Y              
PROLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 624  BYTES                            
