*          DATA SET ACPROC5D   AT LEVEL 005 AS OF 09/12/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BC5D      DATE 09/12/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL10     6    2   10  A   P    H         T        Y              
CPYFROMH DS    CL8                                                              
CPYFROM  DS    CL4      6   20    4  A   U    N         T    I   Y   50         
CPYFROMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     7    2   10  A   P    H         T        Y              
CPYTOH   DS    CL8                                                              
CPYTO    DS    CL4      7   20    4  A   U    N         T        Y   52         
CPYTOX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      8    2    1  A   P    N         T        Y              
CPYLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CPYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 88   BYTES                            
