*          DATA SET ACPROB0D   AT LEVEL 007 AS OF 04/24/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BB0D      DATE 04/24/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
SCHSTRTH DS    XL8                                                              
SCHSTRT  DS    CL8      5   10    8  A  U N             T    I   Y   34         
SCHSTRTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL22     7    2   22  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      7   44    5  A  P N             T        Y              
SCHSEL1H DS    XL8                                                              
SCHSEL1  DS    CL1      8    2    1  A  U N             T        Y   32         
SCHSEL1X DS    XL8                                                              
SCHCODEH DS    XL8                                                              
SCHCODE  DS    CL8      8   10    8  A  P N             T        Y              
SCHNAMH  DS    XL8                                                              
SCHNAM   DS    CL20     8   20   20  A  P N             T        Y              
SCHBOEH  DS    XL8                                                              
SCHBOE   DS    CL4      8   44    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      9    2    1  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      9   10    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20     9   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      9   44    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     10    2    1  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     10   10    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    10   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     10   44    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     11    2    1  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     11   10    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    11   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     11   44    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     12    2    1  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     12   10    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    12   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     12   44    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13    2    1  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     13   10    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    13   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     13   44    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14    2    1  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     14   10    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    14   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     14   44    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15    2    1  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     15   10    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    15   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     15   44    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16    2    1  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     16   10    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    16   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     16   44    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17    2    1  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     17   10    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    17   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     17   44    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18    2    1  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     18   10    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    18   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     18   44    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19    2    1  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     19   10    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    19   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     19   44    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20    2    1  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     20   10    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    20   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     20   44    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21    2    1  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     21   10    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    21   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     21   44    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22    2    1  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     22   10    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    22   20   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4     22   44    4  A  P N             T        Y              
SCHPFH   DS    XL8                                                              
SCHPF    DS    CL78    24    2   78  A  P H             T        Y              
SCHLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
SCHWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1264 BYTES                            
