*          DATA SET ACPRFFFD   AT LEVEL 003 AS OF 01/02/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T630FFD      DATE 01/02/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
PRFHEADH DS    XL8                                                              
PRFHEAD  DS    CL60     1    2   60  L  P N             T        Y              
PRFSERVH DS    XL8                                                              
PRFSERV  DS    CL17     1   63   17  A  U N             T        Y              
PRFINPH  DS    XL8                                                              
PRFINP   DS    CL79     2    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79     3    2   79  A  U N             T        Y              
PRFFLNKH DS    XL8                                                              
PRFFLNK  DS    CL79     4    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79     5    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79     6    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79     7    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79     8    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79     9    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    10    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    11    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    12    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    13    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    14    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    15    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    16    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    17    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    18    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    19    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    20    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    21    2   79  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL79    22    2   79  A  U N             T        Y              
PRFTAGH  DS    XL8                                                              
PRFTAG   DS    CL1     23    2    1  A  P N             T        Y              
PRFLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PRFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1936 BYTES                            
