*          DATA SET ACPROF8D   AT LEVEL 002 AS OF 01/15/04                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BF8D      DATE 01/15/04                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL11     6    2   11  A  P H             T        Y              
PROMEDH  DS    XL8                                                              
PROMED   DS    CL2      6   20    2  A  U H             T    I   Y    8         
PROMEDX  DS    XL8                                                              
PROLACTH DS    XL8                                                              
PROLACT  DS    CL40     6   38   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     8    2   11  A  P H             T        Y   50         
         DS    XL8                                                              
PRODESCH DS    XL8                                                              
PRODESC  DS    CL12     8   20   12  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12     9    2   12  A  P N             T        Y              
PROMGRH  DS    XL8                                                              
PROMGR   DS    CL2      9   20    2  A  U N             T        Y    6         
PROMGRX  DS    XL8                                                              
PROMGRNH DS    XL8                                                              
PROMGRN  DS    CL36     9   38   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15    10    2   15  A  P H             T        Y              
PROCOMH  DS    XL8                                                              
PROCOM   DS    CL14    10   20   14  A  U H             T        Y   54         
PROCOMX  DS    XL8                                                              
PROCOMNH DS    XL8                                                              
PROCOMN  DS    CL36    10   38   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15    11    2   15  A  P N             T        Y              
PROCSDH  DS    XL8                                                              
PROCSD   DS    CL14    11   20   14  A  U N             T        Y   66         
PROCSDX  DS    XL8                                                              
PROCSDNH DS    XL8                                                              
PROCSDN  DS    CL36    11   38   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    12    2   16  A  P N             T        Y              
PROPCDH  DS    XL8                                                              
PROPCD   DS    CL14    12   20   14  A  U N             T        Y   68         
PROPCDX  DS    XL8                                                              
PROPCDNH DS    XL8                                                              
PROPCDN  DS    CL36    12   38   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    13    2   16  A  P N             T        Y              
PROTWOH  DS    XL8                                                              
PROTWO   DS    CL14    13   20   14  A  U N             T        Y   70         
PROTWOX  DS    XL8                                                              
PROTWONH DS    XL8                                                              
PROTWON  DS    CL36    13   38   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL16    14    2   16  A  P N             T        Y              
PROTINH  DS    XL8                                                              
PROTIN   DS    CL14    14   20   14  A  U N             T        Y   54         
PROTINX  DS    XL8                                                              
PROTINNH DS    XL8                                                              
PROTINN  DS    CL36    14   38   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL15    15    2   15  A  P N             T        Y              
PROANALH DS    XL8                                                              
PROANAL  DS    CL12    15   20   12  A  U N             T        Y   56         
PROANALX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    16    2   15  A  P H             T        Y              
PRONEXTH DS    XL8                                                              
PRONEXT  DS    CL6     16   20    6  A  U H             T        Y   58         
PRONEXTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    17    2   15  A  P H             T        Y              
PRORESH  DS    XL8                                                              
PRORES   DS    CL4     17   20    4  A  U H             T        Y   60         
PRORESX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    18    2   17  A  P N             T        Y              
PROTITH  DS    XL8                                                              
PROTIT   DS    CL1     18   20    1  A  U N             T        Y   62         
PROTITX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    19    2   17  A  P N             T        Y              
PROTMEH  DS    XL8                                                              
PROTME   DS    CL1     19   20    1  A  U N             T        Y   74         
PROTMEX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    20    2   15  A  P N             T        Y              
PROENAMH DS    XL8                                                              
PROENAM  DS    CL36    20   20   36  A  U N             T        Y   64         
PROENAMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     21    2    1  A  P N             T        Y              
PROLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1024 BYTES                            
