*          DATA SET ACPROCBD   AT LEVEL 013 AS OF 07/21/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BCBD      DATE 07/21/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A   P    N         T        Y              
SLSCLIH  DS    CL8                                                              
SLSCLI   DS    CL6      5   10    6  A   U    N         T    I   Y   16         
SLSCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   20    7  A   P    N         T        Y              
SLSPROH  DS    CL8                                                              
SLSPRO   DS    CL6      5   28    6  A   U    N         T        Y   18         
SLSPROX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      5   38    3  A   P    N         T        Y              
SLSJOBH  DS    CL8                                                              
SLSJOB   DS    CL6      5   42    6  A   U    N         T        Y   20         
SLSJOBX  DS    CL8                                                              
SLSJNMH  DS    CL8                                                              
SLSJNM   DS    CL29     5   51   29  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      6    2    5  A   P    N         T        Y              
SLSMEDH  DS    CL8                                                              
SLSMED   DS    CL1      6   10    1  A   U    N         T        Y              
SLSMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   20    7  A   P    N         T        Y              
SLSFLTH  DS    CL8                                                              
SLSFLT   DS    CL4      6   28    4  A   U    N         T        Y              
SLSFLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      6   38    6  A   P    N         T        Y              
SLSUSEH  DS    CL8                                                              
SLSUSE   DS    CL8      6   45    8  A   U    N         T        Y              
SLSUSEX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   55    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL56     7    2   56  A   P    H         T        Y              
SLSSEL1H DS    CL8                                                              
SLSSEL1  DS    CL3      8    2    3  A   U    N         T        Y   32         
SLSSEL1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74     8    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   U    N         T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74     9    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    10    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    11    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    12    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    13    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    14    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    15    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    16    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    17    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    18    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    19    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    20    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    21    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    22    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y   32         
         DS    CL8                                                              
SLSDATXH DS    CL8                                                              
SLSDATX  DS    CL74    23    7   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL45    24    2   45  A   P    H         T        Y              
SLSLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SLSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1992 BYTES                            
