*          DATA SET ACPROFDD   AT LEVEL 002 AS OF 10/03/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BFDD      DATE 10/03/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL17     6    2   17  A   P    H         T        Y              
PROWGRH  DS    CL8                                                              
PROWGR   DS    CL2      6   20    2  A   U    N         T    I   Y   10         
PROWGRX  DS    CL8                                                              
PROLACTH DS    CL8                                                              
PROLACT  DS    CL40     6   38   40  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      7    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17     8    2   17  A   P    H         T        Y              
PROWGRNH DS    CL8                                                              
PROWGRN  DS    CL36     8   20   36  A   U    N         T        Y   50         
PROWGRNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      9    2    1  A   P    N         T        Y              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 192  BYTES                            
