*          DATA SET ACPRVTABN  AT LEVEL 007 AS OF 04/29/10                      
* THIS MODULE IS INCLUDED IN THE FOLLOWING PROGRAMS::                           
* ACBAT41, ACBAT48, ACENQ01, ACENQ02, ACENQ06, ACLFM03 AND ACVATICAN            
*                                                                               
         DS    0F                                                               
PRVTAB   DS    0CL4                                                             
         DC    C'BC',S(AC@HBC)       BRITISH COLUMBIA                           
         DC    C'AL',S(AC@HAL)       ALBERTA                                    
         DC    C'SA',S(AC@HSA)       SASKATCHEWAN                               
         DC    C'MA',S(AC@HMA)       MANITOBA                                   
         DC    C'PQ',S(AC@HPQ)       QUEBEC                                     
         DC    C'ON',S(AC@HON)       ONTARIO                                    
         DC    C'PE',S(AC@HPE)       PRINCE EDWARD ISLAND                       
         DC    C'NB',S(AC@HNB)       NEW BRUNSWICK                              
         DC    C'NS',S(AC@HNS)       NOVA SCOTIA                                
         DC    C'NF',S(AC@HNF)       NEWFOUNDLAND                               
         DC    X'FF'                 END OF TABLE                               
