*          DATA SET ACPROA1D   AT LEVEL 001 AS OF 08/28/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BA1D      DATE 08/28/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      4    2    6  L  P N             T        Y              
JCMCLIH  DS    CL8                                                              
JCMCLI   DS    CL6      4   10    6  A  U N             T    I   Y   16         
JCMCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      4   20    7  L  P N             T        Y              
JCMPROH  DS    CL8                                                              
JCMPRO   DS    CL6      4   28    6  A  U N             T        Y   18         
JCMPROX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      4   38    3  L  P N             T        Y              
JCMJOBH  DS    CL8                                                              
JCMJOB   DS    CL6      4   42    6  A  U N             T        Y   20         
JCMJOBX  DS    CL8                                                              
JCMJNMH  DS    CL8                                                              
JCMJNM   DS    CL30     4   49   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      5    2    7  L  P N             T        Y              
JCMCOLH  DS    CL8                                                              
JCMCOL   DS    CL25     5   10   25  A  U N             T        Y   52         
JCMCOLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   38    7  L  P N             T        Y              
JCMOPTH  DS    CL8                                                              
JCMOPT   DS    CL33     5   46   33  A  U N             T        Y   50         
JCMOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6    2    7  L  P N             T        Y              
JCMCOMH  DS    CL8                                                              
JCMCOM   DS    CL56     6   10   56  A  U N             T        Y   54         
JCMCOMX  DS    CL8                                                              
JCMNOTEH DS    CL8                                                              
JCMNOTE  DS    CL78     7    2   78  A  P N             T        Y              
JCMTITH  DS    CL8                                                              
JCMTIT   DS    CL8      8    2    8  A  L P             T        Y              
JCMTAGH  DS    CL8                                                              
JCMTAG   DS    CL1      8   21    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P H             T        Y              
JCMLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
JCMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 552  BYTES                            
