*          DATA SET ACPROA6D   AT LEVEL 001 AS OF 08/28/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BA6D      DATE 08/28/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      5    2    9  L  P H             T        Y              
SBWWRKH  DS    CL8                                                              
SBWWRK   DS    CL2      5   20    2  A  U H             T    I   Y   12         
SBWWRKX  DS    CL8                                                              
SBWLANHH DS    CL8                                                              
SBWLANH  DS    CL8      5   38    8  L  P H             T        Y              
SBWLANGH DS    CL8                                                              
SBWLANG  DS    CL3      5   48    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL11     6    2   11  L  P H             T        Y              
SBWDESCH DS    CL8                                                              
SBWDESC  DS    CL15     6   20   15  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL80     8    2   80  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL2      9    4    2  A  P H             T        Y              
SBWSUB1H DS    CL8                                                              
SBWSUB1  DS    CL30     9    7   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2      9   44    2  A  P H             T        Y              
SBWSUB2H DS    CL8                                                              
SBWSUB2  DS    CL30     9   47   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     10    4    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    10    7   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     10   44    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    10   47   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     11    4    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    11    7   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   44    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    11   47   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     12    4    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    12    7   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   44    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    12   47   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     13    4    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    13    7   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   44    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    13   47   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14    4    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    14    7   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   44    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    14   47   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15    4    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    15    7   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   44    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    15   47   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16    4    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    16    7   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   44    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    16   47   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17    4    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    17    7   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   44    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    17   47   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18    4    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    18    7   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   44    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    18   47   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19    4    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    19    7   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   44    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    19   47   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20    4    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    20    7   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   44    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    20   47   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21    4    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    21    7   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   44    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    21   47   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22    4    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    22    7   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   44    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    22   47   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     23    4    2  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL30    23    7   30  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     23   44    2  A  P H             T        Y              
SBWSUBLH DS    CL8                                                              
SBWSUBL  DS    CL30    23   47   30  L  U N             T        Y              
SBWPFAH  DS    CL8                                                              
SBWPFA   DS    CL78    24    2   78  A  P H             T        Y              
SBWLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SBWWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1736 BYTES                            
