*          DATA SET ACPROABD   AT LEVEL 003 AS OF 01/04/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BABD      DATE 01/04/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL14     5    2   14  L  P H             T        Y              
PROARTCH DS    XL8                                                              
PROARTC  DS    CL4      5   17    4  A  U N             T    I   Y    1         
PROARTCX DS    XL8                                                              
PROASEQH DS    XL8                                                              
PROASEQ  DS    CL6      5   24    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17     5   32   17  L  P N             T        Y              
PROLACTH DS    XL8                                                              
PROLACT  DS    CL20     5   51   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14     6    2   14  L  P N             T        Y              
PROOFFCH DS    XL8                                                              
PROOFFC  DS    CL2      6   17    2  A  U N             T        Y    2         
PROOFFCX DS    XL8                                                              
PROOFFNH DS    XL8                                                              
PROOFFN  DS    CL36     6   32   36  A  P N             T        Y              
PRODADRH DS    XL8                                                              
PRODADR  DS    CL8      6   69    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14     7    2   14  L  P N             T        Y              
PROCLICH DS    XL8                                                              
PROCLIC  DS    CL5      7   17    5  A  U N             T        Y    3         
PROCLICX DS    XL8                                                              
PROCLINH DS    XL8                                                              
PROCLIN  DS    CL36     7   32   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      7   69    9  L  P N             T        Y              
PROISTIH DS    XL8                                                              
PROISTI  DS    CL1      7   79    1  A  U N             T        Y   25         
PROISTIX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14     8    2   14  L  P N             T        Y              
PROSUPCH DS    XL8                                                              
PROSUPC  DS    CL14     8   17   14  A  U N             T        Y    4         
PROSUPCX DS    XL8                                                              
PROSUPNH DS    XL8                                                              
PROSUPN  DS    CL36     8   32   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     9    2   11  L  P N             T        Y              
PROWRKCH DS    XL8                                                              
PROWRKC  DS    CL2      9   17    2  A  U N             T        Y    5         
PROWRKCX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     9   23   11  L  P N             T        Y              
PROFLTCH DS    XL8                                                              
PROFLTC  DS    CL1      9   35    1  A  U N             T        Y    6         
PROFLTCX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      9   69    9  L  P N             T        Y              
PROLOCKH DS    XL8                                                              
PROLOCK  DS    CL1      9   79    1  A  U N             T        Y    8         
PROLOCKX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    10    2   11  L  P N             T        Y              
PROPFLXH DS    XL8                                                              
PROPFLX  DS    CL1     10   17    1  A  U N             T        Y   20         
PROPFLXX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    10   23   11  L  P N             T        Y              
PRONOPRH DS    XL8                                                              
PRONOPR  DS    CL1     10   35    1  A  U N             T        Y   21         
PRONOPRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    10   43   11  L  P N             T        Y              
PRODSCOH DS    XL8                                                              
PRODSCO  DS    CL1     10   57    1  A  U N             T        Y   22         
PRODSCOX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     12    2    8  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    12   12   12  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   28    8  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    12   38   12  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   54    8  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    12   64   12  L  P N             T        Y              
PRODAT1H DS    XL8                                                              
PRODAT1  DS    CL8     13    2    8  A  U N             T        Y    9         
PRODAT1X DS    XL8                                                              
PROPRI1H DS    XL8                                                              
PROPRI1  DS    CL12    13   12   12  A  U N             T        Y   10         
PROPRI1X DS    XL8                                                              
PRODAT2H DS    XL8                                                              
PRODAT2  DS    CL8     13   28    8  A  U N             T        Y    9         
PRODAT2X DS    XL8                                                              
PROPRI2H DS    XL8                                                              
PROPRI2  DS    CL12    13   38   12  A  U N             T        Y   10         
PROPRI2X DS    XL8                                                              
PRODAT3H DS    XL8                                                              
PRODAT3  DS    CL8     13   54    8  A  U N             T        Y    9         
PRODAT3X DS    XL8                                                              
PROPRI3H DS    XL8                                                              
PROPRI3  DS    CL12    13   64   12  A  U N             T        Y   10         
PROPRI3X DS    XL8                                                              
PRODAT4H DS    XL8                                                              
PRODAT4  DS    CL8     14    2    8  A  U N             T        Y    9         
PRODAT4X DS    XL8                                                              
PROPRI4H DS    XL8                                                              
PROPRI4  DS    CL12    14   12   12  A  U N             T        Y   10         
PROPRI4X DS    XL8                                                              
PRODAT5H DS    XL8                                                              
PRODAT5  DS    CL8     14   28    8  A  U N             T        Y    9         
PRODAT5X DS    XL8                                                              
PROPRI5H DS    XL8                                                              
PROPRI5  DS    CL12    14   38   12  A  U N             T        Y   10         
PROPRI5X DS    XL8                                                              
PRODAT6H DS    XL8                                                              
PRODAT6  DS    CL8     14   54    8  A  U N             T        Y    9         
PRODAT6X DS    XL8                                                              
PROPRI6H DS    XL8                                                              
PROPRI6  DS    CL12    14   64   12  A  U N             T        Y   10         
PROPRI6X DS    XL8                                                              
PRODAT7H DS    XL8                                                              
PRODAT7  DS    CL8     15    2    8  A  U N             T        Y    9         
PRODAT7X DS    XL8                                                              
PROPRI7H DS    XL8                                                              
PROPRI7  DS    CL12    15   12   12  A  U N             T        Y   10         
PROPRI7X DS    XL8                                                              
PRODAT8H DS    XL8                                                              
PRODAT8  DS    CL8     15   28    8  A  U N             T        Y    9         
PRODAT8X DS    XL8                                                              
PROPRI8H DS    XL8                                                              
PROPRI8  DS    CL12    15   38   12  A  U N             T        Y   10         
PROPRI8X DS    XL8                                                              
PRODAT9H DS    XL8                                                              
PRODAT9  DS    CL8     15   54    8  A  U N             T        Y    9         
PRODAT9X DS    XL8                                                              
PROPRI9H DS    XL8                                                              
PROPRI9  DS    CL12    15   64   12  A  U N             T        Y   10         
PROPRI9X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    16    2   12  L  P N             T        Y              
PRODESCH DS    XL8                                                              
PRODESC  DS    CL36    16   17   36  L  U N             T        Y   11         
PRODESCX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14    17    2   14  L  P N             T        Y              
PROTEXTH DS    XL8                                                              
PROTEXT  DS    CL60    17   17   60  L  U N             T        N   12         
PROTEXTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    18   17   60  L  U N             T        N   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL60    19   17   60  L  U N             T        N   12         
         DS    XL8                                                              
PROLFLDH DS    XL8                                                              
PROLFLD  DS    CL1     20    2    1  A  U N             T        Y              
PROLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1560 BYTES                            
