*          DATA SET ACPROB6D   AT LEVEL 002 AS OF 08/22/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BB6D      DATE 08/22/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
FNDOGRH  DS    XL8                                                              
FNDOGR   DS    CL1      6   10    1  A  U N             T    I   Y    2         
FNDOGRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
FNDOFCH  DS    XL8                                                              
FNDOFC   DS    CL2      6   28    2  A  U N             T        Y    4         
FNDOFCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   38    6  A  P N             T        Y              
FNDCLIH  DS    XL8                                                              
FNDCLI   DS    CL6      6   46    6  A  U N             T        Y   16         
FNDCLIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   56    7  A  P N             T        Y              
FNDPROH  DS    XL8                                                              
FNDPRO   DS    CL6      6   64    6  A  U N             T        Y   18         
FNDPROX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
FNDMGRH  DS    XL8                                                              
FNDMGR   DS    CL1      7   10    1  A  U N             T        Y    6         
FNDMGRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7   20    7  A  P N             T        Y              
FNDMEDH  DS    XL8                                                              
FNDMED   DS    CL1      7   28    1  A  U N             T        Y    8         
FNDMEDX  DS    XL8                                                              
FNDLACTH DS    XL8                                                              
FNDLACT  DS    CL40     7   38   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20     9    2   20  A  P H             T        Y              
FNDNUMH  DS    XL8                                                              
FNDNUM   DS    CL19     9   24   19  A  U N             T        Y   10         
FNDNUMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      9   45    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    10    2   11  A  P N             T        Y              
FNDAUTDH DS    XL8                                                              
FNDAUTD  DS    CL36    10   14   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL26    12    2   26  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL19    12   59   19  A  P N             T        Y              
FNDSEL1H DS    XL8                                                              
FNDSEL1  DS    CL2     13    2    2  A  U N             T        Y   12         
FNDSEL1X DS    XL8                                                              
FNDACCTH DS    XL8                                                              
FNDACCT  DS    CL12    13    6   12  A  U N             T        Y              
FNDNAMEH DS    XL8                                                              
FNDNAME  DS    CL36    13   19   36  L  P N             T        Y   52         
FNDNAMEX DS    XL8                                                              
FNDAMNTH DS    XL8                                                              
FNDAMNT  DS    CL12    13   60   12  A  P N             T        Y    0         
FNDAMNTX DS    XL8                                                              
FNDEST#H DS    XL8                                                              
FNDEST#  DS    CL3     13   74    3  A  P N             T        Y    0         
FNDEST#X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     14    2    2  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    14    6   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL36    14   19   36  L  P N             T        Y   52         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    14   60   12  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     14   74    3  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     15    2    2  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    15    6   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL36    15   19   36  L  P N             T        Y   52         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    15   60   12  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15   74    3  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    16    6   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL36    16   19   36  L  P N             T        Y   52         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    16   60   12  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     16   74    3  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     17    2    2  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    17    6   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL36    17   19   36  L  P N             T        Y   52         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    17   60   12  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17   74    3  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     18    2    2  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    18    6   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL36    18   19   36  L  P N             T        Y   52         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    18   60   12  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18   74    3  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     19    2    2  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    19    6   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL36    19   19   36  L  P N             T        Y   52         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    19   60   12  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19   74    3  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     20    2    2  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    20    6   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL36    20   19   36  L  P N             T        Y   52         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    20   60   12  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20   74    3  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     21    2    2  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    21    6   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL36    21   19   36  L  P N             T        Y   52         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    21   60   12  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21   74    3  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     22    2    2  A  U N             T        Y   32         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    22    6   12  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL36    22   19   36  L  P N             T        Y   52         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    22   60   12  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     22   74    3  A  P N             T        Y    0         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    23    2   17  A  P H             T        Y              
FNDTAUTH DS    XL8                                                              
FNDTAUT  DS    CL12    23   20   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     23   33    6  A  P H             T        Y              
FNDTFUNH DS    XL8                                                              
FNDTFUN  DS    CL12    23   40   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9     23   53    9  A  P H             T        Y              
FNDTAVAH DS    XL8                                                              
FNDTAVA  DS    CL12    23   63   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL19    24    2   19  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL55    24   25   55  A  P H             T        Y              
FNDLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
FNDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2032 BYTES                            
