*          DATA SET ACPROD1D   AT LEVEL 002 AS OF 09/15/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BD1D      DATE 09/15/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
PROOGRH  DS    CL8                                                              
PROOGR   DS    CL1      6   12    1  A   U    N         T    I   Y    8         
PROOGRX  DS    CL8                                                              
PROOGRNH DS    CL8                                                              
PROOGRN  DS    CL36     6   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
PROOFFH  DS    CL8                                                              
PROOFF   DS    CL3      7   12    3  A   U    N         T        Y    8         
PROOFFX  DS    CL8                                                              
PROOFFNH DS    CL8                                                              
PROOFFN  DS    CL36     7   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
PROCLIH  DS    CL8                                                              
PROCLI   DS    CL3      8   12    3  A   U    N         T        Y   10         
PROCLIX  DS    CL8                                                              
PROCLINH DS    CL8                                                              
PROCLIN  DS    CL36     8   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    N         T        Y              
PROPROH  DS    CL8                                                              
PROPRO   DS    CL3      9   12    3  A   U    N         T        Y   12         
PROPROX  DS    CL8                                                              
PROPRONH DS    CL8                                                              
PROPRON  DS    CL36     9   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    N         T        Y              
PROJOBH  DS    CL8                                                              
PROJOB   DS    CL6     10   12    6  A   U    N         T        Y   14         
PROJOBX  DS    CL8                                                              
PROJOBNH DS    CL8                                                              
PROJOBN  DS    CL36    10   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A   P    N         T        Y              
PROMGRH  DS    CL8                                                              
PROMGR   DS    CL1     11   12    1  A   U    N         T        Y              
PROMGRNH DS    CL8                                                              
PROMGRN  DS    CL36    11   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5     12    2    5  A   P    N         T        Y              
PROMEDH  DS    CL8                                                              
PROMED   DS    CL1     12   12    1  A   U    N         T        Y              
PROMEDNH DS    CL8                                                              
PROMEDN  DS    CL36    12   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2     13    2    2  A   P    N         T        Y              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 544  BYTES                            
