*          DATA SET ACPROC9D   AT LEVEL 015 AS OF 04/02/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BC9D      DATE 04/02/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T    I   N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL40     5   28   40  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   69    6  A  P N             T        Y              
ESTPFILH DS    CL8                                                              
ESTPFIL  DS    CL4      5   76    4  A  U N             T        Y   60         
ESTPFILX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6    2    4  A  P N             T        Y              
ESTTYPEH DS    CL8                                                              
ESTTYPE  DS    CL1      6   12    1  A  U N             T        Y    2         
ESTTYPEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
ESTOGH   DS    CL8                                                              
ESTOG    DS    CL3      7   12    3  A  U H             T        Y    4         
ESTOGX   DS    CL8                                                              
ESTOGNH  DS    CL8                                                              
ESTOGN   DS    CL20     7   20   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      7   46    6  A  P N             T        Y              
ESTOFFH  DS    CL8                                                              
ESTOFF   DS    CL2      7   54    2  A  U H             T        Y    6         
ESTOFFX  DS    CL8                                                              
ESTOFFNH DS    CL8                                                              
ESTOFFN  DS    CL20     7   58   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8    2    6  A  P N             T        Y              
ESTCLIH  DS    CL8                                                              
ESTCLI   DS    CL6      8   12    6  A  U H             T        Y    8         
ESTCLIX  DS    CL8                                                              
ESTCLINH DS    CL8                                                              
ESTCLIN  DS    CL20     8   20   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
ESTPROH  DS    CL8                                                              
ESTPRO   DS    CL6      9   12    6  A  U H             T        Y   10         
ESTPROX  DS    CL8                                                              
ESTPRONH DS    CL8                                                              
ESTPRON  DS    CL20     9   20   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  P N             T        Y              
ESTJOBH  DS    CL8                                                              
ESTJOB   DS    CL6     10   12    6  A  U H             T        Y   12         
ESTJOBX  DS    CL8                                                              
ESTJOBNH DS    CL8                                                              
ESTJOBN  DS    CL20    10   20   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
ESTMGRH  DS    CL8                                                              
ESTMGR   DS    CL1     11   12    1  A  U H             T        Y   14         
ESTMGRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     11   28    5  A  P N             T        Y              
ESTMEDH  DS    CL8                                                              
ESTMED   DS    CL1     11   37    1  A  U H             T        Y   16         
ESTMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
ESTBGRH  DS    CL8                                                              
ESTBGR   DS    CL4     12   12    4  A  U H             T        Y   18         
ESTBGRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     12   28    8  A  P N             T        Y              
ESTBTYPH DS    CL8                                                              
ESTBTYP  DS    CL20    12   37   20  A  U H             T        Y   20         
ESTBTYPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     13    2    8  A  P N             T        Y              
ESTFIL1H DS    CL8                                                              
ESTFIL1  DS    CL4     13   12    4  A  U H             T        Y   21         
ESTFIL1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     13   28    6  A  P N             T        Y              
ESTFIL2H DS    CL8                                                              
ESTFIL2  DS    CL2     13   37    2  A  U H             T        Y   22         
ESTFIL2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     13   47    6  A  P N             T        Y              
ESTFIL3H DS    CL8                                                              
ESTFIL3  DS    CL2     13   56    2  A  U H             T        Y   23         
ESTFIL3X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14    2    6  A  P N             T        Y              
ESTFIL4H DS    CL8                                                              
ESTFIL4  DS    CL4     14   12    4  A  U H             T        Y   24         
ESTFIL4X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14   28    6  A  P N             T        Y              
ESTFIL5H DS    CL8                                                              
ESTFIL5  DS    CL2     14   37    2  A  U H             T        Y   25         
ESTFIL5X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     15    2    8  A  P N             T        Y              
ESTSTH   DS    CL8                                                              
ESTST    DS    CL8     15   12    8  A  U H             T        Y   26         
ESTSTX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     15   28    8  A  P N             T        Y              
ESTENDH  DS    CL8                                                              
ESTEND   DS    CL8     15   37    8  A  U H             T        Y   28         
ESTENDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    15   47   12  A  P N             T        Y              
ESTCLOSH DS    CL8                                                              
ESTCLOS  DS    CL1     15   61    1  A  U H             T        Y   30         
ESTCLOSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    15   64   12  A  P N             T        Y              
ESTLOCKH DS    CL8                                                              
ESTLOCK  DS    CL1     15   78    1  A  U H             T        Y   32         
ESTLOCKX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     16    2    7  A  P N             T        Y              
ESTOPT1H DS    CL8                                                              
ESTOPT1  DS    CL60    16   12   60  A  U H             T        Y   34         
ESTOPT1X DS    CL8                                                              
ESTOPT2H DS    CL8                                                              
ESTOPT2  DS    CL60    17   12   60  A  U H             T        Y   34         
ESTOPT2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     18    2    4  A  P N             T        Y              
ESTCOL1H DS    CL8                                                              
ESTCOL1  DS    CL35    18    7   35  A  U H             T        Y   40         
ESTCOL1X DS    CL8                                                              
ESTCOL2H DS    CL8                                                              
ESTCOL2  DS    CL35    18   44   35  A  U H             T        Y   40         
ESTCOL2X DS    CL8                                                              
ESTCOL3H DS    CL8                                                              
ESTCOL3  DS    CL35    19    7   35  A  U H             T        Y   40         
ESTCOL3X DS    CL8                                                              
ESTCOL4H DS    CL8                                                              
ESTCOL4  DS    CL35    19   44   35  A  U H             T        Y   40         
ESTCOL4X DS    CL8                                                              
ESTCOL5H DS    CL8                                                              
ESTCOL5  DS    CL35    20    7   35  A  U H             T        Y   40         
ESTCOL5X DS    CL8                                                              
ESTCOL6H DS    CL8                                                              
ESTCOL6  DS    CL35    20   44   35  A  U H             T        Y   40         
ESTCOL6X DS    CL8                                                              
ESTCOL7H DS    CL8                                                              
ESTCOL7  DS    CL35    21    7   35  A  U H             T        Y   40         
ESTCOL7X DS    CL8                                                              
ESTCOL8H DS    CL8                                                              
ESTCOL8  DS    CL35    21   44   35  A  U H             T        Y   40         
ESTCOL8X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     22    2    7  A  P N             T        Y              
ESTDET1H DS    CL8                                                              
ESTDET1  DS    CL60    22   12   60  A  U H             T        Y   50         
ESTDET1X DS    CL8                                                              
ESTDET2H DS    CL8                                                              
ESTDET2  DS    CL60    23   12   60  A  U H             T        Y   50         
ESTDET2X DS    CL8                                                              
ESTPFH   DS    CL8                                                              
ESTPF    DS    CL78    24    2   78  A  P N             T        Y              
ESTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
ESTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1792 BYTES                            
