*          DATA SET ACPROC6D   AT LEVEL 014 AS OF 10/09/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BC6D      DATE 10/09/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
PROPANH  DS    CL8                                                              
PROPAN   DS    CL4      5   10    4  A  U N             T        Y   44         
PROPANX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   42    6  A  P N             T        Y              
PROSCRLH DS    CL8                                                              
PROSCRL  DS    CL3      5   51    3  A  U N             T        Y   52         
PROSCRLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
PROCOMH  DS    CL8                                                              
PROCOM   DS    CL60     6   10   60  A  U N             T        Y   50         
PROCOMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL25     7    8   25  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL24     7   42   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL60     8    2   60  A  P N             T        Y              
PROSEL1H DS    CL8                                                              
PROSEL1  DS    CL3      9    2    3  A  U H             T        Y   32         
PROSEL1X DS    CL8                                                              
PROROW1H DS    CL8                                                              
PROROW1  DS    CL2      9    7    2  A  U H             T        Y   74         
PROROW1X DS    CL8                                                              
PROCOL1H DS    CL8                                                              
PROCOL1  DS    CL2      9   12    2  A  U H             T        Y   56         
PROCOL1X DS    CL8                                                              
PROLEN1H DS    CL8                                                              
PROLEN1  DS    CL2      9   17    2  A  U H             T        Y   58         
PROLEN1X DS    CL8                                                              
PROPRT1H DS    CL8                                                              
PROPRT1  DS    CL1      9   21    1  A  U H             T        Y   60         
PROPRT1X DS    CL8                                                              
PROHI1H  DS    CL8                                                              
PROHI1   DS    CL1      9   23    1  A  U H             T        Y   62         
PROHI1X  DS    CL8                                                              
PROUL1H  DS    CL8                                                              
PROUL1   DS    CL1      9   25    1  A  U H             T        Y   72         
PROUL1X  DS    CL8                                                              
PROKEY1H DS    CL8                                                              
PROKEY1  DS    CL4      9   29    4  A  U H             T        Y   66         
PROKEY1X DS    CL8                                                              
PROPLN1H DS    CL8                                                              
PROPLN1  DS    CL2      9   50    2  A  U H             T        Y   68         
PROPLN1X DS    CL8                                                              
PROPCO1H DS    CL8                                                              
PROPCO1  DS    CL3      9   56    3  A  U H             T        Y   70         
PROPCO1X DS    CL8                                                              
PROSPA1H DS    CL8                                                              
PROSPA1  DS    CL78    10    2   78  L  U N             T        Y   76         
PROSPA1X DS    CL8                                                              
PROSPB1H DS    CL8                                                              
PROSPB1  DS    CL78    11    2   78  L  U N             T        Y   76         
PROSPB1X DS    CL8                                                              
PROSEL2H DS    CL8                                                              
PROSEL2  DS    CL3     12    2    3  A  U H             T        Y   32         
PROSEL2X DS    CL8                                                              
PROROW2H DS    CL8                                                              
PROROW2  DS    CL2     12    7    2  A  U H             T        Y   74         
PROROW2X DS    CL8                                                              
PROCOL2H DS    CL8                                                              
PROCOL2  DS    CL2     12   12    2  A  U H             T        Y   56         
PROCOL2X DS    CL8                                                              
PROLEN2H DS    CL8                                                              
PROLEN2  DS    CL2     12   17    2  A  U H             T        Y   58         
PROLEN2X DS    CL8                                                              
PROPRT2H DS    CL8                                                              
PROPRT2  DS    CL1     12   21    1  A  U H             T        Y   60         
PROPRT2X DS    CL8                                                              
PROHI2H  DS    CL8                                                              
PROHI2   DS    CL1     12   23    1  A  U H             T        Y   62         
PROHI2X  DS    CL8                                                              
PROUL2H  DS    CL8                                                              
PROUL2   DS    CL1     12   25    1  A  U H             T        Y   72         
PROUL2X  DS    CL8                                                              
PROKEY2H DS    CL8                                                              
PROKEY2  DS    CL4     12   29    4  A  U H             T        Y   66         
PROKEY2X DS    CL8                                                              
PROPLN2H DS    CL8                                                              
PROPLN2  DS    CL2     12   50    2  A  U H             T        Y   68         
PROPLN2X DS    CL8                                                              
PROPCO2H DS    CL8                                                              
PROPCO2  DS    CL3     12   56    3  A  U H             T        Y   70         
PROPCO2X DS    CL8                                                              
PROSPA2H DS    CL8                                                              
PROSPA2  DS    CL78    13    2   78  L  U N             T        Y   76         
PROSPA2X DS    CL8                                                              
PROSPB2H DS    CL8                                                              
PROSPB2  DS    CL78    14    2   78  L  U N             T        Y   76         
PROSPB2X DS    CL8                                                              
PROSEL3H DS    CL8                                                              
PROSEL3  DS    CL3     15    2    3  A  U H             T        Y   32         
PROSEL3X DS    CL8                                                              
PROROW3H DS    CL8                                                              
PROROW3  DS    CL2     15    7    2  A  U H             T        Y   74         
PROROW3X DS    CL8                                                              
PROCOL3H DS    CL8                                                              
PROCOL3  DS    CL2     15   12    2  A  U H             T        Y   56         
PROCOL3X DS    CL8                                                              
PROLEN3H DS    CL8                                                              
PROLEN3  DS    CL2     15   17    2  A  U H             T        Y   58         
PROLEN3X DS    CL8                                                              
PROPRT3H DS    CL8                                                              
PROPRT3  DS    CL1     15   21    1  A  U H             T        Y   60         
PROPRT3X DS    CL8                                                              
PROHI3H  DS    CL8                                                              
PROHI3   DS    CL1     15   23    1  A  U H             T        Y   62         
PROHI3X  DS    CL8                                                              
PROUL3H  DS    CL8                                                              
PROUL3   DS    CL1     15   25    1  A  U H             T        Y   72         
PROUL3X  DS    CL8                                                              
PROKEY3H DS    CL8                                                              
PROKEY3  DS    CL4     15   29    4  A  U H             T        Y   66         
PROKEY3X DS    CL8                                                              
PROPLN3H DS    CL8                                                              
PROPLN3  DS    CL2     15   50    2  A  U H             T        Y   68         
PROPLN3X DS    CL8                                                              
PROPCO3H DS    CL8                                                              
PROPCO3  DS    CL3     15   56    3  A  U H             T        Y   70         
PROPCO3X DS    CL8                                                              
PROSPA3H DS    CL8                                                              
PROSPA3  DS    CL78    16    2   78  L  U N             T        Y   76         
PROSPA3X DS    CL8                                                              
PROSPB3H DS    CL8                                                              
PROSPB3  DS    CL78    17    2   78  L  U N             T        Y   76         
PROSPB3X DS    CL8                                                              
PROSEL4H DS    CL8                                                              
PROSEL4  DS    CL3     18    2    3  A  U H             T        Y   32         
PROSEL4X DS    CL8                                                              
PROROW4H DS    CL8                                                              
PROROW4  DS    CL2     18    7    2  A  U H             T        Y   74         
PROROW4X DS    CL8                                                              
PROCOL4H DS    CL8                                                              
PROCOL4  DS    CL2     18   12    2  A  U H             T        Y   56         
PROCOL4X DS    CL8                                                              
PROLEN4H DS    CL8                                                              
PROLEN4  DS    CL2     18   17    2  A  U H             T        Y   58         
PROLEN4X DS    CL8                                                              
PROPRT4H DS    CL8                                                              
PROPRT4  DS    CL1     18   21    1  A  U H             T        Y   60         
PROPRT4X DS    CL8                                                              
PROHI4H  DS    CL8                                                              
PROHI4   DS    CL1     18   23    1  A  U H             T        Y   62         
PROHI4X  DS    CL8                                                              
PROUL4H  DS    CL8                                                              
PROUL4   DS    CL1     18   25    1  A  U H             T        Y   72         
PROUL4X  DS    CL8                                                              
PROKEY4H DS    CL8                                                              
PROKEY4  DS    CL4     18   29    4  A  U H             T        Y   66         
PROKEY4X DS    CL8                                                              
PROPLN4H DS    CL8                                                              
PROPLN4  DS    CL2     18   50    2  A  U H             T        Y   68         
PROPLN4X DS    CL8                                                              
PROPCO4H DS    CL8                                                              
PROPCO4  DS    CL3     18   56    3  A  U H             T        Y   70         
PROPCO4X DS    CL8                                                              
PROSPA4H DS    CL8                                                              
PROSPA4  DS    CL78    19    2   78  L  U N             T        Y   76         
PROSPA4X DS    CL8                                                              
PROSPB4H DS    CL8                                                              
PROSPB4  DS    CL78    20    2   78  L  U N             T        Y   76         
PROSPB4X DS    CL8                                                              
PROPFH   DS    CL8                                                              
PROPF    DS    CL78    23    2   78  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P H             T        Y              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=NN                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1944 BYTES                            
