*          DATA SET ACPROCED   AT LEVEL 001 AS OF 07/05/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BCED      DATE 07/05/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
PRCOFGH  DS    CL8                                                              
PRCOFG   DS    CL1      6   11    1  A  U N             T    I   Y    2         
PRCOFGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      6   15    6  A  P N             T        Y              
PRCOFFH  DS    CL8                                                              
PRCOFF   DS    CL2      6   23    2  A  U N             T        Y    4         
PRCOFFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      6   27    6  A  P N             T        Y              
PRCCLIH  DS    CL8                                                              
PRCCLI   DS    CL6      6   35    6  A  U N             T        Y   16         
PRCCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   44    7  A  P N             T        Y              
PRCPROH  DS    CL8                                                              
PRCPRO   DS    CL6      6   53    6  A  U N             T        Y   18         
PRCPROX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      6   62    6  A  P N             T        Y              
PRCJOBH  DS    CL8                                                              
PRCJOB   DS    CL6      6   72    6  A  U N             T        Y   20         
PRCJOBX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
PRCMGRH  DS    CL8                                                              
PRCMGR   DS    CL1      7   11    1  A  U N             T        Y    6         
PRCMGRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7   15    5  A  P N             T        Y              
PRCMEDH  DS    CL8                                                              
PRCMED   DS    CL1      7   22    1  A  U N             T        Y    8         
PRCMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   27    7  A  P N             T        Y              
PRCWGRH  DS    CL8                                                              
PRCWGR   DS    CL1      7   37    1  A  U N             T        Y   24         
PRCWGRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7   44    4  A  P N             T        Y              
PRCWRKH  DS    CL8                                                              
PRCWRK   DS    CL2      7   54    2  A  U N             T        Y   12         
PRCWRKX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      7   62    8  A  P N             T        Y              
PRCEFFH  DS    CL8                                                              
PRCEFF   DS    CL8      7   72    8  A  U N             T        Y    0         
PRCEFFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      8    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
PRCBASH  DS    CL8                                                              
PRCBAS   DS    CL5      9    9    5  A  U N             T        Y   26         
PRCBASX  DS    CL8                                                              
PRCLACTH DS    CL8                                                              
PRCLACT  DS    CL40     9   40   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    10    2   78  A  P H             T        Y              
PRCSUNH  DS    CL8                                                              
PRCSUN   DS    CL6     11    5    6  A  U N             T        Y              
PRCEUNH  DS    CL8                                                              
PRCEUN   DS    CL6     11   20    6  A  U N             T        Y              
PRCPR1H  DS    CL8                                                              
PRCPR1   DS    CL8     11   31    8  A  U N             T        Y              
PRCPR2H  DS    CL8                                                              
PRCPR2   DS    CL8     11   43    8  A  U N             T        Y              
PRCPR3H  DS    CL8                                                              
PRCPR3   DS    CL8     11   55    8  A  U N             T        Y              
PRCPR4H  DS    CL8                                                              
PRCPR4   DS    CL8     11   67    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12    5    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   20    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   55    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   67    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13    5    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   20    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   55    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   67    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14    5    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   20    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   55    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   67    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15    5    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   20    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   55    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   67    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16    5    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   20    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   55    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   67    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17    5    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   20    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   55    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   67    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18    5    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   20    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   55    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   67    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19    5    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   20    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   55    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   67    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20    5    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   20    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   55    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   67    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21    5    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   20    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   55    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   67    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22    5    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   20    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   55    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   67    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23    5    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   20    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     23   31    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     23   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     23   55    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     23   67    8  A  U N             T        Y              
PRCLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PRCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1720 BYTES                            
