*          DATA SET ACPROFAD   AT LEVEL 007 AS OF 04/20/10                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BFAD      DATE 04/20/10                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
PROOGRH  DS    XL8                                                              
PROOGR   DS    CL3      6   10    3  A  U N             T    I   Y    2         
PROOGRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
PROOFFH  DS    XL8                                                              
PROOFF   DS    CL2      6   28    2  A  U N             T        Y    4         
PROOFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   38    6  A  P N             T        Y              
PROCLIH  DS    XL8                                                              
PROCLI   DS    CL6      6   46    6  A  U N             T        Y    6         
PROCLIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   56    7  A  P N             T        Y              
PROPROH  DS    XL8                                                              
PROPRO   DS    CL6      6   64    6  A  U N             T        Y    8         
PROPROX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
PROMGRH  DS    XL8                                                              
PROMGR   DS    CL1      7   10    1  A  U N             T        Y   10         
PROMGRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7   20    7  A  P N             T        Y              
PROMEDH  DS    XL8                                                              
PROMED   DS    CL1      7   28    1  A  U N             T        Y   12         
PROMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14     9    2   14  A  P H             T        Y              
PROEFFH  DS    XL8                                                              
PROEFF   DS    CL8      9   17    8  A  U N             T        Y   14         
PROEFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      9   28    4  L  P N             T        Y              
PROTYPH  DS    XL8                                                              
PROTYP   DS    CL1      9   33    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      9   35    1  A  P N             T        Y              
PROLACTH DS    XL8                                                              
PROLACT  DS    CL40     9   38   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL33    11    2   33  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL2     12    2    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   10    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     12   32    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL2     13    2    2  A  P H             T        Y              
PROTITH  DS    XL8                                                              
PROTIT   DS    CL18    13   10   18  A  U N             T        Y   16         
PROTITX  DS    XL8                                                              
PROVALH  DS    XL8                                                              
PROVAL   DS    CL2     13   32    2  A  U N             T        Y   18         
PROVALX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     14    2    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL18    14   10   18  A  U N             T        Y   16         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     14   32    2  A  U N             T        Y   18         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     15    2    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL18    15   10   18  A  U N             T        Y   16         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     15   32    2  A  U N             T        Y   18         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     16    2    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL18    16   10   18  A  U N             T        Y   16         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     16   32    2  A  U N             T        Y   18         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     17    2    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL18    17   10   18  A  U N             T        Y   16         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     17   32    2  A  U N             T        Y   18         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL19    19    2   19  A  P H             T        Y              
PROSTRTH DS    XL8                                                              
PROSTRT  DS    CL5     19   22    5  A  U N             T        Y   20         
PROSTRTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    19   42   12  A  P N             T        Y              
PROLNUMH DS    XL8                                                              
PROLNUM  DS    CL12    19   54   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    21    2   14  A  P N             T        Y              
PROMANRH DS    XL8                                                              
PROMANR  DS    CL11    21   22   11  A  U N             T        Y   22         
PROMANRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     21   42    6  A  P N             T        Y              
PROSTATH DS    XL8                                                              
PROSTAT  DS    CL1     21   49    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    23    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y              
PROLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1048 BYTES                            
