*          DATA SET ACPROC7D   AT LEVEL 015 AS OF 05/07/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BC7D      DATE 05/07/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A   P    N         T        Y              
JOBCLNTH DS    CL8                                                              
JOBCLNT  DS    CL6      5    9    6  A   U    N         T    I   Y   16         
JOBCLNTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   16    7  A   P    N         T        Y              
JOBPRODH DS    CL8                                                              
JOBPROD  DS    CL6      5   24    6  A   U    N         T        Y   18         
JOBPRODX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      5   31    3  A   P    N         T        Y              
JOBJOBH  DS    CL8                                                              
JOBJOB   DS    CL6      5   35    6  A   U    N         T        Y   20         
JOBJOBX  DS    CL8                                                              
JOBEXPH  DS    CL8                                                              
JOBEXP   DS    CL5      5   42    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL2      5   48    2  A   P    N         T        Y              
JOBWRKH  DS    CL8                                                              
JOBWRK   DS    CL3      5   51    3  A   U    N         T        Y   12         
JOBWRKX  DS    CL8                                                              
JOBWNAMH DS    CL8                                                              
JOBWNAM  DS    CL15     5   55   15  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      5   71    5  A   P    N         T        Y              
JOBOPTH  DS    CL8                                                              
JOBOPT   DS    CL1      5   77    1  A   U    N         T        Y   22         
JOBOPTX  DS    CL8                                                              
JOBDATAH DS    CL8                                                              
JOBDATA  DS    CL78     7    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78     8    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78     9    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    10    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    11    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    12    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    13    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    14    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    15    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    16    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    17    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    18    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    19    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    20    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    21    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    22    2   78  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  A   P    N         T        Y              
JOBPFH   DS    CL8                                                              
JOBPF    DS    CL78    24    2   78  A   P    H         T        Y              
JOBLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
JOBWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1752 BYTES                            
