*          DATA SET ACPROBCD   AT LEVEL 001 AS OF 07/07/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BBCD      DATE 07/07/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
PRSLV1HH DS    CL8                                                              
PRSLV1H  DS    CL15     5    2   15  L  P N             T        Y              
PRSLEV1H DS    CL8                                                              
PRSLEV1  DS    CL12     5   19   12  A  U N             T    I   Y   12         
PRSLEV1X DS    CL8                                                              
PRSLV2HH DS    CL8                                                              
PRSLV2H  DS    CL15     5   34   15  L  P N             T        Y              
PRSLEV2H DS    CL8                                                              
PRSLEV2  DS    CL12     5   51   12  A  U N             T        Y   14         
PRSLEV2X DS    CL8                                                              
PRSLV3HH DS    CL8                                                              
PRSLV3H  DS    CL15     6    2   15  L  P N             T        Y              
PRSLEV3H DS    CL8                                                              
PRSLEV3  DS    CL12     6   19   12  A  U N             T        Y   16         
PRSLEV3X DS    CL8                                                              
PRSLV4HH DS    CL8                                                              
PRSLV4H  DS    CL15     6   34   15  L  P N             T        Y              
PRSLEV4H DS    CL8                                                              
PRSLEV4  DS    CL12     6   51   12  A  U N             T        Y   18         
PRSLEV4X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   64    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8    6    4  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      8   20    5  L  P N             T        Y              
PRSACT1H DS    CL8                                                              
PRSACT1  DS    CL2      9    2    2  A  U N             T        Y   22         
PRSACT1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50     9    6   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     10    2    2  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50    10    6   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     11    2    2  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50    11    6   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12    2    2  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50    12    6   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13    2    2  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50    13    6   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14    2    2  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50    14    6   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15    2    2  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50    15    6   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50    16    6   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17    2    2  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50    17    6   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18    2    2  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50    18    6   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19    2    2  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50    19    6   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20    2    2  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50    20    6   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21    2    2  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50    21    6   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     22    2    2  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50    22    6   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     23    2    2  A  U N             T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50    23    6   50  A  P N             T        Y              
PRSPFAH  DS    CL8                                                              
PRSPFA   DS    CL78    24    2   78  A  P H             T        Y              
PRSLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PRSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1480 BYTES                            
