*          DATA SET ACPROB9D   AT LEVEL 004 AS OF 06/08/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BB9D      DATE 06/08/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL14     6    2   14  A  P H             T        Y              
PROJGRH  DS    CL8                                                              
PROJGR   DS    CL8      6   20    8  A  U N             T    I   Y    2         
PROJGRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   30    1  A  P N             T        Y              
PROLACTH DS    CL8                                                              
PROLACT  DS    CL40     6   35   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14     7    2   14  A  P H             T        Y              
PROJGRNH DS    CL8                                                              
PROJGRN  DS    CL36     7   20   36  A  U N             T        Y   50         
PROJGRNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      9    2    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      9    8    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5      9   15    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      9   22    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     9   60   10  A  P H             T        Y              
PROLNC1H DS    CL8                                                              
PROLNC1  DS    CL5     10    2    5  A  U N             T        Y              
PROLNP1H DS    CL8                                                              
PROLNP1  DS    CL6     10    8    6  A  U N             T        Y              
PROLNJ1H DS    CL8                                                              
PROLNJ1  DS    CL6     10   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    10   22   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   60    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     11    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11    8    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    11   22   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   60    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     12    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12    8    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    12   22   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   60    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     13    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13    8    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    13   22   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   60    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     14    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14    8    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    14   22   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   60    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     15    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15    8    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    15   22   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   60    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     16    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16    8    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    16   22   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   60    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     17    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17    8    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    17   22   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   60    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     18    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18    8    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    18   22   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   60    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     19    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19    8    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    19   22   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   60    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     20    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20    8    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    20   22   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   60    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5     21    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21    8    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    21   22   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   60    8  A  U N             T        Y              
PROENDH  DS    CL8                                                              
PROEND   DS    CL5     22    2    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22    8    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   15    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    22   22   36  A  P N             T        Y              
PROENDLH DS    CL8                                                              
PROENDL  DS    CL8     22   60    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   53    6  A  P H             T        Y              
PROTOTH  DS    CL8                                                              
PROTOT   DS    CL8     23   60    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     23   69    1  A  P N             T        Y              
PROPFH   DS    CL8                                                              
PROPF    DS    CL78    24    2   78  A  P H             T        Y              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1688 BYTES                            
