*          DATA SET ACPROC2D   AT LEVEL 018 AS OF 02/08/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BC2D      DATE 02/08/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P N             T        Y              
PROCLIH  DS    CL8                                                              
PROCLI   DS    CL6      5   10    6  A  U N             T    I   Y   16         
PROCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   20    7  A  P N             T        Y              
PROPROH  DS    CL8                                                              
PROPRO   DS    CL6      5   28    6  A  U N             T        Y   18         
PROPROX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      5   38    3  A  P N             T        Y              
PROJOBH  DS    CL8                                                              
PROJOB   DS    CL6      5   42    6  A  U N             T        Y   20         
PROJOBX  DS    CL8                                                              
PROJNMH  DS    CL8                                                              
PROJNM   DS    CL30     5   49   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
PROCOLH  DS    CL8                                                              
PROCOL   DS    CL25     6   10   25  A  U N             T        Y   52         
PROCOLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   38    7  A  P N             T        Y              
PROOPTH  DS    CL8                                                              
PROOPT   DS    CL33     6   46   33  A  U N             T        Y   50         
PROOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
PROCOMH  DS    CL8                                                              
PROCOM   DS    CL41     7   10   41  A  U N             T        Y   54         
PROCOMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   52    6  A  P N             T        Y              
PROREPH  DS    CL8                                                              
PROREP   DS    CL9      7   59    9  A  U N             T        Y   56         
PROREPX  DS    CL8                                                              
PRONOTEH DS    CL8                                                              
PRONOTE  DS    CL78     8    2   78  A  P N             T        Y              
PROTITH  DS    CL8                                                              
PROTIT   DS    CL12     9    2   12  A  P N             T        Y              
PROTAGH  DS    CL8                                                              
PROTAG   DS    CL1      9   21    1  A  P N             T        Y              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 496  BYTES                            
