*          DATA SET ACPROC8D   AT LEVEL 008 AS OF 04/01/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BC8D      DATE 04/01/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A   P    N         T        Y              
TXTOGRH  DS    CL8                                                              
TXTOGR   DS    CL1      5   11    1  A   U    N         T    I   Y    2         
TXTOGRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   15    6  A   P    N         T        Y              
TXTOFFH  DS    CL8                                                              
TXTOFF   DS    CL2      5   23    2  A   U    N         T        Y    4         
TXTOFFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      5   27    6  A   P    N         T        Y              
TXTCLIH  DS    CL8                                                              
TXTCLI   DS    CL6      5   35    6  A   U    N         T        Y   16         
TXTCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   44    7  A   P    N         T        Y              
TXTPROH  DS    CL8                                                              
TXTPRO   DS    CL6      5   53    6  A   U    N         T        Y   18         
TXTPROX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      5   62    3  A   P    N         T        Y              
TXTJOBH  DS    CL8                                                              
TXTJOB   DS    CL6      5   67    6  A   U    N         T        Y   20         
TXTJOBX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
TXTMGRH  DS    CL8                                                              
TXTMGR   DS    CL1      6   11    1  A   U    N         T        Y    6         
TXTMGRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      6   15    5  A   P    N         T        Y              
TXTMEDH  DS    CL8                                                              
TXTMED   DS    CL1      6   22    1  A   U    N         T        Y    8         
TXTMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      6   27    8  A   P    N         T        Y              
TXTCATH  DS    CL8                                                              
TXTCAT   DS    CL2      6   37    2  A   U    N         T        Y   42         
TXTCATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      6   42    8  A   P    N         T        Y              
TXTWRKH  DS    CL8                                                              
TXTWRK   DS    CL3      6   52    3  A   U    N         T        Y   12         
TXTWRKX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6   58    4  A   P    N         T        Y              
TXTFORMH DS    CL8                                                              
TXTFORM  DS    CL1      6   64    1  A   U    N         T        Y   50         
TXTFORMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      6   68    5  A   P    N         T        Y              
TXTWHERH DS    CL8                                                              
TXTWHER  DS    CL2      6   75    2  A   U    N         T        Y   52         
TXTWHERX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16     7    2   16  A   P    N         T        Y              
TXTCOMMH DS    CL8                                                              
TXTCOMM  DS    CL6      7   20    6  A   U    N         T        Y   54         
TXTCOMMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     7   48   10  A   P    N         T        Y              
TXTPANH  DS    CL8                                                              
TXTPAN   DS    CL4      7   59    4  A   P    N         T        Y   44         
TXTPANX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      8    2    1  A   P    N         T        Y              
TXTTAGH  DS    CL8                                                              
TXTTAG   DS    CL1      9    2    1  A   P    N         T        Y              
TXTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TXTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 472  BYTES                            
