*          DATA SET ACPROB2D   AT LEVEL 008 AS OF 06/21/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BB2D      DATE 06/21/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL13     5    2   13  A  P N             T        Y              
PROCLIH  DS    CL8                                                              
PROCLI   DS    CL6      5   17    6  A  U N             T    I   Y   16         
PROCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   27    7  A  P N             T        Y              
PROPROH  DS    CL8                                                              
PROPRO   DS    CL6      5   35    6  A  U N             T        Y   18         
PROPROX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      5   45    5  A  P N             T        Y              
PROSTRH  DS    CL8                                                              
PROSTR   DS    CL6      5   51    6  A  U N             T        Y   20         
PROSTRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   62    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL18     6    2   18  A  P N             T        Y              
PROOPTH  DS    CL8                                                              
PROOPT   DS    CL1      6   22    1  A  U N             T        Y   21         
PROOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL56     7    2   56  A  P H             T        Y              
PROSEL1H DS    CL8                                                              
PROSEL1  DS    CL3      8    2    3  A  U N             T        Y   32         
PROSEL1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74     8    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74     9    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    10    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    11    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    12    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    13    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    14    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    15    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    16    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    17    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    18    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    19    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    20    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    21    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL74    22    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y   32         
         DS    CL8                                                              
PRODATXH DS    CL8                                                              
PRODATX  DS    CL74    23    7   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    24    2   12  A  P H             T        Y              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1872 BYTES                            
