*          DATA SET ACPROCAD   AT LEVEL 031 AS OF 11/03/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BCAD      DATE 11/03/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
TESCLIH  DS    CL8                                                              
TESCLI   DS    CL6      6   10    6  A  U N             T    I   Y    1         
TESCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
TESPROH  DS    CL8                                                              
TESPRO   DS    CL6      6   28    6  A  U N             T        Y    3         
TESPROX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      6   38    3  A  P N             T        Y              
TESJOBH  DS    CL8                                                              
TESJOB   DS    CL6      6   42    6  A  U N             T        Y    5         
TESJOBX  DS    CL8                                                              
TESJNMH  DS    CL8                                                              
TESJNM   DS    CL30     6   49   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      7    2    8  A  P N             T        Y              
TESESTH  DS    CL8                                                              
TESEST   DS    CL4      7   11    4  A  U N             T        Y    7         
TESESTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      7   20    5  A  P N             T        Y              
TESMEDH  DS    CL8                                                              
TESMED   DS    CL1      7   28    1  A  U N             T        Y    9         
TESMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   30    1  A  P N             T        Y              
TESMDESH DS    CL8                                                              
TESMDES  DS    CL4      7   33    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      7   38    5  A  P N             T        Y              
TESDESH  DS    CL8                                                              
TESDES   DS    CL30     7   49   30  A  U N             T        Y   15         
TESDESX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
TESFLTH  DS    CL8                                                              
TESFLT   DS    CL4      8   10    4  A  U N             T        Y   13         
TESFLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13     8   38   13  A  P N             T        Y              
TESACTVH DS    CL8                                                              
TESACTV  DS    CL20     8   54   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
TESOPTH  DS    CL8                                                              
TESOPT   DS    CL15     9   10   15  A  U N             T        Y   35         
TESOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     10    2    1  A  P N             T        Y              
TESTAGH  DS    CL8                                                              
TESTAG   DS    CL1     11    2    1  A  P N             T        Y              
TESLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TESWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 448  BYTES                            
