*          DATA SET ACPROA0D   AT LEVEL 001 AS OF 08/28/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BA0D      DATE 08/28/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
HLPHED1H DS    CL8                                                              
HLPHED1  DS    CL70     6    2   70  L  P N             T        Y              
HLPHED2H DS    CL8                                                              
HLPHED2  DS    CL70     7    2   70  L  P N             T        Y              
HLPLINH  DS    CL8                                                              
HLPLIN   DS    CL70     8    2   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL70     9    2   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    10    2   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    11    2   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    12    2   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    13    2   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    14    2   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    15    2   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    16    2   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    17    2   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    18    2   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    19    2   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    20    2   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    21    2   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    22    2   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    23    2   70  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    24    2   70  L  P N             T        Y              
HLPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
HLPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1488 BYTES                            
