*          DATA SET ACPROA8D   AT LEVEL 001 AS OF 08/28/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BA8D      DATE 08/28/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL12     4   16   12  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL36     4   29   36  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL15     4   66   15  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      5    2    6  L  P H             T        Y              
PRRCLACH DS    CL8                                                              
PRRCLAC  DS    CL6      5   16    6  A  U N             T        Y   16         
PRRCLACX DS    CL8                                                              
PRRCLNMH DS    CL8                                                              
PRRCLNM  DS    CL36     5   29   36  A  P N             T        Y              
PRRCLF1H DS    CL8                                                              
PRRCLF1  DS    CL2      5   67    2  A  P N             T        Y              
PRRCLF2H DS    CL8                                                              
PRRCLF2  DS    CL2      5   69    2  A  P N             T        Y              
PRRCLF3H DS    CL8                                                              
PRRCLF3  DS    CL2      5   71    2  A  P N             T        Y              
PRRCLF4H DS    CL8                                                              
PRRCLF4  DS    CL2      5   73    2  A  P N             T        Y              
PRRCLF5H DS    CL8                                                              
PRRCLF5  DS    CL2      5   75    2  A  P N             T        Y              
PRRCLOFH DS    CL8                                                              
PRRCLOF  DS    CL2      5   79    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  L  P H             T        Y              
PRRSJACH DS    CL8                                                              
PRRSJAC  DS    CL6      6   16    6  A  U N             T        Y   18         
PRRSJACX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   27    1  A  P N             T        Y              
PRRSJNMH DS    CL8                                                              
PRRSJNM  DS    CL36     6   29   36  A  U N             T        Y   52         
PRRSJNMX DS    CL8                                                              
PRRSJF1H DS    CL8                                                              
PRRSJF1  DS    CL1      6   67    1  A  U N             T        Y   54         
PRRSJF1X DS    CL8                                                              
PRRSJF2H DS    CL8                                                              
PRRSJF2  DS    CL1      6   69    1  A  U N             T        Y   56         
PRRSJF2X DS    CL8                                                              
PRRSJF3H DS    CL8                                                              
PRRSJF3  DS    CL1      6   71    1  A  U N             T        Y   56         
PRRSJF3X DS    CL8                                                              
PRRSJF4H DS    CL8                                                              
PRRSJF4  DS    CL1      6   73    1  A  U N             T        Y   56         
PRRSJF4X DS    CL8                                                              
PRRSJF5H DS    CL8                                                              
PRRSJF5  DS    CL1      6   75    1  A  U N             T        Y   60         
PRRSJF5X DS    CL8                                                              
PRRSJOFH DS    CL8                                                              
PRRSJOF  DS    CL2      6   79    2  A  U N             T        Y   58         
PRRSJOFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     7    2   10  L  P N             T        Y              
PRRSRACH DS    CL8                                                              
PRRSRAC  DS    CL12     7   16   12  A  U N             T        Y   62         
PRRSRACX DS    CL8                                                              
PRRSRNMH DS    CL8                                                              
PRRSRNM  DS    CL36     7   29   36  A  U N             T        Y   64         
PRRSRNMX DS    CL8                                                              
PRRSRF1H DS    CL8                                                              
PRRSRF1  DS    CL1      7   67    1  A  U N             T        Y   54         
PRRSRF1X DS    CL8                                                              
PRRSRF2H DS    CL8                                                              
PRRSRF2  DS    CL1      7   69    1  A  U N             T        Y   56         
PRRSRF2X DS    CL8                                                              
PRRSRF3H DS    CL8                                                              
PRRSRF3  DS    CL1      7   71    1  A  U N             T        Y   56         
PRRSRF3X DS    CL8                                                              
PRRSRF4H DS    CL8                                                              
PRRSRF4  DS    CL1      7   73    1  A  U N             T        Y   56         
PRRSRF4X DS    CL8                                                              
PRRSRF5H DS    CL8                                                              
PRRSRF5  DS    CL1      7   75    1  A  U N             T        Y   60         
PRRSRF5X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  L  P N             T        Y              
PRR1CACH DS    CL8                                                              
PRR1CAC  DS    CL12     8   16   12  A  U N             T        Y   66         
PRR1CACX DS    CL8                                                              
PRR1CNMH DS    CL8                                                              
PRR1CNM  DS    CL36     8   29   36  A  U N             T        Y   68         
PRR1CNMX DS    CL8                                                              
PRR1CF1H DS    CL8                                                              
PRR1CF1  DS    CL1      8   67    1  A  U N             T        Y   54         
PRR1CF1X DS    CL8                                                              
PRR1CF2H DS    CL8                                                              
PRR1CF2  DS    CL1      8   69    1  A  U N             T        Y   56         
PRR1CF2X DS    CL8                                                              
PRR1CF3H DS    CL8                                                              
PRR1CF3  DS    CL1      8   71    1  A  U N             T        Y   56         
PRR1CF3X DS    CL8                                                              
PRR1CF4H DS    CL8                                                              
PRR1CF4  DS    CL1      8   73    1  A  U N             T        Y   56         
PRR1CF4X DS    CL8                                                              
PRR1CF5H DS    CL8                                                              
PRR1CF5  DS    CL1      8   75    1  A  U N             T        Y   60         
PRR1CF5X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13     9    2   13  L  P N             T        Y              
PRRLACTH DS    CL8                                                              
PRRLACT  DS    CL20     9   16   20  A  P N             T        Y    0         
PRRLACTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9   43    6  L  P N             T        Y              
PRRSTATH DS    CL8                                                              
PRRSTAT  DS    CL1      9   51    1  A  U N             T        Y    0         
PRRSTATX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    10    2   13  L  P N             T        Y              
PRRSHNMH DS    CL8                                                              
PRRSHNM  DS    CL12    10   16   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    10   29   12  L  P N             T        Y              
PRRCSTPH DS    CL8                                                              
PRRCSTP  DS    CL8     10   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    11    2   13  L  P N             T        Y              
PRRBANKH DS    CL8                                                              
PRRBANK  DS    CL12    11   16   12  A  U N             T        Y              
PRRBNKNH DS    CL8                                                              
PRRBNKN  DS    CL36    11   29   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    12    2   13  L  P N             T        Y              
PRRMSYSH DS    CL8                                                              
PRRMSYS  DS    CL1     12   16    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    12   29   10  L  P N             T        Y              
PRRMEDSH DS    CL8                                                              
PRRMEDS  DS    CL15    12   43   15  A  U N             T        Y   75         
PRRMEDSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    13    2   13  L  P N             T        Y              
PRRADR1H DS    CL8                                                              
PRRADR1  DS    CL26    13   16   26  A  U N             T        Y   78         
PRRADR1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13   43    7  L  P N             T        Y              
PRRMAD1H DS    CL8                                                              
PRRMAD1  DS    CL30    13   51   30  A  U N             T        Y   78         
PRRMAD1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    14    2   13  L  P N             T        Y              
PRRADR2H DS    CL8                                                              
PRRADR2  DS    CL26    14   16   26  A  U N             T        Y   78         
PRRADR2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     14   43    7  L  P N             T        Y              
PRRMAD2H DS    CL8                                                              
PRRMAD2  DS    CL30    14   51   30  A  U N             T        Y   78         
PRRMAD2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    15    2   13  L  P N             T        Y              
PRRADR3H DS    CL8                                                              
PRRADR3  DS    CL26    15   16   26  A  U N             T        Y   78         
PRRADR3X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     15   43    7  L  P N             T        Y              
PRRMAD3H DS    CL8                                                              
PRRMAD3  DS    CL30    15   51   30  A  U N             T        Y   78         
PRRMAD3X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    16    2   13  L  P N             T        Y              
PRRADR4H DS    CL8                                                              
PRRADR4  DS    CL26    16   16   26  A  U N             T        Y   78         
PRRADR4X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     16   43    7  L  P N             T        Y              
PRRMAD4H DS    CL8                                                              
PRRMAD4  DS    CL30    16   51   30  A  U N             T        Y   78         
PRRMAD4X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    18    2   13  L  P N             T        Y              
PRRCOMRH DS    CL8                                                              
PRRCOMR  DS    CL62    18   16   62  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    19    2   13  L  P N             T        Y              
PRRVATTH DS    CL8                                                              
PRRVATT  DS    CL8     19   16    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    19   41   13  L  P N             T        Y              
PRRFLTRH DS    CL8                                                              
PRRFLTR  DS    CL12    19   57   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    20    2   13  L  P N             T        Y              
PRRBUYH  DS    CL8                                                              
PRRBUY   DS    CL3     20   16    3  A  U N             T        Y              
PRRBUYNH DS    CL8                                                              
PRRBUYN  DS    CL7     20   20    7  A  P N             N        Y              
         DS    CL8                                                              
         DS    CL15    20   41   15  L  P N             T        Y              
PRRCREH  DS    CL8                                                              
PRRCRE   DS    CL3     20   57    3  A  U N             T        Y              
PRRCRENH DS    CL8                                                              
PRRCREN  DS    CL7     20   61    7  A  P N             N        Y              
         DS    CL8                                                              
         DS    CL13    21    2   13  L  P N             T        Y              
PRRCSHDH DS    CL8                                                              
PRRCSHD  DS    CL1     21   16    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    21   41   13  L  P N             T        Y              
PRRPCTRH DS    CL8                                                              
PRRPCTR  DS    CL8     21   57    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    22    2   13  L  P N             T        Y              
PRRPAYH  DS    CL8                                                              
PRRPAY   DS    CL2     22   16    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     23    2    7  L  P N             T        Y              
PRROPTH  DS    CL8                                                              
PRROPT   DS    CL60    23   16   60  A  U N             T        Y              
PRRPFAH  DS    CL8                                                              
PRRPFA   DS    CL78    24    2   78  A  P H             T        Y              
PRRLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
PRRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2152 BYTES                            
