*          DATA SET ACPROE5D   AT LEVEL 005 AS OF 09/22/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BE5D      DATE 09/22/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
PROOGRH  DS    CL8                                                              
PROOGR   DS    CL3      6   20    3  A   U    N         T    I   Y              
PROOGRX  DS    CL8                                                              
PROOGNH  DS    CL8                                                              
PROOGN   DS    CL36     6   30   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
PROOFFH  DS    CL8                                                              
PROOFF   DS    CL2      7   20    2  A   U    N         T        Y              
PROOFFX  DS    CL8                                                              
PROOFFNH DS    CL8                                                              
PROOFFN  DS    CL36     7   30   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
PROCLIH  DS    CL8                                                              
PROCLI   DS    CL6      8   20    6  A   U    N         T        Y              
PROCLIX  DS    CL8                                                              
PROCLINH DS    CL8                                                              
PROCLIN  DS    CL36     8   30   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    N         T        Y              
PROPROH  DS    CL8                                                              
PROPRO   DS    CL6      9   20    6  A   U    N         T        Y              
PROPROX  DS    CL8                                                              
PROPRONH DS    CL8                                                              
PROPRON  DS    CL36     9   30   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     10    2    6  A   P    N         T        Y              
PROMGRH  DS    CL8                                                              
PROMGR   DS    CL1     10   20    1  A   U    N         T        Y              
PROMGRX  DS    CL8                                                              
PROMGRNH DS    CL8                                                              
PROMGRN  DS    CL36    10   30   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5     11    2    5  A   P    N         T        Y              
PROMEDH  DS    CL8                                                              
PROMED   DS    CL1     11   20    1  A   U    N         T        Y              
PROMEDX  DS    CL8                                                              
PROMEDNH DS    CL8                                                              
PROMEDN  DS    CL36    11   30   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    12    2   12  A   P    N         T        Y              
PROCLOH  DS    CL8                                                              
PROCLO   DS    CL1     12   20    1  A   U    N         T        Y              
PROCLOX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL36    12   30   36  A   P    N         T        Y              
PROTABH  DS    CL8                                                              
PROTAB   DS    CL1     13   10    1  A   U    N         T        Y              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 560  BYTES                            
