*          DATA SET ACPROBDD   AT LEVEL 001 AS OF 07/07/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BBDD      DATE 07/07/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL13     5    2   13  L  P N             T        Y              
PRTWCH   DS    CL8                                                              
PRTWC    DS    CL42     5   16   42  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      7    6    4  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL12     7   19   12  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      7   56    5  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7   65    7  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      7   73    5  L  P N             T        Y              
PRTACT1H DS    CL8                                                              
PRTACT1  DS    CL2      8    2    2  A  U N             T    I   Y   20         
PRTACT1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12     8    6   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36     8   19   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      8   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      8   65    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      8   73    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2      9    2    2  A  U N             T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12     9    6   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36     9   19   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      9   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      9   65    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      9   73    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     10    2    2  A  U N             T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    10    6   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    10   19   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     10   65    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   73    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     11    2    2  A  U N             T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    11    6   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    11   19   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   65    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   73    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     12    2    2  A  U N             T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    12    6   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    12   19   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     12   65    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   73    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     13    2    2  A  U N             T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    13    6   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    13   19   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   65    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   73    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14    2    2  A  U N             T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    14    6   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    14   19   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   65    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   73    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15    2    2  A  U N             T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    15    6   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    15   19   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   65    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   73    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    16    6   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    16   19   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   65    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   73    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17    2    2  A  U N             T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    17    6   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    17   19   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   65    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   73    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18    2    2  A  U N             T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    18    6   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    18   19   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   65    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   73    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19    2    2  A  U N             T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    19    6   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    19   19   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   65    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   73    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20    2    2  A  U N             T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    20    6   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    20   19   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   65    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   73    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21    2    2  A  U N             T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    21    6   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    21   19   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   65    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   73    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22    2    2  A  U N             T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    22    6   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL36    22   19   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   56    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     22   65    7  A  U N             T        Y              
PRTENDH  DS    CL8                                                              
PRTEND   DS    CL8     22   73    8  A  U N             T        Y              
PRTETOHH DS    CL8                                                              
PRTETOH  DS    CL14    23    2   14  L  P N             T        Y              
PRTETOTH DS    CL8                                                              
PRTETOT  DS    CL13    23   17   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    23   31   12  L  P N             T        Y              
PRTWCTOH DS    CL8                                                              
PRTWCTO  DS    CL13    23   44   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    23   58   12  L  P N             T        Y              
PRTTITOH DS    CL8                                                              
PRTTITO  DS    CL9     23   71    9  A  P N             T        Y              
PRTPFAH  DS    CL8                                                              
PRTPFA   DS    CL78    24    2   78  A  P H             T        Y              
PRTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PRTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2304 BYTES                            
