*          DATA SET ACPROAFD   AT LEVEL 001 AS OF 08/28/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BAFD      DATE 08/28/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  L  P N             T        Y              
AGPLTYPH DS    CL8                                                              
AGPLTYP  DS    CL1      5   10    1  A  U N             T        Y   90         
AGPLTYPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5      5   20    5  L  P N             T        Y              
AGPLSTAH DS    CL8                                                              
AGPLSTA  DS    CL3      5   28    3  A  U N             T        Y   91         
AGPLSTAX DS    CL8                                                              
AGPLTITH DS    CL8                                                              
AGPLTIT  DS    CL79     7    2   79  A  P H             T        Y              
AGPLTAGH DS    CL8                                                              
AGPLTAG  DS    CL1      8    3    1  A  P N             T        Y              
AGPLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
AGPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 160  BYTES                            
