*          DATA SET ACPROBBD   AT LEVEL 002 AS OF 08/22/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BBBD      DATE 08/22/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
HISOGRH  DS    XL8                                                              
HISOGR   DS    CL1      6   10    1  A  U N             T    I   Y    2         
HISOGRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
HISOFCH  DS    XL8                                                              
HISOFC   DS    CL2      6   28    2  A  U N             T        Y    4         
HISOFCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   38    6  A  P N             T        Y              
HISCLIH  DS    XL8                                                              
HISCLI   DS    CL6      6   46    6  A  U N             T        Y   16         
HISCLIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   56    7  A  P N             T        Y              
HISPROH  DS    XL8                                                              
HISPRO   DS    CL6      6   64    6  A  U N             T        Y   18         
HISPROX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
HISMGRH  DS    XL8                                                              
HISMGR   DS    CL1      7   10    1  A  U N             T        Y    6         
HISMGRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7   20    7  A  P N             T        Y              
HISMEDH  DS    XL8                                                              
HISMED   DS    CL1      7   28    1  A  U N             T        Y    8         
HISMEDX  DS    XL8                                                              
HISLACTH DS    XL8                                                              
HISLACT  DS    CL40     7   38   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20     9    2   20  A  P H             T        Y              
HISNUMH  DS    XL8                                                              
HISNUM   DS    CL19     9   24   19  A  U N             T        Y   10         
HISNUMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      9   45    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17     9   47   17  A  P N             T        Y              
HISAMTH  DS    XL8                                                              
HISAMT   DS    CL12     9   66   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    10    2   11  A  P N             T        Y              
HISAUTDH DS    XL8                                                              
HISAUTD  DS    CL36    10   14   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL38    12    2   38  A  P H             T        Y              
HISDATH  DS    XL8                                                              
HISDAT   DS    CL8     13    2    8  A  P N             T        Y              
HISPERH  DS    XL8                                                              
HISPER   DS    CL8     13   12    8  A  P N             T        Y              
HISAAMTH DS    XL8                                                              
HISAAMT  DS    CL12    13   28   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   12    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    14   28   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   12    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    15   28   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   12    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    16   28   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   12    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    17   28   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   12    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    18   28   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   12    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    19   28   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     20    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   12    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    20   28   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   12    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    21   28   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22    2    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   12    8  A  P N             T        Y              
HISENDHH DS    XL8                                                              
HISENDH  DS    CL12    22   28   12  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   69    1  A  P N             T        Y              
HISPFH   DS    XL8                                                              
HISPF    DS    CL29    24    2   29  A  P H             T        Y              
HISLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
HISWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1048 BYTES                            
