*          DATA SET ACPROF5D   AT LEVEL 008 AS OF 01/16/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BF5D      DATE 01/16/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
PROOGRH  DS    CL8                                                              
PROOGR   DS    CL3      6   10    3  A   U    N         T    I   Y              
PROOGRX  DS    CL8                                                              
PROOGNH  DS    CL8                                                              
PROOGN   DS    CL36     6   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
PROOFFH  DS    CL8                                                              
PROOFF   DS    CL2      7   10    2  A   U    N         T        Y              
PROOFFX  DS    CL8                                                              
PROOFFNH DS    CL8                                                              
PROOFFN  DS    CL36     7   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
PROCLIH  DS    CL8                                                              
PROCLI   DS    CL6      8   10    6  A   U    N         T        Y              
PROCLIX  DS    CL8                                                              
PROCLINH DS    CL8                                                              
PROCLIN  DS    CL36     8   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    N         T        Y              
PROPROH  DS    CL8                                                              
PROPRO   DS    CL6      9   10    6  A   U    N         T        Y              
PROPROX  DS    CL8                                                              
PROPRONH DS    CL8                                                              
PROPRON  DS    CL36     9   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     10    2    6  A   P    N         T        Y              
PROMGRH  DS    CL8                                                              
PROMGR   DS    CL1     10   10    1  A   U    N         T        Y              
PROMGRX  DS    CL8                                                              
PROMGRNH DS    CL8                                                              
PROMGRN  DS    CL20    10   20   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     10   41    6  A   P    N         T        Y              
PROMEDH  DS    CL8                                                              
PROMED   DS    CL1     10   48    1  A   U    N         T        Y              
PROMEDX  DS    CL8                                                              
PROMEDNH DS    CL8                                                              
PROMEDN  DS    CL20    10   50   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A   P    N         T        Y              
PROCLOSH DS    CL8                                                              
PROCLOS  DS    CL1     11   10    1  A   U    N         T        Y              
PROCLOSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    11   20   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    13    2   12  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL20    13   19   20  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL12    13   41   12  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL20    13   58   20  A   P    H         T        Y              
PROOPT1H DS    CL8                                                              
PROOPT1  DS    CL16    14    2   16  A   P    N         T        Y              
PROVAL1H DS    CL8                                                              
PROVAL1  DS    CL20    14   19   20  A   U    N         T        Y  102         
PROVAL1X DS    CL8                                                              
PROOPT2H DS    CL8                                                              
PROOPT2  DS    CL16    14   41   16  A   P    N         T        Y              
PROVAL2H DS    CL8                                                              
PROVAL2  DS    CL20    14   58   20  A   U    N         T        Y  103         
PROVAL2X DS    CL8                                                              
PROOPT3H DS    CL8                                                              
PROOPT3  DS    CL16    15    2   16  A   P    N         T        Y              
PROVAL3H DS    CL8                                                              
PROVAL3  DS    CL20    15   19   20  A   U    N         T        Y  104         
PROVAL3X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    15   41   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    15   58   20  A   U    N         T        Y  105         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    16    2   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    16   19   20  A   U    N         T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    16   41   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    16   58   20  A   U    N         T        Y  107         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    17    2   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    17   19   20  A   U    N         T        Y  108         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    17   41   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    17   58   20  A   U    N         T        Y  109         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    18    2   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    18   19   20  A   U    N         T        Y  110         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    18   41   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    18   58   20  A   U    N         T        Y  111         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    19    2   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    19   19   20  A   U    N         T        Y  112         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    19   41   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    19   58   20  A   U    N         T        Y  113         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    20    2   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    20   19   20  A   U    N         T        Y  114         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    20   41   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    20   58   20  A   U    N         T        Y  115         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    21    2   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    21   19   20  A   U    N         T        Y  116         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    21   41   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    21   58   20  A   U    N         T        Y  118         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    22    2   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    22   19   20  A   U    N         T        Y  120         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    22   41   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    22   58   20  A   U    N         T        Y  122         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    23    2   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    23   19   20  A   U    N         T        Y  123         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    23   41   16  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    23   58   20  A   U    N         T        Y  124         
         DS    CL8                                                              
PROOPTXH DS    CL8                                                              
PROOPTX  DS    CL16    24    2   16  A   P    N         T        Y              
PROVALXH DS    CL8                                                              
PROVALX  DS    CL20    24   19   20  A   U    N         T        Y  143         
PROVALXX DS    CL8                                                              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1864 BYTES                            
