*          DATA SET ACPROCDD   AT LEVEL 022 AS OF 09/13/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BCDD      DATE 09/13/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
CYCCLIH  DS    CL8                                                              
CYCCLI   DS    CL6      6   10    6  A  U N             T    I   Y    2         
CYCCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
CYCPROH  DS    CL8                                                              
CYCPRO   DS    CL6      6   28    6  A  U N             T        Y    4         
CYCPROX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      6   38    3  A  P N             T        Y              
CYCJOBH  DS    CL8                                                              
CYCJOB   DS    CL6      6   42    6  A  U N             T        Y    6         
CYCJOBX  DS    CL8                                                              
CYCNAMH  DS    CL8                                                              
CYCNAM   DS    CL26     6   49   26  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      7    2    8  A  P N             T        Y              
CYCAIRH  DS    CL8                                                              
CYCAIR   DS    CL6      7   11    6  A  U H             T        Y    8         
CYCAIRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      7   20    9  A  P N             T        Y              
CYCHRVH  DS    CL8                                                              
CYCHRV   DS    CL17     7   30   17  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL10     7   49   10  A  P N             T        Y              
CYCNEXH  DS    CL8                                                              
CYCNEX   DS    CL2      7   60    2  A  P H             T        Y    0         
CYCNEXX  DS    CL8                                                              
CYCPERH  DS    CL8                                                              
CYCPER   DS    CL20     8    2   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL56     9    2   56  A  P H             T        Y              
CYCCURH  DS    CL8                                                              
CYCCUR   DS    CL7      9   68    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL72    10    2   72  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     11    2    1  A  P N             T        Y              
CYCSEQ1H DS    CL8                                                              
CYCSEQ1  DS    CL2     12    2    2  A  P N             T        Y              
CYCDESH  DS    CL8                                                              
CYCDES   DS    CL20    12    5   20  A  U N             T        Y   10         
CYCDESX  DS    CL8                                                              
CYCBLMH  DS    CL8                                                              
CYCBLM   DS    CL7     12   26    7  A  U N             T        Y   12         
CYCBLMX  DS    CL8                                                              
CYCCUMH  DS    CL8                                                              
CYCCUM   DS    CL8     12   34    8  A  U N             T        Y   14         
CYCCUMX  DS    CL8                                                              
CYCINCH  DS    CL8                                                              
CYCINC   DS    CL8     12   43    8  A  P N             T        Y              
CYCBLAH  DS    CL8                                                              
CYCBLA   DS    CL13    12   52   13  A  P N             T        Y              
CYCESAH  DS    CL8                                                              
CYCESA   DS    CL13    12   68   13  A  P N             T        Y              
CYCSEQ2H DS    CL8                                                              
CYCSEQ2  DS    CL2     13    2    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    13    5   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   26    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   34    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   43    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    13   52   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    13   68   13  A  P N             T        Y              
CYCSEQ3H DS    CL8                                                              
CYCSEQ3  DS    CL2     14    2    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    14    5   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     14   26    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   34    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   43    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    14   52   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    14   68   13  A  P N             T        Y              
CYCSEQ4H DS    CL8                                                              
CYCSEQ4  DS    CL2     15    2    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    15    5   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   26    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   34    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   43    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    15   52   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    15   68   13  A  P N             T        Y              
CYCSEQ5H DS    CL8                                                              
CYCSEQ5  DS    CL2     16    2    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    16    5   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   26    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   34    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   43    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    16   52   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    16   68   13  A  P N             T        Y              
CYCSEQ6H DS    CL8                                                              
CYCSEQ6  DS    CL2     17    2    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    17    5   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     17   26    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   34    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   43    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    17   52   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    17   68   13  A  P N             T        Y              
CYCSEQ7H DS    CL8                                                              
CYCSEQ7  DS    CL2     18    2    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    18    5   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     18   26    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   34    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   43    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    18   52   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    18   68   13  A  P N             T        Y              
CYCSEQ8H DS    CL8                                                              
CYCSEQ8  DS    CL2     19    2    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    19    5   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     19   26    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   34    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   43    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    19   52   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    19   68   13  A  P N             T        Y              
CYCSEQ9H DS    CL8                                                              
CYCSEQ9  DS    CL2     20    2    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    20    5   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     20   26    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   34    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   43    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    20   52   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    20   68   13  A  P N             T        Y              
CYCSEQAH DS    CL8                                                              
CYCSEQA  DS    CL2     21    2    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20    21    5   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     21   26    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   34    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   43    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    21   52   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    21   68   13  A  P N             T        Y              
CYCTOTH  DS    CL8                                                              
CYCTOT   DS    CL6     22    5    6  A  P H             T        Y              
CYCBILH  DS    CL8                                                              
CYCBIL   DS    CL13    22   52   13  A  P H             T        Y              
CYCESTH  DS    CL8                                                              
CYCEST   DS    CL13    22   68   13  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL26    24    5   26  A  P H             T        Y              
CYCLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CYCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1848 BYTES                            
