*          DATA SET ACPROF1D   AT LEVEL 002 AS OF 08/21/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BF1D      DATE 08/21/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL12     5   13   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL36     5   29   36  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13     5   66   13  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
CLRSJACH DS    XL8                                                              
CLRSJAC  DS    CL6      6   13    6  A  U N             T        Y   16         
CLRSJACX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      6   27    1  A  P N             T        Y              
CLRSJNMH DS    XL8                                                              
CLRSJNM  DS    CL36     6   29   36  A  U N             T        Y   50         
CLRSJNMX DS    XL8                                                              
CLRSJOFH DS    XL8                                                              
CLRSJOF  DS    CL2      6   66    2  A  U N             T        Y   56         
CLRSJOFX DS    XL8                                                              
CLRSJF1H DS    XL8                                                              
CLRSJF1  DS    CL1      6   70    1  A  U N             T        Y   52         
CLRSJF1X DS    XL8                                                              
CLRSJF2H DS    XL8                                                              
CLRSJF2  DS    CL1      6   72    1  A  U N             T        Y   52         
CLRSJF2X DS    XL8                                                              
CLRSJF3H DS    XL8                                                              
CLRSJF3  DS    CL1      6   74    1  A  U N             T        Y   52         
CLRSJF3X DS    XL8                                                              
CLRSJF4H DS    XL8                                                              
CLRSJF4  DS    CL1      6   76    1  A  U N             T        Y   52         
CLRSJF4X DS    XL8                                                              
CLRSJF5H DS    XL8                                                              
CLRSJF5  DS    CL1      6   78    1  A  U N             T        Y   52         
CLRSJF5X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     7    2   10  A  P N             T        Y              
CLRSRACH DS    XL8                                                              
CLRSRAC  DS    CL12     7   13   12  A  U N             T        Y   60         
CLRSRACX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      7   27    1  A  P N             T        Y              
CLRSRNMH DS    XL8                                                              
CLRSRNM  DS    CL36     7   29   36  A  U N             T        Y   62         
CLRSRNMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2      7   66    2  A  P N             T        Y    0         
         DS    XL8                                                              
CLRSRF1H DS    XL8                                                              
CLRSRF1  DS    CL1      7   70    1  A  U N             T        Y   52         
CLRSRF1X DS    XL8                                                              
CLRSRF2H DS    XL8                                                              
CLRSRF2  DS    CL1      7   72    1  A  U N             T        Y   52         
CLRSRF2X DS    XL8                                                              
CLRSRF3H DS    XL8                                                              
CLRSRF3  DS    CL1      7   74    1  A  U N             T        Y   52         
CLRSRF3X DS    XL8                                                              
CLRSRF4H DS    XL8                                                              
CLRSRF4  DS    CL1      7   76    1  A  U N             T        Y   52         
CLRSRF4X DS    XL8                                                              
CLRSRF5H DS    XL8                                                              
CLRSRF5  DS    CL1      7   78    1  A  U N             T        Y   52         
CLRSRF5X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
CLR1CACH DS    XL8                                                              
CLR1CAC  DS    CL12     8   13   12  A  U N             T        Y   64         
CLR1CACX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      8   27    1  A  P N             T        Y              
CLR1CNMH DS    XL8                                                              
CLR1CNM  DS    CL36     8   29   36  A  U N             T        Y   66         
CLR1CNMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2      8   66    2  A  P N             T        Y    0         
         DS    XL8                                                              
CLR1CF1H DS    XL8                                                              
CLR1CF1  DS    CL1      8   70    1  A  U N             T        Y   52         
CLR1CF1X DS    XL8                                                              
CLR1CF2H DS    XL8                                                              
CLR1CF2  DS    CL1      8   72    1  A  U N             T        Y   52         
CLR1CF2X DS    XL8                                                              
CLR1CF3H DS    XL8                                                              
CLR1CF3  DS    CL1      8   74    1  A  U N             T        Y   52         
CLR1CF3X DS    XL8                                                              
CLR1CF4H DS    XL8                                                              
CLR1CF4  DS    CL1      8   76    1  A  U N             T        Y   52         
CLR1CF4X DS    XL8                                                              
CLR1CF5H DS    XL8                                                              
CLR1CF5  DS    CL1      8   78    1  A  U N             T        Y   52         
CLR1CF5X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13     9    2   13  A  P N             T        Y              
CLRLACTH DS    XL8                                                              
CLRLACT  DS    CL20     9   16   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    11    2   12  A  P N             T        Y              
CLRBGRPH DS    XL8                                                              
CLRBGRP  DS    CL3     11   16    3  A  U N             T        Y   68         
CLRBGRPX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    12    2   11  A  P N             T        Y              
CLRBNUMH DS    XL8                                                              
CLRBNUM  DS    CL32    12   16   32  A  U N             T        Y   70         
CLRBNUMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    14    2   13  A  P N             T        Y              
CLRPBILH DS    XL8                                                              
CLRPBIL  DS    CL49    14   16   49  A  U N             T        Y   72         
CLRPBILX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    15    2   13  A  P N             T        Y              
CLRHED1H DS    XL8                                                              
CLRHED1  DS    CL50    15   16   50  A  U N             T        Y   74         
CLRHED1X DS    XL8                                                              
CLRHED2H DS    XL8                                                              
CLRHED2  DS    CL50    16   16   50  A  U N             T        Y   74         
CLRHED2X DS    XL8                                                              
CLRHED3H DS    XL8                                                              
CLRHED3  DS    CL50    17   16   50  A  U N             T        Y   74         
CLRHED3X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    19    2   13  A  P N             T        Y              
CLRADR1H DS    XL8                                                              
CLRADR1  DS    CL26    19   16   26  A  U N             T        Y   76         
CLRADR1X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    20    2   13  A  P N             T        Y              
CLRADR2H DS    XL8                                                              
CLRADR2  DS    CL26    20   16   26  A  U N             T        Y   76         
CLRADR2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    21    2   13  A  P N             T        Y              
CLRADR3H DS    XL8                                                              
CLRADR3  DS    CL26    21   16   26  A  U N             T        Y   76         
CLRADR3X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    22    2   13  A  P N             T        Y              
CLRADR4H DS    XL8                                                              
CLRADR4  DS    CL26    22   16   26  A  U N             T        Y   76         
CLRADR4X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    23    2   13  A  P N             T        Y              
CLRADR5H DS    XL8                                                              
CLRADR5  DS    CL26    23   16   26  A  U N             T        Y   76         
CLRADR5X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P H             T        Y              
CLRLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
CLRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1568 BYTES                            
