*          DATA SET ACPRODBD   AT LEVEL 004 AS OF 12/05/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BDBD      DATE 12/05/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL12     6   13   12  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL36     6   29   36  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL13     6   66   13  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
PRXCLACH DS    XL8                                                              
PRXCLAC  DS    CL6      7   13    6  A  U N             T        Y   16         
PRXCLACX DS    XL8                                                              
PRXCLNMH DS    XL8                                                              
PRXCLNM  DS    CL36     7   29   36  A  P N             T        Y              
PRXCLOFH DS    XL8                                                              
PRXCLOF  DS    CL2      7   66    2  A  P N             T        Y              
PRXCLF1H DS    XL8                                                              
PRXCLF1  DS    CL2      7   70    2  A  P N             T        Y              
PRXCLF2H DS    XL8                                                              
PRXCLF2  DS    CL2      7   72    2  A  P N             T        Y              
PRXCLF3H DS    XL8                                                              
PRXCLF3  DS    CL2      7   74    2  A  P N             T        Y              
PRXCLF4H DS    XL8                                                              
PRXCLF4  DS    CL2      7   76    2  A  P N             T        Y              
PRXCLF5H DS    XL8                                                              
PRXCLF5  DS    CL2      7   78    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
PRXSJACH DS    XL8                                                              
PRXSJAC  DS    CL6      8   13    6  A  U N             T        Y   18         
PRXSJACX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      8   27    1  A  P N             T        Y              
PRXSJNMH DS    XL8                                                              
PRXSJNM  DS    CL36     8   29   36  A  P N             T        Y   52         
PRXSJNMX DS    XL8                                                              
PRXSJOFH DS    XL8                                                              
PRXSJOF  DS    CL2      8   66    2  A  P N             T        Y   58         
PRXSJOFX DS    XL8                                                              
PRXSJF1H DS    XL8                                                              
PRXSJF1  DS    CL1      8   70    1  A  P N             T        Y   54         
PRXSJF1X DS    XL8                                                              
PRXSJF2H DS    XL8                                                              
PRXSJF2  DS    CL1      8   72    1  A  P N             T        Y   54         
PRXSJF2X DS    XL8                                                              
PRXSJF3H DS    XL8                                                              
PRXSJF3  DS    CL1      8   74    1  A  P N             T        Y   54         
PRXSJF3X DS    XL8                                                              
PRXSJF4H DS    XL8                                                              
PRXSJF4  DS    CL1      8   76    1  A  P N             T        Y   54         
PRXSJF4X DS    XL8                                                              
PRXSJF5H DS    XL8                                                              
PRXSJF5  DS    CL1      8   78    1  A  P N             T        Y   54         
PRXSJF5X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    10    2   13  A  P N             T        Y              
PRXLACTH DS    XL8                                                              
PRXLACT  DS    CL20    10   16   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6     10   40    6  A  P N             T        Y              
PRXSTATH DS    XL8                                                              
PRXSTAT  DS    CL1     10   48    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL19    10   50   19  A  P N             T        Y              
PRXTRAKH DS    XL8                                                              
PRXTRAK  DS    CL1     10   73    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    12    2   13  A  P N             T        Y              
PRXFT1H  DS    XL8                                                              
PRXFT1   DS    CL50    12   16   50  A  U N             T        Y   86         
PRXFT1X  DS    XL8                                                              
PRXFT2H  DS    XL8                                                              
PRXFT2   DS    CL50    13   16   50  A  U N             T        Y   86         
PRXFT2X  DS    XL8                                                              
PRXFT3H  DS    XL8                                                              
PRXFT3   DS    CL50    14   16   50  A  U N             T        Y   86         
PRXFT3X  DS    XL8                                                              
PRXEHEDH DS    XL8                                                              
PRXEHED  DS    CL24    16    2   24  A  P N             T        Y              
PRXLAB1H DS    XL8                                                              
PRXLAB1  DS    CL2     16   42    2  A  P N             T        Y              
PRXEQU1H DS    XL8                                                              
PRXEQU1  DS    CL10    16   45   10  A  P N             T        Y              
PRXACC1H DS    XL8                                                              
PRXACC1  DS    CL20    16   56   20  A  U N             T        Y              
PRXLAB2H DS    XL8                                                              
PRXLAB2  DS    CL2     17    2    2  A  P N             T        Y              
PRXEQU2H DS    XL8                                                              
PRXEQU2  DS    CL10    17    5   10  A  P N             T        Y              
PRXACC2H DS    XL8                                                              
PRXACC2  DS    CL20    17   16   20  A  U N             T        Y              
PRXLAB3H DS    XL8                                                              
PRXLAB3  DS    CL2     17   42    2  A  P N             T        Y              
PRXEQU3H DS    XL8                                                              
PRXEQU3  DS    CL10    17   45   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    17   56   20  A  U N             T        Y              
PRXLAB4H DS    XL8                                                              
PRXLAB4  DS    CL2     18    2    2  A  P N             T        Y              
PRXEQU4H DS    XL8                                                              
PRXEQU4  DS    CL10    18    5   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    18   16   20  A  U N             T        Y              
PRXLAB5H DS    XL8                                                              
PRXLAB5  DS    CL2     18   42    2  A  P N             T        Y              
PRXEQU5H DS    XL8                                                              
PRXEQU5  DS    CL10    18   45   10  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    18   56   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL12    20    2   12  A  P N             T        Y              
PRXACMH  DS    XL8                                                              
PRXACM   DS    CL54    20   16   54  A  U N             T        Y   87         
PRXACMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    22    2   13  A  P N             T        Y              
PRXPGRH  DS    XL8                                                              
PRXPGR   DS    CL9     22   16    9  A  U N             T        Y   88         
PRXPGRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P H             T        Y              
PRXLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
PRXWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1296 BYTES                            
