*          DATA SET ACPROEAD   AT LEVEL 009 AS OF 04/20/10                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BEAD      DATE 04/20/10                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
PROOGRH  DS    XL8                                                              
PROOGR   DS    CL3      5   10    3  A  U N             T    I   Y    2         
PROOGRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   20    7  A  P N             T        Y              
PROOFFH  DS    XL8                                                              
PROOFF   DS    CL2      5   28    2  A  U N             T        Y    4         
PROOFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
PROCLIH  DS    XL8                                                              
PROCLI   DS    CL6      5   46    6  A  U N             T        Y    6         
PROCLIX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
PROPROH  DS    XL8                                                              
PROPRO   DS    CL6      5   64    6  A  U N             T        Y    8         
PROPROX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
PROMGRH  DS    XL8                                                              
PROMGR   DS    CL1      6   10    1  A  U N             T        Y   10         
PROMGRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
PROMEDH  DS    XL8                                                              
PROMED   DS    CL1      6   28    1  A  U N             T        Y   12         
PROMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   38    4  A  P N             T        Y              
PROEFFH  DS    XL8                                                              
PROEFF   DS    CL8      6   46    8  A  U N             T        Y   14         
PROEFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   56    6  A  P N             T        Y              
PROSTAH  DS    XL8                                                              
PROSTA   DS    CL1      6   64    1  A  U N             T        Y   16         
PROSTAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7    2    7  L  P N             T        Y              
PROTYPH  DS    XL8                                                              
PROTYP   DS    CL1      7   10    1  A  U N             T        Y   16         
PROTYPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1      8    2    1  A  P N             T        Y              
PROTITH  DS    XL8                                                              
PROTIT   DS    CL78     9    2   78  A  P H             T        Y              
PROTAGH  DS    XL8                                                              
PROTAG   DS    CL1     10    2    1  A  P N             T        Y              
PROLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 416  BYTES                            
