*          DATA SET ACPROAAD   AT LEVEL 001 AS OF 08/28/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BAAD      DATE 08/28/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      5    2    9  L  P H             T        Y              
PROWRKH  DS    CL8                                                              
PROWRK   DS    CL2      5   20    2  A  U H             T    I   Y   12         
PROWRKX  DS    CL8                                                              
PROLACTH DS    CL8                                                              
PROLACT  DS    CL40     5   38   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      5   80    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     6    2   11  L  P H             T        Y              
PRODESCH DS    CL8                                                              
PRODESC  DS    CL15     6   20   15  A  U H             T        Y   50         
PRODESCX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12     8    2   12  L  P N             T        Y              
PROWGRH  DS    CL8                                                              
PROWGR   DS    CL2      8   20    2  A  U N             T        Y   10         
PROWGRX  DS    CL8                                                              
PROWGRNH DS    CL8                                                              
PROWGRN  DS    CL36     8   38   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      9    2    6  L  P N             T        Y              
PROSTATH DS    CL8                                                              
PROSTAT  DS    CL50     9   20   50  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    10    2   10  L  P N             T        Y              
PROLNMH  DS    CL8                                                              
PROLNM   DS    CL36    10   20   36  A  U N             T        Y   14         
PROLNMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    11    2   13  L  P N             T        Y              
PROLNM2H DS    CL8                                                              
PROLNM2  DS    CL36    11   20   36  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   58    7  L  P N             T        Y              
PROLANGH DS    CL8                                                              
PROLANG  DS    CL13    11   66   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    12    2   12  L  P N             T        Y              
PROTYPH  DS    CL8                                                              
PROTYP   DS    CL1     12   20    1  A  U N             T        Y   16         
PROTYPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    13    2   12  L  P N             T        Y              
PROSURH  DS    CL8                                                              
PROSUR   DS    CL1     13   20    1  A  U N             T        Y   18         
PROSURX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL35    13   38   35  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    14    2   12  L  P N             T        Y              
PROEXPH  DS    CL8                                                              
PROEXP   DS    CL1     14   20    1  A  U N             T        Y   20         
PROEXPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     15    2    7  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   10    7  L  P N             T        Y              
PROLORDH DS    CL8                                                              
PROLORD  DS    CL1     15   20    1  A  U N             T        Y   22         
PROLORDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL35    15   38   35  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   10    8  L  P N             T        Y              
PROLESTH DS    CL8                                                              
PROLEST  DS    CL1     16   20    1  A  U N             T        Y   24         
PROLESTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL35    16   38   35  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   10    8  L  P N             T        Y              
PROLPSTH DS    CL8                                                              
PROLPST  DS    CL1     17   20    1  A  U N             T        Y   26         
PROLPSTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL35    17   38   35  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   10    8  L  P N             T        Y              
PROLBILH DS    CL8                                                              
PROLBIL  DS    CL1     18   20    1  A  U N             T        Y   28         
PROLBILX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL35    18   38   35  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19    2    1  A  P N             T        Y              
PROPFAH  DS    CL8                                                              
PROPFA   DS    CL78    24    2   78  L  P H             T        Y              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1040 BYTES                            
