*          DATA SET ACPROA7D   AT LEVEL 001 AS OF 08/28/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BA7D      DATE 08/28/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL12     4   16   12  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL36     4   29   36  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL15     4   66   15  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      5    2    6  L  P H             T        Y              
CLRSJACH DS    CL8                                                              
CLRSJAC  DS    CL6      5   16    6  A  U N             T        Y   16         
CLRSJACX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   27    1  L  P N             T        Y              
CLRSJNMH DS    CL8                                                              
CLRSJNM  DS    CL36     5   29   36  A  U N             T        Y   50         
CLRSJNMX DS    CL8                                                              
CLRSJF1H DS    CL8                                                              
CLRSJF1  DS    CL1      5   67    1  A  U N             T        Y   52         
CLRSJF1X DS    CL8                                                              
CLRSJF2H DS    CL8                                                              
CLRSJF2  DS    CL1      5   69    1  A  U N             T        Y   54         
CLRSJF2X DS    CL8                                                              
CLRSJF3H DS    CL8                                                              
CLRSJF3  DS    CL1      5   71    1  A  U N             T        Y   54         
CLRSJF3X DS    CL8                                                              
CLRSJF4H DS    CL8                                                              
CLRSJF4  DS    CL1      5   73    1  A  U N             T        Y   54         
CLRSJF4X DS    CL8                                                              
CLRSJF5H DS    CL8                                                              
CLRSJF5  DS    CL1      5   75    1  A  U N             T        Y   58         
CLRSJF5X DS    CL8                                                              
CLRSJOFH DS    CL8                                                              
CLRSJOF  DS    CL2      5   79    2  A  U N             T        Y   56         
CLRSJOFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     6    2   10  L  P H             T        Y              
CLRSRACH DS    CL8                                                              
CLRSRAC  DS    CL12     6   16   12  A  U N             T        Y   60         
CLRSRACX DS    CL8                                                              
CLRSRNMH DS    CL8                                                              
CLRSRNM  DS    CL36     6   29   36  A  U N             T        Y   62         
CLRSRNMX DS    CL8                                                              
CLRSRF1H DS    CL8                                                              
CLRSRF1  DS    CL1      6   67    1  A  U N             T        Y   52         
CLRSRF1X DS    CL8                                                              
CLRSRF2H DS    CL8                                                              
CLRSRF2  DS    CL1      6   69    1  A  U N             T        Y   54         
CLRSRF2X DS    CL8                                                              
CLRSRF3H DS    CL8                                                              
CLRSRF3  DS    CL1      6   71    1  A  U N             T        Y   54         
CLRSRF3X DS    CL8                                                              
CLRSRF4H DS    CL8                                                              
CLRSRF4  DS    CL1      6   73    1  A  U N             T        Y   54         
CLRSRF4X DS    CL8                                                              
CLRSRF5H DS    CL8                                                              
CLRSRF5  DS    CL1      6   75    1  A  U N             T        Y   58         
CLRSRF5X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7    2    7  L  P H             T        Y              
CLR1CACH DS    CL8                                                              
CLR1CAC  DS    CL12     7   16   12  A  U N             T        Y   64         
CLR1CACX DS    CL8                                                              
CLR1CNMH DS    CL8                                                              
CLR1CNM  DS    CL36     7   29   36  A  U N             T        Y   66         
CLR1CNMX DS    CL8                                                              
CLR1CF1H DS    CL8                                                              
CLR1CF1  DS    CL1      7   67    1  A  U N             T        Y   52         
CLR1CF1X DS    CL8                                                              
CLR1CF2H DS    CL8                                                              
CLR1CF2  DS    CL1      7   69    1  A  U N             T        Y   54         
CLR1CF2X DS    CL8                                                              
CLR1CF3H DS    CL8                                                              
CLR1CF3  DS    CL1      7   71    1  A  U N             T        Y   54         
CLR1CF3X DS    CL8                                                              
CLR1CF4H DS    CL8                                                              
CLR1CF4  DS    CL1      7   73    1  A  U N             T        Y   54         
CLR1CF4X DS    CL8                                                              
CLR1CF5H DS    CL8                                                              
CLR1CF5  DS    CL1      7   75    1  A  U N             T        Y   58         
CLR1CF5X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13     8    2   13  L  P N             T        Y              
CLRLACTH DS    CL8                                                              
CLRLACT  DS    CL20     8   16   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   43    6  L  P N             T        Y              
CLRSTATH DS    CL8                                                              
CLRSTAT  DS    CL1      8   51    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13     9    2   13  L  P N             T        Y              
CLRSHNMH DS    CL8                                                              
CLRSHNM  DS    CL12     9   16   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     9   29   12  L  P N             T        Y              
CLRCSTPH DS    CL8                                                              
CLRCSTP  DS    CL8      9   43    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    10    2   13  L  P N             T        Y              
CLRBGRPH DS    CL8                                                              
CLRBGRP  DS    CL3     10   16    3  A  U N             T        Y   68         
CLRBGRPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    10   29   13  L  P N             T        Y              
CLRMBGPH DS    CL8                                                              
CLRMBGP  DS    CL2     10   43    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    11    2   13  L  P N             T        Y              
CLRBANKH DS    CL8                                                              
CLRBANK  DS    CL12    11   16   12  A  U N             T        Y              
CLRBNKNH DS    CL8                                                              
CLRBNKN  DS    CL36    11   29   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    12    2   13  L  P N             T        Y              
CLRMSYSH DS    CL8                                                              
CLRMSYS  DS    CL1     12   16    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    12   29   10  L  P N             T        Y              
CLRMEDSH DS    CL8                                                              
CLRMEDS  DS    CL15    12   43   15  A  U N             T        Y   75         
CLRMEDSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    13    2   13  L  P N             T        Y              
CLRADR1H DS    CL8                                                              
CLRADR1  DS    CL26    13   16   26  A  U N             T        Y   76         
CLRADR1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13   43    7  L  P N             T        Y              
CLRMAD1H DS    CL8                                                              
CLRMAD1  DS    CL30    13   51   30  A  U N             T        Y   76         
CLRMAD1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    14    2   13  L  P N             T        Y              
CLRADR2H DS    CL8                                                              
CLRADR2  DS    CL26    14   16   26  A  U N             T        Y   76         
CLRADR2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     14   43    7  L  P N             T        Y              
CLRMAD2H DS    CL8                                                              
CLRMAD2  DS    CL30    14   51   30  A  U N             T        Y   76         
CLRMAD2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    15    2   13  L  P N             T        Y              
CLRADR3H DS    CL8                                                              
CLRADR3  DS    CL26    15   16   26  A  U N             T        Y   76         
CLRADR3X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     15   43    7  L  P N             T        Y              
CLRMAD3H DS    CL8                                                              
CLRMAD3  DS    CL30    15   51   30  A  U N             T        Y   76         
CLRMAD3X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    16    2   13  L  P N             T        Y              
CLRADR4H DS    CL8                                                              
CLRADR4  DS    CL26    16   16   26  A  U N             T        Y   76         
CLRADR4X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     16   43    7  L  P N             T        Y              
CLRMAD4H DS    CL8                                                              
CLRMAD4  DS    CL30    16   51   30  A  U N             T        Y   76         
CLRMAD4X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    17    2   13  L  P N             T        Y              
CLRCOMRH DS    CL8                                                              
CLRCOMR  DS    CL62    17   16   62  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    18    2   13  L  P N             T        Y              
CLRVATTH DS    CL8                                                              
CLRVATT  DS    CL8     18   16    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   41   11  L  P N             T        Y              
CLRFLTRH DS    CL8                                                              
CLRFLTR  DS    CL12    18   57   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    19    2   13  L  P N             T        Y              
CLRBUYH  DS    CL8                                                              
CLRBUY   DS    CL3     19   16    3  A  U N             T        Y              
CLRBUYNH DS    CL8                                                              
CLRBUYN  DS    CL7     19   20    7  A  P N             N        Y              
         DS    CL8                                                              
         DS    CL15    19   41   15  L  P N             T        Y              
CLRCREH  DS    CL8                                                              
CLRCRE   DS    CL3     19   57    3  A  U N             T        Y              
CLRCRENH DS    CL8                                                              
CLRCREN  DS    CL7     19   61    7  A  P N             N        Y              
         DS    CL8                                                              
         DS    CL13    20    2   13  L  P N             T        Y              
CLRACC1H DS    CL8                                                              
CLRACC1  DS    CL2     20   16    2  A  U N             T        Y              
CLRAC1NH DS    CL8                                                              
CLRAC1N  DS    CL20    20   20   20  A  P N             N        Y              
         DS    CL8                                                              
         DS    CL13    20   41   13  L  P N             T        Y              
CLRACC2H DS    CL8                                                              
CLRACC2  DS    CL2     20   57    2  A  U N             T        Y              
CLRAC2NH DS    CL8                                                              
CLRAC2N  DS    CL20    20   61   20  A  P N             N        Y              
         DS    CL8                                                              
         DS    CL13    21    2   13  L  P N             T        Y              
CLRCSHDH DS    CL8                                                              
CLRCSHD  DS    CL1     21   16    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    21   41   13  L  P N             T        Y              
CLRPCTRH DS    CL8                                                              
CLRPCTR  DS    CL8     21   57    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    22    2   13  L  P N             T        Y              
CLRPAYH  DS    CL8                                                              
CLRPAY   DS    CL2     22   16    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     23    2    7  L  P N             T        Y              
CLROPTH  DS    CL8                                                              
CLROPT   DS    CL60    23   16   60  A  U N             T        Y              
CLRPFAH  DS    CL8                                                              
CLRPFA   DS    CL78    24    2   78  A  P H             T        Y              
CLRLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CLRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2184 BYTES                            
