*          DATA SET ACPROA9D   AT LEVEL 001 AS OF 08/28/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BA9D      DATE 08/28/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL13     6    2   13  L  P H             T        Y              
PROMEDH  DS    CL8                                                              
PROMED   DS    CL2      6   20    2  A  U H             T    I   Y    8         
PROMEDX  DS    CL8                                                              
PROLACTH DS    CL8                                                              
PROLACT  DS    CL40     6   38   40  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      7    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12     8    2   12  L  P H             T        Y   50         
         DS    CL8                                                              
PRODESCH DS    CL8                                                              
PRODESC  DS    CL12     8   20   12  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL12     9    2   12  L  P N             T        Y              
PROMGRH  DS    CL8                                                              
PROMGR   DS    CL2      9   20    2  A  U N             T        Y    6         
PROMGRX  DS    CL8                                                              
PROMGRNH DS    CL8                                                              
PROMGRN  DS    CL36     9   38   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    10    2   16  A  P H             T        Y              
PROCOMH  DS    CL8                                                              
PROCOM   DS    CL14    10   20   14  A  U H             T        Y   54         
PROCOMX  DS    CL8                                                              
PROCOMNH DS    CL8                                                              
PROCOMN  DS    CL36    10   38   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    11    2   15  L  P N             T        Y              
PROANALH DS    CL8                                                              
PROANAL  DS    CL1     11   20    1  A  U N             T        Y   56         
PROANALX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    12    2   16  L  P H             T        Y              
PRONEXTH DS    CL8                                                              
PRONEXT  DS    CL6     12   20    6  A  U H             T        Y   58         
PRONEXTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    13    2   17  L  P H             T        Y              
PRORESH  DS    CL8                                                              
PRORES   DS    CL4     13   20    4  A  U H             T        Y   60         
PRORESX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL17    14    2   17  A  P N             T        Y              
PROTITH  DS    CL8                                                              
PROTIT   DS    CL1     14   20    1  A  U N             T        Y   62         
PROTITX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    15    2   15  L  P N             T        Y              
PROENAMH DS    CL8                                                              
PROENAM  DS    CL36    15   20   36  A  U N             T        Y   64         
PROENAMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    16    2   15  L  P N             T        Y              
PROVATH  DS    CL8                                                              
PROVAT   DS    CL14    16   20   14  A  U N             T        Y    0         
PROVATX  DS    CL8                                                              
PROVATNH DS    CL8                                                              
PROVATN  DS    CL36    16   38   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    17    2   15  L  P N             T        Y              
PROVAT2H DS    CL8                                                              
PROVAT2  DS    CL14    17   20   14  A  U N             T        Y    0         
PROVAT2X DS    CL8                                                              
PROVTN2H DS    CL8                                                              
PROVTN2  DS    CL36    17   38   36  A  P N             T        Y              
PROFDESH DS    CL8                                                              
PROFDES  DS    CL13    18    2   13  L  P N             T        Y              
PRONAMXH DS    CL8                                                              
PRONAMX  DS    CL36    18   20   36  A  U N             T        Y              
PROLANH  DS    CL8                                                              
PROLAN   DS    CL7     18   58    7  L  P N             T        Y              
PROLANGH DS    CL8                                                              
PROLANG  DS    CL13    18   66   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    19    2   16  A  P N             T        Y              
PROCOM2H DS    CL8                                                              
PROCOM2  DS    CL14    19   20   14  A  U N             T        Y              
PROCMN2H DS    CL8                                                              
PROCMN2  DS    CL36    19   38   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    20    2   15  L  P N             T        Y              
PROANL2H DS    CL8                                                              
PROANL2  DS    CL1     20   20    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    21    2   11  A  P N             T        Y              
PROFRL1H DS    CL8                                                              
PROFRL1  DS    CL15    21   20   15  A  U N             T        Y              
PROFRN1H DS    CL8                                                              
PROFRN1  DS    CL36    21   38   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    22    2   11  A  P N             T        Y              
PROFRL2H DS    CL8                                                              
PROFRL2  DS    CL15    22   20   15  A  U N             T        Y              
PROFRN2H DS    CL8                                                              
PROFRN2  DS    CL36    22   38   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     23    2    1  A  P N             T        Y              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1176 BYTES                            
