*          DATA SET ACPROC1D   AT LEVEL 001 AS OF 06/30/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BC1D      DATE 06/30/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     5    2   11  A  P N             T        Y              
CATSCHMH DS    CL8                                                              
CATSCHM  DS    CL8      5   16    8  A  U N             T    I   Y   40         
CATSCHMX DS    CL8                                                              
CATSNAMH DS    CL8                                                              
CATSNAM  DS    CL20     5   26   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13     6    2   13  A  P N             T        Y              
CATCODEH DS    CL8                                                              
CATCODE  DS    CL2      6   16    2  A  U N             T        Y   42         
CATCODEX DS    CL8                                                              
CATCNAMH DS    CL8                                                              
CATCNAM  DS    CL20     6   26   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      6   66    6  A  P N             T        Y              
CATSCRLH DS    CL8                                                              
CATSCRL  DS    CL2      6   73    2  A  U N             T        Y   50         
CATSCRLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL36     8    2   36  A  P N             T        Y              
CATSELH  DS    CL8                                                              
CATSEL   DS    CL2      9    2    2  A  U N             T        Y   32         
CATSELX  DS    CL8                                                              
CATWRKH  DS    CL8                                                              
CATWRK   DS    CL3      9    8    3  A  P N             T        Y              
CATDESCH DS    CL8                                                              
CATDESC  DS    CL15     9   15   15  L  U N             T        Y   52         
CATDESCX DS    CL8                                                              
CATCALCH DS    CL8                                                              
CATCALC  DS    CL4      9   34    4  A  U N             T        Y   54         
CATCALCX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     10    2    2  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     10    8    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    10   15   15  L  U N             T        Y   52         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     10   34    4  A  U N             T        Y   42         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     11    2    2  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     11    8    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    11   15   15  L  U N             T        Y   52         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     11   34    4  A  U N             T        Y   42         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     12    2    2  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     12    8    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    12   15   15  L  U N             T        Y   52         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     12   34    4  A  U N             T        Y   42         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     13    2    2  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     13    8    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    13   15   15  L  U N             T        Y   52         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     13   34    4  A  U N             T        Y   42         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     14    2    2  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     14    8    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    14   15   15  L  U N             T        Y   52         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     14   34    4  A  U N             T        Y   42         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     15    2    2  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     15    8    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    15   15   15  L  U N             T        Y   52         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     15   34    4  A  U N             T        Y   42         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     16    8    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    16   15   15  L  U N             T        Y   52         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     16   34    4  A  U N             T        Y   42         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     17    2    2  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     17    8    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    17   15   15  L  U N             T        Y   52         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     17   34    4  A  U N             T        Y   42         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     18    2    2  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     18    8    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    18   15   15  L  U N             T        Y   52         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     18   34    4  A  U N             T        Y   42         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     19    2    2  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     19    8    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    19   15   15  L  U N             T        Y   52         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     19   34    4  A  U N             T        Y   42         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     20    2    2  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     20    8    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    20   15   15  L  U N             T        Y   52         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     20   34    4  A  U N             T        Y   42         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     21    2    2  A  U N             T        Y   32         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     21    8    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    21   15   15  L  U N             T        Y   52         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     21   34    4  A  U N             T        Y   42         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    22    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P H             T        Y              
CATLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CATWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1520 BYTES                            
