*          DATA SET ACPRODICTD AT LEVEL 027 AS OF 07/01/20                      
* DSECT TO COVER OPTIONS DICTIONARY                                             
*                                                                               
DSDICT   DS    0C                                                               
*                                                                               
AC@OP01M DS    CL3                                                              
AC@OP01C DS    CL8                                                              
AC@OP01S DS    CL27                                                             
AC@OP02M DS    CL3                                                              
AC@OP02C DS    CL8                                                              
AC@OP02S DS    CL27                                                             
AC@OP03M DS    CL3                                                              
AC@OP03C DS    CL8                                                              
AC@OP03S DS    CL27                                                             
AC@OP04M DS    CL3                                                              
AC@OP04C DS    CL8                                                              
AC@OP04S DS    CL27                                                             
AC@OP05M DS    CL3                                                              
AC@OP05C DS    CL8                                                              
AC@OP05S DS    CL27                                                             
AC@OP06M DS    CL3                                                              
AC@OP06C DS    CL8                                                              
AC@OP06S DS    CL27                                                             
AC@OP07M DS    CL3                                                              
AC@OP07C DS    CL8                                                              
AC@OP07S DS    CL27                                                             
AC@OP08M DS    CL3                                                              
AC@OP08C DS    CL8                                                              
AC@OP08S DS    CL27                                                             
AC@OP09M DS    CL3                                                              
AC@OP09C DS    CL8                                                              
AC@OP09S DS    CL27                                                             
AC@OP10M DS    CL3                                                              
AC@OP10C DS    CL8                                                              
AC@OP10S DS    CL27                                                             
AC@OP11M DS    CL3                                                              
AC@OP11C DS    CL8                                                              
AC@OP11S DS    CL27                                                             
AC@OP12M DS    CL3                                                              
AC@OP12C DS    CL8                                                              
AC@OP12S DS    CL27                                                             
AC@OP13M DS    CL3                                                              
AC@OP13C DS    CL8                                                              
AC@OP13S DS    CL27                                                             
AC@OP14M DS    CL3                                                              
AC@OP14C DS    CL8                                                              
AC@OP14S DS    CL27                                                             
AC@OP15M DS    CL3                                                              
AC@OP15C DS    CL8                                                              
AC@OP15S DS    CL27                                                             
AC@OP16M DS    CL3                                                              
AC@OP16C DS    CL8                                                              
AC@OP16S DS    CL27                                                             
AC@OP17M DS    CL3                                                              
AC@OP17C DS    CL8                                                              
AC@OP17S DS    CL27                                                             
AC@OP18M DS    CL3                                                              
AC@OP18C DS    CL8                                                              
AC@OP18S DS    CL27                                                             
AC@OP19M DS    CL3                                                              
AC@OP19C DS    CL8                                                              
AC@OP19S DS    CL27                                                             
AC@OP20M DS    CL3                                                              
AC@OP20C DS    CL8                                                              
AC@OP20S DS    CL27                                                             
AC@OP21M DS    CL3                                                              
AC@OP21C DS    CL8                                                              
AC@OP21S DS    CL27                                                             
AC@OP22M DS    CL3                                                              
AC@OP22C DS    CL8                                                              
AC@OP22S DS    CL27                                                             
AC@OP23M DS    CL3                                                              
AC@OP23C DS    CL8                                                              
AC@OP23S DS    CL27                                                             
AC@OP24M DS    CL3                                                              
AC@OP24C DS    CL8                                                              
AC@OP24S DS    CL27                                                             
AC@OP25M DS    CL3                                                              
AC@OP25C DS    CL8                                                              
AC@OP25S DS    CL27                                                             
AC@OP26M DS    CL3                                                              
AC@OP26C DS    CL8                                                              
AC@OP26S DS    CL27                                                             
AC@OP27M DS    CL3                                                              
AC@OP27C DS    CL8                                                              
AC@OP27S DS    CL27                                                             
AC@OP28M DS    CL3                                                              
AC@OP28C DS    CL8                                                              
AC@OP28S DS    CL27                                                             
AC@OP29M DS    CL3                                                              
AC@OP29C DS    CL8                                                              
AC@OP29S DS    CL27                                                             
AC@OP30M DS    CL3                                                              
AC@OP30C DS    CL8                                                              
AC@OP30S DS    CL27                                                             
*                                                                               
AC@OP31M DS    CL3                                                              
AC@OP31C DS    CL8                                                              
AC@OP31S DS    CL27                                                             
AC@OP32M DS    CL3                                                              
AC@OP32C DS    CL8                                                              
AC@OP32S DS    CL27                                                             
AC@OP33M DS    CL3                                                              
AC@OP33C DS    CL8                                                              
AC@OP33S DS    CL27                                                             
AC@OP34M DS    CL3                                                              
AC@OP34C DS    CL8                                                              
AC@OP34S DS    CL27                                                             
*                                                                               
AC@OP40M DS    CL3                                                              
AC@OP40C DS    CL8                                                              
AC@OP40S DS    CL27                                                             
AC@OP41M DS    CL3                                                              
AC@OP41C DS    CL8                                                              
AC@OP41S DS    CL27                                                             
AC@OP42M DS    CL3                                                              
AC@OP42C DS    CL8                                                              
AC@OP42S DS    CL27                                                             
AC@OP43M DS    CL3                                                              
AC@OP43C DS    CL8                                                              
AC@OP43S DS    CL27                                                             
AC@OP44M DS    CL3                                                              
AC@OP44C DS    CL8                                                              
AC@OP44S DS    CL27                                                             
AC@OP45M DS    CL3                                                              
AC@OP45C DS    CL8                                                              
AC@OP45S DS    CL27                                                             
*                                                                               
AC@OP50M DS    CL3                                                              
AC@OP50C DS    CL8                                                              
AC@OP50S DS    CL27                                                             
AC@OP51M DS    CL3                                                              
AC@OP51C DS    CL8                                                              
AC@OP51S DS    CL27                                                             
AC@OP52M DS    CL3                                                              
AC@OP52C DS    CL8                                                              
AC@OP52S DS    CL27                                                             
AC@OP53M DS    CL3                                                              
AC@OP53C DS    CL8                                                              
AC@OP53S DS    CL27                                                             
AC@OP54M DS    CL3                                                              
AC@OP54C DS    CL8                                                              
AC@OP54S DS    CL27                                                             
AC@OP55M DS    CL3                                                              
AC@OP55C DS    CL8                                                              
AC@OP55S DS    CL27                                                             
AC@OP56M DS    CL3                                                              
AC@OP56C DS    CL8                                                              
AC@OP56S DS    CL27                                                             
AC@OP57M DS    CL3                                                              
AC@OP57C DS    CL8                                                              
AC@OP57S DS    CL27                                                             
*                                                                               
AC@OP60M DS    CL3                                                              
AC@OP60C DS    CL8                                                              
AC@OP60S DS    CL27                                                             
AC@OP61M DS    CL3                                                              
AC@OP61C DS    CL8                                                              
AC@OP61S DS    CL27                                                             
*                                                                               
AC@OP62M DS    CL3                 INQ                                          
AC@OP62C DS    CL8                 COLLIST                                      
AC@OP62S DS    CL27                COLUMN LIST FOR JOB INQUIRY                  
*                                                                               
AC@OP63M DS    CL3                 AUT                                          
AC@OP63C DS    CL8                 AUT BILL                                     
AC@OP63S DS    CL27                NARRATIVE CODE AUTO BILLING                  
*                                                                               
AC@OP81M DS    CL3                 DSC                                          
AC@OP81C DS    CL8                 DATESCH                                      
AC@OP81S DS    CL27                DATE SCHEME CODE                             
*                                                                               
AC@OP46M DS    CL3                 ADP                                          
AC@OP46C DS    CL8                 ADDP                                         
AC@OP46S DS    CL27                ADD P'S (1-9) AT JOB ADD                     
*                                                                               
AC@OP47M DS    CL3                 ADR                                          
AC@OP47C DS    CL8                 ADDR                                         
AC@OP47S DS    CL27                ADD R1 WHEN ADDING JOB                       
*                                                                               
AC@OP48M DS    CL3                 ER                                           
AC@OP48C DS    CL8                 ESTREP                                       
AC@OP48S DS    CL27                ESTIMATE REPORT DEFAULT                      
*                                                                               
AC@OP82M DS    CL3                 OPNPNET                                      
AC@OP82C DS    CL8                                                              
AC@OP82S DS    CL27                                                             
*                                                                               
AC@OP83M DS    CL3                 OPNPROV                                      
AC@OP83C DS    CL8                                                              
AC@OP83S DS    CL27                                                             
*                                                                               
AC@OP84M DS    CL3                 OPNBENG                                      
AC@OP84C DS    CL8                                                              
AC@OP84S DS    CL27                                                             
*                                                                               
AC@OP85M DS    CL3                 OPNBKSV                                      
AC@OP85C DS    CL8                                                              
AC@OP85S DS    CL27                                                             
*                                                                               
AC@OP64M DS    CL3                 OPNJSUM                                      
AC@OP64C DS    CL8                                                              
AC@OP64S DS    CL27                                                             
*                                                                               
AC@OP65M DS    CL3                 OPNJSUM2                                     
AC@OP65C DS    CL8                                                              
AC@OP65S DS    CL27                                                             
*                                                                               
AC@OP86M DS    CL3                 OPNIDUE                                      
AC@OP86C DS    CL8                                                              
AC@OP86S DS    CL27                                                             
*                                                                               
AC@O190M DS    CL3                 OPNBTIP                                      
AC@O190C DS    CL8                                                              
AC@O190S DS    CL27                                                             
*                                                                               
AC@O191M DS    CL3                 OPNBSTP                                      
AC@O191C DS    CL8                                                              
AC@O191S DS    CL27                                                             
*                                                                               
AC@O192M DS    CL3                 OPNBHDP                                      
AC@O192C DS    CL8                                                              
AC@O192S DS    CL27                                                             
*                                                                               
AC@O193M DS    CL3                 OPNBSHP                                      
AC@O193C DS    CL8                                                              
AC@O193S DS    CL27                                                             
*                                                                               
AC@O194M DS    CL3                 OPNBFTP                                      
AC@O194C DS    CL8                                                              
AC@O194S DS    CL27                                                             
*                                                                               
AC@O195M DS    CL3                 OPNBSTP                                      
AC@O195C DS    CL8                                                              
AC@O195S DS    CL27                                                             
*                                                                               
AC@O220M DS    CL3                 OPNBFMT                                      
AC@O220C DS    CL8                                                              
AC@O220S DS    CL27                                                             
*                                                                               
AC@O221M DS    CL3                 OPNBLCUR                                     
AC@O221C DS    CL8                                                              
AC@O221S DS    CL27                                                             
*                                                                               
AC@O222M DS    CL3                 OPNSRGNM                                     
AC@O222C DS    CL8                                                              
AC@O222S DS    CL27                                                             
*                                                                               
AC@O223M DS    CL3                 OPNDSCNM                                     
AC@O223C DS    CL8                                                              
AC@O223S DS    CL27                                                             
*                                                                               
AC@O224M DS    CL3                 OPNINCAC                                     
AC@O224C DS    CL8                                                              
AC@O224S DS    CL27                                                             
*                                                                               
AC@O225M DS    CL3                 OPNEXTAC                                     
AC@O225C DS    CL8                                                              
AC@O225S DS    CL27                                                             
*                                                                               
AC@O226M DS    CL3                 OPNEXOAC                                     
AC@O226C DS    CL8                                                              
AC@O226S DS    CL27                                                             
*                                                                               
AC@O227M DS    CL3                 OPNWOTAC                                     
AC@O227C DS    CL8                                                              
AC@O227S DS    CL27                                                             
*                                                                               
AC@O228M DS    CL3                 OPNWOOAC                                     
AC@O228C DS    CL8                                                              
AC@O228S DS    CL27                                                             
*                                                                               
AC@O229M DS    CL3                 OPNSRGAC                                     
AC@O229C DS    CL8                                                              
AC@O229S DS    CL27                                                             
*                                                                               
AC@O230M DS    CL3                 OPNDSCAC                                     
AC@O230C DS    CL8                                                              
AC@O230S DS    CL27                                                             
*                                                                               
AC@O231M DS    CL3                 OPNSRGPT                                     
AC@O231C DS    CL8                                                              
AC@O231S DS    CL27                                                             
*                                                                               
AC@O232M DS    CL3                 OPNDSCPT                                     
AC@O232C DS    CL8                                                              
AC@O232S DS    CL27                                                             
*                                                                               
AC@OP66M DS    CL3                 OPNCBALL                                     
AC@OP66C DS    CL8                                                              
AC@OP66S DS    CL27                                                             
*                                                                               
AC@OP67M DS    CL3                 OPNCBWOF                                     
AC@OP67C DS    CL8                                                              
AC@OP67S DS    CL27                                                             
*                                                                               
AC@OP68M DS    CL3                 OPNCBREV                                     
AC@OP68C DS    CL8                                                              
AC@OP68S DS    CL27                                                             
*                                                                               
AC@OP69M DS    CL3                 OPNCBRVL                                     
AC@OP69C DS    CL8                                                              
AC@OP69S DS    CL27                                                             
*                                                                               
AC@OP70M DS    CL3                 OPNCBXFR                                     
AC@OP70C DS    CL8                                                              
AC@OP70S DS    CL27                                                             
*                                                                               
AC@OP71M DS    CL3                 OPNCBMTC                                     
AC@OP71C DS    CL8                                                              
AC@OP71S DS    CL27                                                             
*                                                                               
AC@OP72M DS    CL3                 OPNCBINV                                     
AC@OP72C DS    CL8                                                              
AC@OP72S DS    CL27                                                             
*                                                                               
AC@OP73M DS    CL3                 OPNCBAAU                                     
AC@OP73C DS    CL8                                                              
AC@OP73S DS    CL27                                                             
*                                                                               
AC@OP74M DS    CL3                 OPNCBSUM                                     
AC@OP74C DS    CL8                                                              
AC@OP74S DS    CL27                                                             
*                                                                               
AC@OP75M DS    CL3                 OPNCBRCV                                     
AC@OP75C DS    CL8                                                              
AC@OP75S DS    CL27                                                             
*                                                                               
AC@OP76M DS    CL3                 OPNCBLST                                     
AC@OP76C DS    CL8                                                              
AC@OP76S DS    CL27                                                             
*                                                                               
AC@OP77M DS    CL3                 OPNCBFMT                                     
AC@OP77C DS    CL8                                                              
AC@OP77S DS    CL27                                                             
*                                                                               
AC@OP78M DS    CL3                 OPNCBPRV                                     
AC@OP78C DS    CL8                                                              
AC@OP78S DS    CL27                                                             
*                                                                               
AC@OP87M DS    CL3                 OPNTIME                                      
AC@OP87C DS    CL8                                                              
AC@OP87S DS    CL27                                                             
*                                                                               
AC@O233M DS    CL3                 OPNWUTAC                                     
AC@O233C DS    CL8                                                              
AC@O233S DS    CL27                                                             
*                                                                               
AC@O234M DS    CL3                 OPNWUCAC                                     
AC@O234C DS    CL8                                                              
AC@O234S DS    CL27                                                             
*                                                                               
AC@OP79M DS    CL3                 OPNCBJLI                                     
AC@OP79C DS    CL8                                                              
AC@OP79S DS    CL27                                                             
*                                                                               
AC@O171M DS    CL3                 OPNTOT                                       
AC@O171C DS    CL8                                                              
AC@O171S DS    CL27                                                             
*                                                                               
AC@O135M DS    CL3                 OPNBN21                                      
AC@O135C DS    CL8                                                              
AC@O135S DS    CL27                                                             
*                                                                               
AC@O172M DS    CL3                 OPNFPT                                       
AC@O172C DS    CL8                                                              
AC@O172S DS    CL27                                                             
*                                                                               
AC@O173M DS    CL3                 OPNFJT                                       
AC@O173C DS    CL8                                                              
AC@O173S DS    CL27                                                             
*                                                                               
AC@O236M DS    CL3                 OPTPFC                                       
AC@O236C DS    CL8                                                              
AC@O236S DS    CL27                                                             
*                                                                               
AC@O158M DS    CL3                 OPTAMP                                       
AC@O158C DS    CL8                                                              
AC@O158S DS    CL27                                                             
*                                                                               
AC@O159M DS    CL3                 OPTESP                                       
AC@O159C DS    CL8                                                              
AC@O159S DS    CL27                                                             
*                                                                               
AC@O237M DS    CL3                 OPTTMS                                       
AC@O237C DS    CL8                                                              
AC@O237S DS    CL27                                                             
*                                                                               
AC@OP35M DS    CL3                 OPNEEDT                                      
AC@OP35C DS    CL8                                                              
AC@OP35S DS    CL27                                                             
