*          DATA SET ACPROD8D   AT LEVEL 004 AS OF 09/07/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BD8D      DATE 09/07/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     6    2   11  A   P    N         T        Y              
PROMGRH  DS    CL8                                                              
PROMGR   DS    CL1      6   20    1  A   U    N         T    I   Y    6         
PROMGRX  DS    CL8                                                              
PROMGRNH DS    CL8                                                              
PROMGRN  DS    CL20     6   38   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      7    2    1  A   P    N         T        Y              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 80   BYTES                            
