*          DATA SET ACPROC4D   AT LEVEL 003 AS OF 09/12/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BC4D      DATE 09/12/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      6    2    4  A   P    H         T        Y              
PROCODEH DS    CL8                                                              
PROCODE  DS    CL4      6   10    4  A   U    N         T    I   Y   44         
PROCODEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6   20    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      8    2    4  A   P    H         T        Y              
PRONAMEH DS    CL8                                                              
PRONAME  DS    CL20     8   10   20  A   U    N         T        Y   50         
PRONAMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    24    2   78  A   P    H         T        Y              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 184  BYTES                            
