*          DATA SET ACPROB7D   AT LEVEL 021 AS OF 09/26/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BB7D      DATE 09/26/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P N             T        Y              
PROCLIH  DS    CL8                                                              
PROCLI   DS    CL6      5   10    6  A  U N             T    I   Y   16         
PROCLIX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   20    7  A  P N             T        Y              
PROPROH  DS    CL8                                                              
PROPRO   DS    CL6      5   28    6  A  U N             T        Y   18         
PROPROX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      5   38    3  A  P N             T        Y              
PROJOBH  DS    CL8                                                              
PROJOB   DS    CL6      5   42    6  A  U N             T        Y   20         
PROJOBX  DS    CL8                                                              
PROJNMH  DS    CL8                                                              
PROJNM   DS    CL30     5   49   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
PROCOLH  DS    CL8                                                              
PROCOL   DS    CL25     6   10   25  A  U N             T        Y   52         
PROCOLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   38    7  A  P N             T        Y              
PROOPTH  DS    CL8                                                              
PROOPT   DS    CL33     6   46   33  A  U N             T        Y   50         
PROOPTX  DS    CL8                                                              
PRONOTEH DS    CL8                                                              
PRONOTE  DS    CL21     7    2   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     7   26   11  A  P H             T        Y              
PRONBLH  DS    CL8                                                              
PRONBL   DS    CL10     7   38   10  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13     7   49   13  A  P H             T        Y              
PROGBLH  DS    CL8                                                              
PROGBL   DS    CL10     7   63   10  A  P N             T        Y              
PROTITH  DS    CL8                                                              
PROTIT   DS    CL9      8    2    9  A  P N             T        Y              
PROHEADH DS    CL8                                                              
PROHEAD  DS    CL65     8   16   65  A  P N             T        Y              
PROSFH   DS    CL8                                                              
PROSF    DS    CL1      9    2    1  A  U N             T        Y   32         
PROSFX   DS    CL8                                                              
PRODFH   DS    CL8                                                              
PRODF    DS    CL77     9    4   77  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     10    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL77    10    4   77  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     11    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL77    11    4   77  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL77    12    4   77  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     13    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL77    13    4   77  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL77    14    4   77  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL77    15    4   77  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL77    16    4   77  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL77    17    4   77  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     18    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL77    18    4   77  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL77    19    4   77  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL77    20    4   77  A  P N             T        Y              
PROSLH   DS    CL8                                                              
PROSL    DS    CL1     21    2    1  A  U N             T        Y              
PRODLH   DS    CL8                                                              
PRODL    DS    CL77    21    4   77  A  P N             T        Y              
PROJOBTH DS    CL8                                                              
PROJOBT  DS    CL11    22    2   11  A  P H             T        Y              
PROTOTH  DS    CL8                                                              
PROTOT   DS    CL65    22   16   65  A  P H             T        Y              
PROPF1H  DS    CL8                                                              
PROPF1   DS    CL78    23    2   78  A  P H             T        Y              
PROPF2H  DS    CL8                                                              
PROPF2   DS    CL78    24    2   78  A  P H             T        Y              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1960 BYTES                            
