*          DATA SET ACPROA4D   AT LEVEL 001 AS OF 08/28/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BA4D      DATE 08/28/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL12     4   16   12  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL36     4   29   36  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL15     4   66   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      5    2    6  L  P H             T        Y              
CL2SJACH DS    CL8                                                              
CL2SJAC  DS    CL6      5   16    6  A  U N             T        Y   16         
CL2SJACX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   27    1  L  P N             T        Y              
CL2SJNMH DS    CL8                                                              
CL2SJNM  DS    CL36     5   29   36  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL13     9    2   13  L  P N             T        Y              
CL2VRNH  DS    CL8                                                              
CL2VRN   DS    CL18     9   16   18  A  U N             T        Y   40         
CL2VRNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    10    2   13  L  P N             T        Y              
CL2LIMH  DS    CL8                                                              
CL2LIM   DS    CL13    10   16   13  A  U N             T        Y   41         
CL2LIMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    11    2   13  L  P N             T        Y              
CL2PBILH DS    CL8                                                              
CL2PBIL  DS    CL49    11   16   49  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    12    2   13  L  P N             T        Y              
CL2HED1H DS    CL8                                                              
CL2HED1  DS    CL50    12   16   50  L  U N             T        Y              
CL2HED2H DS    CL8                                                              
CL2HED2  DS    CL50    13   16   50  L  U N             T        Y              
CL2HED3H DS    CL8                                                              
CL2HED3  DS    CL50    14   16   50  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    15    2   13  L  P N             T        Y              
CL2MCONH DS    CL8                                                              
CL2MCON  DS    CL60    15   16   60  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    17    2   13  L  P N             T        Y              
CL2TELEH DS    CL8                                                              
CL2TELE  DS    CL26    17   16   26  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    19    2   13  L  P N             T        Y              
CL2FAXH  DS    CL8                                                              
CL2FAX   DS    CL26    19   16   26  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    21    2   13  L  P N             T        Y              
CL2COM1H DS    CL8                                                              
CL2COM1  DS    CL60    21   16   60  A  U N             T        Y              
CL2COM2H DS    CL8                                                              
CL2COM2  DS    CL60    22   16   60  A  U N             T        Y              
CL2COM3H DS    CL8                                                              
CL2COM3  DS    CL60    23   16   60  A  U N             T        Y              
CL2PFAH  DS    CL8                                                              
CL2PFA   DS    CL78    24    2   78  A  P H             T        Y              
CL2LAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CL2WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1072 BYTES                            
