*          DATA SET ACPROB3D   AT LEVEL 016 AS OF 04/04/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BB3D      DATE 04/04/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL12     6    2   12  A  P N             T        Y              
RPTOFGH  DS    CL8                                                              
RPTOFG   DS    CL1      6   15    1  A  U N             T    I   Y    2         
RPTOFGX  DS    CL8                                                              
RPTOFGNH DS    CL8                                                              
RPTOFGN  DS    CL36     6   25   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
RPTOFFH  DS    CL8                                                              
RPTOFF   DS    CL2      7   15    2  A  U N             T        Y    4         
RPTOFFX  DS    CL8                                                              
RPTOFFNH DS    CL8                                                              
RPTOFFN  DS    CL36     7   25   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
RPTCLIH  DS    CL8                                                              
RPTCLI   DS    CL6      8   15    6  A  U N             T        Y   16         
RPTCLIX  DS    CL8                                                              
RPTCLINH DS    CL8                                                              
RPTCLIN  DS    CL36     8   25   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
RPTPROH  DS    CL8                                                              
RPTPRO   DS    CL6      9   15    6  A  U N             T        Y   18         
RPTPROX  DS    CL8                                                              
RPTPRONH DS    CL8                                                              
RPTPRON  DS    CL36     9   25   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A  P N             T        Y              
RPTJOBH  DS    CL8                                                              
RPTJOB   DS    CL6     10   15    6  A  U N             T        Y   20         
RPTJOBX  DS    CL8                                                              
RPTJOBNH DS    CL8                                                              
RPTJOBN  DS    CL36    10   25   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
RPTMGPH  DS    CL8                                                              
RPTMGP   DS    CL1     11   15    1  A  U N             T        Y    0         
RPTMGPX  DS    CL8                                                              
RPTMGPNH DS    CL8                                                              
RPTMGPN  DS    CL36    11   25   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     12    2    5  A  P N             T        Y              
RPTMEDH  DS    CL8                                                              
RPTMED   DS    CL1     12   15    1  A  U N             T        Y    0         
RPTMEDX  DS    CL8                                                              
RPTMEDNH DS    CL8                                                              
RPTMEDN  DS    CL15    12   25   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    13    2   11  A  P N             T        Y              
RPTSTUH  DS    CL8                                                              
RPTSTU   DS    CL4     13   15    4  A  U N             T        Y    0         
RPTSTUX  DS    CL8                                                              
RPTSTUNH DS    CL8                                                              
RPTSTUN  DS    CL36    13   25   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14    2    6  A  P N             T        Y              
RPTFIL1H DS    CL8                                                              
RPTFIL1  DS    CL2     14   15    2  A  U H             T        Y    0         
RPTFIL1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14   30    6  A  P N             T        Y              
RPTFIL2H DS    CL8                                                              
RPTFIL2  DS    CL2     14   40    2  A  U H             T        Y    0         
RPTFIL2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14   48    6  A  P N             T        Y              
RPTFIL3H DS    CL8                                                              
RPTFIL3  DS    CL2     14   58    2  A  U H             T        Y    0         
RPTFIL3X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     15    2    6  A  P N             T        Y              
RPTFIL4H DS    CL8                                                              
RPTFIL4  DS    CL2     15   15    2  A  U H             T        Y    0         
RPTFIL4X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     15   30    6  A  P N             T        Y              
RPTFIL5H DS    CL8                                                              
RPTFIL5  DS    CL2     15   40    2  A  U H             T        Y    0         
RPTFIL5X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     16    2    6  A  P N             T        Y              
RPTSRTH  DS    CL8                                                              
RPTSRT   DS    CL1     16   27    1  A  U N             T        Y    0         
RPTSRTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL44    16   30   44  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL23    17    2   23  A  P N             T        Y              
RPTJNLH  DS    CL8                                                              
RPTJNL   DS    CL1     17   27    1  A  U N             T        Y    0         
RPTJNLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL29    17   30   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL22    18    2   22  A  P N             T        Y              
RPTNOCH  DS    CL8                                                              
RPTNOC   DS    CL1     18   27    1  A  U N             T        Y    0         
RPTNOCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL35    18   30   35  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL21    19    2   21  A  P N             T        Y              
RPTNOCJH DS    CL8                                                              
RPTNOCJ  DS    CL1     19   27    1  A  U N             T        Y    0         
RPTNOCJX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL32    19   30   32  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20    2    1  A  P N             T        Y              
RPTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
RPTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1136 BYTES                            
