*          DATA SET ACPROD4D   AT LEVEL 010 AS OF 09/20/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BD4D      DATE 09/20/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
PROOGRH  DS    CL8                                                              
PROOGR   DS    CL1      6   10    1  A   U    N         T    I   Y    2         
PROOGRX  DS    CL8                                                              
PROOGRNH DS    CL8                                                              
PROOGRN  DS    CL36     6   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
PROOFFH  DS    CL8                                                              
PROOFF   DS    CL2      7   10    2  A   U    N         T        Y    4         
PROOFFX  DS    CL8                                                              
PROOFFNH DS    CL8                                                              
PROOFFN  DS    CL36     7   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
PROCLIH  DS    CL8                                                              
PROCLI   DS    CL6      8   10    6  A   U    N         T        Y   16         
PROCLIX  DS    CL8                                                              
PROCLINH DS    CL8                                                              
PROCLIN  DS    CL36     8   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    N         T        Y              
PROPROH  DS    CL8                                                              
PROPRO   DS    CL6      9   10    6  A   U    N         T        Y   18         
PROPROX  DS    CL8                                                              
PROPRONH DS    CL8                                                              
PROPRON  DS    CL36     9   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    N         T        Y              
PROJOBH  DS    CL8                                                              
PROJOB   DS    CL6     10   10    6  A   U    N         T        Y   20         
PROJOBX  DS    CL8                                                              
PROJOBNH DS    CL8                                                              
PROJOBN  DS    CL36    10   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A   P    N         T        Y              
PRORULEH DS    CL8                                                              
PRORULE  DS    CL1     11   10    1  A   U    N         T        Y   50         
PRORULEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL36    11   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12    2    7  A   P    N         T        Y              
PROTITH  DS    CL8                                                              
PROTIT   DS    CL32    12   10   32  A   U    N         T        Y   52         
PROTITX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13    2    1  A   P    N         T        Y              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 552  BYTES                            
