*          DATA SET ACPROD6D   AT LEVEL 007 AS OF 09/26/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BD6D      DATE 09/26/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
PROCLIH  DS    CL8                                                              
PROCLI   DS    CL8      6   10    8  A   U    N         T    I   Y   16         
PROCLIX  DS    CL8                                                              
PROCLINH DS    CL8                                                              
PROCLIN  DS    CL36     6   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
PROPROH  DS    CL8                                                              
PROPRO   DS    CL8      7   10    8  A   U    N         T        Y   18         
PROPROX  DS    CL8                                                              
PROPRONH DS    CL8                                                              
PROPRON  DS    CL36     7   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
PROJOBH  DS    CL8                                                              
PROJOB   DS    CL8      8   10    8  A   U    N         T        Y   20         
PROJOBX  DS    CL8                                                              
PROJOBNH DS    CL8                                                              
PROJOBN  DS    CL36     8   20   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5     10    2    5  A   P    N         T        Y              
PROTITH  DS    CL8                                                              
PROTIT   DS    CL32    10   10   32  A   U    N         T        Y   50         
PROTITX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     11    2    2  A   P    N         T        Y              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 328  BYTES                            
