*          DATA SET ACPROD5D   AT LEVEL 014 AS OF 04/02/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BD5D      DATE 04/02/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
PROOGRH  DS    CL8                                                              
PROOGR   DS    CL3      6   20    3  A  U N             T    I   Y    2         
PROOGRX  DS    CL8                                                              
PROOGNH  DS    CL8                                                              
PROOGN   DS    CL36     6   36   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
PROOFFH  DS    CL8                                                              
PROOFF   DS    CL2      7   20    2  A  U N             T        Y    4         
PROOFFX  DS    CL8                                                              
PROOFFNH DS    CL8                                                              
PROOFFN  DS    CL36     7   36   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      8    2    6  A  P N             T        Y              
PROCLIH  DS    CL8                                                              
PROCLI   DS    CL6      8   20    6  A  U N             T        Y   16         
PROCLIX  DS    CL8                                                              
PROCLINH DS    CL8                                                              
PROCLIN  DS    CL36     8   36   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
PROPROH  DS    CL8                                                              
PROPRO   DS    CL6      9   20    6  A  U N             T        Y   18         
PROPROX  DS    CL8                                                              
PROPRONH DS    CL8                                                              
PROPRON  DS    CL36     9   36   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  P N             T        Y              
PROJOBH  DS    CL8                                                              
PROJOB   DS    CL6     10   20    6  A  U N             T        Y   20         
PROJOBX  DS    CL8                                                              
PROJOBNH DS    CL8                                                              
PROJOBN  DS    CL36    10   36   36  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
PROMGRH  DS    CL8                                                              
PROMGR   DS    CL1     11   20    1  A  U N             T        Y    6         
PROMGRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     11   36    6  A  P N             T        Y              
PROMEDH  DS    CL8                                                              
PROMED   DS    CL1     11   51    1  A  U N             T        Y    8         
PROMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    12    2   12  A  P N             T        Y              
PROBGRH  DS    CL8                                                              
PROBGR   DS    CL4     12   20    4  A  U N             T        Y   52         
PROBGRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     12   36    9  A  P N             T        Y              
PROBTYPH DS    CL8                                                              
PROBTYP  DS    CL13    12   51   13  A  U N             T        Y   54         
PROBTYPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     13    2    6  A  P N             T        Y              
PROFIL1H DS    CL8                                                              
PROFIL1  DS    CL4     13   20    4  A  U H             T        Y   55         
PROFIL1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     13   36    6  A  P N             T        Y              
PROFIL2H DS    CL8                                                              
PROFIL2  DS    CL2     13   51    2  A  U H             T        Y   56         
PROFIL2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     13   56    6  A  P N             T        Y              
PROFIL3H DS    CL8                                                              
PROFIL3  DS    CL2     13   70    2  A  U H             T        Y   57         
PROFIL3X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14    2    6  A  P N             T        Y              
PROFIL4H DS    CL8                                                              
PROFIL4  DS    CL4     14   20    4  A  U H             T        Y   58         
PROFIL4X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     14   36    6  A  P N             T        Y              
PROFIL5H DS    CL8                                                              
PROFIL5  DS    CL2     14   51    2  A  U H             T        Y   59         
PROFIL5X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    14   56   12  A  P N             T        Y              
PROCLOSH DS    CL8                                                              
PROCLOS  DS    CL1     14   70    1  A  U N             T        Y   60         
PROCLOSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     16    2    8  A  P N             T        Y              
PROPREPH DS    CL8                                                              
PROPREP  DS    CL8     16   20    8  A  U N             T        Y   62         
PROPREPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11    16   36   11  A  P N             T        Y              
PROAPBYH DS    CL8                                                              
PROAPBY  DS    CL8     16   51    8  A  U N             T        Y   64         
PROAPBYX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    17    2   13  A  P N             T        Y              
PROETYH  DS    CL8                                                              
PROETY   DS    CL1     17   20    1  A  U N             T        Y   66         
PROETYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL31    17   36   31  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    18    2   15  A  P N             T        Y              
PROAPFIH DS    CL8                                                              
PROAPFI  DS    CL1     18   20    1  A  U N             T        Y   68         
PROAPFIX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL33    18   36   33  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    20    2   14  A  P N             T        Y              
PROJOSH  DS    CL8                                                              
PROJOS   DS    CL8     20   20    8  A  U N             T        Y   70         
PROJOSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    20   36   12  A  P N             T        Y              
PROJOEH  DS    CL8                                                              
PROJOE   DS    CL8     20   51    8  A  U N             T        Y   72         
PROJOEX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13    21    2   13  A  P N             T        Y              
PROEASH  DS    CL8                                                              
PROEAS   DS    CL8     21   20    8  A  U N             T        Y   74         
PROEASX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    21   36   12  A  P N             T        Y              
PROEAEH  DS    CL8                                                              
PROEAE   DS    CL8     21   51    8  A  U N             T        Y   76         
PROEAEX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    22    2   14  A  P N             T        Y              
PROACTSH DS    CL8                                                              
PROACTS  DS    CL8     22   20    8  A  U N             T        Y   78         
PROACTSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    22   36   12  A  P N             T        Y              
PROACTEH DS    CL8                                                              
PROACTE  DS    CL8     22   51    8  A  U N             T        Y   80         
PROACTEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    23    2   14  A  P N             T        Y              
PROPRSH  DS    CL8                                                              
PROPRS   DS    CL8     23   20    8  A  U N             T        Y   82         
PROPRSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    23   36   12  A  P N             T        Y              
PROPREH  DS    CL8                                                              
PROPRE   DS    CL8     23   51    8  A  U N             T        Y   84         
PROPREX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    24    2   14  A  P N             T        Y              
PROAPPSH DS    CL8                                                              
PROAPPS  DS    CL8     24   20    8  A  U N             T        Y   86         
PROAPPSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    24   36   12  A  P N             T        Y              
PROAPPEH DS    CL8                                                              
PROAPPE  DS    CL8     24   51    8  A  U N             T        Y   88         
PROAPPEX DS    CL8                                                              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1440 BYTES                            
