*          DATA SET ACPROADD   AT LEVEL 001 AS OF 08/28/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BADD      DATE 08/28/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  L  P N             T        Y              
ADVLSTAH DS    CL8                                                              
ADVLSTA  DS    CL5      5   10    5  A  U N             T        Y              
ADVLTITH DS    CL8                                                              
ADVLTIT  DS    CL79     7    2   79  A  P H             T        Y              
ADVLTAGH DS    CL8                                                              
ADVLTAG  DS    CL1      8    3    1  A  P N             T        Y              
ADVLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
ADVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 128  BYTES                            
