*          DATA SET ACPROCCD   AT LEVEL 006 AS OF 04/03/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BCCD      DATE 04/03/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL11     6    2   11  A  P H             T        Y              
PROSTUH  DS    XL8                                                              
PROSTU   DS    CL4      6   20    4  A  U H             T    I   Y    2         
PROSTUX  DS    XL8                                                              
PROLACTH DS    XL8                                                              
PROLACT  DS    CL40     6   38   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL1      6   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P H             T        Y              
PRODESCH DS    XL8                                                              
PRODESC  DS    CL36     7   20   36  A  U H             T        Y    4         
PRODESCX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     8    2   10  A  P H             T        Y              
PROVENH  DS    XL8                                                              
PROVEN   DS    CL14     8   20   14  A  U H             T        Y    6         
PROVENX  DS    XL8                                                              
PROVENNH DS    XL8                                                              
PROVENN  DS    CL36     8   38   36  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10     9    2   10  A  P N             T        Y              
PROMEDH  DS    XL8                                                              
PROMED   DS    CL1      9   20    1  A  U N             T        Y    8         
PROMEDX  DS    XL8                                                              
PROMEDNH DS    XL8                                                              
PROMEDN  DS    CL15     9   38   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    10    5   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL75    11    5   75  A  P N             T        Y              
PROOFFH  DS    XL8                                                              
PROOFF   DS    CL2     12    7    2  A  U N             T        Y   10         
PROOFFX  DS    XL8                                                              
PROCLNH  DS    XL8                                                              
PROCLN   DS    CL3     12   14    3  A  U N             T        Y   12         
PROCLNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     12   26    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     12   33    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     12   45    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     12   52    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     12   64    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     12   71    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     13    7    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13   14    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     13   26    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13   33    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     13   45    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13   52    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     13   64    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     13   71    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     14    7    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     14   14    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     14   26    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     14   33    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     14   45    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     14   52    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     14   64    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     14   71    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     15    7    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15   14    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     15   26    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15   33    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     15   45    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15   52    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     15   64    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     15   71    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     16    7    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     16   14    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     16   26    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     16   33    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     16   45    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     16   52    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     16   64    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     16   71    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     17    7    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17   14    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     17   26    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17   33    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     17   45    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17   52    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     17   64    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     17   71    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     18    7    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18   14    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     18   26    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18   33    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     18   45    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18   52    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     18   64    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     18   71    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     19    7    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19   14    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     19   26    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19   33    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     19   45    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19   52    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     19   64    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     19   71    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     20    7    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20   14    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     20   26    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20   33    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     20   45    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20   52    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     20   64    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     20   71    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     21    7    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21   14    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     21   26    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21   33    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     21   45    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21   52    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     21   64    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     21   71    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     22    7    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     22   14    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     22   26    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     22   33    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     22   45    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     22   52    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     22   64    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     22   71    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     23    7    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     23   14    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL2     23   26    2  A  U N             T        Y   10         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3     23   33    3  A  U N             T        Y   12         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL43    23   37   43  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y              
PROLAST  DS    XL1                                                              
         DS    XL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2328 BYTES                            
