*          DATA SET ACPRODED   AT LEVEL 016 AS OF 01/10/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60BDED      DATE 01/10/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL10     6    2   10  A  P N             T        Y              
PROWGRH  DS    CL8                                                              
PROWGR   DS    CL1      6   30    1  A  U N             T    I   Y   10         
PROWGRX  DS    CL8                                                              
PROWGRNH DS    CL8                                                              
PROWGRN  DS    CL20     6   38   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13     8    2   13  A  P N             T        Y              
PROSORTH DS    CL8                                                              
PROSORT  DS    CL1      8   30    1  A  U N             T        Y   50         
PROSORTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      8   35    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    10    2   15  A  P N             T        Y              
PROCOMH  DS    CL8                                                              
PROCOM   DS    CL1     10   30    1  A  U N             T        Y   52         
PROCOMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     10   35    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     12    2    5  A  P N             T        Y              
PROTYPH  DS    CL8                                                              
PROTYP   DS    CL1     12   30    1  A  U N             T        Y   54         
PROTYPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15    12   35   15  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14    2    6  A  P N             T        Y              
PROMEDH  DS    CL8                                                              
PROMED   DS    CL1     14   30    1  A  U N             T        Y   56         
PROMEDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     14   35    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     16    2    7  A  P N             T        Y              
PROSTAH  DS    CL8                                                              
PROSTA   DS    CL1     16   30    1  A  U N             T        Y   58         
PROSTAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     16   35    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12    18    2   12  A  P N             T        Y              
PROADJH  DS    CL8                                                              
PROADJ   DS    CL1     18   30    1  A  U N             T        Y   60         
PROADJX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     18   35    8  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19    2    1  A  P N             T        Y              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 392  BYTES                            
