*          DATA SET ACPRESTOD  AT LEVEL 077 AS OF 03/02/07                      
*                                                                               
***********************************************************************         
*        PRESTO MAD OBJECT DSECTS                                               
***********************************************************************         
ACPRESTD DSECT                     ACPRESTO INTERFACE BLOCK                     
ACPRREC  DS    A                   A(INPUT RECORD)                              
ACPROBJ  DS    A                   A(OUTPUT OBJECT BLOCK)                       
ACPRTYP  DS    X                   TYPE OF RECORD CONVERSION                    
ACPRERR  DS    X                                                                
ACPRLOAD DS    CL1                 Y=FULL FILE LOAD                             
ACPRSTA7 DS    XL1                 COMPANY STATUS BYTE 7                        
ACPRCOMF DS    A                   A(COMFACS)                                   
ACPRLCLI DS    X                   LENGTH OF PRODUCTION CLIENT CODE             
ACPRLPRO DS    X                   LENGTH OF PRODUCTION PRODUCT CODE            
ACPRLJOB DS    X                   LENGTH OF PRODUCTION JOB CODE                
ACPRCUR  DS    CL3                 PRIMARY CURRENCY CODE                        
ACPRCURS DS    CL3                 SECONDARY CURRENCY CODE                      
ACPRLOFF DS    X                   1R OFFICE CODE LENGTH                        
ACPRLDEP DS    X                   1R DEP CODE LENGTH                           
ACPRLSUB DS    X                   1R SUB-DEP CODE LENGTH                       
ACPRAGY  DS    CL2                 AGENCY ALPHA ID                              
         DS    XL11                SPARE                                        
ACPRL    EQU   *-ACPRESTD          LENGTH OF ACPRESTO BLOCK                     
*                                                                               
*                                                                               
*                                                                               
PRMGOBJD DSECT                     RETURN MEDIA GROUP OBJECT                    
PRMGCODE DS    CL1                 MEDIA GROUP CODE                             
         DS    CL1                                                              
PRMGNAME DS    CL36                NAME                                         
PRMGOBJL EQU   *-PRMGOBJD                                                       
*                                                                               
*                                                                               
*                                                                               
PRMDOBJD DSECT                     RETURN MEDIA OBJECT                          
PRMDCODE DS    CL1                 MEDIA CODE                                   
         DS    CL1                                                              
PRMDNAME DS    CL12                NAME                                         
         DS    CL1                                                              
PRMDLONG DS    CL36                LONG NAME                                    
         DS    CL1                                                              
PRMDMEDG DS    CL1                 MEDIA GROUP CODE                             
         DS    CL1                                                              
PRMDFNAM DS    CL36                FOREIGN NAME                                 
PRMDOBJL EQU   *-PRMDOBJD                                                       
*                                                                               
*                                                                               
*                                                                               
PROGOBJD DSECT                     RETURN OFFICE GROUP OBJECT                   
PROGCODE DS    CL1                 OFFICE GROUP CODE                            
         DS    CL1                                                              
PROGNAME DS    CL36                NAME                                         
PROGOBJL EQU   *-PROGOBJD                                                       
*                                                                               
*                                                                               
*                                                                               
PROFOBJD DSECT                     RETURN OFFICE OBJECT                         
PROFCODE DS    CL2                 OFFICE CODE                                  
         DS    CL1                                                              
PROFNAME DS    CL36                NAME                                         
         DS    CL1                                                              
PROFOFFG DS    CL1                 OFFICE GROUP CODE                            
PROFOBJL EQU   *-PROFOBJD                                                       
*                                                                               
*                                                                               
*                                                                               
PRWGOBJD DSECT                     RETURN WORK GROUP OBJECT                     
PRWGCODE DS    CL1                 WORK GROUP CODE                              
         DS    CL1                                                              
PRWGNAME DS    CL36                NAME                                         
PRWGOBJL EQU   *-PRWGOBJD                                                       
*                                                                               
*                                                                               
*                                                                               
PRWCOBJD DSECT                     RETURN WORKCODE OBJECT                       
PRWCCODE DS    CL2                 WORKCODE                                     
         DS    CL1                                                              
PRWCSUFF DS    CL2                 SUFFIX                                       
         DS    CL1                                                              
PRWCNAME DS    CL15                NAME                                         
         DS    CL1                                                              
PRWCLONG DS    CL36                LONG NAME                                    
         DS    CL1                                                              
PRWCFORN DS    CL36                FOREIGN NAME                                 
         DS    CL1                                                              
PRWCEXT  DS    CL1                 IS EXTERNAL (0/1)                            
         DS    CL1                                                              
PRWCINT  DS    CL1                 IS INTERNAL (0/1)                            
         DS    CL1                                                              
PRWCINA  DS    CL1                 IS INACTIVE (0/1)                            
         DS    CL1                                                              
PRWCICO  DS    CL1                 IS COMMISSIONABLE (0/1)                      
         DS    CL1                                                              
PRWCWGR  DS    CL1                 WORK GROUP CODE                              
         DS    CL1                                                              
PRWCILO  DS    CL1                 IS LOCKED FOR ORDERS (0/1)                   
         DS    CL1                                                              
PRWCTYP  DS    CL1                 WORKCODE TYPE                                
PRWCOBJL EQU   *-PRWCOBJD                                                       
*                                                                               
*                                                                               
*                                                                               
PRSHOBJD DSECT                     RETURN SCHEME OBJECT                         
PRSHCODE DS    CL8                 SCHEME CODE                                  
         DS    CL1                                                              
PRSHNAME DS    CL20                NAME                                         
PRSHOBJL EQU   *-PRSHOBJD                                                       
*                                                                               
*                                                                               
*                                                                               
PRSCOBJD DSECT                     RETURN SCHEME CATEGORY OBJECT                
PRSCSHCD DS    CL8                 SCHEME CODE                                  
         DS    CL1                                                              
PRSCCTCD DS    CL2                 CATEGORY CODE                                
         DS    CL1                                                              
PRSCPOS  DS    CL2                 POSITION                                     
PRSCOBJL EQU   *-PRSCOBJD                                                       
*                                                                               
*                                                                               
*                                                                               
PRCTOBJD DSECT                     RETURN CATEGORY OBJECT                       
PRCTSHCD DS    CL8                 SCHEME CODE                                  
         DS    CL1                                                              
PRCTCTCD DS    CL2                 CATEGORY CODE                                
         DS    CL1                                                              
PRCTTYPE DS    CL2                 TYPE                                         
         DS    CL1                                                              
PRCTFLGS DS    CL2                 FLAGS                                        
         DS    CL1                                                              
PRCTNAME DS    CL20                NAME                                         
         DS    CL1                                                              
PRCTTNAM DS    CL20                TOTAL NAME                                   
         DS    CL1                                                              
PRCTFORM DS    CL33                FORMULA                                      
         DS    CL1                                                              
PRCTFNAM DS    CL20                FOREIGN NAME                                 
         DS    CL1                                                              
PRCTFTNM DS    CL20                FOREIGN TOTAL NAME                           
PRCTOBJL EQU   *-PRCTOBJD                                                       
*                                                                               
*                                                                               
*                                                                               
PRCWOBJD DSECT                     RETURN CATEGORY WORKCODE OBJECT              
PRCWCODE DS    CL2                 WORKCODE                                     
         DS    CL1                                                              
PRCWSUFF DS    CL2                 SUFFIX                                       
         DS    CL1                                                              
PRCWPOS  DS    CL2                 POSITION                                     
         DS    CL1                                                              
PRCWNAME DS    CL15                OVERRIDE NAME                                
         DS    CL1                                                              
PRCWAPPL DS    CL2                 APPLY TO CATEGORY                            
         DS    CL1                                                              
PRCWUPL  DS    CL1                 UPLOAD (0 OR 1)                              
PRCWOBJL EQU   *-PRCWOBJD                                                       
*                                                                               
*                                                                               
*                                                                               
PRCLOBJD DSECT                     RETURN CLIENT OBJECT                         
PRCLCLCD DS    CL6                 CLIENT CODE                                  
         DS    CL1                                                              
PRCLNAME DS    CL36                NAME                                         
         DS    CL1                                                              
PRCLADD1 DS    CL26                ADDRESS LINE 1                               
         DS    CL1                                                              
PRCLADD2 DS    CL26                ADDRESS LINE 2                               
         DS    CL1                                                              
PRCLADD3 DS    CL26                ADDRESS LINE 3                               
         DS    CL1                                                              
PRCLADD4 DS    CL26                ADDRESS LINE 4                               
         DS    CL1                                                              
PRCLPOB  DS    CL50                PRINT ON BILLS                               
         DS    CL1                                                              
PRCLFILT DS    CL5                 FILTERS                                      
         DS    CL1                                                              
PRCLAGYO DS    CL2                 AGENCY OFFICE                                
         DS    CL1                                                              
PRCLLOCK DS    CL1                 IS LOCKED (0/1)                              
         DS    CL1                                                              
PRCLADD5 DS    CL26                ADDRESS LINE 5                               
PRCLOBJL EQU   *-PRCLOBJD                                                       
*                                                                               
*                                                                               
*                                                                               
PRPROBJD DSECT                     RETURN PRODUCT OBJECT                        
PRPRCLCD DS    CL6                 CLIENT CODE                                  
         DS    CL1                                                              
PRPRPRCD DS    CL6                 PRODUCT CODE                                 
         DS    CL1                                                              
PRPRNAME DS    CL36                NAME                                         
         DS    CL1                                                              
PRPRADD1 DS    CL26                ADDRESS LINE 1                               
         DS    CL1                                                              
PRPRADD2 DS    CL26                ADDRESS LINE 2                               
         DS    CL1                                                              
PRPRADD3 DS    CL26                ADDRESS LINE 3                               
         DS    CL1                                                              
PRPRADD4 DS    CL26                ADDRESS LINE 4                               
         DS    CL1                                                              
PRPRPOB  DS    CL50                PRINT ON BILLS                               
         DS    CL1                                                              
PRPRFILT DS    CL5                 FILTERS                                      
         DS    CL1                                                              
PRPRAGYO DS    CL2                 AGENCY OFFICE                                
         DS    CL1                                                              
PRPRLOCK DS    CL1                 IS LOCKED (0/1)                              
         DS    CL1                                                              
PRPRADD5 DS    CL26                ADDRESS LINE 5                               
PRPROBJL EQU   *-PRPROBJD                                                       
*                                                                               
*                                                                               
*                                                                               
PRJBOBJD DSECT                     RETURN JOB OBJECT                            
PRJBCLCD DS    CL6                 CLIENT CODE                                  
         DS    CL1                                                              
PRJBPRCD DS    CL6                 PRODUCT CODE                                 
         DS    CL1                                                              
PRJBJBCD DS    CL6                 JOB CODE                                     
         DS    CL1                                                              
PRJBNAME DS    CL36                NAME                                         
         DS    CL1                                                              
PRJBPOB  DS    CL50                PRINT ON BILLS                               
         DS    CL1                                                              
PRJBFILT DS    CL5                 FILTERS                                      
         DS    CL1                                                              
PRJBAGYO DS    CL2                 AGENCY OFFICE                                
         DS    CL1                                                              
PRJBACST DS    CL2                 ACCOUNT STATUS                               
         DS    CL1                                                              
PRJBOPDT DS    CL6                 JOB OPEN DATE                                
         DS    CL1                                                              
PRJBCLDT DS    CL6                 JOB CLOSE DATE                               
         DS    CL1                                                              
PRJBCLOS DS    CL1                 IS CLOSED (0/1)                              
         DS    CL1                                                              
PRJBLOCK DS    CL1                 IS LOCKED (0/1)                              
         DS    CL1                                                              
PRJBDEL  DS    CL1                 IS DELETED (0/1)                             
         DS    CL1                                                              
PRJBNEW  DS    CL1                 IS NEW ESTIMATING (0/1)                      
         DS    CL1                                                              
PRJBADD1 DS    CL26                ADDRESS LINE 1                               
         DS    CL1                                                              
PRJBADD2 DS    CL26                ADDRESS LINE 2                               
         DS    CL1                                                              
PRJBADD3 DS    CL26                ADDRESS LINE 3                               
         DS    CL1                                                              
PRJBADD4 DS    CL26                ADDRESS LINE 4                               
         DS    CL1                                                              
PRJBADD5 DS    CL26                ADDRESS LINE 5                               
PRJBOBJL EQU   *-PRJBOBJD                                                       
*                                                                               
*                                                                               
*                                                                               
PRJOOBJD DSECT                     RETURN JOB OPEN OBJECT                       
PRJOCLCD DS    CL6                 CLIENT CODE                                  
         DS    CL1                                                              
PRJOPRCD DS    CL6                 PRODUCT CODE                                 
         DS    CL1                                                              
PRJOJBCD DS    CL6                 JOB CODE                                     
         DS    CL1                                                              
PRJOSCH  DS    CL8                 SCHEME                                       
         DS    CL1                                                              
PRJONAE  DS    CL1                 NEED APPROVED ESTIMATE TO BILL               
         DS    CL1                                                              
PRJOBT   DS    CL1                 BILL TYPE                                    
         DS    CL1                                                              
PRJOBPCT DS    CL6                 BILLING PERCENTAGE                           
         DS    CL1                                                              
PRJOMPE  DS    CL5                 MAXIMUM PERCENTAGE OF ESTIMATE               
         DS    CL1                                                              
PRJOBCUR DS    CL3                 BILLING CURRENCY                             
PRJOOBJL EQU   *-PRJOOBJD                                                       
*                                                                               
*                                                                               
*                                                                               
PRUFOBJD DSECT                     RETURN JOB USER FIELD OBJECT                 
PRUFCODE DS    CL2                 USER FIELD CODE                              
         DS    CL1                                                              
PRUFNAME DS    CL12                USER FIELD DESCRIPTION                       
         DS    CL1                                                              
PRUFDATA DS    CL32                USER FIELD DATA                              
         DS    CL1                                                              
PRUFSHES DS    CL1                 SHOW ON ESTIMATE FLAG (0 OR 1)               
         DS    CL1                                                              
PRUFSEQ  DS    CL2                 SEQUENCE NUMBER (FOR DISPLAY)                
PRUFOBJL EQU   *-PRUFOBJD                                                       
*                                                                               
*                                                                               
*                                                                               
PREROBJD DSECT                     RETURN ESTIMATE (COLUMN) OBJECT              
*                                                                               
PRERNUM  DS    0CL4                ESTIMATE NUMBER                              
PRERETYP DS    CL1                 ESTIMATE TYPE (R/P/S)                        
PREREVER DS    CL3                 ESTIMATE VERSION                             
         DS    CL1                                                              
PRERNAM1 DS    CL14                NAME 1                                       
         DS    CL1                                                              
PRERNAM2 DS    CL14                NAME 2                                       
         DS    CL1                                                              
PRERDATE DS    CL6                 LAST CHANGE DATE                             
         DS    CL1                                                              
PRERTIME DS    CL6                 LAST CHANGE TIME                             
         DS    CL1                                                              
PRERAPDT DS    CL6                 APPROVAL DATE                                
         DS    CL1                                                              
PRERAPPR DS    CL8                 APPROVER                                     
         DS    CL1                                                              
PRERPRDT DS    CL6                 PREPARATION DATE                             
         DS    CL1                                                              
PRERPREP DS    CL8                 PREPARER                                     
         DS    CL1                                                              
PRERPERS DS    CL8                 LAST CHANGE PERSON                           
         DS    CL1                                                              
PRERCUR  DS    CL3                 CURRENCY                                     
         DS    CL1                                                              
PRERRAT  DS    CL9                 EXCHANGE RATE (PRESTO 2.9-UK)                
PREROBJL EQU   *-PREROBJD                                                       
*                                                                               
*                                                                               
*                                                                               
PRCEOBJD DSECT                     RETURN CELL OBJECT                           
PRCEWCOD DS    CL2                 WORKCODE                                     
         DS    CL1                                                              
PRCESUFF DS    CL2                 SUFFIX                                       
         DS    CL1                                                              
PRCEPRIC DS    CL8                 PRICE (PENNIES)                              
         DS    CL1                                                              
PRCEAMNT DS    CL8                 AMOUNT (PENNIES)                             
         DS    CL1                                                              
PRCEUNIT DS    CL4                 UNITS                                        
         DS    CL1                                                              
PRCECOMM DS    CL8                 COMMISSION OVERRIDE AMOUNT                   
         DS    CL1                                                              
PRCECOVR DS    CL1                 COMMISSION OVERRIDE (Y/N)                    
         DS    CL1                                                              
PRCEHOUR DS    CL8                 TOTAL HOURS FOR WORKCODE                     
         DS    CL1                                                              
PRCEBHRS DS    CL8                 'B' HOURS                                    
         DS    CL1                                                              
PRCENHRS DS    CL8                 'N' HOURS                                    
         DS    CL1                                                              
PRCERHRS DS    CL8                 'R' HOURS                                    
         DS    CL1                                                              
PRCEFCAM DS    CL8                 FOREIGN AMOUNT (PRESTO 2.9-UK)               
         DS    CL1                                                              
PRCEFCCM DS    CL8                 FOREIGN COMM AMOUNT (PRESTO 2.9-UK)          
PRCEOBJL EQU   *-PRCEOBJD                                                       
*                                                                               
*                                                                               
*                                                                               
PRHROBJD DSECT                     RETURN HOUR OBJECT                           
PRHRWCOD DS    CL2                 WORKCODE                                     
         DS    CL1                                                              
PRHRSUFF DS    CL2                 SUFFIX                                       
         DS    CL1                                                              
PRHR1RAC DS    CL14                CONTRA ACCOUNT (1R)                          
         DS    CL1                                                              
PRHRAMNT DS    CL8                 AMOUNT (PENNIES)                             
         DS    CL1                                                              
PRHRRATE DS    CL8                 PERSON RATE                                  
         DS    CL1                                                              
PRHRBHRS DS    CL8                 'B' HOURS                                    
         DS    CL1                                                              
PRHRNHRS DS    CL8                 'N' HOURS                                    
         DS    CL1                                                              
PRHRRHRS DS    CL8                 'R' HOURS                                    
         DS    CL1                                                              
PRHROBJL EQU   *-PRHROBJD                                                       
*                                                                               
*                                                                               
*                                                                               
PRJWOBJD DSECT                     RETURN JOB WORKCODE OBJECT                   
PRJWWC   DS    CL2                 WORKCODE                                     
         DS    CL1                                                              
PRJWSUFF DS    CL2                 SUFFIX                                       
         DS    CL1                                                              
PRJWCRAT DS    CL8                 COMMISSION RATE                              
         DS    CL1                                                              
PRJWTRAT DS    CL8                 TAX RATE                                     
         DS    CL1                                                              
PRJWPCAT DS    CL8                 PERCENT OF CATEGORY                          
         DS    CL1                                                              
PRJWNET  DS    CL8                 NET                                          
         DS    CL1                                                              
PRJWNCN  DS    CL8                 NON COMM'ABLE NET                            
         DS    CL1                                                              
PRJWCOM  DS    CL8                 COMMISSION                                   
         DS    CL1                                                              
PRJWTAX  DS    CL8                 TAX                                          
         DS    CL1                                                              
PRJWONET DS    CL8                 OPEN ORDER NET                               
         DS    CL1                                                              
PRJWOCOM DS    CL8                 OPEN ORDER COMMISSION                        
         DS    CL1                                                              
PRJWOTAX DS    CL8                 OPEN ORDER TAX                               
         DS    CL1                                                              
PRJWSNET DS    CL8                 SECOND CURR NET                              
         DS    CL1                                                              
PRJWSNCN DS    CL8                 SECOND CURR NON-COMM NET                     
         DS    CL1                                                              
PRJWSCOM DS    CL8                 SECOND CURR COMM                             
         DS    CL1                                                              
PRJWSTAX DS    CL8                 SECOND CURR TAX                              
         DS    CL1                                                              
PRJWSONT DS    CL8                 SECOND CURR ORDER NET                        
         DS    CL1                                                              
PRJWSOCM DS    CL8                 SECOND CURR ORDER COMM                       
         DS    CL1                                                              
PRJWSOTX DS    CL8                 SECOND CURR ORDER TAX                        
         DS    CL1                                                              
PRJWBHR  DS    CL8                 'B' HOURS                                    
         DS    CL1                                                              
PRJWNHR  DS    CL8                 'N' HOURS                                    
         DS    CL1                                                              
PRJWRHR  DS    CL8                 'R' HOURS                                    
         DS    CL1                                                              
PRJWRMEM DS    CL8                 'R' HOURS VALUE (MEMO ITEM)                  
         DS    CL1                                                              
PRJWRSME DS    CL8                 'R' HOURS SECOND CURR VALUE                  
PRJWOBJL EQU   *-PRJWOBJD                                                       
*                                                                               
*                                                                               
*                                                                               
PRCOOBJD DSECT                     RETURN WORKCODE CONTRA OBJECT                
PRCOWC   DS    CL2                 WORKCODE                                     
         DS    CL1                                                              
PRCOSUFF DS    CL2                 SUFFIX                                       
         DS    CL1                                                              
PRCOCONT DS    CL14                CONTRA ACCOUNT                               
         DS    CL1                                                              
PRCONET  DS    CL8                 NET                                          
         DS    CL1                                                              
PRCONCN  DS    CL8                 NON COMM'ABLE NET                            
         DS    CL1                                                              
PRCOCOM  DS    CL8                 COMMISSION                                   
         DS    CL1                                                              
PRCOTAX  DS    CL8                 TAX                                          
         DS    CL1                                                              
PRCOSNET DS    CL8                 SECOND CURR NET                              
         DS    CL1                                                              
PRCOSNCN DS    CL8                 SECOND CURR NON-COMM NET                     
         DS    CL1                                                              
PRCOSCOM DS    CL8                 SECOND CURR COMM                             
         DS    CL1                                                              
PRCOSTAX DS    CL8                 SECOND CURR TAX                              
         DS    CL1                                                              
PRCOBHR  DS    CL8                 'B' HOURS                                    
         DS    CL1                                                              
PRCONHR  DS    CL8                 'N' HOURS                                    
         DS    CL1                                                              
PRCORHR  DS    CL8                 'R' HOURS                                    
         DS    CL1                                                              
PRCORMEM DS    CL8                 'R' HOURS VALUE (MEMO ITEM)                  
         DS    CL1                                                              
PRCORSME DS    CL8                 'R' HOURS SECOND CURR VALUE                  
PRCOOBJL EQU   *-PRCOOBJD                                                       
*                                                                               
*                                                                               
*                                                                               
PRSPOBJD DSECT                     RETURN SUPPLIER OBJECT                       
PRSPACCT DS    CL15                ACCOUNT                                      
         DS    CL1                                                              
PRSPNAME DS    CL36                ACCOUNT NAME                                 
         DS    CL1                                                              
PRSPADD1 DS    CL26                ADDRESS LINE 1                               
         DS    CL1                                                              
PRSPADD2 DS    CL26                ADDRESS LINE 2                               
         DS    CL1                                                              
PRSPADD3 DS    CL26                ADDRESS LINE 3                               
         DS    CL1                                                              
PRSPADD4 DS    CL26                ADDRESS LINE 4                               
         DS    CL1                                                              
PRSPDEL  DS    CL1                 IS DELETED (0/1)                             
         DS    CL1                                                              
PRSPLOCK DS    CL1                 IS LOCKED (0/1)                              
         DS    CL1                                                              
PRSPCURC DS    CL3                 CURRENCY CODE                                
PRSPOBJL EQU   *-PRSPOBJD                                                       
*                                                                               
*                                                                               
*                                                                               
PRAGOBJD DSECT                     RETURN AGENCY OBJECT                         
PRAGCODE DS    CL2                 BINARY COMPANY CODE                          
         DS    CL1                                                              
PRAGNAME DS    CL36                NAME                                         
         DS    CL1                                                              
PRAGADD1 DS    CL26                ADDRESS LINE 1                               
         DS    CL1                                                              
PRAGADD2 DS    CL26                ADDRESS LINE 2                               
         DS    CL1                                                              
PRAGADD3 DS    CL26                ADDRESS LINE 3                               
         DS    CL1                                                              
PRAGADD4 DS    CL26                ADDRESS LINE 4                               
         DS    CL1                                                              
PRAGLCLI DS    CL2                 CLIENT CODE LENGTH                           
         DS    CL1                                                              
PRAGLPRO DS    CL2                 PRODUCT CODE LENGTH                          
         DS    CL1                                                              
PRAGLJOB DS    CL2                 JOB CODE LENGTH                              
         DS    CL1                                                              
PRAGSUPP DS    CL2                 SUPPLIER LEDGER                              
         DS    CL1                                                              
PRAGALPH DS    CL2                 ALPHA AGENCY CODE                            
         DS    CL1                                                              
PRAGNEWO DS    CL2                 NEW OFFICES FLAG (0 OR 1)                    
         DS    CL1                                                              
PRAGCUR  DS    CL3                 PRIMARY CURRENCY                             
         DS    CL1                                                              
PRAGCURS DS    CL3                 SECONDARY CURRENCY                           
         DS    CL1                                                              
PRAGXDAT DS    CL2                 EXTRA DATA SETTING                           
         DS    CL1                                                              
PRAGFCES DS    CL1                 IS FOREIGN CURRENCY ESTIMATE                 
         DS    CL1                                                              
PRAGFCOS DS    CL1                 IS FOREIGN CURRENCY ORDER                    
         DS    CL1                                                              
PRAGANXP DS    CL2                 ANALYZE EXPENSE ORDERS (0 OR 1)              
PRAGOBJL EQU   *-PRAGOBJD                                                       
*                                                                               
*                                                                               
PROHOBJD DSECT                     RETURN OFFICE LIST HEADER OBJECT             
PROHCODE DS    CL2                 OFFICE LIST CODE                             
         DS    CL1                                                              
PROHNAME DS    CL36                OFFICE LIST NAME                             
PROHOBJL EQU   *-PROHOBJD          OFFICE LIST HEADER LENGTH                    
*                                                                               
*                                                                               
PROLOBJD DSECT                     RETURN OFFICE LIST OBJECT                    
PROLCODE DS    CL2                 OFFICE LIST CODE                             
         DS    CL1                                                              
PROLOFFC DS    CL2                 OFFICE CODE                                  
PROLOBJL EQU   *-PROLOBJD          OFFICE LIST LENGTH                           
*                                                                               
*                                                                               
PROUOBJD DSECT                     ORDER UPLOAD ORDER OBJECT                    
PROUCLI  DS    CL6                 CLIENT                                       
         DS    CL1                                                              
PROUPRO  DS    CL6                 PRODUCT                                      
         DS    CL1                                                              
PROUJOB  DS    CL6                 JOB                                          
         DS    CL1                                                              
PROUSUPP DS    CL14                SUPPLIER ACCOUNT                             
         DS    CL1                                                              
PROUORDN DS    CL6                 ORDER NUMBER                                 
         DS    CL1                                                              
PROUORDT DS    CL6                 ORDER DATE                                   
         DS    CL1                                                              
PROUORDU DS    CL6                 ORDER DUE DATE                               
         DS    CL1                                                              
PROUATTN DS    CL20                ATTENTION COMMENT                            
         DS    CL1                                                              
PROUSTAT DS    CL4                 APPROVAL STATUS                              
         DS    CL1                                                              
PROUAUTH DS    CL15                AUTHORIZED BY                                
         DS    CL1                                                              
PROUSERV DS    CL16                ORIGINATING SQL SERVER                       
         DS    CL1                                                              
PROUCUR  DS    CL3                 CURRENCY                                     
         DS    CL1                                                              
PROUREQD DS    CL20                REQUIRED BY (EUROPE)                         
         DS    CL1                                                              
PROUEXAC DS    CL14                EXPENSE ACCOUNT                              
         DS    CL1                                                              
PROUEXRT DS    CL9                 EXCHANGE RATE                                
         DS    CL1                                                              
PROUDOF  DS    CL2                 DEBIT OFFICE                                 
         DS    CL1                                                              
PROUCOF  DS    CL2                 CREDIT OFFICE                                
         DS    CL1                                                              
PROUAOF  DS    CL2                 ANALYSIS OFFICE                              
         DS    CL1                                                              
PROUDEP  DS    CL3                 DEPARTMENT                                   
         DS    CL1                                                              
PROUPER  DS    CL7                 PERSON                                       
PROUXANL EQU   *-PROUDOF           EXPENSE ANALYSIS FIELDS LENGTH               
PROUOBJL EQU   *-PROUOBJD          ORDER UPLOAD ORDER LENGTH                    
*                                                                               
*                                                                               
PROTOBJD DSECT                     ORDER UPLOAD TEXT OBJECT                     
PROTSEQ  DS    CL2                 SEQUENCE NUMBER (ZERO BASED)                 
         DS    CL1                                                              
PROTEXT  DS    CL50                TEXT (VARIABLE LENGTH (MAX = 50)             
PROTOBJL EQU   *-PROTOBJD          ORDER TEXT LENGTH                            
*                                                                               
*                                                                               
PRULOBJD DSECT                     ORDER UPLOAD ORDER LINE OBJECT               
PRULWC   DS    CL2                 WORK CODE                                    
         DS    CL1                                                              
PRULAMNT DS    CL8                 AMOUNT (LONG IN HEX)                         
         DS    CL1                                                              
PRULFLAG DS    CL1                 COMMISSION FLAG (Y/N)                        
         DS    CL1                                                              
PRULFAMT DS    CL8                 FOREIGN CURRENCY AMOUNT                      
PRULOBJL EQU   *-PRULOBJD          ORDER UPDATE ORDER LINE LENGTH               
*                                                                               
*                                                                               
PROSOBJD DSECT                     ORDER STATUS RETURN OBJECT                   
PROSORDN DS    CL6                 ORDER NUMBER                                 
         DS    CL1                                                              
PROSSTAT DS    CL1                 ORDER STATUS                                 
         DS    CL1                                                              
PROSSTA2 DS    CL1                 ORDER STATUS 2 (FOR V2.00)                   
         DS    CL1                                                              
PROSALOC DS    CL1                 PENDING ALLOCATION STATUS (UK ONLY)          
PROSOBJL EQU   *-PROSOBJD          ORDER STATUS RETURN LENGTH                   
*                                                                               
*                                                                               
PRPLOBJD DSECT                     PRICE LIST RETURN OBJECT                     
PRPLCODE DS    CL4                 CODE                                         
         DS    CL1                                                              
PRPLNAME DS    CL36                NAME                                         
         DS    CL1                                                              
PRPLAMNT DS    CL8                 AMOUNT (PENNIES)                             
         DS    CL1                                                              
PRPLAMN2 DS    CL8                 SECOND AMOUNT (EUROPE)                       
         DS    CL1                                                              
PRPLFNAM DS    CL36                FOREIGN NAME                                 
PRPLOBJL EQU   *-PRPLOBJD          PRICE LIST RETURN LENGTH                     
*                                                                               
*                                                                               
PRTROBJD DSECT                     RETURN TAX RULE OBJECT                       
PRTRSTDT DS    CL6                 START DATE                                   
         DS    CL1                                                              
PRTRREG  DS    CL10                REGISTRATION NUMBER                          
         DS    CL1                                                              
PRTROFF  DS    CL2                 OFFICE (CAN BE SPACES)                       
         DS    CL1                                                              
PRTRDEL  DS    CL1                 IS DELETED (0/1)                             
PRTROBJL EQU   *-PRTROBJD                                                       
*                                                                               
*                                                                               
PRTTOBJD DSECT                     RETURN TAX TYPE OBJECT                       
PRTTCODE DS    CL1                 OUTPUT TAX TYPE                              
         DS    CL1                                                              
PRTTNAME DS    CL10                TAX TYPE NAME                                
         DS    CL1                                                              
PRTTRATE DS    CL8                 TAX TYPE RATE (2 DP)                         
PRTTOBJL EQU   *-PRTTOBJD                                                       
*                                                                               
*                                                                               
PROKOBJD DSECT                     RETURN OPTION KEY OBJECT                     
PROKOGR  DS    CL1                 OFFICE GROUP CODE                            
         DS    CL1                                                              
PROKOFF  DS    CL2                 OFFICE CODE                                  
         DS    CL1                                                              
PROKCLI  DS    CL6                 CLIENT CODE                                  
         DS    CL1                                                              
PROKPRO  DS    CL6                 PRODUCT CODE                                 
         DS    CL1                                                              
PROKJOB  DS    CL6                 JOB CODE                                     
         DS    CL1                                                              
PROKMGR  DS    CL1                 MEDIA GROUP CODE                             
         DS    CL1                                                              
PROKMED  DS    CL1                 MEDIA CODE                                   
         DS    CL1                                                              
PROKWGR  DS    CL1                 WORK GROUP CODE                              
         DS    CL1                                                              
PROKWC   DS    CL2                 WORKCODE                                     
         DS    CL1                                                              
PROKDEL  DS    CL1                 IS DELETED (0/1)                             
PROKOBJL EQU   *-PROKOBJD                                                       
*                                                                               
*                                                                               
PROVOBJD DSECT                     RETURN OPTION VALUE OBJECT                   
PROVNUM  DS    CL4                 OPTION NUMBER                                
         DS    CL1                                                              
PROVDATA DS    CL20                OPTION VALUE DATA                            
PROVOBJL EQU   *-PROVOBJD                                                       
*                                                                               
*                                                                               
PRUKOBJD DSECT                     RETURN USER FIELD KEY OBJECT                 
PRUKOGR  DS    CL1                 OFFICE GROUP CODE                            
         DS    CL1                                                              
PRUKOFF  DS    CL2                 OFFICE CODE                                  
         DS    CL1                                                              
PRUKCLI  DS    CL6                 CLIENT CODE                                  
         DS    CL1                                                              
PRUKPRO  DS    CL6                 PRODUCT CODE                                 
         DS    CL1                                                              
PRUKMGR  DS    CL1                 MEDIA GROUP CODE                             
         DS    CL1                                                              
PRUKMED  DS    CL1                 MEDIA CODE                                   
         DS    CL1                                                              
PRUKJOB  DS    CL6                 JOB CODE                                     
         DS    CL1                                                              
PRUKDEL  DS    CL1                 IS DELETED (0/1)                             
PRUKOBJL EQU   *-PRUKOBJD                                                       
*                                                                               
*                                                                               
PRUSOBJD DSECT                     RETURN USER FIELD OBJECT                     
PRUSCODE DS    CL2                 USER FIELD CODE                              
         DS    CL1                                                              
PRUSNAME DS    CL12                USER FIELD NAME                              
         DS    CL1                                                              
PRUSERUL DS    CL1                 EDIT RULE (C, D, N)                          
         DS    CL1                                                              
PRUSMAX  DS    CL2                 MAXIMUM LENGTH (1-32)                        
         DS    CL1                                                              
PRUSREQD DS    CL1                 REQUIRED (0, 1)                              
         DS    CL1                                                              
PRUSCUT  DS    CL8                 CUTOFF DATE (YYYYMMDD)                       
         DS    CL1                                                              
PRUSEST  DS    CL1                 SHOW ON ESTIMATE (0, 1)                      
         DS    CL1                                                              
PRUSPOS  DS    CL2                 POSITION                                     
         DS    CL1                                                              
PRUSAUTH DS    CL1                 SHOW ON AUTHORIZATION (0,1)                  
PRUSOBJL EQU   *-PRUSOBJD                                                       
*                                                                               
*                                                                               
PRJTOBJD DSECT                     RETURN JOB TEXT OBJECT                       
PRJTTYPE DS    CL1                 TYPE (1=HEADER, 2=FOOTER)                    
         DS    CL1                                                              
PRJTSEQ  DS    CL1                 SEQUENCE (1,2,3)                             
         DS    CL1                                                              
PRJTTEXT DS    CL50                TEXT                                         
PRJTOBJL EQU   *-PRJTOBJD                                                       
*                                                                               
*                                                                               
PRLSOBJD DSECT                     RETURN LEDGER STRUCTURE                      
PRLSLC   DS    CL2                 LEDGER CODE                                  
         DS    C                                                                
PRLSLNUM DS    CL3                 LEVEL NUMBER                                 
         DS    C                                                                
PRLSLLN  DS    CL3                 LEVEL LENGTH                                 
         DS    C                                                                
PRLSLNAM DS    CL15                LEVEL NAME                                   
PRLSOBJL EQU   *-PRLSOBJD                                                       
*                                                                               
*                                                                               
PRLNOBJD DSECT                     RETURN 1R LEDGER NAMES                       
PRLNLC   DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
PRLNLNUM DS    CL6                 DEPARTMENT CODE                              
         DS    C                                                                
PRLNLLN  DS    CL6                 SUBDEPARTMENT CODE                           
         DS    C                                                                
PRLNLNAM DS    CL36                NAME                                         
PRLNOBJL EQU   *-PRLNOBJD                                                       
*                                                                               
*                                                                               
PRPEOBJD DSECT                     RETURN PERSON OBJECT                         
PRPEPERS DS    CL8                 PERSON CODE                                  
         DS    CL1                                                              
PRPELN   DS    CL36                LAST NAME                                    
         DS    CL1                                                              
PRPEFN   DS    CL36                FIRST NAME                                   
         DS    CL1                                                              
PRPEDEL  DS    CL1                 IS DELETED (0/1)                             
PRPEOBJL EQU   *-PRPEOBJD                                                       
*                                                                               
*                                                                               
PRPAOBJD DSECT                     RETURN PERSON ASSIGNMENT OBJECT              
PRPAPRCD DS    CL8                 PERSON CODE                                  
         DS    CL1                                                              
PRPAOFCD DS    CL2                 OFFICE CODE                                  
         DS    CL1                                                              
PRPADEP  DS    CL6                 DEPARTMENT CODE                              
         DS    CL1                                                              
PRPASUB  DS    CL6                 SUBDEPARTMENT CODE                           
         DS    CL1                                                              
PRPASTDT DS    CL8                 START DATE                                   
         DS    CL1                                                              
PRPAENDT DS    CL8                 END DATE                                     
PRPAOBJL EQU   *-PRPAOBJD                                                       
*                                                                               
*                                                                               
PRRAOBJD DSECT                     RETURN RATE OBJECT                           
PRRAOFC  DS    CL2                 OFFICE CODE                                  
         DS    CL1                                                              
PRRADEP  DS    CL6                 DEPARTMENT CODE                              
         DS    CL1                                                              
PRRASUB  DS    CL6                 SUBDEPARTMENT CODE                           
         DS    CL1                                                              
PRRAPER  DS    CL8                 PERSON CODE                                  
         DS    CL1                                                              
PRRATASK DS    CL2                 TASK CODE                                    
         DS    CL1                                                              
PRRACLOF DS    CL2                 CLIENT OFFICE CODE                           
         DS    CL1                                                              
PRRACLI  DS    CL5                 CLIENT CODE                                  
         DS    CL1                                                              
PRRAPRD  DS    CL3                 PRODUCT CODE                                 
         DS    CL1                                                              
PRRAEFDT DS    CL8                 EFFECTIVE DATE                               
         DS    CL1                                                              
PRRARATE DS    CL10                RATE                                         
         DS    CL1                                                              
PRRADEL  DS    CL1                 IS DELETED (0/1)                             
PRRAOBJL EQU   *-PRRAOBJD                                                       
*                                                                               
*                                                                               
PRAPOBJD DSECT                     RETURN APPROVER OBJECT                       
PRAPCLCD DS    CL6                 CLIENT CODE                                  
         DS    CL1                                                              
PRAPPRCD DS    CL6                 PRODUCT CODE                                 
         DS    CL1                                                              
PRAPJBCD DS    CL6                 JOB CODE                                     
         DS    CL1                                                              
PRAPESTN DS    CL3                 ESTIMATE NUMBER                              
         DS    CL1                                                              
PRAPAPDT DS    CL6                 APPROVER DATE                                
         DS    CL1                                                              
PRAPAPPR DS    CL8                 APPROVER                                     
         DS    CL1                                                              
PRAPOBJL EQU   *-PRAPOBJD                                                       
