*          DATA SET ACRECF9D   AT LEVEL 001 AS OF 09/07/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T608F9D      DATE 09/07/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
MEMTRTXH DS    CL8                                                              
MEMTRTX  DS    CL40     5    2   40  L  P N             T        Y              
MEMSTTXH DS    CL8                                                              
MEMSTTX  DS    CL8      5   50    8  L  P N             T        Y              
MEMSTATH DS    CL8                                                              
MEMSTAT  DS    CL16     5   59   16  A  P H             T        Y              
MEMDATXH DS    CL8                                                              
MEMDATX  DS    CL10     7    2   10  L  P N             T        Y              
MEMRETXH DS    CL8                                                              
MEMRETX  DS    CL6      7   13    6  L  P N             T        Y              
MEMMETXH DS    CL8                                                              
MEMMETX  DS    CL50     7   20   50  L  P N             T        Y              
MEMDAT1H DS    CL8                                                              
MEMDAT1  DS    CL10     8    2   10  A  U H             T        Y    1         
MEMDAT1X DS    CL8                                                              
MEMREF1H DS    CL8                                                              
MEMREF1  DS    CL6      8   13    6  A  U H             T        Y    2         
MEMREF1X DS    CL8                                                              
MEMMEM1H DS    CL8                                                              
MEMMEM1  DS    CL50     8   20   50  L  U H             T        Y    3         
MEMMEM1X DS    CL8                                                              
MEMDAT2H DS    CL8                                                              
MEMDAT2  DS    CL10     9    2   10  A  U H             T        Y    1         
MEMDAT2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9   13    6  A  U H             T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50     9   20   50  L  U H             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    10    2   10  A  U H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     10   13    6  A  U H             T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50    10   20   50  L  U H             T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10    11    2   10  A  U H             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6     11   13    6  A  U H             T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL50    11   20   50  L  U H             T        Y    3         
         DS    CL8                                                              
MEMTABH  DS    CL8                                                              
MEMTAB   DS    CL1     12    2    1  A  U N             T        Y              
MEMTOTH  DS    CL8                                                              
MEMTOT   DS    CL78    22    2   78  A  P N             T        Y              
MEMTAMH  DS    CL8                                                              
MEMTAM   DS    CL78    23    2   78  A  P H             T        Y  254         
MEMTAMX  DS    CL8                                                              
MEMPFKH  DS    CL8                                                              
MEMPFK   DS    CL78    24    2   78  A  P N             T        Y  255         
MEMPFKX  DS    CL8                                                              
         DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 920  BYTES                            
