*          DATA SET ACREPNBD   AT LEVEL 007 AS OF 04/24/14                      
***********************************************************************         
* DATA EQUATES                                                        *         
***********************************************************************         
                                                                                
BFMKWH2Q EQU   BFMKWPHQ+1          EQUATE FOR PAGE HEADER 2                     
BEDKWH2Q EQU   BEDKWPHQ+1          EQUATE FOR PAGE HEADER 2                     
                                                                                
PCQWC    EQU   01                  WORKCODE                                     
PCQREF   EQU   02                  REFERENCE                                    
PCQDATE  EQU   03                  TRANSACTION DATE                             
PCQVNDN  EQU   04                  SUPPLIER/PERSON NAME                         
PCQNARR  EQU   05                  NARRATIVE                                    
PCQNET   EQU   06                  NET                                          
PCQCOM   EQU   07                  COMMISSION                                   
PCQGRS   EQU   08                  GROSS                                        
*        EQU   09                                                               
PCQHRS   EQU   10                  HOURS                                        
PCQRAT   EQU   11                  RATE (SALES)                                 
PCQWCN   EQU   12                  WORKCODE NAME (LONG NAME)                    
PCQWCG   EQU   13                  WORKCODE GROUP                               
PCQWCGN  EQU   14                  WORKCODE GROUP NAME                          
*        EQU   15                                                               
*        EQU   16                                                               
PCQCD    EQU   17                  CASH DISCOUNT                                
*        EQU   18                                                               
*        EQU   19                                                               
PCQCMR   EQU   20                  COMMISSION RATE                              
*        EQU   21                                                               
*        EQU   22                                                               
*        EQU   23                                                               
PCQH@R   EQU   24                  HOURS @ RATE                                 
PCQWCD   EQU   25                  WC DESCRIPTION (SHORT NAME)                  
PCQNIF   EQU   26                  NEW ITEM FLAG                                
PCQCNT   EQU   27                  CONTRA ACCOUNT                               
PCQSBR   EQU   28                  TRANSACTION SUBREF                           
PCQXFR   EQU   29                  TRANSFER DATA                                
PCQVNDC  EQU   30                  SUPPLIER CODE                                
PCQVNDCN EQU   31                  VENDOR CODE & NAME                           
PCQWRKCN EQU   32                  WORKCODE & NAME                              
*                                                                               
PCQPNL   EQU   48                                                               
PCQAGYJ  EQU   PCQPNL+000          AGENCY JOB                                   
PCQBA    EQU   PCQPNL+001          BILLING ADDRESS                              
PCQCUR   EQU   PCQPNL+002          BILL CURRENCY                                
PCQBD    EQU   PCQPNL+003          BILL DATE                                    
PCQBN    EQU   PCQPNL+004          BILL NUMBER                                  
PCQBSTA  EQU   PCQPNL+005          BILL STATUS                                  
PCQBTYP  EQU   PCQPNL+006          BILL TYPE                                    
PCQCDF   EQU   PCQPNL+007          CASH DISCOUNT FLAG                           
PCQCDE   EQU   PCQPNL+008          CD=                                          
PCQCC    EQU   PCQPNL+009          CLIENT CODE                                  
PCQCN    EQU   PCQPNL+010          CLIENT NAME                                  
PCQCON   EQU   PCQPNL+011          COMPANY NAME                                 
PCQCOA   EQU   PCQPNL+012          COMPANY ADDRESS                              
PCQDC    EQU   PCQPNL+013          DEBTORS CODE                                 
PCQDD    EQU   PCQPNL+014          DUE DATE                                     
PCQEST   EQU   PCQPNL+015          ESTIMATE FIELD                               
PCQCL    EQU   PCQPNL+016          JOB CLOSE DATE                               
PCQJC    EQU   PCQPNL+017          JOB CODE                                     
PCQCPJ   EQU   PCQPNL+018          JOB CODE (CLIPROJOB)                         
PCQCPJS  EQU   PCQPNL+019          JOB CODE (CLI/PRO/JOB)                       
PCQJCO   EQU   PCQPNL+020          JOB COMMENTS                                 
PCQJN    EQU   PCQPNL+021          JOB NAME                                     
PCQOP    EQU   PCQPNL+022          JOB OPEN DATE                                
PCQMC    EQU   PCQPNL+023          MEDIA CODE                                   
PCQMN    EQU   PCQPNL+024          MEDIA NAME                                   
PCQAN    EQU   PCQPNL+025          ORIGIN NAME                                  
PCQAA    EQU   PCQPNL+026          ORIGIN ADDRESS                               
PCQPG    EQU   PCQPNL+027          PAGE NUMBER                                  
PCQPONB  EQU   PCQPNL+028          PRINT ON BILLS                               
PCQPC    EQU   PCQPNL+029          PRODUCT CODE                                 
PCQPN    EQU   PCQPNL+030          PRODUCT NAME                                 
PCQTD    EQU   PCQPNL+031          TODAY'S DATE                                 
PCQUF1   EQU   PCQPNL+032          USER FIELD 1                                 
PCQUF2   EQU   PCQPNL+033          USER FIELD 2                                 
PCQUF3   EQU   PCQPNL+034          USER FIELD 3                                 
PCQUF4   EQU   PCQPNL+035          USER FIELD 4                                 
PCQUF5   EQU   PCQPNL+036          USER FIELD 5                                 
PCQUF6   EQU   PCQPNL+037          USER FIELD 6                                 
PCQUF7   EQU   PCQPNL+038          USER FIELD 7                                 
PCQUF8   EQU   PCQPNL+039          USER FIELD 8                                 
PCQUF9   EQU   PCQPNL+040          USER FIELD 9                                 
PCQUF10  EQU   PCQPNL+041          USER FIELD 10                                
PCQAUTH  EQU   PCQPNL+042          AUTHORIZATION NUMBER                         
PCQSHIP  EQU   PCQPNL+043          SHIP DATE                                    
PCQBMN   EQU   PCQPNL+044          BILL MEDIA NAME                              
PCQAMDU  EQU   PCQPNL+045          AMOUNT DUE / TO REVERSE                      
PCQRTLN  EQU   PCQPNL+046          RETAILER NAME                                
PCQRTLA  EQU   PCQPNL+047          RETAILER ADDRESS                             
PCQPBA   EQU   PCQPNL+048          PERCENT OF BILL - AMOUNT                     
PCQPBW   EQU   PCQPNL+049                          - WORKCODE                   
PCQPBN   EQU   PCQPNL+050                          - WORKCODE NAME              
PCQLIN   EQU   PCQPNL+051          LONG INVOICE NUMBER                          
PCQPREBN EQU   PCQPNL+052          PREBILL NAME                                 
PCQTTLDA EQU   PCQPNL+053          TITLE DATE                                   
PCQPROFS EQU   PCQPNL+054          PROFESSIONAL SERVICES                        
PCQBD8   EQU   PCQPNL+055          BILL DATE -MMMDD/YY                          
PCQBNS   EQU   PCQPNL+056          BILL NUMBER(SHORT) MM-9999                   
PCQHANDF EQU   PCQPNL+057          HANDLING FEE                                 
PCQPNBJ  EQU   PCQPNL+058          PRINT ON BILLS(JOB LEVEL)                    
PCQJC2   EQU   PCQPNL+059          JOB COMMENTS 2                               
*                                                                               
PCQBK    EQU   PCQPNL+80           ** BUCKET EQUATES **                         
PCQCTNET EQU   PCQBK+000           JOB CURRENT TOTAL  - NET                     
PCQCTCOM EQU   PCQBK+001                              - COMMISSION              
PCQCTGRS EQU   PCQBK+002                              - GROSS                   
PCQCTCD  EQU   PCQBK+003                              - CASH DISCOUNT           
*                                                                               
PCQBCNET EQU   PCQBK+004           BEFORE TAX 'CURRENT'- NET                    
PCQBCCOM EQU   PCQBK+005                               - COMMISSION             
PCQBCGRS EQU   PCQBK+006                               - GROSS                  
*                                                                               
PCQBXNET EQU   PCQBK+007           BEFORE TAX 'TOTAL' CHARGES - NET             
PCQBXCOM EQU   PCQBK+008                                      - COMM            
PCQBXGRS EQU   PCQBK+009                                      - GROSS           
*                                                                               
PCQJTNET EQU   PCQBK+010           JOB TOTAL - NET                              
PCQJTCOM EQU   PCQBK+011                     - COMMISSION                       
PCQJTGRS EQU   PCQBK+012                     - GROSS                            
PCQJTCD  EQU   PCQBK+013                     - DISCOUNT                         
PCQJTGST EQU   PCQBK+014                     - GST                              
PCQJTPST EQU   PCQBK+015                     - PST                              
*                                                                               
PCQSHPCT EQU   PCQBK+016           SHARE     - PCT                              
PCQSHUNT EQU   PCQBK+017                     - UNITS                            
PCQSHNET EQU   PCQBK+018                     - NET                              
PCQSHCOM EQU   PCQBK+019                     - COMMISSION                       
PCQSHGRS EQU   PCQBK+020                     - GROSS                            
*                                                                               
PCQTPNET EQU   PCQBK+021           TOTAL PREVIOUS BILLS - NET                   
PCQTPCOM EQU   PCQBK+022                                - COMMISSION            
PCQTPGRS EQU   PCQBK+023                                - GROSS                 
PCQTPCD  EQU   PCQBK+024                                - DISCOUNT              
*                                                                               
PCQDUNET EQU   PCQBK+025           AMOUNT DUE - NET                             
PCQDUCOM EQU   PCQBK+026                      - COMMISSION                      
PCQDUGRS EQU   PCQBK+027                      - GROSS                           
PCQDUABT EQU   PCQBK+028                      - AMOUNT BEFORE TAX               
PCQDURCV EQU   PCQBK+029                      - AMOUNT + TAX                    
PCQDUPAY EQU   PCQBK+030                      - PAY ABOVE                       
PCQDUGST EQU   PCQBK+031                      - GST                             
PCQDUPST EQU   PCQBK+032                      - PST                             
PCQDUNTX EQU   PCQBK+033                      - NET + TAX                       
*                                                                               
PCQPBNET EQU   PCQBK+034           PREVIOUS BILL - NET                          
PCQPBCOM EQU   PCQBK+035                         - COMM                         
PCQPBGRS EQU   PCQBK+036                         - GROSS                        
PCQPBCD  EQU   PCQBK+037                         - DISCOUNT                     
PCQPBDAT EQU   PCQBK+038                         - DATE                         
PCQPBREF EQU   PCQBK+039                         - REFERENCE                    
PCQPBTYP EQU   PCQBK+040                         - TYPE                         
*                                                                               
PCQBTNET EQU   PCQBK+041           TOTAL PREVIOUS BILLS - NET                   
PCQBTCOM EQU   PCQBK+042                                - COMMISSION            
PCQBTGRS EQU   PCQBK+043                                - GROSS                 
PCQBTCD  EQU   PCQBK+044                                - DISCOUNT              
PCQBTPAY EQU   PCQBK+045                                - PAYABLE               
*                                                                               
PCQTXTYP EQU   PCQBK+046           TAX - TYPE                                   
PCQTXREG EQU   PCQBK+047               - REGISTATION CODE                       
PCQTXBAS EQU   PCQBK+048               - BASIS                                  
PCQTXRAT EQU   PCQBK+049               - RATE                                   
PCQTXAMT EQU   PCQBK+050               - AMOUNT                                 
PCQTXDES EQU   PCQBK+051               - DESCRIPTION                            
*                                                                               
PCQLV    EQU   PCQBK+64            ** GROUP BILL BUCKETS **                     
PCQAOOP  EQU   PCQLV+000           LEVEL A OOP                                  
PCQAPSF  EQU   PCQLV+001                   PSF                                  
PCQANET  EQU   PCQLV+002                   NET                                  
PCQACOM  EQU   PCQLV+003                   COMMISSION                           
PCQACSD  EQU   PCQLV+004                   CD                                   
PCQATOT  EQU   PCQLV+005                   TOTAL                                
*                                                                               
PCQBOOP  EQU   PCQLV+006           LEVEL B OOP                                  
PCQBPSF  EQU   PCQLV+007                   PSF                                  
PCQBNET  EQU   PCQLV+008                   NET                                  
PCQBCOM  EQU   PCQLV+009                   COMMISSION                           
PCQBCSD  EQU   PCQLV+010                   CD                                   
PCQBTOT  EQU   PCQLV+011                   TOTAL                                
*                                                                               
PCQCOOP  EQU   PCQLV+012           LEVEL C OOP                                  
PCQCPSF  EQU   PCQLV+013                   PSF                                  
PCQCNET  EQU   PCQLV+014                   NET                                  
PCQCCOM  EQU   PCQLV+015                   COMMISSION                           
PCQCCSD  EQU   PCQLV+016                   CD                                   
PCQCTOT  EQU   PCQLV+017                   TOTAL                                
*                                                                               
PCQGOOP  EQU   PCQLV+018           CURRENT GROUP LEVEL OOP                      
PCQGPSF  EQU   PCQLV+019                               PSF                      
PCQGNET  EQU   PCQLV+020                               NET                      
PCQGCOM  EQU   PCQLV+021                               COMMISSION               
PCQGCSD  EQU   PCQLV+022                               CD                       
PCQGTOT  EQU   PCQLV+023                               TOTAL                    
PCQGGST  EQU   PCQLV+024                               GST                      
PCQGPST  EQU   PCQLV+025                               PST                      
PCQGTAX  EQU   PCQLV+026                               TOTAL TAX                
PCQGRCV  EQU   PCQLV+027                               RECEIVABLE               
         EJECT                                                                  
***********************************************************************         
* GLOBAL EQUATES                                                      *         
***********************************************************************         
YES      EQU   C'Y'                                                             
NO       EQU   C'N'                                                             
EOT      EQU   X'FF'                                                            
ALL      EQU   X'FF'                                                            
FF       EQU   X'FF'                                                            
*                                                                               
IOLNQ    EQU   2004                RECORD LENGTH                                
*                                                                               
MXSEC    EQU   50                  MAX SECTIONS                                 
MXPDL    EQU   3000                MAX PARAGRAPGH DETAILS                       
MXBTRN   EQU   6000                MAX BILLABLE TRANSACTION                     
MXWRK    EQU   ACMWCBN             MAX WORK CODES                               
MXESWC   EQU   200                 MAX ESTIMATED WORKCODES                      
MXNAMS   EQU   1000                MAX NAMES                                    
MXBESL   EQU   100                 MAX BESELDS                                  
MXINCL   EQU   100                 MAX INCELDS                                  
MXANAL   EQU   100                 MAX INCOME ANALYSIS ACCOUNTS                 
MXBFM    EQU   20                  MAX BILL FORMAT RECORDS                      
MXRTL    EQU   50                  MAX RETAILERS                                
MXICMP   EQU   300                 MAX INTERCOMPANY WORKCODES                   
MXUSRF   EQU   10                  MAX USER FIELDS                              
MXRATE   EQU   20                  MAX GST/PST RATE ENTRIES                     
MXDTL    EQU   20                  MAX GST/PST DETAIL ENTRIES                   
MXPRV    EQU   10                  MAX PROVINCE TAX TYPES                       
MXGRPA   EQU   40                  MAX GROUP ANALYSIS POINTERS                  
*                                                                               
MXTXT    EQU   9                   MAX NUMBER OF TEXT LINES                     
PLNQ     EQU   L'P                 WIDTH OF A LINE                              
*                                                                               
BFMRLNQ  EQU   (IOLNQ*3)           BFM RECORD + 2 CONTINUATIONS                 
SFTLNQ   EQU   (MXSEC*SFRLNQ)      SECTION FILTERS                              
SSTLNQ   EQU   (MXSEC*SSRLNQ)      SECTION SORTS                                
PDTLNQ   EQU   (MXPDL*PDRLNQ)      PARAGRAPH DETAILS                            
BTRNTLNQ EQU   (MXBTRN*BTRNLQ)     BILLABLE TRANSACTIONS                        
WRKTLNQ  EQU   (MXWRK*WRKCLNQ)     WORKCODES                                    
ESWCLNQ  EQU   (MXESWC*JXEWLNQ)                                                 
NAMSLNQ  EQU   (MXNAMS*ACCLNQ)     NAMES                                        
BESBLNQ  EQU   (MXBESL*BESLN2Q)    ESTIMATED                                    
INTBLNQ  EQU   (MXINCL*INTLLNQ)    INTERNAL INCOME TABLE                        
INCBLNQ  EQU   (MXINCL*INCLN2Q)    INTERNAL INCOME ELEMENT BUFFER               
ANLSLNQ  EQU   (MXANAL*ANLBLNQ)    ANALYSIS                                     
BFMBLNQ  EQU   (MXBFM*IOLNQ)       BUFFER OF ALL BFM RECORDS                    
RTLBLNQ  EQU   (MXRTL*RTLLNQ)      RETAILER BUFFER                              
ICWCLNQ  EQU   (MXICMP*ICMPLNQ)    INTERCOMPANY WC TABLE                        
USRBLNQ  EQU   (MXUSRF*USRFLNQ)    USER FIELD TABLE                             
GSTRLNQ  EQU   (MXRATE*CTXLNQ)     GST RATE TABLE                               
PSTRLNQ  EQU   (MXRATE*CTXLNQ)     PST RATE TABLE                               
GSTDLNQ  EQU   (MXDTL*CTDLLNQ)     GST DETAIL BUFFER                            
PSTDLNQ  EQU   (MXDTL*CTDLLNQ)     PST DETAIL BUFFER                            
PROTLNQ  EQU   (MXPRV*CPROLNQ)     PROVINCE TAX BY TYPE                         
LMNTLNQ  EQU   255                 ELEMENT                                      
GRPTLNQ  EQU   (MXGRPA*15)         GROUP ANALYSIS POINTERS                      
         EJECT                                                                  
***********************************************************************         
* DSECT TO COVER SECTION FILTER DATA                                  *         
***********************************************************************         
SFKD     DSECT ,                   SECTION FILTER KEY DATA                      
SFKLVL   DS    XL2                 LEVEL                                        
SFKSEC   DS    XL1                 SECTION                                      
SFKALL   DS    XL1                 CATCH ALL SECTION                            
SFKALLQ  EQU   X'FF'               MUST COME LAST                               
SFKLNQ   EQU   *-SFKD                                                           
SFNET    DS    PL6                 NET                                          
SFCOM    DS    PL6                 COMMISSION                                   
SFCSD    DS    PL6                 CASH DISCOUNT                                
SFEL     DS    50XL(SFELNQ)                                                     
SFRLNQ   EQU   *-SFKD                                                           
*                                                                               
SFED     DSECT ,                   SECTION FILTER ELEMENT                       
SFETYP   DS    XL1                 ELEMENT CODE ( = BSDSTYP)                    
SFELN    DS    XL1                 ELEMENT LENGTH                               
SFENUM   DS    XL1                 NUMBER OF ENTRIES                            
SFELNQ   EQU   *-SFED                                                           
SFEDATA  DS    0C                                                               
         EJECT                                                                  
***********************************************************************         
* DSECT TO COVER SECTION SORT AND TOTAL DATA                          *         
***********************************************************************         
SSKD     DSECT ,                   SECTION SORT KEY                             
SSKLVL   DS    XL2                 LEVEL                                        
SSKSEC   DS    XL1                 SECTION                                      
SSKWHR   DS    XL2                 WHERE                                        
SSKSUB   DS    XL1                 SUB-SECTION                                  
SSKLNQ   EQU   *-SSKD                                                           
SSDA     DS    XL4                 DISK ADDRESS                                 
SSTRNN   DS    XL2                 NUMBER OF TRANSACTIONS IN SECTION            
SSADVN   DS    XL2                     "     ADVANCES "                         
SSEL     DS    50XL(SSELNQ+1)                                                   
SSRLNQ   EQU   *-SSKD                                                           
*                                                                               
SSELD    DSECT ,                   SORT RECORD ELEMENT                          
SSEEL    DS    XL1                 ELEMENT CODE                                 
SSESRTQ  EQU   X'01'               FIELD DATA LIST FOR SORTING                  
SSETOTQ  EQU   X'02'               FIELD DATA AMOUNTS FOR TOTALLING             
SSELN    DS    XL1                 ELEMENT LENGTH                               
SSENUM   DS    XL1                 NUMBER OF ENTRIES                            
SSELNQ   EQU   *-SSELD                                                          
SSELIST  DS    0X                  LIST OF BLFFLDS                              
         EJECT                                                                  
***********************************************************************         
* DSECT TO COVER PARAGRAPH DETAILS                                    *         
***********************************************************************         
PDD      DSECT ,                   PARAGRAPGH DETAIL KEY                        
PDKLVL   DS    XL2                 LEVEL                                        
PDKSEC   DS    XL1                 SECTION                                      
PDKSORT  DS    XL240               SORT DATA                                    
PDKWHR   DS    XL2                 WHERE                                        
PDKSUB   DS    XL1                 SUB-SECTION                                  
PDKLNQ   EQU   *-PDD                                                            
PDNTRN   DS    XL2                 TRANSACTION                                  
PDNADV   DS    XL2                 ADVANCES                                     
PD1STADV DS    XL1                 FIRST ADVANCE SEQUENCE NUMBER                
PDDATA   DS    XL1000                                                           
PDRLNQ   EQU   *-PDD                                                            
*                                                                               
PARELD   DSECT                     ** PARAGRAPH RECORD ELEMENT **               
PAREL    DS    XL1                 ELEMENT CODE                                 
PARSRTQ  EQU   SSESRTQ             DATA FOR SORTING                             
PARTOTQ  EQU   SSETOTQ             TOTALLED DATA AMOUNT                         
PARLN    DS    XL1                 ELEMENT LENGTH                               
PARFLD   DS    XL1                 BLFFLD VALUE                                 
PARDLEN  DS    XL1                 DATA LENGTH                                  
PARLNQ   EQU   *-PARELD                                                         
PARDATA  DS    0C                                                               
PARAMT   DS    0PL8                AMOUNT (IFF DATA IS AMOUNT)                  
         EJECT                                                                  
***********************************************************************         
* DSECT FOR A BILLABLE TRANSACTION                                    *         
***********************************************************************         
BTRND    DSECT                                                                  
BTRNWC   DS    CL2                 WORKCODE                                     
BTRNCA   DS    CL15                CONTRA ACCOUNT                               
         ORG   BTRNCA                                                           
BTRNCCPY DS    XL1                 CONTRA - COMPANY                             
BTRNCUL  DS    CL2                        - UNIT LEDGER                         
BTRNCAC  DS    CL12                       - ACCOUNT                             
         ORG   BTRNCUL                                                          
BTRNCULA DS    CL14                UNIT/LEDGER/ACCOUNT                          
         ORG   BTRNCUL                                                          
BTRNSUP  DS    CL14                SUPPLIER                                     
BTRNDTE  DS    XL3                 DATE                                         
BTRNREF  DS    CL6                 REFERENCE                                    
BTRNSBR  DS    XL1                 SUB-REFERENCE                                
BTRNTYP  DS    XL1                 TRANSACTION TYPE                             
BTRNSTA  DS    XL1                 STATUS                                       
BTRNSSK  EQU   X'80'                SK REVERSAL REQUIRED                        
BTRNSNC  EQU   X'40'                ITEM IS NON-COMMISSIONABLE                  
BTRNSNEW EQU   X'20'                NEW TRANSACTION                             
BTRNSUQH EQU   X'10'                UNITS ARE QUARTER HOURS                     
BTRNSSK2 EQU   X'08'                SET SK TO SI DATE(TRNSK2SI)                 
BTRNSUNB EQU   X'04'                UNBILL THIS ITEM                            
BTRNSLIN EQU   X'02'                TRANSACTION HAS A LONG INVOICE#             
BTRNSASR EQU   X'01'                ASP REVERSAL                                
BTRNSTA2 DS    XL1                 STATUS - 2                                   
BTRNSMKU EQU   X'80'                MARK AS USED - CLIENT BILL(A27)             
BTRNBTYP DS    CL15                BILL TYPE (PREVIOUS BILLS ONLY)              
BTRNPORM DS    XL1                  PRODUCTION OR MEDIA TRANSFER                
BTRNPROD EQU   C'P'                 PRODUCTION                                  
BTRNMEDA EQU   C'M'                 MEDIA                                       
BTRNUSD  DS    XL2                 USED DATE                                    
BTRNWCTY DS    CL1                 WORKCODE TYPE                                
         DS    XL2                 N/D                                          
BTRNDA   DS    XL4                 DISK ADDRESS                                 
BTRNBILR DS    PL4                 BILLING RATE                                 
BTRNCOMR DS    PL4                 COMMISSION RATE                              
BTRNUNTS DS    PL3                 UNITS                                        
BTRNUPRC DS    PL4                 UNIT PRICE(2DP)                              
BGSTTYPE DS    CL(L'CTXTYPE)       GST TYPE                                     
BPSTTYPE DS    CL(L'CTXTYPE)       PST TYPE                                     
BPSTPROV DS    CL(L'CTXPROV)       PST PROV                                     
BKLQ     EQU   8                                                                
BKL      DS    0PL(BKLQ)                                                        
BTRNBK   DS    XL(JOBLNQ)          JOB BUCKETS                                  
BGSTBK   DS    XL(CTAXLNQ)         GST BUCKETS                                  
BPSTBK   DS    XL(CTAXLNQ)         PST BUCKETS                                  
BTBKLNQ  EQU   (*-BKL)                                                          
BTBKN    EQU   (BTBKLNQ)/BKLQ                                                   
BTRNNUM  DS    XL2                 RECORD NUMBER                                
BTRNLQ   EQU   *-BTRND                                                          
         EJECT                                                                  
JOBD     DSECT                                                                  
JOBNET   DS    PL(BKLQ)            NET                                          
JOBCOM   DS    PL(BKLQ)            COMMISSION                                   
JOBGRS   DS    PL(BKLQ)            GROSS                                        
JOBCD    DS    PL(BKLQ)            CASH DISCOUNT                                
JOBHRS   DS    PL(BKLQ)            HOURS                                        
JOBBN    EQU   (*-JOBD)/BKLQ                                                    
JOBLNQ   EQU   *-JOBD                                                           
         EJECT                                                                  
***********************************************************************         
* DSECT FOR  CANADIAN TAX ITEMS                                       *         
***********************************************************************         
CTDLD    DSECT                                                                  
CTDLTXI  DS    XL(CTXLNQ)          TYPE AND ACCOUNT INFO                        
CTDLTXB  DS    XL(CTAXLNQ)         TAX BUCKETS                                  
CTDLLNQ  EQU   *-CTDLD                                                          
                                                                                
***********************************************************************         
* DSECT FOR  CANADIAN TAX TYPE AND ACCOUNT INFO                       *         
***********************************************************************         
CTXD     DSECT                                                                  
CTXREG   DS    XL(L'VTCREG)        REGISTRATION NUMBER                          
CTXRATE  DS    XL(L'VTCRATE)       RATE                                         
CTXTYPE  DS    XL(L'VTCTYPE)       TYPE                                         
CTXSORTL EQU   *-CTXD                                                           
CTXDATE  DS    XL(L'VTCINVD)       DATE(PWOS)                                   
CTXEFFD  DS    XL(L'VTCEFFD)       EFFECTIVE DATE                               
CTXACCT  DS    XL(L'VTCACT)        ACCOUNT                                      
CTXPROV  DS    CL(L'VTCPRV)        PROVINCE (GST = ZEROS)                       
CTXPRVD  DS    XL(L'VTCPRVD)       PROVINCE DESCRIPTION                         
CTXLNQ   EQU   *-CTXD                                                           
                                                                                
***********************************************************************         
* DSECT FOR  CANADIAN TAX BUCKETS                                     *         
***********************************************************************         
CTAXD    DSECT                                                                  
CTAXTAX  DS    PL(BKLQ)            GST/PST                                      
CTAXGRS  DS    PL(BKLQ)            GROSS BILLED (NET+COMM+TAX)                  
CTAXCOM  DS    PL(BKLQ)            COMMISSION BILLED                            
CTAXPB   DS    PL(BKLQ)            TAX PREVIOULY BILLED                         
CTAXRTL  DS    0X                  RETAIL SHARE OF:                             
CTAXRTX  DS    PL(BKLQ)            GST/PST                                      
CTAXRTG  DS    PL(BKLQ)            GROSS BILLED (NET+COMM+TAX)                  
CTAXRTC  DS    PL(BKLQ)            COMMISSION BILLED                            
CTAXRTN  EQU   (*-CTAXRTL)/BKLQ                                                 
CTAXBN   EQU   (*-CTAXD)/BKLQ                                                   
CTAXLNQ  EQU   *-CTAXD                                                          
                                                                                
***********************************************************************         
* DSECT FOR  CANADIAN PROVINCE TAX TOTALS BY TYPE                     *         
***********************************************************************         
CPROD    DSECT                                                                  
CPRODES  DS    XL(L'VTCPRVD)       DESCRIPTION                                  
CPROTXB  DS    XL(CTAXLNQ)         TAX BUCKETS                                  
CPROLNQ  EQU   *-CPROD                                                          
         EJECT                                                                  
***********************************************************************         
* DSECT FOR  INTERNAL INCOME TABLE                                              
***********************************************************************         
INTLD    DSECT                                                                  
INTLWKC  DS    CL2                 WORKCODE                                     
INTLCUR  DS    PL6                 CURRENT VALUE                                
INTLPRV  DS    PL6                 PREVIOUS POSTINGS                            
INTLACL  DS    PL6                 CUMULATIVE ACCRUAL                           
INTLAMNT DS    PL6                 CURRENT POSTING AMOUNT                       
INTLINAM DS    PL6                 INCOME ACCRUAL                               
INTLCRAC DS    CL(L'INCCACC)       CREDIT ACCOUNT                               
INTLDRAC DS    CL(L'INCDACC)       DEBIT ACCOUNT                                
INTLSTAT DS    XL1                 STATUS                                       
INTLSCUR EQU   X'80'               CURRENT ITEM                                 
INTLLNQ  EQU   *-INTLD                                                          
         EJECT                                                                  
***********************************************************************         
* DSECT FOR INTERCOMPANY WORKCODE TOTALS                                        
***********************************************************************         
ICMPD    DSECT                                                                  
ICMPWC   DS    CL2                 WORKCODE                                     
ICMPAMT  DS    PL6                 AMOUNT                                       
ICMPLNQ  EQU   *-ICMPD                                                          
         EJECT                                                                  
***********************************************************************         
* DSECT FOR DATA DEFINITION ENTRY                                     *         
***********************************************************************         
DDD      DSECT ,                   DATA DEFINITION                              
DDBDS    DS    S                   BASE/DISPLACEMENT                            
         ORG   DDBDS                                                            
DDDIS    DS    AL2                 DISPLACEMENT                                 
DDLEN    DS    XL1                 LENGTH                                       
DDTYP    DS    XL1                 TYPE                                         
DDTCH    EQU   1                    CHARACTER                                   
DDTBI    EQU   2                    BINARY                                      
DDTMK    EQU   3                    MASK                                        
DDTPK    EQU   4                    PACKED                                      
DDLNQ    EQU   *-DDD                                                            
                                                                                
***********************************************************************         
* DSECT FOR KEY OF WORKCODE SUMMARY RECORDS                           *         
***********************************************************************         
WRKSD    DSECT                                                                  
WRKSWC   DS    CL2                 WORKCODE                                     
WRKSST   DS    XL1                 STATUS (SEE WRKCSTA)                         
WRKSAMTS DS    XL(JXBKRLQ)         PRODUCTION AMOUNTS                           
WRKSGST  DS    XL(CTAXLNQ)         GST BUCKETS                                  
WRKSPST  DS    XL(CTAXLNQ)         PST BUCKETS                                  
WRKSLNQ  EQU   *-WRKSD                                                          
         EJECT                                                                  
*********************************************************************           
* DSECT FOR SORT RECORDS                                            *           
*********************************************************************           
SORTD    DSECT                                                                  
SRLEN    DS    XL2                 LENGTH                                       
         DS    XL2                                                              
SKEY     DS    0X                                                               
SKRUN    DS    0XL2                                                             
SKRUNQ   EQU   X'FFFF'             END OF RUN                                   
SKRQN    DS    XL2                 REQUEST NUMBER                               
SKRQRT   DS    XL1                 REPORT TYPE (WITHIN REQUEST)                 
SKRQRDQ  EQU   1                   REQUEST DETAILS                              
SKRQBLQ  EQU   2                   BILLS                                        
SKRQSMQ  EQU   2                   CLIENT / PRODUCT SUMMARIES                   
SKRQGBQ  EQU   2                   GROUP BILL                                   
SKRQGSQ  EQU   3                   GROUP SUMMARY(27 ONLY)                       
*                                                                               
SKRNRT   DS    XL1                 REPORT TYPE (RUN)                            
SKRNBRQ  EQU   BILREG              BILLING REGISTAR                             
SKRNMSQ  EQU   MEDSUM              MEDIA SUMMARY                                
SKRNIIQ  EQU   INTINV              INTERNAL INVOICE BILLING SUMMARY             
SKRNTGQ  EQU   TARGET              REGISTER OF TARGET ACCOUNTS                  
SKRNICQ  EQU   INTINC              INTERNAL INCOME REGISTER                     
SKRNSPQ  EQU   STUINP              STUDIO INTERCOMPANY POSTING REGISTER         
SKRNPXQ  EQU   INPEXC              INTERCOMPANY POSTING EXCEPTION RPT           
SKRNPBQ  EQU   POBREG              PERCENT OF BILLING REGISTER                  
SKRNASQ  EQU   ASPREG              ASP REGISTER                                 
SKRNGTQ  EQU   GBTRAS              GROUP BILL TRACE SUMMARY                     
SKRNNBQ  EQU   NONBIL              SUMMARY OF NON-BILLABLE JOBS6                
SKRNENQ  EQU   X'FF'               END OF RUN                                   
         ORG                                                                    
*                                                                               
SKVKEY   DS    XL80                VARIABLE SORT KEY - BY TYPE                  
SKLNQ    EQU   *-SKEY                                                           
*                                                                               
SRSTATUS DS    0XL6                STATUS AREA                                  
SRREPTN  DS    XL1                 REPORT NUMBER                                
SRSTAT   DS    XL1                 STATUS                                       
SRPRNT   EQU   X'80'                PRINTED BILLS FOR THIS REQUEST              
SRPWC    EQU   X'40'                PRINT WITH COMMAS                           
         DS    XL4                 N/D                                          
*                                                                               
SRLNQ    EQU   *-SRLEN                                                          
*        EJECT                                                                  
         ORG   SKVKEY                                                           
BILK     DS    0X                  SORT KEY FOR BILLS                           
BILKGRP  DS    CL12                GROUP BILL (CLI/PROD/JOB)                    
BILKLVL  DS    XL2                 LEVEL(BILL HEADER THRU BILL EDIT)            
BILKCLI  DS    CL(L'CLI)           CLIENT                                       
         DS    XL2                  MUST BE ZERO                                
BILKPRD  DS    CL(L'PRD)           PRODUCT                                      
         DS    XL1                  MUST BE ZERO                                
*                                                                               
BILKJOB  DS    CL(L'JOB)           JOB                                          
BILKBIL  DS    XL1                 BILL                                         
BILKBILQ EQU   1                    BILLS BEFORE SUMMARIES                      
BILKRET  DS    XL1                 RETAIL SEQUENCE NUMBER                       
BILKRT   DS    XL1                 RECORD TYPE (FOR BILLS)                      
BILKRCLI EQU   10                   CLIENT RECORD                               
BILKRPRD EQU   20                   PRODUCT RECORD                              
BILKRJOB EQU   30                   JOB RECORD                                  
BILKRPRV EQU   40                   PREVIOUS BILLS                              
BILKRBFM EQU   50                   FORMAT RECORD                               
BILKRBHD EQU   60                   BILL HEADER                                 
BILKRUPP EQU   70                   UPPER                                       
BILKRUPC EQU   BILKRUPP+1           UPPER JOB COMMENT                           
BILKRPGH EQU   80                   PAGE HEADER                                 
BILKRPH2 EQU   81                   PAGE HEADER 2                               
BILKRPGF EQU   90                   PAGE FOOTER                                 
BILKRBED EQU   100                  BILL EDIT RECORD                            
BILKRKEY DS    CL42                RECORD KEY                                   
         ORG   SKVKEY+L'SKVKEY+L'SRSTATUS                                       
*                                                                               
SRDATA   DS    XL(IOLNQ)           SORT RECORD DATA                             
SRDLNQ   EQU   *-SORTD                                                          
                                                                                
*  DSECT FOR THE CLIENT/PRODUCT SUMMARIES                                       
         ORG   SKVKEY                                                           
CPSK     DS    0X                                                               
CPSKGRP  DS    CL12                GROUP BILL (CLI/PROD)                        
CPSKLVL  DS    XL2                                                              
CPSKCLI  DS    CL(L'CLI)           CLIENT                                       
CPSKCLME DS    XL1                  MEDIA (FOR CLIENT SUMMARY)                  
CPSKCMTO DS    XL1                  MEDIA TOTAL                                 
CPSKPRD  DS    CL(L'PRD)           PRODUCT                                      
CPSKPRME DS    XL1                  MEDIA (FOR PRODUCT SUMMARY)                 
CPSKJOB  DS    CL(L'JOB)            JOB                                         
CPSKSUM  DS    XL1                 SUMMARY                                      
CPSKSUMQ EQU   2                    SUMMARIES AFTER BILLS                       
CPSKOTH  DS    CL(L'BILOTHR)       OTHER NUMBER                                 
CPSKBNUM DS    CL(L'LNGBILNO)      BILL NUMBER                                  
*                                                                               
         ORG   SRDATA                                                           
CPSDATA  DS    0X                                                               
CPSBDTE  DS    XL(L'BILDT1)         BILL DATE(PWOS)                             
CPSMED   DS    CL12                 MEDIA NAME                                  
CPSCLIN  DS    CL36                 CLIENT NAME                                 
CPSPRDN  DS    CL36                 PRODUCT NAME                                
CPSPRVD  DS    CL(L'CTXPRVD)        PROVINCE                                    
CPSBK    DS    0PL(L'BK$)                                                       
CPSNET   DS    PL(L'BK$)            NET                                         
CPSCOM   DS    PL(L'BK$)            COMMISSION                                  
CPSGRS   DS    PL(L'BK$)            GROSS                                       
CPSGST   DS    PL(L'BK$)            GST                                         
CPSPST   DS    PL(L'BK$)            PST                                         
CPSBKN   EQU   (*-CPSBK)/L'CPSBK                                                
CPSDLNQ  EQU   *-CPSDATA                                                        
         EJECT                                                                  
*  DSECT FOR THE GROUP/BILL SUMMARY                                             
         ORG   SKVKEY                                                           
GBSK     DS    0X                                                               
GBSKLVL  DS    XL2                                                              
GBSKCLI  DS    CL(L'CLI)           CLIENT                                       
         DS    XL1                 MUST BE ZERO                                 
GBSKPRD  DS    CL(L'PRD)           PRODUCT                                      
GBSKPALL DS    XL1                 X'FF'                                        
GBSKFMT  DS    CL1                 FORMAT                                       
GBSKPOM  DS    CL1                 PRODUCTION OR MEDIA                          
GBSKPMPQ EQU   1                   PRODUCTION                                   
GBSKPMMQ EQU   2                   MEDIA                                        
GBSKMED  DS    0CL1                JOB MEDIA CODE                               
GBSKJOB  DS    CL(L'JOB)           JOB                                          
GBSKWKC  DS    CL2                 WORKCODE                                     
GBSKX    DS    0X                                                               
*                                                                               
         ORG   SRDATA                                                           
GBSDATA  DS    0X                                                               
GBSBDTE  DS    XL(L'BILDT1)        BILL DATE (PW0S)                             
GBSDDTE  DS    XL(L'DUEDT2)        DUE DATE  (COMPRESSED)                       
GBSLBN   DS    CL(L'LNGBILNO)      LONG BILL NUMBER                             
GBSSBN   DS    CL(L'SHTBILNO)      SHORT BILL NUMBER                            
GBSMED   DS    CL12                MEDIA NAME                                   
GBSCLIN  DS    CL36                CLIENT NAME                                  
GBSPRDN  DS    CL36                PRODUCT NAME                                 
GBSJOBN  DS    CL36                JOB NAME                                     
GBSPONB  DS    CL50                PRINT ON BILLS                               
GBSWRKN  DS    CL36                WORKCODE NAME                                
         ORG   GBSWRKN                                                          
GBSBLNME DS    CL15                                                             
         ORG   GBSWRKN+L'GBSWRKN                                                
GBSADR1  DS    CL(L'ADRADD1)                                                    
GBSADR2  DS    CL(L'ADRADD2)                                                    
GBSADR3  DS    CL(L'ADRADD3)                                                    
GBSADR4  DS    CL(L'ADRADD4)                                                    
GBSADR5  DS    CL(L'ADRADD5)                                                    
*                                                                               
GBSBK    DS    0PL(L'BK$)                                                       
GBSDUE   DS    PL(L'BK$)            AMOUNT DUE                                  
GBSNET   DS    PL(L'BK$)                                                        
GBSCOM   DS    PL(L'BK$)                                                        
GBSGRS   DS    PL(L'BK$)                                                        
GBSCSD   DS    PL(L'BK$)                                                        
GBSTAX   DS    PL(L'BK$)                                                        
GBSBKN   EQU   (*-GBSBK)/L'GBSBK                                                
GBSDLNQ  EQU   *-GBSDATA                                                        
         EJECT                                                                  
*  DSECTS FOR END OF RUN RECORDS                                                
*                                                                               
*  DSECT FOR PRODUCTION BILLING REGISTER REPORT                                 
         ORG   SKVKEY                                                           
BLRK     DS    0X                                                               
BLRKSEQ  DS    XL2                   RUN SEQUENCE                               
BLRKCLI  DS    CL(L'CLI)             CLIENT                                     
BLRKMED  DS    CL(L'MEDIA)           MEDIA                                      
BLRKPRD  DS    CL(L'PRD)             PRODUCT                                    
BLRKJOB  DS    CL(L'JOB)             JOB                                        
         ORG   SRDATA                                                           
BLRDATA  DS    0X                                                               
BLRBDTE  DS    XL(L'BILDT1)          BILL DATE(PWOS)                            
BLRBNUM  DS    CL(L'LNGBILNO)        BILL NUMBER                                
BLRPRVD  DS    CL(L'CTXPRVD)         PROVINCE                                   
BLRBK    DS    0PL(L'BK$)                                                       
BLRACT   DS    PL(L'BK$)             ACTUAL                                     
BLRNET   DS    PL(L'BK$)             NET                                        
BLRCOM   DS    PL(L'BK$)             COMMISSION                                 
BLRGRS   DS    PL(L'BK$)             GROSS                                      
BLRCSD   DS    PL(L'BK$)             C.D.                                       
BLRGST   DS    PL(L'BK$)             GST                                        
BLRPST   DS    PL(L'BK$)             PST                                        
BLRBKN   EQU   (*-BLRBK)/L'BLRBK                                                
BLRDLNQ  EQU   *-BLRDATA                                                        
*                                                                               
*  DSECT FOR MEDIA SUMMARY REPORT                                               
         ORG   SKVKEY                                                           
MSRK     DS    0X                                                               
MSRKCDE  DS    CL1                 MEDIA CODE                                   
         ORG   SRDATA                                                           
MSRDATA  DS    0X                                                               
MSRNAME  DS    CL12                  MEDIA NAME                                 
MSRBK    DS    0PL(L'BK$)                                                       
MSRACT   DS    PL(L'BK$)             ACTUAL                                     
MSRNET   DS    PL(L'BK$)             NET                                        
MSRCOM   DS    PL(L'BK$)             COMMISSION                                 
MSRGRS   DS    PL(L'BK$)             GROSS                                      
MSRCSD   DS    PL(L'BK$)             C.D.                                       
MSRGST   DS    PL(L'BK$)             GST.                                       
MSRPST   DS    PL(L'BK$)             PST.                                       
MSRBKN   EQU   (*-MSRBK)/L'MSRBK                                                
MSRDLNQ  EQU   *-MSRDATA                                                        
*                                                                               
*  DSECT FOR INTERNAL INVOICE BILLING SUMMARY (SK REVERSALS)                    
         ORG   SKVKEY                                                           
INIK     DS    0X                                                               
INIKJOB  DS    CL12                CPJ                                          
INIKWC   DS    CL(L'TRNKWORK)      WORKCODE                                     
INIKOTH  DS    CL(L'BILOTHR)       OTHER NUMBER                                 
INIKNUM  DS    CL(L'LNGBILNO)      BILL NUMBER                                  
         ORG   SRDATA                                                           
INIDATA  DS    0X                                                               
INIACT   DS    CL12                INCOME ACCOUNT                               
INIBDTE  DS    XL(L'BILDT1)         BILL DATE(PWOS)                             
INIREF   DS    CL(L'TRNKREF)        TRANSACTION REFERENCE                       
INIBK    DS    0PL(L'BK$)                                                       
INIAMT   DS    PL(L'BK$)             AMOUNT                                     
INIBKN   EQU   (*-INIBK)/L'INIBK                                                
INIDLNQ  EQU   *-INIDATA                                                        
*                                                                               
*  DSECT FOR REGISTER OF TARGET ACCOUNTS                                        
         ORG   SKVKEY                                                           
RTAK     DS    0X                                                               
RTACLI   DS    CL(L'CLI)           CLIENT                                       
RTAPRD   DS    CL(L'PRD)           PRODUCT                                      
RTAJOB   DS    CL(L'JOB)           JOB                                          
         ORG   SRDATA                                                           
RTADATA  DS    0X                                                               
RTABDTE  DS    XL(L'BILDT1)         BILL DATE(PWOS)                             
RTABNUM  DS    CL(L'LNGBILNO)       BILL NUMBER                                 
RTARCV   DS    CL(L'ACTKACT)        RECEIVABLE                                  
RTSCST   DS    CL(L'ACTKACT)        COSTING                                     
RTASLS   DS    CL(L'ACTKACT)        SALES                                       
RTSDLNQ  EQU   *-RTADATA                                                        
*                                                                               
*  DSECT FOR INTERNAL INCOME REGISTER                                           
         ORG   SKVKEY                                                           
INCK     DS    0X                                                               
INCKCLI  DS    CL(L'CLI)           CLIENT                                       
INCKPRD  DS    CL(L'PRD)           PRODUCT                                      
INCKJOB  DS    CL(L'JOB)           JOB                                          
INCKJLNQ EQU   *-INCK                                                           
INCKNUM  DS    CL(L'LNGBILNO)      BILL NUMBER                                  
INCKWC   DS    CL(L'TRNKWORK)      WORKCODE                                     
         ORG   SRDATA                                                           
INCDATA  DS    0X                                                               
INCBNUM  DS    CL(L'LNGBILNO)       BILL NUMBER                                 
INCCRAC  DS    CL(L'ACTKULA)        CREDIT ACCOUNT                              
INCDRAC  DS    CL(L'ACTKULA)        DEBIT ACCOUNT                               
INCBK    DS    0PL(L'BK$)                                                       
INCINC   DS    PL(L'BK$)            INCOME                                      
INCPOST  DS    PL(L'BK$)            POSTING                                     
INCBKN   EQU   (*-INCBK)/L'INCBK                                                
INCDLNQ  EQU   *-INCDATA                                                        
*                                                                               
*  DSECT FOR STUDIO INTERCOMPANY POSTING REGISTER                               
         ORG   SKVKEY                                                           
SIPK     DS    0X                                                               
SIPKSTUD DS    CL(L'AGYSTUD)       STUDIO                                       
SIPKMED  DS    CL(L'MEDIA)         MEDIA                                        
SIPKCLI  DS    CL(L'CLI)           CLIENT                                       
SIPKPRD  DS    CL(L'PRD)           PRODUCT                                      
SIPKJOB  DS    CL(L'JOB)           JOB                                          
         ORG   SRDATA                                                           
SIPDATA  DS    0X                                                               
SIPBDTE  DS    XL(L'BILDT1)         BILL DATE                                   
SIPBNUM  DS    CL(L'LNGBILNO)       BILL NUMBER                                 
SIPAGJOB DS    CL(L'AGYLCPJ)        AGENCY JOB                                  
SIPCRAC  DS    CL(L'ACTKULA)        CREDIT ACCOUNT                              
SIPBK    DS    0PL(L'BK$)                                                       
SIPAMT   DS    PL(L'BK$)            AMOUNT                                      
SIPBKN   EQU   (*-SIPBK)/L'SIPBK                                                
SIPDLNQ  EQU   *-SIPDATA                                                        
*                                                                               
*  DSECT FOR INTERCOMPANY EXCEPTION REPORT                                      
         ORG   SKVKEY                                                           
ICXK     DS    0X                                                               
ICXKCLI  DS    CL(L'CLI)           CLIENT                                       
ICXKPRD  DS    CL(L'PRD)           PRODUCT                                      
ICXKJOB  DS    CL(L'JOB)           JOB                                          
ICXKSTUD DS    CL(L'AGYSTUD)       STUDIO                                       
ICXKAGYJ DS    CL(L'AGYLCPJ)       CLI/PROD/JOB                                 
         ORG   SRDATA                                                           
ICXDATA  DS    0X                                                               
ICXBDTE  DS    XL(L'BILDT1)         BILL DATE                                   
ICXBNUM  DS    CL(L'LNGBILNO)       BILL NUMBER                                 
ICXWARN  DS    XL1                  WARNING NUMBER                              
ICXWXJOB EQU   1                    X-JOB                                       
ICXDLNQ  EQU   *-ICXDATA                                                        
*                                                                               
*  DSECT FOR PERCENT OF BILL REGISTER REPORT                                    
         ORG   SKVKEY                                                           
POBRK    DS    0X                                                               
POBRKCLI DS    CL(L'CLI)           CLIENT                                       
POBRKPRD DS    CL(L'PRD)           PRODUCT                                      
POBRKJOB DS    CL(L'JOB)           JOB                                          
         ORG   SRDATA                                                           
POBRDATA DS    0X                                                               
POBRACC  DS    CL(L'POBACC-1)     VENDOR ACCOUNT                                
POBRWRK  DS    CL(L'POBWRK)        WORKCODE                                     
POBRNUM  DS    CL(L'LNGBILNO)      BILL NUMBER                                  
POBRBK   DS    0PL(L'BK$)                                                       
POBRAMT  DS    PL(L'POBAMT)        AMOUNT                                       
POBRBKN  EQU   (*-POBRBK)/L'POBRBK                                              
POBRDLNQ EQU   *-POBRDATA                                                       
*                                                                               
*  DSECT FOR ASP POSTING REPORT REPORT                                          
         ORG   SKVKEY                                                           
ASPRK    DS    0X                                                               
ASPRKCLI DS    CL(L'CLI)           CLIENT                                       
ASPRKPRD DS    CL(L'PRD)           PRODUCT                                      
ASPRKJOB DS    CL(L'JOB)           JOB                                          
ASPRKNUM DS    CL(L'LNGBILNO)      BILL NUMBER                                  
ASPRKLNQ EQU   *-ASPRK                                                          
         ORG   SRDATA                                                           
ASPRDATA DS    0X                                                               
ASPRACC  DS    CL(L'ASPACC-1)      INCOME POSTING ACCOUNT                       
ASPRWRK  DS    CL(L'ASPWRK)        WORKCODE                                     
ASPRBK   DS    0PL(L'BK$)                                                       
ASPRAMT  DS    PL(L'ASPAMT)        AMOUNT                                       
ASPRBKN  EQU   (*-ASPRBK)/L'ASPRBK                                              
ASPRDLNQ EQU   *-ASPRDATA                                                       
*                                                                               
*  DSECT FOR THE CLIENT GROUP BILL(AC27)                                        
         ORG   SKVKEY                                                           
GBCK     DS    0X                                                               
GBCKCLI  DS    CL(L'CLI)           CLIENT                                       
GBCKBDTE DS    XL3                 BILL DATE                                    
GBCKBK1  EQU   *-GBCK                                                           
GBCKBNUM DS    CL6                 BILL NUMBER                                  
GBCKOBN  DS    CL6                 ORIGINAL BILL NUMBER                         
GBCKOBD  DS    XL3                 ORIGINAL BILL DATE                           
GBCKBK2  EQU   *-GBCK                                                           
GBCKX    DS    0X                                                               
*                                                                               
         ORG   SRDATA                                                           
GBCDATA  DS    0X                                                               
GBCFORM  DS    CL1                 FORMAT                                       
GBCLVL   DS    CL1                 LEVEL                                        
GBCFDTE  DS    XL2                 FROM DATE                                    
GBCTDTE  DS    XL2                 TO DATE                                      
GBCTYPE  DS    CL1                 TYPE                                         
GBCRDTE  DS    XL3                 RUN DATE                                     
GBCDDTE  DS    XL3                 DUE DATE                                     
GBCRECA  DS    XL15                RECEIVABLE ACCOUNT                           
GBCROFF  DS    CL2                 RECEIVABLE OFFICE                            
GBCUBIL  DS    CL6                 UNBILL NUMBER                                
GBCUDTE  DS    CL3                 UNBILL DATE                                  
*                                                                               
GBCBK    DS    0PL(L'BK$)                                                       
GBCPAY   DS    PL(L'BK$)           SJ AMOUNT                                    
GBCREC   DS    PL(L'BK$)           SR AMOUNT                                    
GBCINC   DS    PL(L'BK$)           12 AMOUNT                                    
GBCGRS   DS    PL(L'BK$)           11 AMOUNT                                    
GBCCSD   DS    PL(L'BK$)           CD                                           
GBCINT   DS    PL(L'BK$)           INTERNAL INCOME                              
GBCTIM   DS    PL(L'BK$)           TIME                                         
GBCOOP   DS    PL(L'BK$)           OUT-OF-POCKET                                
GBCPRV   DS    PL(L'BK$)           PREVIOUSLY BILLED                            
GBCPRE   DS    PL(L'BK$)           PRE-BILLING                                  
GBCRET   DS    PL(L'BK$)           RETAINER                                     
GBCPRT   DS    PL(L'BK$)           PRINT                                        
GBCBKN   EQU   (*-GBCBK)/L'GBCBK                                                
GBCDLNQ  EQU   *-GBCDATA                                                        
*                                                                               
*  DSECT FOR NON-BILLABLE JOB REPORT                                            
         ORG   SKVKEY                                                           
NBJK     DS    0X                  SORT KEY FOR EXCEPTION REPORT                
NBJKRQN  DS    XL(L'RCRQTOT)         REQUEST NUMBER                             
NBJKCLI  DS    CL(L'CLI)             CLIENT                                     
NBJKPRD  DS    CL(L'PRD)             PRODUCT                                    
NBJKJOB  DS    CL(L'JOB)             JOB                                        
         ORG   SRDATA                                                           
NBJDATA  DS    0X                                                               
NBJERR   DS    XL10                   JOB EXCEPTIONS                            
NBJOTH   DS    XL1                   'OTHER' ERRORS                             
NBJDESC  DS    CL50                   FURTHER DESCRIPTION                       
NBJDLNQ  EQU   *-NBJDATA                                                        
         EJECT                                                                  
***********************************************************************         
* DSECT FOR THE SEARCH TABLE DEFINITIONS                              *         
***********************************************************************         
TABD     DSECT                     DSECT TO COVER TABLE DEFINITIONS             
TABSTA   DS    XL1                 STATUS                                       
TABSHI   EQU   X'80'               TABLE IS IN HIGH CORE                        
         DS    XL3                 N/D                                          
*                                                                               
TABREC   DS    A                   A(NEW RECORD)                                
TABADR   DS    A                   A(START OF THE TABLE)                        
TABNUM   DS    A                   NUMBER OF RECORDS                            
TABLEN   DS    A                   L'RECORD                                     
TABKYD   DS    XL1                 DISPLACEMENT TO KEY                          
TABKYL   DS    XL3                 L'KEY                                        
TABMAX   DS    A                   MAXIMUM NUMBER IN TABLE                      
*                                                                               
TABRTN   DS    A                   A(RECORD IN BIN TABLE)                       
         ORG   TABRTN                                                           
TABFND   DS    XL1                 RECORD STATUS IN BINARY TABLE                
TABFNDQ  EQU   0                   RECORD FOUND                                 
TABADDQ  EQU   1                   RECORD NOT FOUND ADDED                       
         ORG   TABRTN+L'TABRTN                                                  
*                                                                               
TABARG   DS    A                   A(SEARCH ARGUMENT)                           
TABLST   DS    A                   A(LAST ITEM RETURNED)                        
TABSRC   DS    5F                  BINARY SEARCH PARAMETERS                     
TABLNQ   EQU   *-TABD                                                           
         EJECT                                                                  
***********************************************************************         
* DSECT FOR THE PROFILE TABLE                                         *         
***********************************************************************         
PRFD     DSECT                                                                  
PRFLEN   DS    AL1      LENGTH OF THIS ENTRY                                    
PRFPGM   DS    AL1      PROGRAM(S) THAT USE THIS PROFILE                        
PRFOPT   DS    AL1      DISPLACEMENT TO OPTION FIELD                            
PRFSTA   DS    AL1      STATUS                                                  
PRFS1LVL EQU   X'01'    ONE LEVEL BACK/FORWARD IF NULL VALUE                    
PRFS2LVL EQU   X'02'    TWO LEVELS BACK/FORWARD IF NULL VALUE                   
PRFS3LVL EQU   X'03'    THREE LEVELS BACK/FORWARD IF NULL VALUE                 
PRFSLVBK EQU   X'80'    LOOK BACK N LEVELS                                      
PRFSINP  EQU   X'40'    USE INPUT VALUE                                         
PRFSQOPT EQU   X'20'    REQUEST OPTION                                          
PRFNOT   DS    AL1      BITS TO TURN OFF (FOR REQUEST OPTIONS ONLY)             
PRFFLD   DS    AL2      DISPLACEMENT TO PROFILE/OPTION VALUE                    
PRFNUM   DS    AL1      NUMBER OF INPUT OPTIONS                                 
PRFDATA  DS    0XL2     INPUT OPTION/OPTION BIT SETTINGS                        
PRFINPT  DS    CL1      INPUT VALUE (SPACE SIGNIFIES DEFAULT)                   
PRFOBIT  DS    AL1      OPTION BIT SETTING                                      
         EJECT                                                                  
***********************************************************************         
* DSECT FOR DICTIONARY ITEMS                                          *         
***********************************************************************         
DICD     DSECT                                                                  
DD@ACC   DS    CL7                 ACCOUNT CODE                                 
DD@ACC#  DS    CL15                ACCOUNT #                                    
DD@ACL   DS    CL6                 ACTUAL                                       
DD@AGY   DS    CL6                 AGENCY                                       
DD@AGJOB DS    CL10                AGENCY JOB                                   
DD@AGJBL DS    CL15                AGENCY JOB LINK                              
DD@ALPHA DS    CL8                 ALPHA(NUMERICAL)                             
DD@AMT   DS    CL8                 AMOUNT                                       
DD@ABTAX DS    CL20                AMOUNT BEFORE TAX                            
DD@APREV DS    CL27                AMOUNT PREVIOSULY BILLED                     
DD@BASIS DS    CL5                 BASIS                                        
DD@BIL   DS    CL4                 BILL                                         
DD@BILAM DS    CL11                BILL AMOUNT                                  
DD@BILDT DS    CL9                 BILL DATE                                    
DD@BLN7  DS    CL7                 BILL NO                                      
DD@BLN11 DS    CL11                BILL NUMBER                                  
DD@BLDIO DS    CL17                BILLED ITEMS ONLY                            
DD@BPER  DS    CL14                BILL PERIOD                                  
DD@STBIL DS    CL20                BILL SUB-TOTAL                               
DD@BOTH  DS    CL8                 BOTH                                         
DD@CASH  DS    CL4                 CASH                                         
DD@CSHDS DS    CL14                CASH DISCOUNT                                
DD@CLINT DS    CL6                 CLIENT                                       
DD@CLI   DS    CL3                 CLIENT CODE                                  
DD@CMN   DS    CL20                COMMISSION                                   
DD@CODE  DS    CL4                 CODE                                         
DD@COST  DS    CL8                 COST                                         
DD@CSG   DS    CL7                 COSTING                                      
DD@STCST DS    CL20                COST SUBTOTAL                                
DD@CRA   DS    CL14                CREDIT ACCOUNT                               
DD@CRAM  DS    CL36                CREDIT AMOUNT                                
DD@DATE  DS    CL4                 DATE                                         
DD@DRA   DS    CL14                DEBIT ACCOUNT                                
DD@DESC  DS    CL11                DESCRIPTION                                  
DD@DISS  DS    CL10                DISCOUNT                                     
DD@DOCC  DS    CL15                DOCUMENT NUMBER                              
DD@DRAFT DS    CL5                 DRAFT                                        
DD@DUEDT DS    CL8                 DUE DATE                                     
DD@DUER  DS    CL21                DUE UPON RECEIPT                             
DD@EST   DS    CL8                 ESTIMATE                                     
DD@EXT   DS    CL8                 EXTERNAL                                     
DD@FEE   DS    CL10                FEE                                          
DD@FOR   DS    CL3                 FOR                                          
DD@FRN   DS    CL8                 FOREIGN                                      
DD@GROSS DS    CL8                 GROSS                                        
DD@VAT1  DS    CL3                 GST                                          
DD@GSTAM DS    CL11                GST AMOUNT                                   
DD@HAND  DS    CL17                HANDLING CHARGE                              
DD@HOURS DS    CL8                 HOURS                                        
DD@IFDED DS    CL27                IF PAID BY DUE DATE DEDUCT                   
DD@INCAC DS    CL14                INCOME ACCOUNT                               
DD@INCAM DS    CL13                INCOME AMOUNT                                
DD@INV   DS    CL7                 INVOICE                                      
DD@INVC  DS    CL17                INVOICE NUMBER                               
DD@INVDE DS    CL14                INVOICE DETAIL                               
DD@INVSU DS    CL15                INVOICE SUMMARY                              
DD@INT   DS    CL8                 INTERNAL                                     
DD@INVTO DS    CL13                INVOICE TOTAL                                
DD@INVT2 DS    CL20                INVOICE TOTAL                                
DD@JOB   DS    CL3                 JOB                                          
DD@JOBC  DS    CL8                 JOB CODE                                     
DD@JOBN  DS    CL8                 JOB NAME                                     
DD@JOBNU DS    CL10                JOB NUMBER                                   
DD@MED   DS    CL5                 MEDIA                                        
DD@MMPS  DS    CL38                MONTHLY MINIMUM PROF. SER.                   
DD@NAME  DS    CL4                 NAME                                         
DD@NET   DS    CL20                NET                                          
DD@NETAM DS    CL11                NET AMOUNTS                                  
DD@NETCT DS    CL12                NET COST                                     
DD@NIL   DS    CL5                 NIL                                          
DD@NO    DS    CL8                 NO                                           
DD@NONE  DS    CL8                 NONE                                         
DD@OOP   DS    CL22                OUT-OF-POCKET EXPENSES                       
DD@OTHRS DS    CL6                 OTHERS                                       
DD@PAGE  DS    CL8                 PAGE                                         
DD@PRGRP DS    CL8                 PARAGRAPH                                    
DD@PAA   DS    CL33                PAY ABOVE AMOUNT                             
DD@PLCD  DS    CL27                PLUS CASH DISCOUNT                           
DD@PPTA  DS    CL36                PLEASE PAY THIS AMOUNT                       
DD@PRVBL DS    CL20                PREVIOUS BILLING                             
DD@PRVBS DS    CL14                PREVIOUS BILLS                               
DD@PRVDE DS    CL27                PREVIOUSLY DEDUCTED                          
DD@PRO   DS    CL7                 PRODUCT                                      
DD@PROC  DS    CL3                 PRODUCT CODE                                 
DD@PROFS DS    CL12                PROFESSIONAL                                 
DD@PSSF  DS    CL31                PROFESSIONAL STAFF SERV.FOR                  
DD@PRD   DS    CL10                PRODUCTION                                   
DD@PRDBL DS    CL16                PRODUCTION BILL                              
DD@PRBIR DS    CL35                PRODUCTION BILLING INVOICE REGISTER          
DD@PST   DS    CL3                 PST                                          
DD@PSTAM DS    CL11                PST AMOUNT                                   
DD@RATE  DS    CL4                 RATE                                         
DD@RSN   DS    CL6                 REASON                                       
DD@RECAP DS    CL14                RECAPITULATION                               
DD@RCV   DS    CL10                RECEIVABLE                                   
DD@REF   DS    CL4                 REFERENCE                                    
DD@REQDE DS    CL14                REQUEST DETAILS                              
DD@RTAG  DS    CL33                REGISTER OF TARGET ACCOUNTS                  
DD@SALES DS    CL5                 SALES                                        
DD@SERVE DS    CL8                 SERVICES                                     
DD@SHIP  DS    CL9                 SHIP DATE                                    
DD@STAFF DS    CL5                 STAFF                                        
DD@INPST DS    CL13                SI/SB POSTING                                
DD@STDIO DS    CL6                 STUDIO                                       
DD@SMYBL DS    CL19                SUMMARY BILL                                 
DD@SRCRG DS    CL20                SURCHARGE                                    
DD@SUBT  DS    CL10                SUBTOTAL                                     
DD@TAX   DS    CL4                 TAX                                          
DD@TAXAN DS    CL20                TAX ANALYSIS                                 
DD@TIME  DS    CL8                 TIME                                         
DD@STTIM DS    CL20                TIME SUBTOTAL                                
DD@TO    DS    CL2                 TO                                           
DD@TBLNG DS    CL13                TOTAL BILLING                                
DD@TOREV DS    CL20                TO REVERSE                                   
DD@TOTAL DS    CL5                 TOTAL                                        
DD@TOTAU DS    CL9                 TOTAL USD                                    
DD@TAMTD DS    CL20                TOTAL AMOUNT DUE                             
DD@TAMTU DS    CL20                TOTAL AMOUNT DUE USD                         
DD@TCRGS DS    CL15                TOTAL CHARGES                                
DD@TFOR  DS    CL10                TOTAL FOR                                    
DD@TCLI  DS    CL17                TOTAL FOR CLIENT                             
DD@TJOB  DS    CL20                TOTAL FOR JOB                                
DD@TPRO  DS    CL20                TOTAL FOR PRODUCT                            
DD@TWC   DS    CL20                TOTAL FOR WORK CODE                          
DD@TMED  DS    CL19                TOTAL FOR MEDIA CODE                         
DD@TMEDC DS    CL20                TOTAL MEDIA CHARGES                          
DD@TPRVB DS    CL25                TOTAL PREVIOUS BILLS                         
DD@TPRCG DS    CL25                TOTAL PRODUCTION CHARGES                     
DD@TPSTS DS    CL14                TOTAL POSTINGS                               
DD@TOTCL DS    CL17                TOTALS FOR CLINET                            
DD@TOTPR DS    CL18                TOTALS FOR PRODUCT                           
DD@TREP  DS    CL16                TOTALS FOR REPORT                            
DD@TOTRN DS    CL17                TOTALS FOR RUN                               
DD@TTAX  DS    CL11                TOTAL TAXES                                  
DD@XFRFR DS    CL16                TRANSFERRED FROM                             
DD@XFRTO DS    CL14                TRANSFERRED TO                               
DD@TYPE  DS    CL4                 TYPE                                         
DD@UNITS DS    CL6                 UNITS                                        
DD@USD   DS    CL3                 USD                                          
DD@VNDR  DS    CL6                 VENDOR                                       
DD@VNN   DS    CL11                VENDOR NAME                                  
DD@UNBIO DS    CL19                UNBILLED ITEMS ONLY                          
DD@WC2   DS    CL2                 W/C                                          
DD@WC9   DS    CL9                 WORK CODE                                    
DD@YES   DS    CL8                 YES                                          
DD@YSHRE DS    CL12                YOUR SHARE                                   
         DS    XL1                                                              
DICLNQ   EQU   *-DICD                                                           
         EJECT                                                                  
***********************************************************************         
* DSECT FOR CASH FIELDS                                               *         
***********************************************************************         
AMTD     DSECT                                                                  
JOCUR    DS    XL(BK$LQ)           JOB CURRENT CHARGES                          
         ORG   JOCUR+(NET$-BK$)                                                 
JOCURNET DS    0PL(L'BK$)                                                       
         ORG   JOCUR+(COM$-BK$)                                                 
JOCURCOM DS    0PL(L'BK$)                                                       
         ORG   JOCUR+(GRS$-BK$)                                                 
JOCURGRS DS    0PL(L'BK$)                                                       
         ORG   JOCUR+(CSD$-BK$)                                                 
JOCURCSD DS    0PL(L'BK$)                                                       
         ORG   JOCUR+(GST$-BK$)                                                 
JOCURGST DS    0PL(L'BK$)                                                       
         ORG   JOCUR+(PST$-BK$)                                                 
JOCURPST DS    0PL(L'BK$)                                                       
         ORG   JOCUR+(TAX$-BK$)                                                 
JOCURTAX DS    0PL(L'BK$)                                                       
         ORG   JOCUR+L'JOCUR                                                    
*                                                                               
BTXC     DS    XL(BK$LQ)           BEFORE TAX 'CURRENT'                         
         ORG   BTXC+(NET$-BK$)                                                  
BTXCNET  DS    0PL(L'BK$)                                                       
         ORG   BTXC+(COM$-BK$)                                                  
BTXCCOM  DS    0PL(L'BK$)                                                       
         ORG   BTXC+(GRS$-BK$)                                                  
BTXCGRS  DS    0PL(L'BK$)                                                       
         ORG   BTXC+L'BTXC                                                      
*                                                                               
BTXT     DS    XL(BK$LQ)           BEFORE TAX 'TOTAL'                           
         ORG   BTXT+(NET$-BK$)                                                  
BTXTNET  DS    0PL(L'BK$)                                                       
         ORG   BTXT+(COM$-BK$)                                                  
BTXTCOM  DS    0PL(L'BK$)                                                       
         ORG   BTXT+(GRS$-BK$)                                                  
BTXTGRS  DS    0PL(L'BK$)                                                       
         ORG   BTXT+L'BTXT                                                      
*                                                                               
JOTOT    DS    XL(BK$LQ)           JOB TOTAL                                    
         ORG   JOTOT+(NET$-BK$)                                                 
JOTOTNET DS    0PL(L'BK$)                                                       
         ORG   JOTOT+(COM$-BK$)                                                 
JOTOTCOM DS    0PL(L'BK$)                                                       
         ORG   JOTOT+(GRS$-BK$)                                                 
JOTOTGRS DS    0PL(L'BK$)                                                       
         ORG   JOTOT+(CSD$-BK$)                                                 
JOTOTCSD DS    0PL(L'BK$)                                                       
         ORG   JOTOT+(GST$-BK$)                                                 
JOTOTGST DS    0PL(L'BK$)                                                       
         ORG   JOTOT+(PST$-BK$)                                                 
JOTOTPST DS    0PL(L'BK$)                                                       
         ORG   JOTOT+(TAX$-BK$)                                                 
JOTOTTAX DS    0PL(L'BK$)                                                       
         ORG   JOTOT+L'JOTOT                                                    
*                                                                               
SHAR     DS    XL(BK$LQ)           RETAILER SHARE OF TOTAL                      
         ORG   SHAR+(NET$-BK$)                                                  
SHARNET  DS    0PL(L'BK$)                                                       
         ORG   SHAR+(COM$-BK$)                                                  
SHARCOM  DS    0PL(L'BK$)                                                       
         ORG   SHAR+(GRS$-BK$)                                                  
SHARGRS  DS    0PL(L'BK$)                                                       
         ORG   SHAR+(GST$-BK$)                                                  
SHARGST  DS    0PL(L'BK$)                                                       
         ORG   SHAR+(PST$-BK$)                                                  
SHARPST  DS    0PL(L'BK$)                                                       
         ORG   SHAR+L'SHAR                                                      
*                                                                               
PBTOT    DS    XL(BK$LQ)           TOTAL PREVIOUS BILLS                         
         ORG   PBTOT+(NET$-BK$)                                                 
PBTOTNET DS    0PL(L'BK$)                                                       
         ORG   PBTOT+(COM$-BK$)                                                 
PBTOTCOM DS    0PL(L'BK$)                                                       
         ORG   PBTOT+(GRS$-BK$)                                                 
PBTOTGRS DS    0PL(L'BK$)                                                       
         ORG   PBTOT+(CSD$-BK$)                                                 
PBTOTCSD DS    0PL(L'BK$)                                                       
         ORG   PBTOT+(GST$-BK$)                                                 
PBTOTGST DS    0PL(L'BK$)                                                       
         ORG   PBTOT+(PST$-BK$)                                                 
PBTOTPST DS    0PL(L'BK$)                                                       
         ORG   PBTOT+(TAX$-BK$)                                                 
PBTOTTAX DS    0PL(L'BK$)                                                       
         ORG   PBTOT+L'PBTOT                                                    
*                                                                               
DUE      DS    XL(BK$LQ)           CURRENT BILL                                 
         ORG   DUE+(NET$-BK$)                                                   
DUENET   DS    0PL(L'BK$)                                                       
         ORG   DUE+(COM$-BK$)                                                   
DUECOM   DS    0PL(L'BK$)                                                       
         ORG   DUE+(GRS$-BK$)                                                   
DUEGRS   DS    0PL(L'BK$)                                                       
         ORG   DUE+(CSD$-BK$)                                                   
DUECSD   DS    0PL(L'BK$)                                                       
         ORG   DUE+(GST$-BK$)                                                   
DUEGST   DS    0PL(L'BK$)                                                       
         ORG   DUE+(PST$-BK$)                                                   
DUEPST   DS    0PL(L'BK$)                                                       
         ORG   DUE+(RCV$-BK$)                                                   
DUERCV   DS    0PL(L'BK$)                                                       
         ORG   DUE+(TAX$-BK$)                                                   
DUETAX   DS    0PL(L'BK$)                                                       
         ORG   DUE+(NTX$-BK$)                                                   
DUENTX   DS    0PL(L'BK$)                                                       
         ORG   DUE+L'DUE                                                        
*                                                                               
LVCBK    DS    XL(BK$LQ)           LEVEL C BUCKETS                              
         ORG   LVCBK+(NET$-BK$)                                                 
LVCNET   DS    0PL(L'BK$)                                                       
         ORG   LVCBK+(COM$-BK$)                                                 
LVCCOM   DS    PL(L'BK$)                                                        
         ORG   LVCBK+(CSD$-BK$)                                                 
LVCCSD   DS    PL(L'BK$)                                                        
         ORG   LVCBK+(GST$-BK$)                                                 
LVCGST   DS    PL(L'BK$)                                                        
         ORG   LVCBK+(PST$-BK$)                                                 
LVCPST   DS    PL(L'BK$)                                                        
         ORG   LVCBK+(TAX$-BK$)                                                 
LVCTAX   DS    PL(L'BK$)                                                        
         ORG   LVCBK+(PSF$-BK$)                                                 
LVCPSF   DS    0PL(L'BK$)                                                       
         ORG   LVCBK+(OOP$-BK$)                                                 
LVCOOP   DS    PL(L'BK$)                                                        
         ORG   LVCBK+(TOT$-BK$)                                                 
LVCTOT   DS    PL(L'BK$)                                                        
         ORG   LVCBK+L'LVCBK                                                    
*                                                                               
NACC$    EQU   (*-AMTD)/L'BK$                                                   
*                                                                               
LVGBK    DS    XL(BK$LQ)           GROUP LEVEL BUCKETS                          
         ORG   LVGBK+(NET$-BK$)                                                 
LVGNET   DS    0PL(L'BK$)                                                       
         ORG   LVGBK+(COM$-BK$)                                                 
LVGCOM   DS    PL(L'BK$)                                                        
         ORG   LVGBK+(GRS$-BK$)                                                 
LVGGRS   DS    PL(L'BK$)                                                        
         ORG   LVGBK+(CSD$-BK$)                                                 
LVGCSD   DS    PL(L'BK$)                                                        
         ORG   LVGBK+(GST$-BK$)                                                 
LVGGST   DS    PL(L'BK$)                                                        
         ORG   LVGBK+(PST$-BK$)                                                 
LVGPST   DS    PL(L'BK$)                                                        
         ORG   LVGBK+(INTL$-BK$)                                                
LVGINT   DS    PL(L'BK$)                                                        
         ORG   LVGBK+(TAX$-BK$)                                                 
LVGTAX   DS    PL(L'BK$)                                                        
         ORG   LVGBK+(PSF$-BK$)                                                 
LVGPSF   DS    0PL(L'BK$)                                                       
         ORG   LVGBK+(OOP$-BK$)                                                 
LVGOOP   DS    PL(L'BK$)                                                        
         ORG   LVGBK+(TOT$-BK$)                                                 
LVGTOT   DS    PL(L'BK$)                                                        
         ORG   LVGBK+(RCV$-BK$)                                                 
LVGRCV   DS    PL(L'BK$)                                                        
         ORG   LVGBK+L'LVGBK                                                    
*                                                                               
LVABK    DS    XL(BK$LQ)           CLIENT LEVEL BUCKETS                         
         ORG   LVABK+(NET$-BK$)                                                 
LVANET   DS    0PL(L'BK$)                                                       
         ORG   LVABK+(COM$-BK$)                                                 
LVACOM   DS    PL(L'BK$)                                                        
         ORG   LVABK+(CSD$-BK$)                                                 
LVACSD   DS    PL(L'BK$)                                                        
         ORG   LVABK+(GST$-BK$)                                                 
LVAGST   DS    PL(L'BK$)                                                        
         ORG   LVABK+(PST$-BK$)                                                 
LVAPST   DS    PL(L'BK$)                                                        
         ORG   LVABK+(TAX$-BK$)                                                 
LVATAX   DS    PL(L'BK$)                                                        
         ORG   LVABK+(PSF$-BK$)                                                 
LVAPSF   DS    0PL(L'BK$)                                                       
         ORG   LVABK+(OOP$-BK$)                                                 
LVAOOP   DS    PL(L'BK$)                                                        
         ORG   LVABK+(TOT$-BK$)                                                 
LVATOT   DS    PL(L'BK$)                                                        
         ORG   LVABK+L'LVABK                                                    
*                                                                               
LVBBK    DS    XL(BK$LQ)           PRODUCT LEVEL BUCKETS                        
         ORG   LVBBK+(NET$-BK$)                                                 
LVBNET   DS    0PL(L'BK$)                                                       
         ORG   LVBBK+(COM$-BK$)                                                 
LVBCOM   DS    PL(L'BK$)                                                        
         ORG   LVBBK+(CSD$-BK$)                                                 
LVBCSD   DS    PL(L'BK$)                                                        
         ORG   LVBBK+(GST$-BK$)                                                 
LVBGST   DS    PL(L'BK$)                                                        
         ORG   LVBBK+(PST$-BK$)                                                 
LVBPST   DS    PL(L'BK$)                                                        
         ORG   LVBBK+(TAX$-BK$)                                                 
LVBTAX   DS    PL(L'BK$)                                                        
         ORG   LVBBK+(PSF$-BK$)                                                 
LVBPSF   DS    0PL(L'BK$)                                                       
         ORG   LVBBK+(OOP$-BK$)                                                 
LVBOOP   DS    PL(L'BK$)                                                        
         ORG   LVBBK+(TOT$-BK$)                                                 
LVBTOT   DS    PL(L'BK$)                                                        
         ORG   LVBBK+L'LVBBK                                                    
AMTX     EQU   *                                                                
         EJECT                                                                  
* ACBIGPRNTD                                                                    
         PRINT OFF                                                              
       ++INCLUDE ACBIGPRNTD                                                     
         PRINT ON                                                               
* ACDDEQUS                                                                      
         PRINT OFF                                                              
       ++INCLUDE ACDDEQUS                                                       
         PRINT ON                                                               
* ACGENFILE                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACGENFILE                                                      
         PRINT ON                                                               
* ACGENMODES                                                                    
         PRINT OFF                                                              
       ++INCLUDE ACGENMODES                                                     
         PRINT ON                                                               
* ACGENPOST                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACGENPOST                                                      
         PRINT ON                                                               
GOBLOCKD DSECT                                                                  
* ACGOBLOCK                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACGOBLOCK                                                      
         PRINT ON                                                               
GOXBLKD  DSECT                                                                  
* ACGOXBLOCK                                                                    
         PRINT OFF                                                              
       ++INCLUDE ACGOXBLOCK                                                     
         PRINT ON                                                               
JBLOCKD  DSECT                                                                  
* ACJOBBLOCK                                                                    
         PRINT OFF                                                              
       ++INCLUDE ACJOBBLOCK                                                     
         PRINT ON                                                               
* ACJOBBERD                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACJOBBERD                                                      
         PRINT ON                                                               
* ACMASTD                                                                       
         PRINT OFF                                                              
       ++INCLUDE ACMASTD                                                        
         PRINT ON                                                               
* ACMSGEQUS                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACMSGEQUS                                                      
         PRINT ON                                                               
PRORATAD DSECT                                                                  
* ACPRORATAD                                                                    
         PRINT OFF                                                              
       ++INCLUDE ACPRORATAD                                                     
         PRINT ON                                                               
* ACQD                                                                          
         PRINT OFF                                                              
       ++INCLUDE ACQD                                                           
         PRINT ON                                                               
* ACREPPROFD                                                                    
         PRINT OFF                                                              
       ++INCLUDE ACREPPROFD                                                     
         PRINT ON                                                               
* ACREPWORKD                                                                    
         PRINT OFF                                                              
       ++INCLUDE ACREPWORKD                                                     
         PRINT ON                                                               
* ACWCNTABD                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACWCNTABD                                                      
         PRINT ON                                                               
* ACVATICAND                                                                    
         PRINT OFF                                                              
       ++INCLUDE ACVATICAND                                                     
         PRINT ON                                                               
* CTGENFILE                                                                     
         PRINT OFF                                                              
       ++INCLUDE CTGENFILE                                                      
         PRINT ON                                                               
* DDBIGBOX                                                                      
         PRINT OFF                                                              
       ++INCLUDE DDBIGBOX                                                       
         PRINT ON                                                               
* COMFACSD                                                                      
         PRINT OFF                                                              
       ++INCLUDE DDCOMFACSD                                                     
         PRINT ON                                                               
* DDCOREQUS                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDCOREQUS                                                      
         PRINT ON                                                               
* DDCURPARMD                                                                    
         PRINT OFF                                                              
       ++INCLUDE DDCURPARMD                                                     
         PRINT ON                                                               
* DDCTRYEQUS                                                                    
         PRINT OFF                                                              
       ++INCLUDE DDCTRYEQUS                                                     
         PRINT ON                                                               
* DDLOGOD                                                                       
         PRINT OFF                                                              
       ++INCLUDE DDLOGOD                                                        
         PRINT ON                                                               
* DDMASTD                                                                       
         PRINT OFF                                                              
       ++INCLUDE DDMASTD                                                        
         PRINT ON                                                               
* DDREMOTED                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDREMOTED                                                      
         PRINT ON                                                               
         PRINT ON                                                               
* DDREPXTRAD                                                                    
         PRINT OFF                                                              
       ++INCLUDE DDREPXTRAD                                                     
         PRINT ON                                                               
* DDTSARD                                                                       
         PRINT OFF                                                              
       ++INCLUDE DDTSARD                                                        
         PRINT ON                                                               
* DMWRKRK                                                                       
         PRINT OFF                                                              
       ++INCLUDE DMWRKRK                                                        
         PRINT ON                                                               
* FASSBOFF                                                                      
         PRINT OFF                                                              
       ++INCLUDE FASSBOFF                                                       
         PRINT ON                                                               
* SRUPDD                                                                        
         PRINT OFF                                                              
       ++INCLUDE SRUPDD                                                         
         PRINT ON                                                               
