*          DATA SET ACREPTTD   AT LEVEL 008 AS OF 02/15/02                      
*                                                                               
* AG - ARNOLD COMMUNICATIONS                                                    
*                                                                               
         DC    CL2'AG'             ACBOA                                        
         DC    AL2(6568)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'08548'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'043016107'      EIN#/TIN#                                    
         DC    X'01'                                                            
         DC    CL33'ARNOLD WORLDWIDE, INC.'  COMPANY NAME                       
         DC    CL33'101 HUNTINGTON AVENUE, 23RD FL'     3X33 ADD LINES          
         DC    CL33' '                                                          
         DC    CL33'BOSTON                MA02119'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'GREG BATTY'           AGENCY CONTACT NAME                   
         DC    CL15'6175878506'           AGENCY PHONE NUMBER                   
*                                                                               
* AL - ANDERSON LEMBKE                                                          
*                                                                               
*        DC    CL2'AL'               ALNY                                       
*        DC    AL2(3735)             ORIGIN (DEFAULT IS PRINC ID)               
*        DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
*        DC    CL9'061340016'        EIN#/TIN#                                  
*        DC    X'00'                                                            
*        DC    CL33'ANDERSON AND LEMBKE, INC.'     COMPANY NAME                 
*        DC    CL33'320 WEST 13TH STREET'                                       
*        DC    CL33'NEW YORK, NY  10014'                                        
*        DC    CL33' '                                                          
*        DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
*        DC    CL40'JOAN BURKHARDT'       AGENCY CONTACT NAME                   
*        DC    CL15'2128862118'           AGENCY PHONE NUMBER                   
*                                                                               
*        DC    CL2'AL'               ALSF                                       
*        DC    AL2(3737)             ORIGIN (DEFAULT IS PRINC ID)               
*        DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
*        DC    CL9'061340016'        EIN#/TIN#                                  
*        DC    X'00'                                                            
*        DC    CL33'ANDERSON AND LEMBKE, INC.'     COMPANY NAME                 
*        DC    CL33'320 WEST 13TH STREET'                                       
*        DC    CL33'NEW YORK, NY  10014'                                        
*        DC    CL33' '                                                          
*        DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
*        DC    CL40'JOAN BURKHARDT'       AGENCY CONTACT NAME                   
*        DC    CL15'2128862118'           AGENCY PHONE NUMBER                   
*                                                                               
* AV - THE ADVERTISING COUNCIL, INC.                                            
*                                                                               
         DC    CL2'AV'               THE ADVERTISING COUNSEL                    
         DC    AL2(2111)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'130417693'        EIN#/TIN#                                  
         DC    X'00'                                                            
         DC    CL33'THE ADVERTISING COUNCIL, INC.'   COMPANY NAME               
         DC    CL33'261 MADISON AVE 17TH FLOOR'                                 
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY100162303'                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'BIBI ALLI'     AGENCY CONTACT NAME                          
         DC    CL15'2129221500'    AGENCY PHONE NUMBER                          
*                                                                               
* BC - RAPP COLLINS MARCOA                                                      
*                                                                               
         DC    CL2'BC'               MDNY - RAPP, COLLINS, MARCOA               
         DC    AL2(1818)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'112679168'        EIN#/TIN#                                  
         DC    X'00'                                                            
         DC    CL33'RAPP COLLINS WORLDWIDE'                                     
         DC    CL33'11 MADISON AVE'             3 X 33 ADDR LINES               
         DC    CL33'NEW YORK, NY  10010'                                        
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'BC'               MDCH - RAPP, COLLINS, MARCOA               
         DC    AL2(2105)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'364053944'        EIN#/TIN#                                  
         DC    X'00'                                                            
         DC    CL33'RAPP COLLINS WORLDWIDE'   COMPANY NAME                      
         DC    CL33'10 SOUTH RIVERSIDE PLAZA'   3 X 33 ADDR LINES               
         DC    CL33'CHICAGO, IL 60606'                                          
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '                    AGENCY CONTACT NAME                   
         DC    CL15' '                    AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'BC'               MDCP - RAPP, COLLINS, MARCOA               
         DC    AL2(2413)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'112679168'        EIN#/TIN#                                  
         DC    X'00'                                                            
         DC    CL33'RAPP COLLINS WORLDWIDE'     COMPANY NAME                    
         DC    CL33'11 MADISON AVE - 12TH FLOOR'     3 X 33 ADDR LINES          
         DC    CL33'NEW YORK, NY 10010'                                         
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'BC'             MDMIN- RAPP, COLLINS, MARCOA                 
         DC    AL2(2989)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'363698267'      EIN#/TIN#                                    
         DC    X'00'                                                            
         DC    CL33'RAPP COLLINS WORLDWIDE'  COMPANY NAME                       
         DC    CL33'901 MARQUETTE AVE. 17TH FL.'    3 X 33 ADDR LINES           
         DC    CL33'MINNEAPOLIS, MN 55402'                                      
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '                    AGENCY CONTACT NAME                   
         DC    CL15' '                    AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'BC'               MDTS - JAN/98                              
         DC    AL2(6232)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133922303'        EIN#/TIN#                                  
         DC    X'00'                                                            
         DC    CL33'TEAM SOUTH, INC.'            COMPANY NAME                   
         DC    CL33'200 VARICK STREET'           3 X 33 ADDR LINES              
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10014'                              
         DC    CL240' '                  OFFICE LIST (SPACES - NO LIST)         
         DC    CL40'CLIFF MARNICK'       AGENCY CONTACT NAME                    
         DC    CL15'2128868348'          AGENCY PHONE NUMBER                    
*                                                                               
* BD - BDDO                                                                     
*                                                                               
         DC    CL2'BD'               BDDE DETROIT                               
         DC    AL2(0163)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'35D71'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'382964249'        EIN#/TIN#                                  
         DC    X'01'                                                            
         DC    CL33'BBDO DETROIT'              COMPANY NAME                     
         DC    CL33'840 LONG LAKE ROAD'        3 X 33 ADDR LINES                
         DC    CL33' '                                                          
         DC    CL33'TROY                  MI48098'                              
         DC    CL240' '                 OFFICE LIST (SPACES - NO LIST)          
         DC    CL40'RICK FORCE'         AGENCY CONTACT NAME                     
         DC    CL15'2128272019'         AGENCY PHONE NUMBER                     
*                                                                               
         DC    CL2'BD'               BBDO CHICAGO-BDCH                          
         DC    AL2(1049)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'35D71'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'223045170'        EIN#/TIN#                                  
         DC    X'01'                 CHANGED TO BD 12/96                        
         DC    CL33'BBDO CHICAGO'                                               
         DC    CL33'410 NORTH MICHIGAN AVENUE'    3 X 33 ADDR LINES             
         DC    CL33' '                                                          
         DC    CL33'CHICAGO               IL60611'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'RICK FORCE'           AGENCY CONTACT NAME                   
         DC    CL15'2128272019'    AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'BD'             KENT                                         
         DC    AL2(1110)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'35D71'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'130473120'      EIN#/TIN#                                    
         DC    X'01'                                                            
         DC    CL33'BBDO WORLDWIDE'            COMPANY NAME                     
         DC    CL33'1285 AVE OF AMERICAS'      3 X 33 ADDR LINES                
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10019'                              
         DC    CL240' '             OFFICE LIST (SPACES - NO LIST)              
         DC    CL40'RICK FORCE'     AGENCY CONTACT NAME                         
         DC    CL15'2128272019'     AGENCY PHONE NUMBER                         
*                                                                               
         DC    CL2'BD'               BDA/BBDO -BDNAT - CHANGED 12/96            
         DC    AL2(3504)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'35D71'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'581597648'        EIN#/TIN#                                  
         DC    X'01'                                                            
         DC    CL33'BBDO ATLANTA'                                               
         DC    CL33'3500 LENOX ROAD, SUITE 1900'                                
         DC    CL33' '                                                          
         DC    CL33'ATLANTA               GA30326'  3 X 33 ADDR LINES           
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'RICK FORCE'           AGENCY CONTACT NAME                   
         DC    CL15'2128272019'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'BD'               BDATM ADDED FEB/2001                       
         DC    AL2(8083)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'35D71'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'134067883'        EIN#/TIN#                                  
         DC    X'01'                                                            
         DC    CL33'@TMOSPHERE INTERACTIVE'                                     
         DC    CL33'1375 BROADWAY'                                              
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10018'  3 X 33 ADDR LINES           
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'RICK FORCE'           AGENCY CONTACT NAME                   
         DC    CL15'2128272019'           AGENCY PHONE NUMBER                   
*                                                                               
* BG - BWCNY                                                                    
*                                                                               
         DC    CL2'BG'               BWCNY - (3/95)                             
         DC    AL2(3282)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133767936'                                                   
         DC    X'00'                                                            
         DC    CL33'BERLIN CAMERON DOYLE'                                       
         DC    CL33'79 FIFTH AVENUE'       3 X 33 ADDR LINES                    
         DC    CL33'NEW YORK, NY  10003'                                        
         DC    CL33'ATTN: DIANE FELDMAN'                                        
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
* BS - BATES USA                                                                
*                                                                               
         DC    CL2'BS'             BSNY - BACKER SPEILVOGEL BATES INC.          
         DC    AL2(0294)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'19N35'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'132993871'      EIN#/TIN#                                    
         DC    X'01'                                                            
         DC    CL33'BATES ADVERTISING USA, INC.'    COMPANY NAME                
         DC    CL33'498 SEVENTH AVENUE'    3 X 33 ADDR LINES                    
         DC    CL33' '             3 X 33 ADDR LINES                            
         DC    CL33'NEW YORK              NY10018'  3 X 33 ADDR LINES           
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'DIANNA SADOWSKI'       AGENCY CONTACT NAME                  
         DC    CL15'2122978129'           AGENCY PHONE NUMBER                   
*                                                                               
*        DC    CL2'BS'             BSNYGA-BACKER SPEILVOGEL BATES INC.          
*        DC    AL2(3665)           ORIGIN (DEFAULT IS PRINC ID)                 
*        DC    CL5'19N35'          TRANSMITTER#(00000 USE DDS#)-TCC             
*        DC    CL9'132545952'                                                   
*        DC    X'01'                                                            
*        DC    CL33'BATES ADVERTISING HOLDINGS, INC.'  COMPANY NAME             
*        DC    CL33'405 LEXINGTON AVENUE'        3 X 33 ADDR LINES              
*        DC    CL33'NEW YORK, NY  10174'                                        
*        DC    CL33' '                                                          
*        DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
*        DC    CL40'DIANA SADOWSKI'       AGENCY CONTACT NAME                   
*        DC    CL15'2122978129'           AGENCY PHONE NUMBER                   
*                                                                               
* CE - CAMPBELL MITHUN - ESTY                                                   
*                                                                               
         DC    CL2'CE'               CASH PLUS, INC. - CECP                     
         DC    AL2(2072)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'08K07'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'411267291'                                                   
         DC    X'01'                                                            
         DC    CL33' '             COMPANY NAME                                 
         DC    CL99' '             3 X 33 ADDR LINES                            
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'CE'               CAMPBELL-MITHUN ESTY CEND                  
         DC    AL2(2084)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'08K07'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'410985665'                                                   
         DC    X'01'                                                            
         DC    CL33' '             COMPANY NAME                                 
         DC    CL99' '             3 X 33 ADDR LINES                            
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'CE'               PROMOTION WORKS, INC. - CEPW               
         DC    AL2(2086)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'411333350'                                                   
         DC    X'00'                                                            
         DC    CL33'CME PROMOTION MARKETING'                                    
         DC    CL99' '             3 X 33 ADDR LINES                            
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'CE'               CECME                                      
         DC    AL2(2869)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'08K07'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'410985665'                                                   
         DC    X'01'                                                            
         DC    CL33' '             COMPANY NAME                                 
         DC    CL99' '             3 X 33 ADDR LINES                            
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'CE'               CEHO                                       
         DC    AL2(2818)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'741282588'                                                   
         DC    X'00'                                                            
         DC    CL33' '             COMPANY NAME                                 
         DC    CL99' '             3 X 33 ADDR LINES                            
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'CE'               CEMNRE                                     
         DC    AL2(3100)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'08K07'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'410985665'                                                   
         DC    X'01'                                                            
         DC    CL33' '             COMPANY NAME                                 
         DC    CL99' '             3 X 33 ADDR LINES                            
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'CE'               CEIPG                                      
         DC    AL2(4052)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'08K07'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'411807452'                                                   
         DC    X'01'                                                            
         DC    CL33'CAMPBELL-MITHUN-ESTY, L.L.C.'                               
         DC    CL33'222 SOUTH 9TH STREET'                                       
         DC    CL33'MINNEAPOLIS, MN  55402'                                     
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
* CF - CARRAFIELLO, DIEHL AND ASSOCIATES                                        
*                                                                               
         DC    CL2'CF'               CACAR                                      
         DC    AL2(6049)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'132749326'        EIN                                        
         DC    X'00'                                                            
         DC    CL33'CARRAFIELLO, DIEHL AND ASSOCIATES'                          
         DC    CL33'90 NORTH BROADWAY'                                          
         DC    CL33' '                                                          
         DC    CL33'IRVINGTON             NY10533'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'RICHARD PODLOVITS'  AGENCY CONTACT NAME                     
         DC    CL15'9146743995'      AGENCY PHONE NUMBER                        
*                                                                               
         DC    CL2'CF'               CAINK                                      
         DC    AL2(6050)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133082893'        EIN                                        
         DC    X'00'                                                            
         DC    CL33'INKWELL STUDIOS, INC.'                                      
         DC    CL33'90 NORTH BROADWAY'                                          
         DC    CL33' '                                                          
         DC    CL33'IRVINGTON             NY10533'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'RICHARD PODLOVITS'  AGENCY CONTACT NAME                     
         DC    CL15'9146743995'      AGENCY PHONE NUMBER                        
*                                                                               
         DC    CL2'CF'                                                          
         DC    AL2(6081)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'132749326'        EIN                                        
         DC    X'00'                                                            
         DC    CL33'CARRAFIELLO DIEHL && ASSOC'                                 
         DC    CL33'90 NORTH BROADWAY'                                          
         DC    CL33' '                                                          
         DC    CL33'IRVINGTON             NY10533'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'RICHARD PODLOVITS'  AGENCY CONTACT NAME                     
         DC    CL15'9146743995'      AGENCY PHONE NUMBER                        
*                                                                               
         DC    CL2'CF'                                                          
         DC    AL2(6111)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133082893'        EIN                                        
         DC    X'00'                                                            
         DC    CL33'INKWELL STUDIOS, INC.'                                      
         DC    CL33'90 NORTH BROADWAY'                                          
         DC    CL33' '                                                          
         DC    CL33'IRVINGTON             NY10533'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'RICHARD PODLOVITS'  AGENCY CONTACT NAME                     
         DC    CL15'9146743995'      AGENCY PHONE NUMBER                        
*                                                                               
*        DC    CL2'CF'               CANYHN                                     
*        DC    AL2(6444)             ORIGIN (DEFAULT IS PRINC ID)               
*        DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
*        DC    CL9'133928399'        EIN                                        
*        DC    X'00'                                                            
*        DC    CL33'CDA HEALTH INC.'                                            
*        DC    CL33'90 NORTH BROADWAY'                                          
*        DC    CL33'IRVINGTON, NY  10533'                                       
*        DC    CL33' '                                                          
*        DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
*        DC    CL40'RICH PODLOVITS'       AGENCY CONTACT NAME                   
*        DC    CL15'9146743995'           AGENCY PHONE NUMBER                   
*                                                                               
* CZ - CREATIVE MEDIA INCORPORATED                                              
*                                                                               
         DC    CL2'CZ'               CMINY                                      
         DC    AL2(6080)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133900116'        EIN                                        
         DC    X'00'                                                            
         DC    CL33'CREATIVE MEDIA INCORPORATED'                                
         DC    CL33'488 MADISON AVENUE'                                         
         DC    CL33'4TH FLOOR'                                                  
         DC    CL33'NEW YORK              NY10022'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'KEVIN MCEVOY'         AGENCY CONTACT NAME                   
         DC    CL15'2126553210'           AGENCY PHONE NUMBER                   
*                                                                               
* D9 - DEUTSCH, INC.                                                            
*                                                                               
         DC    CL2'D9'             DTNY - ADDED JAN/00                          
         DC    AL2(6486)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'132649664'      EIN                                          
         DC    X'00'                                                            
         DC    CL33'DEUTSCH, INC.'               COMPANY NAME                   
         DC    CL33'111 8TH AVE, 14TH FL'        3 X 33 ADDR LINES              
         DC    CL33'NEW YORK, N.Y. 10011'                                       
         DC    CL33' '                                                          
         DC    CL240' '                                                         
         DC    CL40' '                    AGENCY CONTACT NAME                   
         DC    CL15' '                    AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'D9'             DTLA - DEUTSCH LA, INC.                      
         DC    AL2(6488)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'954545404'      EIN                                          
         DC    X'00'                                                            
         DC    CL33'DEUTSCH LA, INC.'            COMPANY NAME                   
         DC    CL33'111 8TH AVE. 14TH FLOOR'     3 X 33 ADDR LINES              
         DC    CL33'NEW YORK, NY 10011'                                         
         DC    CL33' '                                                          
         DC    CL240' '                                                         
         DC    CL40' '                    AGENCY CONTACT NAME                   
         DC    CL15' '                    AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'D9'             DTED - DEUTSCH, INC.                         
         DC    AL2(6647)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133777133'      EIN                                          
         DC    X'00'                                                            
         DC    CL33'MR. EDITORIAL, INC.'         COMPANY NAME                   
         DC    CL33'111 8TH AVE, 14TH FLOOR'    3 X 33 ADDR LINES               
         DC    CL33'NEW YORK, N.Y. 10011'                                       
         DC    CL33' '                                                          
         DC    CL240' '                                                         
         DC    CL40' '                    AGENCY CONTACT NAME                   
         DC    CL15' '                    AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'D9'             DTJO - DEUTSCH, INC.                         
         DC    AL2(6648)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133506227'      EIN                                          
         DC    X'00'                                                            
         DC    CL33'JONES FILMS, INC.'           COMPANY NAME                   
         DC    CL33'111 8TH AVENUE'              3 X 33 ADDR LINES              
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10011'                              
         DC    CL240' '                                                         
         DC    CL40'SUSAN HOFFMAN'        AGENCY CONTACT NAME                   
         DC    CL15'2129817887'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'D9'             DTDNY - DEUTSCH, INC.                        
         DC    AL2(6649)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133592947'      EIN                                          
         DC    X'00'                                                            
         DC    CL33'DEUTSCH DIRECT, INC.'        COMPANY NAME                   
         DC    CL33'111 8TH AVE, 14TH FLOOR'     3 X 33 ADDR LINES              
         DC    CL33'NEW YORK, N.Y. 10011'                                       
         DC    CL33' '                                                          
         DC    CL240' '                                                         
         DC    CL40' '                    AGENCY CONTACT NAME                   
         DC    CL15' '                    AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'D9'             DTNYC - DEUTSCH, INC.                        
         DC    AL2(6789)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'132649664'      EIN                                          
         DC    X'00'                                                            
         DC    CL33'DEUTSCH, INC.'   COMPANY NAME                               
         DC    CL33'111 8TH AVE, 14TH FLOOR'   3 X 33 ADDR LINES                
         DC    CL33'NEW YORK, N.Y. 10011'                                       
         DC    CL33' '                                                          
         DC    CL240' '                                                         
         DC    CL40' '                    AGENCY CONTACT NAME                   
         DC    CL15' '                    AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'D9'             DTRU -ADDED JAN/00.                          
         DC    AL2(8112)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'134076292'      EIN                                          
         DC    X'00'                                                            
         DC    CL33'DRUSH, LLC'                   COMPANY NAME                  
         DC    CL33'111 8TH AVE, 14TH FL'         3 X 33 ADDR LINES             
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10011'                              
         DC    CL240' '                                                         
         DC    CL40'SUSAN HOFFMAN'        AGENCY CONTACT NAME                   
         DC    CL15'2129817887'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'D9'             DTDD -ADDED JAN/2001                         
         DC    AL2(8342)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'19X17'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'132649664'      EIN                                          
         DC    X'01'                                                            
         DC    CL33'DEUTSCH, INC.'                COMPANY NAME                  
         DC    CL33'111 8TH AVE, 14TH FL'         3 X 33 ADDR LINES             
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10011'                              
         DC    CL240' '                                                         
         DC    CL40'SUSAN HOFFMAN'        AGENCY CONTACT NAME                   
         DC    CL15'2129817887'           AGENCY PHONE NUMBER                   
*                                                                               
* DB - CLIENT SERVICE                                                           
*                                                                               
         DC    CL2'*B'               DDSB                                       
         DC    AL2(2635)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'12345'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'123456789'        EIN                                        
         DC    X'01'                                                            
         DC    CL33' '                                                          
         DC    CL33' '                                                          
         DC    CL33' '                                                          
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'ZT'               DDSB                                       
         DC    AL2(2715)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'TCCCD'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'999999999'        EIN                                        
         DC    X'00'                                                            
         DC    CL33'NAME '                                                      
         DC    CL33'123 ADDRESS LINE 1'                                         
         DC    CL33'ADDRESS LINE 2'                                             
         DC    CL33'ADDRESS LINE 3'                                             
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'JOHN HIGGINS'  AGENCY CONTACT NAME                          
         DC    CL15'1234567890'    AGENCY PHONE NUMBER                          
*                                                                               
* DE - DELLA FEMINA MCNAMEE, INC.                                               
*                                                                               
         DC    CL2'DE'               DELLA FEMINA   DENYA                       
         DC    AL2(1737)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'132590823'        EIN                                        
         DC    X'00'                                                            
         DC    CL33' '                                                          
         DC    CL33' '                                                          
         DC    CL33' '                                                          
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'DE'               DELLA FEMINA   DEWNY                       
         DC    AL2(2309)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133639857'        EIN                                        
         DC    X'00'                                                            
         DC    CL33'EUROCOM ADVERTISING N.A., INC.'                             
         DC    CL33'350 HUDSON STREET'                                          
         DC    CL33'NEW YORK, NY 10014'                                         
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'DE'               DELLA FEMINA   DEBO                        
         DC    AL2(2139)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133597470'        EIN                                        
         DC    X'00'                                                            
         DC    CL33'LAWNER REINGOLD BRITTON && PTRS'                            
         DC    CL33'C/O DELLA FEMINA MCNAMEE, INC'                              
         DC    CL33'350 HUDSON STREET'                                          
         DC    CL33'NEW YORK, NY 10014'                                         
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'DE'               DELLA FEMINA   DENYC                       
         DC    AL2(2380)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'132590823'        EIN                                        
         DC    X'00'                                                            
         DC    CL33' '                                                          
         DC    CL99' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'DE'               DELLA FEMINA   DEDBO                       
         DC    AL2(2172)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133502994'        EIN                                        
         DC    X'00'                                                            
         DC    CL33'ORSATTI && PARRISH, INC.'                                   
         DC    CL33'C/O DELLA FEMINA MCNAMEE, INC'                              
         DC    CL33'350 HUDSON STREET'                                          
         DC    CL33'NEW YORK, NY 10014'                                         
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
* DM - DOREMUS AND COMPANY                                                      
*                                                                               
*        DC    CL2'DM'               DOREMUS & COMPANY  DMNYO                   
*        DC    AL2(1440)             ORIGIN (DEFAULT IS PRINC ID)               
*        DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
*        DC    CL9'135033900'                                                   
*        DC    X'00'                                                            
*        DC    CL33' '             COMPANY NAME                                 
*        DC    CL99' '             3 X 33 ADDR LINES                            
*        DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
*        DC    CL40' '             AGENCY CONTACT NAME                          
*        DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'DM'               DOREMUS & COMPANY  DMNYA                   
         DC    AL2(3023)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'35E66'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133712950'                                                   
         DC    X'01'                                                            
         DC    CL33'MERKLEY NEWMAN HARTY'   COMPANY NAME                        
         DC    CL33'200 VARICK STREET 12TH FLOOR' 3X33 ADD LINES                
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10014'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'CARRIE NEPO'          AGENCY CONTACT NAME                   
         DC    CL15'2123663538'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'DM'               DOREMUS & COMPANY  DMNYD                   
         DC    AL2(3148)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'35E65'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'135033900'                                                   
         DC    X'01'                                                            
         DC    CL33'DOREMUS'       COMPANY NAME                                 
         DC    CL33'200 VARICK STREET 11TH FL.' 3X33 ADDR LINES                 
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10014'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'LYNN BASTA'           AGENCY CONTACT NAME                   
         DC    CL15'2123663010'           AGENCY PHONE NUMBER                   
*                                                                               
* DS - TALENT PARTNERS                                                          
*                                                                               
         DC    CL2'DS'             SDNY ADDED JAN/2001                          
         DC    AL2(1878)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'363800090'      EIN                                          
         DC    X'00'                                                            
         DC    CL33'TALENT PARTNERS'                                            
         DC    CL33'303 EAST OHIO STREET'                                       
         DC    CL33' '                                                          
         DC    CL33'CHICAGO               IL60611'   3 X 33 ADDR LINES          
         DC    CL240' '                                                         
         DC    CL40'KEVIN BLACKMAN'       AGENCY CONTACT NAME                   
         DC    CL15'3129237918'           AGENCY PHONE NUMBER                   
*                                                                               
* DV - SPIER NEW YORK                                                           
*                                                                               
         DC    CL2'DV'             SDNY ADDED JAN/2001                          
         DC    AL2(7781)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'54180'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133545478'      EIN                                          
         DC    X'01'                                                            
         DC    CL33'SPIER NEW YORK'                                             
         DC    CL33'460 PARK AVENUE SOUTH'                                      
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10016'   3 X 33 ADDR LINES          
         DC    CL240' '                                                         
         DC    CL40'MARYBETH FICARRO'     AGENCY CONTACT NAME                   
         DC    CL15'2125619260'           AGENCY PHONE NUMBER                   
*                                                                               
* DW - SAATCHI AND SAATCHI NORTH AMERICA INC.                                   
*                                                                               
         DC    CL2'DW'             SAATCHI SAATCHI DFS, INC. - DWNYC            
         DC    AL2(1659)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'35D73'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133920076'      EIN                                          
         DC    X'01'                                                            
         DC    CL33'SAATCHI&&SAATCHI NORTH AMERICA'                             
         DC    CL33'375 HUDSON STREET'                                          
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10014'   3 X 33 ADDR LINES          
         DC    CL240' '                                                         
         DC    CL40'KAREN GREENFIELD 14TH FLOOR'   AGENCY CONTACT NAME          
         DC    CL15'2124632303'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'DW'             DWCN                                         
         DC    AL2(2533)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133198075'      EIN                                          
         DC    X'00'                                                            
         DC    CL33'CONILL ADVERTISING, INC.'                                   
         DC    CL33'375 HUDSON STREET'                                          
         DC    CL33'NEW YORK, NY 10014-3620'                                    
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '                    AGENCY CONTACT NAME                   
         DC    CL15' '                    AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'DW'             CONILL ADVERTISING - DWNYN                   
         DC    AL2(2534)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133198075'      EIN                                          
         DC    X'00'                                                            
         DC    CL33'CONILL ADVERTISING, INC.'                                   
         DC    CL33'375 HUDSON STREET'                                          
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10014'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'KAREN GREENFIELD  14TH FLOOR'  AGENCY CONTACT NAME          
         DC    CL15'2124632303'             AGENCY PHONE NUMBER                 
*                                                                               
         DC    CL2'DW'             DWKLC                                        
         DC    AL2(2783)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'132597353'      EIN                                          
         DC    X'00'                                                            
         DC    CL33'RESOURCE GROUP FOR HEALTH ED.'                              
         DC    CL33'375 HUDSON STREET'                                          
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10014'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'ANTHONY RUBINO'       AGENCY CONTACT NAME                   
         DC    CL15'2124633452'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'DW'             DWKLM                                        
         DC    AL2(2784)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'132852539'      EIN                                          
         DC    X'00'                                                            
         DC    CL33'MEDICAL SERVICE PROJECT, INC.'                              
         DC    CL33'375 HUDSON STREET 9 FLOOR'                                  
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10014'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'ANTHONY RUBINO'       AGENCY CONTACT NAME                   
         DC    CL15'2124633452'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'DW'             DWKLT                                        
         DC    AL2(2978)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'19686'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'132975889'      EIN                                          
         DC    X'01'                                                            
         DC    CL33'KLEMTNER ADVERTISING, INC.'                                 
         DC    CL33'375 HUDSON STREET'                                          
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10014'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'ANTHONY RUBINO'       AGENCY CONTACT NAME                   
         DC    CL15'2124633452'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'DW'             DWVL                                         
         DC    AL2(3595)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133198075'      EIN                                          
         DC    X'00'                                                            
         DC    CL33'VISION LATINA COMMUNICATIONS'                               
         DC    CL33'375 HUDSON STREET, 8TH FLOOR'                               
         DC    CL33'NEW YORK, NY  10014-3660'                                   
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'DW'             DWKLMB - ADDED 12/97                         
         DC    AL2(4456)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133862182'      EIN#/TIN#                                    
         DC    X'00'                                                            
         DC    CL33'BESTMED, INC.'                                              
         DC    CL33'375 HUDSON STREET, 8TH FLOOR'                               
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10014'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'ANTHONY RUBINO'       AGENCY CONTACT NAME                   
         DC    CL15'2124633452'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'DW'             DWKLE - ADDED 12/97                          
         DC    AL2(6455)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133939793'      EIN#/TIN#                                    
         DC    X'00'                                                            
         DC    CL33'VITAL HEALTHCARE COMMUNICATIONS'                            
         DC    CL33'375 HUDSON STREET'                                          
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10014'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'ANTHONY RUBINO'       AGENCY CONTACT NAME                   
         DC    CL15'2124633452'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'DW'             DWCL - ADDED JAN/98                          
         DC    AL2(6457)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133920076'      EIN#/TIN#                                    
         DC    X'00'                                                            
         DC    CL33'CLIFF FREEMAN AND PARTNERS'                                 
         DC    CL33'375 HUDSON STREET'                                          
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10014'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'KAREN GREENFIELD'     AGENCY CONTACT NAME                   
         DC    CL15'2124632303'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'DW'             DWKLF - ADDED DEC/98                         
         DC    AL2(6894)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133965952'      EIN#/TIN#                                    
         DC    X'00'                                                            
         DC    CL33'EVOLUTION HEALTH INITIATIVES, LLC'                          
         DC    CL33'485 A ROUTE 1 SOUTH SUITE 300'                              
         DC    CL33' '                                                          
         DC    CL33'ISELIN                NJ08830'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'ANTHONY RUBINO'       AGENCY CONTACT NAME                   
         DC    CL15'2124632000'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'DW'             DWKLJ - ADDED JAN/00                         
         DC    AL2(7850)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133888821'      EIN#/TIN#                                    
         DC    X'00'                                                            
         DC    CL33'ADVANCED THERAPEUTICS GROUP'                                
         DC    CL33'375 HUDSON STREET'                                          
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10014'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'ANTHONY RUBINO'       AGENCY CONTACT NAME                   
         DC    CL15'2124633452'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'DW'             DWKLN - ADDED JAN/00                         
         DC    AL2(7851)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133888821'      EIN#/TIN#                                    
         DC    X'00'                                                            
         DC    CL33'INSIGHTS && ACTIONS'                                        
         DC    CL33'375 HUDSON ST. - 9TH FLOOR'                                 
         DC    CL33'NEW YORK, NY 10014'                                         
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '                    AGENCY CONTACT NAME                   
         DC    CL15' '                    AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'DW'             DWKLG - ADDED JAN/00                         
         DC    AL2(7852)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133888821'      EIN#/TIN#                                    
         DC    X'00'                                                            
         DC    CL33'CREATIVITY IN PRACTICE'                                     
         DC    CL33'1 SUMMIT SQUARE, SUITE 303'                                 
         DC    CL33' '                                                          
         DC    CL33'LANGHORNE             PA19047'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'ANTHONY RUBINO'       AGENCY CONTACT NAME                   
         DC    CL15'2124633452'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'DW'             DWKLH - ADDED JAN/00                         
         DC    AL2(7853)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133888821'      EIN#/TIN#                                    
         DC    X'00'                                                            
         DC    CL33'HEALTHCARE RESOURCES GROUP'                                 
         DC    CL33'375 HUDSON STREET'                                          
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10014'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'ANTHONY RUBINO'       AGENCY CONTACT NAME                   
         DC    CL15'2124633452'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'DW'             DWKLP - ADDED JAN/00                         
         DC    AL2(7959)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133888821'      EIN#/TIN#                                    
         DC    X'00'                                                            
         DC    CL33'N8 DIGITAL'    COMPANY NAME                                 
         DC    CL33'375 HUDSON STREET, 9TH FL.'    3X33 ADDRESS LINES           
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10014'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'ANTHONY RUBINO'       AGENCY CONTACT NAME                   
         DC    CL15'2124633452'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'DW'             DWKLL - ADDED JAN/00                         
         DC    AL2(8052)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133888821'      EIN#/TIN#                                    
         DC    X'00'                                                            
         DC    CL33'INNOVATIVE HEALTHCARE STRATEGIES'     COMPANY NAME          
         DC    CL33'375 HUDSON STREET'     3X33 ADDRESS LINES                   
         DC    CL33'NEW YORK, NY  10014-3620'                                   
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '                    AGENCY CONTACT NAME                   
         DC    CL15' '                    AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'DW'                                                          
         DC    AL2(8801)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133888821'      EIN#/TIN#                                    
         DC    X'00'                                                            
         DC    CL33'SAATCHI && SAATCHI HEALTHCARE'      COMPANY NAME            
         DC    CL33'375 HUDSON STREET'     3X33 ADDRESS LINES                   
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10014'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'ANTHONY RUBINO'       AGENCY CONTACT NAME                   
         DC    CL15'2124633452'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'DW'                                                          
         DC    AL2(9148)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'131837737'      EIN#/TIN#                                    
         DC    X'00'                                                            
         DC    CL33'ROWLAND COMMUNICATIONS WORLDWIDE'     COMPANY NAME          
         DC    CL33'375 HUDSON STREET'     3X33 ADDRESS LINES                   
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10014'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'KAREN GREENFIELD'     AGENCY CONTACT NAME                   
         DC    CL15'2124632303'           AGENCY PHONE NUMBER                   
*                                                                               
* FB - BBDO                                                                     
*                                                                               
         DC    CL2'FB'               TFB/BBDO, INC. - TFBPA                     
         DC    AL2(2793)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'942276267'                                                   
         DC    X'00'                                                            
         DC    CL33'TFB/BBDO, INC'                                              
         DC    CL99' '             3 X 33 ADDR LINES                            
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
* FM - SFM MEDIA CORPORATION                                                    
*                                                                               
         DC    CL2'FM'               FMNY - SFM MEDIA CORPORATION               
         DC    AL2(0261)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133977932'                                                   
         DC    X'00'                                                            
         DC    CL33'MEDIA PLANNING LLC'                                         
         DC    CL33'1180 AVENUE OF THE AMERICAS'    3 X 33 ADDR LINES           
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10036'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'PREMA DESAI'          AGENCY CONTACT NAME                   
         DC    CL15'2127904892'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'FM'               FMNYE - SFM ENTERTAINMENT LLC              
         DC    AL2(6876)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133977929'                                                   
         DC    X'00'                                                            
         DC    CL33'SFM ENTERTAINMENT LLC'       COMPANY NAME                   
         DC    CL33'1180 AVENUE OF THE AMERICAS' 3 X 33 ADDR LINES              
         DC    CL33'NEW YORK, NY 10018'                                         
         DC    CL33' '             3 X 33 ADDR LINES                            
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '                    AGENCY CONTACT NAME                   
         DC    CL15' '                    AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'FM'                                                          
         DC    AL2(8442)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'650938786'                                                   
         DC    X'00'                                                            
         DC    CL33'MEDIA PLANNING INTERNATIONAL CO.'    COMPANY NAME           
         DC    CL33'1180 AVENUE OF THE AMERICAS' 3 X 33 ADDR LINES              
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10036'    3 X 33 ADDR LINES         
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'PREMA DESAI'          AGENCY CONTACT NAME                   
         DC    CL15'2127904892'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'FM'               FMMPG - ADDED JAN/2001                     
         DC    AL2(8565)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133502994'                                                   
         DC    X'00'                                                            
         DC    CL33'MEDIA PLANNING GROUP USA INC.'   COMPANY NAME               
         DC    CL33'1180 AVENUE OF THE AMERICAS' 3X33 ADDRESS LINES             
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10036'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'PREMA DESAI'          AGENCY CONTACT NAME                   
         DC    CL15'2127904892'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'FM'               FMMC - ADDED JAN/2001                      
         DC    AL2(8566)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'522178035'                                                   
         DC    X'00'                                                            
         DC    CL33'MEDIA CONTACTS INC'    COMPANY NAME                         
         DC    CL33'1180 AVENUE OF THE AMERICAS' 3X33 ADDRESS LINES             
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10036'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'PREMA DESAI'          AGENCY CONTACT NAME                   
         DC    CL15'2127904892'           AGENCY PHONE NUMBER                   
*                                                                               
* FV - FOGARTY KLEIN MONROE                                                     
*                                                                               
         DC    CL2'FV'                                                          
         DC    AL2(8894)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'742113531'                                                   
         DC    X'00'                                                            
         DC    CL33'FOGARTY && KLEIN, INC.'                                     
         DC    CL33'7155 OLD KATY ROAD'   3 X 33 ADDR LINES                     
         DC    CL33' '                                                          
         DC    CL33'HOUSTON               TX77024'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'ROGER BECKSTEAD'  AGENCY CONTACT NAME                       
         DC    CL15'7138625100'       AGENCY PHONE NUMBER                       
*                                                                               
* GB - GRIFFIN BACAL.                                                           
*                                                                               
         DC    CL2'GB'               GENY - GEER DUBOIS INC.                    
         DC    AL2(0315)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'132941459'                                                   
         DC    X'00'                                                            
         DC    CL33'    GBNY'                                                   
         DC    CL33'437 MADISON AVENUE'   3 X 33 ADDR LINES                     
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10022'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'KERRI AJELLO'  AGENCY CONTACT NAME                          
         DC    CL15'2128176509'    AGENCY PHONE NUMBER                          
*                                                                               
* GE - HMS/RUHR, LTD.                                                           
*                                                                               
         DC    CL2'GE'               GENY - GEER DUBOIS INC.                    
         DC    AL2(2957)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'131555974'                                                   
         DC    X'00'                                                            
         DC    CL33'GEER DUBOIS INC.'                                           
         DC    CL99' '             3 X 33 ADDR LINES                            
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
* GV - GAVIN ANDERSON AND COMPANY                                               
*                                                                               
         DC    CL2'GV'             GAVIN - DMGA                                 
         DC    AL2(2340)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133083151'                                                   
         DC    X'00'                                                            
         DC    CL33'GAVIN ANDERSON AND COMPANY'   COMPANY NAME                  
         DC    CL33'220 EAST 42ND STREET  SUITE 408' 3X33 ADDR LINES            
         DC    CL33'NEW YORK, NY 10017'                                         
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '                    AGENCY CONTACT NAME                   
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
* HK - HILL AND KNOWLTON, INC.                                                  
*                                                                               
         DC    CL2'HK'               HILL & KNOWLTON - HKNY                     
         DC    AL2(1702)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'19981'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133016062'        EIN#/TIN#                                  
         DC    X'01'                                                            
         DC    CL33'HILL && KNOWLTON, INC.'   COMPANY NAME                      
         DC    CL33'466 LEXINGTON AVENUE'   3 X 33 ADDR LINES                   
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10017'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'ALAN BOLTON'   AGENCY CONTACT NAME                          
         DC    CL15'2128851389'    AGENCY PHONE NUMBER                          
*                                                                               
* HL - HILL AND KNOWLTON, INC.                                                  
*                                                                               
         DC    CL2'HL'               HLTOC                                      
         DC    AL2(2521)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'000000000'                                                   
         DC    X'00'                                                            
         DC    CL33'HILL && KNOWLTON, CANADA'   COMPANY NAME                    
         DC    CL33'160 BLOOR ST E, SUITE 700'  3 X 33 ADDR LINES               
         DC    CL33'TORONTO, ONTARIO  M4W 3P7'                                  
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
* H3 - HOLLAND MARK MARTIN EDMUND                                               
*                                                                               
         DC    CL2'H3'             HOLLAND MARK MARTIN EDMUND - HMME            
         DC    AL2(6936)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'042903978'                                                   
         DC    X'00'                                                            
         DC    CL33'HOLLAND MARK MARTIN EDMUND'   COMPANY NAME                  
         DC    CL33'312 STUART STREET'    3X33 ADDRESS LINES                    
         DC    CL33'BOSTON, MA, 02110'                                          
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '                    AGENCY CONTACT NAME                   
         DC    CL15' '                    AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'H3'             HOLLAND MARK MARTIN EDMUND - HMMEA           
         DC    AL2(6938)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'042903978'                                                   
         DC    X'00'                                                            
         DC    CL33'HOLLAND MARK MARTIN EDMUND'   COMPANY NAME                  
         DC    CL33'312 STUART STREET'                                          
         DC    CL33'BOSTON, MA  02116'                                          
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'STEVEN A. REIDY'      AGENCY CONTACT NAME                   
         DC    CL15'6179603565'           AGENCY PHONE NUMBER                   
*                                                                               
* H9 - STARLINK                                                                 
*                                                                               
         DC    CL2'H9'             STACH STARLINK - ADDED JAN/2001              
         DC    AL2(8601)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'364347045'                                                   
         DC    X'00'                                                            
         DC    CL33'STARLINK'      COMPANY NAME                                 
         DC    CL33'1 EAST WACKER DRIVE, STE. 1500'  3X33 ADDRESS LINES         
         DC    CL33'CHICAGO, IL 60601'                                          
         DC    CL33' '                                                          
         DC    CL240' '               OFFICE LIST (SPACES - NO LIST)            
         DC    CL40' '                AGENCY CONTACT NAME                       
         DC    CL15' '                AGENCY PHONE NUMBER                       
*                                                                               
* ID - RAPP COLLINS - REPLACED FROM BC ON JAN/2001                              
*                                                                               
         DC    CL2'ID'               RCDA - ADDED JAN/2001                      
         DC    AL2(7557)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'752625096'        EIN#/TIN#                                  
         DC    X'00'                                                            
         DC    CL33'RAPP COLLINS WORLDWIDE'                                     
         DC    CL33'1660 NORTH WESTRIDGE CIRCLE'  3 X 33 ADDR LINES             
         DC    CL33' '                                                          
         DC    CL33'IRVING                TX75038'                              
         DC    CL240' '             OFFICE LIST (SPACES - NO LIST)              
         DC    CL40'AMY WEAVER'     AGENCY CONTACT NAME                         
         DC    CL15'9725822028'     AGENCY PHONE NUMBER                         
*                                                                               
         DC    CL2'ID'               RCSCP - ADDED JAN/2001                     
         DC    AL2(8557)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133364184'        EIN#/TIN#                                  
         DC    X'00'                                                            
         DC    CL33'SCP RAPP COLLINS MEDIA'                                     
         DC    CL33'11 MADISON AVE - 12TH FLOOR'    3 X 33 ADDR LINES           
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10010'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'WARREN LIN'    AGENCY CONTACT NAME                          
         DC    CL15'2125607400'    AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'ID'               RCNY - ADDED JAN/2001                      
         DC    AL2(8558)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'112679168'        EIN#/TIN#                                  
         DC    X'00'                                                            
         DC    CL33'RAPP COLLINS WORLDWIDE'     COMPANY NAME                    
         DC    CL33'11 MADISON AVE'             3 X 33 ADDR LINES               
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10010'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'DOROTHY FREDA'    AGENCY CONTACT NAME                       
         DC    CL15'2125907400'       AGENCY PHONE NUMBER                       
*                                                                               
         DC    CL2'ID'             RCMN - ADDED JAN/2001                        
         DC    AL2(8559)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'363698267'      EIN#/TIN#                                    
         DC    X'00'                                                            
         DC    CL33'RAPP COLLINS WORLDWIDE'    COMPANY NAME                     
         DC    CL33'901 MARQUETTE AVE S - 17TH FL' 3X33 ADDRESS LINES           
         DC    CL33'MINNEAPOLIS, MN 55429'                                      
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '                    AGENCY CONTACT NAME                   
         DC    CL15' '                    AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'ID'               RCCH - ADDED JAN/2001                      
         DC    AL2(8561)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'364053944'        EIN#/TIN#                                  
         DC    X'00'                                                            
         DC    CL33'RAPP COLLINS WORLDWIDE'      COMPANY NAME                   
         DC    CL33'10 S. RIVERSIDE PLAZA SUITE 1920' 3X33 ADD LINES            
         DC    CL33'CHICAGO, IL 60606'                                          
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '                    AGENCY CONTACT NAME                   
         DC    CL15' '                    AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'ID'                                                          
         DC    AL2(8562)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'752625370'        EIN#/TIN#                                  
         DC    X'00'                                                            
         DC    CL33'THE FOCUS AGENCY'                                           
         DC    CL33'1660 NORTH WESTRIDGE CIRCLE'  3 X 33 ADDR LINES             
         DC    CL33' '                                                          
         DC    CL33'IRVING                TX75038'                              
         DC    CL240' '             OFFICE LIST (SPACES - NO LIST)              
         DC    CL40'AMY WEAVER'     AGENCY CONTACT NAME                         
         DC    CL15'9725822028'     AGENCY PHONE NUMBER                         
*                                                                               
         DC    CL2'ID'             RCDS - ADDED JAN/2001                        
         DC    AL2(8588)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'364019827'      EIN#/TIN#                                    
         DC    X'00'                                                            
         DC    CL33'INFOWORKS, INC.'  COMPANY NAME                              
         DC    CL33'8410 W. BRYN MAWR SUITE 600'  3X33 ADDRESS LINES            
         DC    CL33'CHICAGO, IL 60631'                                          
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '                    AGENCY CONTACT NAME                   
         DC    CL15' '                    AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'ID'             RCRD - ADDED JAN/2001                        
         DC    AL2(8589)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'134088029'      EIN#/TIN#                                    
         DC    X'00'                                                            
         DC    CL33'RAPP DIGITAL DIRECT, INC.' COMPANY NAME                     
         DC    CL33'11 MADISON AVENUE'         3X33 ADDRESS LINES               
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10010'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'CYNTHIA RATTNER'      AGENCY CONTACT NAME                   
         DC    CL15'2125907400'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'ID'               RCAC - ADDED JAN/2001                      
         DC    AL2(8647)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'134052294'        EIN#/TIN#                                  
         DC    X'00'                                                            
         DC    CL33'ACUITY HEALTH GROUP'   COMPANY NAME                         
         DC    CL33'11 MADISON AVENUE'  3 X 33 ADDR LINES                       
         DC    CL33'NY, NY 10010'                                               
         DC    CL33' '                                                          
         DC    CL240' '                 OFFICE LIST (SPACES - NO LIST)          
         DC    CL40' '                  AGENCY CONTACT NAME                     
         DC    CL15' '                  AGENCY PHONE NUMBER                     
*                                                                               
         DC    CL2'ID'               RCCO - ADDED JAN/2001                      
         DC    AL2(8648)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'112679168'        EIN#/TIN#                                  
         DC    X'00'                                                            
         DC    CL33'RAPP COLLINS'          COMPANY NAME                         
         DC    CL33'11 MADISON AVENUE'    3 X 33 ADDR LINES                     
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10010'                              
         DC    CL240' '                 OFFICE LIST (SPACES - NO LIST)          
         DC    CL40'RICHARD HENDRIX'    AGENCY CONTACT NAME                     
         DC    CL15'2125907192'         AGENCY PHONE NUMBER                     
*                                                                               
* I5 - INTEGRATED COMMUNICATIONS CORP.                                          
*                                                                               
         DC    CL2'I5'             ICCNJ - INTEGRATED COMMUNICATIONS            
         DC    AL2(7348)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'19R35'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'222619437'                                                   
         DC    X'01'                                                            
         DC    CL33'INTEGRATED COMMUNICATIONS CORP.'    COMPANY NAME            
         DC    CL33'5 SYLVAN WAY'                                               
         DC    CL33' '                                                          
         DC    CL33'PARSIPPANY            NJ07054'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'MICHELE EVELAND'      AGENCY CONTACT NAME                   
         DC    CL15'9734512404'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'I5'             ICC01 - ADDED JAN/2001                       
         DC    AL2(7446)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'19R35'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'222619437'                                                   
         DC    X'01'                                                            
         DC    CL33'INTEGRATED COMMUNICATIONS CORP.'     COMPANY NAME           
         DC    CL33'5 SYLVAN WAY'                                               
         DC    CL33'PARSIPPANY, N.J. 07054'                                     
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '                    AGENCY CONTACT NAME                   
         DC    CL15' '                    AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'I5'             ICC02 - ADDED JAN/2001                       
         DC    AL2(7447)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'19R35'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'222619437'                                                   
         DC    X'01'                                                            
         DC    CL33'ALLIANCE FOR SCIENTIFIC AFFAIRS'     COMPANY NAME           
         DC    CL33'5 SYLVAN WAY'                                               
         DC    CL33'PARSIPPANY, N.J. 07054'                                     
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '                    AGENCY CONTACT NAME                   
         DC    CL15' '                    AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'I5'             ICC03 - ADDED JAN/2001                       
         DC    AL2(7448)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'19R35'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'222619437'                                                   
         DC    X'01'                                                            
         DC    CL33'INTEGRATED COMMUNICATIONS CORP.'      COMPANY NAME          
         DC    CL33'5 SYLVAN WAY'                                               
         DC    CL33'PARSIPPANY, NJ 07054'                                       
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '                    AGENCY CONTACT NAME                   
         DC    CL15' '                    AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'I5'             ICC04 - ADDED JAN/2001                       
         DC    AL2(7967)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'19R35'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'222619437'                                                   
         DC    X'01'                                                            
         DC    CL33'INTERLINK HEALTHCARE COMMUNICATIONS' COMPANY NAME           
         DC    CL33'5 SYLVAN WAY'  3X33 ADDRESS LINES                           
         DC    CL33'PARSIPPANY, NJ 07054'                                       
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '                    AGENCY CONTACT NAME                   
         DC    CL15' '                    AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'I5'             ICC02S - ADDED JAN/2001                      
         DC    AL2(8555)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'19R35'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'222619437'                                                   
         DC    X'01'                                                            
         DC    CL33'SENIOR CARE SEMINAR'         COMPANY NAME                   
         DC    CL33'5 SYLVAN WAY'                                               
         DC    CL33'PARSIPPANY, N.J. 07054'                                     
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '                    AGENCY CONTACT NAME                   
         DC    CL15' '                    AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'I5'             ICC05 - ADDED JAN/2001                       
         DC    AL2(9169)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'19R35'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'222619437'                                                   
         DC    X'01'                                                            
         DC    CL33'MEDMEETINGS'    COMPANY NAME                                
         DC    CL33'5 SYLVAN WAY'   3X33 ADDRESS LINES                          
         DC    CL33'PARSIPPANY, N.J. 07054'                                     
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '                    AGENCY CONTACT NAME                   
         DC    CL15' '                    AGENCY PHONE NUMBER                   
*                                                                               
* JG - COHN AND WOLFE                                                           
*                                                                               
         DC    CL2'JG'                                                          
         DC    AL2(9492)           ORIGIN (DEFAULT IS PRINC ID)   12/95         
         DC    CL5'19728'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'131493710'                                                   
         DC    X'01'                                                            
         DC    CL33'Y && R, INC. DBA COHN && WOLF'   COMPANY NAME               
         DC    CL33'292 MADISON AVE.'                                           
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10017'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'STEVEN MANDELL'   AGENCY CONTACT NAME                       
         DC    CL15'2122103060'    AGENCY PHONE NUMBER                          
*                                                                               
* JW - J. WALTER THOMPSON                                                       
*                                                                               
         DC    CL2'JW'             J WALTER JWNYA - CHANGED FROM JWNYME         
         DC    AL2(0460)           ORIGIN (DEFAULT IS PRINC ID)   12/95         
         DC    CL5'19984'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133016052'                                                   
         DC    X'01'                                                            
         DC    CL33'J.WALTER THOMPSON, U.S.A.'   COMPANY NAME                   
         DC    CL33'466 LEXINGTON AVENUE'                                       
         DC    CL33'NEW YORK, NY  10017'                                        
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'JW'             J WALTER - JWBC                              
         DC    AL2(1773)           ORIGIN (DEFAULT IS PRINC ID)   12/99         
         DC    CL5'19343'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133040332'                                                   
         DC    X'01'                                                            
         DC    CL33'BROUILLARD COMMUNICATIONS INC'    COMPANY NAME              
         DC    CL33'420 LEXINGTON AVENUE'                                       
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10017'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'GAYA RACHANSKI'       AGENCY CONTACT NAME                   
         DC    CL15'2122107718'    AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'JW'             J WALTER - JWTIG                             
         DC    AL2(6803)           ORIGIN (DEFAULT IS PRINC ID)   12/99         
         DC    CL5'19338'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133974921'      TIN NUMBER                                   
         DC    X'01'                                                            
         DC    CL33'THE INTUITION GROUP INC'  COMPANY NAME                      
         DC    CL33'500 WOODWARD AVE'                                           
         DC    CL33' '                                                          
         DC    CL33'DETROIT               MI48226'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'GAYA RACHANSKI'       AGENCY CONTACT NAME                   
         DC    CL15'2122107718'    AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'JW'             J WALTER - JWFR                              
         DC    AL2(7379)           ORIGIN (DEFAULT IS PRINC ID)   12/99         
         DC    CL5'89243'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'943307791'                                                   
         DC    X'01'                                                            
         DC    CL33'FORESTERIA, INC.'     COMPANY NAME                          
         DC    CL33'4 EMBARCADERO CENTER'                                       
         DC    CL33' '                                                          
         DC    CL33'SAN FRANCISCO         CA94111'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'GAYA RACHANSKI'       AGENCY CONTACT NAME                   
         DC    CL15'2122107718'    AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'JW'             J WALTER - JWT99                             
         DC    AL2(8239)           ORIGIN (DEFAULT IS PRINC ID)   12/99         
         DC    CL5'19984'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133016052'                                                   
         DC    X'01'                                                            
         DC    CL33'J. WALTER THOMPSON USA'   COMPANY NAME                      
         DC    CL33'466 LEXINGTON AVENUE'                                       
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10017'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'GAYA RACHANSKI'       AGENCY CONTACT NAME                   
         DC    CL15'2122107718'    AGENCY PHONE NUMBER                          
*                                                                               
* KP - KALLIR, PHILIPS, ROSS INC.                                               
*                                                                               
         DC    CL2'KP'               KPNY                                       
         DC    AL2(2061)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133169392'        TIN/EIN #                                  
         DC    X'00'               CHANGED TO DWNLD JAN/98 AS PER REQ           
         DC    CL33'KALLIR, PHILIPS, ROSS, INC.'                                
         DC    CL33'333 E.38TH STREET'   3 X 33 ADDR LINES                      
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10016'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'GAIL GOLDMAN'         AGENCY CONTACT NAME                   
         DC    CL15'2128568847'           AGENCY PHONE NUMBER                   
*                                                                               
*        DC    CL2'KP'               KPSF-KALLIR, PHILIPS ROSS INC              
*        DC    AL2(4589)             ORIGIN (DEFAULT IS PRINC ID)               
*        DC    CL5'19868'            TRANSMITTER#(00000 USE DDS#)-TCC           
*        DC    CL9'942554387'        TIN/EIN #                                  
*        DC    X'00'                                                            
*        DC    CL33'RAINOLDI KERZNER RADCLIFFE'                                 
*        DC    CL33'343 SANSOME STREET'                                         
*        DC    CL33'SAN FRANCISCO, CA 94104-1309'                               
*        DC    CL33' '                                                          
*        DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
*        DC    CL40' '             AGENCY CONTACT NAME                          
*        DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
*        DC    CL2'KP'               KPNYC - JAN/98                             
*        DC    AL2(4591)             ORIGIN (DEFAULT IS PRINC ID)               
*        DC    CL5'19868'            TRANSMITTER#(00000 USE DDS#)-TCC           
*        DC    CL9'133169392'        TIN/EIN #                                  
*        DC    X'01'                                                            
*        DC    CL33'KALLIR, PHILIPS, ROSS, INC.'                                
*        DC    CL99' '             3 X 33 ADDR LINES                            
*        DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
*        DC    CL40'NEVEEN MIGALY'        AGENCY CONTACT NAME                   
*        DC    CL15'2128568830'           AGENCY PHONE NUMBER                   
*                                                                               
*        DC    CL2'KP'               KPGM-KALLIR, PHILIPS ROSS INC              
*        DC    AL2(4770)             ORIGIN (DEFAULT IS PRINC ID)               
*        DC    CL5'19868'            TRANSMITTER#(00000 USE DDS#)-TCC           
*        DC    CL9'232722341'        TIN/EIN#                                   
*        DC    X'00'                                                            
*        DC    CL33'THE GMR GROUP'                                              
*        DC    CL33'1300 VIRGINIA DR. - SUITE 210'                              
*        DC    CL33'FT. WASHINGTON, PA  19034'                                  
*        DC    CL33' '                                                          
*        DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
*        DC    CL40'SHARI NADELL'  AGENCY CONTACT NAME                          
*        DC    CL15'2128568830'    AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'KP'             KPKT - ADDED 12/97                           
         DC    AL2(6203)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'19868'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'134038808'      TIN/EIN#                                     
         DC    X'00'                                                            
         DC    CL33'ACCEL HEALTHCARE COMMUNICATIONS L'                          
         DC    CL33'25 WEST 43RD STREET    ROOM 620'                            
         DC    CL33'NEW YORK, NY 10036'                                         
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
* LA - LARSON, COLBY                                                            
*                                                                               
         DC    CL2'LA'             LARSON, COLBY - LALA                         
         DC    AL2(1558)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'942597272'      TIN/EIN#                                     
         DC    X'00'                                                            
         DC    CL33' '             COMPANY NAME                                 
         DC    CL99' '             3 X 33 ADDR LINES                            
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
* LC - GOTHAM                                                                   
*                                                                               
         DC    CL2'LC'                                                          
         DC    AL2(1497)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133753098'      TIN/EIN#                                     
         DC    X'00'                                                            
         DC    CL33'GOTHAM INC.'   COMPANY NAME                                 
         DC    CL33'100 FIFTH AVENUE'    3 X 33 ADDR LINES                      
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10011'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'PAM WALSH'     AGENCY CONTACT NAME                          
         DC    CL15'2124147033'    AGENCY PHONE NUMBER                          
*                                                                               
* LE - LEAGAS DELANEY                                                           
*                                                                               
         DC    CL2'LE'               LDSF                                       
         DC    AL2(6637)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'39J40'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133832066'                                                   
         DC    X'01'                                                            
         DC    CL33'LEAGAS DELANEY, INC.'           COMPANY NAME                
         DC    CL33'840 BATTERY STREET, 2ND FLOOR'  ADDRESS                     
         DC    CL33' '                                                          
         DC    CL33'SAN FRANCISCO         CA94111'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'ANN MARIE FLANDEZ'     AGENCY CONTACT NAME                  
         DC    CL15'4156771311'    AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'LE'               LDNOSH - ADDED FEB/00                      
         DC    AL2(6687)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'39J40'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133832066'                                                   
         DC    X'01'                                                            
         DC    CL33'LEAGAS DELANEY, INC.'           COMPANY NAME                
         DC    CL33'840 BATTERY STREET'             ADDRESS                     
         DC    CL33' '                                                          
         DC    CL33'SAN FRANCISCO         CA94111'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'ANN MARIE FLANDEZ'   AGENCY CONTACT NAME                    
         DC    CL15'4156771311'    AGENCY PHONE NUMBER                          
*                                                                               
* LM - LOWE AND PARTNERS/SMS                                                    
*                                                                               
         DC    CL2'LM'               LOWE - LMNYA                               
         DC    AL2(2365)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'132837056'                                                   
         DC    X'00'                                                            
         DC    CL33'LOWE LINTAS && PARTNERS'                                    
         DC    CL33'ONE DAG HAMMARSKJOLD PLAZA'     ADDRESS                     
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10017'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'SIM SIMSIMAN'         AGENCY CONTACT NAME                   
         DC    CL15'2126058000'    AGENCY PHONE NUMBER                          
*                                                                               
* LP - LOWE DIRECT                                                              
*                                                                               
*        DC    CL2'LP'               LOWE - LPNYD                               
*        DC    AL2(2482)             ORIGIN (DEFAULT IS PRINC ID)               
*        DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
*        DC    CL9'133900345'                                                   
*        DC    X'00'                                                            
*        DC    CL33'LOWE FOX PAVLIKA'                                           
*        DC    CL33'1114 AVENUE OF THE AMERICAS'                                
*        DC    CL33'NEW YORK, NY 10036-7796'                                    
*        DC    CL33' '                                                          
*        DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
*        DC    CL40'SUSAN MOZDIERZ'       AGENCY CONTACT NAME                   
*        DC    CL15'2127437842'    AGENCY PHONE NUMBER                          
*                                                                               
*        DC    CL2'LP'               LOWE - LPNYDT                              
*        DC    AL2(6169)             ORIGIN (DEFAULT IS PRINC ID)               
*        DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
*        DC    CL9'133900345'                                                   
*        DC    X'00'                                                            
*        DC    CL33'LOWE DIRECT, INC.'                                          
*        DC    CL33'1114 AVENUE OF THE AMERICAS'                                
*        DC    CL33'NEW YORK, NY 10036-7796'                                    
*        DC    CL33' '                                                          
*        DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
*        DC    CL40' '             AGENCY CONTACT NAME                          
*        DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
* MP - THE MINGO GROUP                                                          
*                                                                               
         DC    CL2'MP'             THE MINGO GROUP - TMGT                       
         DC    AL2(2979)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'132887300'                                                   
         DC    X'00'                                                            
         DC    CL33'THE MINGO GROUP'     COMPANY NAME                           
         DC    CL33'228 EAST 45TH ST.'    3 X 33 ADDR LINES                     
         DC    CL33'NEW YORK, NY 10017'                                         
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '               AGENCY CONTACT NAME                        
         DC    CL15' '               AGENCY PHONE NUMBER                        
*                                                                               
* MZ - MEZZINA/BROWN INC.                                                       
*                                                                               
         DC    CL2'MZ'             MZNY - MEZZINA BROWN                         
         DC    AL2(2736)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'134085826'                                                   
         DC    X'00'                                                            
         DC    CL33'MEZZINA BROWN && PARTNERS'    COMPANY NAME                  
         DC    CL33'401 PARK AVE. SOUTH (7TH FLOOR)'  3 X 33 ADDR LINES         
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10016'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'DANIEL SEIZINGER'     AGENCY CONTACT NAME                   
         DC    CL15'2122517198'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'MZ'             MZIN - MEZZINA BROWN                         
         DC    AL2(3366)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133753385'                                                   
         DC    X'00'                                                            
         DC    CL33'M/B INTERACTIVE INC.'      COMPANY NAME                     
         DC    CL33'C/O MEZZINA/BROWN, INC.'                                    
         DC    CL33'401 PARK AVE. SOUTH - 7TH FL'    ADDRESS                    
         DC    CL33'NEW YORK, NY 10016'                                         
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'DAVID FRUTKO'  AGENCY CONTACT NAME                          
         DC    CL15'2122517716'    AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'MZ'             MZNYA - MEZZINA BROWN                        
         DC    AL2(8495)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'113077473'                                                   
         DC    X'00'                                                            
         DC    CL33'MEZZINA BROWN'             COMPANY NAME                     
         DC    CL33'401 PARK AVE. SOUTH (7TH FLOOR)'                            
         DC    CL33'NEW YORK NY 10016'                                          
         DC    CL33' '                              ADDRESS                     
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
* NC - NORTH CASTLE PARTNERS                                                    
*                                                                               
         DC    CL2'NC'                                                          
         DC    AL2(1053)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'061470186'      TIN/EIN #                                    
         DC    X'00'                                                            
         DC    CL33'NORTH CASTLE COMMUNICATIONS,INC.'                           
         DC    CL33'15 BANK STREET'    3 X 33 ADDR LINES                        
         DC    CL33' '                                                          
         DC    CL33'STAMFORD              CT06901'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'FELIX TALAMO'       AGENCY CONTACT NAME                     
         DC    CL15'2033582110'         AGENCY PHONE NUMBER                     
*                                                                               
* NE - DDB NEEDHAM WORLDWIDE INC.                                               
*                                                                               
         DC    CL2'NE'             DNNYA - DDB NEEDHAM WORLDWIDE                
         DC    AL2(1314)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'19E33'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133355855'      TIN/EIN #                                    
         DC    X'01'                                                            
         DC    CL33'DDB WORLDWIDE COMMUNICATIONS GROU'                          
         DC    CL33'437 MADISON AVE'    3 X 33 ADDR LINES                       
         DC    CL33'NEW YORK, N.Y. 10022'                                       
         DC    CL33'NEW YORK              NY10022'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'GLORIA ARIAS'       AGENCY CONTACT NAME                     
         DC    CL15'2124152247'         AGENCY PHONE NUMBER                     
*                                                                               
         DC    CL2'NE'             DNCHC - DDB NEEDHAM WORLDWIDE                
         DC    AL2(3839)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'19E33'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'363711029'      TIN/EIN#                                     
         DC    X'01'                                                            
         DC    CL33'DDB CHICAGO INC.'     AGENCY NAME                           
         DC    CL33'437 MADISON AVENUE'   AGENCY ADDRESS                        
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10022'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'GLORIA ARIAS'  AGENCY CONTACT NAME                          
         DC    CL15'2124152247'    AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'NE'             DNGBA - DDB NEEDHAM WORLDWIDE INC.           
         DC    AL2(6812)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'132941459'      TIN/EIN#                                     
         DC    X'00'                                                            
         DC    CL33'GRIFFIN BACAL INC.'                                         
         DC    CL33'437 MADISON AVENUE'    3X33 ADDRESS LINES                   
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10022'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'KERRI AJELLO'         AGENCY CONTACT NAME                   
         DC    CL15'2128176509'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'NE'             DNSE - DDB WORLDWIDE INC.                    
         DC    AL2(7023)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'911140296'      TIN/EIN#                                     
         DC    X'00'                                                            
         DC    CL33'ELGIN DDB'                                                  
         DC    CL33'1008 WESTERN AVE. SUITE #601'                               
         DC    CL33' '                                                          
         DC    CL33'SEATTLE               WA98104'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'GLENNA MILESON'      AGENCY CONTACT NAME                    
         DC    CL15'2062236302'          AGENCY PHONE NUMBER                    
*                                                                               
         DC    CL2'NE'             DNSENS - ADDED JAN/2001                      
         DC    AL2(7659)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'19868'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'911140296'      TIN/EIN#                                     
         DC    X'01'                                                            
         DC    CL33'DDB SEATTLE'                                                
         DC    CL33'1008 WESTERN AVE. SUITE 601'                                
         DC    CL33' '                                                          
         DC    CL33'SEATTLE               WA98104'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'GLENNA MILESON'      AGENCY CONTACT NAME                    
         DC    CL15'2062236302'          AGENCY PHONE NUMBER                    
*                                                                               
         DC    CL2'NE'                                                          
         DC    AL2(8447)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'59D86'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'134088671'      TIN/EIN#                                     
         DC    X'00'                                                            
         DC    CL33'DAVID && GOLIATH, LLC'                                      
         DC    CL33'11755 WILSHIRE BLVD'                                        
         DC    CL33'20TH FLOOR'                                                 
         DC    CL33'LOS ANGELES           CA90025'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'ANDREW KEREKES'      AGENCY CONTACT NAME                    
         DC    CL15'2124153170'          AGENCY PHONE NUMBER                    
*                                                                               
* NW - NW AYER INC                                                              
*                                                                               
         DC    CL2'NW'             N.W.AYER - AYNYR                             
         DC    AL2(2628)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'19579'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'230376910'                                                   
         DC    X'01'                                                            
         DC    CL33' '             COMPANY NAME                                 
         DC    CL99' '             3 X 33 ADDR LINES                            
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'NW'               N.W.AYER - AYDR                            
         DC    AL2(3127)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'19579'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133710113'                                                   
         DC    X'01'                                                            
         DC    CL33'DIRECT PRO, INC.'                                           
         DC    CL33'825 EIGHTH AVENUE'                                          
         DC    CL33'NY, NY  10019'                                              
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'NW'               N.W.AYER - AYWD                            
         DC    AL2(3140)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'19M97'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133710114'                                                   
         DC    X'01'                                                            
         DC    CL33' '             COMPANY NAME                                 
         DC    CL99' '             3 X 33 ADDR LINES                            
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'NW'               N.W.AYER - AYME                            
         DC    AL2(3470)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'19579'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133764500'                                                   
         DC    X'01'                                                            
         DC    CL33'MEDIA EDGE, INC.'           COMPANY NAME                    
         DC    CL33'825 EIGTH AVENUE'           COMPANY ADDRESS                 
         DC    CL33'NEW YORK, NY  10019'                                        
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'NW'               N.W.AYER - AYBM                            
         DC    AL2(3835)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'19579'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133804028'                                                   
         DC    X'01'                                                            
         DC    CL33'BLUE MARBLE ACG, LTD.'      COMPANY NAME                    
         DC    CL33'825 EIGTH AVENUE'           COMPANY ADDRESS                 
         DC    CL33'NEW YORK, NY  10019'                                        
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
* NV - DDS                                                                      
*                                                                               
         DC    CL2'NV'               NVNY                                       
         DC    AL2(2886)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133669079'                                                   
         DC    X'00'                                                            
         DC    CL33' '             COMPANY NAME                                 
         DC    CL99' '             3 X 33 ADDR LINES                            
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
* OA - OGILVY AND MATHER                                                        
*                                                                               
         DC    CL2'OA'               OGILVY MATHER - OAEY                       
         DC    AL2(2801)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'19939'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'132867398'                                                   
         DC    X'01'                                                            
         DC    CL33'EYEPATCH PRODUCTIONS, INC.'                                 
         DC    CL33'309 WEST 49TH STREET'                                       
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY100197399'                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'HELEN RIPKA'          AGENCY CONTACT NAME                   
         DC    CL15'2122375685'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'OA'               OGILVY MATHER - OANYS                      
         DC    AL2(3319)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'19939'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'132677706'                                                   
         DC    X'01'                                                            
         DC    CL33'GRAPHIC SERVICES, INC.'                                     
         DC    CL33'309 WEST 49TH STREET'                                       
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY100197399'                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'HELEN RIPKA'          AGENCY CONTACT NAME                   
         DC    CL15'2122377399'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'OA'               OGILVY MATHER - OACOTT                     
         DC    AL2(3778)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'19939'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'132555496'                                                   
         DC    X'01'                                                            
         DC    CL33'THE OGILVY GROUP, INC.'                                     
         DC    CL33'309 WEST 49TH STREET'                                       
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY100197399'                          
         DC    CL240' '           OFFICE LIST                                   
         DC    CL40'HELEN RIPKA'          AGENCY CONTACT NAME                   
         DC    CL15'2122375685'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'OA'               OGILVY MATHER - OALAS                      
         DC    AL2(4057)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'19939'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'953938806'                                                   
         DC    X'01'                                                            
         DC    CL33'SILVER BULLET INC.'                                         
         DC    CL33'3530 HAYDEN AVE.'      3X33 ADDRESS LINES                   
         DC    CL33' '                                                          
         DC    CL33'CULVER CITY           CA90232'                              
         DC    CL240' '                    OFFICE LIST                          
         DC    CL40'HELEN RIPKA'           AGENCY CONTACT NAME                  
         DC    CL15'2122375685'            AGENCY PHONE NUMBER                  
*                                                                               
         DC    CL2'OA'               CQNYP ADDED JAN/2001                       
         DC    AL2(6215)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'19939'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133916072'                                                   
         DC    X'01'                                                            
         DC    CL33'CONQUEST INC.'                                              
         DC    CL33'P.O. BOX 722'          3X33 ADDRESS LINES                   
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10101'                              
         DC    CL240' '                    OFFICE LIST                          
         DC    CL40'HELEN RIPKA'           AGENCY CONTACT NAME                  
         DC    CL15'2122375685'            AGENCY PHONE NUMBER                  
*                                                                               
* OH - DONINO WHITE & COMPANY                                                   
*                                                                               
         DC    CL2'OH'             DWPAT                                        
         DC    AL2(7554)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'943370942'                                                   
         DC    X'00'                                                            
         DC    CL33'DWP/BATES TECHNOLOGY'       COMPANY NAME                    
         DC    CL33'ONE RAVINIA DRIVE - 9TH FLOOR'                              
         DC    CL33' '                                                          
         DC    CL33'ATLANTA               GA30346'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'ELISA TAMMEUS'        AGENCY CONTACT NAME                   
         DC    CL15'7702256408'           AGENCY PHONE NUMBER                   
*                                                                               
* ON - BBDO                                                                     
*                                                                               
         DC    CL2'ON'             OMNICOM-ONNY                                 
         DC    AL2(1252)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'00000'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'133463642'                                                   
         DC    X'00'                                                            
         DC    CL33'OMNICOM MANAGEMENT, INC.'       COMPANY NAME                
         DC    CL33'437 MADISON AVENUE'                                         
         DC    CL33'NEW YORK, NY 10022'                                         
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'STEVEN AZZOPARDI'     AGENCY CONTACT NAME                   
         DC    CL15'2124153677'           AGENCY PHONE NUMBER                   
*                                                                               
* OO - OMD USA INC.                                                             
*                                                                               
         DC    CL2'OO'             OMNICOM-ONNY                                 
         DC    AL2(8685)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'19K20'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'134117630'                                                   
         DC    X'00'                                                            
         DC    CL33'OMD USA, INC.'                  COMPANY NAME                
         DC    CL33'437 MADISON AVE'                                            
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10022'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'ANDREW KEREKES'       AGENCY CONTACT NAME                   
         DC    CL15'2124153170'           AGENCY PHONE NUMBER                   
*                                                                               
* PN - PORTER NOVELLI INC.                                                      
*                                                                               
         DC    CL2'PN'               PORTER NOVELLI- NY (DOREMUS) PNNY          
         DC    AL2(1513)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'35D68'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133461427'                                                   
         DC    X'01'                                                            
         DC    CL33' '                                                          
         DC    CL33' '                       3 X 33 ADDR LINES                  
         DC    CL33' '                                                          
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
* QJ - INGALLS, QUINN AND JOHNSON                                               
*                                                                               
         DC    CL2'QJ'               QJBO-INGALLS, QUINN & JOHNSON              
         DC    AL2(0656)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'043041769'        EIN#/TIN#                                  
         DC    X'01'                                                            
         DC    CL33'INGALLS'                                                    
         DC    CL33'ONE DESIGN CENTER PLACE'                                    
         DC    CL33'BOSTON, MA 02110'                                           
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '                    AGENCY CONTACT NAME                   
         DC    CL15' '                    AGENCY PHONE NUMBER                   
*                                                                               
* QU - SQUARE ONE, INC.                                                         
*                                                                               
         DC    CL2'QU'                                                          
         DC    AL2(10183)            ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'752596559'        EIN#/TIN#                                  
         DC    X'00'                                                            
         DC    CL33'SQUARE ONE, INC.'                                           
         DC    CL33'2121 SAN JACINTO, STE 3200'                                 
         DC    CL33' '                                                          
         DC    CL33'DALLAS                TX75013'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'CARL SAXON'           AGENCY CONTACT NAME                   
         DC    CL15'2147491111'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    CL2'QU'               QJBO-INGALLS, QUINN & JOHNSON              
         DC    AL2(8861)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'752596559'        EIN#/TIN#                                  
         DC    X'00'                                                            
         DC    CL33'SQUARE ONE, INC.'                                           
         DC    CL33'2121 SAN JACINTO, STE 3200'                                 
         DC    CL33' '                                                          
         DC    CL33'DALLAS                TX75013'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'CARL SAXON'           AGENCY CONTACT NAME                   
         DC    CL15'2147491111'           AGENCY PHONE NUMBER                   
*                                                                               
* RB - RJ PALMER MEDIA, INC.                                                    
*                                                                               
         DC    CL2'RB'               RJNY                                       
         DC    AL2(3479)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133071688'                                                   
         DC    X'00'                                                            
         DC    CL33'R.J. PALMER, INC.'  COMPANY NAME                            
         DC    CL33'156 WEST 56TH STREET'     3 X 33 ADDR LINES                 
         DC    CL33'NEW YORK, NY 10019'                                         
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'RB'               RJNY                                       
         DC    AL2(9174)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'522279751'                                                   
         DC    X'00'                                                            
         DC    CL33'R J PALMER LLC.'    COMPANY NAME                            
         DC    CL33'156 WEST 56TH STREET'     3 X 33 ADDR LINES                 
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10019'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'OLGA MENDEZ'   AGENCY CONTACT NAME                          
         DC    CL15'2129570057'    AGENCY PHONE NUMBER                          
*                                                                               
* RP - RUBIN POSTAER AND ASSOCIATES                                             
*                                                                               
         DC    CL2'RP'                                                          
         DC    AL2(1207)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'954062405'                                                   
         DC    X'00'                                                            
         DC    CL33'RUBIN POSTAER'   COMPANY NAME                               
         DC    CL33'1333 2ND STREET'   3 X 33 ADDR LINES                        
         DC    CL33' '                                                          
         DC    CL33'SANTA MONICA          CA90401'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'ELIZABETH MARSHALL'    AGENCY CONTACT NAME                  
         DC    CL15'3109172320'    AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'RP'                                                          
         DC    AL2(6141)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'954062405'                                                   
         DC    X'00'                                                            
         DC    CL33'SECOND STREET PRODUCTIONS'   COMPANY NAME                   
         DC    CL33'1333 2ND STREET'   3 X 33 ADDR LINES                        
         DC    CL33' '                                                          
         DC    CL33'SANTA MONICA          CA90401'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'ELIZABETH MARSHALL'    AGENCY CONTACT NAME                  
         DC    CL15'3109172320'    AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'RP'                                                          
         DC    AL2(8736)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'954062405'                                                   
         DC    X'00'                                                            
         DC    CL33'RP INTERACTIVE'     COMPANY NAME                            
         DC    CL33'1333 2ND STREET'    3 X 33 ADDR LINES                       
         DC    CL33' '                                                          
         DC    CL33'SANTA MONICA          CA90401'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'ELIZABETH MARSHALL'    AGENCY CONTACT NAME                  
         DC    CL15'3109172320'    AGENCY PHONE NUMBER                          
*                                                                               
* RU - RUHR/PARAGON INC                                                         
*                                                                               
         DC    CL2'RU'               RUMN                                       
         DC    AL2(2926)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'32P33'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'311441282'                                                   
         DC    X'01'                                                            
         DC    CL33' '             COMPANY NAME                                 
         DC    CL99' '             3 X 33 ADDR LINES                            
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
* SG - LOWE AND PARTNERS/SMS                                                    
*                                                                               
         DC    CL2'SG'               MARIA                                      
         DC    AL2(2858)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'540789050'                                                   
         DC    X'00'                                                            
         DC    CL33'THE MARTIN AGENCY'    COMPANY NAME                          
         DC    CL33'500 NORTH ALLEN AVE'     3 X 33 ADDR LINES                  
         DC    CL33'RICHMOND, VA. 23220'                                        
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
* SJ - "SJR" TEST COMPANY                                                       
*                                                                               
         DC    CL2'SJ'                                                          
         DC    AL2(0017)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'12345'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'123456789'                                                   
         DC    X'01'                                                            
         DC    CL33' '                    COMPANY NAME                          
         DC    CL33' '                       3 X 33 ADDR LINES                  
         DC    CL33' '                                                          
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'DDS USER'      AGENCY CONTACT NAME                          
         DC    CL15'5555555555555' AGENCY PHONE NUMBER                          
*                                                                               
* SP - SAATCHI AND SAATCHI ADVERTISING                                          
*                                                                               
         DC    CL2'SP'               SAATCHI && SAATCHI PROMOTIONS              
         DC    AL2(1730)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133451963'                                                   
         DC    X'00'                                                            
         DC    CL33' '             COMPANY NAME                                 
         DC    CL99' '             3 X 33 ADDR LINES                            
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
* ST - SGTSEC                                                                   
*                                                                               
         DC    CL2'ST'               SGTO - SAFFER                              
         DC    AL2(3223)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'980123040'        EIN                                        
         DC    X'00'                                                            
         DC    CL33'SAFFER GROUP, INC.'        COMPANY NAME                     
         DC    CL33'156 DUNCAN MILLS RD. UNIT 1'                                
         DC    CL33'DON MILLS, ONTARIO  M3B 3N2'                                
         DC    CL33' '                                                          
         DC    CL240' '                                                         
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
* SU - SUSEC - DAVID CRAVIT AND ASSOCIATES, LTD                                 
*                                                                               
         DC    CL2'SU'               SAFFER - SUCH                              
         DC    AL2(2842)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'363863346'                                                   
         DC    X'00'                                                            
         DC    CL33'DAVID CRAVIT AND ASSOCIATES, LTD'                           
         DC    CL33'737 NORTH MICHIGAN AVE.  16TH FL'                           
         DC    CL33'CHICAGO, IL  60611'                                         
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '             AGENCY CONTACT NAME                          
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
* TH - ZENITH MEDIA SERVICES                                                    
*                                                                               
         DC    CL2'TH'               ZENY                                       
         DC    AL2(3816)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'133736241'        EIN#/TIN#                                  
         DC    X'00'                                                            
         DC    CL33'ZENITH MEDIA SERVICES INC.'       COMPANY NAME              
         DC    CL33'299 WEST HOUSTON STREET 10TH FL.' 3 X 33 ADDR LINES         
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10014'                              
         DC    CL240' '              OFFICE LIST (SPACES - NO LIST)             
         DC    CL40'VINCENT TOCCI'   AGENCY CONTACT NAME                        
         DC    CL15'2128595378'      AGENCY PHONE NUMBER                        
*                                                                               
         DC    CL2'TH'                                                          
         DC    AL2(9640)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'134179202'        EIN#/TIN#                                  
         DC    X'00'                                                            
         DC    CL33'ZENITH DIRECT'                    COMPANY NAME              
         DC    CL33'299 WEST HOUSTON STREET 10TH FL.' 3 X 33 ADDR LINES         
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10014'                              
         DC    CL240' '              OFFICE LIST (SPACES - NO LIST)             
         DC    CL40'VINCENT TOCCI'   AGENCY CONTACT NAME                        
         DC    CL15'2128595378'      AGENCY PHONE NUMBER                        
*                                                                               
* TR - OMNICOM MANAGEMENT SERVICES                                              
*                                                                               
         DC    CL2'TR'               TLDA ADDED JAN/2001                        
         DC    AL2(0031)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'54430'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'751372103'        EIN#/TIN#                                  
         DC    X'01'                                                            
         DC    CL33'DDB DALLAS, INC.'                 COMPANY NAME              
         DC    CL33'1999 BRYAN STREET, SUITE 3200'    3 X 33 ADDR LINES         
         DC    CL33'DALLAS, TX 75201'                                           
         DC    CL33' '                                                          
         DC    CL240' '              OFFICE LIST (SPACES - NO LIST)             
         DC    CL40'TAMMY PIGOTT'    AGENCY CONTACT NAME                        
         DC    CL15'2142592542'      AGENCY PHONE NUMBER                        
*                                                                               
         DC    CL2'TR'               TLSF ADDED JAN/2001                        
         DC    AL2(0239)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'752625370'        EIN#/TIN#                                  
         DC    X'00'                                                            
         DC    CL33'THE FOCUS AGENCY'                 COMPANY NAME              
         DC    CL33'1999 BRYAN STREET, SUITE 3200'    3 X 33 ADDR LINES         
         DC    CL33'DALLAS, TX 75201'                                           
         DC    CL33' '                                                          
         DC    CL240' '              OFFICE LIST (SPACES - NO LIST)             
         DC    CL40'TAMMY PIGOTT'    AGENCY CONTACT NAME                        
         DC    CL15'2142592542'      AGENCY PHONE NUMBER                        
*                                                                               
         DC    CL2'TR'               TLDP ADDED JAN/2001                        
         DC    AL2(3258)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'54430'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'752498121'        EIN#/TIN#                                  
         DC    X'01'                                                            
         DC    CL33'PGC ADVERTISING, INC.'            COMPANY NAME              
         DC    CL33'1999 BRYAN STREET, SUITE 3200'    3 X 33 ADDR LINES         
         DC    CL33'DALLAS, TX 75201'                                           
         DC    CL33' '                                                          
         DC    CL240' '              OFFICE LIST (SPACES - NO LIST)             
         DC    CL40'TAMMY PIGOTT'    AGENCY CONTACT NAME                        
         DC    CL15'2142592542'      AGENCY PHONE NUMBER                        
*                                                                               
         DC    CL2'TR'               TLPP ADDED JAN/2001                        
         DC    AL2(5879)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'54430'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'752958035'        EIN#/TIN#                                  
         DC    X'01'                                                            
         DC    CL33'TLP L.P.'                         COMPANY NAME              
         DC    CL33'1999 BRYAN STREET, SUITE 3200'    3 X 33 ADDR LINES         
         DC    CL33'DALLAS, TX 75201'                                           
         DC    CL33' '                                                          
         DC    CL240' '              OFFICE LIST (SPACES - NO LIST)             
         DC    CL40'TAMMY PIGOTT'    AGENCY CONTACT NAME                        
         DC    CL15'2142592542'      AGENCY PHONE NUMBER                        
*                                                                               
         DC    CL2'TR'               TLDSP ADDED JAN/2001                       
         DC    AL2(7139)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'752267897'        EIN#/TIN#                                  
         DC    X'00'                                                            
         DC    CL33'TRACEY-LOCKE, INC DBA GROUP MANAG' COMPANY NAME             
         DC    CL33'1999 BRYAN STREET, SUITE 3200'    3 X 33 ADDR LINES         
         DC    CL33'DALLAS, TX 75201'                                           
         DC    CL33' '                                                          
         DC    CL240' '              OFFICE LIST (SPACES - NO LIST)             
         DC    CL40'TAMMY PIGOTT'    AGENCY CONTACT NAME                        
         DC    CL15'2142592542'      AGENCY PHONE NUMBER                        
*                                                                               
* UB - CARAT                                                                    
*                                                                               
         DC    CL2'UB'               CARAT ADDED JAN/00                         
         DC    AL2(7307)             ORIGIN (DEFAULT IS PRINC ID)               
         DC    CL5'00000'            TRANSMITTER#(00000 USE DDS#)-TCC           
         DC    CL9'953408346'        EIN#/TIN#                                  
         DC    X'00'                                                            
         DC    CL33'CARAT USA, INC'             COMPANY NAME                    
         DC    CL33'3 PARK AVENUE'              3 X 33 ADDR LINES               
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10016'                              
         DC    CL240' '              OFFICE LIST (SPACES - NO LIST)             
         DC    CL40'LEON MEIZLIK'             AGENCY CONTACT NAME               
         DC    CL15'9173267131'               AGENCY PHONE NUMBER               
*                                                                               
* WD - WIEDEN && KENNEDY                                                        
*                                                                               
         DC    CL2'WD'             WWSFS - WUNDERMAN WORLDWIDE INC.             
         DC    AL2(2696)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'29A70'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'930832855'      EIN#/TIN#                                    
         DC    X'00'                                                            
         DC    CL33'WIEDEN && KENNEDY'                                          
         DC    CL33'224 NW 13TH AVENUE'                                         
         DC    CL33' '                                                          
         DC    CL33'PORTLAND              OR97209'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'JANET BLALOCK'        AGENCY CONTACT NAME                   
         DC    CL15'5039377840'    AGENCY PHONE NUMBER                          
*                                                                               
         DC    CL2'WD'             WWSFS - WUNDERMAN WORLDWIDE INC.             
         DC    AL2(2706)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'29A70'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'930832855'      EIN#/TIN#                                    
         DC    X'01'                                                            
         DC    CL33'WIEDEN && KENNEDY'                                          
         DC    CL33'224 NW 13TH AVENUE'                                         
         DC    CL33' '                                                          
         DC    CL33'PORTLAND              OR97209'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'JANET BLALOCK'        AGENCY CONTACT NAME                   
         DC    CL15'5039377840'    AGENCY PHONE NUMBER                          
*                                                                               
* WW - WUNDERMAN WORLDWIDE INC.                                                 
*                                                                               
         DC    CL2'WW'             WWSFS - WUNDERMAN WORLDWIDE INC.             
         DC    AL2(3364)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'19728'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'131493710'      EIN#/TIN#                                    
         DC    X'01'                                                            
         DC    CL33'Y && R, INC.  DBA  WUNDERMAN'                               
         DC    CL33'675 AVENUE OF AMERICAS'                                     
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10010'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'STEVEN MANDELL'       AGENCY CONTACT NAME                   
         DC    CL15'2122103060'    AGENCY PHONE NUMBER                          
*                                                                               
* YE - CHAPMAN DIRECT ADVERTISING                                               
*                                                                               
*        DC    CL2'YE'             YCHNY - CHAPMAN DIRECT ADVERTISING           
*        DC    AL2(3698)           ORIGIN (DEFAULT IS PRINC ID)                 
*        DC    CL5'19728'          TRANSMITTER#(00000 USE DDS#)-TCC             
*        DC    CL9'131493710'      EIN#/TIN#                                    
*        DC    X'01'                                                            
*        DC    CL33'Y && R, INC.  DBA CHAPMAN'                                  
*        DC    CL33'230 PARK AVENUE SOUTH - 6TH FLOOR'                          
*        DC    CL33'NEW YORK, NY  10003'                                        
*        DC    CL33' '                                                          
*        DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
*        DC    CL40'STEVEN MANDELL'       AGENCY CONTACT NAME                   
*        DC    CL15'2126144576'    AGENCY PHONE NUMBER                          
*                                                                               
* YF - BURSON MARSTELLER                                                        
*                                                                               
         DC    CL2'YF'             YBMSFS - BURSON                              
         DC    AL2(3354)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'19728'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'131493710'      EIN#/TIN#                                    
         DC    X'01'                                                            
         DC    CL33'Y && R, INC. DBA BURSON MARSTELLER'                         
         DC    CL33'230 PARK AVENUE SOUTH'                                      
         DC    CL33'NEW YORK, NY  10003'                                        
         DC    CL33' '                                                          
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40' '                    AGENCY CONTACT NAME                   
         DC    CL15' '             AGENCY PHONE NUMBER                          
*                                                                               
* YN - BM/YR/SFS                                                                
*                                                                               
         DC    CL2'YN'             YNRO - YOUNG & RUBICAM INC.INC.              
         DC    AL2(2463)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'19728'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'131493710'      EIN#/TIN#                                    
         DC    X'01'                                                            
         DC    CL33'YOUNG && RUBICAM, INC.' COMPANY NAME                        
         DC    CL33'285 MADISON AVENUE'     3X33 ADDRESS LINES                  
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10017'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'STEVEN MANDELL'       AGENCY CONTACT NAME                   
         DC    CL15'2122103060'    AGENCY PHONE NUMBER                          
*                                                                               
* YP - SUDLER AND HENNESEY/SFS                                                  
*                                                                               
         DC    CL2'YP'             YSHNY - SUDLER AND HENNESEY/SFS              
         DC    AL2(3655)           ORIGIN (DEFAULT IS PRINC ID)                 
         DC    CL5'19728'          TRANSMITTER#(00000 USE DDS#)-TCC             
         DC    CL9'131493710'      EIN#/TIN#                                    
         DC    X'01'                                                            
         DC    CL33'Y && R, INC. DBA SUDLER && HENESSY'                         
         DC    CL33'230 PARK AVENUE SOUTH' 3X33 ADDRESS LINES                   
         DC    CL33' '                                                          
         DC    CL33'NEW YORK              NY10003'                              
         DC    CL240' '            OFFICE LIST (SPACES - NO LIST)               
         DC    CL40'STEVEN MANDELL'       AGENCY CONTACT NAME                   
         DC    CL15'2122103060'           AGENCY PHONE NUMBER                   
*                                                                               
         DC    C'**'                                                            
