*          DATA SET ACRECFCD   AT LEVEL 001 AS OF 09/07/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T608FCD      DATE 09/07/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
RPTTOTH  DS    CL8                                                              
RPTTOT   DS    CL78    22    2   78  A  P N             T        Y              
RPTTAMH  DS    CL8                                                              
RPTTAM   DS    CL78    23    2   78  A  P H             T        Y  254         
RPTTAMX  DS    CL8                                                              
RPTPFKH  DS    CL8                                                              
RPTPFK   DS    CL78    24    2   78  A  P N             T        Y  255         
RPTPFKX  DS    CL8                                                              
         DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 280  BYTES                            
