*          DATA SET ACREPRLWRK AT LEVEL 116 AS OF 01/26/21                      
         TITLE 'WORK STORAGE AND EQUATES'                                       
***********************************************************************         
*  EQUATES                                                            *         
***********************************************************************         
         SPACE 1                                                                
PRODUCTION EQU C'V'                                                             
PAYABLES   EQU C'P'                                                             
RECEIVABLE EQU C'R'                                                             
INCOME     EQU C'I'                                                             
EXPENSE    EQU C'X'                                                             
MANPOWER   EQU C'1'                                                             
PNL        EQU C'2'                                                             
CASH       EQU C'B'                                                             
GENERAL    EQU C'G'                                                             
MEDIA      EQU C'Z'                                                             
*                                                                               
LANDSCPE EQU   C'L'                                                             
PORTRAIT EQU   C'P'                                                             
*                                                                               
K        EQU   1024                1K                                           
IOSIZEQ  EQU   2*K                                                              
GESIZEQ  EQU   2*K                                                              
ROWS     EQU   X'02'                                                            
COLS     EQU   X'01'                                                            
ESC#LFJT EQU   X'22'                                                            
ESC#HIGH EQU   X'30'                                                            
BE       EQU   X'80'               BRANCH EQUAL                                 
BNE      EQU   X'70'                                                            
BZ       EQU   BE                                                               
BNZ      EQU   BNE                                                              
BNP      EQU   X'D0'                                                            
BNM      EQU   X'B0'                                                            
BLE      EQU   X'D0'               ACTUALY BNH                                  
BHE      EQU   X'B0'               ACTUALY BNL                                  
BH       EQU   X'20'                                                            
BL       EQU   X'40'                                                            
BO       EQU   X'10'                                                            
DASH     EQU   X'BF'                                                            
BLANK    EQU   C' '                                                             
GO       EQU   C'Y'                                                             
STOP     EQU   C'N'                                                             
YES      EQU   C'Y'                                                             
NO       EQU   C'N'                                                             
ONLY     EQU   C'O'                                                             
EOT      EQU   X'FF'               END OF TABLE                                 
EOR      EQU   0                   END OF RECORD                                
TURNOFF  EQU   X'FF'                                                            
HOLD     EQU   C'H'                HOLDING STATUS IS UNDETERMINED               
REMOVE   EQU   C'R'                FOR CR/DR PAIRING                            
PROCESD  EQU   C'X'                "PROCESSED"                                  
*                                                                               
TAPEDL   EQU   C'T'                DOWN-LOAD TAPE                               
AIUDL    EQU   C'A'                DOWN-LOAD AIU                                
YMDDL    EQU   C'D'                DOWN-LOAD YYMMDD                             
FTPDL    EQU   C'F'                DOWN-LOAD EDICT (FTP)                        
DSNDL    EQU   C'N'                DOWN-LOAD EDICT (DSN)                        
BDEDL    EQU   C'B'                DOWN-LOAD (BDE)                              
EDIDL    EQU   C'E'                DOWN-LOAD (EDIHUB)                           
USSDL    EQU   C'U'                DOWN-LOAD (USS)                              
SRPDL    EQU   C'S'                DOWN-LOAD (SUPPRESS REQUEST PAGE)            
*                                                                               
PKLEN    EQU   8                                                                
*                                                                               
TYFIRST  EQU   TY30DI                                                           
TY30DI   EQU   229                 TYPE 30 Difference (foreign curr)            
TY06MN   EQU   230                 TYPE 06 Manual billing                       
TY30CH   EQU   231                 TYPE 30 Check                                
TY30OF   EQU   232                 TYPE 30 Offset                               
TY30WO   EQU   233                 TYPE 30 Write-off                            
TY30TT   EQU   234                 TYPE 30 Transfer to                          
TY30TF   EQU   235                 TYPE 30 Transfer from                        
TY30IA   EQU   236                 TYPE 30 Inter-agency (Special)               
TYLAST   EQU   TY30IA                                                           
*                                                                               
PARNTRY  EQU   X'FE'               PARSE ENTRY TO EXECUTE FIRST                 
ADDPACK  EQU   C'T'                NEED TO ADD TO NEXT ENTRY                    
*                                                                               
MAXFMTS  EQU   6                   MAX NUMBER OF FORMATS                        
MAXCOLS  EQU   160                 MAX NUMBER OF COLUMNS                        
*&&UK                                                                           
MAXROWS  EQU   67                  MAX NUMBER OF ROWS 12 + 75 = 87              
*&&                                  Make 67 should be enough                   
*&&US                                                                           
MAXROWS  EQU   40                  MAX NUMBER OF ROWS 12 + 48 = 60              
*&&                                  Make 40 should be enough                   
MAXHEADS EQU   30                  Max number of headings (HEADD)               
MAXHEADQ EQU   24                  Max length of heading                        
MAXCOUNT EQU   50                                                               
MAXEQLN  EQU   16                  Max length of the equation                   
MAXSRTQ  EQU   2000                SORT BUFFER AREA SIZE                        
MAXSRBQ  EQU   410000              BUFFER FOR HELD UP SORT RECORDS              
MAXTRECQ EQU   10000               MAX buffer for combine total hrs rec         
MAXHDLN  EQU   25                  MAX NUMBER OF HEAD LINES                     
MAXXPLN  EQU   48                  MAX NUMBER OF XP   LINES                     
MAXFTLN  EQU   25                  MAX NUMBER OF FOOT LINES                     
MAXPHISQ EQU   2000                MAX number of entries                        
MAXCALS  EQU   200                 Max number of calendars                      
TIMSAVQ  EQU   50                  MAX DATES OF TIME SAVED RECORDS              
NHD      EQU   3                   NUMBER OF HEADING COLUMNS                    
BRNDNMQ  EQU   39                                                               
OFMAXQ   EQU   255                 MAX OFFICE ENTRIES FROM 2D LEDGER            
STMAXQ   EQU   50                  MAX STUDIO RECORDS                           
TBUFLNQ  EQU   1500                                                             
LSTBLKQ  EQU   18000               SAVED OFF LIST RECORDS AREA                  
SJMAXQ   EQU   20500               MAX ENTRIES OF SJ TABLE INFORMATION          
RATEQ    EQU   (RATELNQ+RATEBUKQ)*3500                                          
NONCLIQ  EQU   (250*22)                                                         
*&&US                                                                           
MAXPO#   EQU   1500                Max number of PO by job in table             
*&&                                                                             
*&&UK                                                                           
MAXPO#   EQU   2000                Max number of PO by job in table             
*&&                                                                             
MAXBRANQ EQU   11000                                                            
MAXNAMES EQU   5000                MAX ENTRIES OF NAMES TO SAVE AROUND          
MAXAEQS  EQU   5000                MAX ENTRIES OF EQU. NAMES TO SAVE            
MAXETY   EQU   500                 MAX ENTRIES OF ETYPE NAMES TO SAVE           
MAXDELEL EQU   400                                                              
BUFFQ    EQU   200000              BUFFALO IN-CORE AREA SIZE                    
TBUFLEN  EQU   7500000             SIZE HI-CORE BUFFER FOR TSAR                 
TBUFLEN2 EQU   10000000            SIZE HI-CORE BUFFER FOR TSAR Larger          
STCKLEN  EQU   300000              SIZE HI-CORE BUFFER FOR TSAR                 
POOLSZ   EQU   800000              FREE FORM DATA POOL                          
STDPGWD  EQU   L'XHEAD1            STANDARD PAGE WIDTH                          
ERRORLNQ EQU   2                   LENGTH OF ERROR MESSAGE number               
NMEVLNQ  EQU   16                  Length of name heading for column            
MAXCLPOS EQU   400                 MAX SIZE OF CLIENT PO TABLE                  
MAXXD    EQU   10                  MAX NUMBER OF XDATA HELD ON TRNX             
MAXXN    EQU   310                 XDATA NAME TABLE SIZE=30*MAXXD+MAXXD         
MAXXV    EQU   810                 XDATA VAL TABLE SIZE=80*MAXXD+MAXXD          
MAXXNL   EQU   MAXXN/MAXXD                                                      
MAXXVL   EQU   MAXXV/MAXXD                                                      
*                                                                               
MAXDCOL  EQU   20                                                               
MAXDNE   EQU   XDATQL1*MAXDCOL+1   SIZE OF EST XDATA NAME TABLE                 
MAXDVE   EQU   XDATQL2*MAXDCOL+1   SIZE OF EST XDATA VALUE TABLE                
MXESGLB  EQU   MAXESTJ*6+1         SIZE OF ESTIMATE GLOBAL # TABLE              
*                                                                               
MAXEST   EQU   5000                Max number of entries in ESTWCTB             
MAXESTJ  EQU   255                 Max number of estimates per job              
*&&US                                                                           
MAXGBMOS EQU   2000                Max number of GB MOS entries                 
GBMOSLNQ EQU   (L'TRNKCULA-1+L'TRNKOFF+L'TRNKULC+L'PBKHI)                       
MXGBMOST EQU   MAXGBMOS*GBMOSLNQ   SIZE OF GB MOS TABLE                         
*&&                                                                             
*                                                                               
MAXMESTQ EQU   MAXESTJ*ESTMLNQ                                                  
MAXWESTQ EQU   MAXEST*ESTWLNQ                                                   
*                                                                               
SJBUFMAX EQU   SJINFQ+100                                                       
*                                                                               
WCMAX    EQU   255                 Max number of estimate workcodes             
*                                                                               
CEAMTS   EQU   (L'ERDIAPR+L'ERDIMUL+L'WCINAMT+L'WCICAMT+L'WCIGAMT)              
CEDATA   EQU   (L'ERDWCOD+L'ERDICOD+L'ERDIDES+L'ERDWCRA)                        
CEITQ    EQU   (CEDATA+CEAMTS+3)*WCMAX                                          
*                                                                               
PGWDRL10 EQU   110                 WIDTH OF PAGE FOR 11x8.5 AT PITCH 10         
PGWDRL12 EQU   132                 WIDTH OF PAGE FOR 11x8.5 AT PITCH 12         
PGWDRL15 EQU   165                 WIDTH OF PAGE FOR 11x8.5 AT PITCH 15         
PGWDRL18 EQU   198                 WIDTH OF PAGE FOR 11x8.5 AT PITCH 18         
PGWDRL20 EQU   198      (Limit)    WIDTH OF PAGE FOR 11x8.5 AT PITCH 20         
*GWDRL20 EQU   220      (Acutal)   WIDTH OF PAGE FOR 11x8.5 AT PITCH 20         
PGWDRL24 EQU   198      (Limit)    WIDTH OF PAGE FOR 11x8.5 AT PITCH 24         
*GWDRL24 EQU   264      (Acutal)   WIDTH OF PAGE FOR 11x8.5 AT PITCH 24         
*                                                                               
PGWDRP10 EQU   85                  WIDTH OF PAGE FOR 8.5x11 AT PITCH 10         
PGWDRP12 EQU   102                 WIDTH OF PAGE FOR 8.5x11 AT PITCH 12         
PGWDRP15 EQU   127                 WIDTH OF PAGE FOR 8.5x11 AT PITCH 15         
PGWDRP18 EQU   153                 WIDTH OF PAGE FOR 8.5x11 AT PITCH 18         
PGWDRP20 EQU   170                 WIDTH OF PAGE FOR 8.5x11 AT PITCH 20         
PGWDRP24 EQU   198      (Limit)    WIDTH OF PAGE FOR 8.5x11 AT PITCH 24         
*GWDRP24 EQU   204      (Acutal)   WIDTH OF PAGE FOR 8.5x11 AT PITCH 24         
INITLN   EQU   X'99'               MAX LINE, FORCE TO HEAD UP                   
DENTMID  EQU   1                   INDENT MIDLINES                              
*HORTPG  EQU   60                  LASER PAPER  11 x 8.5                        
*ONGPG   EQU   66                  PC    PAPER  8.5 x 11                        
*&&US                                                                           
LPI08LS  EQU   60                  LANDSCAPE LPI OF  8   (7.5) - 1PP            
LPI08PT  EQU   80                  PORTRIAT  LPI OF  8  (10.0) - 1PC            
LPI12LS  EQU   90                  LANDSCAPE LPI OF 12   (7.5) - 1PP            
LPI12PT  EQU   120                 PORTRAIT  LPI OF 12  (10.0) - 1PC            
*&&                                                                             
*&&UK                                                                           
LPI08LS  EQU   59                  LANDSCAPE LPI OF  8   (7.5) - 1PP            
LPI08PT  EQU   79                  PORTRIAT  LPI OF  8  (10.0) - 1PC            
LPI12LS  EQU   89                  LANDSCAPE LPI OF 12   (7.5) - 1PP            
LPI12PT  EQU   119                 PORTRAIT  LPI OF 12  (10.0) - 1PC            
*&&                                                                             
DATESZQ  EQU   8                   MIN US COLUMN SIZE FOR MMMDD/YY              
*                                                                               
MFLOAT   EQU   X'02'               Floating minus sign                          
PENNY    EQU   3                   Number of decimals associated +1             
DOLLAR   EQU   1                   Number of decimals assoicated +1             
THOUSAND EQU   X'FD'               Negative 3, rounding factor                  
MILLION  EQU   X'FA'               Negative 6, rounding factor                  
TWODEC   EQU   2                   Two  decimal place                           
ONEDEC   EQU   1                   One  decimal place                           
ZERODEC  EQU   0                   Zero decimal place                           
UNSIGNED EQU   0                                                                
SIGNED   EQU   1                                                                
         SPACE 2                                                                
CKNOQ    EQU   0                   Index to CHECK NUMBER                        
CKDTEQ   EQU   1                   Index to CHECK DATE                          
DPDTEQ   EQU   2                   Index to DEPOSIT DATE                        
WODTEQ   EQU   3                   Index to WRITE-OFF DATE                      
WOACCQ   EQU   4                   Index to WRITE-OFF ACCOUNT                   
WONUMQ   EQU   5                   Index to WRITE-OFF NUMBER                    
OFDTEQ   EQU   6                   Index to OFFSET DATE                         
TRTODTEQ EQU   7                   Index to TRANSFER TO DATE                    
TRFRDTEQ EQU   8                   Index to TRANSFER FROM DATE                  
TRTOACCQ EQU   9                   Index to TRANSFERED TO ACCOUNT               
TRFRACCQ EQU   10                  Index to TRANSFERED FROM ACCOUNT             
CKVOIDQ  EQU   11                  Index to CHECK VOID DATE                     
         SPACE 1                                                                
DATCON00 EQU   X'20'               DATCON YYMMDD       YYMMDD                   
DATCON05 EQU   5                   DATCON MMMDD/YY     (D)D MMM YY              
DATCON08 EQU   8                   DATCON MMMDD/YY     (D)DMMMYY                
DATCON09 EQU   9                   DATCON MMM/YY       MMMYY                    
DATCON10 EQU   10                  DATCON MM/DD/YY     DD/MM/YY                 
DATCON11 EQU   11                  DATCON MMMDD/YY     MMMDD/YY                 
DATCON13 EQU   13                  DATCON MMMDD/YY     DD.MM.YY                 
DATCON17 EQU   17                  DATCON MMMDD/YY     DD MMM YY                
DATCON18 EQU   18                  DATCON MMMDD/YY     DDMMMYY                  
DATCON20 EQU   20                  DATCON YYYYMMDD     YYYYMMDD                 
DATCON21 EQU   21                  DATCON MMMDD/YYYY   DDMMMYYYY                
DATCON22 EQU   22                  DATCON MMM/YYYY     MMMYYYY                  
DATCON23 EQU   23                  DATCON YYYY-MM-DD                            
         SPACE 1                                                                
*                                                                               
*        LENGTH EQUATES                                                         
*                                                                               
LULQ     EQU   2                   L' unit/ledger                               
LACQ     EQU   12                  L' account                                   
LULAQ    EQU   14                  L' unit/ledger + account                     
LCULAQ   EQU   15                  L' company + unit/ledger + account           
LLISTQ   EQU   5                   L' +/- LIST with out the +/-                 
         EJECT ,                                                                
***********************************************************************         
* Record map code equates                                                       
***********************************************************************         
REC_DATA EQU   X'0008'                                                          
REC_ERR# EQU   X'00FF'                                                          
REC_NODE EQU   X'FE01'                                                          
REC_ATTR EQU   X'FE02'                                                          
REC_TERM EQU   X'FE03'                                                          
REC_DOCI EQU   X'FE11'             Doc        Information                       
REC_RDEF EQU   X'FE12'             Report     definition                        
REC_CSTM EQU   X'FE13'             Custom     definition                        
REC_ELMD EQU   X'FE31'             Element    definitions                       
REC_LIST EQU   X'FE33'             List data  definitions                       
REC_DDFN EQU   X'FE34'             Data       definitions                       
REC_REQD EQU   X'FE36'             Request    definitions                       
REC_COND EQU   X'FE38'             Conditials definitions                       
REC_RDFN EQU   X'FE61'             Report     definition end                    
                                                                                
EL_1ST   EQU   120                                                              
EL_OFSEC EQU   1                                                                
                                                                                
NDE_LBL  EQU   1                   Node map code, lable                         
NDE_ID   EQU   2                   Node map code, id                            
NDE_REQ  EQU   3                   Node map code, request                       
NDE_TOP  EQU   4                   Node map code, Top level                     
NDE_CM1  EQU   5                   Node map code, compression 1                 
                                                                                
ATR_LBL  EQU   1                   Attribute unique label                       
ATR_ID   EQU   2                   Attribute Id                                 
ATR_TYPE EQU   3                   Attribute type of data Id                    
ATR_NODE EQU   4                   Attribute node id                            
ATR_PRNT EQU   5                   Attribute parent id                          
ATR_ATRB EQU   6                   Attribute of                                 
ATR_DFLT EQU   7                   Attrubute default                            
ATR_TLVL EQU   8                   Attribute total level                        
ATR_DIDX EQU   9                   Attribute DDLINK indexing                    
ATR_CMP1 EQU   10                  Attribute not used any more                  
ATR_GID# EQU   11                  Attribute global identifier number           
ATR_WDTH EQU   12                  Attribute width of data                      
ATR_TBLZ EQU   13                  Attribute data indexing Id                   
ATR_INDX EQU   14                  Attribute data indexing Id                   
                                                                                
ELM_ID   EQU   1                   Element node Id    Id of data                
ELM_TYPE EQU   2                   Element type       Data type                 
ELM_POS  EQU   3                   Element position   Row or Col post           
ELM_ALGN EQU   4                   Element alignment  Right/Center/Left         
ELM_DATA EQU   5                   Element data                                 
ELM_HD1  EQU   5                   Element heading 1                            
ELM_HD2  EQU   6                   Element heading 2                            
ELM_HD3  EQU   7                   Element heading 3                            
ELM_DCML EQU   8                   Element decimals   # of                      
ELM_DESC EQU   9                   Element description over-ride                
ELM_SBTY EQU   10                  Element sub type                             
ELM_ATRB EQU   11                  Element atribute Id                          
ELM_PPTY EQU   12                  Element properties                           
ELM_CLVL EQU   15                  Element column level for expand              
ELM_NLST EQU   16                  Element node list - Subtype AC1              
ELM_GRPI EQU   17                  Element Group Info, Group#,Level             
*                                  Associated with ELM_SBTY                     
SBTAMNT  EQU   C'A'                Amount                                       
*              C'A%'                 Percentage                                 
*              C'AC1'                Constant type 1 (Node list)                
*              C'AC2'                Constant type 2 (Rate)                     
SBTCODE  EQU   C'C'                Code                                         
SBTDATE  EQU   C'D'                Date                                         
SBTNAME  EQU   C'N'                Name                                         
SBTCALC  EQU   C'='                Calculation                                  
*                                  Associated with ELM_PPTY                     
PPTHIDE  EQU   X'80'               Hide node / attribute                        
PPTREVSG EQU   X'20'               Reverse column (amount)                      
PPTNOTOT EQU   X'04'               No totaling on node / attribute              
PPTSORTD EQU   X'02'               Sort Descending                              
PPTSORTA EQU   X'01'               Sort Ascending                               
                                                                                
OPT1DOWN EQU   C'Y'                Option 1 Download report                     
OPT3SCMA EQU   C'S'                Option 3 Schema only                         
                                                                                
REQ_ID   EQU   1                   Request record id number                     
REQ_DATE EQU   2                   Run date                                     
*EQ_MAP# EQU   5                   Request element map number                   
REQ_TEXT EQU   6                   Request discription (optional)               
REQ_TYPE EQU   7                   Type of input                                
*EQ_ILEN EQU   8                   Input length                                 
*EQ_IREQ EQU   10                  Required                                     
*EQ_DATA EQU   11                  Request Data                                 
*EQ_NODE EQU   12                  Node (optional)                              
                                                                                
REQ_NUM  EQU   1                   Request number                               
REQ_ITM# EQU   2                   Item number in request                       
REQ_IND  EQU   3                   Indicator,required, prev level req           
REQ_MAP# EQU   5                   Map number on request screen                 
REQ_IDAT EQU   6                   Request data value                           
REQ_VDAT EQU   7                   Conitional node or value                     
REQ_EID# EQU   8                   Report level, element ID# (Row)              
REQ_IPFX EQU   10                  Prefix to attach constant                    
REQ_VPFX EQU   11                  Prefix to attach variable                    
REQ_ISFX EQU   12                  Suffix to attach constant                    
REQ_VSFX EQU   13                  Suffix to attach variable                    
REQ_ILEN EQU   14                  Length of item constant                      
REQ_VLEN EQU   15                  Length of item variable                      
REQ_IPOS EQU   16                  Start position constant                      
REQ_VPOS EQU   17                  Start position variable                      
REQ_LST# EQU   20                  Data is from list (see LST_NUM)              
REQ_ATB# EQU   21                  Data attribute number                        
                                                                                
CON_NUM  EQU   1                   Condition number                             
CON_TYPE EQU   2                   IF/OR/AND                                    
CON_OPRD EQU   3                   EQ/NE/GT/GE/LT/LE                            
CON_EID# EQU   9                   Reporting level data to compare to           
CON_IDAT EQU   10                  Constant data to compare to                  
CON_DLEN EQU   14                  Data length                                  
CON_DPOS EQU   16                  Data postion                                 
CON_RTF  EQU   18                  Return True (1) or False (0)                 
CON_RVAL EQU   20                  Return value data                            
CON_RNOD EQU   21                  Return value node                            
                                                                                
LST_NUM  EQU   1                   List number                                  
LST_DSCP EQU   2                   List description                             
LST_TYPE EQU   3                   Type of list, From Schema or data            
LST_PNO# EQU   4                   Parent node number                           
LST_ATR# EQU   5                   Attribute number(s)                          
LST_ATYP EQU   6                   Attribute type (Code, Name, Date)            
LST_ALEN EQU   7                   Attribute length                             
                                                                                
DDF_LST# EQU   255                 Data definition list number                  
DDF_UNQ# EQU   254                 Unique Id# for data                          
                                                                                
LST_ANLS EQU   1                   List of analysis formants                    
ATBFMTC  EQU   1                   Attribute format code                        
ATBFMTN  EQU   2                   Attribute format name                        
***********************************************************************         
*  DSECT FOR STORAGE AREA                                             *         
***********************************************************************         
         SPACE 1                                                                
ACRLD    DSECT                                                                  
RELO     DS    F                                                                
MAINPROG DS    A                   A(0) or A(MAIN PROGRAM)  ACRL02              
FRMTBLD  DS    A                   A(INITIALIZATION)        ACRL03              
PRINTREP DS    A                   A(PRINTING OF REPORT)    ACRL04              
TABINIT  DS    A                   A(TABLES)                ACRL05              
ROUTINE  DS    A                   A(ROUTINES)              ACRL06              
         SPACE 1                                                                
***********************************************************************         
*  GLOBAL ROUTINES                                                    *         
***********************************************************************         
         SPACE 1                                                                
ACGLOBAL DS    0A                                                               
AIO      DS    A                   A(IO ROUTINE)                                
GETFCUR  DS    A                   A(GET FOREIGN CURRENCY)                      
PRNTBL   DS    A                   V(PRNTBL)                                    
CENTER   DS    A                   V(CENTER)                                    
UNDERLIN DS    A                   V(UNDERLIN)                                  
JOBEXCP  DS    A                   V(ACJOBEXCP)                                 
CASHVAL  DS    A                   V(CASHVAL)                                   
JOBAGE   DS    A                   V(ACJOBAGE)                                  
PERVERT  DS    A                   V(PERVERT)                                   
AGETFRTE DS    A                   V(ACGETRATE)                                 
RQPRINT  DS    A                   A(PRINT REQUEST FORMAT DETAILS)              
*                                                                               
AGETCNDR DS    A                   A(GETCNDR)                                   
REPORT   DS    A                   A(REPORTER goes to ACREPORT)                 
BRNDDCB  DS    A                   Brand work control block in ACRL03           
BUDBLD   DS    A                   A(BUILD BUDGET DETAIL)                       
SETBUFF  DS    A                   A(SET BUFFERS ROUTINE)      ACRL03           
ABRNBLD  DS    A                   A(BRAND BUILD ROUTINE)      ACRL03           
ALOADTAB DS    A                   A(LOAD AREA and TABLES)     ACRL05           
NMEBLD   DS    A                   A(NAME BUILD ROUTINE)       ACRL03           
SETCNTR  DS    A                   A(SET CONTRA LEVELS)        ACRL05           
GETLDGR  DS    A                   A(GET LEDGER INFO)          ACRL05           
         EJECT ,                                                                
***********************************************************************         
*  BASE ADDRESS OF TABLES                                             *         
***********************************************************************         
         SPACE 1                                                                
KYWBASE  DS    A                   A(KEYWORD TABLE)                             
PRSBASE  DS    A                   A(PARSE TABLE)                               
FLTBASE  DS    A                   A(COLUMN FILTER TABLE)                       
EQUBASE  DS    A                   A(EQUATION TABLE)                            
EDTBASE  DS    A                   A(EDIT TABLE)                                
CURBASE  DS    A                   A(CURRENT KEYWORDS)                          
WRDBASE  DS    A                   A(DICTIONARY WORD LIST)                      
ERRBASE  DS    A                   A(ERROR LIST TABLE)                          
NARBASE  DS    A                                                                
QTRBASE  DS    A                                                                
BNMBASE  DS    A                   A(BRAND NAME TABLE)               SR         
WCLBASE  DS    A                   A(WC LONG  NAME) FROM MONACC                 
WCSBASE  DS    A                   A(WC SHORT NAME) FROM MONACC                 
NAMBASE  DS    A                   A(ACCOUNT NAME BINTABLE)                     
*                                                                               
ATTYPE   DS    A                                                                
ASTACK   DS    A                   A(TRANSACTION STACK) HI-CORE                 
ADATEFMT DS    A                   A(Date format table)                         
         EJECT ,                                                                
***********************************************************************         
*  ADDRESSABLE KEYWORD ENTRIES                                        *         
***********************************************************************         
         SPACE 1                                                                
AKYWCALC DS    A                   A(KYWCALC) regular calculation               
AKYWCALD DS    A                   A(KYWCALD) CALCULATE date-date               
AKYWCALF DS    A                   A(KYWCALF) EXCHAGE RATE calculation          
AKYWCUME DS    A                   A(KYWCUME) Running total column              
AKYWSIGN DS    A                   A(KYWSIGN) Sign of an amount                 
*&&UK                                                                           
AKYWTYMP DS    A                   A(KYWTYMP) TX TYPE MAPPING TO COLUMN         
*&&                                                                             
AKYWJOBR DS    A                   A(KYWJOBR) Jobber column keyword             
AKYWNJES DS    A                   A(KYWNJES) Non-Jobber est col                
AKYWLVLS DS    4A                  A(KYWACCC) Account levels                    
         EJECT ,                                                                
***********************************************************************         
*  GLOBAL PARSE ENTRIES                                               *         
***********************************************************************         
         SPACE 1                                                                
GETCSHD  DS    A                   Get cash discount amount                     
GETCRL$  DS    A                   Get credit limit amount                      
GETICL$  DS    A                   Get internal credit limit amount             
GETRTLC  DS    A                   Get participant                              
GETANOF  DS    A                   Get analysis office                          
GETOFFC  DS    A                   Get office code                              
GETCSTC  DS    A                   Get cost account code                        
GETALTC  DS    A                   Get alternate check date                     
GETALTD  DS    A                   Get alternate deposit date                   
GETDDTE  DS    A                   Get due date                                 
GETXCRD  DS    A                   Get extra credit date                        
GETXDRD  DS    A                   Get extra debit date                         
GETBDTE  DS    A                   Get bill date                                
GETSTTY  DS    A                   Get Studio type                              
GETJOPN  DS    A                   Get Job open date                            
GETPORD  DS    A                   Get Purchase Order number                    
GETPOWC  DS    A                   Get Purchase Order workcode                  
GETJCLS  DS    A                   Get Job closed date                          
GETPRLV  DS    A                   Get Price Level                              
GETPEEL  DS    A                   Get Peeled $ by acct or acct/office          
GETPID   DS    A                   Get pid from person record (1R)              
GETEST#  DS    A                   Get Estimate number                          
*                                                                               
ASJMAXQ  DS    A                   MAX number of entries for SJINFO             
ATBUFLEN DS    A                   Size of main TSAR   buffer                   
AACUMLEN DS    A                   Size of accumulator buffer                   
ABIGBLEN DS    A                   Size of record area buffer                   
         EJECT ,                                                                
***********************************************************************         
*  PRODUCTION  (SJ) ELEMENT ADDRESSES                                 *         
***********************************************************************         
         SPACE 1                                                                
*                                  A(SCITTQST type (QST, HST or PST) US         
AELEM50T DS    A                   A(1P CONTRA SJ HOURS ELEMENT)     UK         
AELEMBA  DS    A                   A(STUDIO  LINK       ELEMENT)                
AELEM77B DS    A                   A(PRORATA BILLED     ELEMENT)                
AELEM77W DS    A                   A(PRORATA WRITE-OFF  ELEMENT)                
AELEM77T DS    A                   A(PRORATA TRANSFER   ELEMENT)                
SAVELM77 DS    3A                                                               
         SPACE 1                                                                
***********************************************************************         
*  COST        (1R) ELEMENT ADDRESSES                                 *         
***********************************************************************         
         SPACE 1                                                                
AELEM83  DS    A                   A(LOCATION ELEMENT FOR CLUSTER)              
AELEM86  DS    A                   A(PAYROLL ELEMENTS)                          
AELMTMS1 DS    A                   A(TIME CLUST, TYPE 1)                        
AELMTMS2 DS    A                   A(TIME CLUST, TYPE 2)                        
AELMTMS3 DS    A                   A(TIME CLUST, TYPE 3)                        
AELMTMS4 DS    A                   A(TIME CLUST, TYPE 4)                        
AELMTMS5 DS    A                   A(TIME CLUST, TYPE 5)                        
AELMTMS6 DS    A                   A(TIME CLUST, TYPE 6)                        
AELMTMS7 DS    A                   A(TIME CLUST, TYPE 7)                        
AELMTMS8 DS    A                   A(TIME CLUST, TYPE 8)                        
AELMTMS9 DS    A                   A(TIME CLUST, TYPE 9)                        
AELMTM10 DS    A                   A(TIME CLUST, TYPE 10)                       
AELMTM11 DS    A                   A(TIME CLUST, TYPE 11)                       
AELMTM12 DS    A                   A(TIME CLUST, TYPE 12)                       
AELMTM13 DS    A                   A(TIME CLUST, TYPE 13)                       
AELMTM14 DS    A                   A(TIME CLUST, TYPE 14)                       
         DS    A                   SPARE                                        
AELMTM30 DS    A                   A(TIME CLUST, TYPE 30)                       
AELMTMSQ EQU   *-AELMTMS1                                                       
         SPACE 1                                                                
***********************************************************************         
*  GENERAL          ELEMENT ADDRESSES                                 *         
***********************************************************************         
         SPACE 1                                                                
AELEM1A  DS    A                   A(MDTELQ element)                            
AELEM23  DS    A                   A(OTHELQ element)                            
AELEM25  DS    A                   A(FFNELQ element)                            
AELEM40  DS    A                   A(PRTELQ element)                            
AELEM47  DS    A                   A(MXPELQ element)                            
AELEM4E  DS    A                   A(PXDELQ element)                            
AELEM4F  DS    A                   A(CPJELQ element)                            
AELEM50  DS    A                   A(SCIELQ element)                            
AELEM59  DS    A                   A(ARTELQ element)                            
AELEM5F  DS    A                   A(SUTELQ element)                            
AELEM60  DS    A                   A(TRSELQ element)                            
AELEM63  DS    A                   A(GLDELQ element)                            
AELEM6A  DS    A                   A(MDPELQ element)                            
AELEM75  DS    A                   A(TRXELQ element)                            
AELEM76  DS    A                   A(NOTELQ element)                            
AELEM7A  DS    A                   A(AFCELQ element)                            
AELEM7B  DS    A                   A(SORELQ element)                            
AELEM7C  DS    A                   A(UNPELQ element)                            
AELEM97  DS    A                   A(EXOELQ element)                            
AELEMA2  DS    A                   A(XDFELQ element)                            
AELEMC0  DS    A                   A(APEELQ element)                            
AELEMD4  DS    A                   A(PAKELQ element)  payable key               
AELEMD5  DS    A                   A(SERELQ element)                            
AELEMD9  DS    A                   A(RALELQ element)                            
AELEMDB  DS    A                   A(FFTELQ element)                            
AELEMQ   EQU   *-AELEM1A                                                        
AELEM99  DS    A                   A(Specially made pay hist element)           
AELEMPO  DS    A                   A(CURRENT X'67' ON PO RECORD)                
*                                                                               
***********************************************************************         
*  Low core tables                                                              
***********************************************************************         
AACRL2D  DS    A                   A(2ND 4K STORAGE AREA) ACRL2D                
AIO1     DS    A                   A(IO AREA 1)                                 
AIO2     DS    A                   A(IO AREA 2)                                 
AIO3     DS    A                   A(IO AREA 3)                                 
GENAREA1 DS    A                   A(GENERAL AREA)                              
GENAREA2 DS    A                   A(GENERAL AREA)                              
ASAVTRNS DS    A                   A(COPY OF TRANSACTION)                       
ABUDIO   DS    A                   A(BUDGET IO AREA)                            
AAUTHREC DS    0A                  A(Authorization recrod)           SJ         
APRSNWRK DS    A                   A(Person record)                  1R         
ABUDWRK  DS    A                   A(BUDGET WORK AREA)                          
ACNDRWRK DS    A                   A(EXPANDED CALENDAR) DSECT -> CDRD           
ACNDRLST DS    A                   A(List of calendars processed)               
ASRTWRK  DS    A                   A(SORT RECORD)                               
APRVWRK  DS    A                   A(PREVIOUS SORT RECORD)                      
ABUFWRK  DS    A                   A(BUFFREC WORK AREA)                         
ABIGWRK  DS    A                   A(AREA / MAXFMTS) ==> FMTSRTWK               
ATBUFREC DS    A                   A(TSAR BUFFER RECORD)                        
AFORMATS DS    A                   A(Formats)                                   
PTRCOL   DS    A                   A(OPEN AREA IN COLUMN TABLE)                 
PTRROW   DS    A                   A(OPEN AREA IN ROW    TABLE)                 
PTRACM   DS    A                   A(OPEN AREA IN ROW ACCUMULATORS)             
PTRRHEAD DS    A                   CURRENT POS. FOR HEADLINE TABLE              
PTRCHEAD DS    A                   CURRENT POS. IN COL HEADTABLE LINE           
PTRBXCOL DS    A                   CURRENT POS. IN BOXCOL LINE                  
PTRBUD   DS    A                   A(OPEN AREA IN BUDGET TABLE)                 
DWNLDCB  DS    A                   Down-load control block in  ACRL04           
AHDRDATA DS    A                   A(Extended headers)                          
ATTRDATA DS    A                   A(Extended total trailer)                    
ATRLDATA DS    A                   A(Extended trailer)                          
CDRBASE  DS    0A                  A(COMPRESS CALENDAR STORAGE)      1R         
BILLTAB  DS    0A                  A(Bill data form pre-read 99's)   SJ         
BRNBASE  DS    A                   A(AGENCY BRAND TABLE)-(BSNY ONLY) SR         
JBAGEBLK DS    A                   A(JOBAGE PARAMETER BLOCK)                    
JBAGECOL DS    A                   A(TO COLUMN DATE PAIRS FOR AGEING)           
ADATEHDS DS    A                                                                
AFLTAREA DS    A                   A(Filter data)                               
AFLTADDR DS    A                   A(pointer table to column filers)            
ALEDGERS DS    A                   A(LIST OF LEDGERS)                           
LDGBASE  DS    A                   A(LIST OF LEDGERS & THERE LEVELS)            
ROWWRK   DS    A                   A(COL ROW ELEMENT POOL)                      
HEADWRK  DS    A                   A(ROW HEAD ELEMENT POOL)                     
ACNDRBLK DS    0A                  A(Calendar block data)            1R         
APTAWRK  DS    A                   A(PTAEL WORK AREA)                SJ         
UDKBASE  DS    A                   A(USER DEFINED KEYWORD TABLE)                
PTCCODES DS    A                   POINTER TO CUR. POS. IN CONCODES             
PTPSTACK DS    A                   POINTER TO CUR. POSTFIX STACK AREA           
PTRFDATA DS    A                   POINTER TO CUR. POS. IN FREE DATA            
ABLOCK   DS    A                                                                
ADELPOOL DS    A                   A(AREA / MAXFMTS) ==> FMTDELEL               
ALISTREC DS    A                   A(+/- LIST POOL)                             
ACONTAB  DS    A                   A(Conditional table)                         
ATMPHEAD DS    A                                                                
AHEADCOL DS    A                   A(DOWNLOAD COLUMN HEADING ELEMENTS)          
XPSAVE   DS    A                   A(SAVED XP PRINT AREA)                       
PTHEADS  DS    A                   POINTER TO HEAD LINES (MY XHEADS)            
FOOTNOT1 DS    A                                                                
STUBASE  DS    A                   A(STUDIO TABLE)                              
LNKBASE  DS    A                   A(BLOCK OF X'BA' LNKELD ELEMENTS) SJ         
AJXBLOCK DS    A                   A(JOB EXCEPTION BLOCK)                       
OFFBASE  DS    A                   A(OFFICE TABLE)                              
OFGBASE  DS    A                   A(OFFICE GROUP NAME TABLE)                   
MGPBASE  DS    A                   A(MEDIA  GROUP NAME TABLE)                   
WGPBASE  DS    A                   A(WORK   GROUP NAME TABLE)                   
MD1BASE  DS    A                   A(MEDIA NAME) production                     
MD2BASE  DS    A                   A(MEDIA NAME) other (MI or SI rec)           
SALETAX  DS    A                   A(Sales tax code/name table)                 
ABUFF    DS    A                   A(BUFFALO DSECT AREA)                        
ACOSTBLK DS    A                   A(JOB COSTING DSECT AREA)                    
MHDBASE  DS    A                   A(METHOD INFO TABLE)           1R 1C         
CSTBASE  DS    A                   A(COST INFO TABLE)                1R         
AMAPDATA DS    0A                  A(Map data for DDLINKIO)                     
CFWBASE  DS    0A                  A(Cashflow job storage)           SJ         
RTEBASE  DS    A                   A(ALLOCATED RATE TABLE)        1R 1C         
PTABASE  DS    0A                  A(Copy of PTAWRK for recaps)      SJ         
PYCBASE  DS    A                   A(Pay code/name BINTABLE)         1R         
ATIMSAV  DS    A                   A(TIME SAVED RECORD DATES BY PERSON)         
ALTOFFL  DS    A                   A(Alternate office list)                     
ABILLBLK DS    A                   A(Billed dates based on GDAELQ)              
ACFWELS  DS    0A                  A(CASHFLOW ELEMENTS)                         
ANONCLI  DS    A                   A(NON-CLIENT INFO, 1N)                       
PRNENTBL DS    A                   A(PLANNING/REV NUMBER ENTRIES TABLE)         
ATOTREC  DS    A                   A(Total hours record)                        
ARATEBLK DS    A                   A(ACGETRATED block)                          
APAYTOTS DS    A                   A(Payroll totals)                            
APAYRTE2 DS    A                   A(Payroll rates only)                        
AEQUTION DS    A                   A(Equations for DDLINK)                      
ABUFCOR  DS    A                   A(CORE FOR BUFFALO)                          
NMEBASE  DS    A                   A(Column name table)                         
AORIGEST DS    A                   A(Original estimate data)                    
ACURREST DS    A                   A(Current estimate data)                     
AHREVEST DS    A                   A(Highest rev estimate data)                 
ATMSAUDR DS    A                   A(TMS audit record)                          
ACEITEM  DS    A                   A(WC, Item code, description for CE)         
AOEITEM  DS    A                   A(WC, Item code, description for OE)         
AHRITEM  DS    A                   A(WC, Item code, description for HR)         
ACLPORD  DS    A                   A(Client purchase order data)                
AXDATAN  DS    A                   A(Extra data names)                          
AXDATAV  DS    A                   A(Extra data values)                         
ARESREC  DS    A                   A(Resrecd)                                   
AXDATNE  DS    A                   A(Extra data names on Estimates)             
AXDATVE  DS    A                   A(Extra data values on Estimates)            
AXESGLB  DS    A                   A(Estimate global nos for filtering)         
***********************************************************************         
*  High core tables                                                             
***********************************************************************         
ASJBUF1  DS    A                   A(1ST BUFFER TO BUT SJ DATA)                 
ASJBUF2  DS    A                   A(2ND BUFFER TO PUT SJ DATA)                 
ESTMAIN  DS    A                   A(ESTIMATE MAIN DATA) SEE ESTMD              
ESTWCTB  DS    A                   A(ESTIMATE DATA) SEE ESTWCD                  
ETYBASE  DS    A                   A(Expenditure type table)                    
APAYHIST DS    A                   A(Payroll history details)                   
APODATA  DS    A                   A(Orders for a given job)                    
APOBYWC  DS    A                   A(Orders by Job by workcode)                 
ASJTABLE DS    A                   A(SJ cli/prod/info table)                    
AEQBASE  DS    A                   A(Equivalent name)                           
APOOLPTR DS    A                   A(Free pool of names or data)                
APOOLEOT DS    A                   A(End of free pool)                          
ATBUFF   DS    A                   Buffer for TSAR (ABOVE 16M LINE)             
*&&US                                                                           
AGBMOST  DS    A                   A(GB acct MOS)                               
*&&                                                                             
***********************************************************************         
* Other tables                                                                  
***********************************************************************         
AFCURY   DS    A                   A(Foreign currency table)                    
ATSAROFF DS    A                   A(TSAROFF)                                   
TSARDINE DS    A                   A(TSAR)                                      
PTRCSPWK DS    A                   CURRENT POS. IN PRINT LINE                   
TOTDESCP DS    A                   PRINT LINE ADDR. OF DESCRIPTION              
POINTER  DS    A                   POINT TO CUR. END OF POOL                    
TOTFORAD DS    A                                                                
SAVEWRK  DS    A                   SAVE WORK ADDRESS                            
APRORATA DS    A                   A(PRORATA)                                   
BUKELM   DS    A                                                                
ACURMTHD DS    A                   CURRENT METHOD FOR COLUMN                    
AHOURBUK DS    A                   CURRENT TOTAL HOUR BUCKET                    
ASTDRBUK DS    A                   CURRENT STANDARD HOUR BUCKET                 
RLBASEB  DS    A                   SAVE RB OF ACRL02                            
RLBASEC  DS    A                   A(1ST 4K STORAGE AREA) ACRLD                 
ALSORT   DS    A                   A(LAST SORT RECORD)                          
ACLIST   DS    A                   A(ACLIST)                                    
CONCODE  DS    A                                                                
PRTAREA  DS    A                                                                
PRT#LN   DS    A                                                                
CKLIST   DS    A                   ADDRESS OF LIST RECORD                       
ALSTITEM DS    A                   ADDRESS OF LIST ITEM                         
SJENTRY  DS    A                   CURRENT SJ ENTRY IN BINTABLE                 
AORENTRY DS    A                   CURRENT AOR ENTRY IN BINTABLE                
PRORATA1 DS    A                   A(PRORATA BLOCK 1)                           
PRORATA2 DS    A                   A(PRORATA BLOCK 2)                           
JOBRBLK  DS    A                   A(JOBBER COLUMN AREA ADDRESS)                
ACOLPOOL DS    A                   A(Column heading pool area)                  
AGOXBLK  DS    A                   A(EXTENDED AREA FOR GETOPT)                  
ACURROW  DS    A                   A(CURRENT ROW FOR WHEN PARSING)              
ACURCOL  DS    A                   A(CURRENT COLUMN FOR WHEN PARSING)           
ATMSKEY  DS    A                   A(KEY OF TIME RECORD)                        
ADDEL    DS    A                   A(Hello from MASTER)                         
AUPCASE  DS    A                   A(Upper case "TR" table)                     
AOFFACC  DS    A                   A(ACMAOFA), OFFICE/ACCOUNT RECORD            
ABTYPTAB DS    A                   A(Bill Type table) - ACRL04                  
ACURBIL  DS    A                   Current bill from ABTYPTAB or zero           
ACUREST  DS    A                   Current estimate table start                 
AMIXCASE DS    A                   A(Mix case "TR" table)                       
ASETACT  DS    A                   A(SETACT)                                    
SECRET   DS    A                   A(SECRET)                                    
DDLINKIO DS    A                   A(DDLINKIO)                                  
AEQVPOOL DS    A                   Equivelency entries                          
AADJPOOL DS    A                   Adjust parse entries                         
@POBYWC  DS    A                   A(Pointer into APOBYWC)                      
PRTFRMT  DS    A                   A(Format processing)                         
SVULINE  DS    A                   SAVE UNDERLINE ADDRESS                       
@SUBTAB  DS    A                   A(Substituet tables)                         
@REPLNME DS    A                   Replacement data                             
AGRPTAB  DS    A                   Group keyword table in ACREPRL03             
AGRPNMES DS    A                   Group names   table in ACREPRL03             
AREQTAB  DS    A                   A(Accent request tables)                     
AREQLIST DS    A                   A(List of request items)                     
AREQITEM DS    A                   A(Address of request items)                  
ACCNTAB  DS    A                   A(Accent conditions table)                   
ACCNLIST DS    A                   A(List of conditions)                        
AWCINXT  DS    A                   A(Next position in ITEM tables)              
AITMBLK  DS    A                   A(Current ITEM to process)                   
NJEMBLK  DS    A                   A(Current non-jobber main est block)         
NJEWBLK  DS    A                   A(Current non-jobber wc est block)           
NJETBLK  DS    A                   A(Current non-jobber est time block)         
CXDATNE  DS    A                   A(Current xdata name entry)                  
CXDATVE  DS    A                   A(Current xdata value entry)                 
CXESGLB  DS    A                   A(Current est global number)                 
         EJECT ,                                                                
***********************************************************************         
*  Scribe routines in ACRL06                                          *         
***********************************************************************         
         SPACE 1                                                                
ASEED    DS    A           ACRL06  A(SEED SORT WITH RECORD)                     
ATSAR    DS    A           ACRL06  A(TSAR ROUTINE)                              
ARANK    DS    A           ACRL06  A(RANKING ROUTINE)                           
ARECORD  DS    A           ACRL06  A(BUILD RECORD FOR SORTER)                   
APUTREC  DS    A           ACRL06  A(PUT RECORDS TO SORT OR TSAR)               
ATRN2TMS DS    A           ACRL06  A(CONVERT TRANSACTION TO TMS)                
ASVD2TMS DS    A           ACRL06  A(CONVERT SAVED ITEMS TO TMS)                
PAYROLL  DS    A           ACRL06  A(BUILD SALARY RECORD)                       
AFILTER  DS    A           ACRL06  A(FILTER)                                    
VERTPCT  DS    A           ACRL06  A(VERTICAL % ROUTINE)                        
GETPO    DS    A           ACRL06  A(GET PURCHASE ORDER)                        
DEBUG    DS    A           ACRL06  A(DEBUG, DUMP RECORDS)                       
BUDGETS  DS    A           ACRL06  A(PROCESS BUDGETS)                           
PARSE    DS    A           ACRL06  A(PARSE ROUTINE)                             
EVAL     DS    A           ACRL06  A(EVALUATE POSTFIX)                          
ARATE    DS    A           ACRL06  A(SET UP COST RATES)                         
ESTSTAT  DS    A           ACRL06  A(ESTIMATE STATUS ROUTINE)                   
TOTLHRS  DS    A           ACRL06  A(GET HOURS TOTALS FOR PERSON)               
LOCATION DS    A           ACRL06  A(PUT PERSON LOCATION RECORDS)               
RANKDCB  DS    A           ACRL02  RANK WORK CONTROL BLOCK IN                   
BIN31    DS    A                   V(BINSEARCH 31 bit mode)                     
POSTTHR  DS    A           ACRL06  POST TOTAL HOURS                             
ASETPAY  DS    A           ACRL06  Set history element for processing           
GETFORMT DS    A           ACRL03  A(GET FORMAT RECORD ROUTINE)                 
TIMENTY  DS    A                   CURRENT TIMETAB ENTRY                        
ACURWRK  DS    A                   A(SRTWRK) OR A(PRVWRK)                       
ASIDFLD  DS    A                   TIMER POP INFO ADDRESS ?                     
ADLFLD   DS    A           ACRL04  V(DLFLD)                                     
ACOLPAYR DS    A           ACRL06  A(COLPAYR) Set column payrolls               
ABLDLML  DS    A           ACRL06  A(build TSAR recs from LimList Qrep)         
ARDLML   DS    A           ACRL06  A(read LimList TSAR recs for Qrep)           
GOATSAR  DS    A           ACRL06  A(Tsar interface for limlist)                
GEST     DS    A           ACRL06  A(GET ESTIMATE RECORD (ESTRD))               
AESXFLT  DS    A           ACRL06  A(FILTER ESTIMATE BY XDATA)                  
APBKPST  DS    A           ACRL06  A(Process PBKELD element(s))                 
TIMEIN   DS    F                                                                
TIMEOUT  DS    F                                                                
         EJECT ,                                                                
***********************************************************************         
*  IO DATA FOR DATAMGR CALL                                           *         
***********************************************************************         
         SPACE 1                                                                
         DS    0D                  START ON BOUNDARY                            
IOWRK    DS    12D                 I-O  WORK AREA                               
         DS    2A                  SPARE (was changed to A lvl *31)             
IODISK   DS    A                   DISK ADDRESS                                 
IOBUFF   DS    A                   IO AREA TO READ INTO                         
IOSVREG  DS    A                   SAVE RETURN ADDRESS                          
IOFILE   DS    CL8                 FILE TO READ FROM                            
DMFCNTRL DS    CL8                 CONTROL FILE                                 
DMFACFIL DS    CL8                 ACCOUNT FILE                                 
DMFACDIR DS    CL8                 ACCOUNT DIRECTORY                            
DMFACMST DS    CL8                 ACCOUNT MASTER FILE                          
DMFACARC DS    CL8                 ACCOUNT ARCHIVE FILE                         
IOACTION DS    CL8                 ACTION FOR DATAMGR                           
*                                                                               
         DS    0F                                                               
IOFLAGS  DS    0XL4                FILE AND ACTION FLAGS                        
         DS    XL1                 SPARE                                        
IOFFLAG  DS    XL1                 File flag                                    
IOCNTRL  EQU   X'00080000'           .  CONTROL FILE FLAG                       
ICNTRL   EQU   X'08'                                                            
IOACFIL  EQU   X'00040000'           .  ACCOUNT FILE FLAG                       
IACFIL   EQU   X'04'                                                            
IOACDIR  EQU   X'00020000'           .  DIRECTORY ACCDIR                        
IACDIR   EQU   X'02'                                                            
IOACMST  EQU   X'00010000'           .  GET RECORD FROM DIRECTORY READ          
IACMST   EQU   X'01'                                                            
IOACARC  EQU   X'00030000'           .  GET ACCARC REC FROM ACCDIR READ         
IACARC   EQU   X'03'                                                            
*                                                                               
IOAFLAG  DS    XL1                 Action flag                                  
IOREAD   EQU   X'00008000'           .  READ                                    
IREAD    EQU   X'80'                                                            
IOHIGH   EQU   X'00004000'           .  READ HI                                 
IHIGH    EQU   X'40'                                                            
IOSEQ    EQU   X'00002000'           .  READ SEQ                                
ISEQ     EQU   X'20'                                                            
IOGETREC EQU   X'00001000'           .  GET RECORD                              
IGETREC  EQU   X'10'                                                            
*                                                                               
IOIFLAG  DS    XL1                 IO area flag                                 
IOAREA1  EQU   X'00000001'           .  IO AREA 1                               
IAREA1   EQU   X'01'                                                            
IOAREA2  EQU   X'00000002'           .  IO AREA 2                               
IAREA2   EQU   X'02'                                                            
IOAREA3  EQU   X'00000004'           .  IO AREA 3                               
IAREA3   EQU   X'04'                                                            
IOAREA4  EQU   X'00000008'           .  IO AREA 4                               
IAREA4   EQU   X'08'                                                            
IOAREA5  EQU   X'00000010'           .  IO AREA 5                               
IAREA5   EQU   X'10'                                                            
IOBUD    EQU   X'00000020'           .  IO AREA BUDGET                          
IBUD     EQU   X'20'                                                            
*                                                                               
IODMIND  DS    XL1                 Data manager indicators                      
IODMUPD  EQU   X'80'               Read for update                              
IODMDEL  EQU   X'08'               Read for deleted                             
IODMSPC  EQU   X'20'               Special DM action                            
IODMSEC  EQU   X'02'               Get DDS Security record intact               
*                                                                               
IOKEYACC DS    0CL15                                                            
IOKEY    DS    0CL(ACCORFST)       KEY TO READ                                  
IODIRKEY DS    CL(ACCRFST-ACCRECD)                                              
IOKEY2   DS    CL15                                                             
         ORG   IOKEY2+3                                                         
TEMPCP   DS    CL12                                                             
         EJECT ,                                                                
***********************************************************************         
*  FULL-WORD VARIABLES AND                                            *         
*  FIELDS REQUIRING FULL-WORD BOUNDARY ALIGNMENT                      *         
***********************************************************************         
         SPACE 1                                                                
         DS    0D                                                               
DUB1     DS    D                                                                
DUB2     DS    D                                                                
PL16     DS    PL16                                                             
SVREG    DS    A                                                                
SVRE     DS    A                                                                
SVRF     DS    A                                                                
SVR0     DS    A                                                                
SVR1     DS    A                                                                
SVR2     DS    A                                                                
SVR3     DS    A                                                                
SVR4     DS    A                                                                
SVR5     DS    A                                                                
SVR6     DS    A                                                                
                                                                                
RGHTHEAD DS    A                                                                
LEFTHEAD DS    A                                                                
CENTHEAD DS    A                                                                
FOOTNOT2 DS    A                                                                
                                                                                
PRVCOLLC DS    A                   PREVIOUS LOCATION OF COLUMN                  
PRVCOLBX DS    A                   PREVIOUS LOCATION OF "C" BOX MARK            
                                                                                
BUDSAVE  DS    A                   SAVED POINT TO BUDGET IN TABLE               
NUMREC   DS    A                   NUMBER OF BINARY SEARCH RECORDS              
NBRNREC  DS    A                                                                
NAME#    DS    A                   NUMBER OF NAMES                              
RATEPTR  DS    A                                                                
                                                                                
CUREXCP  DS    F                                                                
FLTEXCP  DS    F                                                                
                                                                                
EVSTACK  DS    20F                                                              
                                                                                
*&&US                                                                           
ADWNLINE DS    F                   DOWNLOAD LINE (FOR DWN)                      
         DS    F                   SPARE                                        
*&&                                                                             
*&&UK*&& DS    2F                  SPARE                                        
#OFACTS  DS    A                   # of accounts processed (GL)                 
                                                                                
         DS    0A                  FORCE TSARBLK  TO A FULL WORD                
TSARBLK  DS    CL(TSARDL)                                                       
         DS    0A                  FORCE TSARBLK2 TO A FULL WORD                
TSARBLK2 DS    CL(TSARDL)                                                       
*                                                                               
GOTSABUF DS    XL(TSPXTNL)         TSAR block for limlist buffer                
GOAWRKL  EQU   *-GOTSABUF                                                       
         EJECT ,                                                                
***********************************************************************         
*   GLOBAL FORMAT OPTIONS (MAIN FORMAT PROFILE)                       *         
***********************************************************************         
         SPACE 1                                                                
METHODS  DS    CL9                 METHODS USED                                 
         EJECT ,                                                                
***********************************************************************         
*  LEDGER STRUCTURE OF SJ                                             *         
***********************************************************************         
         SPACE 1                                                                
SJLGST   DS    0H                                                               
SJCLILEN DS    XL1                                                              
         DS    XL1                 SPARE BUT BE CAREFUL                         
SJCLIDSP DS    H                                                                
SJLGSTQ  EQU   *-SJLGST                                                         
SJPRDLEN DS    XL1                                                              
         DS    XL1                 SPARE BUT BE CAREFUL                         
SJPRDDSP DS    H                                                                
SJJOBLEN DS    XL1                                                              
         DS    XL1                 SPARE BUT BE CAREFUL                         
SJJOBDSP DS    H                                                                
SJLGSTLN EQU   *-SJLGST                                                         
DSP2CLI  DS    H                   ledger 1c - displacement to cli/prd          
         EJECT ,                                                                
***********************************************************************         
*  HALF-WORD VARIABLES                                                *         
***********************************************************************         
         SPACE 1                                                                
MAX#TRNS DS    H                   MAX SORT RECS. BUILT AT ANY 1X               
SAVETRNS DS    H                                                                
RTINDENT DS    H                                                                
RGHTJUST DS    H                                                                
CURBUD#  DS    H                   CURRENT BUDGET NUMBER                        
OFFICE#  DS    H                   NUMBER OF OFFICE RECORDS                     
NCROWS   DS    H                   NUMBER OF NON-COLUMN ROWS                    
PAYBUK#  DS    H                                                                
EQNAME#  DS    H                   NUMBER OF EQUIVALENT NAME                    
ETNAME#  DS    H                   NUMBER OF EXPENDITURE NAMES                  
SRTDTE   DS    H                   ALIGNED DATA FOR HALF WORD NUMBERS           
ENDDTE   DS    H                                                                
                                                                                
FORMAT#  DS    H                   NUMBER OF FORMATS                            
ANLYRPT# DS    H                   Number of analysis reports                   
FOOT#    DS    H                   NUMBER OF FOOTLINES FOR PAGE                 
RECIDX#  DS    H                                                                
RATELEN  DS    H                                                                
RATEMTH  DS    H                                                                
CSTMTHDS DS    H                                                                
CSTYRS   DS    H                                                                
TOTBUK#  DS    H                                                                
STDBUK#  DS    H                                                                
NONCLI#  DS    H                   LOWEST  YEAR RANGE                           
BUFKRATE DS    H                   DISPLAEMENT INTO BUFFALLO TO RATES           
FMTLEN   DS    H                   LENGTH OF FORMAT STORAGE                     
ROWHEAD# DS    H                   Number of row headings                       
SJLNQ    DS    H                   Length of SJINFO DSECT entry                 
#BILLS   DS    H                   Number of bills for job                      
#TOTBILS DS    H                                                                
#OFPO    DS    H                   Number of Purchase orders                    
#OFCAC   DS    H                   Number of office/contras                     
#OFEST   DS    H                   Number of Estimates                          
#OFESTT  DS    H                   N'Estimate time table entries                
*                                                                               
BFLKEYLN DS    Y                   Max buffalo key length                       
*&&US                                                                           
SVGLBMOS DS    Y                   Saved GB/GP x'55' end MOS                    
*&&                                                                             
*&&UK                                                                           
         DS    Y                   Spare                                        
*&&                                                                             
SRTKEYLN DS    Y                   Length of key                                
SRTKEYXT DS    Y                   Length of xtra data (l'key - l'xtra)         
SRTREPNO DS    Y                   Displacement to format number                
SRTDATLN DS    Y                   Length of Key + Data                         
SRTRECLN DS    Y                   Length of Key + Data + Accums                
SRTACMLN DS    Y                   Length of accums                             
*RTEDIT  DS    Y                   Displacement to edit parameters              
SRTFLDQ  EQU   *-SRTKEYLN                                                       
         EJECT 1                                                                
***********************************************************************         
*  FLAGS                                                              *         
***********************************************************************         
         SPACE 1                                                                
ACCSTAT  DS    XL1                 ACCOUNT IS LOCKED (Y/N/O)                    
ACCLOCK  EQU   X'80'               .  LOCKED ACCOUNT                            
ACCCLSE  EQU   X'40'               .  CLOSED ACCOUNT                            
ACCAPPE  EQU   X'20'               .  APPROVED ESTIMATE                         
ACCXJOB  EQU   X'10'               .  X-JOB  ACCOUNT                            
ACCPAYN  EQU   X'08'               .  PAY=NO ACCOUNT                            
ACCMCSE  EQU   X'04'               .  MCS ESTIMATES                             
ACCDJOB  EQU   X'02'               .  DRAFT JOB                                 
*                                                                               
ACLOCK   DS    XL1                Locked levels                                 
ACLOCK1  EQU   X'01'               .  Account level 1 is locked                 
ACLOCK2  EQU   X'02'               .  Account level 2 is locked                 
ACLOCK3  EQU   X'04'               .  Account level 3 is locked                 
ACLOCK4  EQU   X'08'               .  Account level 4 is locked                 
ACLOCANY EQU   X'0F'               .  Any level set                             
*                                                                               
ACCLOSE  DS    XL1                Locked levels                                 
ACCLSE1  EQU   X'01'               .  Account level 1 is closed                 
ACCLSE2  EQU   X'02'               .  Account level 2 is closed                 
ACCLSE3  EQU   X'04'               .  Account level 3 is closed                 
ACCLSE4  EQU   X'08'               .  Account level 4 is closed                 
ACCLSANY EQU   X'0F'               .  Any level set                             
*                                                                               
ACPAYEE  DS    XL1                PAYEE=NO                                      
ACPAYE1  EQU   X'01'               .  Account level 1 PAYEE=NO                  
ACPAYE2  EQU   X'02'               .  Account level 2 PAYEE=NO                  
ACPAYE3  EQU   X'04'               .  Account level 3 PAYEE=NO                  
ACPAYE4  EQU   X'08'               .  Account level 4 PAYEE=NO                  
ACPAYANY EQU   X'0F'               .  Any level set                             
*                                                                               
BLDACT   DS    XL1                 Current action we are building in            
BLDPRV   EQU   X'80'               .  Save previous record                      
BLDGOT1  EQU   X'10'               .  Processed at least on record              
BLDMGPG  EQU   X'08'               .  Merge recaps on same page                 
BLDMIDS  EQU   X'04'               .  Mid-lines are to be printed               
BLDROWS  EQU   X'02'               .  Currently building rows                   
BLDCOLS  EQU   X'01'               .  Currently building cols                   
*                                                                               
BROADFG  DS    AL1                                                              
BRNCHSGN DS    XL1                 BRANCH CONDITION FOR SIGN CHANGE             
*                                                                               
BUILD    DS    XL1                 BUILD OR SET TABLE OR INICATORS              
BUILDSJ  EQU   X'80'               .  BUILD SJ TABLE                            
BUILDSTU EQU   X'40'               .  BUILD STUDIO TABLE                        
BUILDBRD EQU   X'20'               .  BUILD BRAND TABLE (BSNY ONLY)             
BUILDOFF EQU   X'02'               .  BUILD OFFICE TABLE                        
BUILDFC  EQU   X'01'               .  BUILD FOREIGN CURRENCY TABLE              
*                                                                               
BUILT    DS    XL1                 BUILT OR SET TABLE OR INICATORS              
BUILTSJ  EQU   X'80'               .  BUILT SJ TABLE                            
BUILTSTU EQU   X'40'               .  BUILT STUDIO TABLE                        
BUILT1N  EQU   X'20'               .  BUILT 1N TABLE                            
BUILTOFF EQU   X'02'               .  BUILT OFFICE TABLE                        
BUILTFC  EQU   X'01'               .  BUILT FOREIGN CURRENCY TABLE              
*                                                                               
SOONJOB  DS    CL1                 Job processing soon ? Y/N/D(irect)           
DIRECT   EQU   C'D'                Job is Direct to PQ                          
CENTFLAG DS    CL1                 FLAG TO CENTER OR NOT (Y/N)                  
CHUNK    DS    XL1                 CHUNK COLUMNS? (Y/N)                         
*                                                                               
ERROR#   DS    AL1                                                              
REQDONE  EQU   X'FF'               REQUEST COMPLETE                             
*                                                                               
NEWOFF   DS    XL1                 NEW OFFICE SYSTEM (Y/N)                      
NPIDS    DS    AL1                 NUMBER OF PIDS STORED MAX 20                 
OPTPRT   DS    XL1                 OPTION FOR PRINTING NUMBERS (PRTIND)         
*                                                                               
PAGEFLAG DS    XL1                 FLAG FOR PAGEING                             
PAGENEW  EQU   X'80'               .  NEW PAGE                                  
PAGE#01  EQU   X'40'               .  SET PAGE NUMBER TO ONE                    
PAGEHOLD EQU   X'20'               .  HOLD UP FORCEING PAGEING                  
PAGECSKP EQU   X'08'               .  COLUMN WILL NOT BE PRINTED                
PAGE@END EQU   X'04'               .  AT  END OF  PAGE                          
PAGEACOL EQU   X'02'               .  ALL COLUMNS FORMATTED                     
PAGERSET EQU   X'01'               .  RESET PRINT DETAILS                       
*                                                                               
PRDGRP   DS    CL1                 FLAG TO GET PRODUCT GROUP CLI/PRD            
PRINTFG  DS    XL1                 FLAG TO PRINT LINES                          
PPRINT   EQU   X'80'               .  PRINTING DETAIL OR TOTAL                  
PUPFRONT EQU   X'40'               .  PRINT UPFRONT DATA USED                   
PACCUM   EQU   X'10'               .  DO NOT PRINT, BUT ADD TO ACCUMS           
PTOTAL   EQU   X'08'               .  PRINT TOTAL                               
PDETAIL  EQU   X'04'               .  PRINT DETAIL                              
PBOTTOM  EQU   X'02'               .  PRINT BUFFER AT BOTTOM                    
PSKIP    EQU   X'01'               .  SKIPLINE NO PRINT                         
NOPRINT  EQU   X'FF'-PPRINT-PSKIP-PBOTTOM                                       
*                                                                               
PRTACT   DS    XL1                 CURRENT PRINT ACTION                         
PRTHEADS EQU   X'80'                                                            
PRTMIDS  EQU   X'40'                                                            
PRTROWS  EQU   X'20'                                                            
PRTDTAIL EQU   X'10'                                                            
PRTTOTS  EQU   X'08'               .  Print row total info data (old)           
PRTRTOT  EQU   X'08'               .  Print row total info data                 
PRTCTOT  EQU   X'04'               .  Print column amount totals                
PRTPQIDX EQU   X'01'               .  Print queue indexing                      
*                                                                               
PRTOPT   DS    XL1                 GLOBAL PRINT OPTIONS                         
PRTREVSG EQU   X'80'               .  Print amount in reverse                   
PRTNXTLN EQU   X'20'               .  Print totals on seperate line             
PRTRIGHT EQU   X'04'               .  Right justify data                        
PRTNOPFX EQU   X'02'               .  Don't print currency prefix               
PRTNOSQH EQU   X'01'               .  Don't squash data                         
*                                                                               
FCIND    DS    XL1                                                              
FCIPRFIX EQU   X'80'               .  Print with prefix                         
FCISORT  EQU   X'40'               .  Put in sort record                        
FCISET   EQU   X'20'               .  Set pre-defined columns                   
FCIXNFC  EQU   X'10'               .  Exclude non-foreign curr trans.           
FCIOKREV EQU   X'04'               .  Okay to reverse sort record               
FCNEWGL  EQU   X'02'               .  On new GL                                 
FCIFOUND EQU   X'01'               .  found foreign curr on trans.              
*                                                                               
CUROPT   DS    CL1                 TO PREFORM PARSE ENTRIES FROM CURTAB         
PARSEALL DS    CL1                 PARSE ALL DATA                               
PARJOBRC DS    XL1                 PARSE COLUMN FOR JOBBER COL OUTPUT           
*                                                                               
LOADMODE DS    XL1                                                              
LOADINT  EQU   X'80'               INITIALIZE TABLES                            
LOADRSET EQU   X'40'               .  RESET ADDRESSES                           
LOADCLR  EQU   X'20'               .  CLEAR AREA                                
LOADFREE EQU   X'10'               .  FREE AREA UP                              
*                                                                               
PRSNSTAT DS    CL1                 CURRENT PERSONS LOCATION STATUS              
*                                                                               
EXPSTAT  DS    XL1                 EXPENSE STATUS                               
EXPNCOST EQU   X'01'               .  NEW COST                                  
*                                                                               
ACREVSG  DS    0CL5                GB/GP - Reverse sign for level               
COSTPST  DS    0CL5                SE    - Cost postings Y/N                    
ANALCLI  DS    CL5                 1R    - Analysis code for ledger 14          
CURLDGR  DS    AL4                                                              
*                                                                               
BUDSW    DS    XL1                                                              
BUDPUT   EQU   X'80'               .  FLAG TO PUT BUD. TO SORTER OR NOT         
BUDDATA  EQU   X'40'               .  DATA IN CALENDARS                         
BUDELMS  EQU   X'20'               .  ELEMENT LEFT ON BUDGET RECORD             
BUDFPED  EQU   X'10'               .  Post full period, no hire/term            
BUDONCE  EQU   X'01'               .  Do this code once each time               
*                                                                               
RESET    DS    CL1                 FLAG TO RESTORE CURRENT ACC. REC.            
HIGHSEQ  DS    AL1                 HIGHEST SEQUENCE NUMBER                      
ROWHIGH  DS    AL1                 HIGHEST ROW WITH FOREIGN CUR. CODE           
SETCLR   DS    CL1                 YES/NO CLEAR PACKED                          
MULTLDG  DS    CL1                 MULTILEDGER REQUEST? (Y/N)                   
ROWSTAGE DS    XL1                 DETERMINES WHERE TO GET ROWS FROM            
*                                  .  1 1ST ROW ALWAYS FORMAT CODE              
*                                  .  2 GET FROM FORMAT RECORD                  
*                                  .  3 ELEM. POOL CREATED BY COLS              
RUNSTATE DS    CL1                 FLAG TO KEEP GOING OR NOT (Y/N)              
SKIPLINE DS    AL1                 NUMBER OF LINES TO SKIP                      
SWAPFLAG DS    CL1                 FLAG TO SEE IF WE SWAPED ANYTHING            
UDEFSRTS DS    AL1                 USER DEFINED SORT SIZE                       
UDEFDATS DS    AL1                 USER DEFINED DATA SIZE                       
UDEFSEQ# DS    AL1                 USER DEFINED SEQUENCE NUMBER                 
*                                                                               
UPSI     DS    XL1                 SPECIAL JCL FLAGS                            
UPSITRNS EQU   X'80'               .  Dump transactions                         
UPSISRTI EQU   X'40'               .  Dump records input to sort                
UPSISRTO EQU   X'20'               .  Dump records output from sort             
UPSITABS EQU   X'10'               .  Dump ROW/COL tables                       
UPSIDMSJ EQU   X'08'               .  Dump sj table                             
UPSISPTR EQU   X'02'               .  Dump split records and trace              
UPSIPT56 EQU   X'04'               .  Patch phases 5 and 6                      
UPSIPT7  EQU   X'01'               .  Patch phase  7                            
*                                                                               
SORTSW   DS    XL1                 SORT ACTIVITY SWITCH                         
SORTDATA EQU   X'40'               .  Sorter data                               
SORTVPCT EQU   X'02'               .  Vertical percents                         
*                                                                               
TSARSW   DS    XL1                 TSAR ACTIVITY SWITCH                         
TSARON   EQU   X'80'               .  Tsar used                                 
TSARDATA EQU   X'40'               .  Tsar data                                 
TSARBOTH EQU   X'04'               .  Require two Tsar buffers                  
TSARGET  EQU   X'02'               .  Tsar - get record was issued              
TSARFULL EQU   X'01'               .  Tsar buffer is full                       
*                                                                               
RANKSW   DS    XL1                 RANK CONTROL SWITCH                          
RANKON   EQU   X'80'               .  Rank for this format                      
RANKOPN  EQU   X'20'               .  Rank file currently open                  
RANKGET  EQU   X'02'               .  Rank - get record was issued              
RANKRTE  EQU   X'01'               .  Rank has rate columns                     
*                                                                               
SPLITSW  DS    XL1                 SPLIT CONTROL SWITCH                         
SPLITCPY EQU   X'80'               .  Make copy of selected data                
SPLITRST EQU   X'40'               .  Restore from copy to re-process           
SPLITMLT EQU   X'02'               .  Multiple X'77' on transaction             
SPLITROK EQU   X'01'               .  Row is okay to split                      
*                                                                               
RECAPSW  DS    XL1                 RECAPING SWITCHES                            
RECAPON  EQU   X'80'               .  Recaping being used                       
RECAPMIX EQU   X'40'               .  Recaps use mixed profiles                 
RECAPMUL EQU   X'20'               .  Multiple unit/ledgers                     
RECAPFND EQU   X'10'               .  Calc max # of dwnload flds found          
RECANLYS EQU   X'01'               .  Analysis reports instead                  
*                                                                               
XCULFLAG DS    CL1                 Exclude contra unit/ledger flag              
TRNSSTAT DS    XL1                 Transaction status                           
*                                                                               
RECREAD1 DS    XL1                 RECORDS to read or process                   
RECPRSN  EQU   X'80'               .  Person record                             
RECSTUD  EQU   X'40'               .  Studio record                             
RECSTDH  EQU   X'20'               .  Standard hours                            
RECEDTH  EQU   X'10'               .  Edit hours                                
RECPEEL  EQU   X'08'               .  Peeled data                               
RECPAY$  EQU   X'04'               .  Payroll Records                           
RECCLDR  EQU   X'02'               .  Calendar records by person                
RECLOCD  EQU   X'01'               .  Location data                             
*                                                                               
RECREAD2 DS    XL1                 RECORDS to read or process                   
RECTHRS  EQU   X'80'               .  Total hours records                       
RECALO$  EQU   X'40'               .  Allocated dollars                         
RECALRT  EQU   X'20'               .  Allocated rates                           
RECAUTH  EQU   X'10'               .  Authorization records                     
RECPVND  EQU   X'08'               .  Production Vendor                         
RECPRCV  EQU   X'04'               .  Production Receivable                     
REC99WC  EQU   X'02'               .  Pre-Read 99 billing trans                 
RECPORD  EQU   X'01'               .  Read Purchase Orders recs                 
*                                                                               
RECREAD3 DS    XL1                 RECORDS to read or process                   
RECTAX2C EQU   X'80'               .  Read 2C tax record                        
*&&US                                                                           
RECTMAUD EQU   X'40'               .  Read TMS audit records                    
*&&                                                                             
RECTMLM  EQU   X'20'               .  Read TMS line manager records             
RECPOAP  EQU   X'10'               .  Read Order audit record                   
RECAEXRD EQU   X'08'               .  Read account extension record             
RECAESTS EQU   X'04'               .  Read for estimate records on job          
RECXDATA EQU   X'02'               .  Read for xdata on transaction             
*                                                                               
CURIND   DS    XL1                 Transaction status 1                         
CURBILCR EQU   X'80'               .  Billed cr only (PROD)                     
CURICP   EQU   X'40'               .  Inter-company postings                    
CURBILPD EQU   X'20'               .  Billed amount pending                     
CURRETL  EQU   X'04'               .  Retail billing  (PROD)                    
CURINCHG EQU   X'02'               .  Internal charge (PROD)                    
CURACTV  EQU   X'01'               .  Last bill (not always set)                
*                                        to use REC99WC must be on              
POIND    DS    XL1                 Purchase order indicator                     
POITRN   EQU   X'80'               .  PO type trans with WC=**                  
POI#ON   EQU   X'40'               .  PO# on any transaction                    
POIFULL  EQU   X'20'               .  PO fully match (closed)                   
POIPART  EQU   X'10'               .  PO partially matched                      
POIPRSTO EQU   X'08'               .  PO from PRESTO                            
POEBUYER EQU   X'04'               .  PO from Ebuyer (BrandOcean)               
*                                                                               
CURBILTY DS    CL1                 CURRENT TRANSACTION BILL TYPE                
CURWKCD  DS    CL2                 CURRENT WORK CODE                            
CURWCTY  DS    CL1                 CURRENT WORKCODE TYPE                        
CURITMC  DS    CL4                 Current ITEM Code                            
CURITMD  DS    CL36                Current ITEM Description                     
CURICRAT DS    PL4                 Current ITEM Commission rate                 
CURIAPRC DS    PL6                 Current ITEM Price                           
CURIHRS  DS    PL6                 Current ITEM Hours                           
CURINAMT DS    PL6                 Current ITEM Net Amount                      
CURICAMT DS    PL6                 Current ITEM Commission amount               
CURIGAMT DS    PL6                 Current ITEM Gross amount                    
*                                                                               
GPWCTY   DS    AL1                 GROUPING WORK CODE TYPE                      
GPWCTIME EQU   1                   .  TIME TYPE                                 
GPWCOOFP EQU   2                   .  OUT OF POCKET                             
*                                                                               
GPTRAN   DS    CL1                 GROUPING TRANSACTION CR VS DR                
GPTRNDR  EQU   C'1'                .  GROUP DEBITS                              
GPTRNCR  EQU   C'2'                .  GROUP CREDITS WC=99                       
         EJECT ,                                                                
READCMP  DS    CL1                                                              
READUL   DS    CL2                                                              
READACT  DS    CL12                                                             
PREVKEY  DS    CL(ACCORFST)        PREVIOUS KEY READ BY MONACH                  
PREVLDG  DS    CL2                 PREVIOUS UNIT LEDGER                         
         SPACE 1                                                                
FINDDATA DS    CL6                 DATA CODE TO FIND IN TABLE                   
TEMPTYPE DS    CL1                 TEMP STORAGE FOR HEADING TYPE                
COUNT    DS    AL1                                                              
COUNT2   DS    AL1                                                              
*                                                                               
NEWTRAN  DS    CL1                                                              
*                                                                               
LEVLEN   DS    0XL4                ACCOUNT LEVELS                               
LEV1LN   DS    AL1                 .  ACCOUNT LEVEL 1 LENGTH                    
LEV2LN   DS    AL1                 .  ACCOUNT LEVEL 2 LENGTH                    
LEV3LN   DS    AL1                 .  ACCOUNT LEVEL 3 LENGTH                    
LEV4LN   DS    AL1                 .  ACCOUNT LEVEL 4 LENGTH                    
*                                                                               
LISTREC# DS    AL1                 NUMBER OF +/- LIST STORED                    
LEVMAX   DS    AL1                 LOWEST LEVEL                                 
TIMSAV#  DS    AL1                 # of dates of time saved records             
MAX#ACMS DS    AL1                                                              
MAX#RTES DS    AL1                                                              
TOTFORSZ DS    XL1                                                              
MINSZ    DS    XL2                                                              
*                                                                               
DATEFLT  DS    XL1                 DATE FILTERS  1                              
DATEITF  EQU   X'80'               . Interface   date           (SR)            
DATECHK  EQU   X'40'               . Check       date           (SR)            
DATEDEP  EQU   X'20'               . Deposit     date           (SR)            
DATEBIL  EQU   X'10'               . Billing     date           (SJ)            
DATESTM  EQU   X'08'               . Statement   date           (SC)            
DATEOPN  EQU   X'08'               . Job open    date           (SJ)            
DATECLS  EQU   X'04'               . Job closed  date           (SJ)            
DATEHIR  EQU   X'02'               . Hire        date           (1R)            
DATEEST  EQU   X'02'               . Estimate    date           (SJ)            
DATEXMT  EQU   X'01'               . Transmit    date           (SR,SJ)         
*                                                                               
DATEFLT2 DS    XL1                 DATE FILTERS  2                              
DATEMMOS EQU   X'80'               . Media MOS   Date         (Payable)         
DATEAPR  EQU   X'40'               . Approver    Date           (SJ)            
DATEPRE  EQU   X'20'               . Preparer    Date           (SJ)            
DATEPOAD EQU   X'10'               . PO Approval Date           (SJ)            
DATETAPR EQU   X'08'               . Timesheet approver date    (1R)            
DATETSBD EQU   X'04'               . Timesheet submitted date   (1R)            
DATETRM  EQU   X'01'               . Termination date           (1R)            
*                                                                               
DUEDTE   DS    XL3                 X'61' EL -DUE DATE OR INVOICE DATE           
ACTDTE   DS    XL3                 ACIVITY DATE         (PACKED YYMMDD)         
ACTAGE   DS    XL3                 ACIVITY DATE USED WHEN AGEING                
MOAAGE   DS    XL3                 MOA DATE USED WHEN AGEING                    
TRSAGE   DS    XL3                 TRANSACTION DATE WHEN AGEING PAYABLE         
XCRDTE   DS    XL3                 SPECIAL CREDIT DATE BASED ON                 
*                                  DEPOSIT/WRITE-OFF/OFFSET/TRANS DATE          
TRANDTE  DS    XL3                 TRANSACTION DATE     (PACKED YYMMDD)         
MOADTE   DS    XL3                 MOS DATE FORM MONACC (PACKED YYMM01)         
BILLDTE  DS    XL3                 BILLED DATE    X'77' (PACKED YYMMDD)         
BMOADTE  DS    XL3                 BILLED MOA DATE      (PACKED YYMM01)         
WROFDTE  DS    XL3                 WRITE-OFF DATE X'77' (PACKED YYMMDD)         
WMOADTE  DS    XL3                 WRITE-OFF MOA DATE   (PACKED YYMM01)         
TRFRDTE  DS    XL3                 TRANSFER DATE  X'77' (PACKED YYMMDD)         
TMOADTE  DS    XL3                 TRANSFER MOAD DATE   (PACKED YYMM01)         
AL$MOA   DS    XL3                 ALLOCATED MOA        (PACKED YYMM01)         
RSTADTE  DS    XL3                 QSTART               (PACKED YYMMDD)         
RENDDTE  DS    XL3                 QEND                 (PACKED YYMMDD)         
*                                                                               
XP#LINES DS    XL1                 NUMBER OF XP LINES TO PRINT                  
*                                                                               
PRTCNTRL DS    XL1                 Print Control                                
PRTSOR   EQU   X'80'               .  Start Of Report                           
PRTEOR   EQU   X'40'               .  End   Of Report                           
PRTSRT2  EQU   X'02'               .  Use A(PRVWRK) for now                     
*                                                                               
DETMAX   DS    XL1                 LAST POSSIBLE LINE TO PRINT DETAIL           
ADDRSZ   DS    XL1                 LENGTH OF SORCE DATA ADDRESS                 
XLINES   DS    XL1                 X NUMBER OF LINES TO PRINT                   
NFRMTS   DS    XL1                 NUMBER OF FORMATS IN TABLE                   
NDECIMAL DS    XL1                 DEFAULT TO N DECIMALS                        
ROUNDTO  DS    CL1                 DEFAULT ROUND TO SOME $'S                    
NEGCHAR  DS    CL2                 EDIT MINUS AMOUNTS WITH DR OR CR             
*TEFORM  DS    XL1                 DATE TO CONVERT END DATE TO                  
*TEFORM  DS    XL(DATELNQ)         DOWNLOAD DATE INFO                           
*                                                                               
DWNMODE  DS    AL1                 DOWN-LOAD MODE:                              
DWNINIT  EQU   1                   .  Down-load initialization                  
DWNEOL   EQU   2                   .  Mark end of line                          
DWNEOR   EQU   3                   .  Mark end of report                        
DWNTEXT  EQU   4                   .  Down-load text                            
DWNPACK  EQU   5                   .  Down-load number (PACKED)                 
DWNTOTR  EQU   6                   .  Down-load total trailer                   
*                                                                               
DWNOPT1  DS    XL1                 DOWN-LOAD SWITCHES FOR THIS JOB              
DWNGO    EQU   X'80'               .  Down-load on                              
DWNNODEC EQU   X'40'               .  Down-load no decimals                     
DWNCHOP  EQU   X'20'               .  Down-load fixed length data               
DWNLEADM EQU   X'10'               .  Down-load leading minus                   
DWNHEAD  EQU   X'08'               .  Down-load Heads                           
DWNROWS  EQU   X'04'               .  Down-load Rows option                     
DWNSPDTE EQU   X'02'               .  Down-load date as YYMMDD                  
DWNTXT#  EQU   X'01'               .  Down-load numbers as text                 
*                                                                               
DWNOPT2  DS    XL1                                                              
DWNTOTS  EQU   X'80'               .  Down-load totals                          
DWN#PAD  EQU   X'40'               .  Down-load #'S w/ leading zeros            
DWNFTP   EQU   X'20'               .  Down-load File Transfer Protocal          
DWNLEFTJ EQU   X'10'               .  Down-load Left justify numbers            
DWNDUMF  EQU   X'08'               .  Down-load Dummy field (blank/0)           
DWNFSTL  EQU   X'04'               .  First line Down-loaded                    
DWNDSN   EQU   X'02'               .  Transmit dataset through EDICT            
DWNCONT  EQU   X'01'               .  More to print for field                   
*                                                                               
DWNOPT3  DS    XL1                                                              
DWNTBDE  EQU   X'80'               .  Transmit dataset via BDE                  
DWNTUSS  EQU   X'40'               .  Transmit dataset via USS                  
DWNTEDI  EQU   X'20'               .  Transmit dataset via EDIHUB               
DWNFDWN  EQU   X'10'               .  Force down-load                           
DWNFDSDN EQU   X'08'               .  DSN down-load file                        
DWNXHDR  EQU   X'04'               .  Down-load extended headers                
DWNXTTR  EQU   X'02'               .  Down-load extended total trailer          
DWNXTRL  EQU   X'01'               .  Down-load extended trailer                
*                                                                               
DWNOPT4  DS    XL1                                                              
DWNNRQPG EQU   X'80'               .  NO RQUEST PAGE FOR USS/EDIHUB             
DWNMSFTP EQU   X'40'               .  SEND REPORT TO MS SFTP SERVER             
*                                                                               
DWTOTST  DS    XL1                 DOWN-LOAD TOTALS STATUS SWITCHES             
DWTNEWLI EQU   X'80'               .  NEED NEW LINE                             
DWTTFOR  EQU   X'40'               .  NEED "TOTALS FOR"                         
DWTTREQ  EQU   X'20'               .  NEED "TOTALS FOR REQUEST"                 
DWTROWBL EQU   X'10'               .  NEED ROW FIELDS TO BE BLANK               
*                                                                               
DWNFLDD  DS    CL1                 FIELD SEPERATOR                              
DWNTXTD  DS    CL1                 TEXT DELIMITER                               
DWNEOLD  DS    CL1                 END OF LINE DELIMITER                        
DWNEORD  DS    CL1                 END OF REPORT DELIMITER                      
*                                                                               
PARDATE  DS    XL1                                                              
*                                  COLUMN HEADINGS                              
PREVACT  DS    CL15                PREVIOUS ACCOUNT                             
WCSHORT  DS    CL15                WORK CODE SHORT NAME                         
WCLONG   DS    CL36                WORK CODE LONG NAME                          
ACCBAL   DS    PL(PKLEN)           ACCOUNT BALANCE                              
TRNSTOT  DS    PL(PKLEN)           TRANSACTION TOTAL FOR KEY                    
TRNSCRD  DS    PL(PKLEN)           TRANSACTION CR FOR KEY                       
TRNSDEB  DS    PL(PKLEN)           TRANSACTION DR FOR KEY                       
TRNSAMT  DS    PL(PKLEN)           TRANSACTION AMOUNT FOR KEY                   
TRNSAGE  DS    PL(PKLEN)           TRANSACTION AMOUNT FOR AGEING                
*&&UK                                                                           
TRNSPLB  DS    PL(PKLEN)           TRANSACTION AMOUNT FOR PL BALANCE            
*&&                                                                             
CURFCAMT DS    PL(PKLEN)           TRANS AMT. IN FOREIGN CURRECNY               
CURFCAGE DS    PL(PKLEN)           FOREIGN CURRECNY AMT. FOR AGEING             
BUDACCKY DS    CL15                                                             
DWN#FLDS DS    XL1                 # of fields downloaded on line               
FND#FLDS DS    XL1                 Max number of cols in any format             
BUDAMT   DS    PL6                                                              
STATMASK DS    X                   MASK FOR HELD, QUERIED or CLEARED            
STATBRCH DS    X                   BRANCH CONDITION TO TAKE                     
GROUP#   DS    XL1                 Count from 16 to 31, group 1 is 16           
TABIND   DS    XL1                 Table indicators                             
TABXTRN  EQU   X'80'               .  Built external tables                     
*&&US                                                                           
TABGBMOS EQU   X'40'               .  Built GB MOS tables                       
*&&                                                                             
SVENDTE  DS    XL3                 YMD packed                                   
*                                                                               
POSTLVL2 DS    XL1                 POST LEVEL BASED ON KEYWORDS                 
POSTCLP  EQU   X'80'               .                                            
POSTACLP EQU   X'40'               .                                            
POSTCIND EQU   X'20'               .                                            
POSTDALY EQU   X'08'               . DAILY TIME KEYWORD                         
POSTTMI  EQU   X'04'               . TIME/MATERIAL ITEM KEYWORDS                
POSTCAC  EQU   X'02'               . CONTRA A/C KEYWORDS                        
*                                                                               
ACTIVITY DS    XL1                 ACCOUNT ACTIVITY                             
ACTTRNS  EQU   X'80'               .  Transaction activity                      
ACTACCT  EQU   X'40'               .  Account     activity                      
ACTEST   EQU   X'20'               .  Estimate    activity                      
ACTPAYR  EQU   X'10'               .  Payroll     activity                      
*                                                                               
MODEIND  DS    XL1                 MODE STATE (BETWEEN A MODE)                  
MODEONCE EQU   X'80'               .  Process only once per mode                
MODEPASS EQU   X'40'               .  Have we been here for mode                
*                                                                               
POSTMODE DS    XL1                 POSTING MODE FOR RECORDS                     
POSTNUL  EQU   X'80'               .  Posting seed account                      
POSTTRN  EQU   X'40'               .  Posting transaction                       
POSTCPO  EQU   X'20'               .  Posting client POs                        
POSTBUD  EQU   X'10'               .  Posting budget                            
POSTJBR  EQU   X'08'               .  Posting estimate jobber detail            
POSTBKT  EQU   X'04'               .  Posting buckets                           
POSTTOT  EQU   X'02'               .  Posting total report record               
POSTVRT  EQU   X'01'               .  Posting vertical percent                  
*                                                                               
POSTLVL  DS    XL1                 POST LEVEL BASED ON KEYWORDS                 
POSTACC  EQU   X'80'               .  Make postings at account                  
POSTHST  EQU   X'40'               .  Make postings at bucket/history           
POSTDET  EQU   X'20'               .  Make postings at transaction              
POSTCLR  EQU   X'10'               .  Clear record area to post                 
POSTSPLT EQU   X'08'               .  Posting split detial                      
POSTITM  EQU   X'04'               .  Posting by ITEM                           
POSTAITM EQU   X'02'               .  Postings already made by ITEM             
*                                                                               
SEEDMODE DS    AL1                 WHAT KIND OF RECORD TO SEED FOR              
SEEDLVL  EQU   1                   .  Account levels                            
SEEDACC  EQU   2                   .  Account                                   
SEED1N   EQU   3                   .  1N Contras for time sheet edit            
SEEDHRS  EQU   4                   .  STD/EDIT Hours in COST                    
SEEDCLI  EQU   5                   .  SJ Cli/Prd with F2=T for COST             
SEEDAGE  EQU   6                   .  SJ Ageing report (Production)             
SEEDBFW  EQU   7                   .  Balance forward by Office/Acct            
SEEDPBIL EQU   8                   .  Process prior bill amount                 
SEEDPEDT EQU   9                   .  Special PE dates                          
SEEDPOA  EQU   10                  .  BrandO purchase ord approver info         
*                                                                               
SAVEMODE DS    XL1                                                              
SAVELVL  DS    XL1                                                              
PRTSIZE  DS    XL1                 PRINT SIZE                                   
OFFSEC   DS    XL1                 CLIENT/PERSON OFFICE SECURITY                
AGECOL#  DS    XL1                 NUMBER OF AGEING COLUMNS                     
AGEMTHD  DS    CL1                 AGEING METHOD                                
CURMTHD  DS    XL1                                                              
CURBUCK  DS    XL1                                                              
*                                                                               
CURCREQ  DS    CL(L'CPYCURR)       REQUESTED CURRENCY                           
PRVFCCDE DS    CL3                                                              
CURFCCDE DS    0CL3                                                             
CURFCBLK DS    CL(CURTABL+L'CURTLONG)                                           
         SPACE 1                                                                
*********************** START OF DEFAULT BLOCK ************************         
DFTBLK1  DS    0CL(DFTEND-DFTCLI)                                               
DFTCLI   DS    CL6                 Defualt client                               
DFTPRD   DS    CL6                 Default product                              
*&&US                                                                           
DFTJOB   DS    CL6                 Default job (US)                             
*&&                                                                             
*&&UK                                                                           
DFTJOB   DS    CL7                 Default job (UK)                             
*&&                                                                             
DFTEST   DS    CL3                 Default estimate                             
DFTSMC   DS    0CL2                Default system/media code                    
DFTSYC   DS    CL1                                                              
DFTMDC   DS    CL1                                                              
DFTMMOS  DS    CL3                 Default media MOS                            
DFTEND   DS    0C                                                               
************************ END OF DEFAULT BLOCK *************************         
         SPACE 1                                                                
CURACC   DS    CL15                CURRENT ACCOUNT                              
CURSUBAC DS    CL15                CURRENT CONTRA ACCOUNT                       
CUROFF   DS    CL2                 CURRENT OFFICE                               
CURCOFF  DS    0CL2                CURRENT CLIENT   OFFICE (1R)                 
CURANOF  DS    CL2                 CURRENT ANALYSIS OFFICE                      
         SPACE 1                                                                
*********************** START OF CURRENT BLOCK ************************         
CURSJ    DS    CL2                 JUST UNIT/LEDGER SJ                          
CURBLK1  DS    0CL(CUREND-CURSJACC)                                             
CURSJACC DS    CL12                CLI/PROD/JOB                                 
CUREST   DS    CL3                 CURRENT ESTIMATE                             
CURSTAT  DS    XL1                 CURRENT STATUS  (HELD/QUERIED)               
CURQURD  EQU   X'80'               .  QUIERED    ITEM              RL           
CURSVED  EQU   X'80'               .  SAVED TIME ITEM              1L           
CURVOID  EQU   X'80'               .  VOID       ITEM              BL           
CURAUTH  EQU   X'80'               .  AUTH ITEM                 VL/PL           
CURCSHD  EQU   X'40'               .  CASH DISCOUNT                RL           
CURWOFF  EQU   X'40'               .  WRITE-OFF VIA CBILL TY34     VL           
CURREVL  EQU   X'20'               .  REVERAL                      ??           
CURADJT  EQU   X'20'               .  ADJUSTED ITEM CBILL TY34     VL           
CURBILL  EQU   X'10'               .  BILLED                       VL           
CURPBIL  EQU   X'08'               .  PARTIAL BILLED               VL           
CURCLRD  EQU   X'08'               .  CLEARED ITEM                 RL           
CURTMPO  EQU   X'08'               .  TEMPO ITEM                   1L           
CURHELD  EQU   X'04'               .  HELD ITEM                    RL           
CURCOMM  EQU   X'02'               .  COMMISSIONABLE               VL           
CURRCON  EQU   X'02'               .  RECONCILED  ITEM             BL           
CURNONC  EQU   X'01'               .  NON-COMMISSIONABLE           VL           
*                                                                               
CURXSTA1 DS    XL1                 EXTENDED STATUS BYTE 1                       
CURXSTA2 DS    XL1                 EXTENDED STATUS BYTE 2                       
CURTIME  DS    C                   B /N / R TIME CHARACTER                      
CURSMC   DS    0CL2                                                             
CURSYC   DS    CL1                                                              
CURMDC   DS    CL1                                                              
CURMMOS  DS    CL3                 Current media MOS                            
CUREND   DS    0C                                                               
*********************** END OF CURRENT BLOCK **************************         
         SPACE 1                                                                
CURPAYCD DS    AL1                 CURRENT PAYCODE                              
CURAPRV  DS    CL1                 APPROVED                 YES/NO              
*&&US                                                                           
CURAPRB  DS    XL1                 WHO APPROVED 01=AA 02=MARKER                 
*&&                                                                             
CUROFST  DS    CL1                 OFFSET                   YES/NO              
CURURGT  DS    CL1                 URGENT                   YES/NO              
CURPRCLV DS    CL1                 CURRENT PRICE LEVEL                          
CURSTTY  DS    CL4                 CURRENT STUDIO TYPE                          
CURRECON DS    CL1                 RECONCILED ITEM          YES/NO              
CURAUTH2 DS    CL1                 AUTH STATUS              AUTH/UNAUTH         
*&&UK                                                                           
CURBOSTS DS    XL1                 BRANDOCEAN INVOICE STATUS                    
*&&                                                                             
CURAMT   DS    PL(PKLEN)           CURRENT BUDGET AMOUNT                        
CURPED#  DS    XL1                 CURRENT PERIOD NUMBER                        
CURBILLT DS    XL1                 CURRENT BILL TYPE - (I, C) FOR SR            
CURPRTY  DS    XL1                 DESKTOP PRIORITY - UK ONLY                   
CURAPEST DS    CL1                 APPROVED ESTIMATE YES/NO - UK ONLY           
CURBRTST DS    CL1                 TIME STATUS FOR BRANDOCEAN (1L,VL)           
*&&US                                                                           
CURAPPR  DS    XL2                 Current BrandO approver of tms line          
CURAPPRD DS    PL3                 Current BrandO approver date                 
CURSBMTR DS    XL2                 Submitter PID                                
CURSUBDT DS    PL3                 Current BrandO submit date                   
         DS    CL8                                                              
*&&                                                                             
CURLNMGR DS    XL2                 Current BrandO line manager                  
*&&UK                                                                           
CURJLOCK DS    XL1                 JOB LOCK STATUS                              
CURJLESQ EQU   X'80'               - LOCKED FROM ESTIMATES                      
CURJLORQ EQU   X'40'               - LOCKED FROM ORDERS                         
CURJLBIQ EQU   X'20'               - LOCKED FROM BILLING                        
CURJLTIQ EQU   X'10'               - LOCKED FROM TIMESHEETS/INTERNAL            
CURJLADQ EQU   X'08'               - LOCKED FROM ADJUSTMENTS                    
CURJLEXQ EQU   X'04'               - LOCKED FROM EXTERNAL POSTINGS              
CURJLANQ EQU   X'01'               - LOCKED FROM ANY ABOVE                      
CURMSTJB DS    CL12                Master job                                   
CURVATRG DS    CL1                 VAT Region                                   
CURETYPE DS    CL3                 CURRENT EXPENDITURE TYPE                     
*&&                                                                             
CURLCNO  DS    CL3                 CURRENT LOCAL ESTIMATE NUMBER                
CURESGLB DS    CL6                 CURRENT GLOBAL ESTIMATE NUMBER               
*                                                                               
CURPODET DS    XL(POLNQ)           Current PO details (See POD   DSECT)         
CURPOWC  DS    XL(POWCLNQ)         Current PO WC      (See POWCD DSECT)         
*                                                                               
CURXPBLK DS    0CL(14*CURXPLN)     ANALYSIS POINTERS FOR EXPENSE                
CURVNDR  DS    CL14                .  VENDOR ACCOUNT         - SV,SX,SY         
CURCOST  DS    CL14                .  COST ACCOUNT           - 1C               
CURBLNG  DS    CL14                .  BILLING                - 11               
CURREVN  DS    CL14                .  REVENUE                - 12               
CURDEXP  DS    CL14                .  DIRECT EXPENSE ACCOUNT - 13               
CURDLBR  DS    CL14                .  DIRECT LABOR   ACCOUNT - 14               
CURDEPT  DS    CL14                .  DEPARTMENT ACCOUNT     - 2D               
CURPRSN  DS    CL14                .  PERSON ACCOUNT         - 2P               
CURCEA   DS    CL14                .  CLIENT EXPENSE ACCOUNT - 29               
CURPART  DS    CL14                .  PARTICIPANT ACCOUNT    - 3A-3Z            
CURVAT   DS    CL14                .  VAT ACCOUNT            - SG               
CURXPLN  EQU   (*-CURVNDR)/14                                                   
*                                                                               
CNTRALVS DS    0CL(14*CNTRLN)      CONTRA ACCOUNT LEVELS                        
CNTRALV1 DS    CL14                .  CONTRA LEVEL 1                            
CNTRALV2 DS    CL14                .  CONTRA LEVEL 2                            
CNTRALV3 DS    CL14                .  CONTRA LEVEL 3                            
CNTRALV4 DS    CL14                .  CONTRA LEVEL 4                            
CNTRLN   EQU   (*-CNTRALV1)/14                                                  
*                                                                               
SUBTTYP  DS    XL1                 Current Sub-transaction type                 
REALTYP  DS    XL1                 Current Transaction     type                 
RECXSRT  DS    XL(RECXDQ)          Current sort  record info                    
PRVXSRT  DS    XL(RECXDQ)          Previous sort record info                    
*                                                                               
DTEIDX#  DS    XL1                 CURRENT DATE HEADING INDEX ENTRY             
         EJECT 1                                                                
ESTIND   DS    XL1                 Indicator for reading estimate data          
ESTRORG  EQU   X'80'               .  READ ORIGINAL ESTIMATE RECORD             
ESTRCUR  EQU   X'40'               .  READ CURRENT  ESTIMATE RECORD             
ESTRGES  EQU   X'20'               .  READ CURRENT GROSS ESTIMATE               
ESTRHR   EQU   X'10'               .  READ HIGHEST REV   ESTIMATE               
ESTJSTAT EQU   X'08'               .  NEED TO GET JOB EST STATUS                
ESTPRN   EQU   X'04'               .  NEED TO GET PLANNING/REV # DATA           
ESTNOS   EQU   X'02'               .  GET ESTIMATES NUMBERS FOR JOB             
ESTHRS   EQU   X'01'               .  GET ESTIMATE HOURS/RATES FOR JOB          
*                                                                               
ESTIND2  DS    XL1                 Indicator for estimate job status            
ESTNDAPP EQU   X'08'               .  ESTIMATE NEEDS APPROVAL                   
ESTHVEST EQU   X'04'               .  HAVE AN ESTIMATE                          
ESTNDEST EQU   X'02'               .  NEED AN ESTIMATE                          
ESTUNAPP EQU   X'01'               .  ESTIMATE UNAPPROVAL                       
*                                                                               
ESTIND3  DS    XL1                 Indicator for reading estimate data          
ESTONTX  EQU   X'01'               .  ESTIMATE ON TRANSACTION                   
*                                                                               
PARCNTRL DS    XL1                 Parse control indication                     
PARBYWC  EQU   X'80'               .  Parse %Est by workcode                    
PARTVND  EQU   X'40'               .  True vendor account                       
         SPACE 1                                                                
PRSNOFF  DS    CL2                 PERSON OFFICE   CODE                         
PIDCODE  DS    CL8                 PERSON ID FOR REQUEST                        
PERAUTH# DS    XL2                 PERSON AUTHORIZATION NUMBER                  
SECPSWD# DS    XL2                 PERSON PASSWORD CODE                         
SECALPHA DS    CL2                 SECURITY ALPHA  CODE                         
SECGROUP DS    XL2                 SECURITY ACCESS GROUP                        
SECKYW#1 DS    XL1                                                              
         DS    XL3                 (RESERVED FOR NOW)                           
SECPRF#5 DS    XL1                                                              
         DS    XL3                 (RESERVED FOR NOW)                           
TEMPAREA DS    0CL132                                                           
TEMP1    DS    CL64                                                             
TEMP2    DS    CL64                                                             
BRANDBUF DS    CL(BRANDLNQ)                                                     
*                                                                               
MPGFLD   DS    CL2                 MEDIA PRODUCT GROUP (PC/PN)                  
TEMPOFF  DS    CL2                 OFFICE CODE FOR RETRIEVING NAME              
         EJECT ,                                                                
***********************************************************************         
*  STATIC DATA SET UP IN INITDATA                                     *         
***********************************************************************         
         SPACE 1                                                                
OFFTYPE  DS    CL1                 SPECIFIC OFFICE TYPE                         
OFFTYTRN EQU   C'T'                .  OFFICE IS IN TRANSACTION ELEMENT          
OFFTYKEY EQU   C'K'                .  OFFICE IS IN ACCOUNT KEY                  
OFFTYFLT EQU   C'F'                .  OFFICE IS IN FILTER                       
OFFTYCLI EQU   C'C'                .  OFFICE IS IN CLIENT RECORD                
*                                                                               
FLTRS    DS    0CL5                FILTERS 1-5                                  
FLTR1    DS    CL1                 .  Filter 1 value                            
FLTR2    DS    CL1                 .  Filter 2 value                            
FLTR3    DS    CL1                 .  Filter 3 value                            
FLTR4    DS    CL1                 .  Filter 4 value                            
FLTR5    DS    CL1                 .  Filter 5 value                            
*                                                                               
FLTNAMES DS    0CL150              Filter 1-5    names                          
FLTNAME1 DS    CL30                .  Filter 1   name                           
FLTNAME2 DS    CL30                .  Filter 2   name                           
FLTNAME3 DS    CL30                .  Filter 3   name                           
FLTNAME4 DS    CL30                .  Filter 4   name                           
FLTNAME5 DS    CL30                .  Filter 5   name                           
*                                                                               
REVSIGN  DS    0C                  GB/GP  reverse sign (Compound value)         
COSTING  DS    0C                  SE costing posting  (Compound value)         
ANALFLT  DS    CL1                 1R/14 Anslysis code (Compound value)         
         EJECT ,                                                                
DATE#8   DS    CL8                 US/UK/GR   DATCON  #8 DATE TYPE              
ALTNSTR  DS    XL3                 Altername  start date (PACKED)               
ALTNEND  DS    XL3                 Alternate  end   date (PACKED)               
INTRSTR  DS    XL2                 Interface  start date (COMPRESSED)           
INTREND  DS    XL2                 Interface  end   date (COMPRESSED)           
HIREDTE  DS    XL3                 Hired            date                        
TERMDTE  DS    XL3                 Terminated       date                        
STMTDTE  DS    XL3                 Statement date                               
RQS_EST  DS    XL3                 Est start Appr or Prep date                  
RQE_EST  DS    XL3                 Est start Appr or Prep date                  
BAT55DTE DS    XL3                                                              
BAT55MOS DS    XL2                                                              
SAVEDATE DS    XL3                                                              
SAVEMOS  DS    XL2                 SAVE MOS FOR TRANSACTION                     
*                                                                               
RMOADTE  DS    0XL4                REQUESTED MOA DATE                           
RMOASTR  DS    XL2                 .  START MOA YYMM     (PACKED)               
RMOAEND  DS    XL2                 .  END   MOA YYMM                            
*                                                                               
RMOAALT  DS    0XL4                ALTERNATE MOA DATE                           
RMOAALTS DS    XL2                 .  START MOA YYMM                            
RMOAALTE DS    XL2                 .  END   MOA YYMM                            
*                                                                               
RTRNDTE  DS    0XL6                REQUESTED TRANSACTION DATE                   
RTRNSTR  DS    XL3                 .  START DATE  YYMMDD (PACKED)               
RTRNEND  DS    XL3                 .  END   DATE  YYMMDD                        
*                                                                               
RQMMOS   DS    0XL6                REQUESTED MEDIA MOS DATES                    
RQMMOSST DS    XL3                 .  START DATE  YYMMDD (PACKED)               
RQMMOSEN DS    XL3                 .  END   DATE  YYMMDD                        
*                                                                               
RQCALSTR DS    XL2                 CALENDAR START MONTH  (PACKED)               
RQCALEND DS    XL2                 CALENDAR END   MONTH                         
RQRELEND DS    XL3                 REQUEST RELATIVE DATE (PACKED)               
TEMPDATE DS    CL6                 ANY                                          
DTE1     DS    CL6                 YYMMDD                (EBCDIC)               
DTE2     DS    CL6                 YYMMDD                (EBCDIC)               
PAYDATE  DS    0XL3                                                             
TEMPEDTE DS    XL3                                                              
TEMPMOS  DS    XL2                                                              
STDATE   DS    XL3                 YYMMDD                (BINARY)               
ENDATE   DS    XL3                 YYMMDD                (BINARY)               
TDDATE   DS    XL3                 TODAY'S DATE          (PACKED)               
DAT2PRT  DS    CL6                 YYMMDD                (EBCDIC)               
STARTYR  DS    XL3                 RELITIVE START DATE, BINARY                  
*                                                                               
DISDATE  DS    XL2                 Disbursement MOA date                        
DISMON   DS    XL3                 Disbursement Month    (PWOS)                 
*                                                                               
RQACTSTR DS    XL3                 packed yymmdd, activity start                
RQACTEND DS    XL3                 packed yymmdd, activity end                  
*                                                                               
RELEND   DS    0XL3                RELATIVE END DATE, BINARY                    
RELYEAR  DS    XL1                 .  BINARY YEAR                               
RELMON   DS    XL1                 .  BINARY MONTH                              
RELDAY   DS    XL1                 .  BINARY DAY                                
*                                                                               
RELEND2  DS    XL3                 RELATIVE END DATE     (PACKED)               
RELCSYR  DS    XL2                 CALENDAR YYMM                                
RELCEYR  DS    XL2                                                              
RELSPER# DS    XL1                 CALENDAR REQUEST START PERIOD                
RELEPER# DS    XL1                 CALENDAR REQUEST END   PERIOD                
RELCDATE DS    XL3                 CALENDAR RELATIVE PERIOD BASIS               
*                                                                               
REQIND   DS    XL1                 Request based indicators                     
REQIDTE  EQU   X'80'               .  Change dates across calendars             
REQPERD  EQU   X'40'               .  Request was period based                  
REQCMTH  EQU   X'20'               .  Request was calendar month based          
REQAUTH  EQU   X'10'               .  Requested by authorization                
REQDDS   EQU   X'02'               .  Request made from DDS terminal            
REQRLP   EQU   X'01'               .  RLP request                               
*                                                                               
CURQTR   DS    XL1                 1-4 Binary current quarter                   
*                                                                               
THRSW    DS    XL1                 TOTAL HOUR RECORD SWITCH                     
THRREC   EQU   X'80'               .  use total hour record                     
THRDET   EQU   X'40'               .  read transaction/tms details              
THRLST   EQU   X'20'               .  process in ACCLAST mode                   
THRP$A   EQU   X'10'               .  Adjusted payroll keywords used            
THRGFP   EQU   X'08'               .  gloabal filter dependent                  
THRCFP   EQU   X'04'               .  column  filter dependent                  
THR2BIG  EQU   X'02'               .  sort key too big to use THRLST            
THRON    EQU   X'01'               .  at least 1 format has keyword             
*                                                                               
ADJYR    DS    XL1                                                              
FSCLMONB DS    XL1                 Fiscal month in binary form                  
FSCLMONP DS    XL1                 Fiscal month in packed form                  
         EJECT ,                                                                
RLLANG   DS    CL(L'RCLANG)                                                     
KEYWRD#  DS    XL2                 DICTIONARY VALUE OF KEYWORD                  
XDATA    DS    XL1                 XTRA DATA ASSOCIATED WITH KEYWORD            
SAVENUM  DS    XL1                                                              
ANSWER   DS    PL(PKLEN)           ANSWER FROM EVALUATION                       
OP1      DS    PL16                                                             
OP2      DS    PL16                                                             
PACKAMT  DS    PL(PKLEN)                                                        
CRLMTAMT DS    PL(PKLEN)           CREDIT LIMIT AMOUNT                          
ICRLMT$  DS    PL(PKLEN)           INTERNAL CREDIT LIMIT AMOUNT                 
SAVEAMT  DS    PL(PKLEN)           CURRENT BUDGET AMOUNT                        
PKZERO   DS    PL1                 P'0'                                         
PKONE    DS    PL1                 P'1'                                         
PKNEG    DS    PL1                 P'-1'                                        
SVWORKC  DS    CL2                 Hold area for workcode (setitm)              
***********************************************************************         
* BRANDOCEAN ESTIMATE STATUS EQUATES                                  *         
***********************************************************************         
         SPACE 1                   BRANDOCEAN ESTIMATE STATUSES                 
PRGRSS   EQU   C'P'                IN PROGRESS                                  
SUBINA   EQU   C'B'                SUBMITTED TO INTERNAL APPROVER               
INTAPP   EQU   C'I'                INTERNALLY APPROVED                          
SUBCLI   EQU   C'S'                SUBMITTED TO CLIENT APPROVER                 
CLIAPP   EQU   C'A'                CLIENT APPROVED                              
REJCTD   EQU   C'R'                REJECTED                                     
DELTED   EQU   C'D'                DELETED                                      
MERGD    EQU   C'M'                MERGED                                       
         SPACE 1                                                                
BESTAS   DS    XL1                                                              
BESALL   EQU   X'FF'               All statuses                                 
BESPRG   EQU   X'80'             P In progress                                  
BESSIN   EQU   X'40'             B Submitted to internal approver               
BESIAP   EQU   X'20'             I Internally approved                          
BESSCL   EQU   X'10'             S Submitted to client approver                 
BESCAP   EQU   X'08'             A Client approver                              
BESREJ   EQU   X'04'             R Rejected                                     
BESDEL   EQU   X'02'             D Deleted                                      
BESMRG   EQU   X'01'             M Merged                                       
***********************************************************************         
CBESTA   DS    XL1                 Saved current table BrO Est. status          
MEDSAVLG DS    XL1                 Saved media payable ledger                   
NXVALUES DS    XL1                 Number of XDATA value entries                
GRP#HIGH DS    AL1                 High water mark for group#                   
BYTE1    DS    XL1                 WORK SPACE                                   
BYTE2    DS    XL1                 WORK SPACE                                   
ELCODE   DS    XL1                 ELEMENT CODE TO GET                          
NPRAMS   DS    XL1                 NUMBER OF PARAMETERS FROM SCANNER            
BXCOLDSP DS    XL1                 BOX COLUMN DISPLACEMENT                      
BXCOLMSK DS    XL1                 BOX COLUMN MASK OUT COLUMNS                  
OLDMOS   DS    XL2                 OLDEST MOS OF UNBILLED DR (PROD)             
*                                                                               
THRHRS   DS    PL3                 TOTAL HOURS AMOUNT                           
THRMOS   DS    XL2                 TOTAL HOURS MOS                              
THRTDTE  DS    XL3                 TOTAL HOURS TRANSACTION DATE                 
*                                                                               
ALTSTDTE DS    XL3                 ALTERNATE START DATE (Billing cols)          
ALTENDTE DS    XL3                 ALTERNATE START DATE (Billing cols)          
*                                                                               
ALTREL   DS    0XL3                ALTERNATE RELATIVE DATE                      
ALTRLYR  DS    XL1                 .  YY - YEAR                                 
ALTRLMON DS    XL1                 .  MM - MONTH                                
ALTRLDAY DS    XL1                 .  DD - DAY                                  
*                                                                               
ALTCURQT DS    XL1                                                              
ALTADDDT DS    CL6                 EBCDIC                                       
REQLOCST DS    XL1                 REQUEST   TRANSLATED VALUE                   
REQLOCCC DS    XL1                 CON-CODE, EITHER BE OR BNE                   
*                                                                               
DWNROWPS DS    XL1                 DOWN-LOAD ROW  PRINT SIZE                    
RADPRTSZ DS    XL1                 ROW  ADDRESS   PRINT SIZE                    
RAD#LDWN DS    XL1                 NUM  OF   ROW  ADDR  LINES- DOWNLOAD         
PARSAVUL DS    CL2                 SAVE U/L  FOR  PARSE ROUTINE                 
ACLRSBLK DS    XL1                 EXECUTE LENGTH FOR AC@RSBLK                  
*                                                                               
JBCV#OE  DS    AL1                 JBCOLVAL  FLD  NUM   FOR OE                  
JBCV#CE  DS    AL1                 JBCOLVAL  FLD  NUM   FOR CE                  
JBCV#CEG DS    AL1                 JBCOLVAL  FLD  NUM   FOR CEG                 
JBCV#HR  DS    AL1                 JBCOLVAL  FLD  NUM   FOR HR                  
JBCV#CEH DS    AL1                 JBCOLVAL  FLD  NUM   FOR CEH                 
*                                                                               
LINE2END DS    AL1                 NUMBER OF PRINT DETIAL LINE 2 END            
*                                                                               
DEBUGRT# DS    XL1                 DEBUG PRINT LOCATOR                          
DEBUGPRT DS    XL1                 DEBUG PRINT LOCATOR                          
*                                                                               
DESTID   DS    CL8                 DESTINATION LOGON ID                         
LMTSECOF DS    XL2                 Limited security office                      
         EJECT ,                                                                
TODAYC   DS    CL6                 Today as YYMMDD                              
DAYS     DS    XL2                 Days to disbursement                         
DBAL     DS    PL8                 Cashflow daily balance                       
DATAMAP# DS    AL1                 Map code processing                          
DATAMTYP DS    CL1                 Map code type of data                        
OFFPOS1C DS    CL1                 Saved 1C OFFPOS                              
TMSHOURS DS    PL3                 Hours to post by                             
*                                                                               
CFKIND   DS    X                   CASHFLOW KEYWORD INDICATOR                   
CFKCR    EQU   X'80'               .  Processed CR related amount KYW           
CFKDR    EQU   X'40'               .  Processed DR related amount KYW           
CFKDAPP  EQU   X'20'               .  Added dummy applied column                
CFKDBAPP EQU   X'10'               .  Added dummy unapplied column              
CFKPRCV  EQU   X'08'               .  Processed a Cashflow recvble KYW          
CFKDDBAL EQU   X'04'               .  Add dummy daily balance keywords          
CFKDBBAL EQU   X'02'               .  Add dummy daily bal keywords - B          
CFKBUN   EQU   X'01'               .  Billing unavailable from debit            
*                                                                               
RACTSTR  DS    XL2                 Request Activity start (comp)                
POSTCTL  DS    XL1                 Control posting of dates                     
POSTPED# EQU   X'10'               .  Need period number                        
POSTMYP  EQU   X'08'               .  Posting by period, MONTH,YEAR KYW         
POSTALO$ EQU   X'04'               .  Post allocated detail by date             
POSTBYDT EQU   X'02'               .  Posting by date                           
POSTPED  EQU   X'01'               .  Posting by period (1R Budgets)            
STACKLVL DS    XL1                 Processing stack level counter               
*                                                                               
GHISIND  DS    XL1                 Global Payroll history indicators            
GHISON   EQU   X'80'               .  Payroll processing activated              
GHISMOA  EQU   X'40'               .  MOA date              keyword             
GHISDATE EQU   X'20'               .  Payroll date          keyword             
GHISCDNM EQU   X'10'               .  Payroll code or name  keyword             
GHISTYPE EQU   X'08'               .  Payroll bucket type   keyword             
*HISTDTE EQU   X'01'               .  Transaction date      keyword             
*                                                                               
PAIRIND  DS    XL1                                                              
PAIRCSHD EQU   X'40'               .  Cash discount                             
PAIRXJOB EQU   X'20'               .  X-job                                     
PAIRNOTZ EQU   X'10'               .  Trans. total is not zero for key          
*                                                                               
SUBTTYP2 DS    XL1                 Sub-transaction type 2                       
*                                                                               
PIXMODE  DS    XL1                 Print queue index mode                       
PIXINIT  EQU   X'80'               .  Initialize PQ index reporting             
PIXDATA  EQU   X'40'               .  Row data output                           
*                                                                               
PIXOPT1  DS    XL1                 Print queue index options                    
PIXGO    EQU   X'80'               .  Print queue indexing is in use            
PIXROW   EQU   X'08'               .  Rows present                              
PIXMID   EQU   X'04'               .  Mids present                              
*                                                                               
PIXROW#  DS    XL1                 Starting # of row to print <DATA 00>         
PIXROWH# DS    XL1                 Number of row headings                       
PRTPRIOR DS    XL1                 Prior PRTACT indicator                       
ALT#HEAD DS    XL1                 Alternate number of headings (recap)         
QCURRY   DS    CL1                 requested currency #, 1 or 2                 
*&&UK                                                                           
CURCPOS  DS    0XL26                                                            
CURCPO   DS    CL20                CURRENT CLIENT PO                            
CURCPOA  DS    PL6                 CURRENT CLIENT PO AMOUNT                     
*&&                                                                             
CURESTET DS    XL6                 CURRENT ESTIMATE NUMBER                      
CURESTA1 DS    XL1                 CURRENT ESTIMATE STATUS BYTE 1               
CURESTA2 DS    XL1                 CURRENT ESTIMATE STATUS BYTE 2               
CURPDTE  DS    PL3                 CURRENT PERIOD DATE          (1R)            
CURHRS   DS    PL3                 CURRENT HOURS                (1R)            
*&&US                                                                           
AUTHKREQ DS    CL42                Requested authorization(s)                   
         ORG   AUTHKREQ                                                         
ATHCLPRD DS    CL6                 Authorization client/product                 
AUTHSTAT DS    CL1                 Authorization status                         
AUTHCHEK DS    XL1                                                              
AUTHEXCL EQU   X'80'               Exclude this authorization                   
         ORG                                                                    
*&&                                                                             
SJAEUSED DS    0XL5                Account equivalent displacements             
SJAEDSPA DS    XL1                 Disp. to Acc equiv. A in SJINFO              
SJAEDSPB DS    XL1                 Disp. to Acc equiv. B in SJINFO              
SJAEDSPC DS    XL1                 Disp. to Acc equiv. C in SJINFO              
SJAEDSPD DS    XL1                 Displ.to Acc equiv. D in SJINFO              
SJAEDSPE DS    XL1                 Displ.to Acc equiv. E in SJINFO              
*                                                                               
UNIQUE#  DS    CL12                                                             
REQTIME  DS    CL8                 Time HH:MM:SS                                
         ORG   REQTIME                                                          
REQHH    DS    CL2                 Hours    - HH                                
REQCLLN1 DS    CL1                 C':'                                         
REQMM    DS    CL2                 Minutes  - MM                                
REQCLLN2 DS    CL1                 C':'                                         
REQSS    DS    CL2                 Secounds - SS                                
#OFACNTS DS    PL4                 Count number of accounts - PROCACC           
#OFOFF   DS    XL1                 # of office for contra (GL)                  
                                                                                
DDLNKIND DS    XL1                 DDLINK indicators                            
DDLNKON  EQU   X'80'               .   In use                                   
DDLNKINT EQU   X'40'               .   Initialized                              
DDLNKGBL EQU   X'20'               .   Global reporting via RLP req.            
DDLNKQKR EQU   X'02'               .   Quick reporting                          
DDLNKTST EQU   X'01'               .   Testing without DDLINK                   
*                                                                               
*                                 <<<   Vendor information  >>>                 
CFWVCNO  DS    CL6                 Vendor Check Number                          
CFWVCDT  DS    XL2                 Vendor Check Date                            
CFWVSTA  DS    XL1                 Vendor Status                                
*                                  .  Urgent   (X'40'-TRNSURG)                  
*                                  .  Reversal (X'20'-TRNSREV)                  
*                                  .  Held     (X'04'-TRNSHOLD)                 
*                                  .  Approved (X'02'-TRNSAPPR)                 
CFWVCDI  DS    XL2                 Internal Vendor Check Date                   
*                                                                               
AC@CHGS  DS    CL15                Charges                                      
AC@BLG   DS    CL15                Billing                                      
SOFFC    DS    CL2                 Subsiduary Office                            
SCULAC   DS    CL14                Subsiduary Contra U/L/A                      
CURTAXTY DS    CL3                 Tax Type                                     
CURTAX#  DS    CL9                 Tax #                                        
CURTAX2C DS    CL9                 Tax # on 2C                                  
GLMOS    DS    XL2                 GL MOS from CPYGLMOS                         
*                                                                               
SJKEY    DS    CL12                CLIENT/PROD/JOB                              
*&&UK                              DATA USED BY GRPMUK EXTRACT                  
PRVRSOFF DS    CL2                 PREVIOUS OFFICE FOR REFSER                   
PRVRSCUR DS    CL3                 PREVIOUS CURRENCY FOR REFSER                 
PRVRFSER DS    CL15                PREVIOUS REFSER DATA                         
CURURLID DS    CL16                CURRENT URLID DATA                           
PRVMOA   DS    XL2                 MOA ON PREVIOUS MONTH                        
CUROMOA  DS    PL2                 CURRENT ORIGINAL MOA                         
CURMEMNR DS    CL50                CURRENT MEMO NARR                            
CUREMREF DS    CL14                CURRENT EXTERNAL MEDIA REFERENCE             
*&&                                                                             
ACRLQ    EQU   *-ACRLD                                                          
         EJECT ,                                                                
ACRL2D   DSECT                                                                  
CHOPWRK  DS    0CL256                                                           
CHOP1ST  DS    CL24                Must be same length as UPFRONT               
CHOPDATA DS    CL232                                                            
JOBFLDH  DS    XL8                                                              
JOBFLD   DS    CL200               JOB COMMENT + 25 JOBBER KEYWORDS             
UPFRONT  DS    CL24                                                             
OFFNAME  DS    CL33                                                             
OFFADRLN DS    AL1                 NUMBER OF COMP ADDR LINES                    
OFFADDR  DS    CL33                                                             
         DS    CL33                                                             
COMPNAME DS    CL36                STORED ADDRESS OF COMPANY                    
NADR     DS    AL1                 NUMBER OF COMP ADDR LINES                    
COMPADDR DS    CL26                UPTO FOUR LINES                              
         DS    CL26                RESERVED                                     
         DS    CL26                RESERVED                                     
         DS    CL26                RESERVED                                     
LNLEN    EQU   *-COMPNAME                                                       
REQDATE  DS    CL8                 REQUEST DATE                                 
PERDATE  DS    CL19                PERIOD DATE                                  
         ORG   PERDATE                                                          
PERSTR   DS    CL8                 PERIOD START DATE                            
         DS    CL1                 SPACE                                        
PERTHRU  DS    CL1                 FOR "-" CHARACTER                            
         DS    CL1                 SPACE                                        
PEREND   DS    CL8                 PERIOD END DATE                              
REPEND   DS    CL8                 REPORTING END DATE                           
         SPACE 1                                                                
MOADATE  DS    CL13                MOA DATE                                     
         ORG   MOADATE                                                          
MOASTR   DS    CL6                 MOA START DATE                               
MOADASH  DS    CL1                 SPACE                                        
MOAEND   DS    CL6                 MOA END DATE                                 
         SPACE 1                                                                
ACTDATE  DS    CL19                                                             
         ORG   ACTDATE                                                          
ACTSTR   DS    CL8                 ACTIVITY START DATE                          
         DS    CL1                 SPACE                                        
ACTTHRU  DS    CL1                 FOR "-" CHARACTER                            
         DS    CL1                 SPACE                                        
ACTEND   DS    CL8                 ACTIVITY END DATE                            
         SPACE 1                                                                
ALTDATE  DS    CL19                                                             
         ORG   ALTDATE                                                          
ALTSTR   DS    CL8                 ALTERNATE START DATE                         
         DS    CL1                 SPACE                                        
ALTTHRU  DS    CL1                 FOR "-" CHARACTER                            
         DS    CL1                 SPACE                                        
ALTEND   DS    CL8                 ALTERNATE END DATE                           
*                                                                               
TIMELM1  DS    XL(TIMILN2Q)                                                     
TIMELM2  DS    XL(TIMTMINQ)                                                     
TIMELM3  DS    XL(TIMNLNQ+60)                                                   
*                                                                               
REQRECAP DS    CL(MAXFMTS)         REQUEST RECAP OVER-RIDE FLAGS                
*                                                                               
OCUREND  DS    CL8                 MMMDD/YY                                     
*                                                                               
SVSKPSPC DS    CL(L'SKIPSPEC)      Save area for SKIPSPEC                       
SVRCRQRP DS    CL(L'RCREQREP)      Save area for RCREQREP                       
SENDATE  DS    XL3                 YYMMDD                (BINARY)               
SVFMTCDE DS    CL8                 Saved format code                            
         DS    XL12                spare                                        
DTLCOUNT DS    PL8                                                              
*                                                                               
IOKEYSAV DS    CL(ACCORFST)                                                     
EDIHUBID DS    CL4                 EDIHUB ID                                    
         DS    CL203               spare                                        
*                                                                               
DWNSUB   DS    CL60                Subject line                                 
DWNFIL   DS    CL60                File name                                    
DWNEXT   DS    CL8                 Extension                                    
*                                                                               
SECFLDW  DS    XL32                Security field write                         
SECFLDR  DS    XL32                Security field read                          
*                                                                               
GAPLDAT1 DS    XL1                 DATA TYPES - SEE GAPTABD                     
GENDELE  DS    F                   Address of where element ends                
LMLBYTE  DS    XL1                                                              
LMLCLT   EQU   X'80'               Limlist rec found for clt filtering          
LML1R    EQU   X'40'               Limlist rec found for 1R filtering           
LMLMED   EQU   X'20'               Limlist rec found for med filtering          
TSARABUF DS    XL(TSPXTNL)         TSAR block for limlist buffer                
GSVLDG   DS    CL2                 Ledger code last read                        
GAPFLTLN DS    XL1                 Filter length                                
GAPACTLN DS    XL1                 Account length                               
ATSRERRS DS    XL1                 TSAR buffer error                            
GLEVELS  DS    XL4                 Ledger lengths                               
GAPAREA  DS    XL(GAPTLNQ)         Area to use for buffer rec                   
         SPACE 1                                                                
***********************************************************************         
*  DICTIONARY WORDS                                                   *         
***********************************************************************         
         SPACE 1                                                                
AC@RSBLK DS    CL6                                                              
*&&US                                                                           
AC@YES   DS    CL3                                                              
AC@NO    DS    CL3                                                              
*&&                                                                             
*&&UK                                                                           
AC@YES   DS    CL4                                                              
AC@NO    DS    CL4                                                              
*&&                                                                             
RLWORDS  DS    0C                                                               
AC@ACTY  DS    CL10                                                             
AC@AFTER DS    CL5                                                              
AC@CUR   DS    CL8                                                              
AC@FROM  DS    CL8                                                              
AC@FUTUR DS    CL8                                                              
AC@MOARA DS    CL10                                                             
AC@PAGE  DS    CL5                                                              
AC@PERD  DS    CL10                                                             
AC@PRIOR DS    CL5                                                              
AC@RUNDT DS    CL10                                                             
AC@THRU  DS    CL8                                                              
AC@TFOR  DS    CL12                                                             
AC@TREQ  DS    CL20                                                             
AC@FRMAT DS    CL8                                                              
AC@DRFIT DS    CL15                                                             
AC@HELD  DS    CL8                                                              
AC@QUERD DS    CL8                                                              
AC@SEQ#  DS    CL6                                                              
AC@UFLD  DS    CL6                                                              
AC@TFORR DS    CL15                Total for recap                              
AC@OVRI  DS    CL10                Over-ride                                    
AC@CHK   DS    CL5                 Check                                        
AC@EFT   DS    CL3                 EFT                                          
AC@MAPP  DS    CL6                 Marker                                       
AC@AAPP  DS    CL12                Auto Approve                                 
*&&US                                                                           
AC@PCARD DS    CL5                 PCARD                                        
AC@CCARD DS    CL5                 CCARD                                        
         DS    CL20                SPARE (e.g. for more dict items)             
*&&                                                                             
*&&UK                                                                           
         DS    CL30                SPARE (e.g. for more dict items)             
*&&                                                                             
XLCHOP   DS    CL(GESIZEQ)        Extra large CHOPDATA (see XLCHOPD)            
ACRL2Q   EQU   *-ACRL2D                                                         
*                                                                               
PHASED   DSECT                                                                  
PHASE_NM DS    CL8                                                              
PHASE_RT DS    A                                                                
PHASELNQ EQU   *-PHASED                                                         
*                                                                               
ADJD     DSECT                                                                  
ADJENTRY DS    A                                                                
ADJORGIN DS    Y                                                                
ADJMODE  DS    AL1                 Run first or Request first                   
         DS    AL1                                                              
ADJLNQ   EQU   *-ADJD                                                           
*                                                                               
XLCHOPD  DSECT                     Covers XLCHOP                                
XLCHWRK  DS    0CL(GESIZEQ)                                                     
XLCHUPF  DS    CL(L'UPFRONT)                                                    
XLCHDAT  DS    CL(L'XLCHWRK-L'XLCHUPF)                                          
XLCLNQ   EQU   *-XLCHOPD                                                        
         EJECT ,                                                                
***********************************************************************         
*  FORMAT RECORD                                                      *         
***********************************************************************         
         SPACE 1                                                                
FMTRECD  DSECT                                                                  
FMTCODE  DS    CL8                 Format code                                  
FMTNAME  DS    CL36                Format name                                  
FMTNUM   DS    XL1                 Format number                                
FMTRCAP  DS    XL1                 Recap indicators                             
FMTRSEP  EQU   X'80'               .  Print format seperate form rest           
FMTRPROF EQU   X'40'               .  Use format's own profile                  
FMTMRGPG EQU   X'20'               .  Merge recap page on mid or detail         
FMTFPAGE EQU   X'10'               .  Force to new page regardless              
FMTRWALL EQU   X'08'               .  Match all head rows with next rpt         
FMTTOP   DS    XL1                 Top report for headings when merged          
FMTMRGE# DS    XL1                 Merge recap, treat as another format         
FMTCOL   DS    A                   A(Column table)                              
FMTROW   DS    A                   A(Row table)                                 
FMTLROW  DS    A                   A(Last row)                                  
FMTHEAD  DS    A                   A(Headlines)                                 
FMTCHEAD DS    A                   A(Column headings)                           
FMTBOXCL DS    A                   A(Box columns)                               
FMTBDGT  DS    A                   A(Budget block data)                         
FMTSRTWK DS    A                   A(Sort record buffer)                        
FMTPGEWD DS    A                   Page width (Leave as A(0) type)              
FMTDICT1 DS    A                   Parameter for DICTATE (single)               
FMTDICT2 DS    A                   Parameter for DICTATE (list)                 
FMTDELEL DS    A                   A(Pool of elements to makr deleted)          
FMTDTED  DS    A                   A(Person Scribe date period table)           
FMTCONS  DS    A                   A(Condition code table)                      
FMTEXTTR DS    A                                                                
FMTPAY$  DS    A                   A(Payroll amounts by column rec)             
FMTRTES  DS    A                   A(Payroll rates record)                      
         DS    2A                  Spare                                        
***********************************************************************         
*  GLOBAL FORMAT FILTER ADDRESSES                                               
***********************************************************************         
AFLTLIST DS    0A                                                               
AFLTUNL  DS    A                   A(Unit/Ledgers)                              
AFLTACC  DS    A                   A(Accounts)                                  
AFLTCTRA DS    A                   A(Contras)                                   
AFLTCLI1 DS    A                   A(Cli/Prod/Job)                              
AFLTCLI2 DS    A                   A(Cli/Prod/Job)                              
AFLTCOST DS    A                   A(Cost accounts)                             
AFLTOFF  DS    A                   A(Office)                                    
AFLTCOFF DS    0A                  A(Client office)                             
AFLTANOF DS    A                   A(Analysis office)                           
AFLTPRSN DS    A                   A(Person account)                            
AFLTDEPT DS    A                   A(Department)                                
AFLTDEXP DS    A                   A(Direct expense)                            
AFLTVNDR DS    A                   A(Vendor)                                    
AFLTPART DS    A                   A(Participant)                               
AFLTBLNG DS    A                   A(11 Billing)                                
AFLTREVN DS    A                   A(12 Revenue)                                
AFLTUFLD DS    A                   A(User field)                                
AFLTOFGP DS    A                   A(Office group)                              
AFLTMDGP DS    A                   A(Media group)                               
AFLTWCGP DS    A                   A(Workcode group)                            
AFLTWC   DS    A                   A(Workcode)                                  
AFLTMEDA DS    A                   A(Media)                                     
AFLTSTTY DS    A                   A(Studio type)                               
AFLTEXCR DS    A                   A(Exception reasons)                         
AFLTTMWC DS    A                   A(Time workcode types)                       
AFLTOPWC DS    A                   A(Out of pocket workcode types)              
AFLTTYPE DS    A                   A(Transaction type)                          
AFLTPRLV DS    A                   A(Price level)                               
AFLTPCDE DS    A                   A(Pay code)                                  
AFLTAUTH DS    A                   A(Auth status)                               
AFLTTSTA DS    A                   A(Time status)                               
AFLMTSTA DS    A                   A(Missing Timesheet status)                  
         DS    4A                  SPARE                                        
AFLTLNQ  EQU   *-AFLTLIST                                                       
*                                                                               
FMTKRATE DS    H                                                                
         DS    H                   SPARE                                        
FMT#TRNS DS    H                   NUM. OF SORT RECS CREATED PER ACCKEY         
DTECOLLN DS    H                   LENGTH OF DTED DSECT ENTRY                   
MAXINDNT DS    H                   MAX INDENT FOR RIGHT HEADING                 
*                                                                               
FMTKEYLN DS    Y                   LENGTH OF KEY                                
FMTDATLN DS    Y                   LENGTH OF KEY + DATA                         
FMTACMLN DS    Y                   LENGTH OF ACCUMS                             
FMTFCOL  DS    Y                   DISPLACEMENT TO FORCED COLUMN                
FMTFLDQ  EQU   *-FMTKEYLN                                                       
*                                                                               
FMTRNKON DS    Y                   * SORTREC (VERTICAL TOTALS)                  
FMTRNKBY DS    Y                   * WHERE TO RANK ON SORTKEY                   
FMTRNKCL DS    Y                   * COL ACCUM TO RANK ON                       
FMTRNKTY DS    CL1                 * ACSENDING OR DESENDING RANK                
FMTRNK#1 DS    CL2                 TEMPORAY RANK ON INFO                        
FMTRNK#2 DS    CL2                 TEMPORAY RANK BY INFO                        
FMTRNK#3 DS    CL1                 TEMPORAY RANK COL INFO                       
*                                                                               
FMTREPWD DS    XL1                 REPORT WIDTH                                 
FMTFONT  DS    XL1                 FONT SIZE FOR BOXFONT                        
FMTPGDEF DS    XL1                 PAGEDEF FORMAT                               
FMTMLINE DS    XL1                 MAX LINES ON PAGE                            
FMTPUT   DS    CL1                 FLAG TO PUT REC. TO SORTER OR NOT            
FMTMODES DS    XL1                 FORMAT MODES NOT TO PROCESS                  
FMTNOACC EQU   X'80'               .  ACCOUNT                                   
FMTNOANL EQU   X'40'               .  ANALFRST                                  
FMTNOSUB EQU   X'20'               .  SUBAFRST                                  
FMTNOTRS EQU   X'10'               .  TRANSACTIONS                              
FMTPOST  EQU   X'01'               .  OK TO POST                                
FMTPIND  DS    XL1                 PRINT NUMBERS AS                             
FMTPICMY EQU   RCLEDCMY            .  X'80' Commas                              
FMTPITRL EQU   RCLEDTRL            .  X'40' Trailing minus                      
FMTPIZRY EQU   RCLEDZRY            .  X'20' ZERO as non-blank                   
*                                  .  X'10' **** DO NOT USE ****                
FMTPIBKT EQU   RCLEDBKT            .  X'08' Minus as "()"                       
*                                  .  X'04' **** DO NOT USE ****                
FMTPILED EQU   RCLEDLED            .  X'02' Leading minus sign                  
FMTPICR  EQU   RCLEDCR             .  X'01' Sign as "CR" or "DR"                
FMTFOOT  DS    XL1                 FOOTLINE CONTROL                             
FMTFTON  EQU   X'80'               .  FOOTLINE CONTROL ON                       
FMTFTVAR EQU   X'40'               .  FOOTLINE VARIES BY PAGE                   
FMTFTPRT EQU   X'20'               .  OK TO PRINT FOOTLINE                      
FMTFTALT EQU   X'10'               .  PRINT ALTERNATE FOOTLINE                  
FMTFTEOR EQU   X'01'               .  AT END OF REQUEST                         
FMT#ADRL DS    XL1                 NUMBER OF ROW ADDRESS LINES TO PRINT         
FMTULINE DS    XL1                 TYPE OF UNDERLINE                            
FMT#HEAD DS    XL1                 NUMBER OF HEADS   TO PROCESS                 
FMT#ROWS DS    XL1                 NUMBER OF ROWS    TO PROCESS                 
FMT#COLS DS    XL1                 NUMBER OF COLUMNS TO PROCESS                 
FMT#ACMS DS    XL1                 NUMBER OF AMOUNT     COLUMNS                 
FMT#RTES DS    XL1                 NUMBER OF RATE       COLUMNS                 
FMT#BUDS DS    XL1                 NUMBER OF BUDGETS IN TABLE                   
FMT#DTES DS    XL1                 NUMBER OF CALENDAR DATES COLUMNS             
FMTFLAG  DS    XL1                 REPORT FLAGS                                 
FMTCZERO EQU   X'80'               .  OPTION ON IF COL=ZERO                     
FMTRATES EQU   X'40'               .  RATES USED IN SORT KEY                    
FMTALO$  EQU   X'20'               .  POST ALLOCATED BY MONTH                   
FMTPART  EQU   X'10'               .  PARTIAL PAYMENT                           
FMTACLVL EQU   X'04'               .  ALL ACCOUNT LEVELS                        
FMTBYCOL EQU   X'02'               .  ADD ACCUMS BY COLUMN                      
FMTOKREV EQU   X'01'               .  PRODUCTION OKAY TO REVERSE SIGNS          
FMTFLAG2 DS    XL1                 Internal report flag                         
FMTWIPE  EQU   X'80'               .  Wipeout row data on                       
FMTNOCB  EQU   X'40'               .  Coulmns marked "C" are all zero           
FMTSUM   EQU   X'20'               .  SUM() or CUME() keyword used              
*MTFILL  EQU   X'10'               .  Fill data, related to ROWFILL             
FMTALVL$ EQU   X'08'               .  Account level amount keyword used         
FMTCCREC EQU   X'01'               .  Column conditional record found           
FMTIND   DS    XL1                 REPORT INDICATORS                            
FMTMERGE EQU   X'80'               .  TRY MERGING DATA FURTHER                  
FMTCLRDB EQU   X'40'               .  CLEAR COLDUB                              
FMTREVSG EQU   X'20'               .  REVERSE SIGN DR/CR BASED AT ROW           
FMTIERR  EQU   X'10'               .  PRINT DIVISION ERROR AS "EEEE"            
FMTIAGE0 EQU   X'08'               .  ELIMINATE RECS. IF AGE COL=ZERO           
FMTNOREV EQU   X'04'               .  SPECIAL EDIT, DON'T REVERSE SIGN          
FMTSFTH  EQU   X'01'               .  SOFT COLUMN HEADINGS                      
FMTIND2  DS    XL1                 REPORT INDICATORS                            
FMTBUDON EQU   X'80'               .   Build budget                             
FMTBUDOK EQU   X'40'               .   Built budget                             
FMTYYMM  EQU   X'20'               .   Month or Year keyword used               
FMTDAILY EQU   X'10'               .   Daily date keyword used   (1R)           
FMTITEM  EQU   X'08'               .   Item keywords used        (1R)           
*&&UK                                                                           
FMTMESYS EQU   X'04'               .   Keywords requires media sys (UK)         
*&&                                                                             
FMTPOPT1 DS    XL1                 PRINT OPTIONS (RPFELD for equates)           
*                                  .   X'80'  Print boxes if on                 
*                                  .   X'40'  Print inactive Accts              
*                                  .   X'20'  Print redundant totals            
*                                  .   X'10'  Pring requndant col data          
*                                  .   X'08'  Left justify report               
*                                  .   X'04'  Print zero total amounts          
*                                  .   X'02'  N/D (don't use)                   
*                                  .   X'01'  Print mixed case                  
FMTPOPT2 DS    XL1                 PRINT OPTIONS 2                              
*                                  .   X'80'  Extene column wrap                
*                                  .   X'40'  Request total sep. page           
*                                  .   X'20'  Eliminate inactive Buds           
*                                  .   X'10'  Eliminate inactive Acts           
*                                  .   X'08'  Force download option             
*                                  .   X'04'  Print strips                      
*                                  .   X'02'  Print shade outside box           
*                                  .   X'01'  Print shade inside  box           
FMTPOPT3 DS    XL1                 PRINT OPTIONS 3                              
*                                  .   X'80'  No underline on totals            
*                                  .   X'40'  Underline above on totals         
*                                  .   X'20'  Time sheet edit reporting         
*                                  .   X'10'  Extra boxes                       
*                                  .   X'08'  Suppress column headings          
*                                  .   X'04'  Don't print request total         
FMTROPT  DS    XL1                 REPORT OPTIONS  (RPFROPT)                    
*                                  .   X'80'  Balance outstanding only          
*                                  .   X'40'  Exclude locked accounts           
*                                  .   X'20'  Exclude reversals                 
*                                  .   X'10'  Make activity - Interface         
*                                  .   X'08'  Locked accounts only              
*                                  .   X'04'  Reversals only                    
*                                  .   X'02'  Include type 56                   
*                                  .   X'01'  Credit balacne only               
FMTROPT1 DS    XL1                 REPORT OPTIONS (RPFOPT1)                     
*                                  .   X'80'  EXCLUDE OFFSET ITEMS              
*                                  .   X'40'  EXCLUDE HELD ITEMS                
*                                  .   X'20'  EXCLUDE APPROVED ITEMS            
*                                  .   X'10'  INCLUDE DRAFT ITEMS               
*                                  .   X'08'  OFFSET ITEMS ONLY                 
*                                  .   X'04'  HELD ITEMS ONLY                   
*                                  .   X'02'  APPROVED ITEMS ONLY               
*                                  .   X'01'  DRAFT ITEMS ONLY                  
FMTROPT2 DS    XL1                 REPORT OPTIONS (RPFOPT2)                     
*                                  .   X'80'  EXCLUDE PAY=NO VENDOR             
*                                  .   X'40'  EXCLUDE QUERIED ITEMS             
*                                  .   X'20'  EXCLUDE URGENT ITEMS              
*                                  .   X'10'  QUERIED ITEMS ONLY                
*                                  .   X'08'  PAY=NO VENDOR ONLY                
*                                  .   X'04'  CASH DISCOUNT ONLY                
*                                  .   X'02'  URGENT ITEMS ONLY                 
*                                  .   X'01'  CASH DISBURSEMENTS                
FMTROPT3 DS    XL1                 REPORT OPTIONS (RPFOPT3)                     
*                                  .   X'80'  EXCLUDE ANLAYSISED DEPT           
*                                  .   X'40'  EXCLUDE ANALYSISED STAFF          
*                                  .   X'20'  EXCLUDE ANALYSISED CLIENT         
*                                  .   X'10'  EXCLUDE CLEARED    ITEMS          
*                                  .   X'08'  ONLY    ANALYSISED DEPT           
*                                  .   X'04'  ONLY    ANALYSISED STAFF          
*                                  .   X'02'  ONLY    ANALYSISED CLIENT         
*                                  .   X'01'  ONLY    CLEARED    ITEMS          
FMTROPT4 DS    XL1                 REPORT OPTIONS (RPFOPT4)                     
*                                  .   X'20'  EXCLUDE CLOSED JOBS               
*                                  .   X'02'  INCLUDE CLOSED JOBS ONLY          
*                                  .   X'80'  JOBS  WITH NO ESTIMATES           
*                                  .   X'08'  ONLY JOBS WITH ESTIMATES          
*                                  .   X'40'  EXCLUDE ALLOCATE WO/TRF           
*                                  .   X'04'  ONLY    ALLOCATE WO/TRF           
FMTROPT5 DS    XL1                 REPORT OPTIONS (RPFOPT5)                     
*                                  .   X'80'  EXCLUDE PO'S                      
*                                  .   X'40'  MERGE   PO'S WORKCODES            
*                                  .   X'10'  INCLUDE SAVED TIME SHEETS         
*                                  .   X'08'  ONLY    PO'S                      
*                                  .   X'01'  ONLY    SAVED TIME SHEETS         
FMTROPT6 DS    XL1                 REPORT OPTIONS (RPFOPT6)                     
*                                  .   X'80'  YES include inactive auth         
*                                  .   X'40'  ONLY include inactive aut         
*                                  .X'10'  Period date range by day UK          
*                                  .   X'08'  Report %est by workcode           
FMTROPT7 DS    XL1                 REPORT OPTIONS (RPFOPT7)                     
*                                  .   X'80'  Include draft jobs                
*                                  .   X'40'  Only report on draft jobs         
*                                  .X'08'  Period date range by day US          
FMTROPT8 DS    XL1                 REPORT OPTIONS (RPFOPT8)                     
*                                  .   X'80'  ONLY inl locked Estimates         
*                                  .   X'40'  ONLY inl locked Orders            
*                                  .   X'20'  ONLY inl locked Billing           
*                                  .   X'10'  ONLY inl locked Time              
*                                  .   X'08'  ONLY inl locked Adjust            
*                                  .   X'04'  ONLY inl locked 3rd Party         
FMTROPT9 DS    XL1                 REPORT OPTIONS (RPFOPT9)                     
*                                  .   X'80'  YES exc locked Estimates          
*                                  .   X'40'  YES exc locked Orders             
*                                  .   X'20'  YES exc locked Billing            
*                                  .   X'10'  YES exc locked Time               
*                                  .   X'08'  YES exc locked Adjust             
*                                  .   X'04'  YES exc locked 3rd Party          
FMTRNDTY DS    XL1                 ROUNDING TYPE                                
*                                  .   64 IS PENNY                              
*                                  .   62 IS DOLLAR                             
*                                  .   59 IS THOUSAND                           
*                                  .   56 IS MILLION                            
FMTPCT   DS    XL1                 PRINT % TO N DECIMAL PLACES                  
*                                  .   2 IS TWO DECIMAL PLACES                  
*                                  .   1 IS ONE DECIMAL PLACE                   
*                                  .   0 IS NO DECIMAL PLACES                   
LEVKYWD  DS    AL1                 LOWEST  KEYWORD USED THIS REPORT             
FMTLEVMX DS    AL1                 IF ACCT LISTING THEN PROCESS UPTO            
*                                     THIS MODE (LEVEL MAX)                     
FMTSW    DS    XL1                 SORTING SWITCH                               
FMTVPCT  EQU   X'80'               .   USE VERTICAL % ON THIS FORMAT            
FMTRANK  EQU   X'40'               .   USE RANK RECORDS                         
FMTRKRTE EQU   X'20'               .   RANK ON RATE                             
FMTFRATE EQU   X'10'               .   RATE ARE NOT SHOWN (FORCE CALC)          
FMTNOACT EQU   X'08'               .   NO ACTIVITY was detected                 
FMT4DEC  EQU   X'04'               .   PROCESS accums with 4 decimals           
FMTP$AON EQU   X'02'               .   Format needs adjusted payroll            
FMTTHRON EQU   X'01'               .   Format needs total hours process         
*                                                                               
UNIFLAG  DS    CL1                 FLAG TO PUT EVERY TRANS (Y/N)                
*                                                                               
SPLITIND DS    XL1                 CONTROL FLOW OF SPLITING TRANSACTION         
SPLITREC EQU   X'80'               .  SPLIT RECORD                              
SPLITDAT EQU   X'40'               .  RECORD HAS SPLIT DATA                     
SPLITROW EQU   X'20'               .  ROW    HAS SPLIT DATA TYPE                
SPLITCOL EQU   X'10'               .  COLUMN HAS SPLIT DATA TYPE                
SPLIT77  EQU   X'01'               .  SPLIT  THE X'77' ELEMENTS                 
*                                                                               
BLTRNOPT DS    CL1                 BILLED TRANSACTION OPTION                    
EXCPSORT DS    AL1                                                              
NEXPCDES DS    AL1                 NUMBER OF EXCEPTION CODES IN FILTER          
*                                                                               
TIMESTA2 DS    XL1                 Type of time                                 
TIMEB    EQU   X'80'               .  B - TIME                                  
TIMEN    EQU   X'40'               .  N - TIME                                  
TIMER    EQU   X'20'               .  R - TIME                                  
*                                                                               
VATRGSTA DS    XL1                 Vat region                                   
VATRGNAT EQU   X'80'               National                                     
VATRGEU  EQU   X'40'               European                                     
VATRGNEU EQU   X'20'               Foreign but non European                     
*                                                                               
FMTXDATA DS    XL1                 Extra data                                   
FMTXNAME EQU   X'01'               Extra data name exists on format             
FMTXVALU EQU   X'02'               Extra data value exists on format            
*                                                                               
FMTSTKHT DS    AL1                 Max number of stacked print lines            
FMTBYTE1 DS    XL1                 Temporary storage between formats            
FMTBYTE2 DS    XL1                                                              
FMTOPTCH DS    XL1                 Pitch over-ride                              
*                                                                               
PHISIND  DS    XL1                 Payroll indicators                           
PHISON   EQU   X'80'               .  Payroll processing activated              
PHISMOA  EQU   X'40'               .  Payroll MOA           keyword             
PHISDATE EQU   X'20'               .  Payroll date          keyword             
PHISCDNM EQU   X'10'               .  Payroll code or name  keyword             
PHISTYPE EQU   X'08'               .  Payroll type (bucket) keyword             
*HISKEYW EQU   X'04'               .  MONTH/YEAR            keyword             
*HISPDTE EQU   X'02'               .  MONTH/YEAR payroll date basis             
*HISTDTE EQU   X'01'               .  Transaction date      keyword             
*                                                                               
FMTDTETY DS    XL2                 Dates to process for MONTH/YEAR KYW          
FMTDBLLM EQU   X'0001'             .  Process billed moa                        
FMTDBLLD EQU   X'0002'             .  Process billed date                       
FMTDMOA  EQU   X'0004'             .  Process moa                               
FMTDACTV EQU   X'0008'             .  Process activity                          
FMTDTRNS EQU   X'0010'             .  Process transaction                       
FMTDDUE  EQU   X'0020'             .  Process due                               
FMTDSTMT EQU   X'0040'             .  Process statement                         
FMTDPAYR EQU   X'0080'             .  Process history payroll                   
*                                                                               
FMTF1    DS    CL1                 Filter F1                                    
FMTF2    DS    CL1                 Filter F2                                    
FMTF3    DS    CL1                 Filter F3                                    
FMTF4    DS    CL1                 Filter F4                                    
FMTF5    DS    CL1                 Filter F5                                    
         DS    XL12                Spare                                        
FMTRTYP  DS    C                   Reporting type                               
FMT#VROW DS    AL1                 # of visible rows                            
FMT#PAY$ DS    XL1                 # of payroll amounts in FMTPAY$              
FMT#PAYR DS    XL1                 # of payroll rates   in FMTRTES              
FMT#P$AJ DS    XL1                 # of payroll adjusted columns                
FMTPONCE DS    XL1                 Post once per account                        
FMTPON   EQU   X'80'               .  Yes                                       
*MTPDONE EQU   X'40'               .  Posted once done for account              
FMTSPKYW DS    XL1                 Process for special keywords used            
FMTKPEFD EQU   X'01'               .  Personal effective dates                  
*                                                                               
FMTESTAT DS    CL1                 Estimate status                              
FMTDTIDX DS    AL1                 Index into DATEFMT table (default)           
FMTROWLV DS    XL1                 Row Level of account keyword                 
FMT@COL# DS    XL(MAXCOLS)         1 byte column # to point to accum            
FMTLNQ   EQU   *-FMTRECD           SIZE OF FORMAT REC                           
         EJECT ,                                                                
***********************************************************************         
*        SORT RECORD EXTRA DATA                                       *         
***********************************************************************         
RECXD    DSECT                                                                  
RECOFC   DS    CL2                 Limited office value Accent only             
RECFCUR  DS    CL3                 Currency code UK                             
RECTYPE  DS    XL1                 250=NORMAL,1=BUDGET,2=VERTICAL               
RECBUDG  EQU   1                   .  Budget                                    
RECVPCT  EQU   2                   .  Vertical % normal                         
RECVPCTD EQU   3                   .  Vertical % Debit                          
RECVPCTC EQU   4                   .  Vertical % Credit                         
RECNORM  EQU   250                 .  Normal sort record                        
RECSTMS  EQU   251                 .  Saved  TMS  record                        
RECREV   EQU   253                 .  Reverse column amt when on                
RECLVL   DS    XL1                 ROW LEVEL                                    
RECOTH   DS    XL1                 Used for date indexing (1R)                  
RECMASK  EQU   X'80'               .  MASK OUT DATA FOR MARKED ROW              
RECRPT#  DS    XL1                                                              
RECIND   DS    XL1                                                              
RECTOTS  EQU   X'80'               .  Total for report (Recap) record           
RECKEEP  EQU   X'40'               .  Keep record even if $ are zero            
RECMRGE  EQU   X'20'               .  Merge record if possible                  
RECXDQ   EQU   *-RECXD                                                          
         EJECT ,                                                                
KYWD     DSECT                                                                  
KYWCODE  DS    CL6                 KEYWORD                                      
         ORG   KYWCODE                                                          
KYWESCDD DS    AL1                 Escape sequence of dictionary item           
KYWNUMDD DS    AL2                 Dictionary number for item                   
KYWLENDD DS    AL1                 Dictionary length of  item                   
         ORG                                                                    
KYWCOLH  DS    AL2                 KEYWORD COLUMN HEADING                       
KYWLINK  DS    AL2                 KEYWORD LINK TO NAME OR CODE                 
KYWADDR  DS    AL2                 KEYWORD OF ADDRESS                           
KYWEDIT  DS    AL2                 EDIT ROUTINE                                 
KYWPRSE  DS    AL2                 PARSE ENTRY (GET DATA)                       
KYWSRTQ  DS    AL2                 SORT KEY LENGTH                              
*                                                                               
KYWIND1  DS    XL1                 INDICATORS                                   
KYWUNQ   EQU   X'80'                  UNIQUE DATA                               
KYWMRG   EQU   X'40'                  MERGEABLE DATA                            
KYWNME   EQU   X'20'                  IDENTIFY AS NAME                          
KYWCDE   EQU   X'10'                  IDENTIFY AS CODE                          
KYWBUD   EQU   X'08'                  BUILD BUDGET DATA                         
KYWXUL   EQU   X'04'                  EXCLUDE UNIT/LEDGER                       
KYWREV   EQU   X'02'                  REVERSE SIGN                              
KYWHXF   EQU   X'01'                  HEX FILLED WITH X'FF'                     
*                                                                               
KYWIND2  DS    XL1                 INDICATORS                                   
KYWAGE   EQU   X'80'                  AGEING COLUMN                             
KYWFC$   EQU   X'40'                  FOREIGN CURRENCY AMOUNT                   
KYWFCSRT EQU   X'20'                  FOREIGN CURRENCY SORTED                   
KYWNOTOT EQU   X'10'                  NO TOTALING FOR THIS COLUMN               
KYWCLI   EQU   X'08'                  SET TO PARSE CLI                          
KYWPRD   EQU   X'04'                  SET TO PARSE PRD                          
KYWCPR   EQU   KYWPRD+KYWCLI          SET TO PARSE CLI/PRD                      
KYWJOB   EQU   X'02'                  SET TO PARSE JOB                          
KYWCPJ   EQU   KYWCLI+KYWPRD+KYWJOB   SET TO PARSE CLI/PRD/JOB                  
KYWEST   EQU   X'01'                  SET TO PARSE ESTIMATE                     
*                                                                               
KYWIND3  DS    XL1                 INDICATORS                                   
KYWSPLT  EQU   X'80'                  SPLIT TYPE DATA                           
KYWTAB   EQU   X'40'                  SPECIAL TABLE BUILD                       
KYWNODEC EQU   X'20'                  No decimal to print                       
KYWSUBA  EQU   X'10'                  Keyword requires Sub Account              
KYWTRNS  EQU   X'08'                  Keyword requires transactions             
KYWEXCP  EQU   X'04'                  Filter exception rules                    
KYWPRTCL EQU   X'02'                  Always print column data                  
KYWRATE  EQU   X'01'                  Put rate in sort key                      
*                                                                               
KYWDCMLS DS    0AL1                Amount type keywords use decimals            
KYW0DEC  EQU   99                     Use no decimal amount                     
KYWTAB#  DS    AL1                 Build table of names                         
KYWNOFF  EQU   NMEOFF                 Office          (Value=1)                 
KYWNOGP  EQU   NMEOGP                 Office Group    (Value=2)                 
KYWNMGP  EQU   NMEMGP                 Media Group     (Value=3)                 
KYWNWGP  EQU   NMEWGP                 Workcode Group  (Value=4)                 
KYWNMD1  EQU   NMEMD1                 Media           (Value=5)                 
KYWEUFD  EQU   6                      Estimate user field                       
KYWSTYP  EQU   7                      Studio type                               
KYWSJTB  EQU   8                      Build SJ info                             
KYWNMD2  EQU   NMEMD2                 Media           (Value=9)                 
KYWNMTX  EQU   NMETAX                 Sales Tax       (Value=10)                
KYWSFL1  EQU   C'1'                   Soft level 1 keyword                      
KYWSFL2  EQU   C'2'                   Soft level 2 keyword                      
KYWSFL3  EQU   C'3'                   Soft level 3 keyword                      
KYWSFL4  EQU   C'4'                   Soft level 4 keyword                      
KYWSFL5  EQU   C'5'                   Soft level 5 keyword                      
KYWSFL6  EQU   C'6'                   Soft level 6 keyword                      
KYWSFL7  EQU   C'7'                   Soft level 7 keyword                      
KYWSFL8  EQU   C'8'                   Soft level 8 keyword                      
KYWSFL9  EQU   C'9'                   Soft level 9 keyword                      
*                                                                               
KYWIND4  DS    XL1                 More indicators                              
KYWBDATE EQU   X'80'                  Use billed date                           
KYWTDATE EQU   X'40'                  Use transfer date                         
KYWWDATE EQU   X'20'                  Use write-off date                        
KYWOKREV EQU   X'10'                  Okay to reverse signs                     
KYWIPCT  EQU   X'08'                  Percent type keyword                      
KYWBUK   EQU   X'04'                  Bucket type                               
KYWBYDTE EQU   X'02'                  KYWREAD is KYWOTHR if on                  
KYWNOSQH EQU   X'01'                  Don't squash data                         
*                                                                               
KYWREAD  DS    AL1                 Read record                                  
KYWORGE  EQU   1                      READ Original estimate record             
KYWCURE  EQU   2                      READ Current estimate record              
KYWHREV  EQU   3                      READ Highest revision estimate            
KYWPERS  EQU   4                      READ Person record                        
KYWSTUD  EQU   5                      READ Studio records pointers              
KYWFLTR  EQU   6                      READ Filter names                         
KYWJSTA  EQU   7                      This will force est defaults              
KYWWKCD  EQU   9                      READ Work code names                      
KYWSTDH  EQU   10                     READ Standard hours                       
KYWEDTH  EQU   11                     READ Edit hours                           
KYWCST$  EQU   12                     READ Allocation cost dollars              
KYWPAY$  EQU   13                     READ Payroll records                      
KYWTHRS  EQU   14                     READ Total hours records ata              
KYWCNDR  EQU   15                     READ Calanders for keyword                
KYWCSTR  EQU   16                     READ Allocation cost rates                
KYWPART  EQU   21                     PART    keyword                           
KYW$GRS  EQU   22                     GRS$    keyword                           
KYW$REV  EQU   23                     REV$    keyword                           
KYWAGET  EQU   24                     AGE1    keyword                           
KYWBLTQ  EQU   25                     BALT or BALTCD keyword                    
KYWSICQ  EQU   26                     STATIC  keyword                           
KYWPPDQ  EQU   27                     PDAY    keyword                           
KYWAUTH  EQU   28                     Read prod authorization record            
KYWPVND  EQU   29                     Read Prod Vendor Side                     
KYWPRCV  EQU   30                     Read Prod Receivable Side                 
KYWPCSH  EQU   31                     Read all Cashflow info                    
KYWPBIL  EQU   32                     Pre-read billing                          
KYWLVL1  EQU   PROCLEVA               33 process level 1 reporting              
KYWLVL2  EQU   PROCLEVB               34 process level 2 reporting              
KYWLVL3  EQU   PROCLEVC               35 process level 3 reporting              
KYWLVL4  EQU   PROCLEVD               44 process level 4 reporting              
KYWPEFD  EQU   46                     Personal effective date keywords          
KYWP$AJ  EQU   47                     Payroll adjusted                          
KYWPORD  EQU   48                     Purchase order type keywords              
KYWCLPO  EQU   49                     Client PO type keywords                   
KYWREST  EQU   50                     Estimate keywords                         
KYWXDAT  EQU   51                     XDATA keyword                             
KYWRESH  EQU   52                     Estimate hours keywords                   
KYWPRNP  EQU   PRNTPLAN               C'P' = 215 read planning estimate         
KYWPRNR  EQU   PRNTREV                C'R' = 217 read revision estimate         
*                                                                               
KYWOTHR  DS    0AL1                Date Types for MONTH/YEAR                    
KYWBMO   EQU   1                      Billed MOA date                           
KYWBIL   EQU   2                      Billed date                               
KYWMOA   EQU   3                      MOA date                                  
KYWACT   EQU   4                      Activity date                             
KYWTRN   EQU   5                      Transaction date                          
KYWDUE   EQU   6                      Due date                                  
KYWPHIS  EQU   8                      Payroll history                           
KYWLVLQ  DS    XL1                 LEVEL information/length                     
KYWSAL   EQU   C'1'                                                             
KYWBEN   EQU   C'2'                                                             
KYWPEN   EQU   C'3'                                                             
KYWHRSH  EQU   C'H'                                                             
*                                                                               
KYWDD#   DS    AL2                 Keyword data dictionary data                 
KYWIND5  DS    XL1                 More indicators                              
KYWMASK  EQU   X'80'               .  Mask (BLANK OUT) person data              
KYWRFILL EQU   X'40'               .  Turn on rowfill indicator                 
KYW1SIDE EQU   X'20'               .  Unique for 1 side of posting              
KYWSPDR  EQU   X'10'               .  Split Debit Data Only                     
KYWDR    EQU   X'08'               .  Debit  Related Amount keyword             
KYWCR    EQU   X'04'               .  Credit Related Amount keyword             
KYWNOBUD EQU   X'02'               .  None budget type keyword                  
KYWISDTE EQU   X'01'               .  Date type keyword                         
KYWIND6  DS    XL1                 More indicators                              
KYWADA   EQU   X'80'               .  Average days allowed (Cashflow)           
KYWFNAME EQU   X'40'               .  Force name so code/name (both)            
KYWNOCDE EQU   X'20'               .  Hide code when printing                   
*&&UK                                                                           
KYWXRATE EQU   X'10'               .  EXR rate col:skip 04 test for $$          
*&&                                                                             
KYWGROUP EQU   X'08'               .  Keyword is in grouping table              
KYWITEM  EQU   X'04'               .  It's an item keyword (UK)                 
KYWCACR  EQU   X'02'               .  Keyword requires c/a keyword too          
*&&UK                                                                           
KYWMESYS EQU   X'01'               .  Keyword requires media sys (UK)           
*&&                                                                             
*                                                                               
KYWSECGP DS    XL1                 Security Group  (Feild# in =SEC)             
KYWSSAL  EQU   1                   .  Salary                                    
KYWSARTE EQU   2                   .  Allocated rates                           
KYWSBRTE EQU   3                   .  Billing   rates                           
KYWSPRTE EQU   4                   .  Payroll   rates                           
KYWSSRTE EQU   5                   .  Sale      rates         (UK)              
KYWSTAX# EQU   5                   .  Tax #     keyword(s)    (US)              
KYWIND7  DS    XL1                 More indicators                              
KYWNOCUR EQU   X'80'               .  No currency prefix on this kyw            
         DS    XL2                 Spare                                        
KYWLNQ   EQU   *-KYWD                                                           
         EJECT ,                                                                
ELMTABD  DSECT                                                                  
ELMCODE  DS    AL1                 Element code                                 
ELMDISP  DS    AL2                 displacment to store address                 
ELMROUT# DS    AL1                 Special Routine number for element           
ELMRNONE EQU   0                   None                                         
ELMRT001 EQU   1                   Routine 1                                    
ELMRT002 EQU   2                   Routine 2                                    
ELMRT003 EQU   3                   Routine 3                                    
ELMRT004 EQU   4                   Routine 4                                    
ELMTBLNQ EQU   *-ELMTABD                                                        
         EJECT ,                                                                
DATAD    DSECT                                                                  
DATAFLTY DS    0X                  X'C5' ELEMENT TYPE                           
DATAFLD  DS    AL4                 DISPLACMENT TO CURRENT DATA                  
DATAIND1 DS    X                   INDICATORS                                   
DATAADR  EQU   X'08'                  DATAFLD HOLDS A(OF A TABLE)               
DATASKP  EQU   X'04'                  SKIP    THIS ELEMENT MATCH                
DATAGEN  EQU   X'02'                  GENERAL FILTER APPLICABLE                 
DATACOL  EQU   X'01'                  COLUMN  FILTER APPLICABLE                 
DATAIND2 DS    X                                                                
DATAUL   DS    CL2                 UNIT/LEDGER INFO IF NEEDED                   
DATAFLTR DS    AL2                 DISPLACEMENT TO A(FILTER DATA)               
DATALNQ  EQU   *-DATAD                                                          
         SPACE 2                                                                
FLTADRD  DSECT                                                                  
FLTFLAG  DS    0X                  FILTER RULE TO APPLY                         
FLTLIST  EQU   X'80'                  +/- LIST TYPE FILTERING                   
*        EQU   X'40'                                                            
FLTMULT  EQU   X'20'                  FILTER FROM X'C5' ELEMENT                 
FLTEXCL  EQU   X'10'                  EXCLUDE FILTER                            
FLTNOUL  EQU   X'08'                  NO UNIT LEDGER                            
FLTWILD  EQU   X'04'                  WILD CARD FILTERING                       
FLTDENO  EQU   X'02'                  DENOMINATOR FILTER ONLY                   
FLTCARD  EQU   X'01'                  REQUEST CARD OVER-RIDE                    
FLTADDR  DS    A                   A(FILTER LIST DATA)                          
FLTTYPE  DS    0X                  ZERO OR X'C5' TYPE                           
FLTDATA  DS    A                   A(FILTER VALUE FROM DATA RECORD)             
FLTADRLQ EQU   *-FLTADRD                                                        
         EJECT ,                                                                
***********************************************************************         
*  Table of editing rules                                             *         
***********************************************************************         
         SPACE 1                                                                
EDITD    DSECT                                                                  
EDITTYPE DS    CL1                 Type of retrieval                            
*              C'C'                .   Execute code                             
*              C'S'                .   Retreive form storage location           
*              C'D'                .   Date conversion                          
*              C'P'                .   Packed amount                            
*              C'B'                .   Binary data                              
EDTREC   EQU   C'R'                .   Data in sort record                      
EDTMVC   EQU   C'X'                .   Use EX MVC                               
EDITSIZE DS    AL1                 New size of area to print in                 
EDITSPCL DS    AL1                 Special                                      
EDITROUT DS    AL1                 Routine to branch to                         
EDTFMTCR EQU   1                   .   Format code                              
EDTFMTNR EQU   2                   .   Format name                              
EDTADDRR EQU   3                   .   Addresses                                
EDTAADRR EQU   4                   .   Agency address                           
EDTOADRR EQU   5                   .   Office address                           
EDTPERDR EQU   6                   .   Period                                   
EDTDTESR EQU   7                   .   Date block                               
EDTBLNKR EQU   8                   .   Blank line                               
EDTPAGER EQU   9                   .   page                                     
EDTTIMER EQU   10                  .   time - B, N or R                         
EDTTTMER EQU   11                  .   Type time - A, M or T                    
EDTSTATR EQU   12                  .   Status                                   
EDTSTAJR EQU   13                  .   Job Status                               
EDTBTYPR EQU   14                  .   Billing type                             
EDTOMEMR EQU   15                  .   Online Memo Narrative                    
EDTGPWCR EQU   16                  .   Group work code type                     
EDTEXP1R EQU   17                  .   Exception reasons                        
EDTEXP2R EQU   18                  .   Priority exception reason                
EDTGPTRR EQU   19                  .   Group transactions                       
EDTCUMER EQU   20                  .   Running total column                     
EDTCONTR EQU   21                  .   Count detail lines                       
EDTAPERR EQU   22                  .   Alternate Period Date                    
EDTPAYTY EQU   23                  .   Payroll Type                             
EDTLOCST EQU   24                  .   Location Status                          
EDTPEDTE EQU   25                  .   Period End date range                    
EDTPIDNO EQU   26                  .   PID Code from number                     
EDTSTATC EQU   27                  .   Static heading data                      
*&&US                                                                           
EDTSTARR EQU   28                  .   Receivable Status                        
*&&                                                                             
EDTSTAVR EQU   29                  .   Vendor Status                            
EDTASIGN EQU   30                  .   Sign of amount (+,-)                     
EDTPIDN2 EQU   31                  .   PID for approver/preparer                
*                                  .   for BrandO and non-BrandO                
EDTLBILL EQU   32                  .   Long bill number                         
EDTLBLL2 EQU   33                  .   Long bill number w/o dashes              
EDTPYMTD EQU   34                  .   Payment method for pay and cash          
EDTPIDN3 EQU   35                  .   PID for T/S approver for BrandO          
EDTZIPC  EQU   36                  .   Edit zip code for xtra 4 bytes           
EDTSTAER EQU   37                  .   Estimate statuses                        
EDTAPMTD EQU   38                  .   Approval method for pay scribe           
EDTPIDN4 EQU   39                  .   PID for BrandO POA approvers             
EDTVATRG EQU   40                  .   VAT region code (UK)                     
EDTPOACK EQU   41                  .   PO acknowledgement status                
EDTESTAR EQU   42                  .   Estimate status (BrO)                    
EDTESACK EQU   43                  .   Estimate acknowledgement status          
EDTSTATY EQU   44                  .   Show Yes if status is on                 
*&&UK                                                                           
EDTTYMAP EQU   45                  .   Type mapping keyword for GROUPM          
EDTMCASH EQU   C'U'                .   Cash allocation                          
EDTMCRD  EQU   C'C'                .   Credit                                   
EDTMINV  EQU   C'I'                .   Invoice                                  
EDTMNBIL EQU   C'F'                .   Non billing                              
*&&                                                                             
EDTPIDN5 EQU   46                  .   PID's email                              
EDTPYMTC EQU   47                  .   Payment method Company                   
         ORG   EDITSPCL            Storage type                                 
EDITSTRG DS    S                                                                
         ORG   EDITSPCL            Date type                                    
EDITDTE1 DS    AL1                                                              
EDITMNTH EQU   100                 Month in packed or binary form               
EDITYEAR EQU   102                 Year  in packed or binary form               
EDITDTE2 DS    AL1                                                              
EDITDC1  EQU   1                   DATCON YYMMDD       YYMM                     
EDITDC5  EQU   5                   DATCON MMMDD/YY     MMM/YY   (US)            
*                                  DATCON DD MMM YY    MMM YY   (UK)            
EDITDC8  EQU   8                   DATCON MMMDD/YY     (9)                      
EDITDC9  EQU   9                   DATCON (8)          MMM/YY                   
EDITDC10 EQU   10                  DATCON MM/DD/YY     MM/YY                    
EDITDC11 EQU   11                  DATCON MMMDD/YY     MMM/YY                   
EDITDC13 EQU   13                  DATCON DD.MM.YY     MM.YY    (UK)            
EDITDC20 EQU   20                  DATCON YYYYMMDD     YYYYMM                   
EDITDC21 EQU   21                  DATCON MMDD/YYYY    (22)                     
EDITDC22 EQU   22                  DATCON (21)         MM/YYYY                  
EDITDC23 EQU   23                  DATCON YYYY-MM-DD   YYYY-MM  (ISO)           
EDITDC30 EQU   30                  DATCON DDMMMYY      MMMYY                    
EDITLNQ  EQU   *-EDITD                                                          
         EJECT ,                                                                
EDWRKD   DSECT                                                                  
EDSIZE   DS    0CL1                                                             
EDPRT    DS    A                                                                
EDDATA@  DS    A                   Start of data                                
EDDATASZ DS    F                   Length of data                               
EDPARM   DS    CL(CURPARML)                                                     
EDNUM    DS    CL60                                                             
EDPACK   DS    PL8                 NUMBER TO EDIT                               
EDFCFLD  DS    CL8                 FOREIGN CURRENCY                             
EDSIZSV  DS    XL1                 SAVE FIELD SIZE IN CASE OF ERROR             
                                                                                
EDFLAG   DS    CL1                 EDIT FLAG                                    
EDCOMMA  EQU   RCLEDCMY            .    PRINT USING COMMAS                      
EDMINUS  EQU   RCLEDTRL            .    SHOW MINUS (trailing default)           
EDZEROB  EQU   RCLEDZRY            .    PRINT ZEROS INSTEAD OF BLANKS           
*        EQU   X'10'               .                                            
EDBRCKT  EQU   RCLEDBKT            .    PRINT MINUS AS BRACKETS                 
EDPRCNT  EQU   RCLPCT              .    PERCENT SIGN                            
EDFLOAT  EQU   RCLEDLED            .    FLOAT LEADING MINUS SIGN                
EDCRDIT  EQU   RCLEDCR             .    PRINT MINUS AS CREDIT                   
EDEND    EQU   *                                                                
         EJECT ,                                                                
SLDGRD   DSECT                                                                  
SLREALA1 DS    CL14                Real account 1                               
SLREALA2 DS    CL14                Real account 2                               
SLREALC1 DS    CL14                Real account contra 1                        
SLREALC2 DS    CL14                Real account contra 2                        
SLFLTRS  DS    CL5                 Real account filters 1-5                     
SLACLN1  DS    XL1                                                              
SLACLN2  DS    XL1                                                              
SLCALN1  DS    XL1                                                              
SLCALN2  DS    XL1                                                              
SLINDS   DS    XL1                                                              
SLPTR    DS    AL4                                                              
SLDGRLNQ EQU   *-SLDGRD                                                         
         SPACE 1                                                                
SLMAPD   DSECT                                                                  
SLMACCT  DS    CL14                Super Ledger account code                    
SLMNME   DS    CL36                Super Leger account name                     
SLMAPLNQ EQU   *-SLMAPD                                                         
         SPACE 1                                                                
SLNODE   DSECT                                                                  
SLSIGN   DS    CL1                 Sign to apply to posting                     
SLPLUS   EQU   C'+'                Keep numbers as is                           
SLMINUS  EQU   C'-'                Reverse value of amounts                     
SLNEXT   DS    AL4                 Next Supper Ledger account to post           
SLNODEQ  EQU   *-SLNODE                                                         
         EJECT ,                                                                
NARRD    DSECT                                                                  
NARLEN1  DS    AL1                                                              
NARSCAN1 DS    CL15                                                             
NARLNQ1  EQU   *-NARRD                                                          
NARLEN2  DS    AL1                                                              
NARSCAN2 DS    CL15                                                             
NARLNQ2  EQU   *-NARRD                                                          
         EJECT ,                                                                
***********************************************************************         
*  DSECT TO COVER LIST OF LEDGERS STRUCTURE INFO                      *         
***********************************************************************         
         SPACE 1                                                                
LDGD     DSECT                                                                  
LDGUL    DS    CL2                                                              
LDGNAME  DS    CL36                UNIT/LEDGER NAME                             
LDGCLIP  DS    XL1                 POSITION OF CLIENT IF ANY                    
LDGOFFP  DS    XL1                 POSITION OF OFFICE IF ANY                    
LDG#LEVS DS    XL1                                                              
LDGLEV1  DS    XL1                 LENGTH OF LEVEL 1                            
LDGLVQ1  DS    XL1                 LENGTH OF LEVEL 1                            
LDGLVNM1 DS    CL15                                                             
LDGLEV2  DS    XL1                 LENGTH OF LEVEL 1+2                          
LDGLVQ2  DS    XL1                 LENGTH OF LEVEL 2                            
LDGLVNM2 DS    CL15                                                             
LDGLEV3  DS    XL1                 LENGTH OF LEVEL 1+2+3                        
LDGLVQ3  DS    XL1                 LENGTH OF LEVEL 3                            
LDGLVNM3 DS    CL15                                                             
LDGLEV4  DS    XL1                 LENGTH OF LEVEL 1+2+3+4                      
LDGLVQ4  DS    XL1                 LENGTH OF LEVEL 4                            
LDGLVNM4 DS    CL15                                                             
LDGAELVS DS    0XL10               Account equivalent structures                
LDGAE_A  DS    XL10                AL1(Total len,Lv1,Lv2,Lv3,etc.)              
LDGAE_B  DS    XL10                                                             
LDGAE_C  DS    XL10                                                             
LDGAE_D  DS    XL10                                                             
LDGAE_E  DS    XL10                                                             
LDGLENQ  EQU   *-LDGD                                                           
LDGAECDS DS    0CL20               Account equivalent codes                     
LDGAEC_A DS    CL20                                                             
LDGAEC_B DS    CL20                                                             
LDGAEC_C DS    CL20                                                             
LDGAEC_D DS    CL20                                                             
LDGAEC_E DS    CL20                                                             
LDGLEN2Q EQU   *-LDGD                                                           
         SPACE 2                                                                
***********************************************************************         
*  DSECT TO COVER BUDGET COLUMN INFO                                  *         
***********************************************************************         
         SPACE 1                                                                
BUDD     DSECT                                                                  
BUDSORT  EQU   *                                                                
BUDACCLN DS    XL1                 BUDGET KEY LENGTH                            
BUD#     DS    XL2                 BUDGET NUMBER                                
BUDSRTLN EQU   *-BUDSORT                                                        
BUDIND   DS    XL1                 Budget indicators                            
BUDCNTRA EQU   X'80'               .  contra levels                             
BUDBYPED EQU   X'40'               .  Post by period calendar                   
BUDBYOF  EQU   X'20'               .  This budget is by office                  
BUDSDTE  DS    XL2                 START DATE OF FIRST BUCKET NEEDED            
BUDEDTE  DS    XL2                 END DATE OF LAST BUCKET NEEDED               
BUDLNQ   EQU   *-BUDD                                                           
         EJECT ,                                                                
***********************************************************************         
*  DSECT TO USER DEFINED KEYWORD TABLE                                *         
***********************************************************************         
         SPACE 1                                                                
UDKRECD  DSECT                                                                  
UDKSEQ   DS    XL1                 SEQUENCE NUMBER FOR KEYWORD                  
UDKEY    DS    CL(L'FINDDATA)                                                   
UDKRECLN DS    CL1                 RECORD LENGTH OF KEYWORD RECORD              
UDKSRTSZ DS    CL1                 MAX SORT SIZE                                
UDKDATSZ DS    CL1                 MAX DATA SIZE                                
UDKFLAGS DS    CL1                 KEYWORD FLAGS                                
UDKLNQ   EQU   *-UDKRECD                                                        
*                                                                               
UDKELD   DSECT                     MULTIPLE FIXED SIZE ELEMENTS                 
UDKUNT   DS    CL1                 KEYWORD UNIT                                 
UDKLDG   DS    CL1                 KEYWORD LEDGER                               
UDKINDX  DS    AL4                 KEYWORD INDEX NUMBER INTO TABLE              
UDKELQ   EQU   *-UDKELD                                                         
         EJECT ,                                                                
***********************************************************************         
*                                                                               
***********************************************************************         
SUBTABD  DSECT                                                                  
SUBDATA  DS    A                   A(Data)                                      
SUBLABEL DS    CL12                Table name / lable                           
SUBMAXL  DS    AL1                 Max length of code field                     
         DS    XL3                                                              
SUBTLNQ  EQU   *-SUBTABD                                                        
                                                                                
***********************************************************************         
* DSECT User tables used to replace/subsitution values                          
***********************************************************************         
UTABD    DSECT                                                                  
UTABHDR  DS    0CL8                User table header                            
UTABLEN  DS    AL4                 Length                                       
UTABTYPE DS    AL1                 Type                                         
UTABXTRN EQU   1                   .  External table                            
UTABROW  EQU   2                   .  Row type                                  
UTABCOL  EQU   3                   .  Column type                               
UTABNUM  DS    AL1                 Row, column number or zero                   
UTABHIND DS    X                   Header indicator                             
UTABSUBT EQU   X'80'               .  Substitute table                          
UTAB#OF  DS    X                   Number of entries                            
UTABDHDR DS    0CL3                User table data header                       
UTABTLEN DS    X                   Total len                                    
UTABCC   DS    X                   Condition code                               
UTABDIND DS    X                   Data indicator                               
UTABINME EQU   X'01'               .  Includes names                            
UTABLNQ  EQU   *-UTABD                                                          
UTABDLEN DS    X                   Data length or EOT (x'FF')                   
UTABDKYW EQU   X'80'               .  Keyword in use                            
UTAB@PAR DS    AL4                 Keyword number                               
UTABKYWQ EQU   *-UTABDLEN                                                       
         ORG   UTAB@PAR                                                         
UTABDATA DS    0CL1                From code/To code/To name                    
         EJECT ,                                                                
***********************************************************************         
*  DSECT TO COVER COLUMN ELEMENT                                      *         
***********************************************************************         
         SPACE 1                                                                
COLD     DSECT                                                                  
COLNUM   DS    XL1                 Column number                                
COLFLAGS DS    XL1                 FOR SPECIAL COLUMN TYPES                     
COLAMT   EQU   X'80'               .   Accumulated column                       
COLCALC  EQU   X'40'               .   Calculated  column                       
COLHIDE  EQU   X'20'               .   Hidden      column                       
COLJOBR  EQU   X'10'               .   Jobber type column                       
COLSPLT  EQU   X'08'               .   Mulitple records for column data         
COLNJEST EQU   X'04'               .   Non-Jobber type estimate column          
COLBUD   EQU   X'02'               .   Budget      column                       
COLSUPDL EQU   X'01'               .   Suppress column detail (print)           
COLOPT   DS    XL1                 MORE COLUMN OPTIONS                          
COLCHUNK EQU   X'80'               .   Column heading was chunked               
COLUDEF  EQU   X'40'               .   User defined column                      
COLFCAMT EQU   X'20'               .   Foreign currency amount column           
COLFCFLT EQU   X'10'               .   Filter col by foreign currency           
COLCZPRT EQU   X'08'               .   COL=ZERO then no print, keep rec         
COLSFTH  EQU   X'04'               .   Soft column headings                     
COLFCALC EQU   X'02'               .   Force calculation for total              
COLCZERO EQU   X'01'               .   COL=ZERO then eliminate record           
COLDATES DS    XL1                 DATE BASES                                   
COLBMOA  EQU   1                   .   Billed MOA                               
COLBDTE  EQU   2                   .   Billed date                              
COLMDTE  EQU   3                   .   MOA date                                 
COLADTE  EQU   4                   .   Activity date                            
COLTDTE  EQU   5                   .   Transaction date                         
COLDDTE  EQU   6                   .   Due date                                 
COLSDTE  EQU   7                   .   Statement date                           
COLPDTE  EQU   8                   .   Payroll history date                     
COLMOS   EQU   9                   .   MOS date                                 
COLINDEX DS    A                   Array index into DATAPOOL                    
COLSEC#  DS    AL1                 Security field #                             
COLOPT2  DS    XL1                 MORE OPTIONS                                 
COLNORND EQU   X'80'               .   Don't round prior to printing            
COLREVSG EQU   X'40'               .   Reverse sign based on ROWREVSG           
COLFCPRT EQU   X'20'               .   Force column to print/copy down          
COLSHRT  EQU   X'10'               .   Workcode short                           
COLTHRS  EQU   X'08'               .   Total hours column                       
COLVPCT  EQU   X'04'               .   Vertical %                               
COLDSKIP EQU   X'02'               .   Skip date check                          
COLNOSQH EQU   X'01'               .   Don't squash data                        
COLSIZE  DS    AL1                 Column size                                  
COLSRTSZ DS    AL2                 SIZE OF ACTUAL SORT FIELD                    
COLDATSZ DS    AL1                 SIZE OF ACTUAL DATA FIELD                    
COLPAY#  DS    0AL1                Payroll column in P$TELD elements            
COLAGE#  DS    AL1                 Age     column in JBAGECOL table             
COLDSP   DS    Y                   DISPLACEMENT INTO SORTREC                    
COLAROW  DS    A                   COLUMN POINTER TO ROW ADDRESS                
COLPRT   DS    A                   COLUMN PRINT ADDRESS                         
COLXTRA  DS    A                   EQUATION FOR COLUMN CALCULATION              
COLBUD#  DS    AL2                                                              
COLUDSEQ DS    AL1                 USER DEFINED SEQUENCE NUMBER                 
COLJOBRC DS    AL1                 JOBBER OUTPUT COLUMN NUMBER OR               
*                                    PRNENTBL ENTRY NUMBER                      
COLACM   DS    Y                   DISPLACEMENT INTO ROW ACCUMS.                
COLSTART DS    XL3                 START DATE FOR COLUMN                        
COLEND   DS    XL3                 END DATE FOR COLUMN                          
*                                                                               
COLALTST DS    XL3                 ALTERNATE START DATE                         
COLALTEN DS    XL3                 ALTERNATE END DATE                           
         ORG   COLALTST            RE-USE 6 BYTES FOR "PERSON SCRIBE"           
COLDTTYP DS    XL1                 COLUMN date type                             
COL2DTE  EQU   X'80'               .   Period to date (YTD, QTD)                
COLYEAR  EQU   X'40'               .   Year                                     
COLQTR   EQU   X'20'               .   Quarter                                  
COLPFX#  EQU   X'01'               .   Fixed period # type                      
COLPRNG  EQU   X'02'               .   Period range of a month                  
COLPMON  EQU   X'04'               .   Period within a month                    
COLMNTH  EQU   X'08'               .   ST/END month determine range             
COLPERYR DS    XL1                 Year period number belings to                
COLPERST DS    AL1                 Start period#, fixed or relative             
COLPERED DS    AL1                 End   period#                                
COLCALY1 DS    XL1                 Calendar year for start date                 
COLCALY2 DS    XL1                 Calendar year for end   date                 
*                                                                               
COLCSMOA DS    XL2                 Calendar start MOA for period                
COLCEMOA DS    XL2                 Calendar end   MOA for period                
COLEQUTN DS    0A                  Equation for calculation (DDLINK)            
COLFLT2  DS    0A                  Denominator filters for PCT, PCTCLI          
COLFILT  DS    A                   Stupid user fields filtering                 
COLFLTS  DS    A                   Column filters                               
COLIND1  DS    XL1                 MORE indicators                              
COLPADJ$ EQU   X'80'               .   Payroll adjusted keywords                
COLBUKDR EQU   X'40'               .   Post column by DR bucket                 
COLPAY$  EQU   X'20'               .   Payroll history keywords                 
COLPART  EQU   X'10'               .   Partial payment column                   
COLCNDR  EQU   X'08'               .   Uses calendars                           
COLRANGE EQU   X'04'               .   Column has MIN/MAX range                 
COLSHRS  EQU   X'02'               .   Standard hours                           
COLEHRS  EQU   X'01'               .   Edit     hours                           
COLIND2  DS    XL1                 MORE indicators                              
COLDCALC EQU   X'80'               .   Force column calc. at detail lvl         
COLRATE  EQU   X'40'               .   Rate type keyword                        
COLRNDBF EQU   X'20'               .   Round before processing                  
COLRCALC EQU   X'10'               .   Rate calculation                         
COLREVBK EQU   X'08'               .   Reverse sign for bucket                  
COLPZERO EQU   X'04'               .   Print zero not blank                     
COLSUPR2 EQU   X'02'               .   Super column 2nd heading                 
COLSTATC EQU   X'01'               .   Static type column                       
COLSTACK DS    XL1                 Column to stack under                        
COLSCTOP DS    XL1                 Stack column # on top                        
COLSCPWD DS    XL1                 Stack column Prefix width                    
COLDTE#  DS    XL1                 Entry # in DTED DSECT                        
COLTOTLV DS    CL1                 Total levels down to this number             
COLROUND DS    AL1                 Round number N places                        
COLFCCDE DS    CL3                 Currency code                                
COLFCGRP DS    0XL5                                                             
COLDCMLS DS    AL1                 Number of decimal places                     
COLCURED DS    XL1                 Currency edit indicators                     
COLCSYSM DS    CL3                 Currency edit sysmbol                        
COLHEAD1 DS    A                   Location of 1st column heading text          
COLHEAD2 DS    A                   Location of 2nd column heading text          
COLHEAD3 DS    A                   Location of 3rd column heading text          
COLDATE  DS    A                   Post in column by this date                  
COLDUB   DS    PL8                 Running total amount                         
*                                  These are constant for person                
COLHOURS DS    0PL4                Standard or Edit hours or # MTS              
COLTOACT DS    0PL4                Total periods active for                     
COLTOMTS DS    PL4                 Total missing time sheets                    
COLTOTHR DS    PL4                 Total hours                                  
COLPROLL DS    0PL4                Payroll dollar for column                    
COLTOT1C DS    PL4                 Total 1C hours                               
COLMTHD  DS    CL1                                                              
COLBUCK  DS    CL1                                                              
COLMINCC DS    XL1                                                              
COLMAXCC DS    XL1                                                              
COLRTOTS DS    XL4                 Bit per row to total or not (32 max)         
         DS    XL4                 Spare - may need to expand COLRTOTS          
COLMIN$  DS    PL6                 Not active                                   
COLMAX$  DS    PL6                 Not active                                   
COLDD#   DS    AL2                 Dictionary number                            
COL#DEC  DS    AL1                 Number of decimals stored as                 
COLSCLVL DS    AL1                 Stack column level when printing             
COLKYWD  DS    CL6                 Jobber or column calculation saved           
COLTPEDS DS    PL2                 Total periods for calender range             
COLIND3  DS    XL1                 More column indicators                       
COLCALDT EQU   X'80'               .   Date type calculation                    
COLNASRT EQU   X'40'               .   Don't add columns out of sorter          
COLNATSR EQU   X'20'               .   Don't add columns in tsar                
COLBYACT EQU   X'10'               .   Posted by account was done               
COLULN   EQU   X'08'               .   Don't underline                          
COLULA   EQU   X'04'               .   Above underline                          
COLULB   EQU   X'02'               .   Below underline                          
COLALVL$ EQU   X'01'               .   Put amount into COLDUB (Acc lvl)         
COLEDOPT DS    XL1                                                              
COLCOMMA EQU   RCLEDCMY      X'80' .   Print commas                             
COLTRIAL EQU   RCLEDTRL      X'40' .   Trailing minus sign                      
COLEDZRO EQU   RCLEDZRY      X'20' .   Print zero instead of blank              
*        EQU   X'10'               .   ***** Do not use ***** Currency          
COLBRCKT EQU   RCLEDBKT      X'08' .   Print minus as brackets                  
COLPCT   EQU   RCLPCT        X'04' .   Percentage  column                       
COLLEADM EQU   RCLEDLED      X'02' .   Print leading minus sign                 
COLEDCR  EQU   RCLEDCR       X'01' .   Print CR or DR sign                      
COLULINE DS    XL1                 Column underline character                   
COLDTIDX DS    AL1                 Column date index into DATEFMT               
COLIND4  DS    XL1                 Column indicator                             
COLCONST EQU   X'80'               .  Constant / Rate                           
COLNOSEC EQU   X'40'               .  Security denied on column                 
COL2HIDE EQU   X'10'               .  Set for DDLINK that it is hidden          
COLBLKHD EQU   X'08'               .  Blank heading (Stack info)                
COLNCZAM EQU   X'04'               .  Don't check zero amount                   
COLCFAV  EQU   X'02'               .  Cashflow Average Days                     
COLRIGHT EQU   X'01'               .  Right justify                             
COLCLVL  DS    AL1                 Column level for expand/collapse             
COLXLNK  DS    AL1                 Column link to other columns                 
COLNODE# DS    AL1                 Data node number for PC decoding             
COLMAP#  DS    AL1                 Data map number for DDLINK                   
COLSEQ#  DS    AL1                 Column # sequence w/no hidden cols           
COLPRTSQ DS    AL1                 True   printing   sequence array             
COLDDLSQ DS    AL1                 DDLINK processing sequence array             
COLXTRN# DS    AL1                 External replacement table index #           
COLIND5  DS    XL1                 Column indicators                            
COLIETY  EQU   X'80'               . Inc Estimated time val in Net/Grs          
COLIETN  EQU   X'40'               . Exc Estimated time val in Net/Grs          
COLIETO  EQU   X'20'               . Only Estimatd time val in Net/Grs          
COLNJESR EQU   X'10'               . Non-Jobber estimate hours column           
*&&UK                                                                           
COLNBISB EQU   X'08'               . Brandocean Invs status Submitted           
COLNBIPA EQU   X'04'               . Brandocean Invs status Part-aprvd          
COLNBIAP EQU   X'02'               . Brandocean Invs status Approved            
COLNBIRJ EQU   X'01'               . Brandocean Invs status Rejected            
*&&                                                                             
*&&UK                                                                           
COLIND6  DS    XL1                 Column indicators                            
COLXRATE EQU   X'80'               . EXR rate col:skip 04 test for $$           
COLNOCUR EQU   X'40'               . No currency prefix on this column          
         DS    XL5                 Spare                                        
*&&                                                                             
*&&US                                                                           
         DS    XL6                 Spare                                        
*&&                                                                             
COLLNQ   EQU   *-COLD                                                           
         EJECT ,                                                                
***********************************************************************         
*  DSECT TO COVER ROW TABLE                                           *         
***********************************************************************         
         SPACE 1                                                                
ROWD     DSECT                                                                  
ROWNUM   DS    XL1                 Sequence number                              
ROWFLAGS DS    XL1                 SPECIAL FLAGS                                
ROWTOTAL EQU   X'80'               .  Total    at this row level                
ROWNEWPG EQU   X'40'               .  New page at this row level                
ROWBOTH  EQU   ROWCDE+ROWNME       .  Print code and name                       
ROWNME   EQU   X'20'               .  Print name                                
ROWCDE   EQU   X'10'               .  Print code                                
ROWTSPPG EQU   X'08'               .  Print total on seperate page              
ROWADDR  EQU   X'04'               .  Print address                             
ROWUNQ   EQU   X'02'               .  Row key/data is unique                    
ROW1SIDE EQU   X'01'               .  Row data is unique for 1 side             
ROWTYPE  DS    CL1                 (L,C,R)-HEADLINE, M-MIDLINE                  
ROWCOL   EQU   C'*'                .  Row made from column                      
ROWDTEC  EQU   C'D'                .  Date calculation     (Row column)         
ROWCNTR  EQU   C'C'                .  Centered   row heading                    
ROWLEFT  EQU   C'L'                .  Left side  row heading                    
ROWRGHT  EQU   C'R'                .  Right side row heading                    
ROWMID   EQU   C'M'                .  Mid-line   row                            
ROWNOSHW EQU   C'N'                .  Hide       row                            
ROWNOSEC EQU   C'N'                .  Security suppressed                       
ROWLVLSZ DS    AL1                 Size of portion of level                     
ROWINDEX DS    A                   Array index into DATAPOOL                    
ROWKYIND DS    XL1                 KEY DATA INFORMATION                         
ROWKYSPL EQU   X'80'               .  Split keys for data type                  
ROWKYXFF EQU   X'40'               .  Clear to hex FF'S                         
ROWKYNME EQU   X'20'               .  Name type key                             
ROWKYCDE EQU   X'10'               .  Code type key                             
ROWKYSDR EQU   X'08'               .  Split Debit Only                          
ROWKYVRT EQU   X'04'               .  Vertical percent type                     
ROWKYLVL EQU   X'02'               .  Sort on only level of key                 
ROWKYMRG EQU   X'01'               .  Key data can be merged                    
ROWKYSZ  DS    AL2                 Key data size                                
ROWKYDSP DS    Y                   Displacement into sort record                
ROWDAIND DS    XL1                 DATA INFORMATION                             
*&&US                                                                           
ROWXCOL  EQU   X'80'               .  Hide col and don't put to sort            
*&&                                                                             
ROWDAXFF EQU   X'40'               .  Clear to hex FF'S                         
*&&US                                                                           
ROWBDR   EQU   X'20'               .  row uses BDR attribute                    
*&&                                                                             
ROWDACDE EQU   X'10'               .  Code type data                            
ROWDAYMD EQU   X'08'               .  Date type data YMD                        
ROWIDXON EQU   X'04'               .  Data indexing on                          
ROWDALVL EQU   X'02'               .  Sort on only level of key                 
ROWNOCDE EQU   X'01'               .  Hide code when printing                   
ROWDASZ  DS    AL1                 Name data size                               
ROWDADSP DS    Y                   Displacement into sort record                
ROWXPIND DS    XL1                 Extra inforamtion                            
ROWXPADR EQU   X'80'               .  Address pointer                           
ROWWIPE  EQU   X'40'               .  On condiction FMTNOCB wipe data           
ROWRATE  EQU   X'20'               .  Row is a rate from a column               
ROWREPTB EQU   X'10'               .  Replace table  type                       
ROWNOSRT EQU   X'08'               .  None sort data type                       
ROWXPSIZ DS    AL1                 Address data size                            
ROWXPDSP DS    Y                   Displacement into sort record                
ROWOPT   DS    XL1                 MORE FLAGS                                   
ROWPGNO  EQU   X'80'               .  Reset page number on row change           
ROWUDEF  EQU   X'40'               .  User defind row keyword type              
ROWPBTM  EQU   X'20'               .  Print total at bottom of page             
ROWSHRT  EQU   X'10'               .  Short workcode name                       
ROWFILL  EQU   X'08'               .  Fill data, DR/CR out of order             
ROWNOREV EQU   X'04'               .  Reverse row sign                          
ROWREV   EQU   X'02'               .  Over-ride reverse row sign                
ROWNOSQH EQU   X'01'               .  Don't squash data                         
ROWNREC  DS    AL1                 0,1,2 (or more) records printed              
ROWSTATE DS    CL1                 CURRENT STATE OF ROW                         
ROWPTTOT EQU   C'P'                .  P - Force printing total                  
ROWCLEAR EQU   C'C'                .  C - Clear Accums,                         
ROWPTMID EQU   C'M'                .  M - Print mid-line                        
ROWIDLE  EQU   C'I'                .  I - Idle, do nothing for now              
ROWPRTSZ DS    AL1                 Size to print 'TOTAL FOR XXXX'               
ROWUDSEQ DS    AL1                 User Defined sequence number                 
ROWDATES DS    XL1                 Date type for MONTH/YEAR keyword             
ROWPRNE# DS    AL1                 Planning or revision number entry #          
ROWMASKL DS    XL1                 Length of masked data                        
ROWRECAP DS    AL1                 Recap number for row                         
ROWNODE# DS    AL1                 Data node number for PC decoding             
ROWMAP#  DS    AL1                 Data map number for DDLINK                   
ROWDTIDX DS    AL1                 Date form, index into DATEFMT                
ROWACOL  DS    A                   A(Column data)                               
ROWPRTAD DS    A                   Where to print 'TOTAL FOR XXXX'              
ROWACM   DS    A                   A(Accumulator row)                           
ROWVPACM DS    A                   A(Vertical % accumulated row)                
ROWPRFX  DS    A                   A(Row prefix)                                
ROWFILT  DS    A                   Filter row based on                          
ROWCON   DS    A                   Row conditional substitution                 
ROWSEC#  DS    AL1                 Security field #                             
ROWGPIDX DS    XL1                 Keyword group index, Accent                  
ROWDD#   DS    AL2                 Row data dictionary #                        
ROWXTRN# DS    AL1                 External replacement table index #           
         DS    XL7                 Spare                                        
ROWLNQ   EQU   *-ROWD                                                           
         EJECT ,                                                                
***********************************************************************         
*  DSECT TO COVER HEAD ELEMENTS TABLE                                 *         
***********************************************************************         
         SPACE 1                                                                
HEADD    DSECT                                                                  
HEADNUM  DS    XL1                 SEQUENCE NUMBER                              
HEADFLAG DS    XL1                 SPECIAL FLAGS                                
HEADFREE EQU   RHDFREE               X'80' HEADING FREE FORM                    
HEADDEF  EQU   RHDDEF                X'40' KEYWORD DEFINED HEADING              
HEADROW  EQU   RHDROW                X'20' HEADING CREATED FORM ROW             
HEADADR  EQU   RHDADR                X'04' HEADING ADDRESS                      
HEADPRFX EQU   X'02'                 X'02' HEADING PREFIX FROM ROW              
*                                    X'01' DICTIONARY FORM                      
HEADTYPE DS    XL1                 HEADING TYPES                                
HEADTITL EQU   RHDTITL               X'01' TITLE  HEADING                       
HEADCNTR EQU   RHDCNTR               X'02' CENTER HEADING                       
HEADLEFT EQU   RHDLFTH               X'03' LEFT   HEADING                       
HEADRGHT EQU   RHDRHTH               X'04' RIGHT  HEADING                       
HEADFOOT EQU   RHDFTLN               X'05' FOOTLINE                             
HEADSEQ  DS    AL1                                                              
HEADLN   DS    AL1                                                              
HEADOPTS DS    XL1                                                              
HEADNME  EQU   X'20'               .  Print name (from row)                     
HEADCDE  EQU   X'10'               .  Print code (from row)                     
HEADDISP DS    Y                                                                
HEADINDX DS    A                   INDEX INTO DATAPOOL TABLE                    
HEADPTR  DS    A                   POINTER TO ROW OR FREEFORM DATA              
HEADLNQ  EQU   *-HEADD                                                          
         EJECT ,                                                                
***********************************************************************         
*  PARSE DATA CONTROL DESECT, EXTRACT DATA FOM SYSTEM                 *         
***********************************************************************         
         SPACE 1                                                                
PARSED   DSECT                                                                  
PARTYPE  DS    CL1                 Type of parse data to retrieve               
STORAGE  EQU   C'S'                .   S(Data in storage location)              
ELMTYPE  EQU   C'A'                .   A(Element)                               
ELEMENT  EQU   C'E'                .   Getel to get specific element            
KEYTYPE  EQU   C'K'                .   Data in key                              
DATABLK  EQU   C'K'                .   Data in block                            
CALTYPE  EQU   C'M'                .   Calculation - M form Math                
APDTYPE  EQU   C'+'                .   Append together keyword data             
CODE     EQU   C'C'                .   Branch to code                           
*                                                                               
PARELEM  DS    XL1                 Element code (Don't mess with table)         
PARBASE  DS    S                   Base/Disp of key or element address          
* See ROUTLIST in ACREPRL06        If PARTYPE = CODE then routine               
PARC01   EQU   1                   .   Get account name                         
PARC02   EQU   2                   .   Get Unit/Ledger name                     
PARC03   EQU   3                   .   Get PRNENTBL data                        
PARC04   EQU   4                   .   Get office name                          
PARC05   EQU   5                   .   Get cost name                            
PARC06   EQU   6                   .   Get cost code                            
PARC07   EQU   7                   .   Get NUM2                                 
PARC08   EQU   8                   .   Build SJ client                          
PARC09   EQU   9                   .   Build SJ product                         
PARC10   EQU   10                  .   Build SJ job                             
PARC11   EQU   11                  .   Build SJ product group client            
PARC12   EQU   12                  .   Build SJ product group product           
PARC13   EQU   13                  .   Get product group client                 
PARC14   EQU   14                  .   Get product group product                
PARC15   EQU   15                  .   Used to extract head1 into col.          
PARC16   EQU   16                  .   Filter of purchase order status          
PARC17   EQU   17                  .   SPARE                                    
PARC18   EQU   18                  .   Get foreign currency name                
PARC19   EQU   19                  .   Get studio type name                     
PARC20   EQU   20                  .   Get studio cli or product name           
PARC21   EQU   21                  .   Get studio job name                      
PARC22   EQU   22                  .   Get BALT for production                  
PARC23   EQU   23                  .   Get allocated amounts                    
PARC24   EQU   24                  .   Get payroll amounts                      
PARC25   EQU   25                  .   N/D                                      
PARC26   EQU   26                  .   Zone/edition                             
PARC27   EQU   27                  .   MTS/MWR (MWR future)                     
PARC28   EQU   28                  .   SJ account equivalents on SR             
PARC29   EQU   29                  .   SJ client group billing                  
PARC30   EQU   30                  .   Get job comment                          
PARC31   EQU   31                  .   Get sales rage              (UK)         
PARC32   EQU   32                  .   Get equivalent name                      
PARC33   EQU   33                  .   General unique account # per run         
PARC34   EQU   34                  .   Billing type for previous bill           
PARC35   EQU   35                  .   Get XJob Desktop comments                
PARC36   EQU   36                  .   EFT/CHECK payment method for pay         
PARC37   EQU   37                  .   EFT/CHECK paymnt method for cash         
PARC38   EQU   38                  .   Get freelancer status                    
PARC39   EQU   39                  .   Get country name                         
PARC40   EQU   40                  .   Get VAT number for SJ (UK)               
PARC41   EQU   41                  .   Get country code for SJ (UK)             
PARC42   EQU   42                  .   Get hours from timesheet                 
PARC43   EQU   43                  .   Get Expenditure type name                
PARC44   EQU   44                  .   Get Name of Day (e.g Mon, Tue)           
PARC45   EQU   45                  .   Get Media buy serial number              
PARC46   EQU   46                  .   Get Job description                      
*&&US                                                                           
PARC47   EQU   47                  .   N/D                                      
*&&                                                                             
*&&UK                                                                           
PARC47   EQU   47                  .   Get transaction serial no.               
PARC48   EQU   48                                                               
PARC49   EQU   49                                                               
PARC50   EQU   50                                                               
PARC51   EQU   51                                                               
PARC52   EQU   52                                                               
PARC53   EQU   53                                                               
PARC54   EQU   54                  .  Get tx ref_serial no. (GRPMUK)            
PARC55   EQU   55                  .  Get FC amount with shift (GRPMUK)         
PARC56   EQU   56                  .  Get office group code (UK)                
PARC57   EQU   57                  .  Get a/c billing group (GRPMUK)            
PARC58   EQU   58                  .  Get SR a/c billing group (GRPMUK)         
PARC59   EQU   59                  .  Get Item description                      
PARC60   EQU   60                  .  Get type indicator (GRPMUK)               
PARC61   EQU   61                  .  Get receipt num (GRPMUK)                  
PARC62   EQU   62                  .  Get operation code (GRPMUK)               
PARC63   EQU   63                                                               
PARC64   EQU   64                                                               
PARC65   EQU   65                                                               
*&&                                                                             
*                                                                               
PARIND1  DS    AL1                 Parse indicators 1                           
PARPAD40 EQU   X'80'               .   Pad fill with X'40'                      
PARBUD   EQU   X'40'               .   Budget mode only data                    
PARSPLT  EQU   X'20'               .   Split data for multiple elements         
PARTTYP  EQU   X'10'               .   Include transaction type filter          
PARLDG   EQU   X'08'               .   Specific ledger filter                   
PARMULT  EQU   X'04'               .   Multiple elements possible               
PAROTH   EQU   X'02'               .   Compare to storage value @ S()           
PARADJ   EQU   X'01'               .   Adjust A() by key len for GETEL          
PARIND2  DS    AL1                 Parse indicators 2                           
PARDR    EQU   X'80'               .   Only process debits                      
PARCR    EQU   X'40'               .   Only process credits                     
PARFDSP  EQU   X'20'               .   Adjust displacement in TABRUN            
PARSHFT  EQU   X'10'               .   Shift packed amount                      
PARNEG   EQU   X'08'               .   Reverse sign                             
PARXTYP  EQU   X'04'               .   Exclude transaction type filter          
PAREXNM  EQU   X'02'               .   Excute LEN FOR NAME TYPE DATA            
PARBUDO  EQU   X'01'               .   Budget parse only                        
*                                                                               
PARIND3  DS    AL1                                                              
PARELLN  EQU   X'80'               .   Elem len = PARTTYP2                      
PARULSAV EQU   X'40'               .   Save U/L in PARSAVUL (PARV01)            
PARULRST EQU   X'20'               .   Restore U/L from PARSAVUL                
PARVALUL EQU   X'10'               .   U/L in xtra must match Acct U/L          
PARMODE  EQU   X'08'               .   Only parse for specified mode            
PARBLKOK EQU   X'04'               .   Blank data is ok                         
PARVCUL  EQU   X'02'               .   Validate contra unit/ledger              
PARFRCE  EQU   X'01'               .   Force to get data in split mode          
*                                                                               
PARIND4  DS    AL1                                                              
PARELNH  EQU   X'80'               .   Elm len <= PARTTYP2                      
PARAMST  EQU   X'40'               .   Record is a master type                  
*&&UK                                                                           
PARXADJ  EQU   X'20'               .   Don't ADJTAB adjust l'this entry         
*&&                                                                             
*                                                                               
PARLDGRS DS    AL4                 Valid ledgers to parse for                   
PARALL   EQU   X'FFFFFFFF'             ALL Ledgers                              
*                                                                               
PARRCV   EQU   X'00000007'             SA/SB/SR                                 
PAR_SR   EQU   X'00000001'             .   Receivables by SR                    
PAR_SA   EQU   X'00000002'             .   Receivables by SA                    
PAR_SB   EQU   X'00000004'             .   Receivables by SB                    
*                                                                               
PARINC   EQU   X'00400018'             SI/1C/SK                                 
PAR_SI   EQU   X'00000008'             .   Income by SI                         
PAR_1C   EQU   X'00000010'             .   Income by 1C                         
PAR_SK   EQU   X'00400000'             .   Income by SK                         
*&&US                                                                           
PARPAY   EQU   X'00083FE0'  9/15/99    SP/SQ/SS/ST/SU/SV/SW/SX/SY/2C/SF         
*&&                                                                             
*&&UK                                                                           
PARPAY   EQU   X'00009500'  14/12/07   SF/ST/SV/SX                              
*&&                                                                             
PAR_SP   EQU   X'00000020'             .   Print                                
PAR_SQ   EQU   X'00000040'             .   Print           - Canadian           
PAR_SS   EQU   X'00000080'             .   Spot                                 
PAR_ST   EQU   X'00000100'             .   Spot            - Canadian           
PAR_SU   EQU   X'00000200'             .   Net                                  
PAR_SV   EQU   X'00000400'             .   Vendor                               
PAR_SW   EQU   X'00000800'             .   Production      - Canadian           
PAR_SX   EQU   X'00001000'             .   Expense vendors                      
PAR_SY   EQU   X'00002000'             .   Employee                             
PAR_2C   EQU   X'00080000'             .   1099 vendors                         
*&&US                                                                           
PARPAY2  EQU   X'00003C00'             .   SV/SW/SX/SY                          
PAREXP   EQU   X'0003C004'             SB/SE/SL/2D/SF                           
PARPAY3  EQU   X'000003E0'             SP/SQ/SS/ST/SU                           
*&&                                                                             
*&&UK                                                                           
PAREXP   EQU   X'00064000'             SE/2D/2P                                 
*&&                                                                             
PAR_SE   EQU   X'00004000'             .   Expenses                             
PAR_SF   EQU   X'00008000'             .   Fixed assets                         
PAR_SL   EQU   X'00010000'             .   Leasehold     ???                    
PAR_2D   EQU   X'00020000'             .   Department                           
PAR_2P   EQU   X'00040000'             .   Person                               
*        EQU   X'00000004'             .   Expenses by SB                       
PAR_SJ   EQU   X'00100000'             Production                               
PAR_1R   EQU   X'00200000'             Person            (Manpower)             
PAR_SC   EQU   X'00800000'             Cash                                     
PARGEN   EQU   X'03000000'             General ledger                           
PAR_GB   EQU   X'01000000'             .   Balance sheet                        
PAR_GP   EQU   X'02000000'             .   Profit/Loss                          
PAR_SG   EQU   X'40000000'             .   Taxes                                
PAR_SZ   EQU   X'80000000'             Media control                            
PARDSPEL DS    Y                   Displacement to element data                 
PARDSPTT DS    Y                   Displacement to test    data                 
PARFRLEN DS    H                   Length of input  data or DATCON type         
PARTOLEN DS    H                   Length of output data or DATCON type         
PARFRTYP DS    CL1                 Type of input                                
BINARY   EQU   C'B'                .   Binary                                   
CHAR     EQU   C'C'                .   Character                                
DATETYPE EQU   C'D'                .   Date                                     
PACK     EQU   C'P'                .   Packed                                   
USGNPACK EQU   C'U'                .   Unsigned packed                          
PARTOTYP DS    CL1                 Type of output                               
PARTEST  DS    CL1                 Test character/type                          
VALCODE  EQU   X'FF'               .   Branch to validation code                
PARCC    DS    XL1                 Condition code for testing                   
PARXTRA  DS    CL2                 extra information for validation             
         ORG   PARXTRA                                                          
PARTTYP1 DS    AL1                 Transaction type 1 filter                    
PARTTYP2 DS    AL1                 Transaction type 2 filter                    
PARADDR  DS    A                   A(Routine # or alternate parse)              
*                                                                               
CLC_1    EQU   1                   Compare for length one                       
TM       EQU   2                   Test under mask                              
CLC_2    EQU   35                  Compare for length two                       
* See PARVLIST in ACREPRL06                                                     
PARV01   EQU   1                   .  Compare character to validate             
PARV02   EQU   2                   .  Test bit to validate                      
PARV03   EQU   3                   .  Age valdiation for transaction            
PARV04   EQU   4                   .  Age foreign currency         (UK)         
PARV05   EQU   5                   .  Age PAY foreign currency     (UK)         
PARV06   EQU   6                   .  Get void  date from narrative             
PARV07   EQU   7                   .  Get other data from narrative             
PARV08   EQU   8                   .  Fix date for bad MOS's                    
PARV09   EQU   9                   .  Get account form X'C0' element            
PARV10   EQU   10                  .  Get brand code               (US)         
PARV11   EQU   11                  .  Get brand name               (US)         
PARV12   EQU   12                  .  Media MOS for broadcast                   
PARV13   EQU   13                  .  Media MOS for payables                    
PARV14   EQU   14                  .  Get narrative                             
PARV15   EQU   15                  .  Validate an address at level              
PARV16   EQU   16                  .  Contra fix                                
PARV17   EQU   17                  .  Validate user field                       
PARV18   EQU   18                  .  User field media prod group code          
PARV19   EQU   19                  .  User field media prod group name          
PARV20   EQU   20                  .  Validate if commissionable                
PARV21   EQU   21                  .  Foreign currency aging       (UK)         
PARV22   EQU   22                  .  NAND characters with bits                 
PARV23   EQU   23                  .  Convert writeoffs                         
PARV24   EQU   24                  .  On-line memo account                      
PARV25   EQU   25                  .  Time element type convert                 
PARV26   EQU   26                  .  PCT keyword                               
PARV27   EQU   27                  .  Validate REP code                         
PARV28   EQU   28                  .  Convert Type Time for TMS                 
PARV29   EQU   29                  .  Workcode long vs. short name              
PARV30   EQU   30                  .  Check number                              
PARV31   EQU   31                  .  Add up Vat amounts           (UK)         
PARV32   EQU   32                  .  Payroll amounts/rates                     
PARV33   EQU   33                  .  Payroll code/name                         
PARV34   EQU   34                  .  Get contactor name           (US)         
PARV35   EQU   35                  .  Two byte contiguous compare  (US)         
PARV36   EQU   36                  .  Billing type for DR from 99s              
PARV37   EQU   37                  .  Control Date for Cashflow (US)            
PARV38   EQU   38                  .  Get QST or HST (US)                       
PARV39   EQU   39                  .  Fix LBILL ref # for type 6                
PARV40   EQU   40                  .  Fix LBILL bill # for type 9               
PARV41   EQU   41                  .  Fix LBLLND bill # for type 9              
PARV42   EQU   42                  .  Fix LBLLND ref # for type 6               
PARV43   EQU   43                  .  Get reversed status (Yes/No)              
PARV44   EQU   44                  .  Get country code                          
PARV45   EQU   45                  .  Get Account from X'4F' element            
PARV46   EQU   46                  .  Get Extra data                            
PARV47   EQU   47                  .  Get memo value (UK)                       
PARV48   EQU   48                  .  Adust amt from B2 element                 
PARV49   EQU   49                  .  Fix sys/media code for Net SM2C           
PARV50   EQU   50                  .  Hardcode client name for Y&R              
PARV51   EQU   51                  .  Get 8 byte pid name                       
PARV52   EQU   52                  .  Get Timesheet (reversed)                  
PARV53   EQU   53                  .  Get Estimate (local) number               
PARV54   EQU   54                  .  Get Est status                            
PARV55   EQU   55                  .  Translate Estimate status bytes           
PARV56   EQU   56                  .  Get Estimate extra data                   
PARV57   EQU   57                  .  Extra Estimate filtering                  
PARV58   EQU   58                  .  Store wc type based on B2 elem            
PARV59   EQU   59                  .  Get Estimate name                         
PARV60   EQU   60                  .  Get Estimate currency name                
*&&UK                                                                           
PARV61   EQU   61                  .  Get Creditor payment method               
PARV62   EQU   62                  .  Get Con/Sec person name                   
PARV63   EQU   63                  .  Get Br'Ocean Invoice status               
PARV64   EQU   64                  .  Get tx type mapping to a column           
PARV65   EQU   65                  .  Currency validation (GRPMUK)              
PARV66   EQU   66                  .  Transfer validation (GRPMUK)              
PARV67   EQU   67                  .  Get cli/pro/cam (UK)                      
PARV68   EQU   68                  .  Get media billing group (GRPMUK)          
PARV69   EQU   69                  .  Get category name (GRPMUK)                
PARV70   EQU   70                  .  Get tx ref_ser no (CASH/GRPMUK)           
*&&                                                                             
PARV71   EQU   71                  .  Get Reference number                      
PARV72   EQU   72                  .  Val cli added last month (GRPMUK)         
PARV73   EQU   73                  .  Currency/Transfer validation              
PARV74   EQU   74                  .  Get Agency Media file                     
PARV75   EQU   75                  .  Get Request Date and Time                 
PARSEDQ  EQU   *-PARSED                                                         
         EJECT ,                                                                
EQUD     DSECT                                                                  
EQUPRSE  DS    Y                   PARSE ENTRY                                  
EQUDECM  DS    AL1                 NUMBER OF DECIMALS TO SHIFT FOR              
         DS    AL1                 N/D                                          
EQUOPTR  DS    C                   OPERATOR TO APPLY                            
EQUIND   DS    X                                                                
EQUMULT  EQU   X'80'               MULIPLTE DATA                                
EQUDR    EQU   X'40'               debit only                                   
EQUCR    EQU   X'20'               credit only                                  
EQULNQ   EQU   *-EQUD                                                           
         SPACE 1                                                                
RT$ELD   DSECT                     Payroll rate by person                       
RT$EL    DS    XL1                                                              
RT$ELQ   EQU   X'97'                                                            
RT$LN    DS    XL1                                                              
RT$MTHD  DS    CL1                 Pay code method                              
RT$MOA   DS    XL2                 By payroll MOA                               
RT$DATE  DS    XL3                 By payroll date                              
RT$CODE  DS    XL1                 By payroll code                              
RT$TYPE  DS    XL1                 By payroll type (bucket type)                
RT$IND   DS    XL1                 Indicators                                   
RT$DONE  EQU   X'80'                                                            
RT$TOT   DS    PL6                 Total                                        
RT$SAL   DS    PL6                 Salary                                       
RT$BEN   DS    PL6                 Benefits                                     
RT$PEN   DS    PL6                 Pension                                      
RT$LNQ   EQU   *-RT$ELD                                                         
                                                                                
P$TELD   DSECT                     Payroll totals by person by column           
P$TEL    DS    XL1                                                              
P$TELQ   EQU   X'98'               Internal element                             
P$TLN    DS    XL1                                                              
P$TMTHD  DS    CL1                 Pay code method                              
P$TMOA   DS    XL2                 By MOA                                       
P$TDATE  DS    XL3                 By payroll date                              
P$TCODE  DS    XL1                 By payroll code                              
P$TTYPE  DS    XL1                 By payroll type (bucket type)                
P$TIND   DS    XL1                 Indicators                                   
P$TDONE  EQU   X'80'               .  Applied to columns                        
P$TLNQ   EQU   *-P$TELD                                                         
P$TAMT   DS    0PL6                By column                                    
         SPACE 1                                                                
PHSELD   DSECT                                                                  
PHSIND   DS    XL1                 Amounts verus rates(KEY)                     
PHSRTE   EQU   X'80'               .  Rate instead of dollars                   
PHSMTHD  DS    CL1                 Pay code method    (KEY)                     
PHSCODE  DS    XL1                 Pay code number    (KEY)                     
PHSDATE  DS    XL3                 Pay DATE           (KEY)                     
*HSMOA   DS    XL2                 Pay MOA            (KEY)                     
PHSBUCK  DS    CL1                 Pay code Type      (KEY)                     
PHSKLNQ  EQU   *-PHSELD            Length of key                                
PHSEFSDT DS    XL3                 Effective start date for rate                
PHSEFEDT DS    XL3                 Effective end   date for rate                
PHSAMNT  DS    PL6                 Pay code amount/rate                         
PHSLNQ   EQU   *-PHSELD            Length of record                             
         SPACE 2                                                                
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -                   
CFWELD   DSECT                                                                  
CFWEL    DS    XL1                 Programs own element (cashflow)              
CFWELQ   EQU   X'99'                                                            
CFWLN    DS    XL1                 Element length                               
CFWTYP   DS    XL1                 Element type                                 
CFWTYVQ  EQU   1                   .  Vendor data                               
CFWTYRQ  EQU   2                   .  Receivalbe data                           
CFWEIND  DS    XL1                 Element Indicator                            
CFWEDDC  EQU   X'80'               .  Use Due Date as Days Calc Date            
CFWECBC  EQU   X'40'               .  CURIND has CURBILCR                       
CFWDAYS  DS    XL2                 Days to Disbursement                         
CFWDBAL  DS    PL8                 Daily Balance                                
CFWVDIS  DS    0PL6                Disbursed Amount                             
CFWAPPA  DS    PL6                 Applied Amount                               
CFWVUND  DS    0PL6                Undisbursed Amount                           
CFWUNAA  DS    PL6                 Unapplied Amount                             
*                                                                               
*                                VENDOR INFORMATION ELEMENT                     
*FWVCNO  DS    CL6                 Vendor Check Number                          
*FWVCDT  DS    XL2                 Vendor Check Date                            
*FWVSTA  DS    XL1                 Vendor Status                                
*                                  .  Urgent   (X'40'-TRNSURG)                  
*                                  .  Reversal (X'20'-TRNSREV)                  
*                                  .  Held     (X'04'-TRNSHOLD)                 
*                                  .  Approved (X'02'-TRNSAPPR)                 
CFWVLNQ  EQU   *-CFWELD            Length of Vendor Type Element                
*                                                                               
*                                RECEIVABLE INFORMATION ELEMENT                 
*        ORG   CFWVCNO                                                          
CFWBLNO  DS    CL6                 Bill Number                                  
CFWBLDT  DS    CL2                 Bill Date                                    
CFWCCNO  DS    CL6                 Client Check Number                          
CFWCCDT  DS    PL3                 Client Check Date                            
CFWCPDT  DS    PL3                 Client Deposit Date                          
CFWBAPP  DS    PL6                 Applied Amount (billing x'77')               
CFWBBAL  DS    PL6                 RCV Balance (billing x'77')                  
CFWPAPP  DS    PL6                 Percent Applied                              
CFWCDDT  DS    PL2                 Client Due Date                              
CFWPART  DS    CL1                 Partial Payment                              
CFWRSTA  DS    XL1                 Receivable Status                            
*        EQU   X'80'               .  Held      (X'80'-TRXSRHLD)                
*        EQU   X'40'               .  Queried   (X'40'-TRXSRQRD)                
*        EQU   X'20'               .  Reversal  (X'20'-TRNSREV)                 
CFWRSWO  EQU   X'08'               .  Write Off                                 
CFWRSOF  EQU   X'04'               .  Offset                                    
CFWRSTR  EQU   X'02'               .  Transfer                                  
CFWRLNQ  EQU   *-CFWELD            Length of Receivable Type Element            
* - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -                   
         SPACE 2                                                                
DTED     DSECT                                                                  
DTEOFF   DS    CL2                 Office to match on or X'FF' for CPY          
DTEPEDST DS    CL3                 Start period date based on REQ end           
DTEPEDEN DS    CL3                 End   period date based on REQ end           
DTECOL   DS    0CL8                Multiple DTECOL entries                      
DTESTRT  DS    CL3                 Start dates for column                       
DTEEND   DS    CL3                 End   dates for column                       
DTE#PEDS DS    PL2                 # of periods between dates (MWR)             
         SPACE 2                                                                
*&&DO                                                                           
BILLED   DSECT                                                                  
BILLKEY  DS    CL42                KEY TO CR (WC=99)                            
BILLTYPE DS    CL1                                                              
BILLIND  DS    XL1                                                              
BILLDATE DS    PL3                                                              
BILLNQ   EQU   *-BILLED                                                         
*&&                                                                             
         SPACE 2                                                                
PARWRKD  DSECT                                                                  
PARELADR DS    A                   ELEMENT ADDRESS                              
PAROPRND DS    PL16                OPERAND                                      
PARANSWR DS    PL8                 ANSWER                                       
PARDMSK  DS    XL1                 DATA MASK(THIS IS FOR LEVEL)                 
PARDLVL  EQU   X'80'               .  Get only data for level                   
PARREPL  EQU   X'04'               .  Special replace                           
PARDLEN  DS    XL1                 DATA LENGTH                                  
PARNEWLN DS    H                                                                
         DS    XL1                                                              
PARWORK  DS    CL600               MUST BE = L'NARALL                           
PARWORKL EQU   *-PARWORK                                                        
PARWRKN  EQU   *                                                                
         EJECT ,                                                                
LOADD    DSECT                                                                  
LOADLABL DS    CL8                 *LABLE*                                      
LOADSIZE DS    AL4                 SIZE OF TABLE ENTRY                          
LOADADDR DS    AL4                 A(TABLE ENTRY)                               
LOADAVAR DS    AL2                 ACRLD VARIABLE  - WHERE TO STORE             
LOADPAD  DS    AL1                 PAD CHARACTER                                
LOADIND  DS    AL1                 INDICATOR                                    
LOADDUMP EQU   X'80'                  DUMP TABLES UP TO THIS POINT              
LOADNOP  EQU   X'40'                  DON'T CLEAR TABLE BETWEEN REQUEST         
LOADSML  EQU   X'02'                  LOAD 1/4 SIZE FOR SOON JOB                
LOADHIGH EQU   X'01'                  HIGH CORE TABLE                           
LOADLNQ  EQU   *-LOADD                                                          
         SPACE 2                                                                
NONCLID  DSECT                                                                  
NONCCODE DS    CL12                NON CLIENT CODE                              
NONCFLT2 DS    CL1                 NON CLIENT FILTER 2                          
NONCANAL DS    CL1                 NON CLIENT ANALYSIS CODE                     
NONCLNQ  EQU   *-NONCLID                                                        
         SPACE 2                                                                
NMEKEYD  DSECT                                                                  
NMETAB   DS    AL2                 DISPLACEMENT TO A(TABLE)                     
NMETYPE  DS    AL1                 TYPE OF DATA / INDEX INTO TABLE              
NMEOGP   EQU   1                   .  Build office group                        
NMEOFF   EQU   2                   .  Build office                              
NMEMGP   EQU   3                   .  Build media  group                        
NMEWGP   EQU   4                   .  Build work   group                        
NMEMD1   EQU   5                   .  Build media 1                             
NMEMD2   EQU   9                   .  Build media 2                             
NMETAX   EQU   10                  .  Build sales tax                           
NMECPY   DS    AL1                 DISPLACEMENT TO COMPANY CODE IN KEY          
NMECODE  DS    AL1                 DISPLACEMENT TO CODE IN KEY                  
NMELEN   DS    AL1                 LENGTH OF CODE IN KEY                        
NMENAMEQ DS    AL1                 LENGTH OF NAME DATA                          
NMEKEY   DS    XL5                 START UP KEY FOR RECORD TYPE                 
NMEMAX#  DS    AL2                 MAX NUMBER OF ENTRIES ALLOWED                
MAXOFG   EQU   36                                                               
MAXOFF   EQU   240                                                              
MAXMGP   EQU   72                                                               
MAXWGP   EQU   36                                                               
MAXMD1   EQU   72                                                               
MAXMD2   EQU   550                                                              
MAXTAX   EQU   500                                                              
NMEKEYQ  EQU   *-NMEKEYD                                                        
         EJECT ,                                                                
NAMD     DSECT                                                                  
NAMKEY   DS    0CL14               U/L/Account                                  
NAMUL    DS    CL2                                                              
NAMACT   DS    CL12                                                             
NAMADR   DS    AL4                                                              
NAMLEN   DS    XL1                                                              
NAMLNQ   EQU   *-NAMD                                                           
         SPACE 1                                                                
AEBIND   DSECT                                                                  
AEBUL    DS    CL2                 Unit/Ledger code                             
AEBRULE  DS    XL1                 Rule (0-4)                                   
AEBCODE  DS    CL20                Equivalent code (level 1-9)                  
AEBKEYQ  EQU   *-AEBIND                                                         
AEBNAME  DS    CL36                Equivalent name                              
AEBLNQ   EQU   *-AEBIND                                                         
         SPACE 1                                                                
ETBIND   DSECT                                                                  
ETBCODE  DS    CL3                 Expenditure type code                        
ETBKEYQ  EQU   *-ETBIND                                                         
ETBNAME  DS    CL36                Expenditure type name                        
ETBLNQ   EQU   *-ETBIND                                                         
         SPACE 2                                                                
***********************************************************************         
*  DSECT TO ADJUST SELECTED KEYWORD TABLES                            *         
***********************************************************************         
         SPACE 1                                                                
ACLVD    DSECT                                                                  
ACLVKYW  DS    AL4                 A(KEYWORD)                                   
ACLVREP  DS    AL4                 REPORT TYPE                                  
ACLVLEV  DS    AL1                 LEVEL OF LEDGER NEEDED TO ADJUST             
ACLVIND  DS    AL1                 SPECIAL INDICATION                           
ACLVSET  EQU   X'80'               MUST HAVE UNIT LEDGER                        
ACLVBUD  EQU   X'40'               FIX BUDGET LEVEL FOR KEYWORD                 
ACLVCON  EQU   X'20'               CONTRA LEVEL KEYWORDS                        
ACLVADJ  DS    AL1                 ADJUST LENGTH BY THIS AMOUNT                 
         DS    AL1                 SPARE                                        
ACLVLDG  DS    S                   LOACATION OF UNIT/LEDGER                     
ACLVLNQ  EQU   *-ACLVD                                                          
         SPACE 2                                                                
***********************************************************************         
*  DSECT TO COVER CURRENT DATA TABLE                                  *         
***********************************************************************         
         SPACE 1                                                                
CURD     DSECT                                                                  
CURPAR   DS    A                   PARSE ROUTINE                                
CURDFT   DS    Y                   DEFALUT STORAGE LOACTION                     
CURVAR   DS    Y                   CURRENT STORAGE LOACTION                     
CURVARLN DS    AL1                 LENGTH OF VARIABLE                           
CURFLAG  DS    AL1                 FLAG TO PARSE (YES/NO)                       
         DS    AL2                 SPARE                                        
CURLNQ   EQU   *-CURD                                                           
         EJECT ,                                                                
***********************************************************************         
*  DSECT TO METHOD DATA                                               *         
***********************************************************************         
         SPACE 1                                                                
MTHDD    DSECT                                                                  
MTHDNUM  DS    XL1                 METHOD NUMBER                                
MTHDCDE  DS    CL3                 METHOD CODE                                  
MTHDLAD  DS    PL2                 LATEST ALLOCATION DATE YYMM PACKED           
MTHDIND  DS    XL1                 METHOD INDICATOR/INFO                        
MTHDYTD  EQU   X'80'                  YTD ALLOCATION                            
MTHDMTH  EQU   X'40'                  MONTHLY ALLOCATION                        
MTHDSTD  EQU   X'20'                  STANDARD HOURS VS ACTUAL                  
MTHDHRS  EQU   X'02'                  METHOD HAS HOURS                          
MTHDRTE  EQU   X'01'                  METHOD HAS RATES                          
MTHDLOC  DS    H                   DISPLACEMENT TO BUCKETS IN RATES             
MTHDTOT  DS    XL32                TOTAL (ALL) PAYCODES                         
MTHDSAL  DS    XL32                SALARY   PAYCODES                            
MTHDBEN  DS    XL32                BENEFIT  PAYCODES                            
MTHDPEN  DS    XL32                PENSION  PAYCODES                            
MTHDIDR  DS    XL32                INDIRECT PAYCODES                            
MTHDLNQ  EQU   *-MTHDD                                                          
         SPACE 2                                                                
***********************************************************************         
*  DSECT TO COST DATA TO POINT TO RATE TABLE                          *         
***********************************************************************         
         SPACE 1                                                                
COSTD    DSECT                                                                  
COSTSMOA DS    PL2                 PWOS START MOA                               
COSTEMOA DS    PL2                 PWOS END   MOA                               
COSTMTHS DS    XL1                 NUMBER OF TOTAL MONTHS                       
COSTIND  DS    XL1                 INDICATOR                                    
COSTHRS  EQU   X'02'                  HOURS PRESENT                             
COSTRTE  EQU   X'01'                  RATE PRESENT                              
         DS    XL2                 SPARE                                        
COSTRATE DS    A                   MONTHLY ALLOCATION                           
COSTLNQ  EQU   *-COSTD             MONTHLY ALLOCATION                           
         EJECT ,                                                                
***********************************************************************         
*  DSECT TO RATE DATA                                                 *         
***********************************************************************         
         SPACE 1                                                                
RATED    DSECT                                                                  
RATEMOA  DS    PL2                 PWOS MOA                                     
RATEHRS  DS    PL3                 HOURS                                        
RATELNQ  EQU   *-RATED                                                          
RATEMTHD DS    XL1                 RATE CORROSPONDING TO BUCKETS                
RATEBUK  DS    0PL6                                                             
RATESAL  DS    PL6                 SALARY  RATE    FOR PERSON                   
RATEBEN  DS    PL6                 BENEFIT RATE    FOR PERSON                   
RATEPEN  DS    PL6                 PENSION RATE    FOR PERSON                   
RATETOT  DS    PL6                 TOTAL   RATE    FOR PERSON                   
RATEAMT$ DS    0PL6                                                             
RATESAL$ DS    PL6                 SALARY  DOLLARS FOR PERSON                   
RATEBEN$ DS    PL6                 BENEFIT DOLLARS FOR PERSON                   
RATEPEN$ DS    PL6                 PENSION DOLLARS FOR PERSON                   
RATETOT$ DS    PL6                 TOTAL   DOLLARS FOR PERSON                   
RATEBUK# EQU   (*-RATEBUK)/6                                                    
RATEBUKQ EQU   *-RATEMTHD                                                       
         EJECT ,                                                                
***********************************************************************         
*  DSECT TO COVER COMPRESSED CALENDARS                                *         
***********************************************************************         
         SPACE 1                                                                
CPRCNDRD DSECT                                                                  
CPRYMD   DS    0XL3                                                             
CPRYM    DS    0XL2                                                             
CPRYY    DS    XL1                 Year   wanted                                
CPRMM    DS    XL1                 Month  wanted                                
CPRDD    DS    XL1                 Day    wanted                                
CPROF    DS    CL2                 Office wanted                                
CPRERR   DS    XL1                 Error codes                                  
CPRRF    EQU   X'80'               .  Read file, DATAMGR read occured           
CPRNF    EQU   X'40'               .  Calendar not found / Missing              
CPRTF    EQU   X'20'               .  Tables are fulls on add                   
CPRACT   DS    CL1                 Action                                       
CPRLOCD  EQU   C'D'                .  Location detail requested                 
CPR#YRS  DS    XL1                                                              
CPR#PRD  DS    XL1                 Number of periods for calendar               
CPR#OFC  DS    XL1                 Number of office codes                       
CPRPED#  DS    XL1                 Period number if YMD is passed               
CPRSDATE DS    XL3                 Start date for calendar packed               
CPREDATE DS    XL3                 End   date for calendar packed               
CPRSMOA  DS    XL2                 Start MOA  for calendar packed               
CPREMOA  DS    XL2                 End   MOA  for calendar packed               
CPROFLST DS    CL256               List of offices                              
CPRMTH   DS    XL2                 TEMP YYMM packed                             
CPRMTHQ  EQU   18                  1 1/2 years                                  
CPRLSTYM DS    (CPRMTHQ+2)XL3      Packed dates (yymmdd)last day of mon         
CPRYEARS DS    A                   A(Calendars read so far) See CALDTED         
CPRAWRK  DS    A                   A(Stored compressed calanders)               
CPREXPC  DS    A                   A(Expanded calendar)                         
CPR#CNDR DS    A                   Number of calanders                          
CPRREC   DS    0XL((CPRMTHQ+2)*4+CPRMTHQ*2+11)                                  
CPRKY    DS    0XL3                                                             
CPROFFC  DS    CL2                 Office code                                  
CPRYEAR  DS    XL1                 Unsigned packed                              
CPRSTDTE DS    XL3                 First date of calendar, packed               
CPRSTYM  DS    XL2                 Start YYMM                                   
CPRMON1  DS    (CPRMTHQ+2)F                                                     
CPR#MOA  DS    XL1                 Number of MOA's Processed                    
CPRSTMOA DS    XL2                 First MOA of calendar, packed                
CPRMOA1  DS    (CPRMTHQ)XL2        Packed list of Moa's                         
CPRLNQ   EQU   *-CPRCNDRD                                                       
         SPACE 2                                                                
CALDTED  DSECT                                                                  
CDTYEAR  DS    XL1                                                              
CDTSMOA  DS    XL2                 Start MOA of calendar                        
CDTEMOA  DS    XL2                 End   MOA of calendar                        
CDTSDATE DS    XL3                 Start period of calendar                     
CDTEDATE DS    XL3                 End   period of calendar                     
CDTLNQ   EQU   *-CALDTED                                                        
         SPACE 2                                                                
CDRD     DSECT                                                                  
CDRPRD#  DS    XL1                 CALENDAR PERIOD                              
CDRMOA   DS    PL2                 CALENDAR MOA                                 
CDRSDATE DS    PL3                 CALENDAR START DATE                          
CDREDATE DS    PL3                 CALENDAR END   DATE                          
CDRBUD   DS    0PL5                BUDGETS BY PERIOD                            
CDRTHRS  DS    PL5                 TOTAL HOURS                                  
CDRIND   DS    XL1                 INDICATORS                                   
CDRIACTV EQU   X'80'               .  PERSON ACTIVE FOR PERIOD                  
CDRIHIT  EQU   X'40'               .  HOURS PRESENT FOR PERIOD                  
CDR#DAYS DS    XL1                 NUMBER OF DAYS IN PERIOD                     
CDR#ACTV DS    XL1                 NUMBER OF DAYS PERSON ACTIVE FOR             
CDR#MDAY DS    XL1                 TOTAL NUMBER OF DAYS IN MONTH                
CDRLNQ   EQU   *-CDRD                                                           
         SPACE 2                                                                
QTRD     DSECT                                                                  
QTRSTRB  DS    0XL3                START OF QUARTER - YYMMDD BINARY             
QTRSTRBY DS    XL1                    YY                                        
QTRSTRBM DS    XL1                    MM                                        
QTRSTRBD DS    XL1                    DD                                        
QTRENDB  DS    0XL3                END   OF QUARTER - YYMMDD BINARY             
QTRENDBY DS    XL1                    YY                                        
QTRENDBM DS    XL1                    MM                                        
QTRENDBD DS    XL1                    DD                                        
QTRSTRC  DS    CL6                 START OF QUATER - YYMMDD CHARACTER           
QTRENDC  DS    CL6                 END   OF QUATER - YYMMDD CHARACTER           
QTRLNQ   EQU   *-QTRD                                                           
         EJECT ,                                                                
CARDD    DSECT                                                                  
CARDLEN  DS    AL1                 LENGTH OF DATA IN REQUEST CARD               
CARDIND  DS    XL1                 INDICATOR                                    
CARDCLR  EQU   X'80'                  CLEAR REQUEST IF ? OR * OR +/-            
CARDPROF EQU   X'40'                  CARD  CAN CONTIAL (Profile)               
CARDDLNK EQU   X'20'                  DDLINK A(TABLE) allowed                   
CARDROUT DS    AL1                 SPECIAL ROUTINE NUMBER                       
CARDLOC1 DS    AL2                 LOCATION IN ACQD                             
CARDLOC2 DS    AL2                 LOCATION IN ACWORKD                          
CARDAFLT DS    AL2                 DISPLACEMENT TO A(FILTER DATA)               
CARDLNQ  EQU   *-CARDD                                                          
         SPACE 2                                                                
EQD      DSECT                                                                  
EQTYPE   DS    AL1                 CALCULATION TYPE                             
EQROW    EQU   C'R'                   ROW DATA                                  
EQCOL    EQU   C'C'                   COLUMN DATA                               
EQOPTR   EQU   C'O'                   OPERATOR                                  
EQDATE   EQU   C'D'                   DATE CALCULATION                          
EQVERT   EQU   C'V'                   VERTICAL PERCENT                          
EQFRGN   EQU   C'$'                   FORGEIN RATE FUNCTION                     
EQMAP    EQU   C'M'                   TYMAP()                                   
EQSUM    EQU   C'S'                   CUME() OR SUM() FROM COLDUB               
EQTOTL   EQU   C'T'                   TOTAL LEVEL USED AS CONSTANT              
EQBIN#   EQU   C'#'                   BINARY CONSTANT                           
EQEND    EQU   X'FF'                  END OF COLUMN CALCULATION                 
*                                                                               
EQROWLVL DS    0AL1                ROW LEVEL OF TOTAL   (EQTYPE=EQVERT)         
EQSIGN   DS    0CL1                OPERATOR             (EQTYPE=EQOPTR)         
EQPCT    EQU   C'%'                   PERCENT COLUMN                            
EQIND    DS    AL1                 INDICATOR                                    
EQREV    EQU   X'80'                  REVERSE SIGN      (EQTYPE=EQCOL)          
EQDONE   EQU   X'20'                  MARKED AS DONE    (EQTYPE=EQDATE)         
*                                                                               
EQROUT#  DS    0AL1                OPERATION ROUTINE # (EQTYPE=EQOPTR)          
EQDEC#   DS    0AL1                DECIMALS (EQTYPE=EQCOL/EQBIN#/EQROW)         
EQOTHR   DS    AL1                 MARK AS ROW OR COL   (EQTYPE=EQVERT)         
EQCOL#   DS    AL1                 COLUMN NUBMER                                
*                                                                               
EQCONST  DS    0AL4                BINARY CONSTANT      (EQTYPE=EQBIN#)         
EQADDR   DS    0AL4                A(ROW/COL TABLE ENTRY)                       
EQDSP    DS    AL2                 DISPLACEMENT TO DATA IN ROW OR COL           
         DS    XL2                 N/D                                          
EQLNQ    EQU   *-EQD                                                            
         EJECT ,                                                                
OPD      DSECT                                                                  
OPTYPE   DS    CL1                 OPERATOR TYPE                                
OPREG    EQU   C'O'                REGULAR TYPE OPERATOR                        
OPVRT    EQU   C'V'                VERTICAL PERCENT OPERATOR                    
OPSYMBOL DS    CL1                 OPERATOR SYMBOL                              
OPROUT#  DS    AL1                 OPERATION ROUTINE NUMBER                     
OPADD    EQU   1                   ADD      ROUTINE                             
OPSUB    EQU   2                   SUBTRACT ROUTINE                             
OPMULT   EQU   3                   MULTIPLY ROUTINE                             
OPDIV    EQU   4                   DIVIDE   ROUTINE                             
OPPCT    EQU   4                   PERCENT  ROUTINE                             
OPVPCT   EQU   4                   VERTICAL ROUTINE                             
OPORDER  DS    XL1                 OPERATOR ORDER OF PRESEDENCE                 
         DS    XL4                 N/D                                          
OPLNQ    EQU   *-OPD                                                            
         SPACE 2                                                                
***********************************************************************         
*  DSECT TO COVER SJ TABLE                                            *         
***********************************************************************         
         SPACE 1                                                                
SJINFO   DSECT                                                                  
SJCLIPRD DS    CL(L'SJKEY)         SJ CLIENT + PRODUCT                          
SJPRGRCP DS    CL12                PRODUCT CODE CLIENT + PRODUCT                
SJNUM2   DS    CL6                 NUM2                                         
SJCOSTAC DS    CL12                1C COST ACCOUNT                              
SJIND    DS    XL1                 SJ TABLE INDICATORS                          
SJNMELN  DS    AL1                 LENGTH OF NAME                               
SJNMEPTR DS    AL4                 A(NAME)                                      
SJGRUP   DS    CL3                 Client Group Billing                         
SJINFQ   EQU   *-SJINFO            LENGTH FOR EACH TABLE ENTRY                  
SJAE_A   DS    0CL20               Account Equivalent A                         
SJAE_B   DS    0CL20               Account Equivalent B                         
SJAE_C   DS    0CL20               Account Equivalent C                         
SJAE_D   DS    0CL20               Account Equivalent D                         
SJAE_E   DS    0CL20               Account Equivalent E                         
         SPACE 2                                                                
***********************************************************************         
*  DSECT TO COVER BRAND AGENCY (BSNY ONLY)                            *         
***********************************************************************         
         SPACE 1                                                                
BRANDD   DSECT                                                                  
BRANDKEY DS    0CL11                                                            
BRANDSYS DS    CL1                 SYSTEM                                       
BRANDMED DS    CL1                 MEDIA                                        
BRANDCLI DS    CL3                 CLIENT                                       
BRANDPRD DS    CL3                 PRODUCT                                      
BRANDEST DS    CL3                 ESTIMATE                                     
BRANDAOR DS    CL3                 AGENCY OF RECORD                             
BRANDNME DS    CL1                 NAME POINTER INTO BRNDNMTB                   
         DS    CL1                 SPARE                                        
BRANDLNQ EQU   *-BRANDD                                                         
         SPACE 1                                                                
***********************************************************************         
* DSECT to cover billing type table                                   *         
***********************************************************************         
BTYPED   DSECT                                                                  
BTYPCDE  DS    CL1                 Billing type internal code                   
BTYPNUM  DS    AL1                 Transaction billing type code                
BTYPDD#  DS    AL2                 Data dictionary number                       
BTYPNME  DS    CL11                Billing type name                            
BTYPLNQ  EQU   *-BTYPED                                                         
         SPACE 1                                                                
***********************************************************************         
* DSECT TO COVER DOWNLOAD DATE INFO TABLE OR SAVED ENTRY              *         
***********************************************************************         
DATED    DSECT                                                                  
DATEFORM DS    AL1                                                              
DATELLEN DS    AL1                 MONTH,YEAR & DAY LENGTH OF OUTPUT            
DATESLEN DS    AL1                 MONTH,YEAR       LENGTH OF OUTPUT            
DATEL#   DS    AL1                 DATCON CONVERSION NUMBER FOR LONG            
DATES#   DS    AL1                 DATCON CONVERSION NUMBER FOR LONG            
DATELNQ  EQU   *-DATED                                                          
         EJECT ,                                                                
***********************************************************************         
* DSECT to cover main estimate data per job (non-Jobber)                        
***********************************************************************         
ESTMD    DSECT                                                                  
ESTWLG   DS    CL6                 Estimate global number                       
ESTML#   DS    XL3                 Estimate local number                        
*&&UK                                                                           
ESTDAT   DS    PL3                 Estimate date                                
*&&                                                                             
ESTCUR   DS    CL3                 Estimate currency                            
ESTRTD   DS    0CL7                Estimate exchange rate rule                  
ESTRST   DS    XL1                 Estimate exchange rate status byte           
ESTRFIX  EQU   X'80'               Fixed conversion rate                        
ESTRDIV  EQU   X'01'               Divide by rate (else multiply)               
ESTRATE  DS    PL5                 Estimate exchange rate                       
ESTRSHF  DS    XL1                 Shift value for dec place difference         
ESTSTAS  DS    0XL3                                                             
ESTSTA1  DS    XL1                 Estimate status byte 1                       
ESTSTA2  DS    XL1                 Estimate status byte 2                       
*&&UK                                                                           
ESTSTA3  DS    XL1                 Estimate status byte 3                       
*&&                                                                             
ESTACK   DS    XL1                 Acknowledgement status                       
ESTMLNQ  EQU   *-ESTWLG                                                         
         SPACE 1                                                                
***********************************************************************         
* DSECT to cover estimate WC data per job (non-Jobber)                          
***********************************************************************         
ESTWCD   DSECT                                                                  
ESTWL#   DS    XL3                 Estimate local number                        
ESTWC    DS    CL2                 Work code                                    
ESTW1R   DS    CL12                1R account code/00's                         
ESTWRAT  DS    PL6                 Hourly rate (poss >1, same 1R)/00's          
ESTWKLQ  EQU   *-ESTWCD            (key length)                                 
ESTWIND  DS    XL1                 Indicator byte                               
ESTWPRCD EQU   X'80'               Entry has been processed already             
ESTWWCQ  EQU   X'40'               Workcode-level entry                         
ESTW1RQ  EQU   X'20'               Workcode + 1R-level entry                    
ESTWVALS DS    0X                  Estimate workcode values (ESTWWCQ)           
ESTWAM   DS    PL6                 Workcode amount                              
ESTWGAM  DS    PL6                 Gross estimate amount                        
ESTWAMC  DS    PL6                 Workcode amount (currency)                   
ESTWGAMC DS    PL6                 Gross estimate amount (currency)             
ESTWCUR  DS    CL3                 Currency code set from EMDCUR                
ESTWTAM  DS    PL6                 Value of Est. time (agency)                  
ESTWTAC  DS    PL6                 Value of Est. time (currency)                
ESTTVALS DS    0X                  Estimated time values (ESTW1RQ)              
ESTTHRS  DS    PL6                 Number of hours                              
ESTTRFC  DS    PL6                 Hourly rate (currency) or 0                  
ESTWLNQ  EQU   *-ESTWL#                                                         
         SPACE 1                                                                
***********************************************************************         
* DSECT to cover estimate data                                                  
***********************************************************************         
ESTD     DSECT                                                                  
EST#     DS    XL1                 Estimate number                              
ESTAPRV  DS    CL8                 Estimate approver                            
ESTAPDT  DS    XL3                 Estimate approver date                       
ESTPRPR  DS    CL8                 Estimate preparer                            
ESTPRDT  DS    XL3                 Estimate preparer date                       
ESTADTE  DS    XL3                 Estimate added date                          
ESTLDTE  DS    XL3                 Estimate last activity date                  
ESTNME1  DS    CL14                Estimate Name 1                              
ESTNME2  DS    CL14                Estimate Name 2                              
*&&US                                                                           
ESTSTAT1 DS    XL1                 Estimate status                              
ESTME    EQU   X'80'               - Merged                                     
ESTRE    EQU   X'40'               - Rejected                                   
ESTCA    EQU   X'20'               - Client approved                            
ESTIP    EQU   X'10'               - In Progress                                
ESTSI    EQU   X'08'               - Submitted for internal approval            
ESTSC    EQU   X'02'               - Submitted to Client                        
ESTIA    EQU   X'01'               - Internally approved                        
*&&                                                                             
*&&UK                                                                           
ESTSTAT1 DS    XL1                 Estimate status (ESTRSTA1)                   
ESTSTAT2 DS    XL1                 Estimate status (ESTRSTA2)                   
ESTSTAT3 DS    XL1                 Estimate status (ESTRSTA3)                   
*&&                                                                             
ESTLNQ   EQU   *-ESTD                                                           
         SPACE 1                                                                
***********************************************************************         
* DSECT to cover Workcode, Item code table                                      
***********************************************************************         
WCID     DSECT                                                                  
WCINTRY  DS    0CL42                                                            
WCIWRK   DS    CL2                 Workcode                                     
WCIITMC  DS    CL4                 Item Code                                    
WCIITMD  DS    CL36                Item Description                             
WCICRAT  DS    PL4                 Commission Rate                              
WCIAPRC  DS    PL6                 Agency Price                                 
WCIHRS   DS    PL6                 Hours/Multiplier                             
WCINAMT  DS    PL6                 Net Amount                                   
WCICAMT  DS    PL6                 Commission Amount                            
WCIGAMT  DS    PL6                 Gross Amount                                 
WCILNQ   EQU   *-WCID                                                           
         SPACE 1                                                                
*&&UK                                                                           
***********************************************************************         
* DSECT to Cover CLIENT PURCHASE ORDER CODES AND AMOUNTS              *         
***********************************************************************         
         SPACE 1                                                                
CPOD     DSECT                                                                  
CPOCODE  DS    CL20                CLIENT PURCHASE ORDER                        
CPOAMNT  DS    PL6                 CLIENT PURCHASE ORDER AMOUNT                 
CPOLNQ   EQU   *-CPOD                                                           
         SPACE 1                                                                
*&&                                                                             
***********************************************************************         
* DSECT to Cover Planning or Revision Number Table Element            *         
***********************************************************************         
         SPACE 1                                                                
PRNEND   DSECT                     Planning or Revision Number Element          
PRNTYPE  DS    XL1                 Planning or Revision Number Type:            
PRNTPLAN EQU   C'P'                . Planning  Number                           
PRNTREV  EQU   C'R'                . Revision  Number                           
PRNDATA  DS    CL(ESTLNQ)          Planning/Revision Number: See ESTD           
PRNENLNQ EQU   *-PRNEND            Element     length                           
         EJECT ,                                                                
***********************************************************************         
* DSECT to Payroll Table Entries pointed to by PYCBASE                *         
***********************************************************************         
         SPACE 1                                                                
PYRD     DSECT                     Payroll table    entry                       
PYRNUM   DS    XL1                 System  assigned number                      
PYRKEYLQ EQU   *-PYRD              Key     length                               
PYRCODE  DS    CL5                 Payroll code                                 
PYRNAME  DS    CL15                Payroll description                          
PYRENLNQ EQU   *-PYRD              Element length                               
         EJECT ,                                                                
***********************************************************************         
* DSECT for bills                                                               
***********************************************************************         
BILLD    DSECT                                                                  
BILLRUN  DS    XL2                 Billing run date                             
BILLIND  DS    XL1                 Billing indicator                            
BILLACTV EQU   X'80'               .  Latest bill                               
BILLREV  EQU   X'40'               .  Bill was reversed                         
BILL100  EQU   X'01'               .  100% of estimate                          
BILLTY   DS    AL1                 Billing type from x'44'                      
BILLEST  DS    A                   Point to estimate by wc data                 
BILLRCV  DS    CL15                Contra account form 99's                     
BILLROF  DS    CL2                 Contra office                                
         DS    XL1                 Do not use                                   
BILLRBS  DS    CL14                Billing source                               
BILDTE   DS    XL3                 Bill date                                    
BILUDTE  DS    XL2                 Unbilled date                                
BILTYD   DS    CL6                 Bill type description (part of it)           
BILL#WC  DS    XL1                 Number of estimate workcodes                 
BILL#    DS    CL6                 Bill number from 99'x TRNREF                 
BILLSBR  DS    XL1                 Bill sub ref number                          
BILLAMT  DS    PL6                 Bill amount                                  
BILLCOM  DS    PL6                 Bill Commission                              
BILLCD   DS    PL6                 Bill CD                                      
BILLPAMT DS    PL6                 Previous billing (total bill only)           
BILLPCOM DS    PL6                                                              
BILLPCD  DS    PL6                                                              
BILLRTOT DS    PL8                 Running total of bills                       
BILLLNQ  EQU   *-BILLD                                                          
         SPACE 1                                                                
BESTD    DSECT                                                                  
*&&UK                                                                           
BESTWC   DS    CL3                 UK only - WC + sub-workcode                  
*&&                                                                             
*&&US                                                                           
BESTWC   DS    CL2                 Workcode                                     
BESTWCT  DS    CL1                 Workcode type                                
*&&                                                                             
BESTMAXQ EQU   60                  Max of # workcodes                           
BESTNET  DS    PL6                                                              
BESTGRS  DS    PL6                                                              
BESTOGR  DS    PL6                 Original gross amt before adjusting          
BESTONT  DS    PL6                 Original net amt before adjusting            
BESTFLAG DS    XL1                                                              
BESTWCF  EQU   X'80'               W/C found on this bill                       
BESTLNQ  EQU   *-BESTD                                                          
         SPACE 1                                                                
TEMPWCD  DSECT                                                                  
TEMPROW  DS    CL1                 Row                                          
TEMPWC   DS    CL2                 workcode                                     
TEMPBYTE DS    XL1                 status                                       
TEMPWCF  EQU   X'80'               w/c found for this bill                      
TEMPLNQ  EQU   *-TEMPWCD                                                        
         SPACE 1                                                                
FUFCOND  DSECT                     Filter user field conditions                 
FUFLEN   DS    AL1                 Length of element                            
FUFIELD  DS    CL2                 Userfield code                               
FUF#OF   DS    AL1                 # of data components (OR)                    
FUFON    EQU   X'80'               .  Avoid comma translation problem           
FUFCC    DS    XL1                 Condition code                               
FUFAND   EQU   X'01'               .  AND with next element else OR             
FUFLNQ   EQU   *-FUFCOND                                                        
FUFSUBEL DS    0XL1                                                             
FUFSLEN  DS    AL1                 Length of data                               
FUFSDATA DS    0CL1                Data                                         
         SPACE 1                                                                
GRPKYWD  DSECT                     Filter user field conditions                 
GRPKYW#  DS    AL1                 Group keyword #                              
GRP#NONE EQU   99                  Non-group #                                  
GRPKYWL  DS    AL1                 Group keyword level                          
         DS    AL2                 Spare                                        
GRPKYDD# DS    AL2                 Keyword Dictionary number                    
GRPKYLNQ EQU   *-GRPKYWD                                                        
                                                                                
GRPNMED  DSECT                     Filter user field conditions                 
GRPNMEON DS    AL1                 NO/YES, Not used or used                     
GRPNEWLV DS    AL1                 Assign new level number                      
GRPNMDD# DS    AL2                                                              
GRPNMLNQ EQU   *-GRPNMED                                                        
         EJECT ,                                                                
***********************************************************************         
* Dsects for PO (Purchase order detail by job)                        *         
***********************************************************************         
POD      DSECT                                                                  
PO#      DS    CL6                 Order number                                 
PODATE   DS    PL3                 Date                                         
POVNDR   DS    CL14                Vendor                                       
POAUTH   DS    CL15                Authorization                                
PODUE    DS    PL3                 PO due date                                  
POCROF   DS    CL2                 Credit office                                
POSTATUS DS    XL1                                                              
PONONE   EQU   X'80'               .  Not found                                 
POPART   EQU   X'40'               .  Partially matched                         
POFULL   EQU   X'20'               .  Fully matched                             
POPRESTO EQU   X'10'               .  From PRESTO                               
POBRO    EQU   X'08'               .  From BrandOcean                           
POBROAP  EQU   X'04'               .  BrandOcean approval found which           
*                                     matches filter date                       
POAUTAP  EQU   X'02'               .  Order auto approved or self apprv         
POAPPD   EQU   X'01'               .  Addt'l approvers processed                
POSTAT   DS    XL1                 Order status                                 
POSTAT2  DS    XL1                 BrandOcean order status 2                    
PODRFT   EQU   X'80'               Draft order                                  
POPAPP   EQU   X'40'               Order partly approved                        
POAPPR   EQU   X'20'               Order approved                               
POREJ    EQU   X'10'               Order rejected                               
POSUBM   EQU   X'01'               Order submitted                              
POPROC   DS    XL1                                                              
POAPPX   EQU   X'80'               Approver processed for this PO (POA)         
POAPPDX  EQU   X'40'               Appr date proc for this PO (POAD)            
POPOPX   EQU   X'20'               Preparer processed for this PO (POP)         
POPOPDX  EQU   X'10'               Prep date proc for this PO (POPD)            
POSUBX   EQU   X'08'               Submitter proc for this PO (POSUB)           
POPPR    DS    XL2                 BrandO preparer pid                          
POPPRD   DS    XL3                 BrandO preparer date                         
POACKST  DS    XL1                 Acknowledgement status                       
PO#WC    DS    AL2                 Number of work codes                         
PO@      DS    AL4                 Total work @ - See POWCD DSECT               
POLNQL   EQU   *-POD                                                            
POAUDI   DS    0XL5                Multiple audit rec info entries-4max         
POBPID   DS    XL2                 PID for this status                          
POBDATE  DS    XL3                 Date for this status                         
POSPID   DS    XL2                 PID for this status submitter                
POAUDILQ EQU   *-POAUDI                                                         
POAPPMX  EQU   4                   Max of 4 BrandOcean approvers                
POAPPMXL EQU   POAPPMX*POAUDILQ                                                 
POLNQ    EQU   POLNQL+POAPPMXL                                                  
                                                                                
POWCD    DSECT                                                                  
POWC     DS    CL2                 PO workcode                                  
POAMNT   DS    PL6                 Original amount                              
POPAID   DS    PL6                 Amount paid to date                          
PONOW$   DS    PL6                 Amount remaining                             
POWCUSE  DS    CL1                 Work code already used                       
POWCLNQ  EQU   *-POWCD                                                          
         EJECT ,                                                                
RTN1     EQU   1                   Routine 1                                    
RTN2     EQU   2                   Routine 2                                    
RTN3     EQU   3                   Routine 3                                    
RTN4     EQU   4                   Routine 4                                    
                                                                                
CON1     EQU   RQCC+1                                                           
CON2     EQU   RQCC+2                                                           
CON3     EQU   RQCC+3                                                           
CON4     EQU   RQCC+4                                                           
CON5     EQU   RQCC+5                                                           
CON6     EQU   RQCC+6                                                           
CON7     EQU   RQCC+7                                                           
CON8     EQU   RQCC+8                                                           
CON9     EQU   RQCC+9                                                           
CON10    EQU   RQCC+10                                                          
                                                                                
CCLISTD  DSECT                                                                  
CCLTYPE  DS    C                   By report type                               
CCLID#   DS    AL1                 Condition number                             
CCLRTN#  DS    AL1                 Routine to extract data to passback          
CCLIND   DS    X                                                                
CCLACTV  EQU   X'80'               Active filter                                
CCLITEM  DS    AL2                                                              
CCLOTHR  DS    AL2                                                              
CCLLNQ   EQU   *-CCLISTD                                                        
                                                                                
CCND     DSECT                                                                  
CCNID#   DS    AL1                                                              
CCNLN    DS    AL1                                                              
CCNTYP   DS    AL1                 Instruction type                             
CCNIF    EQU   1                   .  If  x then                                
CCNOR    EQU   2                   .  Or  x then                                
CCNAND   EQU   3                   .  And x then                                
CCNOPR   DS    AL1                 Operator                                     
CCNEQ    EQU   1                   .  If equal then                             
CCNNE    EQU   2                   .  If not equal then                         
CCNGT    EQU   3                   .  If greater then                           
CCNGE    EQU   4                   .  If greater or equal then                  
CCNLT    EQU   5                   .  If less then                              
CCNLE    EQU   6                   .  If less or equal then                     
CCNIND   DS    X                                                                
CCNOFF   EQU   X'80'               Not set, so off                              
CCNNODE# DS    AL1                 Node data is in                              
CCNNLEN  DS    AL1                                                              
CCNNPOS  DS    AL1                                                              
         DS    4AL1                Data length with in node                     
CCNKYWD  DS    AL2                                                              
         DS    AL2                                                              
CCNLNQ   EQU   *-CCND                                                           
CCNXDATA DS    0C                                                               
                                                                                
RQTABD   DSECT                                                                  
RQTYPE   DS    C                   Report type                                  
RQT#ITEM DS    AL1                 Number of items                              
RQTLIST  DS    AL2                 Displacement to list of items                
RQTLNQ   EQU   *-RQTABD                                                         
                                                                                
RQLISTD  DSECT                                                                  
RQLITEM  DS    AL2                 Displacment to item                          
RQLUSED  DS    C                   Yes/No, item is in use                       
RQLDFLT  DS    C                   Default setting                              
RQLLNQ   EQU   *-RQLISTD                                                        
                                                                                
RQD      DSECT                                                                  
RQID#    DS    AL1                 Request id #                                 
RQLN     DS    AL1                                                              
RQKYWD   DS    AL2                                                              
         DS    AL2                                                              
RQMAP#   DS    AL1                 Request map #, record X'0070'                
RQMULA   EQU   4                   .  Unit/Ledger/Account                       
RQMFRMT  EQU   5                   .  Format                                    
RQMOPT3  EQU   12                  .  Qopt3                                     
RQMMED   EQU   23                  .  Media code filter                         
RQMF1    EQU   30                  .  Filter 1                                  
RQMF2    EQU   31                  .  Filter 2                                  
RQMF3    EQU   32                  .  Filter 3                                  
RQMF4    EQU   33                  .  Filter 4                                  
RQMF5    EQU   34                  .  Filter 5                                  
RQMCF1   EQU   35                  .  Contra Filter 1                           
RQMCF2   EQU   36                  .  Contra Filter 2                           
RQMCF3   EQU   37                  .  Contra Filter 3                           
RQMCF4   EQU   38                  .  Contra Filter 4                           
RQMCF5   EQU   39                  .  Contra Filter 5                           
RQMOFFC  EQU   40                  .  Office code                               
RQMCULA  EQU   53                  .  Contra Unit/Ledger/Account                
RQMAFLT  EQU   53                  .  Account filter                            
RQMPRSN  EQU   53                  .  Person  filter                            
RQLVL    DS    AL1                 Request level if account                     
RQLVL0   EQU   0                   .  Unit/Ledger                               
RQLVL1   EQU   1                   .  Account/Filter 1                          
RQLVL2   EQU   2                   .  Account/Filter 2                          
RQLVL3   EQU   3                   .  Account/Filter 3                          
RQLVL4   EQU   4                   .  Account/Filter 4                          
RQLVL5   EQU   5                   .  Filter 5                                  
RQIND    DS    AL1                                                              
RQREQ    EQU   X'80'               .  Required field                            
RQVALU   EQU   X'40'               .  Constant value                            
RQPRFIX  EQU   X'20'               .  Has prefix to attach                      
RQPSFIX  EQU   X'10'               .  Has suffix to attach                      
RQDATA   EQU   X'08'               .  Data only                                 
RQVAR    EQU   X'04'               .  Variable data                             
RQDDF    EQU   X'02'               .  List data defined value                   
RQPRVLV  EQU   X'01'               .  Requires prior level active               
*                                  Use RQCC for RQLEN, RQPOS, others            
RQCC     EQU   X'80'               Indication of condition #                    
RQLEN    DS    AL1                 Length   of field data                       
RQPOS    DS    AL1                 Position of field data                       
RQLST#   DS    0AL1                List number                                  
RQNODE#  DS    AL1                 Node maped to                                
RQATB#   DS    0AL1                List attribute number                        
RQCC#    DS    AL1                 Conditional                                  
RQLNQ    EQU   *-RQD                                                            
RQXDATA  DS    0C                                                               
         EJECT ,                                                                
***********************************************************************         
* GAPLST - LIST OF APPROVES - TABLE DEFINITION                        *         
***********************************************************************         
                                                                                
GAPTABD  DSECT                                                                  
GAPTDAT1 DS    XL1                 DATA TYPE                                    
GAPTEOT  EQU   X'FF'               END OF TABLE MARKER                          
GAPTT1Q  EQU   X'01'               - 1R account                                 
GAPTT2Q  EQU   X'02'               - Client code                                
GAPTT3Q  EQU   X'03'               - Media code                                 
GAPTXXX  DS    XL1                 0 OR X'FF' TO AID SORTING                    
GAPTACT  DS    CL12                ACCOUNT CODE                                 
GAPTSTA  DS    XL1                                                              
GAPTICL  EQU   X'80'               Include (set to Y on LimList Q row)          
GAPTECL  EQU   X'40'               Exclude (set to N on LimList Q row)          
GAPTLEN  DS    XL1                                                              
         DS    CL3                                                              
GAPTLNQ  EQU   *-GAPTABD                                                        
*                                                                               
***********************************************************************         
* DSECT FOR XDATA NAMES AND VALUES FOR ESTIMATES                      *         
* Xdata NAMES are stored in AXDATNE                                   *         
* Xdata VALUES are stored in AXDATVE                                  *         
***********************************************************************         
XDATED   DSECT                                                                  
XDATCOL  DS    XL1                 XDATA COLUMN NUMBER                          
XDATDLN  DS    XL1                 LENGTH OF ENTRY                              
XDATNUM  DS    XL1                 NUMBER OF XDATA NAMES                        
XDATUML  DS    0C                                                               
         ORG   XDATUML                                                          
XDATNMS  DS    0CL46               *DATA NAMES*                                 
XDATNL   DS    XL1                 LENGTH OF NAME                               
XDATNM   DS    CL45                NAME                                         
XDATQL1  EQU   *-XDATED                                                         
         ORG   XDATUML                                                          
XDATVLS  DS    0CL63               *DATA VALUES*                                
XDATVL   DS    XL1                 LENGTH OF VALUE                              
XDATVAL  DS    CL62                VALUE                                        
XDATQL2  EQU   *-XDATED                                                         
         EJECT ,                                                                
*ACBIGPRNTD                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACBIGPRNTD                                                     
         PRINT ON                                                               
*ACMASTD                                                                        
         PRINT OFF                                                              
       ++INCLUDE ACMASTD                                                        
         PRINT ON                                                               
*ACQD                                                                           
         PRINT OFF                                                              
       ++INCLUDE ACQD                                                           
         PRINT ON                                                               
*ACREPWORKD                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACREPWORKD                                                     
         PRINT ON                                                               
*ACDDEQUS                                                                       
         PRINT OFF                                                              
       ++INCLUDE ACDDEQUS                                                       
         PRINT ON                                                               
*ACGENFILE                                                                      
         PRINT OFF                                                              
       ++INCLUDE ACGENFILE                                                      
         PRINT ON                                                               
*ACGENMODES                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACGENMODES                                                     
         PRINT ON                                                               
*ACGOBLOCK                                                                      
         PRINT OFF                                                              
ACGOD    DSECT                                                                  
       ++INCLUDE ACGOBLOCK                                                      
         PRINT ON                                                               
*ACGOXBLOCK                                                                     
         PRINT OFF                                                              
ACXGOD   DSECT                                                                  
       ++INCLUDE ACGOXBLOCK                                                     
         PRINT ON                                                               
*ACOFFALD                                                                       
         PRINT OFF                                                              
       ++INCLUDE ACOFFALD                                                       
         PRINT ON                                                               
*ACPRORATAD                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACPRORATAD                                                     
         PRINT ON                                                               
*ACJOBBERD                                                                      
         PRINT OFF                                                              
       ++INCLUDE ACJOBBERD                                                      
         PRINT ON                                                               
*ACJOBBLOCK                                                                     
         PRINT OFF                                                              
JBLOCKD  DSECT                                                                  
       ++INCLUDE ACJOBBLOCK                                                     
         PRINT ON                                                               
*ACJOBEXCPD                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACJOBEXCPD                                                     
         PRINT ON                                                               
*ACJOBAGEI                                                                      
         PRINT OFF                                                              
       ++INCLUDE ACJOBAGEI                                                      
         PRINT ON                                                               
*ACPERFACTC                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACPERFACTC                                                     
         PRINT ON                                                               
*ACSCRDSECT                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACSCRDSECT                                                     
         PRINT ON                                                               
*CTGENFILE                                                                      
         PRINT OFF                                                              
       ++INCLUDE CTGENFILE                                                      
         PRINT ON                                                               
*DDLOGOD                                                                        
         PRINT OFF                                                              
       ++INCLUDE DDLOGOD                                                        
         PRINT ON                                                               
*DDBUFFALOD                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDBUFFALOD                                                     
         PRINT ON                                                               
*DDTSARD                                                                        
         PRINT OFF                                                              
       ++INCLUDE DDTSARD                                                        
         PRINT ON                                                               
*DDCNTRL                                                                        
         PRINT OFF                                                              
       ++INCLUDE DDCNTRL                                                        
         PRINT ON                                                               
*DDREPXTRAD                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDREPXTRAD                                                     
         PRINT ON                                                               
*DDREPMASTD                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDMASTD                                                        
         PRINT ON                                                               
*DDCOMFACS                                                                      
         PRINT OFF                                                              
       ++INCLUDE DDCOMFACS                                                      
         PRINT ON                                                               
*DDLINKD                                                                        
         PRINT OFF                                                              
       ++INCLUDE DDLINKD                                                        
         PRINT ON                                                               
*DDLINKIOD                                                                      
LIOBD    DSECT                                                                  
         PRINT OFF                                                              
       ++INCLUDE DDLINKIOD                                                      
         PRINT ON                                                               
*DDREMOTED                                                                      
         PRINT OFF                                                              
       ++INCLUDE DDREMOTED                                                      
         PRINT ON                                                               
*DDBOXEQUS                                                                      
         PRINT OFF                                                              
       ++INCLUDE DDBOXEQUS                                                      
         PRINT ON                                                               
*DDBIGBOX                                                                       
         PRINT OFF                                                              
       ++INCLUDE DDBIGBOX                                                       
         PRINT ON                                                               
*DDDLCB                                                                         
         PRINT OFF                                                              
       ++INCLUDE DDDLCB                                                         
         PRINT ON                                                               
*DDCUREDITD                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDCUREDITD                                                     
         PRINT ON                                                               
*DDACTIVD                                                                       
         PRINT OFF                                                              
       ++INCLUDE DDACTIVD                                                       
         PRINT ON                                                               
*DDCURTABD                                                                      
         PRINT OFF                                                              
       ++INCLUDE DDCURTABD                                                      
         PRINT ON                                                               
*DDCTRYEQUS                                                                     
*        PRINT OFF                                                              
*      ++INCLUDE DDCTRYEQUS                                                     
*        PRINT ON                                                               
*DDLANGEQUS                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDLANGEQUS                                                     
         PRINT ON                                                               
*DDTAXVALD                                                                      
         PRINT OFF                                                              
       ++INCLUDE DDTAXVALD                                                      
         PRINT ON                                                               
*SEACSFILE                                                                      
         PRINT OFF                                                              
       ++INCLUDE SEACSFILE                                                      
         PRINT ON                                                               
*FAGETTXTD                                                                      
         PRINT OFF                                                              
       ++INCLUDE FAGETTXTD                                                      
         PRINT ON                                                               
*FASECRETD                                                                      
         PRINT OFF                                                              
       ++INCLUDE FASECRETD                                                      
         PRINT ON                                                               
*DDSCANBLKD                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDSCANBLKD                                                     
SCHDRLNQ EQU   SCONEFLD-SCANBLKD                                                
         PRINT ON                                                               
