*          DATA SET ACREQFAD   AT LEVEL 002 AS OF 07/14/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T604FBD      DATE 07/14/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P H             T        Y              
LSTOPTH  DS    CL8                                                              
LSTOPT   DS    CL30     6   15   30  A  U N             T    I   Y              
LSTHEADH DS    CL8                                                              
LSTHEAD  DS    CL79     8    1   79  A  P H             T        Y              
LSTFRSTH DS    CL8                                                              
LSTFRST  DS    CL1      9    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75     9    5   75  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     10    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    10    5   75  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    11    5   75  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    12    5   75  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    13    5   75  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    14    5   75  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    15    5   75  A  U N             T        Y              
LSTENDH  DS    CL8                                                              
LSTEND   DS    CL1     16    4    1  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL79    23    1   79  A  P H             T        Y              
LSTLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 888  BYTES                            
