*          DATA SET ACREQFFD   AT LEVEL 006 AS OF 09/06/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T604FFD      DATE 09/06/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
BVRHDRH  DS    XL8                                                              
BVRHDR   DS    CL60     1    2   60  A  P H             T        Y              
BVRSRVH  DS    XL8                                                              
BVRSRV   DS    CL17     1   63   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL9      2    2    9  A  P N             T        Y              
BVRNAMEH DS    XL8                                                              
BVRNAME  DS    CL17     2   15   17  A  U N        M    T    I   Y              
         DS    XL8                                                              
         DS    CL10     2   34   10  A  P N             T        Y              
BVRNUMH  DS    XL8                                                              
BVRNUM   DS    CL10     2   47   10  A  U N             T        Y              
BVRRNAMH DS    XL8                                                              
BVRRNAM  DS    CL22     2   59   22  A  P N             N        Y              
         DS    XL8                                                              
         DS    CL11     3    2   11  A  P N             T        Y              
BVRDESTH DS    XL8                                                              
BVRDEST  DS    CL10     3   15   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL11     3   34   11  A  P N             T        Y              
BVROUTH  DS    XL8                                                              
BVROUT   DS    CL10     3   47   10  A  U N             T        Y              
BVROPTLH DS    XL8                                                              
BVROPTL  DS    CL7      4    2    7  A  P Z             T        Y              
BVROPTH  DS    XL8                                                              
BVROPT   DS    CL45     4   11   45  A  P N             T        Y              
BVRFRSTH DS    XL8                                                              
BVRFRST  DS    CL1      4   63    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL30    24    2   30  A  P H             T        Y              
BVRLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
BVRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 400  BYTES                            
