*          DATA SET ACREPNCS   AT LEVEL 001 AS OF 04/11/01                      
         DS    0D                                                               
PGMCDE   DS    CL2        PROGRAM CODE                                          
PGMAQ    DS    XL1        PROGRAM EQUATE                                        
PGMA21   EQU   X'80'                                                            
PGMA22   EQU   X'40'                                                            
PGMA23   EQU   X'20'                                                            
PGMA24   EQU   X'10'                                                            
PGMA27   EQU   X'08'                                                            
PGMALL21 EQU   (PGMA21+PGMA22+PGMA23+PGMA24)                                    
PGMA28   EQU   X'04'                                                            
PGMA29   EQU   X'02'                                                            
PGMA30   EQU   X'01'                                                            
PGMALL27 EQU   (PGMA27+PGMA28+PGMA29+PGMA30)                                    
PGMSTA   DS    XL1        STATUS                                                
PGMLIV   EQU   X'80'      LIVE                                                  
PGMDFT   EQU   X'40'      DRAFT                                                 
PGMUNB   EQU   X'20'      UNBILLING                                             
PGMBTYP  DS    XL1        BILL TYPES                                            
         DS    XL3        N/D                                                   
PGMPROF  DS    A          A(PROFILE TABLE)                                      
PGMQOPT  DS    A          A(REQUEST OPTION TABLE)                               
         DS    2A         N/D                                                   
PGMLNQ   EQU   *-PGMCDE                                                         
*                                                                               
ACDITTO  DC    V(ACDITTO)          EXTERNS - DUMP ELEMENTS                      
ACGETTXT DC    V(ACGETTXT)                 - GET TEXT                           
ACJOBLOT DC    V(ACJOBLOT)                 - JOB DATA                           
ACRECTYP DC    V(ACRECTYP)                 - RECORD TYPE                        
BUFFERIN DC    V(BUFFERIN)                 - NEW BUFFALO                        
PRINTER  DC    V(PRINTER)                                                       
PRNTBL   DC    V(PRNTBL)                                                        
ADCPRINT DC    V(CPRINT)                                                        
*                                                                               
DATVAL   DS    A                   FROM COMFACS                                 
HELLO    DS    A                                                                
HELEN    DS    A                                                                
HEXIN    DS    V                                                                
*                                                                               
VATICAN  DS    A                   FROM MASTER                                  
*                                                                               
CENTER   DC    AL1(QCENTER),AL3(0) LOADABLE                                     
FAREPORT DC    AL1(QREPORT),AL3(0)                                              
UNDERLIN DC    AL1(QUNDRLIN),AL3(0)                                             
QSORTR   DC    AL1(QQSORT),AL3(0)                                               
*                                                                               
BASERC   DS    A(0)                                                             
*                                                                               
APHSE2   DS    A          A(02 PHASE - BASE)                                    
ABFMT    DS    A          A(03 PHASE - BILL FORMAT ROUTINE)                     
ABPRT    DS    A          A(04 PHASE - BILL PRINT ROUTINE)                      
APHSE5   DS    A          A(05 PHASE - SUBROUTINES)                             
APOST    DS    A          A(06 PHASE - POSTINGS)                                
AFORM    DS    A          A(07 PHASE - FORMAT TABLES)                           
APHSE8   DS    A          A(08 PHASE - PRINT/TRACE ROUTINES)                    
*                                                                               
ROUTINE1 DS    0F         PHASE 5 - ROUTINES - 1                                
ADMGR    DC    A(0)       A(DATAMGR ROUTINES)                                   
ACCRDQ   EQU   1           READ DIRECTORY                                       
ACCHIQ   EQU   2           READ HIGH                                            
ACCSEQQ  EQU   3           SEQUENCE                                             
ACCWRTQ  EQU   4           WRITE                                                
ACCGETQ  EQU   5           GETREC                                               
ACCPUTQ  EQU   6           PUTREC                                               
ACCADDQ  EQU   7           ADDREC                                               
ACCOLDQ  EQU   8           ACCOUNT                                              
*                                                                               
ASORT    DC    A(0)       A(SORT ROUTINES)                                      
SORTINIQ EQU   1           INITIALIZE                                           
SORTPUTQ EQU   2           PUT                                                  
SORTGETQ EQU   3           GET                                                  
SORTENDQ EQU   4           END                                                  
*                                                                               
AUPPER   DC    A(0)        A(CONVERT TO UPPER CASE)                             
AGETCUR  DC    A(0)        A(GET CURRENCY CODE)                                 
APARCPJ  DC    A(0)        A(PARSE CLI/PROD/JOB)                                
*                                                                               
ASETEL   DC    A(0)        A(SET ELEMENT ADDRESSES)                             
SETLINI  EQU   0            INITIALIZE                                          
SETLCLQ  EQU   1            CLIENT                                              
SETLPRQ  EQU   2            PRODUCT                                             
SETLJBQ  EQU   3            JOB                                                 
SETLBFQ  EQU   4            BILL FORMAT                                         
SETLBHQ  EQU   5            BILL HEADER                                         
*                                                                               
APEST    DC    A(0)        A(PERCENT OF ESTIMATE)                               
PESTBLQ  EQU   1            BUILD % ESTIMATE BUFFER                             
*                                                                               
AWRKM    DC    A(0)        A(WORKCODE ROUTINES)                                 
WRKMBDQ  EQU   1            BUILD THE WORKCODE TABLE                            
WRKMUPQ  EQU   2            UPDATE WORKCODE ENTRY                               
WRKMGTQ  EQU   3            GET CURRENT WORK CODE VALUES                        
*                                                                               
AXTRT    DC    A(0)        A(DATA EXTRACT ROUTINES)                             
GWCNMEQ  EQU   1            GET WORKCODE LONG NAME                              
GWCDSCQ  EQU   2            GET WORKCODE DESCRIPTION                            
GTRNDTQ  EQU   3            GET TRANSACTION DATE (MMMDD/YY)                     
GCONNMQ  EQU   4            GET CONTRA NAME                                     
GTRNNRQ  EQU   5            GET NARRATIVE                                       
*                                                                               
AANAL    DC    A(0)        A(GET ANALYSIS ACCOUNTS FROM INCOME ACCT)            
AGETNAM  DC    A(0)        A(GET NAMES)                                         
*                                                                               
AGETCMT  DC    A(0)        A(GET COMMENTS)                                      
*                                                                               
AGTBNUM  DC    A(0)        A(GET BILL NUMBER)                                   
*                                                                               
AGETGO   DC    A(0)        A(GET UPDATED GOBLOCK)                               
GETGASQ  EQU   1            GET AGENCY STUDIO  OPTIONS                          
GETGWCQ  EQU   2            GET WORKCODE LEVEL OPTIONS                          
GETGJOQ  EQU   3            GET JOB LEVEL OPTIONS                               
*                                                                               
AINTRNL  DC    A(0)        A(INTERNAL INCOME ROUTINES)                          
INTLTRNQ EQU   1            PROCESS TRANSACTION                                 
INTLESTQ EQU   2            PROCESS ESTIMATE                                    
INTLELMQ EQU   3            BUILD INCOME ELEMENTS                               
INTLFSTQ EQU   4            SET DATA FOR FIRST INCOME POSTING                   
INTLNXTQ EQU   5            SET DATA FOR NEXT INCOME POSTING                    
*                                                                               
ASTUDIO  DC    A(0)        A(SET AGYNECY/STUDIO LINKS)                          
*                                                                               
AICMPY   DC    A(0)        A(INTERCOMPANY ROUTINES)                             
ICMPINTQ EQU   1            INITIALIZE                                          
ICMPTRNQ EQU   2            PROCESS TRANSACTION                                 
ICMPFSTQ EQU   3            SET DATA FOR FIRST POSTING                          
ICMPNXTQ EQU   4            SET DATA FOR NEXT POSTING                           
*                                                                               
ATBADD   DC    A(0)       A(BINARRY ADD TO TABLE)                               
ATADD    DC    A(0)       A(ADD TO TABLE)                                       
ATQSORT  DC    A(0)       A(QSORT A TABLE)                                      
ATSET    DC    A(0)       A(SET BINSRCH PARAMETERS)                             
ATSRCH   DC    A(0)       A(SEARCH ROUTINE)                                     
ATNXT    DC    A(0)       A(RETURN FIRST/NEXT RECORD)                           
*                                                                               
CANADTAX DS    0F         PHASE 5 - CANADIAN TAX ROUTINES                       
ACANTX   DC    A(0)        A(CANADIAN TAX ROUTINES)                             
CANINIQ  EQU   1            INITIALIZE                                          
CANBESQ  EQU   2            GET RATE USING BILL ESTIMATE ELEMENT                
CANPTAQ  EQU   3            GET RATE USING PTA ELEMENT                          
CANRTEQ  EQU   4            GET DEFAULT RATE                                    
CANTRNQ  EQU   5            GET GST/PST FOR TRANSACTION/POST TO BUFFER          
CANPRVQ  EQU   6            GET GST/PST FOR PREVIOUS/POST TO BUFFER             
CANGBFQ  EQU   7            RETURN FIRST GST RECORD FROM BUFFER                 
CANGBNQ  EQU   8            RETURN NEXT GST RECORD FROM BUFFER                  
CANPBFQ  EQU   9            RETURN FIRST PST RECORD FROM BUFFER                 
CANPBNQ  EQU   10           RETURN NEXT PST RECORD FROM BUFFER                  
CANTOTQ  EQU   11           RETURN TOTAL GST & PST                              
*                                                                               
         DC    A(0)        N/D                                                  
*                                                                               
AFMTTXT  DC    A(0)        A(FORMAT TEXT ROUTINE)                               
*                                                                               
ACONDT   DC    A(0)        A(CONDITION TEXT ROUTINE)                            
*                                                                               
*        DS    0F         PHASE 8 - ROUTINES                                    
ATRCE    DC    A(0)        A(TRACE ROUTINES)                                    
TRCTRNQ  EQU   1            TRACE BILLABLE TRANSACTION                          
TRCPROQ  EQU   2            TRACE PRORATA BLOCK                                 
TRCFMTQ  EQU   3            TRACE FORMAT RECORDS & KEYS                         
TRCTSRQ  EQU   4            TRACE RECORDS TO SORT                               
TRCFSRQ  EQU   5            TRACE RECORDS FROM SORT                             
TRCBFMQ  EQU   6            TRACE BILL FORMAT RECORDS                           
*                                                                               
AJXRPT   DC    A(0)        A(JOB EXCEPTION REPORT)                              
JXRPINIQ EQU   1            INITIALIZE                                          
JXRPADDQ EQU   2            ADD A JOB TO THE REPORT                             
JXRPERRQ EQU   3            ADD LOCAL ERROR CODE                                
JXRPPRTQ EQU   4            PRINT THE REPORT                                    
*                                                                               
ABJRPT   DC    A(0)        A(BILLABLE JOB REPORT)                               
BJRPINIQ EQU   1            INITIALIZE                                          
BJRPADDQ EQU   2            ADD A JOB TO THE REPORT                             
BJRPPRTQ EQU   3            PRINT THE REPORT                                    
                                                                                
*                         STORAGE                                               
ATABLOW  DS    A          A(LOW STORAGE ALLOACTION TABLE)                       
AIO      DC    A(0)       A(IOAREAS)                                            
*                                                                               
AIO1     DC    A(0)                                                             
ABFMR    DS    0A        A(BILL FORMAT RECORD)       OVERLAY 03,07              
APGHR    DS    0A        A(PAGE HEADER RECORD)               04                 
*                                                                               
AIO2     DC    A(0)                                                             
ADETR    DS    0A        A(DETAIL RECORD RECORD)     OVERLAY 03                 
APGFR    DS    0A        A(PAGE FOOTER RECORD)       OVERLAY 04                 
*                                                                               
AIO3     DC    A(0)                                                             
ATRLR    DS    0A        A(TRAILER RECORD)           OVERLAY 03                 
AHPPR    DS    0A        A(HEADING PER PAGE RECORD)  OVERLAY 04                 
*                                                                               
AIO4     DC    A(0)      A(MISCELLANEOUS)            OVERLAY 06                 
ABEDR    DS    0A        A(BILL EDIT RECORD)         OVERLAY 03,04              
*                                                                               
AIO5     DC    A(0)                                                             
ABEDN    DC    0A        A(NEW BEDREC FROM UPPAN)    OVERLAY 03                 
*                                                                               
AIO6     DC    A(0)      A(MISCELLANEOUS)            OVERLAY 05                 
*                                                                               
ABLH     DC    A(0)      A(BILL HEADER RECORD)       OVERLAY 03                 
*                                                                               
ABFM     DC    A(0)      A(BILL FORMAT IO)                                      
APOSTB   DC    A(0)       A(POSTING BUFFER)                                     
ASRTWK   DC    A(0)       A(SORT WORK)                                          
ABTRN    DC    A(0)       A(BILLABLE TRANSACTIONS BUFFER)                       
ASFTAB   DC    A(0)       A(SECTION FILTER TABLE)                               
ASSTAB   DC    A(0)       A(SECTION SORT TABLE)                                 
APDTAB   DC    A(0)       A(PARAGRAPH DETAIL RECORDS)                           
AREPBLK  DC    A(0)       A(REPORT BLOCK)                                       
AESWC    DC    A(0)       A(ESTIMATED WORKCODES)                                
AESWCB   DC    A(0)       A(ESTIMATED WORKCODES -BILLABLE)                      
ANAMS    DC    A(0)       A(NAME BUFFER)                                        
AANLS    DC    A(0)       A(ANALYSIS ACCOUNT BUFFER)                            
ACMNT    DC    A(0)       A(COMMENTS BUFFER)                                    
*                                                                               
ATABHI   DS    A          A(HIGH STORAGE ALLOCATION TABLE)                      
AWRKTAB  DC    A(0)       A(WORKCODE TABLE)                                     
ABFMB    DC    A(0)       A(BFM RECORD BUFFER AREAA)                            
*                                                                               
ADICI    DC    A(0)       A(DICTIONARY - INPUT)                                 
ADICO    DC    A(0)       A(DICTIONARY - OUTPUT)                                
*                                                                               
BIT31    DC    X'80000000'                                                      
BIT24    DC    X'7FFFFFFF'                                                      
*                                                                               
NBTRN    DC    F'0'       NUMBER IN BTRN TABLE                                  
NPRVB    DC    F'0'       NUMBER OF PREVIOUS BILLS                              
CBTRN    DC    A(0)       A(CURRENT BILLABLE TRANSACTIONS)                      
FPRVB    DC    A(0)       A(FIRST "PREVIOUS BILL" IN TABLE)                     
*                                                                               
WRKCCUR  DS    CL2        CURRENT WORKCODE                                      
*                                                                               
WRKCREC  DS    0X         WORKCODE DATA                                         
WRKCWC   DS    CL2        CODE                                                  
WRKCEL   DS    XL(WCOLNQ) ELEMENT                                               
WRKCDSC  DS    CL15       DESCRIPTION                                           
WRKCNME  DS    CL36       NAME                                                  
WRKCSTA  DS    XL1        STATUS                                                
WRKCSINC EQU   X'80'       INCOME WORKCODE                                      
WRKCSDTL EQU   X'40'       PRINT W/C DETAILS                                    
WRKCSMT  EQU   X'20'       MEDIA TRANSFER W/C                                   
WRKCRTE  DS    PL4'0'     COMMISSION RATE                                       
WRKCTYP  DS    XL1        TYPE                                                  
WRKCTTIM EQU   1           TIME                                                 
WRKCTCST EQU   2           COST                                                 
WRKCGRP  DS    XL1        GROUP                                                 
WRKCTPB  EQU   X'FF'       PREVIOUS BILL                                        
         DS    XL4        N/D                                                   
WRKCLNQ  EQU   *-WRKCREC                                                        
*                                                                               
DKEY     DS    XL42                                                             
DIR      DS    XL60                                                             
DMBYTE   DS    X                                                                
DA       DS    F                                                                
*                                                                               
NEWDISP  DC    Y(ACCRFST-ACCKEY)                                                
ELCODE   DS    XL1                                                              
ELEMENT  DS    CL255                                                            
*                                                                               
ACCOUNT  DC    C'ACCOUNT '                                                      
ACCDIR   DC    C'ACCDIR  '                                                      
ACCMST   DC    C'ACCMST  '                                                      
*                                                                               
UPSI     DC    X'00'      TEST OPTIONS                                          
UPTRN    EQU   X'80'      TRACE BILLABLE TRANSACTIONS                           
UPPRO    EQU   X'40'            PRORATA BLOCK                                   
UPFMT    EQU   X'20'            KEY & PARAGRAPH RECORDS TO BUFFER               
UPFMF    EQU   X'10'            KEY & PARAGRAPH RECORDS FROM BUFFER             
UPSRT    EQU   X'08'            RECORDS TO SORT                                 
UPSRF    EQU   X'04'            RECORDS FROM SORT                               
UPBFM    EQU   X'02'            BILL FORMAT RECORDS                             
*                                                                               
TODAY0   DS    CL6         YYMMDD                                               
TODAY1   DS    PL3         PACKED                                               
TODAY2   DS    XL2         COMPRESSED                                           
TODAY3   DS    XL3         BINARY                                               
TODAY8   DS    XL8         MMMDD/YY                                             
*                                                                               
PRODLGR  DC    C'SJ'      PRODUCTION LEDGER                                     
*                                                                               
CTRYCOD  DS    CL1        COUNTRY CODE                                          
CURCOD   DS    CL3        CURRENCY CODE                                         
CPYC     DS    XL(CPYLN3Q) COMPANY ELEMENT                                      
*                                                                               
JOBCDE   DS    0CL15                                                            
CPY      DS    XL1        COMPANY                                               
UL       DS    CL2        UNIT/LEDGER                                           
CPJ      DS    CL12       CLI/PROD/JOB                                          
*                                                                               
CPJX     DS    0CL18                                                            
CLI      DS    CL6        CLIENT                                                
PRD      DS    CL6        PROD                                                  
MEDIA    DS    0CL1       MEDIA                                                 
JOB      DS    CL6        JOB                                                   
*                                                                               
CLIK     DS    CL15       CLIENT  KEY                                           
CLINAM   DS    CL36               NAME                                          
PRDK     DS    CL15       PRODUCT KEY                                           
PRDNAM   DS    CL36               NAME                                          
JOBK     DS    CL15       JOB     KEY                                           
JOBNAM   DS    CL36               NAME                                          
OFC      DS    CL2        CLIENT OFFICE                                         
MEDN     DS    CL15       MEDIA NAME                                            
         ORG   MEDN+3                                                           
MEDNS    DS    CL12       MEDIA NAME (WITHOUT THE LEADING SPACES)               
*                                                                               
JSTA1    DS    XL1        JOB STATUS BYTE                                       
JS1PBIL  EQU   X'80'      JOB HAS PREVIOUS BILLING                              
JS1PINC  EQU   X'40'      JOB HAS PREV. INTERNAL INCOME (B7 ELEMENTS)           
*                                                                               
FORMNO   DS    X          FORM NUMBER                                           
BILNUM   DS    CL6        BILL NUMBER                                           
SHTBILNO DS    CL7        SHORT BILL NUMBER   MM-NNNN                           
LNGBILNO DS    CL10       LONG BILL NUMBER    MM-MC-NNNN                        
BILMOSC  DS    CL2        BILL MOS       CHARACTER                              
BILMOSP  DS    XL2        BILL MOS       PACKED                                 
BILDT0   DS    CL6        BILL DATE     (YYMMDD)                                
         ORG   BILDT0                                                           
BILDTYY  DS    CL2                                                              
BILDTMM  DS    CL2                                                              
BILDTDD  DS    CL2                                                              
BILDT1   DS    XL3        BILL DATE     (PWOS)                                  
BILDT2   DS    XL2        BILL DATE     (COMPRESSED)                            
DUEDT0   DS    CL6        DUE  DATE     (YYMMDD)                                
DUEDT2   DS    XL2        DUE DATE      (COMPRESSED)                            
*                                                                               
ENDATE1  DS    XL3        END DATE      (PWOS)                                  
ENDATE2  DS    XL2        END DATE      (COMPRESSED)                            
*                                                                               
BLNSTA   DC    X'00'      BILL NUMBER STATUS                                    
BLNSAGY  EQU   X'80'      AGENCY LEVEL BILL NUMBER                              
BLNSCLI  EQU   X'40'      CLIENT LEVEL BILL NUMBER                              
BLNSMED  EQU   X'20'      MEDIA LEVEL BILL NUMBER                               
*                                                                               
JOBTOTL  DS    (BTBKN)PL(L'BKL)    JOB TOTALS                                   
*                                                                               
ERRCODE  DS    XL1        ERROR CODE                                            
ERRSTUD  EQU   1          STUDIO LINK ERROR                                     
*                                                                               
PRVBILLQ DC    C'99'      PREVIOUS BILLING                                      
PZERO    DC    PL8'0'                                                           
PONE     DC    P'1'                                                             
*                                                                               
ABLFEL   DS    A          A(BILLING PARAGRAPH ELEMENT)                          
ABOFEL   DS    A          A(BILL OPTIONS FORMAT ELEMENT)                        
ABLHEL   DS    A          A(BILL HEADER ELEMENT)                                
ANDXEL   DS    A          A(INDEX ELEMENT)                                      
ALNKEL   DS    A          A(LINK ELEMENT)                                       
*                                                                               
ABESEL   DS    A          A(BILLING ESTIMATE ELEMENT BUFFER)                    
AINTLB   DS    A          A(INTERNAL INCOME TABLE)                              
AINCEL   DS    A          A(INTERNAL INCOME ELEMENT BUFFER)                     
*                                                                               
APMDEL   DS    A          A(PRODUCTION MEDIA ELEMENT)                           
ALDGPMD  DS    A          A(LEDGER LEVEL MEDIA ELEMENT)                         
ACLIPMD  DS    A          A(CLIENT LEVEL MEDIA ELEMENT)                         
ACLINUM  DS    A          A(CLIENT LEVEL NUMBER ELEMENT)                        
*                                                                               
ACCCDE   DS    CL(L'ACTKCULA)                                                   
ACCNAM   DS    CL(L'NAMEREC)                                                    
ACCLNQ   EQU   *-ACCCDE                                                         
*                                                                               
JOBTYP   DS    XL1        JOB TYPE                                              
JOBTSTUD EQU   X'80'      STUDIO                                                
JOBTX    EQU   X'40'      X JOB                                                 
*                                                                               
*                         AGENCY STUDIO BLOCK                                   
AGYLSTUD DS    0CL(AGYSLNQ)                                                     
AGYLNK   DS    0CL15      AGENCY LINK - CODE                                    
AGYLCUL  DS    CL3                                                              
AGYLCPJ  DS    0CL12                                                            
AGYLCLI  DS    CL3        CLIENT                                                
AGYLPRO  DS    CL3        PRODUCT                                               
AGYLJOB  DS    CL6        JOB                                                   
AGYLNAM  DS    CL36       AGENCY LINK - NAME                                    
*                                                                               
AGYLCLK  DS    CL15       CLIENT KEY                                            
AGYLCLN  DS    CL36       CLIENT NAME                                           
*                                                                               
AGYOFC   DS    CL2        AGENCY OFFICE                                         
AGYSTUD  DS    CL4        STUDIO CODE                                           
AGYSTVND DS    CL15       STUDIO VENDOR                                         
AGYSTVNM DS    CL36         "      "    NAME                                    
AGYBLDR  DS    CL15       BILLING DEBIT ACCOUNT (GOBDB)                         
AGYICCR  DS    CL15       INTERCOMPANY CREDIT ACCOUNT (GOICR)                   
AGYSTAT  DS    XL1        STATUS                                                
AGYSICMP EQU   X'80'      MAKE INTER-COMPANY POSTINGS                           
AGYWC    DS    CL2        WORKCODE                                              
AGYAMNT  DS    PL6        WORKCODE AMOUNT                                       
AGYSLNQ  EQU   *-AGYLNK                                                         
*                                                                               
CTAXOPT  DS    XL1        CANADIAN TAX OPTION                                   
CTAXOGST EQU   X'80'      USE GST                                               
CTAXOPST EQU   X'40'      USE PST                                               
*                                                                               
CTAXG    DS    0XL(CTDLLNQ)                                                     
CTAXGST  DS    XL(CTXLNQ)    GST RATE INFO - SEE CTXD                           
CTAXGST$ DS    XL(CTAXLNQ)   GST DOLLARS   - SEE CTAXD                          
*                                                                               
CTAXP    DS    0XL(CTDLLNQ)                                                     
CTAXPST  DS    XL(CTXLNQ)    PST RATE INFO                                      
CTAXPST$ DS    XL(CTAXLNQ)   PST DOLLARS                                        
*                                                                               
INTWKC   DS    CL2           WORKCODE                                           
INTDRACC DS    CL15          INTERNAL INCOME DEBIT ACCOUNT                      
INTCRACC DS    CL15          INTERNAL INCOME CREDIT ACCOUNT                     
INTAMNT  DS    PL6           INCOME AMOUNT                                      
*                                                                               
ANLBLK   DS    0X            INCOME ANALYSIS BLOCK                              
ANLINA   DS    CL15          INCOME ACCOUNT                                     
ANLGBA   DS    CL15          GROSS BILLING ANALYSIS(UL=11) FOR INCACC           
ANLGBN   DS    CL36          NAME OF GROSS BILLING ACCOUNT                      
ANLRVA   DS    CL15          REVENUE ANALYSIS(UL=12) FOR INCACC                 
ANLRVN   DS    CL36          NAME OF REVENUE ANALYSIS ACCOUNT                   
ANLBLNQ  EQU   *-ANLBLK                                                         
*                                                                               
CONDD    DS    0XL3                                                             
CONDAQ   DS    XL1                 A DATA EQUATE                                
CONDCQ   DS    XL1                 CONDITION CODE                               
EQ       EQU   X'80'               A = B                                        
LT       EQU   X'40'               A < B                                        
GT       EQU   X'20'               A > B                                        
NE       EQU   X'10'               A =/ B                                       
ZR       EQU   X'80'               ZEROS                                        
MX       EQU   X'40'               MIXED                                        
ON       EQU   X'10'               ONES                                         
OR       EQU   X'08'                                                            
CONDBQ   DS    XL1                 B DATA EQUATE                                
*                                                                               
WRIT     DC    X'00'               WRITE CONTROL                                
WRITLDG  EQU   X'80'               LEDGER RECORD - WRITE PENDING                
WRITLVA  EQU   X'40'               CLIENT RECORD - WRITE PENDING                
WRITMED  EQU   X'20'               MEDIA  RECORD - WRITE PENDING                
*                                                                               
OPTS     DS    0XL30                                                            
OPTMONTH DS    XL1      MONTH FOR INVOICE                 0,1-2                 
OPTSHIPD DS    XL1      SHIP DATE                         0-31                  
OPTBNPFX DS    XL1      BILL # PREFIX (0=MM,1=MY,2=YM)    0-2                   
OPTFRMT  DS    XL1      BILL FORMAT                       1-8                   
OPTGBF   DS    CL1      GROUP BILL FORMAT                                       
*                                                                               
OPT1     DS    XL1                                                              
OPT1ESTN EQU   X'80'    ESTIMATE IS VALUE IS  NET                               
OPT1ESTG EQU   X'40'    ESTIMATE IS VALUE IS  GROSS                             
OPT1ESTS EQU   X'20'    ESTIMATE IS VALUE IS  SUPPRESSED                        
OPT1PVIN EQU   X'10'    PRINT VENDOR INVOICE NUMBER                             
OPT1SVN  EQU   X'08'    SUPPRESS VENDOR NAME                                    
OPT1SNC  EQU   X'04'    SUPPRESS NET AND COMMISSION                             
OPT1MJMC EQU   X'02'    MATCH JOB MEDIA/COMMENT                                 
OPT1PTAR EQU   X'01'    PRINT TARGET ACCOUNT REGISTER                           
*                                                                               
OPT2     DS    XL1                                                              
OPT2XTED EQU   X'80'    EXCLUDE TALENT FOR 1 EXTRA DAY                          
OPT2PRQD EQU   X'40'    PRINT REQUEST DETAILS                                   
OPT2SPB  EQU   X'20'    SUPPRESS PREVIOUS BILLS                                 
OPT2CDWC EQU   X'10'    CASH DISCOUNT BY WORK-CODE                              
OPT2PTI  EQU   X'08'    PRINT TRANSFER INFORMATION                              
OPT2PPCR EQU   X'04'    PAGE PER CLIENT ON REGISTER                             
OPT2DSR  EQU   X'02'    DOUBLE SPACE REGISTER                                   
*                                                                               
OPT3     DS    XL1                                                              
OPT3SDD  EQU   X'80'    SUPPRESS DUE DATE                                       
OPT3PNH  EQU   X'40'    PRINT NAME IN HEADLINE                                  
OPT3PAH  EQU   X'20'    PRINT ADDRESS IN HEADLINE                               
OPT3STFR EQU   X'10'    SUPPRESS TOTAL FOR 1L RETAIL                            
OPT3PROB EQU   X'08'    PRINT REGISTRATION # ON BILL                            
OPT3PTAX EQU   X'04'    PRINT TAX INSTEAD OF CD ON REG                          
OPT3PT2L EQU   X'02'    PRINT TAX AS 2ND LINE ON REG                            
OPT3PWCL EQU   X'01'    PRINT WORKCODE LONG NAME                                
*                                                                               
OPT4     DS    XL1                                                              
OPT4XTFB EQU   X'80'    EXCLUDE TAX FROM BILLING AMOUNT                         
*                                                                               
OPT5     DS    XL1                                                              
OPT5PVCO EQU   X'80'    PRINT VENDOR CODE                                       
OPT5PVDE EQU   X'40'    PRINT VENDOR DESCRIPTION                                
OPT5WCCO EQU   X'20'    PRINT WORKCODE                                          
OPT5WCDE EQU   X'10'    PRINT WORKCODE DESCRIPTION                              
OPT5PDUE EQU   X'08'    PRINT DUE DATE                                          
OPT5RCPT EQU   X'04'    RECEIPT                                                 
OPT5NCGC EQU   X'02'    SHOW NET/COM/GROSS COLS                                 
OPT5SRBO EQU   X'01'    SORT REGISTER BY OFFICE                                 
*                                                                               
OPT6     DS    XL1                                                              
OPT6LNAC EQU   X'80'    LOCATION OF NAME/ADDRESS - CENTER                       
OPT6LNAR EQU   X'40'    LOCATION OF NAME/ADDRESS - RIGHT                        
OPT6LNAL EQU   X'20'    LOCATION OF NAME/ADDRESS - LEFT                         
OPT6PNAD EQU   X'10'    PRINT NARRATIVE DETAIL                                  
OPT6COWC EQU   X'08'    PRINT COMMISSION IN WORKCODE                            
OPT6COTO EQU   X'04'    PRINT COMMISSION IN TOTAL                               
*                                                                               
OPT7     DS    XL1                                                              
OPT7PHAN EQU   X'80'    PRINT HANDLING                                          
OPT7PFEE EQU   X'40'    PRINT FEE                                               
OPT7PCOM EQU   X'20'    COMMISSION                                              
OPT7GLVC EQU   X'10'    GROUP LEVEL CLIENT                                      
OPT7GLVP EQU   X'08'    GROUP LEVEL PRODUCT                                     
*                                                                               
OPT8     DS    XL1                                                              
OPT8SSTD EQU   X'80'    SUPPRESS STANDARD COMMENTS                              
OPT8PNON EQU   X'40'    PRINT NON-BILLABLE DETAILS                              
OPT8PTMD EQU   X'20'    PRINT TIME DETAILS                                      
OPT8PIRC EQU   X'10'    PRINT INVOICE RECAP                                     
OPT8OSTF EQU   X'08'    OMIT 'STAFF'                                            
OPT8PTBW EQU   X'04'    PRINT TIME BY WORKCODE                                  
OPT8PTBP EQU   X'02'    PRINT TIME BY PERSON                                    
OPT8PAWC EQU   X'01'    PRINT AMOUNTS WITH COMMAS                               
*                                                                               
OPT9     DS    XL1                                                              
OPT9UWDP EQU   X'01'    USE W/C DESCRIPTION ON PREBILL                          
*                                                                               
OPTA     DS    XL1                                                              
OPTADTBL EQU   X'80'    DEMAND TOTAL BILL                                       
OPTARJOB EQU   X'40'    RETAIL JOB                                              
OPTASGST EQU   X'08'    SUPPRESS GST/PST                                        
OPTASPST EQU   X'04'    SUPPRESS PST ONLY                                       
OPTARWAS EQU   X'02'    REVERSE WITH ALLOCATED STATUS                           
OPTAORGB EQU   X'01'    USE ORIGINAL NUMBER                                     
*                                                                               
OPTB     DS    XL1                                                              
OPTBAPP  EQU   X'80'    APPROVED ITEMS ONLY                                     
OPTBMED  EQU   X'40'    MEDIA ITEMS ONLY                                        
OPTBPRD  EQU   X'20'    PRODUCTION ITEMS ONLY                                   
         ORG   OPTS+L'OPTS                                                      
         EJECT                                                                  
BK$      DS    0PL6                                                             
NET$     DS    PL(L'BK$)           NET                                          
COM$     DS    PL(L'BK$)           COMMISSION                                   
RCV$     DS    PL(L'BK$)           RECEIVABLE                                   
GRS$     DS    PL(L'BK$)           GROSS                                        
GRSZ$    DS    PL(L'BK$)           OPTION FOR GROSS ZERO                        
CSD$     DS    PL(L'BK$)           CASH DISCOUNT                                
PAY$     DS    PL(L'BK$)           PAYABLE                                      
MED$     DS    PL(L'BK$)           MEDIA TRANSFER                               
RTLP$    DS    PL(L'BK$)           RETAIL PERCENT                               
INTL$    DS    PL(L'BK$)           INTERNAL INCOME                              
SKINC$   DS    PL(L'BK$)           SK REVERSAL                                  
ICMPT$   DS    PL(L'BK$)           INTERCOMPANY TOTAL                           
*                                                                               
TAX$     DS    PL(L'BK$)                                                        
TAXGRS$  DS    PL(L'BK$)           GROSS BILLED (INCLUDING GST OR PST)          
TAXCOM$  DS    PL(L'BK$)           COMMISION BILLED                             
TAXBAS$  DS    PL(L'BK$)           BASIS                                        
*                                                                               
TOTGST$  DS    PL(L'BK$)           TOTAL GST TAX                                
TOTPST$  DS    PL(L'BK$)           TOTAL GST TAX                                
N$       EQU   (*-BK$)/L'BK$                                                    
*                                                                               
       ++INCLUDE ACJOBLOTD                                                      
