*          DATA SET ACRECFFD   AT LEVEL 001 AS OF 09/07/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T608FFD      DATE 09/07/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
RECMSGH  DS    CL8                                                              
RECMSG   DS    CL60     1    2   60  L  P H             T        Y              
RECSRVH  DS    CL8                                                              
RECSRV   DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     2    2   10  L  P H             T        Y              
RECACTH  DS    CL8                                                              
RECACT   DS    CL8      2   13    8  A  U N             T    I   Y    1         
RECACTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      2   23    9  L  P N             T        Y              
RECSCRH  DS    CL8                                                              
RECSCR   DS    CL24     2   33   24  A  U H        M    T        Y    2         
RECSCRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      2   59    8  L  P N             T        Y              
RECREPH  DS    CL8                                                              
RECREP   DS    CL3      2   68    3  A  U H             T        Y    3         
RECREPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     3    2   10  L  P N             T        Y              
RECOPTH  DS    CL8                                                              
RECOPT   DS    CL67     3   13   67  A  U H             T        Y    4         
RECOPTX  DS    CL8                                                              
RECOLAYH DS    CL8                                                              
RECOLAY  DS    CL1      4    2    1  A  P N             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 344  BYTES                            
