*          DATA SET ACRECFAD   AT LEVEL 001 AS OF 09/07/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T608FAD      DATE 09/07/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL14     5    2   14  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL14     5   18   14  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL14     5   34   14  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL14     5   50   14  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL14     5   66   14  L  P H             T        Y              
SRCLIN1H DS    CL8                                                              
SRCLIN1  DS    CL12     6    2   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     6   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     6   34   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     6   50   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     6   66   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     7    2   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     7   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     7   34   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     7   50   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     7   66   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     8    2   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     8   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     8   34   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     8   50   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     8   66   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     9    2   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     9   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     9   34   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     9   50   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     9   66   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    10    2   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    10   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    10   34   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    10   50   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    10   66   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    11    2   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    11   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    11   34   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    11   50   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    11   66   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    12    2   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    12   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    12   34   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    12   50   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    12   66   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    13    2   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    13   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    13   34   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    13   50   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    13   66   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    14    2   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    14   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    14   34   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    14   50   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    14   66   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    15    2   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   34   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   50   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   66   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    16    2   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    16   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    16   34   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    16   50   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    16   66   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    17    2   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    17   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    17   34   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    17   50   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    17   66   12  A  U N             T        Y              
SRCTOTH  DS    CL8                                                              
SRCTOT   DS    CL78    22    2   78  A  P N             T        Y              
SRCTAMH  DS    CL8                                                              
SRCTAM   DS    CL78    23    2   78  A  P H             T        Y  254         
SRCTAMX  DS    CL8                                                              
SRCPFKH  DS    CL8                                                              
SRCPFK   DS    CL78    24    2   78  A  P N             T        Y  255         
SRCPFKX  DS    CL8                                                              
         DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1592 BYTES                            
