*          DATA SET ACREQFBD   AT LEVEL 021 AS OF 07/23/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T604FBD      DATE 07/23/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P H             T        Y              
NOWLDGH  DS    CL8                                                              
NOWLDG   DS    CL1      6   15    1  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL5      6   34    5  N  P N             T        Y              
NOWSTRTH DS    CL8                                                              
NOWSTRT  DS    CL3      6   47    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8    4    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL73     8    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      9    4    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL73     9    7   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     10    4    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL73    10    7   73  A  P N             T        Y              
NOWFRSTH DS    CL8                                                              
NOWFRST  DS    CL1     12    4    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL73    12    7   73  A  U N             T        N              
         DS    CL8                                                              
         DS    CL73    13    7   73  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1     14    4    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL73    14    7   73  A  U N             T        N              
         DS    CL8                                                              
         DS    CL73    15    7   73  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1     16    4    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL73    16    7   73  A  U N             T        N              
         DS    CL8                                                              
         DS    CL73    17    7   73  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1     18    4    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL73    18    7   73  A  U N             T        N              
         DS    CL8                                                              
         DS    CL73    19    7   73  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1     20    4    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL73    20    7   73  A  U N             T        N              
         DS    CL8                                                              
         DS    CL73    21    7   73  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1     22    4    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL73    22    7   73  A  U N             T        N              
         DS    CL8                                                              
         DS    CL73    23    7   73  A  U N             T        N              
NOWENDH  DS    CL8                                                              
NOWEND   DS    CL1     24    2    1  A  P Z             T        Y              
NOWLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
NOWWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1360 BYTES                            
