*          DATA SET ACREPDJDE  AT LEVEL 010 AS OF 07/28/14                      
         TITLE 'DAILY JOURNAL DEFINED STORAGE'                                  
         SPACE 1                                                                
***********************************************************************         
* IOEXEC CONSTANTS                                                    *         
***********************************************************************         
         SPACE 1                                                                
* I/O FILE NAMES                                                                
*                                                                               
ACCDIR   DC    C'ACCDIR '                                                       
ACCMST   DC    C'ACCMST '                                                       
CTFILE   DC    C'CTFILE '                                                       
WKFILE   DC    C'WKFILE '                                                       
         SPACE 1                                                                
* I/O COMMANDS                                                                  
*                ACCDIR                                                         
*                                                                               
ISCMNDS  DS    0CL8                                                             
         DC    C'DMRDHI ',AL1(0)                                                
         DC    C'DMREAD ',AL1(0)                                                
         DC    C'DMRSEQ ',AL1(0)                                                
*                                                                               
*                ACCMST                                                         
*                                                                               
DACMNDS  DS    0CL8                                                             
         DC    C'GETREC ',AL1(0)                                                
*                                                                               
*                WKFILE                                                         
*                                                                               
WKCMNDS  DS    0CL8                                                             
         DC    C'ADD    ',AL1(0)                                                
         DC    C'CLOSE  ',AL1(0)                                                
         EJECT                                                                  
***********************************************************************         
* OTHER CONSTANTS                                                     *         
***********************************************************************         
         SPACE 1                                                                
AIO1     DC    A(IOAREA1)                                                       
AIO2     DC    A(IOAREA2)                                                       
AIO3     DC    A(IOAREA3)                                                       
AIO4     DC    A(IOAREA4)                                                       
*                                                                               
VADDAY   DC    V(ADDAY)                                                         
VGETLOGO DC    V(GETLOGO)                                                       
VPERVERT DC    V(PERVERT)                                                       
VBMONVAL DC    V(BMONVAL)                                                       
PQPROF   DC    V(PQPROF)                                                        
ANBUFF   DC    A(NAMEBUFF)                                                      
APBUFF   DC    A(PROFBUFF)                                                      
AD1BUFF  DC    A(DET1BUFF)                                                      
AD2BUFF  DC    A(DET2BUFF)                                                      
ASBUFF   DC    A(SUBBUFF)                                                       
ALBUFF   DC    A(LDGBUFF)                                                       
AOBUFF   DC    A(OFFBUFF)                                                       
AUBUFF   DC    A(UNITBUFF)                                                      
AWBUFF   DC    A(WORKBUFF)                                                      
*                                                                               
EFFALL   DC    4X'FF'                                                           
STARALL  DC    4C'*'                                                            
*                                                                               
PRTCLOSE DC    C'CLOSE'                                                         
*                                                                               
NO       EQU   C'N'                                                             
YES      EQU   C'Y'                                                             
ONLY     EQU   C'O'                                                             
BLINE    EQU   C'B'                                                             
RLINE    EQU   C'R'                                                             
HEAD     EQU   C'H'                                                             
DATA     EQU   C'D'                                                             
TOTS     EQU   C'T'                                                             
TOTSX    EQU   C'X'                                                             
MIDLINE  EQU   C'B'                                                             
CLOSE    EQU   C'C'                                                             
OPEN     EQU   C'O'                                                             
NEW      EQU   C'N'                                                             
         EJECT                                                                  
***********************************************************************         
* BATCH SOURCE FILES TABLE                                            *         
***********************************************************************         
         SPACE 1                                                                
DJSRCTAB DC    AL1(30,DJSRCREC),AL2(0)  DEBTORS                                 
DJSRCLEN EQU   *-DJSRCTAB                                                       
         DC    AL1(37,DJSRCREC),AL2(0)  MARKER BANK/VOID                        
         DC    AL1(58,DJSRCREC),AL2(0)  INTERAGENCY ESTIMATE ADJUSTMENT         
         DC    AL1(96,DJSRCREC),AL2(0)  CBIL MATCH ADJUSTMENT                   
         DC    AL1(99,DJSRCREC),AL2(0)  WFM POSTINGS                            
         DC    AL1(0)                                                           
         SPACE 1                                                                
***********************************************************************         
* SORTER QUALIFIERS                                                   *         
***********************************************************************         
         SPACE 1                                                                
SORTCARD DC    CL80'SORT FIELDS=(1,38,A),FORMAT=BI,EQUALS'                      
SORTRECD DC    CL80'RECORD TYPE=F,LENGTH=100'                                   
SORTPUT  DC    C'PUT'                                                           
SORTGET  DC    C'GET'                                                           
         SPACE 1                                                                
***********************************************************************         
* ANALYSIS UNITS                                                      *         
***********************************************************************         
         SPACE 1                                                                
ANAUNIT  DC    C'1',C'2'                                                        
         DC    X'00'                                                            
         SPACE 1                                                                
***********************************************************************         
* TIMESHEET BATCHES                                                   *         
***********************************************************************         
         SPACE 1                                                                
TIMBATCH DS    0X                                                               
*&&UK*&& DC    AL1(17,27,49)                                                    
*&&US*&& DC    AL1(27,41,49)                                                    
         DC    AL1(0)                                                           
         SPACE 1                                                                
***********************************************************************         
* SPECIAL JOURNAL ENTRY BATCHES *                                               
***********************************************************************         
         SPACE 1                                                                
SETBATCH DS    0X                                                               
*&&UK*&& DC    AL1(11,18,45)                                                    
*&&US*&& DC    AL1(11,18,45,53)                                                 
         DC    AL1(0)                                                           
         SPACE 1                                                                
***********************************************************************         
* JOURNAL ENTRY BATCHES                                               *         
***********************************************************************         
         SPACE 1                                                                
ENTBATCH DS    0X                                                               
         DC    AL1(2,5,19,20)                                                   
         DC    AL1(0)                                                           
         SPACE 1                                                                
***********************************************************************         
* MONTHS TABLE                                                        *         
***********************************************************************         
         SPACE 1                                                                
MOATAB   DC    C'123456789......ABC'                                            
         EJECT                                                                  
***********************************************************************         
* COLUMNS FORMATS                                                     *         
***********************************************************************         
         SPACE 1                                                                
COLFRM   DC    AL1(COLACT)                                                      
         DC    AL2(0,AC@ACC-WORKD),AL1(0,L'AC@ACC)                              
         DC    AL1(PACT-P,L'PACT)                                               
         DC    AL1(PACT-P,L'PACT)                                               
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLCACT)                                                     
         DC    AL2(0,AC@CTRA2-WORKD),AL1(0,L'AC@CTRA2)                          
         DC    AL1(PCACT-P,L'PCACT)                                             
         DC    AL1(PCACT-P,L'PCACT)                                             
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLACCN)                                                     
         DC    AL2(0,AC@ACCN-WORKD),AL1(0,L'AC@ACCN)                            
         DC    AL1(PACCN-P,L'PACCN)                                             
         DC    AL1(PACCN-P,L'PACCN)                                             
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLDATE)                                                     
         DC    AL2(0,AC@DATE-WORKD),AL1(0,L'AC@DATE)                            
         DC    AL1(PDATE-P,L'PDATE)                                             
         DC    AL1(PDATE-P,L'PDATE)                                             
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLREF)                                                      
         DC    AL2(0,AC@REF-WORKD),AL1(0,L'AC@REF)                              
         DC    AL1(PREF-P,L'PREF)                                               
         DC    AL1(PREF-P,L'PREF)                                               
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLWC1)                                                      
         DC    AL2(AC@WC-WORKD,AC@OFF1-WORKD),AL1(L'AC@WC,L'AC@OFF1)            
         DC    AL1(PWC1-P,L'PWC1)                                               
         DC    AL1(PWC1-P,L'PWC1)                                               
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLWC2)                                                      
         DC    AL2(AC@WC-WORKD,AC@OFF1-WORKD),AL1(L'AC@WC,L'AC@OFF1)            
         DC    AL1(PWC2-P,L'PWC2)                                               
         DC    AL1(PWC2-P,L'PWC2)                                               
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLDET1)                                                     
         DC    AL2(0,AC@TRDET-WORKD),AL1(0,L'AC@TRDET)                          
         DC    AL1(PDET1-P,L'PDET1)                                             
         DC    AL1(PDET1-P,L'PDET1)                                             
         DC    AL1(PDET1-P,L'PDET1)                                             
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLDET2)                                                     
         DC    AL2(0,AC@DTL-WORKD),AL1(0,L'AC@DTL)                              
         DC    AL1(PDET2-P,L'PDET2)                                             
         DC    AL1(PDET2-P,L'PDET2)                                             
         DC    AL1(PDET2-P,L'PDET2)                                             
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLDET3)                                                     
         DC    AL2(0,AC@TRDET-WORKD),AL1(0,L'AC@TRDET)                          
         DC    AL1(PDET3-P,L'PDET3)                                             
         DC    AL1(PDET3-P,L'PDET3)                                             
         DC    AL1(PDET3-P,L'PDET3)                                             
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLDET4)                                                     
         DC    AL2(0,AC@TRDET-WORKD),AL1(0,L'AC@TRDET)                          
         DC    AL1(PDET4-P,L'PDET4)                                             
         DC    AL1(PDET4-P,L'PDET4)                                             
         DC    AL1(PDET4-P,L'PDET4)                                             
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLHRS1)                                                     
         DC    AL2(0,AC@HOURS-WORKD),AL1(0,L'AC@HOURS)                          
         DC    AL1(PHRS1-P,L'PHRS1)                                             
         DC    AL1(PHRS1-P,L'PHRS1)                                             
         DC    AL1(PHRS1-P,L'PHRS1)                                             
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLHRS2)                                                     
         DC    AL2(0,AC@HOURS-WORKD),AL1(0,L'AC@HOURS)                          
         DC    AL1(PHRS2-P,L'PHRS2)                                             
         DC    AL1(PHRS2-P,L'PHRS2)                                             
         DC    AL1(PHRS2-P,L'PHRS2)                                             
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLANP1)                                                     
         DC    AL2(AC@ANLP1-WORKD,0),AL1(L'AC@ANLP1,0)                          
         DC    AL1(PANLPS-P,L'PANLPS)                                           
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLACP1)                                                     
         DC    AL2(AC@ACPS1-WORKD,0),AL1(L'AC@ACPS1,0)                          
         DC    AL1(PACPST-P,L'PACPST)                                           
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLAND)                                                      
         DC    AL2(0,AC@DR1-WORKD),AL1(0,L'AC@DR1)                              
         DC    AL1(PAND-P,0)                                                    
         DC    AL1(PAND-P,L'PAND)                                               
         DC    AL1(PAND-P,L'PAND)                                               
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLANC)                                                      
         DC    AL2(0,AC@CR1-WORKD),AL1(0,L'AC@CR1)                              
         DC    AL1(PANC-P,0)                                                    
         DC    AL1(PANC-P,L'PANC)                                               
         DC    AL1(PANC-P,L'PANC)                                               
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLACD)                                                      
         DC    AL2(0,AC@DR1-WORKD),AL1(0,L'AC@DR1)                              
         DC    AL1(PACD-P,0)                                                    
         DC    AL1(PACD-P,L'PACD)                                               
         DC    AL1(PACD-P,L'PACD)                                               
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLACC)                                                      
         DC    AL2(0,AC@CR1-WORKD),AL1(0,L'AC@CR1)                              
         DC    AL1(PACC-P,0)                                                    
         DC    AL1(PACC-P,L'PACC)                                               
         DC    AL1(PACC-P,L'PACC)                                               
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLLBT)                                                      
         DC    AL2(AC@LGR-WORKD,AC@BTT1-WORKD),AL1(L'AC@LGR,L'AC@BTT1)          
         DC    AL1(PLBT-P,L'PLBT)                                               
         DC    AL1(PLBT-P,L'PLBT)                                               
         DC    AL1(PLBT-P,L'PLBT)                                               
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLOFF)                                                      
         DC    AL2(0,AC@OFF2-WORKD),AL1(0,L'AC@OFF2)                            
         DC    AL1(POFFICE-P,L'POFFICE)                                         
         DC    AL1(POFFICE-P,L'POFFICE)                                         
         DC    AL1(POFFICE-P,L'POFFICE)                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLOFFP)                                                     
         DC    AL2(AC@OFPST-WORKD,0),AL1(L'AC@OFPST,0)                          
         DC    AL1(POFFP-P,L'POFFP)                                             
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLOFFD)                                                     
         DC    AL2(0,AC@DR2-WORKD),AL1(0,L'AC@DR2)                              
         DC    AL1(POFFD-P,0)                                                   
         DC    AL1(POFFD-P,L'POFFD)                                             
         DC    AL1(POFFD-P,L'POFFD)                                             
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLOFFC)                                                     
         DC    AL2(0,AC@CR2-WORKD),AL1(0,L'AC@CR2)                              
         DC    AL1(POFFC-P,0)                                                   
         DC    AL1(POFFC-P,L'POFFC)                                             
         DC    AL1(POFFC-P,L'POFFC)                                             
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLONP)                                                      
         DC    AL2(AC@ONPST-WORKD,0),AL1(L'AC@ONPST,0)                          
         DC    AL1(PONP-P,L'PONP)                                               
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLOND)                                                      
         DC    AL2(0,AC@DR2-WORKD),AL1(0,L'AC@DR2)                              
         DC    AL1(POND-P,0)                                                    
         DC    AL1(POND-P,L'POND)                                               
         DC    AL1(POND-P,L'POND)                                               
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLONC)                                                      
         DC    AL2(0,AC@CR2-WORKD),AL1(0,L'AC@CR2)                              
         DC    AL1(PONC-P,0)                                                    
         DC    AL1(PONC-P,L'PONC)                                               
         DC    AL1(PONC-P,L'PONC)                                               
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLTOTPL)                                                    
         DC    AL2(AC@TPST1-WORKD,0),AL1(L'AC@TPST1,0)                          
         DC    AL1(PTOTPL-P,L'PTOTPL)                                           
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLTOTPO)                                                    
         DC    AL2(AC@TPST3-WORKD,0),AL1(L'AC@TPST3,0)                          
         DC    AL1(PTOTPO-P,L'PTOTPO)                                           
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLTOTD)                                                     
         DC    AL2(0,AC@DR2-WORKD),AL1(0,L'AC@DR2)                              
         DC    AL1(PTOTD-P,0)                                                   
         DC    AL1(PTOTD-P,L'PTOTD)                                             
         DC    AL1(PTOTD-P,L'PTOTD)                                             
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLTOTC)                                                     
         DC    AL2(0,AC@CR2-WORKD),AL1(0,L'AC@CR2)                              
         DC    AL1(PTOTC-P,0)                                                   
         DC    AL1(PTOTC-P,L'PTOTC)                                             
         DC    AL1(PTOTC-P,L'PTOTC)                                             
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLTOTB)                                                     
         DC    AL2(0,AC@BAL-WORKD),AL1(0,L'AC@BAL)                              
         DC    AL1(PTOTB-P,0)                                                   
         DC    AL1(PTOTB-P,L'PTOTB)                                             
         DC    AL1(PTOTB-P,L'PTOTB)                                             
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLBRF1)                                                     
         DC    AL2(AC@BATRF-WORKD,AC@BATRF-WORKD+L'PBBREF+L'PBBMOA-1)           
         DC    AL1(L'PBBREF+L'PBBMOA-1,L'PBBREF+L'PBBMOA-1)                     
         DC    AL1(PBBMOA-P,L'PBBREF+L'PBSEQN+L'PBBMOA+1)                       
         DC    AL1(PBBMOA-P,L'PBBREF+L'PBSEQN+L'PBBMOA+1)                       
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLBNAM1)                                                    
         DC    AL2(0,AC@BATN-WORKD),AL1(0,L'AC@BATN)                            
         DC    AL1(PBBNAME-P,L'PBBNAME)                                         
         DC    AL1(PBBNAME-P,L'PBBNAME)                                         
         DC    AL1(PBBNAME-P,L'PBBNAME)                                         
         DC    AL1(PBBNAME-P,L'PBBNAME+L'PBBTYPE+1)                             
*                                                                               
         DC    AL1(COLBTYP1)                                                    
         DC    AL2(0,AC@BTT2-WORKD),AL1(0,L'AC@BTT2)                            
         DC    AL1(PBBTYPE-P,L'PBBTYPE)                                         
         DC    AL1(PBBTYPE-P,L'PBBTYPE)                                         
         DC    AL1(PBBTYPE-P,L'PBBTYPE)                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLADATE)                                                    
         DC    AL2(AC@OPNDA-WORKD,AC@OPNDA-WORKD+L'PBBADATE)                    
         DC    AL1(L'PBBADATE,L'PBBADATE)                                       
         DC    AL1(PBBADATE-P,L'PBBADATE)                                       
         DC    AL1(PBBADATE-P,L'PBBADATE)                                       
         DC    AL1(PBBADATE-P,L'PBBADATE+L'PBPRSN+1)                            
         DC    AL1(PBBADATE-P,L'PBBADATE+L'PBPRSN+1)                            
*                                                                               
         DC    AL1(COLPSN1)                                                     
         DC    AL2(0,AC@PRSN-WORKD),AL1(0,L'AC@PRSN)                            
         DC    AL1(PBPRSN-P,L'PBPRSN)                                           
         DC    AL1(PBPRSN-P,L'PBPRSN)                                           
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLITC1)                                                     
         DC    AL2(AC@ITMCT-WORKD,AC@ITMCT-WORKD+L'PBITEM)                      
         DC    AL1(L'PBITEM,L'PBITEM)                                           
         DC    AL1(PBITEM-P,L'PBITEM)                                           
         DC    AL1(PBITEM-P,L'PBITEM)                                           
         DC    AL1(PBITEM-P,L'PBITEM)                                           
         DC    AL1(PBITEM-P,L'PBITEM)                                           
*                                                                               
         DC    AL1(COLACP2)                                                     
         DC    AL2(AC@ACPS2-WORKD,AC@ACPS2-WORKD+L'PBACP)                       
         DC    AL1(L'PBACP,L'PBACP)                                             
         DC    AL1(PBACP-P,L'PBACP)                                             
         DC    AL1(PBACP-P,L'PBACP)                                             
         DC    AL1(PBACP-P,L'PBACP)                                             
         DC    AL1(PBACP-P,L'PBACP)                                             
*                                                                               
         DC    AL1(COLANP2)                                                     
         DC    AL2(AC@ANLP2-WORKD,AC@ANLP2-WORKD+L'PBANP)                       
         DC    AL1(L'PBANP,L'PBANP)                                             
         DC    AL1(PBANP-P,L'PBANP)                                             
         DC    AL1(PBANP-P,L'PBANP)                                             
         DC    AL1(PBANP-P,L'PBANP)                                             
         DC    AL1(PBANP-P,L'PBANP)                                             
*                                                                               
         DC    AL1(COLTOP1)                                                     
         DC    AL2(AC@TPST2-WORKD,AC@TPST2-WORKD+L'PBTLP)                       
         DC    AL1(L'PBTLP,L'PBTLP)                                             
         DC    AL1(PBTLP-P,L'PBTLP)                                             
         DC    AL1(PBTLP-P,L'PBTLP)                                             
         DC    AL1(PBTLP-P,L'PBTLP)                                             
         DC    AL1(PBTLP-P,L'PBTLP)                                             
*                                                                               
         DC    AL1(COLBOTH)                                                     
         DC    AL2(0,AC@OTHRI-WORKD),AL1(0,L'AC@OTHRI)                          
         DC    AL1(PBOTHER-P,L'PBOTHER)                                         
         DC    AL1(PBOTHER-P,L'PBOTHER)                                         
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLBNAM2)                                                    
         DC    AL2(0,AC@BATN-WORKD),AL1(0,L'AC@BATN)                            
         DC    AL1(PEBNAME-P,L'PEBNAME)                                         
         DC    AL1(PEBNAME-P,L'PEBNAME)                                         
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLBTYP2)                                                    
         DC    AL2(0,AC@BTT1-WORKD),AL1(0,L'AC@BTT1)                            
         DC    AL1(PEBTYPE-P,L'PEBTYPE+L'PEBTNAME+1)                            
         DC    AL1(PEBTYPE-P,L'PEBTYPE+L'PEBTNAME+1)                            
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLPSN2)                                                     
         DC    AL2(0,AC@PRSN-WORKD),AL1(0,L'AC@PRSN)                            
         DC    AL1(PEPRSN-P,L'PEPRSN)                                           
         DC    AL1(PEPRSN-P,L'PEPRSN)                                           
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLBMON)                                                     
         DC    AL2(AC@BATM2-WORKD,AC@BATM2-WORKD+L'PEBMON)                      
         DC    AL1(L'PEBMON,L'PEBMON)                                           
         DC    AL1(PEBMON-P,L'PEBMON)                                           
         DC    AL1(PEBMON-P,L'PEBMON)                                           
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLCDAT1)                                                    
         DC    AL2(AC@OPNDA-WORKD,AC@OPNDA-WORKD+L'PECDATE)                     
         DC    AL1(L'PECDATE,L'PECDATE)                                         
         DC    AL1(PECDATE-P,L'PECDATE)                                         
         DC    AL1(PECDATE-P,L'PECDATE)                                         
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLEDAT1)                                                    
         DC    AL2(AC@EFFDT-WORKD,AC@EFFDT-WORKD+L'PEEDATE)                     
         DC    AL1(L'PEEDATE,L'PEEDATE)                                         
         DC    AL1(PEEDATE-P,L'PEEDATE)                                         
         DC    AL1(PEEDATE-P,L'PEEDATE)                                         
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLDDATE)                                                    
         DC    AL2(AC@DELDT-WORKD,AC@DELDT-WORKD+L'PEDDATE)                     
         DC    AL1(L'PEDDATE,L'PEDDATE)                                         
         DC    AL1(PEDDATE-P,L'PEDDATE)                                         
         DC    AL1(PEDDATE-P,L'PEDDATE)                                         
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLSTAT1)                                                    
         DC    AL2(0,AC@STT-WORKD),AL1(0,L'AC@STT)                              
         DC    AL1(PESTATE-P,L'PESTATE)                                         
         DC    AL1(PESTATE-P,L'PESTATE)                                         
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLEXCPT)                                                    
         DC    AL2(0,AC@RSN-WORKD),AL1(0,L'AC@RSN)                              
         DC    AL1(PEEXCPT-P,L'PEEXCPT)                                         
         DC    AL1(PEEXCPT-P,L'PEEXCPT)                                         
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLEDAT2)                                                    
         DC    AL2(AC@EFFDT-WORKD,AC@EFFDT-WORKD+L'PDEDATE)                     
         DC    AL1(L'PDEDATE,L'PDEDATE)                                         
         DC    AL1(PDEDATE-P,L'PDEDATE)                                         
         DC    AL1(PDEDATE-P,L'PDEDATE)                                         
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLBRF2)                                                     
         DC    AL2(AC@BATRF-WORKD,AC@BATRF-WORKD+L'PDBREF+L'PDBMOA-1)           
         DC    AL1(L'PDBREF+L'PDBMOA-1,L'PDBREF+L'PDBMOA-1)                     
         DC    AL1(PDBMOA-P,L'PDBREF+L'PDSEQN+L'PDBMOA+1)                       
         DC    AL1(PDBMOA-P,L'PDBREF+L'PDSEQN+L'PDBMOA+1)                       
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLBNAM3)                                                    
         DC    AL2(0,AC@BATN-WORKD),AL1(0,L'AC@BATN)                            
         DC    AL1(PDBNAME-P,L'PDBNAME)                                         
         DC    AL1(PDBNAME-P,L'PDBNAME)                                         
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLBTYP3)                                                    
         DC    AL2(0,AC@BTT1-WORKD),AL1(0,L'AC@BTT1)                            
         DC    AL1(PDBTYPE-P,L'PDBTYPE+L'PDBTNAME+1)                            
         DC    AL1(PDBTYPE-P,L'PDBTYPE+L'PDBTNAME+1)                            
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLPSN3)                                                     
         DC    AL2(0,AC@PRSN-WORKD),AL1(0,L'AC@PRSN)                            
         DC    AL1(PDPRSN-P,L'PDPRSN)                                           
         DC    AL1(PDPRSN-P,L'PDPRSN)                                           
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLCDAT2)                                                    
         DC    AL2(AC@OPNDA-WORKD,AC@OPNDA-WORKD+L'PDCDATE)                     
         DC    AL1(L'PDCDATE,L'PDCDATE)                                         
         DC    AL1(PDCDATE-P,L'PDCDATE)                                         
         DC    AL1(PDCDATE-P,L'PDCDATE)                                         
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLSTAT2)                                                    
         DC    AL2(0,AC@STT-WORKD),AL1(0,L'AC@STT)                              
         DC    AL1(PDSTATE-P,L'PDSTATE)                                         
         DC    AL1(PDSTATE-P,L'PDSTATE)                                         
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLDOTH)                                                     
         DC    AL2(0,AC@OTHRI-WORKD),AL1(0,L'AC@OTHRI)                          
         DC    AL1(PDOTHER-P,L'PDOTHER)                                         
         DC    AL1(PDOTHER-P,L'PDOTHER)                                         
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLCPY)                                                      
         DC    AL2(0,AC@CPY-WORKD),AL1(0,L'AC@CPY)                              
         DC    AL1(PXCPY-P,L'PXCPY)                                             
         DC    AL1(PXCPY-P,L'PXCPY)                                             
         DC    AL1(0,0)                                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLGRP)                                                      
         DC    AL2(0,AC@JRNGP-WORKD),AL1(0,L'AC@JRNGP)                          
         DC    AL1(PXGRP-P,L'PXGRP)                                             
         DC    AL1(PXGRP-P,L'PXGRP)                                             
         DC    AL1(PXGRP-P,L'PXGRP)                                             
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLBTC)                                                      
         DC    AL2(AC@BATCO-WORKD,AC@BATCO-WORKD+L'PXBATCH)                     
         DC    AL1(L'PXBATCH,L'PXBATCH)                                         
         DC    AL1(PXBATCH-P,L'PXBATCH)                                         
         DC    AL1(PXBATCH-P,L'PXBATCH)                                         
         DC    AL1(PXBATCH-P,L'PXBATCH)                                         
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLITC2)                                                     
         DC    AL2(AC@ITMCT-WORKD,AC@ITMCT-WORKD+L'PXITEM-2)                    
         DC    AL1(L'PXITEM-2,L'PXITEM-2)                                       
         DC    AL1(PXITEM-P,L'PXITEM)                                           
         DC    AL1(PXITEM-P,L'PXITEM)                                           
         DC    AL1(PXITEM-P,L'PXITEM)                                           
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLACP3)                                                     
         DC    AL2(AC@ACPS2-WORKD,AC@ACPS2-WORKD+L'PXACP)                       
         DC    AL1(L'PXACP,L'PXACP)                                             
         DC    AL1(PXACP-P,L'PXACP)                                             
         DC    AL1(PXACP-P,L'PXACP)                                             
         DC    AL1(PXACP-P,L'PXACP)                                             
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLANP3)                                                     
         DC    AL2(AC@ANLP2-WORKD,AC@ANLP2-WORKD+L'PXANP)                       
         DC    AL1(L'PXANP,L'PXANP)                                             
         DC    AL1(PXANP-P,L'PXANP)                                             
         DC    AL1(PXANP-P,L'PXANP)                                             
         DC    AL1(PXANP-P,L'PXANP)                                             
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(COLTOP2)                                                     
         DC    AL2(AC@TPST2-WORKD,AC@TPST2-WORKD+L'PXTLP)                       
         DC    AL1(L'PXTLP,L'PXTLP)                                             
         DC    AL1(PXTLP-P,L'PXTLP)                                             
         DC    AL1(PXTLP-P,L'PXTLP)                                             
         DC    AL1(PXTLP-P,L'PXTLP)                                             
         DC    AL1(0,0)                                                         
*                                                                               
         DC    AL1(0)                                                           
         EJECT                                                                  
***********************************************************************         
* COLUMN EQUATES                                                      *         
***********************************************************************         
         SPACE 1                                                                
COLREF   EQU   X'10'             >> DETAIL JOURNAL <<                           
COLDATE  EQU   X'11'                                                            
COLACCN  EQU   X'12'                                                            
COLACT   EQU   X'13'                                                            
COLCACT  EQU   X'14'                                                            
COLWC1   EQU   X'15'                                                            
COLWC2   EQU   X'25'                                                            
COLDET1  EQU   X'16'                                                            
COLDET2  EQU   X'26'                                                            
COLDET3  EQU   X'36'                                                            
COLDET4  EQU   X'46'                                                            
COLHRS1  EQU   X'17'                                                            
COLHRS2  EQU   X'27'                                                            
COLANP1  EQU   X'18'                                                            
COLACP1  EQU   X'19'                                                            
COLAND   EQU   X'1A'                                                            
COLANC   EQU   X'1B'                                                            
COLACD   EQU   X'1C'                                                            
COLACC   EQU   X'1D'                                                            
*                                                                               
COLLBT   EQU   X'50'             >> LEDGER/BATCH TYPE SUMMARY <<                
COLOFF   EQU   X'60'             >> OFFICE SUMMARY <<                           
COLOFFP  EQU   X'51'                                                            
COLOFFD  EQU   X'52'                                                            
COLOFFC  EQU   X'53'                                                            
COLONP   EQU   X'54'                                                            
COLOND   EQU   X'55'                                                            
COLONC   EQU   X'56'                                                            
COLTOTPL EQU   X'57'                                                            
COLTOTPO EQU   X'61'                                                            
COLTOTD  EQU   X'58'                                                            
COLTOTC  EQU   X'59'                                                            
COLTOTB  EQU   X'62'                                                            
*                                                                               
COLBRF1  EQU   X'70'             >> BATCH SUMMARY <<                            
COLBNAM1 EQU   X'71'                                                            
COLBTYP1 EQU   X'72'                                                            
COLADATE EQU   X'73'                                                            
COLPSN1  EQU   X'74'                                                            
COLITC1  EQU   X'75'                                                            
COLACP2  EQU   X'76'                                                            
COLANP2  EQU   X'77'                                                            
COLTOP1  EQU   X'78'                                                            
COLBOTH  EQU   X'79'                                                            
*                                                                               
COLBNAM2 EQU   X'80'             >> EXCEPTION LIST <<                           
COLBTYP2 EQU   X'81'                                                            
COLPSN2  EQU   X'82'                                                            
COLBMON  EQU   X'83'                                                            
COLCDAT1 EQU   X'84'                                                            
COLEDAT1 EQU   X'85'                                                            
COLDDATE EQU   X'86'                                                            
COLSTAT1 EQU   X'87'                                                            
COLEXCPT EQU   X'88'                                                            
*                                                                               
COLEDAT2 EQU   X'90'             >> DUE LIST <<                                 
COLBRF2  EQU   X'91'                                                            
COLBNAM3 EQU   X'92'                                                            
COLBTYP3 EQU   X'93'                                                            
COLPSN3  EQU   X'94'                                                            
COLCDAT2 EQU   X'95'                                                            
COLSTAT2 EQU   X'96'                                                            
COLDOTH  EQU   X'97'                                                            
*                                                                               
COLCPY   EQU   X'A0'             >> DDS SUMMARY <<                              
COLGRP   EQU   X'A1'                                                            
COLBTC   EQU   X'A2'                                                            
COLITC2  EQU   X'A3'                                                            
COLACP3  EQU   X'A4'                                                            
COLANP3  EQU   X'A5'                                                            
COLTOP2  EQU   X'A6'                                                            
         EJECT                                                                  
***********************************************************************         
* REPORT FORMATS                                                      *         
***********************************************************************         
         SPACE 1                                                                
REPFRM01 DC    AL1(COLREF,COLDATE,COLACCN,COLACT,COLWC1,COLDET1)                
         DC    AL1(COLANP1,COLAND,COLANC,COLACP1,COLACD,COLACC)                 
         DC    AL1(0)                                                           
*                                                                               
REPFRM02 DC    AL1(COLREF,COLDATE,COLACCN,COLACT,COLWC1,COLDET2)                
         DC    AL1(COLHRS1,COLANP1,COLAND,COLANC,COLACP1,COLACD,COLACC)         
         DC    AL1(0)                                                           
*                                                                               
REPFRM03 DC    AL1(COLREF,COLDATE,COLACCN,COLACT,COLCACT,COLWC2)                
         DC    AL1(COLDET3,COLACP1,COLACD,COLACC)                               
         DC    AL1(0)                                                           
*                                                                               
REPFRM04 DC    AL1(COLREF,COLDATE,COLACCN,COLACT,COLCACT,COLWC2)                
         DC    AL1(COLDET4,COLHRS2,COLACP1,COLACD,COLACC)                       
         DC    AL1(0)                                                           
*                                                                               
REPFRM05 DC    AL1(COLLBT,COLOFFP,COLOFFD,COLOFFC,COLONP,COLOND,COLONC)         
         DC    AL1(COLTOTPL,COLTOTD,COLTOTC)                                    
         DC    AL1(0)                                                           
*                                                                               
REPFRM06 DC    AL1(COLOFF,COLOFFP,COLOFFD,COLOFFC,COLONP,COLOND,COLONC)         
         DC    AL1(COLTOTPO,COLTOTD,COLTOTC,COLTOTB)                            
         DC    AL1(0)                                                           
*                                                                               
REPFRM07 DC    AL1(COLBRF1,COLBNAM1,COLBTYP1,COLADATE,COLPSN1,COLITC1)          
         DC    AL1(COLACP2,COLANP2,COLTOP1,COLBOTH)                             
         DC    AL1(0)                                                           
*                                                                               
REPFRM08 DC    AL1(COLBRF1,COLBNAM2,COLBTYP2,COLPSN2,COLBMON)                   
         DC    AL1(COLCDAT1,COLEDAT1,COLDDATE,COLSTAT1,COLEXCPT)                
         DC    AL1(0)                                                           
*                                                                               
REPFRM09 DC    AL1(COLEDAT2,COLBRF2,COLBNAM3,COLBTYP3,COLPSN3)                  
         DC    AL1(COLCDAT2,COLSTAT2,COLDOTH)                                   
         DC    AL1(0)                                                           
*                                                                               
REPFRM10 DC    AL1(COLCPY,COLGRP,COLBTC,COLITC2)                                
         DC    AL1(COLACP3,COLANP3,COLTOP2)                                     
         DC    AL1(0)                                                           
         EJECT                                                                  
***********************************************************************         
* FILTER VALUE REPORTS                                                *         
***********************************************************************         
         SPACE 1                                                                
* XL1    FILTER VALUE  (SEE FILVAL)                                             
* XL1    PROGRAM TYPE  (SEE JPROG)                                              
* XL1    FILTER OPTION (SEE FILOPT) IJ ONLY                                     
*                      DEFAULT (0) ALWAYS LAST IN ANY SEQUENCE                  
* XL6    REPORT TYPES  (SEE SKREPS)                                             
         SPACE 1                                                                
FILREPS  DC    AL1(FVINSU,0,0)                                                  
         DC    AL1(SKRDJ1,SKRLGS,SKROFS,SKRBTS,0,0)                             
*                                                                               
         DC    AL1(FVONLU,0,0)                                                  
         DC    AL1(SKRDJ1,SKRLGS,SKROFS,SKRBTS,0,0)                             
*                                                                               
         DC    AL1(FVOVNU,0,0)                                                  
         DC    AL1(SKRDJ1,SKRLGS,SKROFS,SKRBTS,0,0)                             
*                                                                               
         DC    AL1(FVOVNS,0,0)                                                  
         DC    AL1(SKRDJ2,0,0,0,0,0)                                            
*                                                                               
         DC    AL1(FVDFTU,0,0)                                                  
         DC    AL1(SKRDJ1,SKRLGS,SKROFS,SKRBTS,0,0)                             
*                                                                               
         DC    AL1(FVDFTD,0,0)                                                  
         DC    AL1(SKRXCP,0,0,0,0,0)                                            
*                                                                               
         DC    AL1(FVDFTW,JPDJ,0)                                               
         DC    AL1(SKRXCP,0,0,0,0,0)                                            
         DC    AL1(FVDFTW,JPIJ,FOCLSD)                                          
         DC    AL1(SKRDJ1,SKRLGS,SKROFS,SKRBTS,0,0)                             
         DC    AL1(FVDFTW,JPIJ,0)                                               
         DC    AL1(SKRXCP,0,0,0,0,0)                                            
*                                                                               
         DC    AL1(FVOPND,0,0)                                                  
         DC    AL1(SKRXCP,0,0,0,0,0)                                            
*                                                                               
         DC    AL1(FVOPNW,0,0)                                                  
         DC    AL1(SKRXCP,0,0,0,0,0)                                            
*                                                                               
         DC    AL1(FVSAVD,0,0)                                                  
         DC    AL1(SKRXCP,0,0,0,0,0)                                            
*                                                                               
         DC    AL1(FVSAVW,JPDJ,0)                                               
         DC    AL1(SKRXCP,0,0,0,0,0)                                            
         DC    AL1(FVSAVW,JPIJ,FOCLSD)                                          
         DC    AL1(SKRDJ1,SKRLGS,SKROFS,SKRBTS,0,0)                             
         DC    AL1(FVSAVW,JPIJ,0)                                               
         DC    AL1(SKRXCP,0,0,0,0,0)                                            
*                                                                               
         DC    AL1(FVDELD,0,0)                                                  
         DC    AL1(SKRXCP,0,0,0,0,0)                                            
*                                                                               
         DC    AL1(FVDUEN,JPDJ,0)                                               
         DC    AL1(SKRDUE,0,0,0,0,0)                                            
         DC    AL1(FVDUEN,JPIJ,FOUPDT)                                          
         DC    AL1(SKRDJ1,SKRLGS,SKROFS,SKRBTS,0,0)                             
         DC    AL1(FVDUEN,JPIJ,0)                                               
         DC    AL1(SKRDUE,0,0,0,0,0)                                            
*                                                                               
         DC    AL1(FVDUEA,JPDJ,0)                                               
         DC    AL1(SKRDUE,0,0,0,0,0)                                            
         DC    AL1(FVDUEA,JPIJ,FOUPDT)                                          
         DC    AL1(SKRDJ1,SKRLGS,SKROFS,SKRBTS,0,0)                             
         DC    AL1(FVDUEA,JPIJ,0)                                               
         DC    AL1(SKRDUE,0,0,0,0,0)                                            
*                                                                               
         DC    AL1(FVDUEU,JPDJ,0)                                               
         DC    AL1(SKRXCP,SKRDUE,0,0,0,0)                                       
         DC    AL1(FVDUEU,JPIJ,FOUPDT+FOCLSD)                                   
         DC    AL1(SKRDJ1,SKRLGS,SKROFS,SKRBTS,0,0)                             
FILREPSX DC    AL1(FVDUEU,JPIJ,0)                                               
         DC    AL1(SKRXCP,SKRDUE,0,0,0,0)                                       
*                                                                               
FILREPSQ EQU   *-FILREPSX                                                       
FILREPSN EQU   (*-FILREPS)/FILREPSQ                                             
         EJECT                                                                  
***********************************************************************         
* BATCH TYPE TABLE                                                    *         
***********************************************************************         
         SPACE 1                                                                
BTYPTAB  DC    AL1(BT01),AL2(AC@TT001-DDOUT1)                                   
         DC    AL1(BT02),AL2(AC@TT002-DDOUT1)                                   
         DC    AL1(BT03),AL2(AC@TT003-DDOUT1)                                   
         DC    AL1(BT04),AL2(AC@TT004-DDOUT1)                                   
         DC    AL1(BT05),AL2(AC@TT005-DDOUT1)                                   
         DC    AL1(BT06),AL2(AC@TT006-DDOUT1)                                   
         DC    AL1(BT07),AL2(AC@TT007-DDOUT1)                                   
         DC    AL1(BT08),AL2(AC@TT008-DDOUT1)                                   
         DC    AL1(BT09),AL2(AC@TT009-DDOUT1)                                   
         DC    AL1(BT10),AL2(AC@TT010-DDOUT1)                                   
         DC    AL1(BT11),AL2(AC@TT011-DDOUT1)                                   
         DC    AL1(BT12),AL2(AC@TT012-DDOUT1)                                   
         DC    AL1(BT13),AL2(AC@TT013-DDOUT1)                                   
         DC    AL1(BT14),AL2(AC@TT014-DDOUT1)                                   
         DC    AL1(BT15),AL2(AC@TT015-DDOUT1)                                   
         DC    AL1(BT16),AL2(AC@TT016-DDOUT1)                                   
         DC    AL1(BT17),AL2(AC@TT017-DDOUT1)                                   
         DC    AL1(BT18),AL2(AC@TT018-DDOUT1)                                   
         DC    AL1(BT19),AL2(AC@TT019-DDOUT1)                                   
         DC    AL1(BT20),AL2(AC@TT020-DDOUT1)                                   
         DC    AL1(BT21),AL2(AC@TT021-DDOUT1)                                   
         DC    AL1(BT22),AL2(AC@TT022-DDOUT1)                                   
         DC    AL1(BT23),AL2(AC@TT023-DDOUT1)                                   
         DC    AL1(BT24),AL2(AC@TT024-DDOUT1)                                   
         DC    AL1(BT25),AL2(AC@TT025-DDOUT1)                                   
         DC    AL1(BT26),AL2(AC@TT026-DDOUT1)                                   
         DC    AL1(BT27),AL2(AC@TT027-DDOUT1)                                   
         DC    AL1(BT28),AL2(AC@TT028-DDOUT1)                                   
         DC    AL1(BT29),AL2(AC@TT029-DDOUT1)                                   
         DC    AL1(BT30),AL2(AC@TT030-DDOUT1)                                   
         DC    AL1(BT31),AL2(AC@TT031-DDOUT1)                                   
         DC    AL1(BT32),AL2(AC@TT032-DDOUT1)                                   
         DC    AL1(BT33),AL2(AC@TT033-DDOUT1)                                   
         DC    AL1(BT34),AL2(AC@TT034-DDOUT1)                                   
         DC    AL1(BT35),AL2(AC@TT035-DDOUT1)                                   
         DC    AL1(BT36),AL2(AC@TT036-DDOUT1)                                   
         DC    AL1(BT37),AL2(AC@TT037-DDOUT1)                                   
         DC    AL1(BT38),AL2(AC@TT038-DDOUT1)                                   
         DC    AL1(BT39),AL2(AC@TT039-DDOUT1)                                   
         DC    AL1(BT40),AL2(AC@TT040-DDOUT1)                                   
         DC    AL1(BT41),AL2(AC@TT041-DDOUT1)                                   
         DC    AL1(BT42),AL2(AC@TT042-DDOUT1)                                   
         DC    AL1(BT43),AL2(AC@TT043-DDOUT1)                                   
         DC    AL1(BT44),AL2(AC@TT044-DDOUT1)                                   
         DC    AL1(BT45),AL2(AC@TT045-DDOUT1)                                   
         DC    AL1(BT46),AL2(AC@TT046-DDOUT1)                                   
         DC    AL1(BT47),AL2(AC@TT047-DDOUT1)                                   
         DC    AL1(BT48),AL2(AC@TT048-DDOUT1)                                   
         DC    AL1(BT49),AL2(AC@TT049-DDOUT1)                                   
         DC    AL1(BT50),AL2(AC@TT050-DDOUT1)                                   
         DC    AL1(BT51),AL2(AC@TT051-DDOUT1)                                   
         DC    AL1(BT52),AL2(AC@TT052-DDOUT1)                                   
         DC    AL1(BT53),AL2(AC@TT053-DDOUT1)                                   
         DC    AL1(BT54),AL2(AC@TT054-DDOUT1)                                   
         DC    AL1(BT55),AL2(AC@TT055-DDOUT1)                                   
         DC    AL1(BT56),AL2(AC@TT056-DDOUT1)                                   
         DC    AL1(BT57),AL2(AC@TT057-DDOUT1)                                   
         DC    AL1(BT58),AL2(AC@TT058-DDOUT1)                                   
         DC    AL1(BT59),AL2(AC@TT059-DDOUT1)                                   
         DC    AL1(BT60),AL2(AC@TT060-DDOUT1)                                   
         DC    AL1(BT61),AL2(AC@TT061-DDOUT1)                                   
         DC    AL1(BT62),AL2(AC@TT062-DDOUT1)                                   
         DC    AL1(BT63),AL2(AC@TT063-DDOUT1)                                   
         DC    AL1(BT64),AL2(AC@TT064-DDOUT1)                                   
         DC    AL1(BT70),AL2(AC@TT070-DDOUT1)                                   
         DC    AL1(BT71),AL2(AC@TT071-DDOUT1)                                   
         DC    AL1(BT75),AL2(AC@TT075-DDOUT1)                                   
         DC    AL1(BT79),AL2(AC@TT079-DDOUT1)                                   
         DC    AL1(BT97),AL2(AC@TT097-DDOUT1)                                   
         DC    AL1(BT98),AL2(AC@TT098-DDOUT1)                                   
         DC    AL1(BT99),AL2(AC@TT099-DDOUT1)                                   
         DC    AL1(0)                                                           
         EJECT                                                                  
***********************************************************************         
* UPPER CASE DICTIONARY LIST                                          *         
***********************************************************************         
         SPACE 1                                                                
DDIN1    DCDDL AC#MOS,L'AC@MOS                                                  
         DCDDL AC#APR,L'AC@APR                                                  
         DC    X'00'                                                            
         SPACE 1                                                                
***********************************************************************         
* MIXED CASE DICTIONARY LIST                                          *         
***********************************************************************         
         SPACE 1                                                                
DDIN2    DCDDL AC#INSUQ,L'AC@INSUQ                                              
         DCDDL AC#ONLUQ,L'AC@ONLUQ                                              
         DCDDL AC#ACRLQ,L'AC@ACRLQ                                              
         DCDDL AC#ACRRQ,L'AC@ACRRQ                                              
         DCDDL AC#BATSD,L'AC@BATSD                                              
         DCDDL AC#BATUA,L'AC@BATUA                                              
         DCDDL AC#BATRV,L'AC@BATRV                                              
         DCDDL AC#BATCP,L'AC@BATCP                                              
         DCDDL AC#BATGN,L'AC@BATGN                                              
         DCDDL AC#INSUP,L'AC@INSUP                                              
         DCDDL AC#ONLIN,L'AC@ONLIN                                              
         DCDDL AC#ACRL,L'AC@ACRL                                                
         DCDDL AC#RVRSL,L'AC@RVRSL                                              
         DCDDL AC#CPY,L'AC@CPY                                                  
         DCDDL AC#GROUP,L'AC@GROUP                                              
         DCDDL AC#USER,L'AC@USER                                                
         DCDDL AC#LUID,L'AC@LUID                                                
         DCDDL AC#APRVR,L'AC@APRVR                                              
         DCDDL AC#ANACS,L'AC@ANACS                                              
         DCDDL AC#CTRA,L'AC@CTRA1                                               
         DCDDL AC#TIME,L'AC@TIME                                                
         DCDDL AC#TO,L'AC@TO                                                    
         DCDDL AC#FROM,L'AC@FROM                                                
         DCDDL AC#CSHDS,L'AC@CSHDS                                              
         DCDDL AC#BASIS,L'AC@BASIS                                              
         DCDDL AC#RATE,L'AC@RATE                                                
         DCDDL AC#LOC,L'AC@LOC                                                  
         DCDDL AC#BAT,L'AC@BAT                                                  
         DCDDL AC#BATS,L'AC@BATS                                                
         DCDDL AC#ITEM,L'AC@ITEM                                                
         DCDDL AC#ITEMS,L'AC@ITMS1                                              
         DCDDL AC#ITEMS,L'AC@ITMS2                                              
         DCDDL AC#DELD,L'AC@DELD1                                               
         DCDDL AC#DELD,L'AC@DELD2                                               
         DCDDL AC#PRGED,L'AC@PRGED                                              
         DCDDL AC#NPSTD,L'AC@NPSTD                                              
         DCDDL AC#NDUE,L'AC@NDUE                                                
         DCDDL AC#SAVED,L'AC@SAVED                                              
         DCDDL AC#OPEN2,L'AC@OPEN2                                              
         DCDDL AC#MOALK,L'AC@MOALK                                              
         DCDDL AC#EXPRD,L'AC@EXPRD                                              
         DCDDL AC#ORDOB,L'AC@ORDOB                                              
         DCDDL AC#UAPR,L'AC@UAPR                                                
         DCDDL AC#BATPD,L'AC@BATPD                                              
         DCDDL AC#DELPM,L'AC@DELPM                                              
         DCDDL AC#DULIS,L'AC@DULIS                                              
         DCDDL AC#DULIW,L'AC@DULIW                                              
         DCDDL AC#PENDG,L'AC@PENDG                                              
         DCDDL AC#NOAPR,L'AC@NOAPR                                              
         DCDDL AC#APRVB,L'AC@APRVB                                              
         DCDDL AC#ANLC,L'AC@ANLC                                                
         DCDDL AC#TMSTT,L'AC@TMSTT                                              
         DCDDL AC#SUBR,L'AC@SUBR                                                
         DCDDL AC#ORDER,L'AC@ORDER                                              
         DCDDL AC#PRD,L'AC@PRD                                                  
         DCDDL AC#GLG,L'AC@GLG                                                  
         DCDDL AC#CLI,L'AC@CLI                                                  
         DCDDL AC#PRO,L'AC@PRO                                                  
         DCDDL AC#JOB,L'AC@JOB                                                  
         DCDDL AC#JOEST,L'AC@JOEST                                              
         DCDDL AC#EST,L'AC@EST                                                  
         DCDDL AC#TASK,L'AC@TASK                                                
         DCDDL AC#BLB,L'AC@BLB                                                  
         DCDDL AC#NBLB,L'AC@NBLB                                                
         DCDDL AC#CURRY,L'AC@CURRY                                              
         DCDDL AC#CHK,L'AC@CHK                                                  
         DCDDL AC#CROR,L'AC@CROR                                                
         DCDDL AC#PAYEE,L'AC@PAYEE                                              
         DCDDL AC#NCOM,L'AC@NCOM                                                
         DCDDL AC#VPB,L'AC@VPB                                                  
         DCDDL AC#INV,L'AC@INV                                                  
*                                                                               
         DCDDL AC#ACC,L'AC@ACC                                                  
         DCDDL AC#ACCN,L'AC@ACCN                                                
         DCDDL AC#CTRA,L'AC@CTRA2                                               
         DCDDL AC#DATE,L'AC@DATE                                                
         DCDDL AC#ADATE,L'AC@ADATE,H                                            
         DCDDL AC#EFFDT,L'AC@EFFDT,H                                            
         DCDDL AC#CRTDT,L'AC@CRTDT,H                                            
         DCDDL AC#OPNDA,L'AC@OPNDA,H                                            
         DCDDL AC#DELDT,L'AC@DELDT,H                                            
         DCDDL AC#REF,L'AC@REF                                                  
         DCDDL AC#WC,L'AC@WC                                                    
         DCDDL AC#OFF,L'AC@OFF1                                                 
         DCDDL AC#OFF,L'AC@OFF2                                                 
         DCDDL AC#PRSN,L'AC@PRSN                                                
         DCDDL AC#TRDET,L'AC@TRDET                                              
         DCDDL AC#DTL,L'AC@DTL                                                  
         DCDDL AC#HOURS,L'AC@HOURS,R                                            
         DCDDL AC#ANLPA,L'AC@ANLP1,C                                            
         DCDDL AC#ANLPA,L'AC@ANLP2,H                                            
         DCDDL AC#ACPST,L'AC@ACPS1,C                                            
         DCDDL AC#ACPST,L'AC@ACPS2,H                                            
         DCDDL AC#DR,L'AC@DR1,R                                                 
         DCDDL AC#DR,L'AC@DR2,R                                                 
         DCDDL AC#CR,L'AC@CR1,R                                                 
         DCDDL AC#CR,L'AC@CR2,R                                                 
         DCDDL AC#BAL,L'AC@BAL,R                                                
         DCDDL AC#LGR,L'AC@LGR                                                  
         DCDDL AC#BATTY,L'AC@BTT1                                               
         DCDDL AC#BATTY,L'AC@BTT2                                               
         DCDDL AC#BATRF,L'AC@BATRF,H                                            
         DCDDL AC#BATN,L'AC@BATN                                                
         DCDDL AC#BATM2,L'AC@BATM2,H                                            
         DCDDL AC#ITMCT,L'AC@ITMCT,H                                            
         DCDDL AC#OFPST,L'AC@OFPST,C                                            
         DCDDL AC#ONPST,L'AC@ONPST,C                                            
         DCDDL AC#TPSTS,L'AC@TPST1,C                                            
         DCDDL AC#TPSTS,L'AC@TPST2,H                                            
         DCDDL AC#TPSTS,L'AC@TPST3,C                                            
         DCDDL AC#OTHRI,L'AC@OTHRI                                              
         DCDDL AC#STT,L'AC@STT                                                  
         DCDDL AC#RSN,L'AC@RSN                                                  
         DCDDL AC#BATCO,L'AC@BATCO,H                                            
         DCDDL AC#JRNGP,L'AC@JRNGP                                              
*                                                                               
         DCDDL AC#TOTLS,L'AC@TOTLS                                              
         DCDDL AC#TOTFR,L'AC@TOTFR                                              
         DCDDL AC#BATTS,L'AC@BATS1                                              
         DCDDL AC#BATTS,L'AC@BATS2                                              
         DCDDL AC#CNTTS,L'AC@CNTS1                                              
         DCDDL AC#CNTTS,L'AC@CNTS2                                              
         DCDDL AC#TYPTS,L'AC@TYPTS                                              
         DCDDL AC#OVRTS,L'AC@OVRTS                                              
         DCDDL AC#CPYTS,L'AC@CPYTS                                              
         EJECT                                                                  
***********************************************************************         
* BATCH NAMES LIST                                                    *         
***********************************************************************         
         SPACE 1                                                                
         DCDDL AC#TT001,L'AC@TT001                                              
         DCDDL AC#TT002,L'AC@TT001                                              
         DCDDL AC#TT003,L'AC@TT001                                              
         DCDDL AC#TT004,L'AC@TT001                                              
         DCDDL AC#TT005,L'AC@TT001                                              
         DCDDL AC#TT006,L'AC@TT001                                              
         DCDDL AC#TT007,L'AC@TT001                                              
         DCDDL AC#TT008,L'AC@TT001                                              
         DCDDL AC#TT009,L'AC@TT001                                              
         DCDDL AC#TT010,L'AC@TT001                                              
         DCDDL AC#TT011,L'AC@TT001                                              
         DCDDL AC#TT012,L'AC@TT001                                              
         DCDDL AC#TT013,L'AC@TT001                                              
         DCDDL AC#TT014,L'AC@TT001                                              
         DCDDL AC#TT015,L'AC@TT001                                              
         DCDDL AC#TT016,L'AC@TT001                                              
         DCDDL AC#TT017,L'AC@TT001                                              
         DCDDL AC#TT018,L'AC@TT001                                              
         DCDDL AC#TT019,L'AC@TT001                                              
         DCDDL AC#TT020,L'AC@TT001                                              
         DCDDL AC#TT021,L'AC@TT001                                              
         DCDDL AC#TT022,L'AC@TT001                                              
         DCDDL AC#TT023,L'AC@TT001                                              
         DCDDL AC#TT024,L'AC@TT001                                              
         DCDDL AC#TT025,L'AC@TT001                                              
         DCDDL AC#TT026,L'AC@TT001                                              
         DCDDL AC#TT027,L'AC@TT001                                              
         DCDDL AC#TT028,L'AC@TT001                                              
         DCDDL AC#TT029,L'AC@TT001                                              
         DCDDL AC#TT030,L'AC@TT001                                              
         DCDDL AC#TT031,L'AC@TT001                                              
         DCDDL AC#TT032,L'AC@TT001                                              
         DCDDL AC#TT033,L'AC@TT001                                              
         DCDDL AC#TT034,L'AC@TT001                                              
         DCDDL AC#TT035,L'AC@TT001                                              
         DCDDL AC#TT036,L'AC@TT001                                              
         DCDDL AC#TT037,L'AC@TT001                                              
         DCDDL AC#TT038,L'AC@TT001                                              
         DCDDL AC#TT039,L'AC@TT001                                              
         DCDDL AC#TT040,L'AC@TT001                                              
         DCDDL AC#TT041,L'AC@TT001                                              
         DCDDL AC#TT042,L'AC@TT001                                              
         DCDDL AC#TT043,L'AC@TT001                                              
         DCDDL AC#TT044,L'AC@TT001                                              
         DCDDL AC#TT045,L'AC@TT001                                              
         DCDDL AC#TT046,L'AC@TT001                                              
         DCDDL AC#TT047,L'AC@TT001                                              
         DCDDL AC#TT048,L'AC@TT001                                              
         DCDDL AC#TT049,L'AC@TT001                                              
         DCDDL AC#TT050,L'AC@TT001                                              
         DCDDL AC#TT051,L'AC@TT001                                              
         DCDDL AC#TT052,L'AC@TT001                                              
         DCDDL AC#TT053,L'AC@TT001                                              
         DCDDL AC#TT054,L'AC@TT001                                              
         DCDDL AC#TT055,L'AC@TT001                                              
         DCDDL AC#TT056,L'AC@TT001                                              
         DCDDL AC#TT057,L'AC@TT001                                              
         DCDDL AC#TT058,L'AC@TT001                                              
         DCDDL AC#TT059,L'AC@TT001                                              
         DCDDL AC#TT060,L'AC@TT001                                              
         DCDDL AC#TT061,L'AC@TT001                                              
         DCDDL AC#TT062,L'AC@TT001                                              
         DCDDL AC#TT063,L'AC@TT001                                              
         DCDDL AC#TT064,L'AC@TT001                                              
         DCDDL AC#TT070,L'AC@TT001                                              
         DCDDL AC#TT071,L'AC@TT001                                              
         DCDDL AC#TT075,L'AC@TT001                                              
         DCDDL AC#TT079,L'AC@TT001                                              
         DCDDL AC#TT097,L'AC@TT001                                              
         DCDDL AC#TT098,L'AC@TT001                                              
         DCDDL AC#TT099,L'AC@TT001                                              
         DC    X'00'                                                            
