*          DATA SET ACRECFDD   AT LEVEL 001 AS OF 09/07/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T608FDD      DATE 09/07/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL15     4    2   15  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL12     4   18   12  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      4   31    6  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      4   38    8  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL10     4   47   10  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL12     4   69   12  L  P H             T        Y              
ROVACCH  DS    CL8                                                              
ROVACC   DS    CL15     5    2   15  A  U N             T        Y              
ROVSRCH  DS    CL8                                                              
ROVSRC   DS    CL12     5   18   12  A  U N             T        Y              
ROVBILH  DS    CL8                                                              
ROVBIL   DS    CL6      5   31    6  A  U N             T        Y              
ROVDATH  DS    CL8                                                              
ROVDAT   DS    CL8      5   38    8  A  U N             T        Y              
ROVOFFH  DS    CL8                                                              
ROVOFF   DS    CL2      5   47    2  A  U N             T        Y              
ROVAMTH  DS    CL8                                                              
ROVAMT   DS    CL12     5   69   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15     6    2   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     6   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      6   31    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      6   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2      6   47    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     6   69   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15     7    2   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     7   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      7   31    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      7   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2      7   47    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     7   69   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15     8    2   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     8   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      8   31    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      8   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2      8   47    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     8   69   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15     9    2   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     9   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   31    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      9   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2      9   47    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     9   69   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    10    2   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    10   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   31    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     10   47    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    10   69   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    11    2   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    11   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   31    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   47    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    11   69   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    12    2   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    12   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   31    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   47    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    12   69   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    13    2   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    13   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   31    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   47    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    13   69   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    14    2   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    14   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   31    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   47    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    14   69   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    15    2   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   31    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   47    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    15   69   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    16    2   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    16   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   31    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   47    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    16   69   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    17    2   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    17   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   31    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   47    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    17   69   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    18    2   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    18   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   31    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   47    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    18   69   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    19    2   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    19   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   31    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   47    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    19   69   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL15    20    2   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    20   18   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   31    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   47    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    20   69   12  A  U N             T        Y              
ROVTOTH  DS    CL8                                                              
ROVTOT   DS    CL78    22    2   78  A  P N             T        Y              
ROVTAMH  DS    CL8                                                              
ROVTAM   DS    CL78    23    2   78  A  P H             T        Y  254         
ROVTAMX  DS    CL8                                                              
ROVPFKH  DS    CL8                                                              
ROVPFK   DS    CL78    24    2   78  A  P N             T        Y  255         
ROVPFKX  DS    CL8                                                              
         DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2040 BYTES                            
