*          DATA SET ACRECF1D   AT LEVEL 002 AS OF 09/07/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T608F1D      DATE 09/07/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL20     4    2   20  L  P H             T        Y              
RECBREFH DS    CL8                                                              
RECBREF  DS    CL4      4   23    4  A  U N             T        Y    5         
RECBREFX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     4   42   18  L  P H             T        Y              
RECBMONH DS    CL8                                                              
RECBMON  DS    CL6      4   61    6  A  U N             T        Y    6         
RECBMONX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20     6    2   20  L  P N             T        Y              
RECBNKH  DS    CL8                                                              
RECBNK   DS    CL56     6   23   56  A  U H             T        Y    7         
RECBNKX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20     7    2   20  L  P N             T        Y              
RECREFH  DS    CL8                                                              
RECREF   DS    CL6      7   23    6  A  U H             T        Y    8         
RECREFX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     7   42   18  L  P N             T        Y              
RECDEPH  DS    CL8                                                              
RECDEP   DS    CL8      7   61    8  A  U H             T        Y    9         
RECDEPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20     8    2   20  L  P N             T        Y              
RECCHQH  DS    CL8                                                              
RECCHQ   DS    CL14     8   23   14  A  U H             T        Y   10         
RECCHQX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18     8   42   18  L  P N             T        Y              
RECCDTH  DS    CL8                                                              
RECCDT   DS    CL8      8   61    8  A  U H             T        Y   11         
RECCDTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20     9    2   20  L  P N             T        Y              
RECANLH  DS    CL8                                                              
RECANL   DS    CL56     9   23   56  A  U H             T        Y   12         
RECANLX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    11    2   20  L  P H             T        Y              
RECRCVH  DS    CL8                                                              
RECRCV   DS    CL57    11   23   57  A  U N             T        Y   13         
RECRCVX  DS    CL8                                                              
RECWACTH DS    CL8                                                              
RECWACT  DS    CL20    12    2   20  L  P N             T        Y              
RECWACH  DS    CL8                                                              
RECWAC   DS    CL56    12   23   56  A  U H             T        Y   14         
RECWACX  DS    CL8                                                              
RECWCPTH DS    CL8                                                              
RECWCPT  DS    CL20    13    2   20  L  P N             T        Y              
RECWCPH  DS    CL8                                                              
RECWCP   DS    CL57    13   23   57  A  U H             T        Y   15         
RECWCPX  DS    CL8                                                              
RECVATTH DS    CL8                                                              
RECVATT  DS    CL20    14    2   20  L  P N             T        Y              
RECVATH  DS    CL8                                                              
RECVAT   DS    CL56    14   23   56  A  U H             T        Y   23         
RECVATX  DS    CL8                                                              
RECWRFTH DS    CL8                                                              
RECWRFT  DS    CL20    15    2   20  L  P N             T        Y              
RECWRFH  DS    CL8                                                              
RECWRF   DS    CL6     15   23    6  A  U H             T        Y   25         
RECWRFX  DS    CL8                                                              
RECWDTTH DS    CL8                                                              
RECWDTT  DS    CL18    15   42   18  L  P N             T        Y              
RECWDTH  DS    CL8                                                              
RECWDT   DS    CL8     15   61    8  A  U H             T        Y   26         
RECWDTX  DS    CL8                                                              
RECWNRTH DS    CL8                                                              
RECWNRT  DS    CL20    16    2   20  L  P N             T        Y              
RECWNRH  DS    CL8                                                              
RECWNR   DS    CL30    16   23   30  A  U H             T        Y   27         
RECWNRX  DS    CL8                                                              
RECODTTH DS    CL8                                                              
RECODTT  DS    CL20    17    2   20  L  P N             T        Y              
RECODTH  DS    CL8                                                              
RECODT   DS    CL8     17   23    8  A  U H             T        Y   31         
RECODTX  DS    CL8                                                              
RECDSCTH DS    CL8                                                              
RECDSCT  DS    CL20    18    2   20  L  P N             T        Y              
RECDSCH  DS    CL8                                                              
RECDSC   DS    CL56    18   23   56  A  U H             T        Y   21         
RECDSCX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    20    2   20  L  P N             T        Y              
RECDATH  DS    CL8                                                              
RECDAT   DS    CL17    20   23   17  A  U H             T        Y   17         
RECDATX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    20   42   18  L  P N             T        Y              
RECMOSH  DS    CL8                                                              
RECMOS   DS    CL11    20   61   11  A  U H             T        Y   18         
RECMOSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    21    2   20  L  P N             T        Y              
RECBNRH  DS    CL8                                                              
RECBNR   DS    CL13    21   23   13  A  U H             T        Y   19         
RECBNRX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL18    21   42   18  L  P N             T        Y              
RECBSOH  DS    CL8                                                              
RECBSO   DS    CL12    21   61   12  A  U H             T        Y   20         
RECBSOX  DS    CL8                                                              
RECTABH  DS    CL8                                                              
RECTAB   DS    CL1     21   78    1  A  U N             T        Y              
RECHTOTH DS    CL8                                                              
RECHTOT  DS    CL78    22    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  A  P H             T        Y              
RECHPFKH DS    CL8                                                              
RECHPFK  DS    CL78    24    2   78  A  P N             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1728 BYTES                            
