*          DATA SET ACRECFBD   AT LEVEL 001 AS OF 09/07/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T608FBD      DATE 09/07/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL78    22    2   78  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     23    2    1  A  P H             T        Y              
RCAMSGH  DS    CL8                                                              
RCAMSG   DS    CL60    23    4   60  A  P N             T        Y              
RCAINPH  DS    CL8                                                              
RCAINP   DS    CL1     23   77    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1     23   79    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P H             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 272  BYTES                            
