*          DATA SET ACREQFED   AT LEVEL 002 AS OF 08/26/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T604FED      DATE 08/26/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL1      6    4    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL73     6    7   73  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1      7    4    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL73     7    7   73  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1      8    4    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL73     8    7   73  A  P H             T        Y              
ENQFRSTH DS    XL8                                                              
ENQFRST  DS    CL2      9    1    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1      9    4    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL73     9    7   73  A  U N             T        N              
         DS    XL8                                                              
         DS    CL2     10    1    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     10    4    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL73    10    7   73  A  U N             T        N              
         DS    XL8                                                              
         DS    CL2     11    1    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     11    4    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL73    11    7   73  A  U N             T        N              
         DS    XL8                                                              
         DS    CL2     12    1    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     12    4    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL73    12    7   73  A  U N             T        N              
         DS    XL8                                                              
         DS    CL2     13    1    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     13    4    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL73    13    7   73  A  U N             T        N              
         DS    XL8                                                              
         DS    CL2     14    1    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     14    4    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL73    14    7   73  A  U N             T        N              
         DS    XL8                                                              
         DS    CL2     15    1    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     15    4    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL73    15    7   73  A  U N             T        N              
         DS    XL8                                                              
         DS    CL2     16    1    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     16    4    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL73    16    7   73  A  U N             T        N              
         DS    XL8                                                              
         DS    CL2     17    1    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     17    4    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL73    17    7   73  A  U N             T        N              
         DS    XL8                                                              
         DS    CL2     18    1    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     18    4    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL73    18    7   73  A  U N             T        N              
         DS    XL8                                                              
         DS    CL2     19    1    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     19    4    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL73    19    7   73  A  U N             T        N              
         DS    XL8                                                              
         DS    CL2     20    1    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     20    4    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL73    20    7   73  A  U N             T        N              
         DS    XL8                                                              
         DS    CL2     21    1    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     21    4    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL73    21    7   73  A  U N             T        N              
         DS    XL8                                                              
         DS    CL2     22    1    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     22    4    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL73    22    7   73  A  U N             T        N              
         DS    XL8                                                              
         DS    CL2     23    1    2  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL1     23    4    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL73    23    7   73  A  U N             T        N              
         DS    XL8                                                              
         DS    CL2     24    1    2  A  P N             T        Y              
ENQENDH  DS    XL8                                                              
ENQEND   DS    CL1     24    4    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    24    7   12  A  P H             T        Y              
ENQLAST  DS    XL1                                                              
         DS    XL2    INDICS=11                                                 
ENQWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1816 BYTES                            
