*          DATA SET ACREQFCD   AT LEVEL 006 AS OF 03/11/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T604FCD      DATE 03/11/88                 
         SPACE 1                                                                
T604FCD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
MNUJOB1H DS    CL8                                                              
MNUJOB1  DS    CL79     6    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79     7    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79     8    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79     9    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    10    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    11    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    12    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    13    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    14    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    15    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    16    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    17    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    18    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    19    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    20    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    21    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    22    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL79    23    2   79  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     24    2    1  A   U    N         T        Y              
MNULAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
MNUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1578 BYTES                            
