*          DATA SET ACREPPROFD AT LEVEL 001 AS OF 06/16/88                      
***********************************************************************         
* DSECT TO COVER PROFILE BLOCK BUILT BY MONACC (ADDRESS=APROFILE)     *         
***********************************************************************         
         SPACE 1                                                                
ACPROFSD DSECT                                                                  
ACPSYSPF DS    0XL32               ** SYSTEM PROFILES **                        
ACPSYSP1 DS    0XL16                                                            
ACPSYS01 DS    XL1                                                              
ACPSYS02 DS    XL1                                                              
ACPSYS03 DS    XL1                                                              
ACPSYS04 DS    XL1                                                              
ACPSYS05 DS    XL1                                                              
ACPSYS06 DS    XL1                                                              
ACPSYS07 DS    XL1                                                              
ACPSYS08 DS    XL1                                                              
ACPSYS09 DS    XL1                                                              
ACPSYS10 DS    XL1                                                              
ACPSYS11 DS    XL1                                                              
ACPSYS12 DS    XL1                                                              
ACPSYS13 DS    XL1                                                              
ACPSYS14 DS    XL1                                                              
ACPSYS15 DS    XL1                                                              
ACPSYS16 DS    XL1                                                              
ACPSYSP2 DS    0XL16                                                            
ACPSYS17 DS    XL1                                                              
ACPSYS18 DS    XL1                                                              
ACPSYS19 DS    XL1                                                              
ACPSYS20 DS    XL1                                                              
ACPSYS21 DS    XL1                                                              
ACPSYS22 DS    XL1                                                              
ACPSYS23 DS    XL1                                                              
ACPSYS24 DS    XL1                                                              
ACPSYS25 DS    XL1                                                              
ACPSYS26 DS    XL1                                                              
ACPSYS27 DS    XL1                                                              
ACPSYS28 DS    XL1                                                              
ACPSYS29 DS    XL1                                                              
ACPSYS30 DS    XL1                                                              
ACPSYY31 DS    XL1                                                              
ACPSYS32 DS    XL1                                                              
         EJECT                                                                  
ACPPFCPY DS    0XL48               ** PROGRAM PROFILES FOR COMPANY **           
ACPPFCP1 DS    0XL16                                                            
ACPPFC01 DS    XL1                                                              
ACPPFC02 DS    XL1                                                              
ACPPFC03 DS    XL1                                                              
ACPPFC04 DS    XL1                                                              
ACPPFC05 DS    XL1                                                              
ACPPFC06 DS    XL1                                                              
ACPPFC07 DS    XL1                                                              
ACPPFC08 DS    XL1                                                              
ACPPFC09 DS    XL1                                                              
ACPPFC10 DS    XL1                                                              
ACPPFC11 DS    XL1                                                              
ACPPFC12 DS    XL1                                                              
ACPPFC13 DS    XL1                                                              
ACPPFC14 DS    XL1                                                              
ACPPFC15 DS    XL1                                                              
ACPPFC16 DS    XL1                                                              
ACPPFCP2 DS    0XL16                                                            
ACPPFC17 DS    XL1                                                              
ACPPFC18 DS    XL1                                                              
ACPPFC19 DS    XL1                                                              
ACPPFC20 DS    XL1                                                              
ACPPFC21 DS    XL1                                                              
ACPPFC22 DS    XL1                                                              
ACPPFC23 DS    XL1                                                              
ACPPFC24 DS    XL1                                                              
ACPPFC25 DS    XL1                                                              
ACPPFC26 DS    XL1                                                              
ACPPFC27 DS    XL1                                                              
ACPPFC28 DS    XL1                                                              
ACPPFC29 DS    XL1                                                              
ACPPFC30 DS    XL1                                                              
ACPPFC31 DS    XL1                                                              
ACPPFC32 DS    XL1                                                              
ACPPFCP3 DS    0XL16                                                            
ACPPFC33 DS    XL1                                                              
ACPPFC34 DS    XL1                                                              
ACPPFC35 DS    XL1                                                              
ACPPFC36 DS    XL1                                                              
ACPPFC37 DS    XL1                                                              
ACPPFC38 DS    XL1                                                              
ACPPFC39 DS    XL1                                                              
ACPPFC40 DS    XL1                                                              
ACPPFC41 DS    XL1                                                              
ACPPFC42 DS    XL1                                                              
ACPPFC43 DS    XL1                                                              
ACPPFC44 DS    XL1                                                              
ACPPFC45 DS    XL1                                                              
ACPPFC46 DS    XL1                                                              
ACPPFC47 DS    XL1                                                              
ACPPFC48 DS    XL1                                                              
         EJECT                                                                  
ACPPFLDG DS    0XL48               ** PROGRAM PROFILES FOR LEDGER **            
ACPPFLD1 DS    0XL16                                                            
ACPPFL01 DS    XL1                                                              
ACPPFL02 DS    XL1                                                              
ACPPFL03 DS    XL1                                                              
ACPPFL04 DS    XL1                                                              
ACPPFL05 DS    XL1                                                              
ACPPFL06 DS    XL1                                                              
ACPPFL07 DS    XL1                                                              
ACPPFL08 DS    XL1                                                              
ACPPFL09 DS    XL1                                                              
ACPPFL10 DS    XL1                                                              
ACPPFL11 DS    XL1                                                              
ACPPFL12 DS    XL1                                                              
ACPPFL13 DS    XL1                                                              
ACPPFL14 DS    XL1                                                              
ACPPFL15 DS    XL1                                                              
ACPPFL16 DS    XL1                                                              
ACPPFLD2 DS    0XL16                                                            
ACPPFL17 DS    XL1                                                              
ACPPFL18 DS    XL1                                                              
ACPPFL19 DS    XL1                                                              
ACPPFL20 DS    XL1                                                              
ACPPFL21 DS    XL1                                                              
ACPPFL22 DS    XL1                                                              
ACPPFL23 DS    XL1                                                              
ACPPFL24 DS    XL1                                                              
ACPPFL25 DS    XL1                                                              
ACPPFL26 DS    XL1                                                              
ACPPFL27 DS    XL1                                                              
ACPPFL28 DS    XL1                                                              
ACPPFL29 DS    XL1                                                              
ACPPFL30 DS    XL1                                                              
ACPPFL31 DS    XL1                                                              
ACPPFL32 DS    XL1                                                              
ACPPFLD3 DS    0XL16                                                            
ACPPFL33 DS    XL1                                                              
ACPPFL34 DS    XL1                                                              
ACPPFL35 DS    XL1                                                              
ACPPFL36 DS    XL1                                                              
ACPPFL37 DS    XL1                                                              
ACPPFL38 DS    XL1                                                              
ACPPFL39 DS    XL1                                                              
ACPPFL40 DS    XL1                                                              
ACPPFL41 DS    XL1                                                              
ACPPFL42 DS    XL1                                                              
ACPPFL43 DS    XL1                                                              
ACPPFL44 DS    XL1                                                              
ACPPFL45 DS    XL1                                                              
ACPPFL46 DS    XL1                                                              
ACPPFL47 DS    XL1                                                              
ACPPFL48 DS    XL1                                                              
         EJECT                                                                  
ACPPFOFF DS    0XL48               ** PROGRAM PROFILES FOR OFFICE **            
ACPPFOF1 DS    0XL16                                                            
ACPPFO01 DS    XL1                                                              
ACPPFO02 DS    XL1                                                              
ACPPFO03 DS    XL1                                                              
ACPPFO04 DS    XL1                                                              
ACPPFO05 DS    XL1                                                              
ACPPFO06 DS    XL1                                                              
ACPPFO07 DS    XL1                                                              
ACPPFO08 DS    XL1                                                              
ACPPFO09 DS    XL1                                                              
ACPPFO10 DS    XL1                                                              
ACPPFO11 DS    XL1                                                              
ACPPFO12 DS    XL1                                                              
ACPPFO13 DS    XL1                                                              
ACPPFO14 DS    XL1                                                              
ACPPFO15 DS    XL1                                                              
ACPPFO16 DS    XL1                                                              
ACPPFOF2 DS    0XL16                                                            
ACPPFO17 DS    XL1                                                              
ACPPFO18 DS    XL1                                                              
ACPPFO19 DS    XL1                                                              
ACPPFO20 DS    XL1                                                              
ACPPFO21 DS    XL1                                                              
ACPPFO22 DS    XL1                                                              
ACPPFO23 DS    XL1                                                              
ACPPFO24 DS    XL1                                                              
ACPPFO25 DS    XL1                                                              
ACPPFO26 DS    XL1                                                              
ACPPFO27 DS    XL1                                                              
ACPPFO28 DS    XL1                                                              
ACPPFO29 DS    XL1                                                              
ACPPFO30 DS    XL1                                                              
ACPPFO31 DS    XL1                                                              
ACPPFO32 DS    XL1                                                              
ACPPFOF3 DS    0XL16                                                            
ACPPFO33 DS    XL1                                                              
ACPPFO34 DS    XL1                                                              
ACPPFO35 DS    XL1                                                              
ACPPFO36 DS    XL1                                                              
ACPPFO37 DS    XL1                                                              
ACPPFO38 DS    XL1                                                              
ACPPFO39 DS    XL1                                                              
ACPPFO40 DS    XL1                                                              
ACPPFO41 DS    XL1                                                              
ACPPFO42 DS    XL1                                                              
ACPPFO43 DS    XL1                                                              
ACPPFO44 DS    XL1                                                              
ACPPFO45 DS    XL1                                                              
ACPPFO46 DS    XL1                                                              
ACPPFO47 DS    XL1                                                              
ACPPFO48 DS    XL1                                                              
         EJECT                                                                  
ACPPFACC DS    0XL48               ** PROGRAM PROFILES FOR ACCOUNT **           
ACPPFAC1 DS    0XL16                                                            
ACPPFA01 DS    XL1                                                              
ACPPFA02 DS    XL1                                                              
ACPPFA03 DS    XL1                                                              
ACPPFA04 DS    XL1                                                              
ACPPFA05 DS    XL1                                                              
ACPPFA06 DS    XL1                                                              
ACPPFA07 DS    XL1                                                              
ACPPFA08 DS    XL1                                                              
ACPPFA09 DS    XL1                                                              
ACPPFA10 DS    XL1                                                              
ACPPFA11 DS    XL1                                                              
ACPPFA12 DS    XL1                                                              
ACPPFA13 DS    XL1                                                              
ACPPFA14 DS    XL1                                                              
ACPPFA15 DS    XL1                                                              
ACPPFA16 DS    XL1                                                              
ACPPFAC2 DS    0XL16                                                            
ACPPFA17 DS    XL1                                                              
ACPPFA18 DS    XL1                                                              
ACPPFA19 DS    XL1                                                              
ACPPFA20 DS    XL1                                                              
ACPPFA21 DS    XL1                                                              
ACPPFA22 DS    XL1                                                              
ACPPFA23 DS    XL1                                                              
ACPPFA24 DS    XL1                                                              
ACPPFA25 DS    XL1                                                              
ACPPFA26 DS    XL1                                                              
ACPPFA27 DS    XL1                                                              
ACPPFA28 DS    XL1                                                              
ACPPFA29 DS    XL1                                                              
ACPPFA30 DS    XL1                                                              
ACPPFA31 DS    XL1                                                              
ACPPFA32 DS    XL1                                                              
ACPPFAC3 DS    0XL16                                                            
ACPPFA33 DS    XL1                                                              
ACPPFA34 DS    XL1                                                              
ACPPFA35 DS    XL1                                                              
ACPPFA36 DS    XL1                                                              
ACPPFA37 DS    XL1                                                              
ACPPFA38 DS    XL1                                                              
ACPPFA39 DS    XL1                                                              
ACPPFA40 DS    XL1                                                              
ACPPFA41 DS    XL1                                                              
ACPPFA42 DS    XL1                                                              
ACPPFA43 DS    XL1                                                              
ACPPFA44 DS    XL1                                                              
ACPPFA45 DS    XL1                                                              
ACPPFA46 DS    XL1                                                              
ACPPFA47 DS    XL1                                                              
ACPPFA48 DS    XL1                                                              
