*          DATA SET ACRECWRK   AT LEVEL 179 AS OF 07/08/19                      
* ACDDEQUS                                                                      
         PRINT OFF                                                              
       ++INCLUDE ACDDEQUS                                                       
         PRINT ON                                                               
         SPACE 1                                                                
* ACMSGEQUS                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACMSGEQUS                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* ACGENBOTH                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACGENBOTH                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* ACGENFILE                                                                     
         PRINT OFF                                                              
       ++INCLUDE ACGENFILE                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* ACADDTRND                                                                     
         PRINT OFF                                                              
TRNBLKD  DSECT                                                                  
       ++INCLUDE ACADDTRND                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* DDCOMFACS                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDCOMFACS                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* DDFLDHDR                                                                      
         PRINT OFF                                                              
       ++INCLUDE DDFLDHDR                                                       
         PRINT ON                                                               
         SPACE 1                                                                
* DDPERVALD                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDPERVALD                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* DDTSARD                                                                       
         PRINT OFF                                                              
       ++INCLUDE DDTSARD                                                        
         PRINT ON                                                               
         SPACE 1                                                                
* FAGETTXTD                                                                     
         PRINT OFF                                                              
       ++INCLUDE FAGETTXTD                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* FASECRETD                                                                     
         PRINT OFF                                                              
       ++INCLUDE FASECRETD                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* FATIOB                                                                        
         PRINT OFF                                                              
       ++INCLUDE FATIOB                                                         
         PRINT ON                                                               
         SPACE 1                                                                
* FAUTL                                                                         
         PRINT OFF                                                              
       ++INCLUDE FAUTL                                                          
         PRINT ON                                                               
         SPACE 1                                                                
* GEGENEXC                                                                      
         PRINT OFF                                                              
       ++INCLUDE GEGENEXC                                                       
         PRINT ON                                                               
         SPACE 1                                                                
* DMDTFPH                                                                       
         PRINT OFF                                                              
       ++INCLUDE DMDTFPH                                                        
         PRINT ON                                                               
         SPACE 1                                                                
* DDCTRYEQUS/DDLANGEQUS                                                         
         PRINT OFF                                                              
       ++INCLUDE DDCTRYEQUS                                                     
       ++INCLUDE DDLANGEQUS                                                     
         PRINT ON                                                               
         SPACE 1                                                                
* DDCURTABD                                                                     
         PRINT OFF                                                              
       ++INCLUDE DDCURTABD                                                      
         PRINT ON                                                               
         SPACE 1                                                                
* ACOFFALD                                                                      
         PRINT OFF                                                              
       ++INCLUDE ACOFFALD                                                       
         PRINT ON                                                               
         SPACE 1                                                                
* DDCONBLK                                                                      
         PRINT OFF                                                              
CONBLKD  DSECT                                                                  
       ++INCLUDE DDCONBLK                                                       
         PRINT ON                                                               
         SPACE 1                                                                
* FAREPBLK                                                                      
         PRINT OFF                                                              
REPD     DSECT                                                                  
       ++INCLUDE FAREPBLK                                                       
         EJECT                                                                  
REPHS    DS    0CL132              ** REPORT HEAD LINES **                      
REPH1    DS    CL132                                                            
REPH2    DS    CL132                                                            
REPH3    DS    CL132                                                            
REPH4    DS    CL132                                                            
REPH5    DS    CL132                                                            
REPH6    DS    CL132                                                            
REPH7    DS    CL132                                                            
REPH8    DS    CL132                                                            
REPH9    DS    CL132                                                            
REPHA    DS    CL132                                                            
REPHB    DS    CL132                                                            
REPHC    DS    CL132                                                            
REPHN    EQU   (*-REPHS)/L'REPHS                                                
*                                                                               
REPMS    DS    0CL132              ** REPORT MID LINES **                       
REPMN    EQU   (*-REPMS)/L'REPMS                                                
*                                                                               
REPPS    DS    0CL132              ** REPORT PRINT LINES **                     
REPP1    DS    CL132                                                            
REPP2    DS    CL132                                                            
REPP3    DS    CL132                                                            
REPP4    DS    CL132                                                            
REPP5    DS    CL132                                                            
REPP6    DS    CL132                                                            
REPP7    DS    CL132                                                            
REPP8    DS    CL132                                                            
REPP9    DS    CL132                                                            
REPPA    DS    CL132                                                            
REPPB    DS    CL132                                                            
REPPC    DS    CL132                                                            
REPPD    DS    CL132                                                            
REPPE    DS    CL132                                                            
REPPF    DS    CL132                                                            
REPPG    DS    CL132                                                            
REPPH    DS    CL132                                                            
REPPI    DS    CL132                                                            
REPPJ    DS    CL132                                                            
REPPK    DS    CL132                                                            
REPPN    EQU   (*-REPPS)/L'REPPS                                                
*                                                                               
REPFS    DS    0XL132              ** REPORT FOOT LINES **                      
REPF1    DS    CL132                                                            
REPF2    DS    CL132                                                            
REPFN    EQU   (*-REPFS)/L'REPFS                                                
*                                                                               
REPX     EQU   *                                                                
REPL     EQU   *-REPD                                                           
         PRINT ON                                                               
         EJECT                                                                  
* MISCELLANEOUS EQUATES                                                         
*                                                                               
LINES    EQU   15                  NUMBER OF TWA LINES - INPUT SCREEN           
LINES2   EQU   16                  NUMBER OF TWA LINES - SPECIAL SCREEN         
INCLUDE  EQU   X'01'               OPTION IS INCLUDE                            
EXCLUDE  EQU   X'80'               OPTION IS EXCLUDE                            
EOT      EQU   0                   END OF TABLE                                 
FF       EQU   X'FF'                                                            
FFFF     EQU   X'FFFF'                                                          
BT55     EQU   55                                                               
BT56     EQU   56                                                               
RECNDSP  EQU   18                  DISP OF NAME INTO CODE/NAME FIELD            
*                                                                               
* KEY BUILD ROUTINE EQUATES                                                     
*                                                                               
SETACC   EQU   X'80'                                                            
SETCON   EQU   X'40'                                                            
SETSDT   EQU   X'20'                                                            
SETBNR   EQU   X'10'                                                            
SETALL   EQU   SETACC+SETCON+SETSDT+SETBNR                                      
SETNXT   EQU   X'04'                                                            
*                                                                               
* COMBINED DATE ASSUMPTION EQUATES                                              
*                                                                               
STARTASS EQU   PVALASD+PVALASM+PVALASY                                          
ENDASS   EQU   PVALAED+PVALAEM+PVALAEY                                          
*                                                                               
* PFKEY EQUATES                                                                 
*                                                                               
PFK01    EQU   1                                                                
PFK02    EQU   2                                                                
PFK03    EQU   3                                                                
PFK04    EQU   4                                                                
PFK05    EQU   5                                                                
PFK06    EQU   6                                                                
PFK07    EQU   7                                                                
PFK08    EQU   8                                                                
PFK09    EQU   9                                                                
PFK10    EQU   10                                                               
PFK11    EQU   11                                                               
PFK12    EQU   12                                                               
PFK13    EQU   13                                                               
PFK14    EQU   14                                                               
PFK15    EQU   15                                                               
PFK16    EQU   16                                                               
PFK17    EQU   17                                                               
PFK18    EQU   18                                                               
PFK19    EQU   19                                                               
PFK20    EQU   20                                                               
PFK21    EQU   21                                                               
PFK22    EQU   22                                                               
PFK23    EQU   23                                                               
PFK24    EQU   24                                                               
         EJECT                                                                  
* INFORMATION AND ERROR MESSAGE EQUATES                                         
*                                                                               
IGREPSPL EQU   027+X'FF00'         REPORT &T HAS BEEN SPOOLED                   
IGOK     EQU   255+X'FF00'         FIELD IS VALID                               
*                                                                               
EGINVCLI EQU   121+X'FF00'         INVALID CLIENT CODE                          
EGIFMISS EQU   200+X'FF00'         NO DATA INPUT                                
EGIFSHRT EQU   201+X'FF00'         NOT ENOUGH DATA INPUT                        
EGIFLONG EQU   202+X'FF00'         TOO MUCH DATA INPUT                          
EGIFNOTV EQU   203+X'FF00'         INVALID INPUT FIELD                          
EGOPTDUP EQU   208+X'FF00'         DUPLICATED OPTION KEYWORD                    
EGINVASQ EQU   212+X'FF00'         INVALID ACTION SEQUENCE                      
EGRECNOF EQU   213+X'FF00'         RECORD NOT ON FILE                           
EGRECAOF EQU   214+X'FF00'         RECORD ALREADY ON FILE                       
EGDATINV EQU   233+X'FF00'         INVALID DATE                                 
*                                                                               
IAENTBAT EQU   1000                ENTER BATCH DETAILS                          
IABATUPD EQU   1001                BATCH UPDATED                                
IABATREP EQU   1002                BATCH UPDATED - REPORT &T SPOOLED            
IAENTPAG EQU   1003                ENTER AMOUNTS - HIT ENTER TO PAGE            
IANOMORE EQU   1004                ENTER AMOUNTS - NO MORE TRANSACTIONS         
IACHABAT EQU   1005                HEADER RESTORED - NOW ENTER CHANGES          
IAENTDIF EQU   1006                ENTER DIFFERENCES OR HIT ENTER               
IAENTCHA EQU   1007                ENTER CHANGES OR NO DATA TO EXIT             
IACHACHA EQU   1008                RECORD CHANGED - ENTER CHANGES ETC.          
IASRCDIS EQU   1120                SOURCES DISPLAYED - ENTER TO RETURN          
*                                                                               
SAENTCMA EQU   1000                ENTER CONFIRMATION                           
*                                                                               
EADUPFLD EQU   0035                DUPLICATED INPUT FIELD                       
EALDGINV EQU   1000                INVALID LEDGER                               
EAACCINV EQU   1001                INVALID ACCOUNT                              
EAACCNOP EQU   1002                INVALID ACCOUNT FOR POSTING                  
EAAMTINV EQU   1003                INVALID AMOUNT                               
EABATDIF EQU   1004                BATCH TOTALS DIFFER                          
EASECLOC EQU   1005                SECURITY LOCKOUT                             
EASCRINV EQU   1006                INVALID SCROLL AMOUNT                        
EAACCMAX EQU   1007                TOO MANY ACCOUNTS                            
EATRNMAX EQU   1008                TOO MANY TRANSACTIONS                        
EARNGINV EQU   1009                BILL RANGE INVALID (START GR END)            
EAWOFMIN EQU   1010                TOO FEW WRITE-OFF ACCOUNTS                   
EAOFFDIF EQU   1011                OFFICE DOESN'T MATCH RECEIVABLE A/C          
EAACCDUP EQU   1012                DUPLICATED ACCOUNT CODE                      
EAWOFMIS EQU   1013                WRITE-OFF ACCOUNT NOT SPECIFIED              
EAWOFINV EQU   1014                WRITE-OFF INVALID FOR DIFFERENCES            
EAWCPREQ EQU   1015                WRITE-OFF CLIENT/PRODUCT REQUIRED            
EADSCSUR EQU   1016                BOTH DISCOUNT & SURCHARGE INPUT              
EAACCMLT EQU   1017                NOT ALLOWED FOR MULTIPLE RECEIVABLES         
EAOFSINV EQU   1018                CANNOT OFFSET ON OVERPAYMENT                 
EAOFSTNZ EQU   1019                OFFSET TOTAL NON-ZERO                        
EAOFFMIX EQU   1020                MIXED RECEIVABLE ACCOUNT OFFICES             
EAPTRMIS EQU   1021                INTERCOMPANY POINTER MISSING                 
EAINTINV EQU   1022                INTERCOMPANY NOT REQUIRED OR INVALID         
EAOFSGRS EQU   1023                MUST OFFSET GROSS AMOUNT IF DISCOUNT         
EANOTALC EQU   1024                NOT ALLOCATED - CANNOT UNALLOCATE            
EATWOANL EQU   1025                CAN'T HAVE 2 ANALYSED SE ACCOUNTS            
EANOTSDR EQU   1026                NOT A SINGLE DEBIT - CAN'T TRANSFER          
EASELFTR EQU   1027                CANNOT TRANSFER TO SAME SR A/C               
EAINTACC EQU   1028                CANNOT USE INTERAGENCY ACCOUNT               
EADTGTDY EQU   1029                INPUT DATE GREATER THAN TODAY                
EADTUNSP EQU   1030                NEED MORE SPECIFIC DATE (EG MONTH)           
EADTPAST EQU   1031                DATE TOO FAR IN THE PAST                     
EABATLOK EQU   1032                BATCH MONTH LOCKED                           
EAINVSRC EQU   1036                INVALID BILLING SOURCE                       
EAINVALC EQU   1037                CAN'T ALLOCATE BECAUSE NO BANK INFO          
EANALTRF EQU   1038                CAN'T ALLOCATE TRANSFER ITEMS                
EACRASPE EQU   1039                CAN'T REPLICATE A SPECIAL ITEM               
EACRAALC EQU   1040                CAN'T REPLICATE AN ALLOCATED ITEM            
EACTRALC EQU   1041                CAN'T TRANSFER AN ALLOCATED ITEM             
EAOFSMLT EQU   1042                CAN'T OFFSET - MULTIPLE RECEVIABLES          
EANLDACC EQU   1043                NO DISCOUNT A/C - CAN'T TAKE LATE            
EANLDISC EQU   1044                NO DISCOUNT AMOUNT - CAN'T TAKE LATE         
EALATDED EQU   1045                DISCOUNT CAN'T BE DEDUCTED AND LATE          
EADTFUTR EQU   1046                DATE TOO FAR IN THE FUTURE                   
EANOITEM EQU   1047                NO ITEMS TO PROCESS                          
EANOWOFF EQU   1048                NO WRITE-OFF ACCOUNT                         
EAPSTMIS EQU   2067                PST ACCOUNT NOT SPECIFED ON HEADER           
         EJECT                                                                  
WORKD    DSECT                     ** GLOBAL WORKING STORAGE **                 
DUB      DS    D                                                                
DUB2     DS    D                                                                
DUB3     DS    D                                                                
PKWK16   DS    PL16                                                             
FULL     DS    F                                                                
DMCB     DS    6F                                                               
HALF     DS    H                                                                
FLAG     DS    XL1                                                              
BYTE     DS    XL1                                                              
PARM     DS    6F                                                               
RELO     DS    F                                                                
*                                                                               
AINP     DS    A                                                                
ATWA     DS    A                                                                
ATIA     DS    A                                                                
ACOM     DS    A                                                                
AUTL     DS    A                                                                
ARCVTAB  DS    A                                                                
         DS    4A                                                               
OVERLAY  DS    A                   A(OVERLAY PHASE)                             
OVERSPEC DS    A                   A(OVERLAY SPEC PHASE)                        
OVERHOOK DS    A                   A(OVERLAY PRINTING HOOK)                     
OVERXTRA DS    A                   A(OVERLAY EXTRA TRANSACTION ELS)             
         DS    4A                  N/D                                          
*                                                                               
ATABLES  DS    0A                  ** ROOT TABLE ADDRESSES **                   
ACTRYTAB DS    A                   A(COUNTRY TABLE)                             
AKEYTAB  DS    A                   A(KEY BUILD TABLE)                           
ADISTAB  DS    A                   A(DISPLAY BUILD TABLE)                       
ATOTTAB  DS    A                   A(TOTALS DISPLAY CONTROL TABLE)              
ADCLISTU DS    A                   A(UPPER CASE DICTIONARY)                     
ADCLISTL DS    A                   A(LOWER CASE DICTIONARY)                     
AAPFTAB  DS    A                   A(ACTION PFKEY TABLE)                        
AACTTAB  DS    A                   A(ACTION TABLE)                              
ASPFTAB  DS    A                   A(SCROLL PFKEY TABLE)                        
ASCRTAB  DS    A                   A(SCROLL TABLE)                              
ALOCTAB  DS    A                   A(SCROLL LOCATE TABLE)                       
AOPTTAB  DS    A                   A(OPTIONS TABLE)                             
ARECVTAB DS    A                   A(RECEIVABLE ACCTS TABLE)                    
         DS    3A                  N/D                                          
AOFFBLK  DS    A                   A(OFFAL BLOCK)                               
APQBUFF  DS    A                   A(PRINT QUEUE BUFFER)                        
AOVERWRK DS    A                   A(OVERLAY WORKING STORAGE)                   
AREPWRK  DS    A                   A(REPORT WORKING STORAGE)                    
ATSARBLK DS    A                   A(TSAR BLOCK)                                
AIO1     DS    A                   A(IO1)                                       
AIO2     DS    A                   A(IO2)                                       
AIO3     DS    A                   A(IO3)                                       
AIO4     DS    A                   A(IO4)                                       
AIO5     DS    A                   A(IO5)                                       
AIO6     DS    A                   A(IO6)                                       
ASCANOUT DS    A                   A(SCANNER OUTPUT BLOCK)                      
         DS    6A                                                               
*                                                                               
ROUT1    DS    0A                  ** ROOT ROUTINE ADDRESSES - 1 **             
AVALAMT  DS    A                   VALIDATE AN AMOUNT                           
AOVRSCR  DS    A                   OVERLAY A SCREEN                             
AVALBAT  DS    A                   VALIDATE BATCH REFERENCE                     
AVALMON  DS    A                   VALIDATE BATCH MONTH                         
AVALRCV  DS    A                   VALIDATE RECEIVABLES ACCOUNT                 
AVALWCP  DS    A                   VALIDATE WRITE-OFF CLIENT/PRODUCTS           
AVALBNK  DS    A                   VALIDATE BANK ACCOUNT                        
AVALANL  DS    A                   VALIDATE ANALYSIS BANK ACCOUNT               
AVALDEP  DS    A                   VALIDATE DEPOSIT DATE                        
AVALCDT  DS    A                   VALIDATE CHEQUE DATE                         
AVALICO  DS    A                   VALIDATE INTERCOMPANY ACCOUNT                
AVALWAC  DS    A                   VALIDATE WRITE-OFF ACCOUNT                   
AVALDAT  DS    A                   VALIDATE PERIOD RANGE                        
AVALMOS  DS    A                   VALIDATE M-O-S RANGE                         
AVALBNR  DS    A                   VALIDATE BILL NUMBER RANGE                   
AVALBSO  DS    A                   VALIDATE BILLING SOURCE FILTER               
AVALDSC  DS    A                   VALIDATE DISCOUNT ACCOUNT                    
*&&UK                                                                           
AVALVAT  DS    A                   VALIDATE VAT ACCOUNT                         
*&&                                                                             
*&&US                                                                           
AVALGST  DS    A                   VALIDATE GST ACCOUNT                         
AVALPST  DS    A                   VALIDATE PST ACCOUNT                         
*&&                                                                             
AIOHIGH  DS    A                   READ HIGH                                    
AIOSEQ   DS    A                   READ SEQUENTIAL                              
AIOREAD  DS    A                   READ SPECIFIC                                
AIORDNSI DS    A                   READ WITH NON-STANDARD IOAREA                
ATSARADD DS    A                   ADD A RECORD TO TSAR                         
ATSARGET DS    A                   GET A RECORD FROM TSAR                       
AACCELS  DS    A                   EXTRACT VALUES FROM A RECORD                 
AFVAL    DS    A                   VALIDATE AND EXTRACT AN INPUT FIELD          
AGETLDG  DS    A                   GET AND VALIDATE A LEDGER                    
ABLDDIS  DS    A                   BUILD DISPLAY CONTROLS                       
ABLDTRN  DS    A                   BUILD & ADD A TRANSACTION                    
ABLDNAR  DS    A                   BUILD TRANSACTION NARRATIVE                  
AGETACC  DS    A                   GET ACCOUNT, TEST SECURITY ETC.              
ABLDSTA  DS    A                   BUILD STATUS DISPLAY                         
AGETRCV  DS    A                   GETACC FOR RECEIVABLE ACCOUNTS               
AMRKTRN  DS    A                   READ AND MARK FILE TRANSACTIONS              
AREADTR  DS    A                   READ & FILTER FILE TRANSACTIONS              
ROUT1N   EQU   (*-ROUT1)/L'ROUT1                                                
*                                                                               
ROUT2    DS    0A                  ** ROOT ROUTINE ADDRESSES - 2 **             
ACONFRM  DS    A                   CONFIRM AN ACTION                            
AUPDTRN  DS    A                   UPDATE TRANSACTIONS/PRINT REPORT             
AFILTER  DS    A                   FILTER A TSAR RECORD                         
AVALBSC  DS    A                   MAINTAIN BILLING SOURCE RECORD               
APROMEM  DS    A                   PROCESS MEMO SCREEN                          
AXMTSCR  DS    A                   TRANSMIT ENTIRE SCREEN                       
ABLDTOT  DS    A                   BUILD TOTALS LINES                           
ABLDPFK  DS    A                   BUILD PF KEY LINE                            
ABLDLIN  DS    A                   BUILD DISPLAY LINE                           
ATSTSEC  DS    A                   CALL SECRET TO TEST LINE ACTION              
AHDRSEC  DS    A                   CALL SECRET TO SECURE HEADER SCREEN          
         DS    14A                                                              
ROUT2N   EQU   (*-ROUT2)/L'ROUT2                                                
*                                                                               
AACTNTRY DS    A                   A(ACTION TABLE ENTRY)                        
*                                                                               
VCALLOV  DS    V                                                                
VCASHVAL DS    V                                                                
VCUREDIT DS    V                                                                
CUREDIT  EQU   VCUREDIT            FOR USE IN CURED MACRO                       
VDATAMGR DS    V                                                                
VDATCON  DS    V                                                                
VDATVAL  DS    V                                                                
VDICTATE DS    V                                                                
VGETPROF DS    V                                                                
VGETTXT  DS    V                                                                
VHELLO   DS    V                                                                
VHEXIN   DS    V                                                                
VPERVAL  DS    V                                                                
VREPORT  DS    V                                                                
VSCANNER DS    V                                                                
VSWITCH  DS    V                                                                
VUNSCAN  DS    V                                                                
VADDAY   DS    V                                                                
VCONVERT DS    V                                                                
VBLDCUR  DS    V                                                                
VGETCUR  DS    V                                                                
VSECRET  DS    V                                                                
VXTRAINF DS    V                                                                
VPROTON  DS    V                                                                
VPROTOFF DS    V                                                                
         DS    1A                  N/D                                          
VADDTRN  DS    V                   ADDTRN IS CORERES                            
VTSAR    DS    V                   TSAR IS CORERES                              
VOFFAL   DS    V                   OFFAL IS CORERES                             
         DS    2V                                                               
VCONVMOS DS    V                   RELOCATED V(CONVMOS)                         
VACSRCHC DS    V                   RELOCATED V(ACSRCHC)                         
VBMONVAL DS    V                   RELOCATED V(BMONVAL)                         
         DS    A                   N/D                                          
*                                                                               
LITVALS  DS    0X                  ** LITERAL VALUES **                         
PZERO    DS    PL1                 P'0'                                         
ACCFIL   DS    CL8                 C'ACCFIL  '                                  
ACCDIR   DS    CL8                 C'ACCDIR  '                                  
ACCMST   DS    CL8                 C'ACCMST  '                                  
ACCARC   DS    CL8                 C'ACCARC  '                                  
TEMPSTR  DS    CL8                 C'TEMPSTR '                                  
DMADD    DS    CL8                 C'DMADD   '                                  
DMRDHI   DS    CL8                 C'DMRDHI  '                                  
DMREAD   DS    CL8                 C'DMREAD  '                                  
DMRSEQ   DS    CL8                 C'DMRSEQ  '                                  
DMWRT    DS    CL8                 C'DMWRT   '                                  
*                                                                               
PALAREA  DS    XL20                P&L BUCKET AREA                              
         DS    XL12                N/D                                          
*                                                                               
DELIM    DS    CL1                 C','                                         
*                                                                               
PROFDFT  DS    0X                  ** DEFAULT COUNTRY PROFILE **                
PROFDFS1 DS    XL(L'PROFSEQ)       SINGLE ACCOUNT KEY SEQUENCE                  
PROFDFD1 DS    XL(L'PROFDIS)       SINGLE ACCOUNT DISPLAY VALUES                
PROFDFS2 DS    XL(L'PROFSEQ)       MULTI ACCOUNT KEY SEQUENCE                   
PROFDFD2 DS    XL(L'PROFDIS)       MULTI ACCOUNT DISPLAY VALUES                 
PROFDFTC DS    XL(L'PROFTOT)       TOTALS DISPLAY CONTROL                       
PROFDFTL EQU   *-PROFDFT                                                        
*                                                                               
WORK     DS    XL64                                                             
TEMP     DS    XL256                                                            
SPACES   DS    CL256                                                            
*                                                                               
LARE     DS    H                   FOR EXECUTED LOAD ADDRESS                    
LAREADDR DS    S                                                                
LARF     DS    H                   FOR EXECUTED LOAD ADDRESS                    
LARFADDR DS    S                                                                
*                                                                               
UPDVALS  DS    0F                  ** UPDATE VALUES (ACTUPDT ACTION) **         
UPDBLOCK DS    XL(TRNBLKL)         ADDTRN BLOCK                                 
UPDRECN  DS    H                   CURRENT RECORD NUMBER                        
UPDMODE  DS    XL1                 UPDATE MODE                                  
UPDMFRST EQU   0                   FIRST FOR REPORT                             
UPDMRCVF EQU   1                   FIRST FOR RECEIVABLE ACCOUNT                 
UPDMPROC EQU   2                   PROCESS A TSAR RECORD                        
UPDMRCVL EQU   3                   LAST FOR RECEIVABLE ACCOUNT                  
UPDMLAST EQU   4                   LAST FOR REPORT                              
UPDINDS  DS    XL1                 UPDATE INDICATORS                            
UPDIRECA EQU   X'80'               CURRENT RECEIVABLE ACCOUNT ACTIVE            
UPDIANYA EQU   X'40'               ANY RECEIVABLE ACCOUNT ACTIVE                
UPDITRUP EQU   X'20'               TRANSACTION TO BE UPDATED                    
UPDIPRTS EQU   X'01'               PRINT RECORD STATUS ON JOURNAL LINE          
UPDVALSL EQU   *-UPDVALS                                                        
UPDACTN  DS    XL1                 INPUT ACTION NUMBER                          
         DS    XL16                N/D                                          
*                                                                               
FVADDR   DS    A                   A(INPUT FIELD HEADER) SET BY FVAL            
FVFLAG   DS    XL1                 FLAG BYTE USED BY FVAL ROUTINE               
FVHELP   DS    XL1                 HELP INDEX (ZERO=NO HELP AVAILABLE)          
FVMINL   DS    XL1                 MINIMUM INPUT LENGTH (ZERO=OPTIONAL)         
FVMAXL   DS    XL1                 MAXIMUM INPUT LENGTH (ZERO=MAXIMUM)          
FVNUMER  DS    XL1                 TREAT AS NUMERIC IF FOUND AS NUMERIC         
FVOSYS   DS    XL1                 OVERRIDE SYSTEM FOR GETTXT CALLS             
FVOMTYP  DS    XL1                 OVERRIDE MESSAGE TYPE FOR GETTXT             
FVMSGNO  DS    XL2                 MESSAGE NUMBER                               
         ORG   *-1                                                              
FVFERN   DS    XL1                                                              
FVINDX   DS    XL1                 MULTIPLE FIELD INDEX NUMBER                  
FVSUBX   DS    XL1                 MULTIPLE FIELD SUB-INDEX NUMBER              
FVCURS   DS    XL1                 DISPLACEMENT TO CURSOR WITHIN FIELD          
FVXTRA   DS    CL40                TACKED ON TO ERROR MESSAGE IF ROOM           
FVIHDR   DS    0XL8                ** EXTRACTED INPUT FIELD HEADER **           
FVTLEN   DS    XL1                 L'FIELD HEADER+L'FIELD                       
FVATRB   DS    XL1                 FIELD ATTRIBUTE                              
FVAPROT  EQU   X'20'               PROTECTED FIELD                              
FVAZERO  EQU   X'0C'               ZERO INTENSITY                               
FVAHIGH  EQU   X'08'               HIGH INTENSITY                               
FVAXTND  EQU   X'02'               EXTENDED HEADER                              
FVAMODF  EQU   X'01'               MODIFIED INPUT FIELD                         
FVABSA   DS    XL2                 SCREEN ABSOLUTE ADDRESS                      
FVIIND   DS    XL1                 INPUT VALIDATION INDICATORS                  
FVITHIS  EQU   X'80'               FIELD INPUT THIS TIME                        
FVILAST  EQU   X'40'               FIELD HAS BEEN INPUT PREVIOUSLY              
FVIVAL   EQU   X'20'               FIELD HAS BEEN VALIDATED PREVIOUSLY          
FVIINV   EQU   X'10'               FIELD IS INVALID                             
FVINUM   EQU   X'08'               FIELD IS VALID NUMERIC                       
FVIALF   EQU   X'04'               FIELD IS VALID ALPHA                         
FVIHEX   EQU   X'02'               FIELD IS VALID HEXADECIMAL                   
FVILEN   DS    XL1                 ACTUAL INPUT DATA LENGTH                     
FVOIND   DS    XL1                 OUTPUT INDICATORS                            
FVOXMT   EQU   X'80'               TRANSMIT FIELD                               
FVOCUR   EQU   X'40'               INSERT CURSOR TO FIELD                       
FVXLEN   DS    XL1                 ACTUAL INPUT DATA LENGTH-1                   
FVIFLD   DS    CL255               EXTRACTED & SPACE FILLED INPUT FIELD         
FVOMSG   DS    CL60                OUTPUT MESSAGE MAY BE BUILT HERE             
FVUNLD   DS    CL2                 UNIT/LEDGER OR FFFF FOR SEARCH OR 0          
FVPREF   DS    CL1                 PREFIX CHARACTER FOR OVERRIDE UL             
FVMAMI   DS    CL1                 MAXIMUM/MINUMUM ACCOUNT LEVELS               
         DS    CL16                N/D                                          
*                                                                               
AGYOPTS  DS    XL1                 AGENCY OPTIONS                               
AGYCTRY  DS    XL1                 AGENCY COUNTRY                               
AGYLANG  DS    XL1                 AGENCY LANGUAGE                              
AGYCURR  DS    CL3                 AGENCY CURRENCY                              
*                                                                               
COMPANY  DS    XL1                 COMPANY FROM FACPAK PARAMETER LIST           
IOINDS   DS    XL1                 INDICATORS FOR IOEX ROUTINE                  
ANYMARK  DS    XL1                 DISPLAY TRANSACTIONS MARKED 1 OR 0           
DATADISP DS    H                   DISPLACEMENT TO FIRST RECORD ELEMENT         
         DS    XL48                N/D                                          
MEMIND1  DS    XL1                 MEMORANDUM SCREEN INDICATOR - 1              
MEMIACTV EQU   X'80'               ACTIVITY THIS TIME                           
SVADDR   DS    F                   SAVED ADDRESS                                
RECBIT   DS    XL1                 STATUS BYTE (FOR BASE)                       
TWORCV   EQU   X'80'               2ND RECEIVABLE LINE IN USE                   
LOWLEV   EQU   X'40'               ENTERED A LOW LEVEL SR ACCOUNT               
         DS    XL11                N/D                                          
*                                                                               
         DS    0F                  ALIGN TO A FULLWORD                          
RECLEDG  DS    AL4                 A(LEDGER TABLE ENTRY)                        
RECVALS  DS    0X                  ** EXTRACTED RECORD VALUES **                
RECINDS  DS    XL1                 RECORD INDICATORS                            
RECIBAL  EQU   X'80'               ACCOUNT HAS A BALANCE ELEMENT                
RECCOMP  DS    AL4                 A(COMPANY ELEMENT)                           
RECPROF  DS    AL4                 A(ACCOUNT PROFILE ELEMENT)                   
RECAPTR  DS    AL4                 A(ACCOUNT POINTER ELEMENT) (FIRST)           
RECSTAT  DS    CL(L'RSTSTAT)       STATUS BYTE 1                                
RECSECY  DS    XL(L'RSTSECY)       SECURITY NUMBER                              
RECOFFC  DS    CL(L'TRNOFFC)       OFFICE CODE                                  
RECFILT1 DS    CL(L'RSTFILT1)      ACCOUNT FILTER 1                             
RECFILT2 DS    CL(L'RSTFILT2)      ACCOUNT FILTER 2                             
RECFILT3 DS    CL(L'RSTFILT3)      ACCOUNT FILTER 3                             
RECFILT4 DS    CL(L'RSTFILT4)      ACCOUNT FILTER 4                             
RECFILT5 DS    CL(L'RSTFILT5)      ACCOUNT FILTER 5                             
RECCSTG  DS    CL(L'RSTCOSTG)      COSTING GROUP                                
RECNAME  DS    CL(L'NAMEREC)       NAME (SPACE FILLED)                          
RECVATR  DS    XL(L'RATRATE)       VAT RATE                                     
RECANAL  DS    XL(L'ACTKACT)       ANALYSIS A/C FROM SPAEL                      
RECEXDF  DS    XL(L'ACTKULA)       EXCHANGE DIFFERENCE U/L/ACCOUNT              
RECBCHA  DS    XL(L'ACTKULA)       BANK CHARGE U/L/ACCOUNT                      
RECCURR  DS    XL(L'AFCCURR)       RECORD CURRENCY CODE                         
RECASTS1 DS    XL1                 ASTEL STATUS BYTE 1                          
         DS    XL32                N/D                                          
RECELS   DS    XL1                 REQUIRED ELEMENTS/DATA                       
RECSTATQ EQU   X'01'                                                            
RECNAMEQ EQU   X'02'                                                            
RECVALSL EQU   *-RECVALS                                                        
*                                                                               
SCRVALS  DS    0X                  ** SCROLL CONTROL **                         
SCROLL   DS    XL2                 SCROLL AMOUNT                                
SCRPAGE  EQU   LINES               SCROLL A PAGE                                
SCRHALF  EQU   LINES/2             SCROLL HALF A PAGE                           
SCRMAXI  EQU   X'FFFF'             SCROLL MAXIMUM                               
SCRLEFT  EQU   X'FFFE'             SCROLL LEFT                                  
SCRRGHT  EQU   X'FF01'             SCROLL RIGHT                                 
SCRUPDN  DS    CL1                 SCROLL DIRECTION +/-                         
SCRDN    EQU   C'+'                SCROLL DOWN                                  
SCRUP    EQU   C'-'                SCROLL UP                                    
SCRFIND  EQU   C'*'                SCROLL TO A KEY                              
SCRVALSL EQU   *-SCRVALS                                                        
*                                                                               
LOCVALS  DS    0X                  ** LOCATE VALUES **                          
LOCDAT   DS    CL(L'TRNKDATE)      X'YYMMDD' DATE=DDMMMYY/DD.MM.YY              
LOCBILXQ DS    XL1                 EXECUTE L'BILL NUMBER                        
LOCBIL   DS    CL(L'TRNKREF)       BILL NO=NNNNNN                               
LOCACTXQ DS    XL1                 EXECUTE L'ACCOUNT                            
LOCACT   DS    CL(L'ACTKCULA)      ACCOUNT=ACCOUNT OR *ULACCOUNT                
LOCCACXQ DS    XL1                 EXECUTE L'BILLING SOURCE                     
LOCCAC   DS    CL(L'CACKCACT)      BILL SOURCE=XXXXXXXXXXXX                     
         DS    XL16                N/D                                          
LOCVALSL EQU   *-LOCVALS                                                        
*                                                                               
PRTSUB   DS    CL3                 REPORT-ID FOR ONLINE JOURNAL                 
*                                                                               
POSTVALS DS    0X                  ** TRANSACTION POSTING VALUES **             
POSTACT  DS    XL(L'TRNKCULA-1)    ACCOUNT CODE                                 
POSTACTN DS    CL(L'NAMEREC)       ACCOUNT NAME                                 
POSTOFFC DS    CL(L'TRNOFFC)       OFFICE CODE                                  
POSTDATE DS    PL(L'TRNKDATE)      DATE                                         
POSTREF  DS    CL(L'TRNKREF)       BILL NUMBER/REFERENCE                        
POSTAMNT DS    PL6                 AMOUNT                                       
POSTAM2  DS    PL6                 AMOUNT (CURRENCY)                            
POSTSTAT DS    XL(L'TRNSTAT)       TRANSACTION STATUS                           
POSTCAC  DS    XL(L'TRNKCULC)      CONTRA-ACCOUNT                               
POSTCACN DS    CL(L'NAMEREC)       CONTRA-ACCOUNT NAME                          
POSTNARR DS    CL(255-TRNLN1Q)                                                  
         DS    XL32                                                             
*                                                                               
TSARVALS DS    0C                  ** LAST CONTRA/DATE/REF **                   
TSARCAC  DS    CL(L'TRNKCULC)      CONTRA-ACCOUNT                               
TSARDAT  DS    XL(L'TRNKDATE)      DATE                                         
TSARREF  DS    CL(L'TRNKREF)       BILL NUMBER/REFERENCE                        
TSARVALL EQU   *-TSARVALS                                                       
TSARSUB  DS    XL(L'TRNKSBR)       SUB-REFERENCE NUMBER                         
TSAROFFC DS    CL(L'TRNOFFC)       OFFICE CODE (OR SPACES)                      
TSARDUED DS    XL(L'DUEDATE)       DUE DATE (OR BINARY ZEROES)                  
         DS    XL16                N/D                                          
*                                                                               
TSARREC  DS    0H                  ** TSAR RECORD **                            
TSARLEN  DS    H                   RECORD LENGTH                                
TSARKEY  DS    0X                  RECORD KEY (DYNAMIC)                         
         DS    XL(L'RECVNDX)       ** MAIN TSAR RECORD **                       
         DS    CL(L'TSARCAC)                                                    
         DS    PL(L'TSARDAT)                                                    
         DS    CL(L'TSARREF)                                                    
         DS    CL(L'TSAROFFC)                                                   
         DS    XL(L'TSARDUED)                                                   
TSARTYPE DS    XL1                 RECORD TYPE                                  
TSARTTRN EQU   ACTINPT             FROM TRANSACTION READING                     
TSARTOVR EQU   ACTOVER             FROM OVERPAYMENT SCREEN                      
TSARTRPL EQU   128                 REPLICATED TRANSACTION                       
TSARKEYL EQU   *-TSARKEY                                                        
*                                                                               
TSARDATA DS    0X                  RECORD DATA                                  
TSARSUBR DS    XL1                 SUB-REFERENCE NUMBER                         
TSARINDS DS    XL1                 RECORD INDICATOR                             
TSARIWOF EQU   X'80'               WRITE-OFF                                    
TSARIOFS EQU   X'40'               OFFSET                                       
TSARIGRS EQU   X'20'               GROSS ALLOCATION (NO DISCOUNT ETC.)          
TSARITRF EQU   X'10'               TRANSFER                                     
TSARILAT EQU   X'08'               DISCOUNT TAKEN LATE (U.S. ONLY)              
TSARISMT EQU   X'04'               MORE THAN ONE TRANSACTION FOUND              
TSARISCR EQU   X'02'               ONE OR MORE CR TRANSACTION(S) FOUND          
TSARISDR EQU   X'01'               ONE OR MORE DR TRANSACTION(S) FOUND          
TSARP6   DS    0PL6                PL6 ACCUMULATORS                             
TSARDR   DS    PL6                 DEBIT AMOUNT                                 
TSARCR   DS    PL6                 CREDIT AMOUNT                                
TSARDISC DS    PL6                 DISCOUNT (OR SURCHARGE) AMOUNT               
TSARPOST DS    PL6                 POSTING AMOUNT                               
TSARP6L  EQU   *-TSARP6                                                         
TSARP6N  EQU   TSARP6L/L'TSARP6                                                 
TSARTRFA DS    CL(L'ACTKACT)       TRANSFER ACCOUNT                             
TSARTRFO DS    CL(L'TSAROFFC)      TRANSFER ACCOUNT OFFICE CODE                 
TSARPMOS DS    XL2                 POSTING MOS (OF FIRST POSTING)               
TSARIND2 DS    XL1                 RECORD INDICATOR - 2                         
TSAR2QRD EQU   X'80'               QUERIED ITEM                                 
TSAR2HLD EQU   X'40'               HELD ITEM                                    
TSAR2MEM EQU   X'20'               MEMORANDUM HELD (AT TIME OF ENTRY)           
TSAR2REP EQU   X'10'               REPLICANT (TSARTYPE >= TSARTRPL)             
TSAR2CLR EQU   X'08'               CLEARING ITEM                                
*MN                                                                             
TSARPRTC EQU   X'04'               PROTECT WHEN DISPLAYING ITEM                 
*MN                                                                             
TSARIND3 DS    XL1                 RECORD INDICATOR - 3                         
TSARXSEQ DS    XL2                 EXTRA RECORD KEY SEQUENCE#                   
TSARDUE2 DS    XL(L'DUEDATE)       NEW DUE DATE                                 
*&&US                                                                           
TSARGSTB DS    PL6                 GST BASIS                                    
TSARGST  DS    PL6                 GST AMOUNT                                   
TSARGSTT DS    CL1                 GST TYPE                                     
TSARPSTB DS    PL6                 PST BASIS                                    
TSARPST  DS    PL6                 PST AMOUNT                                   
TSARPSTC DS    CL2                 PROVINCE CODE                                
TSARPSTT DS    CL1                 PROVINCE TAX RATE TYPE                       
TSARSYS  DS    CL1                 SYSTEM                                       
TSARMED  DS    CL1                 MEDIA CODE                                   
TSARCLI  DS    CL3                 CLIENT CODE                                  
TSARINVN DS    CL15                INVOICE NUMBER                               
TSARKREF DS    CL11                ORIGINAL REFERENCE #                         
TSARBTYC DS    CL6                 BILL TYPE CODE                               
TSARPOEL DS   0CL28                PO NUMBER AND DESC WITH STATUS               
TSARPONO DS    CL15                PO NUMBER                                    
TSARPODS DS    CL12                PO DESCRIPTION                               
TSARPSTS DS    CL1                 PO STATUS                                    
         DS    XL4                 N/D                                          
*&&                                                                             
*&&UK                                                                           
TSARCUR  DS    CL3                 FOREIGN CURRENCY CODE                        
TSARTAX  DS    PL6                 TAX AMOUNT IN AGENCY CURRENCY                
TSARP62  DS    0PL6                PL6 ACCUMULATORS - 2 (SEE TSARP6)            
TSARDR2  DS    PL6                 DEBIT AMOUNT IN SECOND CURRENCY              
TSARCR2  DS    PL6                 CREDIT AMOUNT IN SECOND CURRENCY             
TSARDI2  DS    PL6                 DISCOUNT AMOUNT IN SECOND CURRENCY           
TSARPO2  DS    PL6                 POSTING AMOUNT IN SECOND CURRENCY            
TSARP62L EQU   *-TSARP62                                                        
TSARP62N EQU   TSARP62L/L'TSARP62                                               
TSARAFCX DS    XL(L'AFCX)          ACCOUNT FOREIGN CURRENCY RULES               
*&&                                                                             
TSARSOR  DS    XL(SORALNQ)         SOURCE ACCOUNT (MAXIMUM LENGTH)              
TSARRECL EQU   *-TSARREC           TSAR RECORD LENGTH 1                         
*                                                                               
         ORG   TSARKEY             ** EXTENSION TSAR RECORD **                  
TS2TYP   DS    XL2                                                              
TS2SEQ   DS    XL2                 START AT X'FFFF', DESCENDING                 
         ORG   TSARDATA                                                         
TS2ELE   DS    0X                  DATA ELEMENTS                                
TS2DATE  DS    XL2                 COMPRESSED DATE                              
TS2REF   DS    CL(L'MEMREF1)       REFERENCE                                    
TS2NOTE  DS    CL(L'MEMMEM1)       NOTE                                         
TS2ELEL  EQU   *-TS2ELE                                                         
TS2ELEN  EQU   4                   UP TO FOUR DATA ELEMENTS                     
         ORG   TS2ELE+(TS2ELEL*TS2ELEN)                                         
TSARDATL EQU   *-TSARDATA          MAXIMUM TSAR DATA LENGTH                     
TS2LEN   EQU   *-TSARREC           TSAR RECORD LENGTH 2                         
TSARMAXL EQU   *-TSARREC           MAXIMUM TSAR RECORD LENGTH                   
*                                                                               
DISHED1  DS    CL(L'RECLHD1)       INPUT SCREEN LEFT HAND HEADING 1             
DISHED2  DS    CL(L'RECLHD1)       INPUT SCREEN LEFT HAND HEADING 2             
*                                                                               
TOUTLST  DS    0C                  ** TABLE OF TOTAL TYPES **                   
TOTALS   DS    8CL12                                                            
TOTALSX  DS    CL1                                                              
*                                                                               
SOUTLST  DS    0C                  ** TABLE OF TOTAL BILLING SOURCES **         
SOURCES  DS    4CL12                                                            
SOURCESX DS    CL1                                                              
*                                                                               
KEYWORK  DS    XL64                                                             
KEY      DS    XL64                                                             
KEYSAVE  DS    XL64                                                             
*                                  N/D ADDRESSABLE W/S HERE                     
         ORG   WORKD+(4096-L'KEY)  FIRST 64 BYTES OF IO ADDRESSABLE             
IO       DS    XL2048                                                           
IO2      DS    XL2048                                                           
IO3      DS    XL2048                                                           
IO4      DS    XL2048                                                           
IO5      DS    XL2048                                                           
IO6      DS    XL2048                                                           
SCANOUT  DS    XL(SCANLTAB)                                                     
OVERWORK DS    XL3072              OVERLAY WORK AREA                            
OFFBLK   DS    XL(OFFALLEN)        OFFAL BLOCK                                  
TSARBLK  DS    XL(TSARDL2)         TSAR BLOCK                                   
REPWORK  DS    XL(REPL)            REPORT WORK AREA                             
PQBUFF   DS    (14*1024)X          PRINT QUEUE BUFFER AREA                      
WORKX    EQU   *                                                                
         EJECT                                                                  
SAVED    DSECT                     ** SAVED STORAGE **                          
SHEADTOT DS    AL2                 DISPLACEMENT TO HEADER TOTALS LINE           
SHEADPFK DS    AL2                 DISPLACEMENT TO HEADER PF KEY LINE           
PREVPONO DS    CL15                PREVIOUS PO NUMBER                           
*                                                                               
ACTVALS  DS    0X                  ** ACTION VALUES **                          
ACTNAME  DS    CL(ACTLGNLQ)        THIS TIME ACTION NAME                        
ACTION   DS    XL1                 THIS TIME ACTION NUMBER                      
ACTINDS  DS    XL1                 THIS TIME ACTION INDICATORS                  
ACTIONL  DS    XL1                 LAST TIME ACTION NUMBER                      
*                                                                               
DISVALS  DS    0X                  ** INPUT DISPLAY VALUES **                   
DISIND   DS    XL1                 DISPLAY STATUS                               
DISIRST  EQU   X'80'               RESTART FROM BEGINNING                       
DISIBOF  EQU   X'40'               INDICATES BOF                                
DISIEOF  EQU   X'20'               INDICATES EOF                                
DISMAX   DS    H                   HIGHEST TSAR RECORD NUMBER                   
DISNUM   DS    H                   CURRENT RECORD NUMBER                        
DISLIN   DS    H                   NUMBER OF LINES DISPLAYED ON SCREEN          
DISREC   DS    (LINES)H            TSARRECS DISPLAYED/TO BE DISPLAYED           
DISRECL  EQU   *-DISREC                                                         
DISVALSL EQU   *-DISVALS                                                        
*                                                                               
WCPCNT   DS    XL1                 WRITE-OFF CLIENT/PRODUCT COUNTER             
*                                                                               
PROFILE  DS    0XL16               ** LEDGER/ACCOUNT PROFILE **                 
PROFSEQ  DS    0XL6                SORT SEQUENCE (VALUES=1-6)                   
PROFS1   DS    XL1                 1ST KEY FIELD                                
PROFS2   DS    XL1                 2ND KEY FIELD                                
PROFS3   DS    XL1                 3RD KEY FIELD                                
PROFS4   DS    XL1                 4TH KEY FIELD                                
PROFS5   DS    XL1                 5TH KEY FIELD                                
PROFS6   DS    XL1                 6TH KEY FIELD                                
PROFDIS  DS    0XL7                DISPLAY SEQUENCE (VALUES=0-16)               
PROFD1   DS    XL1                 1ST DISPLAY VALUE                            
PROFD2   DS    XL1                 2ND DISPLAY VALUE                            
PROFD3   DS    XL1                 3RD DISPLAY VALUE                            
PROFD4   DS    XL1                 4TH DISPLAY VALUE                            
PROFD5   DS    XL1                 5TH DISPLAY VALUE                            
PROFD6   DS    XL1                 6TH DISPLAY VALUE                            
PROFD7   DS    XL1                 7TH DISPLAY VALUE                            
PROFTOT  DS    XL1                 CONTROL DISPLAY INDICATORS                   
PROFTBAL EQU   X'80'               SHOW BALANCE                                 
PROFTCHQ EQU   X'40'               SHOW CHEQUE AMOUNT                           
PROFTMRK EQU   X'20'               SHOW MARKED TOTAL                            
PROFTDIF EQU   X'10'               SHOW OTHERS TOTAL                            
PROFTWOF EQU   X'08'               SHOW WRITE-OFF TOTAL                         
PROFTOFS EQU   X'04'               SHOW OFFSET TOTAL                            
PROFTDSC EQU   X'02'               SHOW DISCOUNT TOTAL/AMOUNT                   
PROFTVAT EQU   X'01'               SHOW VAT TOTAL                               
PROFTXFR EQU   PROFTVAT            SHOW TRANSFER TOTAL                          
PROFWVAT DS    CL1                 Y=WRITE-OFF VAT ADJUSTMENT                   
PROFRREP EQU   PROFWVAT            Y=REPORT REQUIRED FOR UPDATE                 
PROFCFRM DS    XL1                 N/D                                          
PROFBOTH EQU   C'Y'                CONFIRM UPDATE & QUIT ACTIONS                
PROFUPDT EQU   C'U'                CONFIRM UPDATE ACTION ONLY                   
PROFQUIT EQU   C'Q'                CONFIRM QUIT ACTION ONLY                     
PROFNONE EQU   C'N'                NO CONFIRMATION REQUIRED                     
*                                                                               
KEYDISP  DS    0X                  ** DISPLACEMENT TO KEY VALUES **             
KEYACTD  DS    XL1                 ACCOUNT                                      
KEYCACD  DS    XL1                 SOURCE                                       
KEYDATD  DS    XL1                 DATE                                         
KEYREFD  DS    XL1                 BILL NUMBER                                  
KEYOFFD  DS    XL1                 OFFICE                                       
KEYDUED  DS    XL1                 DUE DATE                                     
KEYDISPL EQU   *-KEYDISP                                                        
*                                                                               
DISDISP  DS    0X                  ** DISPLACEMENT TO LINE VALUES **            
DISACTD  DS    XL1                 ACCOUNT                                      
DISCACD  DS    XL1                 SOURCE                                       
DISDATD  DS    XL1                 DATE                                         
DISREFD  DS    XL1                 BILL NUMBER                                  
DISBLAD  DS    XL1                 BILL AMOUNT                                  
DISPRCD  DS    XL1                 PRIOR CREDITS                                
DISALCD  DS    XL1                 ALLOCATED THIS TIME                          
DISDSCD  DS    XL1                 DISCOUNT AMOUNT                              
DISOFFD  DS    XL1                 OFFICE CODE                                  
DISDUED  DS    XL1                 DUE DATE                                     
*&&UK                                                                           
DISVATD  DS    XL1                 VAT AMOUNT                                   
*&&                                                                             
*&&US                                                                           
DISGSTD  DS    XL1                 GST AMOUNT                                   
*&&                                                                             
DISSTAD  DS    XL1                 STATUS                                       
DISXFRD  DS    XL1                 TRANSFER ACCOUNT                             
DISNETD  DS    XL1                 NET AMOUNT                                   
*&&UK                                                                           
DISDR2D  DS    XL1                 BILL AMOUNT (CURRENCY)                       
DISCR2D  DS    XL1                 PRIOR CREDITS (CURRENCY)                     
DISDI2D  DS    XL1                 DISCOUNT AMOUNT (CURRENCY)                   
DISNE2D  DS    XL1                 NET AMOUNT (CURRENCY)                        
DISAL2D  DS    XL1                 ALLOCATED (CURRENCY)                         
DISEXDD  DS    XL1                 EXCHANGE DIFFERENCE                          
         DS    XL22                N/D                                          
*&&                                                                             
*&&US                                                                           
DISPSTD  DS    XL1                 PST AMOUNT                                   
         DS    XL27                N/D                                          
*&&                                                                             
DISDISPL EQU   *-DISDISP                                                        
*                                                                               
TOTVALS  DS    0X                  ** TOTALS DISPLAY CONTROL **                 
TOTLIST  DS    AL2                 A(LIST OF TOTALS NAMES)                      
TOTPROF  DS    XL1                 PROFILE DISPLACEMENT CONTROL                 
TOTPROFS DS    XL1                 SAVED PROFILE DISPLACEMENT CONTROL           
TOTDISP  DS    0X                  DISPLACEMENTS TO TOTALS VALUES               
TOTBALD  DS    XL1                 BALANCE AMOUNT                               
TOTCHQD  DS    XL1                 CHEQUE AMOUNT                                
TOTMRKD  DS    XL1                 MARKED (ALLOCATED) AMOUNT                    
TOTDIFD  DS    XL1                 DIFFERENCES (OVERS SCREEN)                   
TOTDSCD  DS    XL1                 DISCOUNT/SURCHARGE AMOUNT                    
TOTWOFD  DS    XL1                 WRITE-OFF AMOUNT                             
TOTOFSD  DS    XL1                 OFFSET AMOUNT                                
TOTVATD  DS    XL1                 VAT AMOUNT                                   
TOTXFRD  EQU   TOTVATD             TRANSFER TOTAL (USA ONLY)                    
TOTDISPL EQU   *-TOTDISP                                                        
TOTHEAD  DS    CL(L'RECTOT)        SAVED HEADLINE FOR TOTALS                    
TOTMINW  EQU   13                  MINIMUM WIDTH OF TOTHEAD ENTRY               
*                                                                               
BATMONP  DS    PL2                 BATCH MONTH P'YYMM'                          
TODAYP   DS    PL3                 TODAY'S DATE P'YYMMDD'                       
TODAYC   DS    XL2                 TODAY'S DATE (BINARY COMPRESSED)             
TODAYB   DS    XL3                 TODAY'S DATE B'YYMMDD'                       
BATMON   DS    CL2                 BATCH MONTH C'YM'                            
BATREF   DS    CL4                 BATCH REFERENCE                              
BATNAME  DS    CL(L'BTHNAME)       BATCH NAME                                   
BATOFF   DS    CL(L'TRNOFFC)       BATCH OFFICE CODE                            
*                                                                               
OPTIONS  DS    0X                  ** THIS TIME OPTION VALUES **                
OPTSWTC  DS    XL1                 SWITCH MARKING RULES - BLANK=ALLOC           
KEYOPTS  DS    0X                  KEY OPTIONS CAN'T CHANGE MIDSTREAM           
OPTMARK  DS    XL1                 ONLY SHOW MARKED TRANSACTIONS                
OPTBALS  DS    XL1                 ONLY SHOW OUT-BALANCE TRANSACTIONS           
OPTSPCL  DS    XL1                 ONLY SHOW SPECIAL ITEMS                      
OPTWOFF  DS    XL1                 ONLY SHOW WRITTEN-OFF ITEMS                  
OPTDISC  DS    XL1                 ONLY SHOW ITEMS CARRYING DISCOUNT            
OPTOFST  DS    XL1                 ONLY SHOW OFFSET ITEMS                       
OPTXFRS  DS    XL1                 ONLY SHOW TRANSFERRED ITEMS                  
OPTHELD  DS    XL1                 SHOW HELD ITEMS (SEE OPTQUER)                
OPTQUER  DS    XL1                 SHOW QUERIED ITEMS (SEE OPTHELD)             
OPTDATE  DS    XL(L'TRNKDATE)      X'YYMMDD' DATE=DDMMMYY/DD.MM.YY              
OPTBIL   DS    CL(L'TRNKREF)       BILL NO=NNNNNN                               
OPTBILXQ DS    XL1                 L'EXECUTE FOR OPTBIL                         
OPTACTX  DS    XL1                 1 BYTE INDEX - ACCOUNT=(14 CHARS)            
OPTCACXQ DS    XL1                 L'EXECUTE FOR OPTCAC                         
OPTCAC   DS    CL(L'CACKCACT)      BILLING SOURCE FILTER                        
OPTAMT   DS    PL6                 AMOUNT FILTER                                
OPTOFF   DS    CL(L'TRNOFFC)       OFFICE FILTER                                
OPTDIS   DS    XL35                DISPLAY=NNNNNNN                              
OPTDIND  DS    XL1                 DISPLAY OPTION INDICATOR                     
OPTDIADQ EQU   X'80'               OPTDIS CONTAINS SUFFIX COLUMN(S)             
OPTDIPRQ EQU   X'40'               OPTDIS CONTAINS PREFIX COLUMN(S)             
OPTDIALQ EQU   X'20'               OPTDIS CONTAINS ALL COLUMNS                  
OPTDISL  EQU   *-OPTDIS                                                         
OPTCUR   DS    CL(L'CURTCUR)       CURRENCY FILTER                              
OPTCLRNG DS    XL1                 SHOW CLEARING ITEMS                          
         DS    XL15                N/D                                          
KEYOPTSL EQU   *-KEYOPTS           L'KEY OPTIONS                                
OPTIONSL EQU   *-OPTIONS           L'ALL OPTIONS                                
*                                                                               
COMPVALS DS    0X                  ** EXTRACTED COMPANY VALUES **               
COMPALFA DS    CL(L'CPYALPHA)      ALPHA CODE                                   
COMPSTAT DS    CL(L'CPYSTAT1)      1ST STATUS BYTE                              
COMPSTA2 DS    CL(L'CPYSTAT2)      2ND STATUS BYTE                              
COMPSTA3 DS    CL(L'CPYSTAT3)      3RD STATUS BYTE                              
COMPSTA4 DS    CL(L'CPYSTAT4)      4TH STATUS BYTE                              
COMPSTA5 DS    CL(L'CPYSTAT5)      5TH STATUS BYTE                              
COMPSTA6 DS    CL(L'CPYSTAT6)      6TH STATUS BYTE                              
COMPSTA7 DS    CL(L'CPYSTAT7)      7TH STATUS BYTE                              
COMPSTA8 DS    CL(L'CPYSTAT8)      8TH STATUS BYTE                              
COMPOFFL DS    XL1                 LENGTH OF OFFICE CODES                       
COMPDPTL DS    XL(L'CPYDEPTL)      LENGTH OF DEPARTMENT CODES                   
MOSLOCK  DS    XL2                 LATEST CLOSED MOS (PWOS X'YYMM')             
COCDPASS DS    CL(L'CPYCDC)        N=NO CASH DISCOUNT TO CLIENTS                
BATCHSEC DS    CL(L'CPYBSEC)       BATCH SECURITY LEVEL                         
*&&UK                                                                           
VATRATES DS    CL(CPYVATL)         VAT RATES/DATES                              
*&&                                                                             
TENO     DS    CL(L'CPYTENO)       NUMBER OF BYTES TO TAKE FROM RH END          
COMPDEBO DS    XL1                 DEBTORS OVERLAY TYPE                         
COMPSTA9 DS    CL(L'CPYSTAT9)      9TH STATUS BYTE                              
COMPSTAA DS    CL(L'CPYSTATA)      10TH STATUS BYTE                             
COMPGMOA DS    XL2                 GL MOA                                       
         DS    XL3                 N/D                                          
GFACTST6 DS    X                   GETFACT STAT 6                               
*                                                                               
RECVLIST DS    AL2                 A(LIST OF VALID UNIT/LEDGERS)                
RECVVALS DS    0X                  ** RECEIVABLE ACCOUNT VALUES **              
RECVUL   DS    CL2                 RECEIVABLE UNIT/LEDGER                       
RECVOFF  DS    CL(L'TRNOFFC)       RECEIVABLE OFFICE                            
         DS    XL1                 N/D                                          
RECVCNDX DS    XL1                 CURRENT RECEIVING ACCOUNT INDEX              
RECVCACT DS    XL(L'ACTKCULA)      CURRENT RECEIVING ACCOUNT                    
RECVCNT  DS    XL1                 NUMBER OF ENTRIES IN RECVTAB                 
RECVAMT  DS    PL6                 RECEIVABLE AMOUNT                            
RECVAM2  DS    PL6                 RECEIVABLE AMOUNT (CURRENCY)                 
*                                                                               
BANKLIST DS    AL2                 A(LIST OF VALID UNIT/LEDGERS)                
BANKUL   DS    CL2                 BANK ACCOUNT UNIT/LEDGER                     
BANKVALS DS    0X                  ** BANK ACCOUNT VALUES **                    
BANK     DS    CL(L'ACTKCULA-1)    BANK ACCOUNT CODE                            
BANKNAME DS    CL(L'NAMEREC)       BANK ACCOUNT NAME                            
BANKOFF  DS    CL(L'TRNOFFC)       BANK ACCOUNT OFFICE                          
BANKREF  DS    CL(L'TRNREF)        BANK REFERENCE NUMBER                        
BANKDATE DS    CL6                 BANK DATE DEPOSITED C'YYMMDD'                
*                                                                               
ANALLIST DS    AL2                 A(LIST OF VALID UNIT/LEDGERS)                
ANALVALS DS    0X                  ** ANALYSIS BANK ACCOUNT VALUES **           
ANALUL   DS    CL2                 ANALYSIS BANK ACCOUNT UNIT/LEDGER            
ANAL     DS    CL(L'ACTKCULA-1)    ANALYSIS BANK ACCOUNT CODE                   
ANALNAME DS    CL(L'NAMEREC)       ANALYSIS BANK ACCOUNT NAME                   
*                                                                               
PRODUL   DS    CL2                 PRODUCTION UNIT/LEDGER                       
PRODVALS DS    0X                  ** PRODUCTION LEDGER VALUES **               
PRODLEVS DS    0XL3                PRODUCTION ACCOUNT LEVEL LENGTHS             
PRODALEN DS    XL(L'ACLVLEN)       SJ L'LEVA                                    
PRODBLEN DS    XL(L'ACLVLEN)       SJ L'LEVB+L'LEVA                             
PRODCLEN DS    XL(L'ACLVLEN)       SJ L'LEVC+L'LEVB+L'LEVA                      
*                                                                               
ICPYLIST DS    AL2                 A(LIST OF VALID UNIT/LEDGERS)                
ICPYVALS DS    0X                  ** INTERCOMPANY ACCOUNT VALUES **            
ICPY     DS    CL(L'ACTKCULA-1)    INTERCOMPANY UNIT/LEDGER/ACCOUNT             
ICPYNAME DS    CL(L'NAMEREC)       INTERCOMPANY ACCOUNT NAME                    
ICPYAMT  DS    PL6                 INTERCOMPANY AMOUNT                          
ICP2     DS    CL(L'ACTKCULA-1)    INTERCOMPANY 2 UNIT/LEDGER/ACCOUNT           
ICP2NAME DS    CL(L'NAMEREC)       INTERCOMPANY 2 ACCOUNT NAME                  
*                                                                               
WOFFLIST DS    AL2                 A(LIST OF VALID UNIT/LEDGERS)                
WOFFVALS DS    0X                  ** WRITE-OFF ACCOUNT VALUES **               
WOFF     DS    CL(L'ACTKCULA-1)    WRITE-OFF UNIT/LEDGER/ACCOUNT                
WOFFNAME DS    CL(L'NAMEREC)       WRITE-OFF ACCOUNT NAME                       
WOFFOFF  DS    CL(L'TRNOFFC)       WRITE-OFF ACCOUNT OFFICE                     
WOFFSTAT DS    XL(L'RSTSTAT)       WRITE-OFF ACCOUNT STATUS                     
WOFFCOST DS    CL(L'RSTCOSTG)      WRITE-OFF COSTING GROUP OR SPACE             
WOFFANAL DS    CL(L'ACTKACT)       WRITE-OFF ANALYSIS A/C (SEE SPAEL)           
WOFFNCST DS    CL(L'ACTKCULA)      WRITE-OFF NEW 13 COSTING ACCOUNT             
WOFFINDS DS    XL1                 WRITE-OFF INDICATORS                         
WOFFISI  EQU   X'80'               SI WRITE-OFF A/C                             
WOFFIREV EQU   X'40'               POST +CR, NOT -DR (SA,SB,SC,SE,SF)           
WOFFISE  EQU   X'20'               SE WRITE-OFF A/C (WOFFIREV SET TOO)          
WOFFIPAY EQU   X'10'               PAYABLE WRITE-OFF A/C (SV,SW,SX,SY)          
WOFFINCP EQU   X'08'               NO NEW COSTING SYSTEM POSTINGS               
WOFFIYCP EQU   X'04'               NEW COSTING SYSTEM POSTINGS                  
WOFREF   DS    CL(L'TRNREF)        WRITE-OFF REFERENCE NUMBER                   
WOFDATE  DS    PL3                 WRITE-OFF DATE (PWOS YMD)                    
WOFNARR  DS    CL30                WRITE-OFF NARRATIVE                          
WOFFAMT  DS    PL8                 WRITE-OFF AMOUNT                             
WOFFAM2  DS    PL8                 WRITE-OFF AMOUNT (CURRENCY)                  
WOFFVALL EQU   *-WOFFVALS                                                       
*                                                                               
DISCLIST DS    AL2                 A(LIST OF VALID UNIT/LEDGERS)                
DISCVALS DS    0X                  ** DISCOUNT ACCOUNT VALUES **                
DISC     DS    CL(L'ACTKCULA-1)    DISCOUNT UNIT/LEDGER/ACCOUNT                 
DISCNAME DS    CL(L'NAMEREC)       DISCOUNT ACCOUNT NAME                        
DISCOFF  DS    CL(L'TRNOFFC)       DISCOUNT ACCOUNT OFFICE                      
DISCSTAT DS    XL(L'RSTSTAT)       DISCOUNT ACCOUNT STATUS                      
DISCCOST DS    CL(L'RSTCOSTG)      DISCOUNT COSTING GROUP OR SPACE              
DISCANAL DS    CL(L'ACTKACT)       DISCOUNT ANALYSIS A/C (SEE SPAEL)            
DISCNCST DS    CL(L'ACTKCULA)      WRITE-OFF NEW 13 COSTING ACCOUNT             
DISCAMT  DS    PL6                 DISCOUNT AMOUNT                              
DISCAM2  DS    PL6                 DISCOUNT AMOUNT (CURRENCY)                   
DISCINDS DS    XL1                 DISCOUNT INDICATORS                          
DISCISE  EQU   X'80'               SE DISCOUNT A/C                              
DISCISI  EQU   X'40'               SI DISCOUNT A/C                              
DISCINCP EQU   X'20'               NO NEW COSTING SYSTEM POSTINGS               
DISCIYCP EQU   X'10'               NEW COSTING SYSTEM POSTINGS                  
DISCIADD EQU   X'01'               ON=DON'T ADD TO BALANCE                      
DISCVALL EQU   *-DISCVALS                                                       
*                                                                               
BANKXTRA DS    0X                                                               
EXDF     DS    XL(L'ACTKULA)       EXCHANGE DIFFERENCE U/L/ACCOUNT              
EXDFCOST DS    CL(L'RSTCOSTG)      COSTING GROUP OR SPACE                       
EXDFNAME DS    XL(L'NAMEREC)       ACCOUNT NAME                                 
EXDFOPOK DS    XL1                 OFFICE POSITION IN KEY OR 0                  
BCHA     DS    XL(L'ACTKULA)       BANK CHARGE U/L/ACCOUNT                      
BCHACOST DS    CL(L'RSTCOSTG)      COSTING GROUP OR SPACE                       
BCHANAME DS    XL(L'NAMEREC)       BANK CHARGE ACCOUNT NAME                     
BCHAOPOK DS    XL1                 OFFICE POSITION IN KEY OR ZERO               
BCHAAMT  DS    PL6                 BANK CHARGE AMOUNT                           
BCHAAM2  DS    PL6                 BANK CHARGE AMOUNT (CURRENCY)                
BNKASTS1 DS    XL1                 BANK ACCOUNT ASTSTAT1                        
BANKXTRL EQU   *-BANKXTRA                                                       
*                                                                               
DEPTDEF  DS    CL6                 DEFAULT DEPARTMENT CODE FROM SE A/C          
DEPTDEFL DS    XL1                 LENGTH OF DEFAULT DEPARTMENT CODE            
DEPTVALS DS    0X                  ** DEPARTMENT ACCOUNT VALUES **              
DEPT     DS    CL(L'ACTKCULA-1)    DEPARTMENT UNIT/LEDGER/ACCOUNT               
DEPTNAME DS    CL(L'NAMEREC)       DEPARTMENT ACCOUNT NAME                      
DEPTINDS DS    XL1                 DEPARTMENT INDICATORS                        
DEPTIOID EQU   X'80'               OFFICE CODE IN DEPARTMENT A/C                
DEPTITWO EQU   X'40'               DEPARTMENT CODE IS TWO CHARACTERS            
DEPTVALL EQU   *-DEPTVALS                                                       
*                                                                               
STAFVALS DS    0X                  ** STAFF ACCOUNT VALUES **                   
STAF     DS    CL(L'ACTKCULA-1)    STAFF UNIT/LEDGER/ACCOUNT                    
STAFNAME DS    CL(L'NAMEREC)       STAFF ACCOUNT NAME                           
STAFINDS DS    XL1                 STAFF INDICATORS                             
STAFIOIS EQU   X'80'               OFFICE IN STAFF A/C                          
STAFIDIS EQU   X'40'               DEPARTMENT IN STAFF A/C                      
STAFVALL EQU   *-STAFVALS                                                       
*&&UK                                                                           
VATLIST  DS    AL2                 A(LIST OF VALID UNIT/LEDGERS)                
VATUL    DS    CL2                 VAT UNIT/LEDGER                              
VATVALS  DS    0X                  ** VAT ACCOUNT VALUES **                     
VAT      DS    CL(L'ACTKCULA-1)    VAT UNIT/LEDGER/ACCOUNT                      
VATRATE  DS    XL(L'RATRATE)       VAT ACCOUNT RATE                             
VATNAME  DS    CL(L'NAMEREC)       VAT ACCOUNT NAME                             
VATOFF   DS    CL(L'TRNOFFC)       VAT ACCOUNT OFFICE                           
VATAMT   DS    PL6                 VAT AMOUNT                                   
*&&                                                                             
*&&US                                                                           
GSTLIST  DS    AL2                 A(LIST OF VALID UNIT/LEDGERS)                
GSTUL    DS    CL2                 GST UNIT/LEDGER                              
GSTVALS  DS    0X                  ** GST ACCOUNT VALUES **                     
GST      DS    CL(L'ACTKCULA-1)    GST UNIT/LEDGER/ACCOUNT                      
GSTNAME  DS    CL(L'NAMEREC)       GST ACCOUNT NAME                             
GSTOFF   DS    CL(L'TRNOFFC)       GST ACCOUNT OFFICE                           
*                                                                               
PSTLIST  DS    AL2                 A(LIST OF VALID UNIT/LEDGERS)                
PSTUL    DS    CL2                 PST UNIT/LEDGER                              
PSTVALS  DS    0X                  ** PST ACCOUNT VALUES **                     
PST      DS    CL(L'ACTKCULA-1)    PST UNIT/LEDGER/ACCOUNT                      
PSTNAME  DS    CL(L'NAMEREC)       PST ACCOUNT NAME                             
PSTOFF   DS    CL(L'TRNOFFC)       PST ACCOUNT OFFICE                           
*&&                                                                             
CHQDATE  DS    CL6                 CHEQUE DATE C'YYMMDD'                        
MAINTOT  DS    0PL8                                                             
CHQAMT   DS    PL8                 CHEQUE AMOUNT                                
MRKTOT   DS    PL8                 MARKED AMOUNT                                
DIFTOT   DS    PL8                 DIFFERENCES AMOUNT                           
OFSTOT   DS    PL8                 OFFSET TOTAL                                 
XFRTOT   DS    PL8                 TRANSFER TOTAL                               
*&&UK                                                                           
CHQAM2   DS    PL8                 CHEQUE AMOUNT (CURRENCY)                     
MRKTO2   DS    PL8                 MARKED AMOUNT (CURRENCY)                     
DIFTO2   DS    PL8                 DIFFERENCES AMOUNT (CURRENCY)                
OFSTO2   DS    PL8                 OFFSET TOTAL (CURRENCY)                      
XFRTO2   DS    PL8                 TRANSFER TOTAL (CURRENCY)                    
*&&                                                                             
MAINTOTN EQU   (*-MAINTOT)/L'MAINTOT                                            
*                                                                               
DATSTA   DS    PL(L'TRNKDATE)      START DATE FOR TRANSACTIONS                  
DATEND   DS    PL(L'TRNKDATE)      END DATE FOR TRANSACTIONS                    
MOSSTA   DS    XL(L'TRNMOS)        MOS RANGE START                              
MOSEND   DS    XL(L'TRNMOS)        MOS RANGE END                                
SOURCEXQ DS    XL1                 BILLING SOURCE LENGTH-1                      
SOURCE   DS    CL(L'CACKCACT)      BILLING SOURCE                               
BILSTAXQ DS    XL1                 L'EXECUTE FOR BILSTA                         
BILSTA   DS    CL(L'TRNKREF)       START BILL NUMBER                            
BILENDXQ DS    XL1                 L'EXECUTE FOR BILEND                         
BILEND   DS    CL(L'TRNKREF)       END BILL NUMBER                              
*                                                                               
CONTLIST DS    AL2                 A(LIST OF PRE-DEFINED SOURCES)               
*                                                                               
LEDGTAB  DS    XL(LEDGLTAB)        TABLE OF ACCOUNT LEDGERS                     
*                                                                               
OFSDATE  DS    PL3                 PWOS OFFSET YYMMDD (DEFAULT=TODAY)           
*                                                                               
FILEFORM DS    XL1                 FILE FORMAT                                  
VLISQ    EQU   1                   VARIABLE LENGTH INDEX SEQUENTIAL             
ISDAQ    EQU   2                   INDEX SEQUENTIAL/DIRECT ACCESS PAIR          
*                                                                               
FLTOFFC  DS    CL2                 OFFICE FILTER VALUE OR BINARY ZEROES         
*                                                                               
STSRNUM  DS    XL(L'TSRNUM)        TSAR RECORD NUMBER, SAVED FOR MEMO           
STS2SEQ  DS    XL(L'TS2SEQ)        EXTRA TSAR RECORD SEQUENCE                   
PROFIL2  DS    XL16                PROFILES - PAGE 2                            
         ORG   PROFIL2                                                          
PROFAUTM DS    XL1                 AUTOMATIC MEMO FOR QUERY/HOLD                
PROFEX55 DS    XL1                 EXCLUDE BT55/BT56                            
         ORG   PROFIL2+L'PROFIL2                                                
*                                                                               
STSARTYP DS    XL(L'TSARTYPE)      TSAR RECORD TYPE, SAVED FOR MEMO             
*                                                                               
AGYCURT  DS    XL(CURTABL)         AGENCY CURTAB ENTRY FOR CUREDIT              
FORCURT  DS    XL(CURTABL)         FOREIGN CURTAB ENTRY FOR CUREDIT             
*                                                                               
CDEFCUR  DS    CL(L'CURTCUR)       COUNTRY DEFAULT CURRENCY                     
BANKCUR  DS    CL(L'CURTCUR)       BANK ACCOUNT CURRENCY                        
CURIND1  DS    XL1                 CURRENCY INDICATOR - 1                       
CUR1SINC EQU   X'80'               SINGLE CURRENCY ALLOCATION                   
CUR1ALLC EQU   X'40'               ALL CURRENCIES (ALLOCATE IN AGENCY)          
CUR1BNKC EQU   X'20'               LOCAL CURRENCY BANK ACCOUNT                  
EXACT    DS    CL(L'GEKACT)        EXCHANGE RATE ACCOUNT                        
ATLX     DS    0XL(L'AFCX)         AGENCY TO LOCAL EXCHANGE RATE RULES          
ATLXSTAT DS    XL(L'AFCXSTAT)      EXCHANGE RATE STATUS                         
ATLXSFIX EQU   AFCXSFIX            FIXED EXCHANGE RATE (NOT APPLICABLE)         
ATLXSDIV EQU   AFCXSDIV            DIVIDE BY ATLXRATE                           
ATLXRATE DS    PL(L'AFCXRATE)      LOCAL TO BANK EXCHANGE RATE PWOS             
ATLXSHFT DS    XL(L'AFCXSHFT)      SHIFT VALUE (SRP FORMAT)                     
*                                                                               
SCOLDIS  DS    XL(L'PROFDIS+L'OPTDIS)  CURRENT COLUMNS ON DISPLAY               
SCOLDNO  DS    XL1                 NUMBER OF COLUMNS ON DISPLAY                 
SOPTDIS  DS    XL(OPTDISL)         SAVED DISPLAY OPTION VALUES                  
*                                                                               
DSLISTU  DS    0C                  ** UPPER CASE DICTIONARY **                  
AC8HEADR DS    CL8                                                              
AC3HEADR DS    CL3                                                              
AC8INP   DS    CL8                                                              
AC3INP   DS    CL3                                                              
AC8SPCL  DS    CL8                                                              
AC3SPCL  DS    CL3                                                              
AC8RSR   DS    CL8                                                              
AC3RSR   DS    CL3                                                              
AC8QUIT  DS    CL8                                                              
AC3QUIT  DS    CL3                                                              
AC8UPD   DS    CL8                                                              
AC3UPD   DS    CL3                                                              
AC8DRAFT DS    CL8                                                              
AC3DRAFT DS    CL3                                                              
AC8FLT   DS    CL8                                                              
AC3FLT   DS    CL3                                                              
SCR@PAGE DS    CL8                                                              
SCR@HALF DS    CL8                                                              
SCR@FRST DS    CL8                                                              
SCR@LAST DS    CL8                                                              
OP8SWTCH DS    CL8                                                              
OP3SWTCH DS    CL3                                                              
OP8MARKD DS    CL8                                                              
OP3MARKD DS    CL3                                                              
OP8BAL   DS    CL8                                                              
OP3BAL   DS    CL3                                                              
OP8DATE  DS    CL8                                                              
OP3DATE  DS    CL3                                                              
OP8BILC  DS    CL8                                                              
OP3BILC  DS    CL3                                                              
OP8ACC   DS    CL8                                                              
OP3ACC   DS    CL3                                                              
OP8SRC   DS    CL8                                                              
OP3SRC   DS    CL3                                                              
OP8OFF   DS    CL8                                                              
OP3OFF   DS    CL3                                                              
OP8DSP   DS    CL8                                                              
OP3DSP   DS    CL3                                                              
AC@YES   DS    CL3                                                              
AC@NO    DS    CL3                                                              
AC@UALCX DS    CL3                                                              
AC@WRTF  DS    CL8                                                              
AC@DISS  DS    CL8                                                              
AC@AMT   DS    CL8                                                              
AC@PRINT DS    CL8                                                              
AC@CHKC  DS    CL13                                                             
AC@DATED DS    CL5                                                              
AC@DPSON DS    CL12                                                             
AC@OFFST DS    CL8                                                              
AC@NET   DS    CL3                                                              
AC@GROSS DS    CL3                                                              
AC@ALCTL DS    CL3                                                              
AC@RPLC  DS    CL3                                                              
AC8ALTPF DS    CL8                                                              
AC@XFR   DS    CL8                                                              
AC8SRCE  DS    CL8                                                              
AC@LATE  DS    CL3                                                              
AC@QUERD DS    CL8                                                              
AC@HELD  DS    CL8                                                              
AC@MEMO  DS    CL3                                                              
AC3DUEDT DS    CL3                                                              
OP8CURRY DS    CL8                                                              
SCR@LEFT DS    CL8                                                              
SCR@RGHT DS    CL8                                                              
AC@CLRNG DS    CL8                                                              
AC2CLRNG DS    CL3                                                              
AC@CLI   DS    CL6                                                              
         DS    XL64                N/D                                          
DSLISTUX EQU   *                                                                
*                                                                               
DSLISTL  DS    0C                  ** LOWER CASE DICTIONARY **                  
AC@ACC   DS    CL12                                                             
AC@SRC   DS    CL12                                                             
AC@DATE  DS    CL8                                                              
AC@BIL   DS    CL6                                                              
AC@BILAM DS    CL11                                                             
AC@PRRCR DS    CL11                                                             
AC@ALCTD DS    CL11                                                             
AC@DISSL DS    CL11                                                             
AC@OFFL  DS    CL3                                                              
AC@DUEDT DS    CL9                                                              
*&&UK                                                                           
AC@VATAM DS    CL11                                                             
*&&                                                                             
*&&US                                                                           
AC@GSTAM DS    CL11                                                             
AC@PSTAM DS    CL11                                                             
*&&                                                                             
AC@STT   DS    CL4                                                              
AC@XFRAC DS    CL12                                                             
AC@PFK   DS    CL3                                                              
AC@ALTPF DS    CL6                                                              
AC@HEADR DS    CL8                                                              
AC@INP   DS    CL8                                                              
AC@SPCL  DS    CL8                                                              
AC@RSR   DS    CL8                                                              
AC@QUIT  DS    CL8                                                              
AC@UPD   DS    CL8                                                              
AC@DRAFT DS    CL8                                                              
AC@FLT   DS    CL8                                                              
AC@PAGE  DS    CL8                                                              
AC@HALF  DS    CL8                                                              
AC@FRST  DS    CL8                                                              
AC@LAST  DS    CL8                                                              
AC@NETAM DS    CL11                                                             
AC@SRCE  DS    CL8                                                              
AC@PGDEB DS    CL11                                                             
AC@CURRY DS    CL11                                                             
ACUAMT   DS    CL8                                                              
AC@DFRNC DS    CL11                                                             
AC@TOTLS DS    CL8                                                              
AC@LEFT  DS    CL8                                                              
AC@RGHT  DS    CL8                                                              
         DS    CL200               N/D                                          
DSLISTLX EQU   *                                                                
*                                                                               
SRECCF   DS    0XL2                S(CURRENCY FIELDS)                           
SRECCUCT DS    XL2                 Y(RECCUCTH-RECOLAYH)                         
SRECCUC  DS    XL2                 Y(RECCUCH-RECOLAYH)                          
SRECCUR  DS    XL2                 Y(RECCURH-RECOLAYH)                          
SRECRATT DS    XL2                 Y(RECRATTH-RECOLAYH)                         
SRECRAT  DS    XL2                 Y(RECRATH-RECOLAYH)                          
SRECBCCT DS    XL2                 Y(RECBCCTH-RECOLAYH)                         
SRECBCC  DS    XL2                 Y(RECBCCH-RECOLAYH)                          
SRECBCH  DS    XL2                 Y(RECBCHH-RECOLAYH)                          
SRECCFN  EQU   (*-SRECCF)/L'SRECCF                                              
SRECWACT DS    XL2                 Y(RECWACTH-RECOLAYH)                         
SRECWAC  DS    XL2                 Y(RECWACH-RECOLAYH)                          
SRECVATT DS    XL2                 Y(RECVATTH-RECOLAYH)                         
SRECVAT  DS    XL2                 Y(RECVATH-RECOLAYH)                          
SRECWRFT DS    XL2                 Y(RECWRFTH-RECOLAYH)                         
SRECWRF  DS    XL2                 Y(RECWRFH-RECOLAYH)                          
SRECWDTT DS    XL2                 Y(RECWDTTH-RECOLAYH)                         
SRECWDT  DS    XL2                 Y(RECWDTH-RECOLAYH)                          
SRECWNRT DS    XL2                 Y(RECWNRTH-RECOLAYH)                         
SRECWNR  DS    XL2                 Y(RECWNRH-RECOLAYH)                          
SRECODTT DS    XL2                 Y(RECODTTH-RECOLAYH)                         
SRECODT  DS    XL2                 Y(RECODTH-RECOLAYH)                          
SRECDSCT DS    XL2                 Y(RECDSCTH-RECOLAYH)                         
SRECDSC  DS    XL2                 Y(RECDSCH-RECOLAYH)                          
SRECDAMT DS    XL2                 Y(RECDAMTH-RECOLAYH)                         
SRECDAM  DS    XL2                 Y(RECDAMH-RECOLAYH)                          
*                                                                               
ANYUPDAT DS    XL1                 TRANSACTIONS MARKED 1 OR 0                   
*                                  N/D ADDRESSABLE SAVED STORAGE HERE           
         ORG   SAVED+(1024*4)-1                                                 
SECBLK   DS    XL1024              SECRET BLOCK                                 
         DS    0D                                                               
RECVTAB  DS    XL(RECVLTAB)        RECEIVABLES TABLE                            
USERBLK  DS    XL2048                2K EXTRA STORAGE FOR OVERLAYS              
SAVEDLEN EQU   *-SAVED             SAVEDLEN MUST NOT EXCEED SAVEAREL            
         EJECT                                                                  
APFTABD  DSECT                     ** ACTION PFKEY TABLE **                     
APFTPFK  DS    XL1                 PFKEY NUMBER                                 
         DS    XL1                 N/D                                          
APFTACT  DS    XL(L'ACTION)        CURRENT ACTION NUMBER                        
APFTACT2 DS    XL(L'ACTION)        ACTION NUMBER FOR ACTTABD LOOKUP             
APFTADDR DS    S                   ACTION SCON                                  
APFTADDM DS    S                   ACTION SCON, MIXED CASE                      
APFTABL  EQU   *-APFTABD                                                        
         SPACE 1                                                                
ACTTABD  DSECT                     ** ACTION TABLE **                           
ACTTNUM  DS    XL(L'ACTION)        INTERNAL ACTION NUMBER                       
ACTINIT  EQU   0                   INITIALISATION                               
ACTHEAD  EQU   1                   VALIDATE BATCH HEADER                        
ACTINPT  EQU   2                   INPUT ALLOCATIONS                            
ACTOVER  EQU   3                   INPUT OVERPAYMENTS                           
ACTREST  EQU   4                   RESTORE BATCH HEADER                         
ACTQUIT  EQU   5                   QUIT AND RETURN HEADER                       
ACTUPDT  EQU   6                   UPDATE BATCH                                 
ACTDRFT  EQU   7                   DRAFT JOURNAL (UNFILTERED)                   
ACTFILT  EQU   8                   DRAFT JOURNAL (FILTERED)                     
ACTAPFK  EQU   9                   SHOW ALTERNATE PFKEYS                        
ACTBSRC  EQU   10                  ADD/CHANGE BILLING SOURCE CONTROLS           
ACTALTO  EQU   11                  SHOW ALTERNATE CURRENCY TOTALS               
ACTCHNG  EQU   15                  CHANGE BATCH HEADER                          
ACTLAST  EQU   16                  LAST TIME (AFTER UPDATE)                     
RECDEBT  EQU   1                   DUMMY RECORD DEBTORS FOR SECRET              
ACTQURY  EQU   20                  DUMMY ACTION QUERY FOR SECRET                
ACTHOLD  EQU   21                  DUMMY ACTION HOLD FOR SECRET                 
ACTXFER  EQU   22                  DUMMY ACTION TRANSFER FOR SECRET             
ACTDUED  EQU   23                  DUMMY ACTION DUE DATE FOR SECRET             
ACTCTRA  EQU   24                  DUMMY ACTION CONTRA FOR SECRET               
ACTREPL  EQU   25                  DUMMY ACTION REPLICATE FOR SECRET            
ACTWOFF  EQU   26                  DUMMY ACTION WRITE-OFF FOR SECRET            
ACTALOC  EQU   27                  DUMMY ACTION ALLOCATE FOR SECRET             
ACTCLRNG EQU   28                  DUMMY ACTION CLEARING FOR SECRET             
FLDDSCA  EQU   1                   DSC/SCH/FEE A/C FIELD FOR SECRET             
FLDVWOF  EQU   2                   VAT WRITE-OFF A/C FIELD FOR SECRET           
FLDCODT  EQU   3                   CONTRA'D DATE FIELD FOR SECRET               
FLDCURR  EQU   4                   CURRENCY FIELDS FOR SECRET                   
FLDSRCE  EQU   5                   SOURCE CODES                                 
ACTTIND1 DS    XL1                 ACTION INDICATORS - 1                        
ACTIAUTH EQU   X'F0'               AUTHORISATION BITS                           
ACTIAUT8 EQU   X'80'                                                            
ACTIAUT4 EQU   X'40'                                                            
ACTIAUT2 EQU   X'20'                                                            
ACTIAUT1 EQU   X'10'                                                            
ACTISHDR EQU   X'04'               SAVED BATCH HEADER FOR PF KEY                
ACTIXSET EQU   X'02'               DON'T SET ACTION IF PFKEY ENTERED            
ACTINALL EQU   X'01'               DON'T ALLOW ACTION IF TWA2NALL SET           
ACTTIND2 DS    XL1                 ACTION INDICATORS - 2                        
ACTISINC EQU   X'80'               SINGLE CURRENCY ACTION                       
ACTISECY EQU   X'40'               CALL SECRET FOR SECURITY TEST                
ACTTIND3 DS    XL1                 ACTION INDICATORS - 3                        
ACTTACT  DS    S                   ACTION SCON                                  
ACTLGNLQ EQU   8                   LONG ACTION NAME MAX LENGTH                  
ACTTACSH DS    S                   SHORT ACTION SCON                            
ACTSHTLQ EQU   3                   SHORT ACTION NAME MAX LENGTH                 
ACTTABL  EQU   *-ACTTABD                                                        
         SPACE 1                                                                
SPFTABD  DSECT                     ** SCROLL PFKEY TABLE **                     
SPFTPFK  DS    XL1                 PFKEY NUMBER                                 
SPFTUPDN DS    CL(L'SCRUPDN)       SCROLL DIRECTION                             
         DS    XL2                 N/D                                          
SPFTADDR DS    S                   SCROLL SCON                                  
SPFTADDM DS    S                   SCROLL SCON, MIXED CASE                      
SPFTABL  EQU   *-SPFTABD                                                        
         SPACE 1                                                                
SCRTABD  DSECT                     ** SCROLL KEYWORD TABLE **                   
SCRTSCR  DS    S                   SCROLL SCON                                  
SCRTAMT  DS    XL(L'SCROLL)        SCROLL AMOUNT                                
SCRTUPDN DS    CL(L'SCRUPDN)       SCROLL OVERRIDE DIRECTION                    
SCRTIND1 DS    XL1                 SCROLL INDICATOR - 1                         
SCRTIHRZ EQU   X'80'               HORIZONTAL SCROLL IN PROGRESS                
SCRTABL  EQU   *-SCRTABD                                                        
         SPACE 1                                                                
LOCTABD  DSECT                     ** LOCATE KEYWORD TABLE **                   
LOCLOC   DS    S                   LOCATE SCON                                  
LOCLOSH  DS    S                   SHORT LOCATE SCON                            
LOCADDR  DS    S                   ROUTINE SCON                                 
LOCRHMAX DS    XL1                 MAXIMUM RHS LENGTH                           
         DS    XL1                 N/D (DO NOT REMOVE)                          
LOCTABL  EQU   *-LOCTABD                                                        
         SPACE 1                                                                
TOTTABD  DSECT                     ** TOTALS SEQUENCE CONTROL TABLE **          
TOTMASK  DS    XL1                 MASK VALUE (SEE PROFTOT EQUATES)             
TOTADDR  DS    XL1                 DISPLACEMENT TO DISPLAY DISPLACEMENT         
TOTTABL  EQU   *-TOTTABD                                                        
         EJECT                                                                  
OPTTABD  DSECT                     ** OPTION KEYWORD TABLE **                   
OPTOPT   DS    S                   OPTION SCON                                  
OPTLONG  EQU   8                   LONG KEYWORD MAX                             
OPTOPSH  DS    S                   SHORT OPTION SCON                            
OPTSHRT  EQU   3                   SHORT KEYWORD MAX                            
OPTADDR  DS    S                   A(FIELD DISP) OR ROUTINE SCON                
OPTIND   DS    XL1                                                              
OPTI1PT  EQU   X'01'               OPTION VALUE FIXED                           
OPTI2PT  EQU   X'02'               OPTION HAS FILTER VALUE ON RIGHT             
OPTINOT  EQU   X'04'               OPTION CAN BE PRECEDED WITH NOT              
OPTISWT  EQU   X'08'               SWITCH OPTION MEANS ALLOCATE                 
OPTRMAX  DS    XL1                 RHS MAXIMUM FOR TWO-PART OPTIONS             
OPTTABL  EQU   *-OPTTABD                                                        
         SPACE 1                                                                
KEYTABD  DSECT                     ** KEY TABLE **                              
KEYMASK  DS    XL1                 KEY MASK VALUE                               
KEYLEN   DS    XL1                 KEY ELEMENT LENGTH                           
KEYTABL  EQU   *-KEYTABD                                                        
         SPACE 1                                                                
DISTABD  DSECT                     ** DISPLAY LINE TABLE **                     
DISMASK  DS    XL5                 DISPLAY MASK VALUE                           
DISLEN   DS    XL1                 DISPLAY ELEMENT LENGTH                       
DISTLEN  DS    XL1                 DISPLAY L'TEXT IF < DISLEN                   
DISTIND  DS    XL1                 DISPLAY TEXT INDICATOR                       
DISTICUR EQU   X'80'               COLUMN IS A CURRENCY VALUE                   
DISADR1  DS    S                   SCON FOR DISPLAY HEADER TEXT 1               
DISADR2  DS    S                   SCON FOR DISPLAY HEADER TEXT 2               
DISTABL  EQU   *-DISTABD                                                        
         SPACE 1                                                                
RECVTABD DSECT                     ** RECEIVABLES TABLE **                      
RECVTEOT EQU   255                 END OF TABLE INDICATOR                       
RECVNDX  DS    XL1                 INDEX NUMBER                                 
RECVACT  DS    CL(L'ACTKCULA)      ACCOUNT CPY/UNIT/LEDGER/ACCOUNT              
RECVACTN DS    CL(L'NAMEREC)       ACCOUNT NAME                                 
RECVOFFC DS    CL(L'TRNOFFC)       ACCOUNT OFFICE CODE                          
RECVTOT  DS    PL8                 OFFSET TOTALS PER RCV ACCOUNT                
RECVPCPV DS    0X                  PRODUCTION VALUES                            
RECVPCP  DS    CL(L'ACTKCULA)      PRODUCTION CLIENT/PRODUCT                    
RECVPCPN DS    CL(L'NAMEREC)       PRODUCTION CLIENT/PRODUCT NAME               
RECVCOST DS    CL(L'ACTKCULA-1)    PRODUCTION COSTING ACCOUNT                   
RECVPCPL EQU   *-RECVPCPV                                                       
RECVTABL EQU   *-RECVTABD                                                       
RECVMAXN EQU   30                  MAXIMUM N'RECEIVABLE ACCOUNTS                
RECVLTAB EQU   (RECVTABL*RECVMAXN)+1                                            
         SPACE 1                                                                
SCANOUTD DSECT                     ** SCANNER BLOCK ENTRY **                    
SCANLEN1 DS    XL1                 L'FIELD (1ST PART IF 2-PART)                 
SCANLEN2 DS    XL1                 L'2ND PART OF 2-PART OPTION                  
SCANIND1 DS    XL1                 VALIDITY BITS 1ST PART                       
SCANIND2 DS    XL1                 VALIDITY BITS 2ND PART                       
SCANBIN1 DS    CL4                 BINARY VALUE OF NUMERIC 1ST PART             
SCANBIN2 DS    CL4                 BINARY VALUE OF NUMERIC 2ND PART             
SCANTXT1 DS    CL10                1ST PART TEXT/DATA                           
SCANTXT2 DS    CL15                2ND PART TEXT/DATA                           
SCANOUTL EQU   *-SCANOUTD          SCANNER ENTRY LENGTH                         
SCANMAXN EQU   30                  MAXIMUM N'SCANNER LINES                      
SCANLTAB EQU   (SCANOUTL*SCANMAXN)                                              
         EJECT                                                                  
LEDGTABD DSECT                     ** LEDGER TABLE **                           
LEDGTUL  DS    CL2                 UNIT/LEDGER CODE                             
LEDGTTYP DS    CL(L'LDGTYPE)       LEDGER TYPE                                  
LEDGTLIK DS    CL(L'LDGLIKE)       LEDGER IS LIKE                               
LEDGTOFF DS    XL(L'LDGOPOS)       OFFICE POSITION                              
LEDGTCLO DS    XL(L'LDGCLOS)       LEDGER CLOSE-OUT TYPE                        
LEDGTLVA DS    XL(L'ACLVLEN)       LEVEL A LENGTH                               
LEDGTLVB DS    XL(L'ACLVLEN)       LEVEL B LENGTH (OR ZERO)                     
LEDGTLVC DS    XL(L'ACLVLEN)       LEVEL C LENGTH (OR ZERO)                     
LEDGTLVD DS    XL(L'ACLVLEN)       LEVEL D LENGTH (OR ZERO)                     
LEDGTSEC DS    XL1                 SECURITY NUMBER                              
LEDGTDDL DS    XL1                 DISPLACEMENT/LENGTH OF DEPARTMENT            
LEDGTABL EQU   *-LEDGTABD                                                       
LEDGMAXN EQU   10                  MAXIMUM NUMER OF TABLE ENTRIES               
LEDGLTAB EQU   (LEDGTABL*LEDGMAXN)                                              
         SPACE 1                                                                
DISLINED DSECT                     ** DISPLAY LINE **                           
DISLHDR1 DS    XL(L'FVIHDR)        DESCRIPTION HEADER                           
DISLLINE DS    CL(L'RECLIN)        LINE DESCRIPTION (DYNAMIC)                   
DISLHDR2 DS    XL(L'FVIHDR)        AMOUNT HEADER                                
DISLAMNT DS    0CL(L'RECLAMT)      AMOUNT FIELD                                 
DISLMARK DS    CL1                 POSTING MARKER                               
DISLMPPD EQU   C'*'                PART PAID INDICATOR                          
DISLPOST DS    CL(L'RECLAMT-1)     POSTING AMOUNT                               
DISLINEL EQU   *-DISLINED                                                       
         SPACE 1                                                                
OVRLINED DSECT                     ** OVERPAYMENTS DISPLAY LINE **              
OVRLACTH DS    XL(L'FVIHDR)        RECEIVABLE ACCOUNT HEADER                    
OVRLACT  DS    CL(L'ROVACC)        RECEIVABLE ACCOUNT                           
OVRLCACH DS    XL(L'FVIHDR)        BILLING SOURCE HEADER                        
OVRLCAC  DS    CL(L'ROVSRC)        BILLING SOURCE                               
OVRLBILH DS    XL(L'FVIHDR)        BILL NUMBER HEADER                           
OVRLBIL  DS    CL(L'ROVBIL)        BILL NUMBER                                  
OVRLDATH DS    XL(L'FVIHDR)        BILL DATE HEADER                             
OVRLDAT  DS    CL(L'ROVDAT)        BILL DATE                                    
OVRLOFFH DS    XL(L'FVIHDR)        OFFICE HEADER                                
OVRLOFF  DS    CL(L'ROVOFF)        OFFICE                                       
OVRLAMTH DS    XL(L'FVIHDR)        AMOUNT HEADER                                
OVRLAMT  DS    CL(L'ROVAMT)        AMOUNT                                       
OVRLINEL EQU   *-OVRLINED                                                       
         SPACE 1                                                                
CTRYTABD DSECT                     ** COUNTRY TABLE **                          
CTRYTNUM DS    XL1                 AGENCY COUNTRY CODE                          
CTRYTDEB DS    XL1                 DEBTORS OVERLAY TYPE                         
CTRYTHDR DS    XL1                 HEADER SCREEN OVERLAY NUMBER                 
CTRYTOVR DS    XL1                 COUNTRY APPLICATION OVERLAY                  
CTRYDCUR DS    XL(L'CURTCUR)       COUNTRY DEFAULT CURRENCY                     
CTRYPROF DS    0X                  DEFAULT PROFILE VALUES                       
CTRYPRSS DS    XL(L'PROFSEQ)       SINGLE ACCOUNT KEY SEQUENCE                  
CTRYPRSD DS    XL(L'PROFDIS)       SINGLE ACCOUNT DISPLAY VALUES                
CTRYPRMS DS    XL(L'PROFSEQ)       MULTI ACCOUNT KEY SEQUENCE                   
CTRYPRMD DS    XL(L'PROFDIS)       MULTI ACCOUNT DISPLAY VALUES                 
CTRYPRTC DS    XL(L'PROFTOT)       TOTALS DISPLAY CONTROL                       
CTRYTABL EQU   *-CTRYTABD                                                       
         EJECT                                                                  
JRNLINED DSECT                     ** JOURNAL PRINT LINE **                     
JRNACT   DS    CL(L'TRNKCULA-1)    ACCOUNT                                      
         DS    CL1                                                              
JRNCAC   DS    CL(L'TRNKCULA-1)    CONTRA-ACCOUNT                               
         DS    CL2                                                              
JRNOFFC  DS    CL(L'TRNOFFC)       OFFICE CODE                                  
         DS    CL2                                                              
JRNDATE  DS    CL8                 TRANSACTION DATE                             
         DS    CL1                                                              
JRNREF   DS    CL(L'TRNKREF)       REFERENCE NUMBER                             
         DS    CL1                                                              
JRNSTAT1 DS    CL1                 STATUS BYTE 1                                
JRNSTAT2 DS    CL1                 STATUS BYTE 2                                
JRNSTAT3 DS    CL1                 STATUS BYTE 3                                
         DS    CL1                                                              
JRNDR    DS    CL12                DEBIT AMOUNT                                 
         DS    CL1                                                              
JRNCR    DS    CL12                CREDIT AMOUNT                                
JRNMSGL  EQU   *-JRNDATE           WARNING MESSAGE LENGTH                       
         DS    CL1                                                              
JRNDR2   DS    CL13                DEBIT AMOUNT (CURRENCY)                      
         DS    CL1                                                              
JRNCR2   DS    CL13                CREDIT AMOUNT (CURRENCY)                     
JRNMSG2L EQU   *-JRNDATE           WARNING MESSAGE LENGTH (CURRENCY)            
         EJECT                                                                  
       ++INCLUDE FATWA                                                          
         ORG   TWAUSER                                                          
TWAMODE  DS    XL1                 CONTROL MODE INDICATORS                      
TWAMFRST EQU   X'00'               FIRST TIME                                   
TWAMINIT EQU   X'01'               INITIALISED                                  
TWAMDRFT EQU   X'02'               DRAFT UPDATE (ONLINE JOURNAL)                
TWAMALTP EQU   X'04'               DISPLAY ALTERNATE PF KEYS                    
TWAMHDRS EQU   X'08'               VALID BATCH HEADER SAVED                     
TWAMSETP EQU   X'10'               SET DEFAULT PF KEY ON EXIT                   
TWAMCFRM EQU   X'20'               CONFIRMATION OVERLAY LOADED                  
TWAMDOIT EQU   X'40'               ACTION CONFIRMED BY USER                     
TWAMRSRV EQU   X'80'               TEMPEST RESERVE ISSUED                       
TWANXTPF DS    XL1                 NEXT TIME DEFAULT PF KEY                     
TWASCROV DS    XL1                 SCREEN NUMBER                                
TWASCRIN EQU   X'FE'               INPUT SCREEN                                 
TWASCROP EQU   X'FD'               OVERPAYMENT SCREEN                           
TWASCRTP EQU   X'FC'               TOTALS & PFKEY LINES                         
TWASCRCA EQU   X'FB'               CONFIRM ACTION LINES                         
TWASCRBS EQU   X'FA'               BILLING SOURCE MAINTENANCE                   
TWASCRMM EQU   X'F9'               TRANSACTION MEMO MAINTENANCE                 
TWASCRBH DS    XL1                 HEADER SCREEN NUMBER                         
TWASCRSV DS    XL1                 SAVED SCREEN NUMBER                          
TWAUTLSV DS    XL10                UTL SCREEN MAP (FOR HEADER SWAP)             
TWATSARI DS    XL1                 SAVED TSAR INDICATORS                        
TWALOWPG DS    XL1                 SAVED TSPAGL VALUE                           
TWANUMPG DS    XL1                 SAVED TSPAGN VALUE                           
TWAOFFSV DS    XL(OFFASAVL)        SAVED OFFAL VALUES                           
TWACOLS  EQU   80                  TWA COLUMNS                                  
TWAROWS  EQU   24                  TWA ROWS                                     
TWAMODE2 DS    XL1                 CONTROL MODE INDICATORS, BYTE 2              
TWA2NALL EQU   X'80'               ALLOCATION NOT ALLOWED                       
TWA2BSRC EQU   X'40'               BILLING SOURCE SCREEN LOADED                 
TWA2MEMO EQU   X'20'               TRANSACTION MEMO SCREEN LOADED               
TWA2ALTO EQU   X'10'               ALTERNATIVE (CURRENCY) TOTALS                
TWA2NCUR EQU   X'08'               CURRENCY NOT VALID FOR THIS USER             
TWASRCLI DS    XL1                 POSITION OF CLIENT IN SR KEY (1-9)           
TWASCRSS DS    XL1                 SAVED SCREEN BEFORE SOURCE/MEMO              
TWAMODE3 DS    XL1                 CONTROL MODE INDICATORS, BYTE 3              
TWAPASS# DS    XL2                 PASSWORD NUMBER                              
         ORG   TWAD+64                                                          
       ++INCLUDE ACRECFFD                                                       
         ORG   RECOLAYH                                                         
       ++INCLUDE ACRECFED                                                       
         ORG   RECOLAYH                                                         
       ++INCLUDE ACRECFDD                                                       
         ORG   RECOLAYH                                                         
       ++INCLUDE ACRECFAD                                                       
         ORG   RECOLAYH                                                         
       ++INCLUDE ACRECF9D                                                       
         ORG   TWAD+(1024*3)                                                    
SAVHEADL EQU   *-RECOLAYH          SAVE HEADER FROM RECOLAYH-*                  
SAVEAREL EQU   (1024*11)           LENGTH OF SAVED STORAGE AREA (11K)           
SAVEAREA DS    XL(SAVEAREL)        11K SAVE AREA                                
         SPACE 1                                                                
TWACFRMD DSECT                     ** CONFIRMATION SCREEN LAYOUT **             
       ++INCLUDE ACRECFBD                                                       
