*          DATA SET ACSCRF2D   AT LEVEL 010 AS OF 07/23/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60CF2D      DATE 07/23/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  L  P H             T        Y              
PAYCDEH  DS    XL8                                                              
PAYCDE   DS    CL8      4   10    8  A  U N             T        Y              
PAYNMH   DS    XL8                                                              
PAYNM    DS    CL4      4   20    4  L  P N             T        Y              
PAYNMEH  DS    XL8                                                              
PAYNME   DS    CL36     4   25   36  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      4   63    6  L  P N             T        Y              
PAYOWNH  DS    XL8                                                              
PAYOWN   DS    CL8      4   70    8  A  P H             T        Y              
PAYBGNH  DS    XL8                                                              
PAYBGN   DS    CL32     6    2   32  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      7    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32     7    6   32  L  P N             T        Y              
PAYTYPEH DS    XL8                                                              
PAYTYPE  DS    CL40     7   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
PAYPA02H DS    XL8                                                              
PAYPA02  DS    CL32     8    6   32  L  P N             T        Y              
PAYACCTH DS    XL8                                                              
PAYACCT  DS    CL40     8   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32     9    6   32  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9   39    3  A  P N             T        Y              
PAYF1H   DS    XL8                                                              
PAYF1    DS    CL2      9   43    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      9   47    3  A  P N             T        Y              
PAYF2H   DS    XL8                                                              
PAYF2    DS    CL2      9   51    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      9   55    3  A  P N             T        Y              
PAYF3H   DS    XL8                                                              
PAYF3    DS    CL2      9   59    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      9   63    3  A  P N             T        Y              
PAYF4H   DS    XL8                                                              
PAYF4    DS    CL2      9   67    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      9   71    3  A  P N             T        Y              
PAYF5H   DS    XL8                                                              
PAYF5    DS    CL2      9   75    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    10    6   32  L  P N             T        Y              
PAYCLIH  DS    XL8                                                              
PAYCLI   DS    CL40    10   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    11    6   32  L  P N             T        Y              
PAYOFFH  DS    XL8                                                              
PAYOFF   DS    CL40    11   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    12    6   32  L  P N             T        Y              
PAYITTYH DS    XL8                                                              
PAYITTY  DS    CL40    12   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  P N             T        Y              
PAYPA08H DS    XL8                                                              
PAYPA08  DS    CL32    14    6   32  L  P N             T        Y              
PAYAPRVH DS    XL8                                                              
PAYAPRV  DS    CL1     14   39    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     14   41    3  A  P N             T        Y              
PAYPA09H DS    XL8                                                              
PAYPA09  DS    CL32    14   45   32  L  P N             T        Y              
PAYCR$H  DS    XL8                                                              
PAYCR$   DS    CL1     14   78    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  P N             T        Y              
PAYPA10H DS    XL8                                                              
PAYPA10  DS    CL32    15    6   32  L  P N             T        Y              
PAYHELDH DS    XL8                                                              
PAYHELD  DS    CL1     15   39    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     15   41    3  A  P N             T        Y              
PAYPA11H DS    XL8                                                              
PAYPA11  DS    CL32    15   45   32  L  P N             T        Y              
PAYCD$H  DS    XL8                                                              
PAYCD$   DS    CL1     15   78    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  P N             T        Y              
PAYPA12H DS    XL8                                                              
PAYPA12  DS    CL32    16    6   32  L  P N             T        Y              
PAYOFFSH DS    XL8                                                              
PAYOFFS  DS    CL1     16   39    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     16   41    3  A  P N             T        Y              
PAYPA13H DS    XL8                                                              
PAYPA13  DS    CL32    16   45   32  L  P N             T        Y              
PAYLOCKH DS    XL8                                                              
PAYLOCK  DS    CL1     16   78    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  P N             T        Y              
PAYPA14H DS    XL8                                                              
PAYPA14  DS    CL32    17    6   32  L  P N             T        Y              
PAYRVRSH DS    XL8                                                              
PAYRVRS  DS    CL1     17   39    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     17   41    3  A  P N             T        Y              
PAYPA15H DS    XL8                                                              
PAYPA15  DS    CL32    17   45   32  L  P N             T        Y              
PAYVNDRH DS    XL8                                                              
PAYVNDR  DS    CL1     17   78    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  P N             T        Y              
PAYPA16H DS    XL8                                                              
PAYPA16  DS    CL32    18    6   32  L  P N             T        Y              
PAYDRFTH DS    XL8                                                              
PAYDRFT  DS    CL1     18   39    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     18   41    3  A  P N             T        Y              
PAYPA17H DS    XL8                                                              
PAYPA17  DS    CL32    18   45   32  L  P N             T        Y              
PAYCSHDH DS    XL8                                                              
PAYCSHD  DS    CL1     18   78    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  P N             T        Y              
PAYPA18H DS    XL8                                                              
PAYPA18  DS    CL32    19    6   32  L  P N             T        Y              
PAYURGNH DS    XL8                                                              
PAYURGN  DS    CL1     19   39    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     19   41    3  A  P N             T        Y              
PAYPA19H DS    XL8                                                              
PAYPA19  DS    CL32    19   45   32  L  P N             T        Y              
PAYXJOBH DS    XL8                                                              
PAYXJOB  DS    CL1     19   78    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  P N             T        Y              
PAYPA20H DS    XL8                                                              
PAYPA20  DS    CL32    20    6   32  L  P N             T        Y              
PAYZTRNH DS    XL8                                                              
PAYZTRN  DS    CL1     20   39    1  A  U H             T        Y              
PAYTABH  DS    XL8                                                              
PAYTAB   DS    CL1     21    9    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL78    23    2   78  L  P H             T        Y  254         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL77    24    3   77  L  P H             T        Y  254         
         DS    XL8                                                              
PAYLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
PAYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1792 BYTES                            
