*          DATA SET ACSCRE7D   AT LEVEL 012 AS OF 04/01/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60CE7D      DATE 04/01/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
STOCDEH  DS    CL8                                                              
STOCDE   DS    CL3      4    2    3  A  U N             T        Y              
STOKEYH  DS    CL8                                                              
STOKEY   DS    CL72     4    6   72  A  U N             T        Y              
STOTABH  DS    CL8                                                              
STOTAB   DS    CL1      4   79    1  A  U N             T        Y              
STORECH  DS    CL8                                                              
STOREC   DS    CL79     5    2   79  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL79     6    2   79  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL79     7    2   79  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL79     8    2   79  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL79     9    2   79  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL79    10    2   79  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL79    11    2   79  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL79    12    2   79  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL79    13    2   79  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL79    14    2   79  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL79    15    2   79  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL79    16    2   79  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL79    17    2   79  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL79    18    2   79  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL79    19    2   79  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL79    20    2   79  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL79    21    2   79  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL79    22    2   79  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL79    23    2   79  L  U N             T        Y              
STOLSTH  DS    CL8                                                              
STOLST   DS    CL78    24    2   78  L  U N             T        Y              
STOLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
STOWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1848 BYTES                            
