*          DATA SET ACSCRFAD   AT LEVEL 008 AS OF 10/13/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60CFAD      DATE 10/13/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      4    2    6  L  P H             T        Y              
PRFCODEH DS    CL8                                                              
PRFCODE  DS    CL8      4   10    8  A  U N             T        Y              
PRFNMH   DS    CL8                                                              
PRFNM    DS    CL4      4   20    4  L  P N             T        Y              
PRFNMEH  DS    CL8                                                              
PRFNME   DS    CL36     4   25   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      4   63    6  L  P N             T        Y              
PRFOWNH  DS    CL8                                                              
PRFOWN   DS    CL8      4   70    8  A  P H             T        Y              
PRFBGNH  DS    CL8                                                              
PRFBGN   DS    CL13     6    2   13  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL5      6   37    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32     7    6   32  L  P N             T        Y              
PRFLFJTH DS    CL8                                                              
PRFLFJT  DS    CL1      7   39    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      7   41    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32     7   45   32  L  P N             T        Y              
PRFRTOTH DS    CL8                                                              
PRFRTOT  DS    CL1      7   78    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32     8    6   32  L  P N             T        Y              
PRFBOXH  DS    CL8                                                              
PRFBOX   DS    CL1      8   39    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      8   41    3  A  P N             T        Y              
PRFPO04H DS    CL8                                                              
PRFPO04  DS    CL32     8   45   32  L  P N             T        Y              
PRFRDATH DS    CL8                                                              
PRFRDAT  DS    CL1      8   78    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32     9    6   32  L  P N             T        Y              
PRFIACTH DS    CL8                                                              
PRFIACT  DS    CL1      9   39    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      9   41    3  L  P N             T        Y              
PRFPO06H DS    CL8                                                              
PRFPO06  DS    CL32     9   45   32  L  P N             T        Y              
PRFPCMAH DS    CL8                                                              
PRFPCMA  DS    CL1      9   78    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    10    6   32  L  P N             T        Y              
PRFPZAMH DS    CL8                                                              
PRFPZAM  DS    CL1     10   39    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     10   41    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    10   45   32  L  P N             T        Y              
PRFPZTOH DS    CL8                                                              
PRFPZTO  DS    CL1     10   78    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    11    6   32  L  P N             T        Y              
PRFPMINH DS    CL8                                                              
PRFPMIN  DS    CL1     11   39    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     11   41    3  A  P N             T        Y              
PRFPO10H DS    CL8                                                              
PRFPO10  DS    CL32    11   45   32  L  P N             T        Y              
PRFPPAPH DS    CL8                                                              
PRFPPAP  DS    CL1     11   78    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  P N             T        Y              
PRFPO11H DS    CL8                                                              
PRFPO11  DS    CL32    12    6   32  L  P N             T        Y              
PRFPUPPH DS    CL8                                                              
PRFPUPP  DS    CL1     12   39    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     12   41    3  A  P N             T        Y              
PRFPO12H DS    CL8                                                              
PRFPO12  DS    CL32    12   45   32  L  P N             T        Y              
PRFPEXPH DS    CL8                                                              
PRFPEXP  DS    CL1     12   78    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  P N             T        Y              
PRFPO13H DS    CL8                                                              
PRFPO13  DS    CL32    13    6   32  L  P N             T        Y              
PRFPBXOH DS    CL8                                                              
PRFPBXO  DS    CL1     13   39    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     13   41    3  A  P N             T        Y              
PRFPO14H DS    CL8                                                              
PRFPO14  DS    CL32    13   45   32  L  P N             T        Y              
PRFPRQTH DS    CL8                                                              
PRFPRQT  DS    CL1     13   78    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  P N             T        Y              
PRFPO17H DS    CL8                                                              
PRFPO17  DS    CL32    14    6   32  L  P N             T        Y              
PRFPERRH DS    CL8                                                              
PRFPERR  DS    CL1     14   39    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     14   41    3  A  P N             T        Y              
PRFPO18H DS    CL8                                                              
PRFPO18  DS    CL32    14   45   32  L  P N             T        Y              
PRFPUDTH DS    CL8                                                              
PRFPUDT  DS    CL1     14   78    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  P N             T        Y              
PRFPR19H DS    CL8                                                              
PRFPR19  DS    CL32    15    6   32  L  P N             T        Y              
PRFPNALH DS    CL8                                                              
PRFPNAL  DS    CL1     15   39    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     15   41    3  A  P N             T        Y              
PRFPO28H DS    CL8                                                              
PRFPO28  DS    CL32    15   45   32  L  P N             T        Y              
PRFPCHDH DS    CL8                                                              
PRFPCHD  DS    CL1     15   78    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     16   41    3  A  P N             T        Y              
PRFPT24H DS    CL8                                                              
PRFPT24  DS    CL27    16   45   27  L  P N             T        Y              
PRFPTCHH DS    CL8                                                              
PRFPTCH  DS    CL6     16   73    6  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL32    17    2   32  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    18    6   32  L  P N             T        Y              
PRFRNDH  DS    CL8                                                              
PRFRND   DS    CL1     18   39    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     18   41    3  A  P N             T        Y              
PRFRO02H DS    CL8                                                              
PRFRO02  DS    CL32    18   45   32  L  P N             T        Y              
PRFPCTSH DS    CL8                                                              
PRFPCTS  DS    CL1     18   78    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL32    20    2   32  A  P H             T        Y              
PRFRK01H DS    CL8                                                              
PRFRK01  DS    CL15    21    2   15  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   18    1  A  P N             T        Y              
PRFRKONH DS    CL8                                                              
PRFRKON  DS    CL2     21   20    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL2     21   23    2  A  P N             T        Y              
PRFRK02H DS    CL8                                                              
PRFRK02  DS    CL10    21   26   10  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   37    1  L  P N             T        Y              
PRFRKCLH DS    CL8                                                              
PRFRKCL  DS    CL2     21   39    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL2     21   42    2  A  P N             T        Y              
PRFRK03H DS    CL8                                                              
PRFRK03  DS    CL20    21   45   20  L  P N             T        Y              
PRFRKORH DS    CL8                                                              
PRFRKOR  DS    CL1     21   66    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL5     21   69    5  L  P N             T        Y              
PRFTABH  DS    CL8                                                              
PRFTAB   DS    CL1     22    9    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  L  P H             T        Y  254         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL77    24    3   77  L  P H             T        Y  254         
         DS    CL8                                                              
PRFLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
PRFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1840 BYTES                            
