*          DATA SET ACSCRE8D   AT LEVEL 004 AS OF 11/05/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60CE8D      DATE 11/05/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      4    2    6  L  P H             T        Y              
REQRUNH  DS    CL8                                                              
REQRUN   DS    CL8      4   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      4   20    6  L  P N             T        Y              
REQOTYPH DS    CL8                                                              
REQOTYP  DS    CL8      4   27    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     4   37   11  L  P N             T        Y              
REQDESH  DS    CL8                                                              
REQDES   DS    CL8      4   49    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     4   63   11  L  P N             T        Y              
REQOPT2H DS    CL8                                                              
REQOPT2  DS    CL1      4   75    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     5    2   16  L  P H             T        Y              
REQPERH  DS    CL8                                                              
REQPER   DS    CL16     5   20   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     6    2   16  L  P H             T        Y              
REQFMTH  DS    CL8                                                              
REQFMT   DS    CL8      6   20    8  A  U N             T        Y              
REQFMTNH DS    CL8                                                              
REQFMTN  DS    CL36     6   37   36  L  P H             T        Y              
REQTAGH  DS    CL8                                                              
REQTAG   DS    CL1      6   79    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  L  P H             T        Y  254         
         DS    CL8                                                              
REQLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
REQWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 368  BYTES                            
