*          DATA SET ACSCRD1D   AT LEVEL 005 AS OF 02/27/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60CD1D      DATE 02/27/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  L  P H             T        Y              
PRPCODEH DS    XL8                                                              
PRPCODE  DS    CL8      4   10    8  A  U N             T        Y              
PRPNMH   DS    XL8                                                              
PRPNM    DS    CL4      4   20    4  L  P N             T        Y              
PRPNMEH  DS    XL8                                                              
PRPNME   DS    CL36     4   25   36  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      4   63    6  L  P N             T        Y              
PRPOWNH  DS    XL8                                                              
PRPOWN   DS    CL8      4   70    8  A  P H             T        Y              
PRPNUMDH DS    XL8                                                              
PRPNUMD  DS    CL17     6    2   17  L  P H             T        Y              
PRPNUMH  DS    XL8                                                              
PRPNUM   DS    CL2      6   20    2  A  U N             T        Y              
PRPRNGDH DS    XL8                                                              
PRPRNGD  DS    CL10     6   41   10  L  P H             T        Y              
PRPRNGH  DS    XL8                                                              
PRPRNG   DS    CL4      6   52    4  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL12     7    2   12  L  P H             T        Y              
PRPKYWH  DS    XL8                                                              
PRPKYW   DS    CL12     7   20   12  A  P N             T        Y              
PRPTAGH  DS    XL8                                                              
PRPTAG   DS    CL1      7   78    1  A  P N             T        Y              
PRPENDH  DS    XL8                                                              
PRPEND   DS    CL1     22   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    23    2   78  L  P H             T        Y  254         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL77    24    3   77  L  P H             T        Y  254         
         DS    XL8                                                              
PRPLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
PRPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 432  BYTES                            
