*          DATA SET ACSCRFCD   AT LEVEL 005 AS OF 03/26/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60CFCD      DATE 03/26/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      4    2    6  L  P H             T        Y              
ROWCODEH DS    CL8                                                              
ROWCODE  DS    CL8      4   10    8  A  U N             T        Y              
ROWNMH   DS    CL8                                                              
ROWNM    DS    CL4      4   20    4  L  P N             T        Y              
ROWNMEH  DS    CL8                                                              
ROWNME   DS    CL36     4   25   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      4   63    6  L  P N             T        Y              
ROWOWNH  DS    CL8                                                              
ROWOWN   DS    CL8      4   70    8  A  P H             T        Y              
ROWBGNH  DS    CL8                                                              
ROWBGN   DS    CL5      6   28    5  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL1      6   36    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      7    9    4  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      7   22    4  L  P H             T        Y              
ROW008H  DS    CL8                                                              
ROW008   DS    CL7      7   27    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL10     7   36   10  L  P H             T        Y              
ROWFRSTH DS    CL8                                                              
ROWFRST  DS    CL3      8    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL12     8    9   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8   24    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14     8   36   14  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL12     9    9   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      9   24    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      9   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14     9   36   14  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL12    10    9   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   24    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    10   36   14  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL12    11    9   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   24    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    11   36   14  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL12    12    9   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   24    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    12   36   14  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL12    13    9   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   24    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    13   36   14  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL12    14    9   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   24    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    14   36   14  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL12    15    9   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   24    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    15   36   14  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL12    16    9   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   24    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    16   36   14  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL12    17    9   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   24    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    17   36   14  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL12    18    9   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   24    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    18   36   14  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL12    19    9   12  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   24    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   30    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL14    19   36   14  L  U N             T        Y              
ROWTABH  DS    CL8                                                              
ROWTAB   DS    CL1     20    9    1  A  P N             T        Y              
ROW020H  DS    CL8                                                              
ROW020   DS    CL28    21    3   28  L  P H             T        Y              
ROWRPGH  DS    CL8                                                              
ROWRPG   DS    CL2     21   33    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  L  P H             T        Y  254         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL77    24    3   77  L  P H             T        Y  254         
         DS    CL8                                                              
ROWLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
ROWWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1304 BYTES                            
