*          DATA SET ACSCREBD   AT LEVEL 004 AS OF 06/25/19                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60CEBD      DATE 06/25/19                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  L  P H             T        Y              
CSTCODEH DS    XL8                                                              
CSTCODE  DS    CL8      4   10    8  A  U N             T        Y              
CSTNMH   DS    XL8                                                              
CSTNM    DS    CL4      4   20    4  L  P N             T        Y              
CSTNMEH  DS    XL8                                                              
CSTNME   DS    CL36     4   25   36  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      4   63    6  L  P N             T        Y              
CSTOWNH  DS    XL8                                                              
CSTOWN   DS    CL8      4   70    8  A  P H             T        Y              
CSTBGNH  DS    XL8                                                              
CSTBGN   DS    CL32     6    2   32  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      7    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32     7    6   32  L  P N             T        Y              
CSTTYPEH DS    XL8                                                              
CSTTYPE  DS    CL15     7   39   15  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
CSTRC02H DS    XL8                                                              
CSTRC02  DS    CL32     8    6   32  L  P N             T        Y              
CSTACCTH DS    XL8                                                              
CSTACCT  DS    CL40     8   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32     9    6   32  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9   39    3  A  P N             T        Y              
CSTF1H   DS    XL8                                                              
CSTF1    DS    CL2      9   43    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      9   47    3  A  P N             T        Y              
CSTF2H   DS    XL8                                                              
CSTF2    DS    CL2      9   51    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      9   55    3  A  P N             T        Y              
CSTF3H   DS    XL8                                                              
CSTF3    DS    CL2      9   59    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      9   63    3  A  P N             T        Y              
CSTF4H   DS    XL8                                                              
CSTF4    DS    CL2      9   67    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      9   71    3  A  P N             T        Y              
CSTF5H   DS    XL8                                                              
CSTF5    DS    CL2      9   75    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    10    6   32  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   39    3  A  P N             T        Y              
CSTCF1H  DS    XL8                                                              
CSTCF1   DS    CL2     10   43    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     10   47    3  A  P N             T        Y              
CSTCF2H  DS    XL8                                                              
CSTCF2   DS    CL2     10   51    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     10   55    3  A  P N             T        Y              
CSTCF3H  DS    XL8                                                              
CSTCF3   DS    CL2     10   59    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     10   63    3  A  P N             T        Y              
CSTCF4H  DS    XL8                                                              
CSTCF4   DS    CL2     10   67    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     10   71    3  A  P N             T        Y              
CSTCF5H  DS    XL8                                                              
CSTCF5   DS    CL2     10   75    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    11    6   32  L  P N             T        Y              
CSTCTRH  DS    XL8                                                              
CSTCTR   DS    CL40    11   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    12    6   32  L  P N             T        Y              
CSTCLIH  DS    XL8                                                              
CSTCLI   DS    CL40    12   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    13    6   32  L  P N             T        Y              
CSTWCH   DS    XL8                                                              
CSTWC    DS    CL40    13   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  P N             T        Y              
CSTCS08H DS    XL8                                                              
CSTCS08  DS    CL32    14    6   32  L  P N             T        Y              
CSTOFFH  DS    XL8                                                              
CSTOFF   DS    CL40    14   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    15    6   32  L  P N             T        Y              
CSTCOFFH DS    XL8                                                              
CSTCOFF  DS    CL40    15   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    16    6   32  L  P N             T        Y              
CSTLOCSH DS    XL8                                                              
CSTLOCS  DS    CL9     16   39    9  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    17    6   32  L  P N             T        Y              
CSTMETHH DS    XL8                                                              
CSTMETH  DS    CL3     17   39    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    18    6   32  L  P N             T        Y              
CSTPCDEH DS    XL8                                                              
CSTPCDE  DS    CL40    18   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  P N             T        Y              
CSTCS11H DS    XL8                                                              
CSTCS11  DS    CL32    19    6   32  L  P N             T        Y              
CSTLOCKH DS    XL8                                                              
CSTLOCK  DS    CL1     19   39    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     19   41    3  A  P N             T        Y              
CSTCS12H DS    XL8                                                              
CSTCS12  DS    CL32    19   45   32  L  P N             T        Y              
CSTTEDTH DS    XL8                                                              
CSTTEDT  DS    CL1     19   78    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  P N             T        Y              
CSTCS13H DS    XL8                                                              
CSTCS13  DS    CL32    20    6   32  L  P N             T        Y              
CSTSVTMH DS    XL8                                                              
CSTSVTM  DS    CL1     20   39    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     20   41    3  A  P N             T        Y              
CSTCS14H DS    XL8                                                              
CSTCS14  DS    CL32    20   45   32  L  P N             T        Y              
CSTOFSCH DS    XL8                                                              
CSTOFSC  DS    CL1     20   78    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL11    21    6   11  L  P N             T        Y              
CSTTSTAH DS    XL8                                                              
CSTTSTA  DS    CL10    21   30   10  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     21   41    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    21   45   32  L  P N             T        Y              
CSTFPDDH DS    XL8                                                              
CSTFPDD  DS    CL1     21   78    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL22    22    6   22  L  P N             T        Y              
CSTMTSTH DS    XL8                                                              
CSTMTST  DS    CL10    22   30   10  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     22   41    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL20    22   45   20  L  P N             T        Y              
CSTCEROH DS    XL8                                                              
CSTCERO  DS    CL1     22   67    1  A  U H             T        Y              
CSTTABH  DS    XL8                                                              
CSTTAB   DS    CL1     22   78    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL78    23    2   78  L  P H             T        Y  254         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL77    24    3   77  L  P H             T        Y  254         
         DS    XL8                                                              
CSTLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
CSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2024 BYTES                            
