*          DATA SET ACSCRE2D   AT LEVEL 003 AS OF 12/09/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60CE2D      DATE 12/09/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      4    2    6  L  P H             T        Y              
PNLCODEH DS    CL8                                                              
PNLCODE  DS    CL8      4   10    8  A  U N             T        Y              
PNLNMH   DS    CL8                                                              
PNLNM    DS    CL4      4   20    4  L  P N             T        Y              
PNLNMEH  DS    CL8                                                              
PNLNME   DS    CL36     4   25   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      4   63    6  L  P N             T        Y              
PNLOWNH  DS    CL8                                                              
PNLOWN   DS    CL8      4   70    8  A  P H             T        Y              
PNLBGNH  DS    CL8                                                              
PNLBGN   DS    CL32     6    2   32  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32     7    6   32  L  P N             T        Y              
PNLTYPEH DS    CL8                                                              
PNLTYPE  DS    CL15     7   39   15  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
PNLPL02H DS    CL8                                                              
PNLPL02  DS    CL32     8    6   32  L  P N             T        Y              
PNLACCTH DS    CL8                                                              
PNLACCT  DS    CL40     8   39   40  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32     9    6   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   39    3  A  P N             T        Y              
PNLF1H   DS    CL8                                                              
PNLF1    DS    CL2      9   43    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      9   47    3  A  P N             T        Y              
PNLF2H   DS    CL8                                                              
PNLF2    DS    CL2      9   51    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      9   55    3  A  P N             T        Y              
PNLF3H   DS    CL8                                                              
PNLF3    DS    CL2      9   59    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      9   63    3  A  P N             T        Y              
PNLF4H   DS    CL8                                                              
PNLF4    DS    CL2      9   67    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      9   71    3  A  P N             T        Y              
PNLF5H   DS    CL8                                                              
PNLF5    DS    CL2      9   75    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    10    6   32  L  P N             T        Y              
PNLCLIH  DS    CL8                                                              
PNLCLI   DS    CL40    10   39   40  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    11    6   32  L  P N             T        Y              
PNLOFFH  DS    CL8                                                              
PNLOFF   DS    CL40    11   39   40  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    12    6   32  L  P N             T        Y              
PNLMTHDH DS    CL8                                                              
PNLMTHD  DS    CL3     12   39    3  A  U H             T        Y              
PNLTABH  DS    CL8                                                              
PNLTAB   DS    CL1     13    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  L  P H             T        Y  254         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL77    24    3   77  L  P H             T        Y  254         
         DS    CL8                                                              
PNLLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
PNLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 944  BYTES                            
