*          DATA SET ACSCROTYPD AT LEVEL 006 AS OF 09/02/98                      
***********************************************************************         
*  VALID SCRIBE OUTPUT TYPES CONVERSION TABLE DSECT                   *         
***********************************************************************         
         SPACE 1                                                                
OUTTYPD  DSECT                                                                  
OUTTYOLD DS    CL6                                                              
OUTTYNEW DS    CL6                                                              
OUTTYIND DS    XL1                                                              
OUTTYEOD EQU   X'80'               USED IN END OF DAY TO CONVERT                
*                                                                               
OUTTYLNQ EQU   *-OUTTYPD                                                        
