*          DATA SET ACSCRF1D   AT LEVEL 004 AS OF 08/10/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60CF1D      DATE 08/10/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      4    2    6  L  P H             T        Y              
EXPCODEH DS    CL8                                                              
EXPCODE  DS    CL8      4   10    8  A  U N             T        Y              
EXPNMH   DS    CL8                                                              
EXPNM    DS    CL4      4   20    4  L  P N             T        Y              
EXPNMEH  DS    CL8                                                              
EXPNME   DS    CL36     4   25   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      4   63    6  L  P N             T        Y              
EXPOWNH  DS    CL8                                                              
EXPOWN   DS    CL8      4   70    8  A  P H             T        Y              
EXPBGNH  DS    CL8                                                              
EXPBGN   DS    CL32     6    2   32  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32     7    6   32  L  P N             T        Y              
EXPTYPEH DS    CL8                                                              
EXPTYPE  DS    CL40     7   39   40  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
EXPEX02H DS    CL8                                                              
EXPEX02  DS    CL32     8    6   32  L  P N             T        Y              
EXPACCTH DS    CL8                                                              
EXPACCT  DS    CL40     8   39   40  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  P N             T        Y              
EXPEX03H DS    CL8                                                              
EXPEX03  DS    CL32     9    6   32  L  P N             T        Y              
EXPCNTRH DS    CL8                                                              
EXPCNTR  DS    CL40     9   39   40  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    10    6   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10   39    3  A  P N             T        Y              
EXPF1H   DS    CL8                                                              
EXPF1    DS    CL2     10   43    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     10   47    3  A  P N             T        Y              
EXPF2H   DS    CL8                                                              
EXPF2    DS    CL2     10   51    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     10   55    3  A  P N             T        Y              
EXPF3H   DS    CL8                                                              
EXPF3    DS    CL2     10   59    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     10   63    3  A  P N             T        Y              
EXPF4H   DS    CL8                                                              
EXPF4    DS    CL2     10   67    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     10   71    3  A  P N             T        Y              
EXPF5H   DS    CL8                                                              
EXPF5    DS    CL2     10   75    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    11    6   32  L  P N             T        Y              
EXPITTYH DS    CL8                                                              
EXPITTY  DS    CL40    11   39   40  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  P N             T        Y              
EXPEX06H DS    CL8                                                              
EXPEX06  DS    CL32    12    6   32  L  P N             T        Y              
EXPCOSTH DS    CL8                                                              
EXPCOST  DS    CL40    12   39   40  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    13    6   32  L  P N             T        Y              
EXPOFFH  DS    CL8                                                              
EXPOFF   DS    CL40    13   39   40  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    14    6   32  L  P N             T        Y              
EXPDEPTH DS    CL8                                                              
EXPDEPT  DS    CL40    14   39   40  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    15    6   32  L  P N             T        Y              
EXPPRSNH DS    CL8                                                              
EXPPRSN  DS    CL40    15   39   40  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  P N             T        Y              
EXPEX10H DS    CL8                                                              
EXPEX10  DS    CL32    16    6   32  L  P N             T        Y              
EXPXCATH DS    CL8                                                              
EXPXCAT  DS    CL40    16   39   40  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    17    6   32  L  P N             T        Y              
EXPVNDRH DS    CL8                                                              
EXPVNDR  DS    CL40    17   39   40  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  P N             T        Y              
EXPEX12H DS    CL8                                                              
EXPEX12  DS    CL32    18    6   32  L  P N             T        Y              
EXPLOCKH DS    CL8                                                              
EXPLOCK  DS    CL1     18   39    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     18   41    3  A  P N             T        Y              
EXPEX13H DS    CL8                                                              
EXPEX13  DS    CL32    18   45   32  L  P N             T        Y              
EXPRVRSH DS    CL8                                                              
EXPRVRS  DS    CL1     18   78    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  P N             T        Y              
EXPEX14H DS    CL8                                                              
EXPEX14  DS    CL32    19    6   32  L  P N             T        Y              
EXPDRFTH DS    CL8                                                              
EXPDRFT  DS    CL1     19   39    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     19   41    3  A  P N             T        Y              
EXPEX15H DS    CL8                                                              
EXPEX15  DS    CL32    19   45   32  L  P N             T        Y              
EXPANDPH DS    CL8                                                              
EXPANDP  DS    CL1     19   78    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  P N             T        Y              
EXPEX16H DS    CL8                                                              
EXPEX16  DS    CL32    20    6   32  L  P N             T        Y              
EXPANPRH DS    CL8                                                              
EXPANPR  DS    CL1     20   39    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     20   41    3  A  P N             T        Y              
EXPEX17H DS    CL8                                                              
EXPEX17  DS    CL32    20   45   32  L  P N             T        Y              
EXPANCLH DS    CL8                                                              
EXPANCL  DS    CL1     20   78    1  A  U H             T        Y              
EXPTABH  DS    CL8                                                              
EXPTAB   DS    CL1     21    9    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  L  P H             T        Y  254         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL77    24    3   77  L  P H             T        Y  254         
         DS    CL8                                                              
EXPLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
EXPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1864 BYTES                            
