*          DATA SET ACSCRF7D   AT LEVEL 003 AS OF 08/07/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60CF7D      DATE 08/07/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      4    2    6  L  P H             T        Y              
PRVCODEH DS    CL8                                                              
PRVCODE  DS    CL8      4   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      4   20    4  L  P N             T        Y              
PRVNMEH  DS    CL8                                                              
PRVNME   DS    CL36     4   25   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      4   63    6  L  P N             T        Y              
PRVOWNH  DS    CL8                                                              
PRVOWN   DS    CL8      4   70    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      6   51    6  L  P N             T        Y              
PRVROWH  DS    CL8                                                              
PRVROW   DS    CL2      6   58    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL6      6   63    6  L  P N             T        Y              
PRVCOLH  DS    CL8                                                              
PRVCOL   DS    CL3      6   70    3  A  U H             T        Y              
PRVFRSTH DS    CL8                                                              
PRVFRST  DS    CL77     7    2   77  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL77     8    2   77  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL77     9    2   77  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL77    10    2   77  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL77    11    2   77  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL77    12    2   77  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL77    13    2   77  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL77    14    2   77  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL77    15    2   77  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL77    16    2   77  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL77    17    2   77  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL77    18    2   77  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL77    19    2   77  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL77    20    2   77  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL77    21    2   77  L  P H             T        Y              
PRVTABH  DS    CL8                                                              
PRVTAB   DS    CL1     21   80    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  L  P H             T        Y  254         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL77    24    3   77  L  P H             T        Y  254         
         DS    CL8                                                              
PRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
PRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1640 BYTES                            
