*          DATA SET ACSCREED   AT LEVEL 003 AS OF 08/13/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60CEED      DATE 08/13/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  L  P H             T        Y              
JOBCDEH  DS    XL8                                                              
JOBCDE   DS    CL8      4   10    8  A  U N             T        Y              
JOBNMH   DS    XL8                                                              
JOBNM    DS    CL4      4   20    4  L  P N             T        Y              
JOBNMEH  DS    XL8                                                              
JOBNME   DS    CL36     4   25   36  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      4   63    6  L  P N             T        Y              
JOBOWNH  DS    XL8                                                              
JOBOWN   DS    CL8      4   70    8  A  P H             T        Y              
JOBBGNH  DS    XL8                                                              
JOBBGN   DS    CL3      6    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32     6    6   32  L  P N             T        Y              
JOBTYPEH DS    XL8                                                              
JOBTYPE  DS    CL40     6   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      7    2    3  A  P N             T        Y              
JOB001H  DS    XL8                                                              
JOB001   DS    CL32     7    6   32  L  P N             T        Y              
JOBACCTH DS    XL8                                                              
JOBACCT  DS    CL40     7   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
JOB002H  DS    XL8                                                              
JOB002   DS    CL32     8    6   32  L  P N             T        Y              
JOBCNTRH DS    XL8                                                              
JOBCNTR  DS    CL40     8   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL27     9    6   27  L  P N             T        Y              
JOBBGH   DS    XL8                                                              
JOBBG    DS    CL4      9   34    4  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      9   39    3  A  P N             T        Y              
JOBF1H   DS    XL8                                                              
JOBF1    DS    CL2      9   43    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      9   47    3  A  P N             T        Y              
JOBF2H   DS    XL8                                                              
JOBF2    DS    CL2      9   51    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      9   55    3  A  P N             T        Y              
JOBF3H   DS    XL8                                                              
JOBF3    DS    CL2      9   59    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      9   63    3  A  P N             T        Y              
JOBF4H   DS    XL8                                                              
JOBF4    DS    CL2      9   67    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      9   71    3  A  P N             T        Y              
JOBF5H   DS    XL8                                                              
JOBF5    DS    CL2      9   75    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    10    6   32  L  P N             T        Y              
JOBOFGH  DS    XL8                                                              
JOBOFG   DS    CL40    10   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    11    6   32  L  P N             T        Y              
JOBOFFH  DS    XL8                                                              
JOBOFF   DS    CL40    11   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    12    6   32  L  P N             T        Y              
JOBMGH   DS    XL8                                                              
JOBMG    DS    CL40    12   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    13    6   32  L  P N             T        Y              
JOBMEDH  DS    XL8                                                              
JOBMED   DS    CL40    13   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    14    6   32  L  P N             T        Y              
JOBWCGH  DS    XL8                                                              
JOBWCG   DS    CL40    14   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    15    6   32  L  P N             T        Y              
JOBWCH   DS    XL8                                                              
JOBWC    DS    CL40    15   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL28    16    6   28  L  P N             T        Y              
JOBBTYH  DS    XL8                                                              
JOBBTY   DS    CL2     16   36    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     16   39    3  A  P N             T        Y              
JOB012H  DS    XL8                                                              
JOB012   DS    CL30    16   43   30  L  P N             T        Y              
JOBESTSH DS    XL8                                                              
JOBESTS  DS    CL1     16   78    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL25    17    6   25  L  P N             T        Y              
JOBSTTYH DS    XL8                                                              
JOBSTTY  DS    CL5     17   33    5  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     17   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL28    17   43   28  L  P N             T        Y              
JOBUFLDH DS    XL8                                                              
JOBUFLD  DS    CL3     17   76    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  P N             T        Y              
JOB015H  DS    XL8                                                              
JOB015   DS    CL26    18    6   26  L  P N             T        Y              
JOBTIMEH DS    XL8                                                              
JOBTIME  DS    CL5     18   33    5  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     18   39    3  A  P N             T        Y              
JOB016H  DS    XL8                                                              
JOB016   DS    CL30    18   43   30  L  P N             T        Y              
JOBTBALH DS    XL8                                                              
JOBTBAL  DS    CL1     18   78    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    19    6   32  L  P N             T        Y              
JOBITTYH DS    XL8                                                              
JOBITTY  DS    CL40    19   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  P N             T        Y              
JOB018H  DS    XL8                                                              
JOB018   DS    CL30    20    6   30  L  P N             T        Y              
JOBIUTRH DS    XL8                                                              
JOBIUTR  DS    CL1     20   37    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     20   39    3  A  P N             T        Y              
JOB019H  DS    XL8                                                              
JOB019   DS    CL30    20   43   30  L  P N             T        Y              
JOBCLSEH DS    XL8                                                              
JOBCLSE  DS    CL1     20   78    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  P N             T        Y              
JOB020H  DS    XL8                                                              
JOB020   DS    CL30    21    6   30  L  P N             T        Y              
JOBEXPSH DS    XL8                                                              
JOBEXPS  DS    CL1     21   37    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     21   39    3  A  P N             T        Y              
JOB021H  DS    XL8                                                              
JOB021   DS    CL30    21   43   30  L  P N             T        Y              
JOBRVRSH DS    XL8                                                              
JOBRVRS  DS    CL1     21   78    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL78    23    2   78  L  P H             T        Y  254         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL75    24    3   75  L  P H             T        Y  254         
         DS    XL8                                                              
JOBTABH  DS    XL8                                                              
JOBTAB   DS    CL1     24   79    1  A  U N             T        Y              
JOBLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
JOBWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2048 BYTES                            
