*          DATA SET ACSCRD2D   AT LEVEL 008 AS OF 02/27/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60CD2D      DATE 02/27/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  L  P H             T        Y              
EXTCODEH DS    XL8                                                              
EXTCODE  DS    CL8      4   10    8  A  U N             T        Y              
EXTNMH   DS    XL8                                                              
EXTNM    DS    CL4      4   20    4  L  P N             T        Y              
EXTNMEH  DS    XL8                                                              
EXTNME   DS    CL36     4   25   36  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      4   63    6  L  P N             T        Y              
EXTOWNH  DS    XL8                                                              
EXTOWN   DS    CL8      4   70    8  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL15     6    2   15  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL2      6   18    2  A  P N             T        Y              
EXTHDR1H DS    XL8                                                              
EXTHDR1  DS    CL78     7    2   78  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL78     8    2   78  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15     9    2   15  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL2      9   18    2  A  P N             T        Y              
EXTHDR2H DS    XL8                                                              
EXTHDR2  DS    CL78    10    2   78  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL78    11    2   78  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    12    2   15  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL3     12   18    3  A  P N             T        Y              
EXTHDR3H DS    XL8                                                              
EXTHDR3  DS    CL78    13    2   78  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL78    14    2   78  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    15    2   15  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL10    15   18   10  L  P N             T        Y              
EXTNUMH  DS    XL8                                                              
EXTNUM   DS    CL3     15   29    3  A  U N             T        Y              
EXTRNGH  DS    XL8                                                              
EXTRNG   DS    CL40    15   35   40  A  P N             T        Y              
EXTTT1H  DS    XL8                                                              
EXTTT1   DS    CL78    16    2   78  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL78    17    2   78  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    18    2   15  L  P H             T        Y              
EXTTRLH  DS    XL8                                                              
EXTTRL   DS    CL78    19    2   78  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL78    20    2   78  A  U N             T        Y              
EXTENDH  DS    XL8                                                              
EXTEND   DS    CL1     22   78    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    23    2   78  L  P H             T        Y  254         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL77    24    3   77  L  P H             T        Y  254         
         DS    XL8                                                              
EXTLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
EXTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1400 BYTES                            
