*          DATA SET ACSCRFDD   AT LEVEL 003 AS OF 08/07/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60CFDD      DATE 08/07/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      4    2    6  L  P H             T        Y              
HDLCODEH DS    CL8                                                              
HDLCODE  DS    CL8      4   10    8  A  U N             T        Y              
HDLNMH   DS    CL8                                                              
HDLNM    DS    CL4      4   20    4  L  P N             T        Y              
HDLNMEH  DS    CL8                                                              
HDLNME   DS    CL36     4   25   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      4   63    6  L  P N             T        Y              
HDLOWNH  DS    CL8                                                              
HDLOWN   DS    CL8      4   70    8  A  P H             T        Y              
HDLBGNH  DS    CL8                                                              
HDLBGN   DS    CL5      7   15    5  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2      7   22    2  A  P H             T        Y              
HDLTITLH DS    CL8                                                              
HDLTITL  DS    CL36     7   25   36  L  U N             T        Y              
HDLCNTRH DS    CL8                                                              
HDLCNTR  DS    CL6      8   15    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2      8   22    2  A  P H             T        Y              
HDLCNT1H DS    CL8                                                              
HDLCNT1  DS    CL36     8   25   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2      9   22    2  A  P H             T        Y              
HDLCNT2H DS    CL8                                                              
HDLCNT2  DS    CL36     9   25   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     10   22    2  A  P H             T        Y              
HDLCNT3H DS    CL8                                                              
HDLCNT3  DS    CL36    10   25   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     12    2    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL10    12   42   10  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     13    2    2  A  P H             T        Y              
HDLLH1H  DS    CL8                                                              
HDLLH1   DS    CL36    13    5   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   42    2  A  P H             T        Y              
HDLRH1H  DS    CL8                                                              
HDLRH1   DS    CL36    13   45   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14    2    2  A  P H             T        Y              
HDLLH2H  DS    CL8                                                              
HDLLH2   DS    CL36    14    5   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   42    2  A  P H             T        Y              
HDLRH2H  DS    CL8                                                              
HDLRH2   DS    CL36    14   45   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15    2    2  A  P H             T        Y              
HDLLH3H  DS    CL8                                                              
HDLLH3   DS    CL36    15    5   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   42    2  A  P H             T        Y              
HDLRH3H  DS    CL8                                                              
HDLRH3   DS    CL36    15   45   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17    2    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     18    2    2  A  P H             T        Y              
HDLFL1H  DS    CL8                                                              
HDLFL1   DS    CL72    18    5   72  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19    2    2  A  P H             T        Y              
HDLFL2H  DS    CL8                                                              
HDLFL2   DS    CL72    19    5   72  L  U N             T        Y              
HDLTABH  DS    CL8                                                              
HDLTAB   DS    CL1     20   15    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  L  P H             T        Y  254         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL77    24    3   77  L  P H             T        Y  254         
         DS    CL8                                                              
HDLLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
HDLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1120 BYTES                            
