*          DATA SET ACSCRFMTS  AT LEVEL 009 AS OF 05/13/20                      
         TITLE 'Default formats'                                                
                                                                                
*                                                                               
FMTLIST  DC     CL8'FPL1',AL4(GL1F)                                             
*&&UK*&& DC     CL8'FPL3',AL4(GL2F)                                             
*&&US*&& DC     CL8'FPL3',AL4(GL3F)                                             
*&&US*&& DC     CL8'FPL5',AL4(GL5F)                                             
*&&US*&& DC     CL8'@DCHEK',AL4(DL1F)                                           
         DC     AL1(EOT)                                                        
         EJECT  ,                                                               
*---------------------------------------------------------------------*         
*                                                                               
*---------------------------------------------------------------------*         
         MACRO                                                                  
         TEXT  &TEXT                                                            
         LCLC  &STRING                                                          
&DINK    SETC  ''''                                                             
&STRING  SETC  '&TEXT'                                                          
         AIF   (T'&STRING EQ 'O').XIT                                           
&LEN     SETA  K'&STRING                                                        
&LPOS    SETA  ('&STRING' INDEX '&DINK')                                        
         AIF   (&LPOS NE 1).A                                                   
&LEN     SETA  &LEN-2                                                           
&STRING  SETC  '&STRING'(2,&LEN)                                                
.A       DC    CL&LEN'&STRING'                                                  
.XIT     MEXIT                                                                  
         MEND                                                                   
*---------------------------------------------------------------------*         
* Formating of a string text                                                    
*---------------------------------------------------------------------*         
         MACRO                                                                  
         FMT &CODE=,&NAME=                                                      
                                                                                
         AIF   (T'&CODE EQ 'O').ER1                                             
&CODE    DC    X'2D0200',CL8'&CODE',CL31' '                                     
         DC    XL2'00',XL5'00'                                                  
         AIF   (T'&NAME EQ 'O').B                                               
&CODE.1  DC    AL1(NAMELQ,&CODE.2-&CODE.1)                                      
         TEXT  &NAME                                                            
&CODE.2  EQU   *                                                                
.B       ANOP                                                                   
         AGO    .XIT                                                            
ER1      MNOTE  1,'MISSING CODE OF FORMAT'                                      
.XIT     MEXIT                                                                  
         MEND                                                                   
         EJECT                                                                  
*---------------------------------------------------------------------*         
* Report type                                                                   
*---------------------------------------------------------------------*         
         MACRO                                                                  
*&&UK*&& REPTY &TYPE,&LB                                                        
*&&US*&& REPTY &TYPE                                                            
         LCLC  &RTYPE                                                           
         AIF   (T'&TYPE EQ 'O').ER1                                             
         AIF   ('&TYPE' NE 'AC#GLG').TYP10                                      
*        AIF   ('&TYPE' NE 'AC#RS540').TYP10                                    
&RTYPE   SETC  '199'                                                            
.TYP10   ANOP                                                                   
*&&UK                                                                           
&LB      DC    AL1(STYELQ,STYLNQ,&RTYPE)                                        
*&&                                                                             
*&&US                                                                           
RTYPE    DC    AL1(STYELQ,STYLNQ,&RTYPE)                                        
*&&                                                                             
         DC    AL1(ESC#LFJT),AL2(&TYPE),AL1(6),CL2' '                           
         DC    AL1(0,STYSACNT,0)                                                
         AGO    .XIT                                                            
ER1      MNOTE  1,'Missing reporting type'                                      
.XIT     MEXIT                                                                  
         MEND                                                                   
         EJECT                                                                  
*---------------------------------------------------------------------*         
* Report type 2                                                                 
*---------------------------------------------------------------------*         
         MACRO                                                                  
*&&UK*&& REPT2 &TYPE,&LB2                                                       
*&&US*&& REPT2 &TYPE                                                            
         LCLC  &RTYP2                                                           
         AIF   (T'&TYPE EQ 'O').ER2                                             
         AIF   ('&TYPE' NE 'AC#RSPAY').TY210                                    
&RTYP2   SETC  '212'                                                            
.TY210   ANOP                                                                   
*&&UK                                                                           
&LB2     DC    AL1(STYELQ,STYLNQ2,&RTYP2)                                       
*&&                                                                             
*&&US                                                                           
RTYP2    DC    AL1(STYELQ,STYLNQ2,&RTYP2)                                       
*&&                                                                             
         DC    AL1(ESC#LFJT),AL2(&TYPE),AL1(6),CL2' '                           
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL1(54)                    WIDTH OF REPORT                       
*        DC    AL1(217)                   WIDTH OF REPORT                       
         AGO    .XIT                                                            
ER2      MNOTE  1,'Missing reporting type'                                      
.XIT     MEXIT                                                                  
         MEND                                                                   
         EJECT                                                                  
*---------------------------------------------------------------------*         
* Row macro                                                                     
*---------------------------------------------------------------------*         
         MACRO                                                                  
&TAG     ROW   &KEYWORD=,                                              +        
               &TOTAL=N,                                               +        
               &PREFIX=,                                               +        
               &HEADING=L,                                             +        
               &SHOW=B,                                                +        
               &LEVEL=N,                                               +        
               &DICT=N                                                          
.*                                                                              
         LCLC &OPT1                                                             
         LCLC &OPT2                                                             
         LCLC &HDTY                                                             
         GBLA &ROW#                                                             
         AIF   (T'&KEYWORD EQ 'O').ER1                                          
&ROW#    SETA  &ROW#+1                                                          
&HDTY    SETC  'RRWLHEAD'                                                       
&DLEN    SETA  2                                                                
&OPT1    SETC  '0'                                                              
&OPT2    SETC  '0'                                                              
         AIF   ('&HEADING'(1,1) EQ 'L').HD                                      
&HDTY    SETC  'RRWRHEAD'                                                       
         AIF   ('&HEADING'(1,1) EQ 'R').HD                                      
&HDTY    SETC  'RRWCHEAD'                                                       
         AIF   ('&HEADING'(1,1) EQ 'C').HD                                      
&HDTY    SETC  'RRWMID'                                                         
         AIF   ('&HEADING'(1,1) EQ 'M').HD                                      
&HDTY    SETC  '0'                                                              
         AIF   ('&HEADING'(1,1) EQ 'B').HD                                      
         AGO   .ER3                                                             
.HD      ANOP                                                                   
         AIF   (T'&LEVEL EQ 'O').CN                                             
         AIF   ('&LEVEL'(1,1) NE 'Y').CN                                        
&OPT2    SETC  'RRWLVL'                                                         
.CN      ANOP                                                                   
&DLEN    SETA  &DLEN+2                                                          
         AIF   (T'&SHOW EQ 'O').B                                               
&OPT1    SETC  'RRWCODE+RRWNAME+RRWNEWEL'                                       
         AIF   ('&SHOW'(1,1) EQ 'B').B                                          
&OPT1    SETC  'RRWCODE+RRWNEWEL'                                               
         AIF   ('&SHOW'(1,1) EQ 'C').B                                          
&OPT1    SETC  'RRWNAME+RRWNEWEL'                                               
         AIF   ('&SHOW'(1,1) NE 'N').ER2                                        
                                                                                
&DLEN    SETA  &DLEN+2                                                          
.B       ANOP                                                                   
RWA&ROW# DC    AL1(RRWELQ,RWX&ROW#-RWA&ROW#,&ROW#,&OPT1)                        
         DC    AL1(&HDTY,&OPT2,0,0,0)                                           
         DC    AL1(&DLEN,RWX&ROW#-RWT&ROW#,0,0,0)                               
         DC    AL1(0,0,0)                                                       
         DC    AL2(&KEYWORD)                                                    
         AIF   (T'&SHOW EQ 'O').P8                                              
         AIF   ('&SHOW'(1,1) NE 'B').P1                                         
         DC    AL2(AC#RSCAN)                                                    
.P1      AIF   ('&SHOW' NE 'C').P2                                              
         DC    AL2(AC#RSCOD)                                                    
.P2      AIF   ('&SHOW' NE 'N').P8                                              
         DC    AL2(AC#RSNAM)                                                    
.P8      AIF   (T'LEVEL EQ 'O').P10                                             
         AIF   ('&LEVEL' NE 'Y').P10                                            
         DC    AL2(AC#RSLVL)                                                    
.P10     ANOP                                                                   
RWT&ROW# EQU   *                                                                
         AIF   (T'&PREFIX EQ 'O').P12                                           
         TEXT  &PREFIX                                                          
.P12     ANOP                                                                   
RWX&ROW# EQU   *                                                                
         AGO   .XIT                                                             
                                                                                
.ER1     MNOTE 1,'Missing keyword'                                              
         AGO   .XIT                                                             
.ER2     MNOTE 1,'Not valid show value'                                         
         AGO   .XIT                                                             
.ER3     MNOTE 1,'Not valid heading type'                                       
                                                                                
.XIT     MEXIT                                                                  
         MEND                                                                   
         EJECT                                                                  
*---------------------------------------------------------------------*         
* Generate formats                                                              
*---------------------------------------------------------------------*         
* FPL1                                                                          
*---------------------------------------------------------------------*         
*&&US                                                                           
GL1F     DS    0C                                                               
         FMT   CODE=FPL1,NAME='Transaction Details'                             
         REPTY AC#GLG                                                           
* ROWS                                                                          
*        ROW   KEYWORD=AC#RSA1C,SHOW=B,LEVEL=Y,DICT=Y,HEADING=L                 
*        ROW   KEYWORD=AC#RSA2C,SHOW=B,LEVEL=Y,DICT=Y,HEADING=L                 
*        ROW   KEYWORD=AC#RSA3C,SHOW=B,LEVEL=Y,DICT=Y,HEADING=L                 
*        ROW   KEYWORD=AC#RSA4C,SHOW=B,LEVEL=Y,DICT=Y,HEADING=L                 
*        ROW   KEYWORD=AC#RSOFF,SHOW=B,DICT=Y,PREFIX=Office                     
*        ROW   KEYWORD=AC#RSCOC,SHOW=B,DICT=Y,PREFIX=Source                     
*                                                                               
* ROWS                                                                          
* ACC,BOTH                                                                      
GL1R1    DC    AL1(RRWELQ,GL1R1X-GL1R1,01)                                      
         DC    AL1(RRWPAGE+RRWNAME+RRWCODE+RRWNEWEL)                            
         DC    AL1(RRWLHEAD,RRWDICT,0,0,0,04)                                   
         DC    AL1(07,0,0,0,0,0,0)                                              
         DC    AL2(AC#RSACC)                                                    
         DC    AL2(AC#RSCAN+X'C000')                                            
         DC    C'Account'                                                       
GL1R1X   EQU   *                                                                
*                                                                               
*CAC,BOTH                                                                       
GL1R2    DC    AL1(RRWELQ,GL1R2X-GL1R2,02)                                      
         DC    AL1(RRWPAGE+RRWNAME+RRWCODE+RRWNEWEL)                            
         DC    AL1(RRWLHEAD,RRWDICT,0,0,0,04)                                   
         DC    AL1(14,0,0,0,0,0,0)                                              
         DC    AL2(AC#RSCOC)                                                    
         DC    AL2(AC#RSCAN+X'C000')                                            
         DC    C'Contra Account'                                                
GL1R2X   EQU   *                                                                
*                                                                               
* COLUMNS                                                                       
*                                                                               
* TADTE                                                                         
GL1C1    DC    AL1(RCLELQ,GL1C1X-GL1C1,01,10,RCLNEWEL,RCLCODE+RCLDICT)          
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,04,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSTAD)                                                    
         DC    C'Date'                                                          
GL1C1X   EQU   *                                                                
*                                                                               
*REF                                                                            
GL1C2    DC    AL1(RCLELQ,GL1C2X-GL1C2,02,09,RCLNEWEL,RCLCODE+RCLDICT)          
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,09,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSREF)                                                    
         DC    C'Reference'                                                     
GL1C2X   EQU   *                                                                
*                                                                               
*                                                                               
*OFC,CODE                                                                       
GL1C3    DC    AL1(RCLELQ,GL1C3X-GL1C3,03,06,RCLNEWEL,RCLCODE+RCLDICT)          
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,06,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSOFF)                                                    
         DC    AL2(AC#RSCOD+X'C000')                                            
         DC    C'Office'                                                        
GL1C3X   EQU   *                                                                
*                                                                               
*OFN,NAME                                                                       
GL1C4    DC    AL1(RCLELQ,GL1C4X-GL1C4,04,06,RCLNEWEL)                          
         DC    AL1(RCLNAME+RCLDICT)                                             
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,11,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSOFN)                                                    
         DC    AL2(AC#RSNAM)                                                    
         DC    C'Office Name'                                                   
GL1C4X   EQU   *                                                                
*                                                                               
*DEPTC,CODE                                                                     
GL1C5    DC    AL1(RCLELQ,GL1C5X-GL1C5,05,10,RCLNEWEL,RCLCODE+RCLDICT)          
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,10,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSDPC)                                                    
         DC    AL2(AC#RSCOD+X'C000')                                            
         DC    C'Department'                                                    
GL1C5X   EQU   *                                                                
*                                                                               
*PERSC,CODE                                                                     
GL1C6    DC    AL1(RCLELQ,GL1C6X-GL1C6,06,08,RCLNEWEL,RCLCODE+RCLDICT)          
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,06,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSPSC)                                                    
         DC    AL2(AC#RSCOD+X'C000')                                            
         DC    C'Person'                                                        
GL1C6X   EQU   *                                                                
*                                                                               
*DR,MOA,MON                                                                     
GL1C7    DC    AL1(RCLELQ,GL1C7X-GL1C7,07,13,RCLACCM+RCLNEWEL,RCLDICT)          
         DC    AL1(0,0,0,RCLMODT,RCLMON,0,0,0)                                  
         DC    AL1(0,06,05,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSDRA)                                                    
         DC    AL2(AC#RSMOA+X'8000')                                            
         DC    AL2(AC#RSRMO+X'8000')                                            
         DC    C'Debit'                                                         
GL1C7X   EQU   *                                                                
*                                                                               
*CR,MOA,MON                                                                     
GL1C8    DC    AL1(RCLELQ,GL1C8X-GL1C8,08,13,RCLACCM+RCLNEWEL,RCLDICT)          
         DC    AL1(0,0,0,RCLMODT,RCLMON,0,0,0)                                  
         DC    AL1(0,06,06,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSCRA)                                                    
         DC    AL2(AC#RSMOA+X'8000')                                            
         DC    AL2(AC#RSRMO+X'8000')                                            
         DC    C'Credit'                                                        
GL1C8X   EQU   *                                                                
*                                                                               
*CC,CODE                                                                        
GL1C9    DC    AL1(RCLELQ,GL1C9X-GL1C9,09,06,RCLNEWEL,RCLCODE+RCLDICT)          
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,06,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSCLC)                                                    
         DC    AL2(AC#RSCOD+X'C000')                                            
         DC    C'Client'                                                        
GL1C9X   EQU   *                                                                
*                                                                               
*CN,NAME                                                                        
GL1C10   DC    AL1(RCLELQ,GL1C10X-GL1C10,10,06,RCLNEWEL)                        
         DC    AL1(RCLNAME+RCLDICT)                                             
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,11,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSCLN)                                                    
         DC    AL2(AC#RSNAM)                                                    
         DC    C'Client Name'                                                   
GL1C10X  EQU   *                                                                
*                                                                               
*PR,CODE                                                                        
GL1C11   DC    AL1(RCLELQ,GL1C11X-GL1C11,11,07,RCLNEWEL)                        
         DC    AL1(RCLCODE+RCLDICT)                                             
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,07,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSPRC)                                                    
         DC    AL2(AC#RSCOD+X'C000')                                            
         DC    C'Product'                                                       
GL1C11X  EQU   *                                                                
*                                                                               
*MCN,NAME                                                                       
GL1C12   DC    AL1(RCLELQ,GL1C12X-GL1C12,12,06,RCLNEWEL)                        
         DC    AL1(RCLNAME+RCLDICT)                                             
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,06,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSMCN)                                                    
         DC    AL2(AC#CODEN+X'C000')                                            
         DC    C'Media Name'                                                    
GL1C12X  EQU   *                                                                
*                                                                               
*BREF                                                                           
GL1C13   DC    AL1(RCLELQ,GL1C13X-GL1C13,13,09)                                 
         DC    AL1(RCLNEWEL,RCLCODE+RCLDICT)                                    
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,05,09)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSBRF)                                                    
         DC    C'Batch'                                                         
         DC    C'Reference'                                                     
GL1C13X  EQU   *                                                                
*                                                                               
*ADTE                                                                           
GL1C14   DC    AL1(RCLELQ,GL1C14X-GL1C14,14,10)                                 
         DC    AL1(RCLNEWEL,RCLCODE+RCLDICT)                                    
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,08,04)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSADT)                                                    
         DC    C'Activity'                                                      
         DC    C'Date'                                                          
GL1C14X  EQU   *                                                                
*                                                                               
*NARR                                                                           
GL1C15   DC    AL1(RCLELQ,GL1C15X-GL1C15,15,36)                                 
         DC    AL1(RCLNEWEL,RCLCODE+RCLDICT)                                    
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,09,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSNAR)                                                    
         DC    C'Narrative'                                                     
GL1C15X  EQU   *                                                                
*                                                                               
GL1PF    DC    AL1(RPFELQ,GL1PFX-GL1PF,RPFBOX+RPFMCASE)                         
         DC    AL1(RPFEDCMA+RPFEDTRL)                                           
         DC    C'2P'                                                            
         DC    AL1(RPFNALPV)                                                    
*        DC    XL33'00'                                                         
         DC    XL17'00'                                                         
         DC    AL1(RPFTYP56)                                                    
         DC    XL15'00'                                                         
         DC    C' '                                                             
         DC    X'7F5E7A'                                                        
         DC    XL16'00'                                                         
GL1PFX   EQU   *                                                                
*                                                                               
GL1FL    DC    AL1(RFLELQ,GL1FLX-GL1FL,0,RFLLDG,0,0)                            
         DC    C'GB'                                                            
GL1FLX   EQU   *                                                                
*                                                                               
GL1EX    DC    AL1(FFTELQ,GL1EXX-GL1EX,FFTTEEXT,0,03)                           
         DC    C'FPL'                                                           
GL1EXX   EQU   *                                                                
*                                                                               
         DC    X'00'                                                            
GL1LNQ   EQU   *-GL1F                                                           
*                                                                               
*        COL   KEYWORD=AC#RSDEB,TYPE=$,HD1=Debit,PBASIS=PER,DBASIS=MOA          
*        COL   KEYWORD=AC#RSCRD,TYPE=$,HD1=Credit,PBASIS=PER,DBASIS=MOA         
*        CFLT  COL=1,ACCT=GB                                                    
*        CFLT  COL=X,ACCT=GP                                                    
*        GFLT  LEDGER=GB,GP                                                     
*                                                                               
*---------------------------------------------------------------------*         
* FPL3                                                                          
*---------------------------------------------------------------------*         
GL3F     DS    0C                                                               
         FMT   CODE=FPL3,NAME='Transaction Details'                             
*                                                                               
GL3STY   DC    AL1(STYELQ,STYLNQ,199)                                           
         DC    AL1(ESC#LFJT),AL2(AC#GLG),AL1(6),CL2' '                          
         DC    AL1(0,STYSACNT,0)                                                
* ROWS                                                                          
* ACC,BOTH                                                                      
GL3R1    DC    AL1(RRWELQ,GL3R1X-GL3R1,01)                                      
         DC    AL1(RRWPAGE+RRWNAME+RRWCODE+RRWNEWEL)                            
         DC    AL1(RRWLHEAD,RRWDICT,0,0,0,04)                                   
         DC    AL1(07,0,0,0,0,0,0)                                              
         DC    AL2(AC#RSACC)                                                    
         DC    AL2(AC#RSCAN+X'C000')                                            
         DC    C'Account'                                                       
GL3R1X   EQU   *                                                                
*                                                                               
*CAC,BOTH                                                                       
GL3R2    DC    AL1(RRWELQ,GL3R2X-GL3R2,02)                                      
         DC    AL1(RRWPAGE+RRWNAME+RRWCODE+RRWNEWEL)                            
         DC    AL1(RRWLHEAD,RRWDICT,0,0,0,04)                                   
         DC    AL1(14,0,0,0,0,0,0)                                              
         DC    AL2(AC#RSCOC)                                                    
         DC    AL2(AC#RSCAN+X'C000')                                            
         DC    C'Contra Account'                                                
GL3R2X   EQU   *                                                                
*                                                                               
*                                                                               
* COLUMNS                                                                       
*                                                                               
* MOA                                                                           
GL3C1    DC    AL1(RCLELQ,GL3C1X-GL3C1,01,15,RCLNEWEL,RCLCODE+RCLDICT)          
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,08,08)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSMOA)                                                    
         DC    C'Month of'                                                      
         DC    C'Activity'                                                      
GL3C1X   EQU   *                                                                
*                                                                               
* TADTE                                                                         
GL3C2    DC    AL1(RCLELQ,GL3C2X-GL3C2,02,10,RCLNEWEL,RCLCODE+RCLDICT)          
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,04,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSTAD)                                                    
         DC    C'Date'                                                          
GL3C2X   EQU   *                                                                
*                                                                               
*REF                                                                            
GL3C3    DC    AL1(RCLELQ,GL3C3X-GL3C3,03,09,RCLNEWEL,RCLCODE+RCLDICT)          
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,09,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSREF)                                                    
         DC    C'Reference'                                                     
GL3C3X   EQU   *                                                                
*                                                                               
*                                                                               
*OFC,CODE                                                                       
GL3C4    DC    AL1(RCLELQ,GL3C4X-GL3C4,04,06,RCLNEWEL,RCLCODE+RCLDICT)          
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,06,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSOFF)                                                    
         DC    AL2(AC#RSCOD+X'C000')                                            
         DC    C'Office'                                                        
GL3C4X   EQU   *                                                                
*                                                                               
*OFC,NAME                                                                       
GL3C5    DC    AL1(RCLELQ,GL3C5X-GL3C5,05,06,RCLNEWEL)                          
         DC    AL1(RCLNAME+RCLDICT)                                             
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,11,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSOFN)                                                    
         DC    AL2(AC#RSNAM)                                                    
         DC    C'Office Name'                                                   
GL3C5X   EQU   *                                                                
*                                                                               
*DEPTC,CODE                                                                     
GL3C6    DC    AL1(RCLELQ,GL3C6X-GL3C6,06,10,RCLNEWEL,RCLCODE+RCLDICT)          
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,10,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSDPC)                                                    
         DC    AL2(AC#RSCOD+X'C000')                                            
         DC    C'Department'                                                    
GL3C6X   EQU   *                                                                
*                                                                               
*PERSC,CODE                                                                     
GL3C7    DC    AL1(RCLELQ,GL3C7X-GL3C7,07,08,RCLNEWEL,RCLCODE+RCLDICT)          
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,06,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSPSC)                                                    
         DC    AL2(AC#RSCOD+X'C000')                                            
         DC    C'Person'                                                        
GL3C7X   EQU   *                                                                
*                                                                               
*DR,MOA,MON                                                                     
GL3C8    DC    AL1(RCLELQ,GL3C8X-GL3C8,08,13,RCLACCM+RCLNEWEL,RCLDICT)          
         DC    AL1(0,0,0,RCLMODT,RCLMON,0,0,0)                                  
         DC    AL1(0,06,05,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSDRA)                                                    
         DC    AL2(AC#RSMOA+X'8000')                                            
         DC    AL2(AC#RSRMO+X'8000')                                            
         DC    C'Debit'                                                         
GL3C8X   EQU   *                                                                
*                                                                               
*CR,MOA,MON                                                                     
GL3C9    DC    AL1(RCLELQ,GL3C9X-GL3C9,09,13,RCLACCM+RCLNEWEL,RCLDICT)          
         DC    AL1(0,0,0,RCLMODT,RCLMON,0,0,0)                                  
         DC    AL1(0,06,06,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSCRA)                                                    
         DC    AL2(AC#RSMOA+X'8000')                                            
         DC    AL2(AC#RSRMO+X'8000')                                            
         DC    C'Credit'                                                        
GL3C9X   EQU   *                                                                
*                                                                               
*BAL,M,MON                                                                      
GL3C10   DC    AL1(RCLELQ,GL3C10X-GL3C10,10,13)                                 
         DC    AL1(RCLACCM+RCLNEWEL,RCLDICT)                                    
         DC    AL1(0,0,0,RCLMODT,RCLMON,0,0,0)                                  
         DC    AL1(0,06,07,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSBAL)                                                    
         DC    AL2(AC#RSMOA+X'8000')                                            
         DC    AL2(AC#RSRMO+X'8000')                                            
         DC    C'Balance'                                                       
GL3C10X  EQU   *                                                                
*                                                                               
*CC,CODE                                                                        
GL3C11   DC    AL1(RCLELQ,GL3C11X-GL3C11,11,06)                                 
         DC    AL1(RCLNEWEL,RCLCODE+RCLDICT)                                    
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,06,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSCLC)                                                    
         DC    AL2(AC#RSCOD+X'C000')                                            
         DC    C'Client'                                                        
GL3C11X  EQU   *                                                                
*                                                                               
*CN,NAME                                                                        
GL3C12   DC    AL1(RCLELQ,GL3C12X-GL3C12,12,06)                                 
         DC    AL1(RCLNEWEL,RCLNAME+RCLDICT)                                    
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,11,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSCLN)                                                    
         DC    AL2(AC#RSNAM)                                                    
         DC    C'Client Name'                                                   
GL3C12X  EQU   *                                                                
*                                                                               
*PR,CODE                                                                        
GL3C13   DC    AL1(RCLELQ,GL3C13X-GL3C13,13,07)                                 
         DC    AL1(RCLNEWEL,RCLCODE+RCLDICT)                                    
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,07,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSPRC)                                                    
         DC    AL2(AC#RSCOD+X'C000')                                            
         DC    C'Product'                                                       
GL3C13X  EQU   *                                                                
*                                                                               
*MCN,NAME                                                                       
GL3C14   DC    AL1(RCLELQ,GL3C14X-GL3C14,14,06,RCLNEWEL)                        
         DC    AL1(RCLNAME+RCLDICT)                                             
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,06,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSMCN)                                                    
         DC    AL2(AC#CODEN+X'C000')                                            
         DC    C'Media Name'                                                    
GL3C14X  EQU   *                                                                
*                                                                               
*BREF                                                                           
GL3C15   DC    AL1(RCLELQ,GL3C15X-GL3C15,15,09)                                 
         DC    AL1(RCLNEWEL,RCLCODE+RCLDICT)                                    
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,05,09)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSBRF)                                                    
         DC    C'Batch'                                                         
         DC    C'Reference'                                                     
GL3C15X  EQU   *                                                                
*                                                                               
*ADTE                                                                           
GL3C16   DC    AL1(RCLELQ,GL3C16X-GL3C16,16,10)                                 
         DC    AL1(RCLNEWEL,RCLCODE+RCLDICT)                                    
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,08,04)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSADT)                                                    
         DC    C'Activity'                                                      
         DC    C'Date'                                                          
GL3C16X  EQU   *                                                                
*                                                                               
*NARR                                                                           
GL3C17   DC    AL1(RCLELQ,GL3C17X-GL3C17,17,36)                                 
         DC    AL1(RCLNEWEL,RCLCODE+RCLDICT)                                    
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,09,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSNAR)                                                    
         DC    C'Narrative'                                                     
GL3C17X  EQU   *                                                                
*                                                                               
GL3PF    DC    AL1(RPFELQ,GL3PFX-GL3PF,RPFBOX+RPFMCASE)                         
         DC    AL1(RPFEDCMA+RPFEDTRL)                                           
         DC    C'2P'                                                            
         DC    AL1(RPFNALPV)                                                    
*        DC    XL33'00'                                                         
         DC    XL17'00'                                                         
         DC    AL1(RPFTYP56)                                                    
         DC    XL15'00'                                                         
         DC    C' '                                                             
         DC    X'7F5E7A'                                                        
         DC    XL16'00'                                                         
GL3PFX   EQU   *                                                                
*                                                                               
GL3FL    DC    AL1(RFLELQ,GL3FLX-GL3FL,0,RFLLDG,0,0)                            
         DC    C'GP'                                                            
GL3FLX   EQU   *                                                                
*                                                                               
GL3EX    DC    AL1(FFTELQ,GL3EXX-GL3EX,FFTTEEXT,0,03)                           
         DC    C'FPL'                                                           
GL3EXX   EQU   *                                                                
*                                                                               
         DC    X'00'                                                            
GL3LNQ   EQU   *-GL3F                                                           
*                                                                               
*---------------------------------------------------------------------*         
* FPL5                                                                          
*---------------------------------------------------------------------*         
GL5F     DS    0C                                                               
         FMT   CODE=FPL5,NAME='Transaction Details (YTD)'                       
*                                                                               
GL5STY   DC    AL1(STYELQ,STYLNQ,199)                                           
         DC    AL1(ESC#LFJT),AL2(AC#GLG),AL1(6),CL2' '                          
         DC    AL1(0,STYSACNT,0)                                                
* ROWS                                                                          
* ACC,BOTH                                                                      
GL5R1    DC    AL1(RRWELQ,GL5R1X-GL5R1,01)                                      
         DC    AL1(RRWPAGE+RRWNAME+RRWCODE+RRWNEWEL)                            
         DC    AL1(RRWLHEAD,RRWDICT,0,0,0,04)                                   
         DC    AL1(07,0,0,0,0,0,0)                                              
         DC    AL2(AC#RSACC)                                                    
         DC    AL2(AC#RSCAN+X'C000')                                            
         DC    C'Account'                                                       
GL5R1X   EQU   *                                                                
*                                                                               
* MOA                                                                           
GL5R2    DC    AL1(RRWELQ,GL5R2X-GL5R2,02)                                      
         DC    AL1(RRWPAGE+RRWNAME+RRWCODE+RRWNEWEL)                            
         DC    AL1(RRWLHEAD,RRWDICT,0,0,0,02)                                   
         DC    AL1(14,0,0,0,0,0,0)                                              
         DC    AL2(AC#RSMOA)                                                    
         DC    C'MOA'                                                           
GL5R2X   EQU   *                                                                
*                                                                               
*CAC,BOTH                                                                       
GL5R3    DC    AL1(RRWELQ,GL5R3X-GL5R3,03)                                      
         DC    AL1(RRWPAGE+RRWNAME+RRWCODE+RRWNEWEL)                            
         DC    AL1(RRWLHEAD,RRWDICT,0,0,0,04)                                   
         DC    AL1(14,0,0,0,0,0,0)                                              
         DC    AL2(AC#RSCOC)                                                    
         DC    AL2(AC#RSCAN+X'C000')                                            
         DC    C'Contra Account'                                                
GL5R3X   EQU   *                                                                
*                                                                               
*                                                                               
* COLUMNS                                                                       
*                                                                               
* TADTE                                                                         
GL5C1    DC    AL1(RCLELQ,GL5C1X-GL5C1,01,10,RCLNEWEL,RCLCODE+RCLDICT)          
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,04,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSTAD)                                                    
         DC    C'Date'                                                          
GL5C1X   EQU   *                                                                
*                                                                               
*REF                                                                            
GL5C2    DC    AL1(RCLELQ,GL5C2X-GL5C2,02,09,RCLNEWEL,RCLCODE+RCLDICT)          
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,09,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSREF)                                                    
         DC    C'Reference'                                                     
GL5C2X   EQU   *                                                                
*                                                                               
*                                                                               
*OFC,CODE                                                                       
GL5C3    DC    AL1(RCLELQ,GL5C3X-GL5C3,03,06,RCLNEWEL,RCLCODE+RCLDICT)          
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,06,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSOFF)                                                    
         DC    AL2(AC#RSCOD+X'C000')                                            
         DC    C'Office'                                                        
GL5C3X   EQU   *                                                                
*                                                                               
*OFN,NAME                                                                       
GL5C4    DC    AL1(RCLELQ,GL5C4X-GL5C4,04,06,RCLNEWEL)                          
         DC    AL1(RCLNAME+RCLDICT)                                             
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,11,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSOFF)                                                    
         DC    AL2(AC#RSNAM)                                                    
         DC    C'Office Name'                                                   
GL5C4X   EQU   *                                                                
*                                                                               
*DEPTC,CODE                                                                     
GL5C5    DC    AL1(RCLELQ,GL5C5X-GL5C5,05,10,RCLNEWEL,RCLCODE+RCLDICT)          
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,10,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSDPC)                                                    
         DC    AL2(AC#RSCOD+X'C000')                                            
         DC    C'Department'                                                    
GL5C5X   EQU   *                                                                
*                                                                               
*PERSC,CODE                                                                     
GL5C6    DC    AL1(RCLELQ,GL5C6X-GL5C6,06,08,RCLNEWEL,RCLCODE+RCLDICT)          
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,06,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSPSC)                                                    
         DC    AL2(AC#RSCOD+X'C000')                                            
         DC    C'Person'                                                        
GL5C6X   EQU   *                                                                
*                                                                               
*DR,MOA,YTD                                                                     
GL5C7    DC    AL1(RCLELQ,GL5C7X-GL5C7,07,13,RCLACCM+RCLNEWEL,RCLDICT)          
         DC    AL1(0,0,0,RCLMODT,RCLTODTE+RCLYEAR,0,0,0)                        
         DC    AL1(0,06,05,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSDRA)                                                    
         DC    AL2(AC#RSMOA+X'8000')                                            
         DC    AL2(AC#RSRMO+X'8000')                                            
         DC    C'Debit'                                                         
GL5C7X   EQU   *                                                                
*                                                                               
*CR,MOA,YTD                                                                     
GL5C8    DC    AL1(RCLELQ,GL5C8X-GL5C8,08,13,RCLACCM+RCLNEWEL,RCLDICT)          
         DC    AL1(0,0,0,RCLMODT,RCLTODTE+RCLYEAR,0,0,0)                        
         DC    AL1(0,06,06,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSCRA)                                                    
         DC    AL2(AC#RSMOA+X'8000')                                            
         DC    AL2(AC#RSRMO+X'8000')                                            
         DC    C'Credit'                                                        
GL5C8X   EQU   *                                                                
*                                                                               
*BAL,M,YTD                                                                      
GL5C9    DC    AL1(RCLELQ,GL5C9X-GL5C9,09,13,RCLACCM+RCLNEWEL,RCLDICT)          
         DC    AL1(0,0,0,RCLMODT,RCLTODTE+RCLYEAR,0,0,0)                        
         DC    AL1(0,06,07,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSBAL)                                                    
         DC    AL2(AC#RSMOA+X'8000')                                            
         DC    AL2(AC#RSRY2+X'8000')                                            
         DC    C'Balance'                                                       
GL5C9X   EQU   *                                                                
*                                                                               
*CC,CODE                                                                        
GL5C10   DC    AL1(RCLELQ,GL5C10X-GL5C10,10,06)                                 
         DC    AL1(RCLNEWEL,RCLCODE+RCLDICT)                                    
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,06,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSCLC)                                                    
         DC    AL2(AC#RSCOD+X'C000')                                            
         DC    C'Client'                                                        
GL5C10X  EQU   *                                                                
*                                                                               
*CN,NAME                                                                        
GL5C11   DC    AL1(RCLELQ,GL5C11X-GL5C11,11,06)                                 
         DC    AL1(RCLNEWEL,RCLNAME+RCLDICT)                                    
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,11,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSCLN)                                                    
         DC    AL2(AC#RSNAM)                                                    
         DC    C'Client Name'                                                   
GL5C11X  EQU   *                                                                
*                                                                               
*PR,CODE                                                                        
GL5C12   DC    AL1(RCLELQ,GL5C12X-GL5C12,12,07)                                 
         DC    AL1(RCLNEWEL,RCLCODE+RCLDICT)                                    
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,07,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSPRC)                                                    
         DC    AL2(AC#RSCOD+X'C000')                                            
         DC    C'Product'                                                       
GL5C12X  EQU   *                                                                
*                                                                               
*MCN,NAME                                                                       
GL5C13   DC    AL1(RCLELQ,GL5C13X-GL5C13,13,06,RCLNEWEL)                        
         DC    AL1(RCLNAME+RCLDICT)                                             
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,06,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSMCN)                                                    
         DC    AL2(AC#CODEN+X'C000')                                            
         DC    C'Media Name'                                                    
GL5C13X  EQU   *                                                                
*                                                                               
*BREF                                                                           
GL5C14   DC    AL1(RCLELQ,GL5C14X-GL5C14,14,09)                                 
         DC    AL1(RCLNEWEL,RCLCODE+RCLDICT)                                    
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,05,09)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSBRF)                                                    
         DC    C'Batch'                                                         
         DC    C'Reference'                                                     
GL5C14X  EQU   *                                                                
*                                                                               
*ADTE                                                                           
GL5C15   DC    AL1(RCLELQ,GL5C15X-GL5C15,15,10)                                 
         DC    AL1(RCLNEWEL,RCLCODE+RCLDICT)                                    
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,08,04)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSADT)                                                    
         DC    C'Activity'                                                      
         DC    C'Date'                                                          
GL5C15X  EQU   *                                                                
*                                                                               
*NARR                                                                           
GL5C16   DC    AL1(RCLELQ,GL5C16X-GL5C16,16,36)                                 
         DC    AL1(RCLNEWEL,RCLCODE+RCLDICT)                                    
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,09,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSNAR)                                                    
         DC    C'Narrative'                                                     
GL5C16X  EQU   *                                                                
*                                                                               
GL5PF    DC    AL1(RPFELQ,GL5PFX-GL5PF,RPFBOX+RPFMCASE)                         
         DC    AL1(RPFEDCMA+RPFEDTRL)                                           
         DC    C'2P'                                                            
         DC    AL1(RPFNALPV)                                                    
*        DC    XL33'00'                                                         
         DC    XL17'00'                                                         
         DC    AL1(RPFTYP56)                                                    
*        DC    XL15'00'                                                         
         DC    XL10'00'                                                         
         DC    X'17'                                                            
         DC    XL4'00'                                                          
         DC    C' '                                                             
         DC    X'7F5E7A'                                                        
         DC    XL16'00'                                                         
GL5PFX   EQU   *                                                                
*                                                                               
GL5FL    DC    AL1(RFLELQ,GL5FLX-GL5FL,0,RFLLDG,0,0)                            
         DC    C'GP'                                                            
GL5FLX   EQU   *                                                                
*                                                                               
GL5EX    DC    AL1(FFTELQ,GL5EXX-GL5EX,FFTTEEXT,0,03)                           
         DC    C'FPL'                                                           
GL5EXX   EQU   *                                                                
*                                                                               
         DC    X'00'                                                            
GL5LNQ   EQU   *-GL5F                                                           
         EJECT                                                                  
*---------------------------------------------------------------------*         
* @DCHEK                                                                        
*---------------------------------------------------------------------*         
DL1F     DS    0C                                                               
         FMT   CODE=@DCHEK,NAME='RDR output file'                               
         REPT2 AC#RSPAY                                                         
*                                                                               
* COLUMNS                                                                       
*                                                                               
* STATIC (30900)                                                                
DL1C1    DC    AL1(RCLELQ,DL1C1X-DL1C1,01,05,RCLNEWEL,RCLNAME+RCLDICT)          
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,05,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSSIC)                                                    
         DC    C'30900'                                                         
DL1C1X   EQU   *                                                                
*                                                                               
* STATIC (A)                                                                    
DL1C2    DC    AL1(RCLELQ,DL1C2X-DL1C2,02,01,RCLNEWEL,RCLNAME+RCLDICT)          
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,01,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSSIC)                                                    
         DC    C'A'                                                             
DL1C2X   EQU   *                                                                
*                                                                               
* RQDT                                                                          
DL1C3    DC    AL1(RCLELQ,DL1C3X-DL1C3,03,17,RCLNEWEL,RCLCODE+RCLDICT)          
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,08,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSRDT)                                                    
         DC    C'DateTime'                                                      
DL1C3X   EQU   *                                                                
*                                                                               
* AN                                                                            
DL1C4    DC    AL1(RCLELQ,DL1C4X-DL1C4,04,36,RCLNEWEL,RCLNAME+RCLDICT)          
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,06,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSAGN)                                                    
         DC    C'Agency'                                                        
DL1C4X   EQU   *                                                                
*                                                                               
*ACC,CODE                                                                       
DL1C5    DC    AL1(RCLELQ,DL1C5X-DL1C5,05,12,RCLNEWEL,RCLCODE+RCLDICT)          
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,07,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSACC)                                                    
         DC    AL2(AC#RSCAN+X'C000')                                            
         DC    C'Account'                                                       
DL1C5X   EQU   *                                                                
*                                                                               
*OFC,CODE                                                                       
DL1C6    DC    AL1(RCLELQ,DL1C6X-DL1C6,06,02,RCLNEWEL,RCLCODE+RCLDICT)          
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,06,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSOFF)                                                    
         DC    AL2(AC#RSCOD+X'C000')                                            
         DC    C'Office'                                                        
DL1C6X   EQU   *                                                                
*                                                                               
*CAC,CODE                                                                       
DL1C7    DC    AL1(RCLELQ,DL1C7X-DL1C7,07,14,RCLNEWEL,RCLCODE+RCLDICT)          
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,06,07)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSCOC)                                                    
         DC    AL2(AC#RSCOD+X'C000')                                            
         DC    C'Contra'                                                        
         DC    C'Account'                                                       
DL1C7X   EQU   *                                                                
*                                                                               
*INV                                                                            
DL1C8    DC    AL1(RCLELQ,DL1C8X-DL1C8,08,20,RCLNEWEL,RCLCODE+RCLDICT)          
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,07,06)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSINV)                                                    
         DC    C'Invoice'                                                       
         DC    C'Number'                                                        
DL1C8X   EQU   *                                                                
*                                                                               
*TADTE                                                                          
DL1C9    DC    AL1(RCLELQ,DL1C9X-DL1C9,09,8,RCLNEWEL,RCLCODE+RCLDICT)           
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,08,04)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSTAD)                                                    
         DC    C'Transact'                                                      
         DC    C'Date'                                                          
DL1C9X   EQU   *                                                                
*                                                                               
*CKNO                                                                           
DL1C10   DC    AL1(RCLELQ,DL1C10X-DL1C10,10,6,RCLNEWEL,RCLCODE+RCLDICT)         
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,05,06)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSCNO)                                                    
         DC    C'Check'                                                         
         DC    C'Number'                                                        
DL1C10X  EQU   *                                                                
*                                                                               
*CDTE                                                                           
DL1C11   DC    AL1(RCLELQ,DL1C11X-DL1C11,11,8,RCLNEWEL,RCLCODE+RCLDICT)         
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,05,04)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSCDT)                                                    
         DC    C'Check'                                                         
         DC    C'Date'                                                          
DL1C11X  EQU   *                                                                
*                                                                               
*SEQ#                                                                           
DL1C12   DC    AL1(RCLELQ,DL1C12X-DL1C12,12,4,RCLNEWEL,RCLCODE+RCLDICT)         
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,08,01)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSSQN)                                                    
         DC    C'Sequence'                                                      
         DC    C'#'                                                             
DL1C12X  EQU   *                                                                
*                                                                               
*ACC,NAME                                                                       
DL1C13   DC    AL1(RCLELQ,DL1C13X-DL1C13,13,36)                                 
         DC    AL1(RCLNEWEL,RCLNAME+RCLDICT)                                    
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,07,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSACC)                                                    
         DC    AL2(AC#RSNAM+X'C000')                                            
         DC    C'Account'                                                       
DL1C13X  EQU   *                                                                
*                                                                               
*DR,TADT,PER                                                                    
DL1C14   DC    AL1(RCLELQ,DL1C14X-DL1C14,14,13)                                 
         DC    AL1(RCLACCM+RCLNEWEL,RCLDICT)                                    
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,06,0,0)                                                    
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSDRA)                                                    
         DC    AL2(AC#RSTDT+X'C000')                                            
         DC    AL2(AC#RSRPE+X'8000')                                            
DL1C14X  EQU   *                                                                
*                                                                               
*ADTE                                                                           
DL1C15   DC    AL1(RCLELQ,DL1C15X-DL1C15,15,8)                                  
         DC    AL1(RCLNEWEL,RCLCODE+RCLDICT)                                    
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,05,04)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSADT)                                                    
         DC    C'Activ'                                                         
         DC    C'Date'                                                          
DL1C15X  EQU   *                                                                
*                                                                               
*PAYMTC                                                                         
DL1C16   DC    AL1(RCLELQ,DL1C16X-DL1C16,16,36,RCLNEWEL)                        
         DC    AL1(RCLCODE+RCLDICT)                                             
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,07,07)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSPMC)                                                    
         DC    C'Payment'                                                       
         DC    C'Company'                                                       
DL1C16X  EQU   *                                                                
*                                                                               
* Profile                                                                       
*                                                                               
DL1P1    DC    AL1(RPFELQ,DL1P1X-DL1P1,0,RPFEDLED),C'2P',AL1(RPFNALPV)          
         DC    29X'00'                                                          
         DC    AL1(RPFDDOWN+RPFDNCOL,0,RPFNOCHD,0)                              
         DC    X'5E004000'                                                      
         DC    14X'00'                                                          
         DC    AL1(RPFDNRPG,0)                                                  
DL1P1X   EQU   *                                                                
*                                                                               
* Pay Prof                                                                      
*                                                                               
DL1FL    DC    AL1(RFLELQ,DL1FLX-DL1FL,0,RFLLDG,0,0)                            
         DC    C'SP',AL1(1),C'SQ',AL1(1),C'SS',AL1(1),C'ST'                     
         DC    AL1(1),C'SU',AL1(1),C'SV',AL1(1),C'SW'                           
         DC    AL1(1),C'SX',AL1(1),C'SY'                                        
DL1FLX   EQU   *                                                                
*                                                                               
DL1FA    DC    AL1(RFLELQ,DL1FAX-DL1FA,0,RFLACC,0,RFLWILD)                      
         DC    C'SP?',AL1(1),C'SQ?',AL1(1),C'SS?',AL1(1),C'ST?'                 
         DC    AL1(1),C'SU?',AL1(1),C'SV?',AL1(1),C'SW?'                        
         DC    AL1(1),C'SX?',AL1(1),C'SY?'                                      
DL1FAX   EQU   *                                                                
*&&DO                                                                           
DL1EX    DC    AL1(FFTELQ,DL1EXX-DL1EX,FFTTEEXT,0,03)                           
         DC    C'FPL'                                                           
DL1EXX   EQU   *                                                                
*&&                                                                             
         DC    X'00'                                                            
DL1LNQ   EQU   *-DL1F                                                           
*&&                                                                             
*          UK formats                                                           
*&&UK                                                                           
GL1F     DS    0C                                                               
         FMT   CODE=FPL1,NAME='Transaction Details'                             
         REPTY AC#GLG,RTYPE                                                     
*        REPTY AC#RS540,RTYPE                                                   
* ROWS                                                                          
*        ROW   KEYWORD=AC#RSA1C,SHOW=B,LEVEL=Y,DICT=Y,HEADING=L                 
*        ROW   KEYWORD=AC#RSA2C,SHOW=B,LEVEL=Y,DICT=Y,HEADING=L                 
*        ROW   KEYWORD=AC#RSA3C,SHOW=B,LEVEL=Y,DICT=Y,HEADING=L                 
*        ROW   KEYWORD=AC#RSA4C,SHOW=B,LEVEL=Y,DICT=Y,HEADING=L                 
*        ROW   KEYWORD=AC#RSOFF,SHOW=B,DICT=Y,PREFIX=Office                     
*        ROW   KEYWORD=AC#RSCOC,SHOW=B,DICT=Y,PREFIX=Source                     
*                                                                               
* ROWS                                                                          
* ACC,BOTH                                                                      
RW1      DC    AL1(RRWELQ,RW1X-RW1,01,RRWPAGE+RRWNAME+RRWCODE+RRWNEWEL)         
         DC    AL1(RRWLHEAD,RRWDICT,0,0,0,04)                                   
         DC    AL1(07,0,0,0,0,0,0)                                              
         DC    AL2(AC#RSACC)                                                    
         DC    AL2(AC#RSCAN+X'C000')                                            
         DC    C'Account'                                                       
RW1X     EQU   *                                                                
*                                                                               
*CAC,BOTH                                                                       
RW2      DC    AL1(RRWELQ,RW2X-RW2,02,RRWPAGE+RRWNAME+RRWCODE+RRWNEWEL)         
         DC    AL1(RRWLHEAD,RRWDICT,0,0,0,04)                                   
         DC    AL1(14,0,0,0,0,0,0)                                              
         DC    AL2(AC#RSCOC)                                                    
         DC    AL2(AC#RSCAN+X'C000')                                            
         DC    C'Contra Account'                                                
RW2X     EQU   *                                                                
*                                                                               
*                                                                               
* COLUMNS                                                                       
*                                                                               
* TADTE                                                                         
C1       DC    AL1(RCLELQ,C1X-C1,01,10,RCLNEWEL,RCLCODE+RCLDICT)                
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,04,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSTAD)                                                    
         DC    C'Date'                                                          
C1X      EQU   *                                                                
*                                                                               
*REF                                                                            
C2       DC    AL1(RCLELQ,C2X-C2,02,09,RCLNEWEL,RCLCODE+RCLDICT)                
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,09,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSREF)                                                    
         DC    C'Reference'                                                     
C2X      EQU   *                                                                
*                                                                               
*                                                                               
*OFC,CODE                                                                       
C3       DC    AL1(RCLELQ,C3X-C3,03,06,RCLNEWEL,RCLCODE+RCLDICT)                
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,06,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSOFF)                                                    
         DC    AL2(AC#RSCOD+X'C000')                                            
         DC    C'Office'                                                        
C3X      EQU   *                                                                
*                                                                               
*BREF                                                                           
C4       DC    AL1(RCLELQ,C4X-C4,04,09,RCLNEWEL,RCLCODE+RCLDICT)                
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,05,09)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSBRF)                                                    
         DC    C'Batch'                                                         
         DC    C'Reference'                                                     
C4X      EQU   *                                                                
*                                                                               
*DR,MOA,MON                                                                     
C5       DC    AL1(RCLELQ,C5X-C5,05,13,RCLACCM+RCLNEWEL,RCLDICT)                
         DC    AL1(0,0,0,RCLMODT,RCLMON,0,0,0)                                  
         DC    AL1(0,06,05,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSDRA)                                                    
         DC    AL2(AC#RSMOA+X'8000')                                            
         DC    AL2(AC#RSRMO+X'8000')                                            
         DC    C'Debit'                                                         
C5X      EQU   *                                                                
*                                                                               
*CR,MOA,MON                                                                     
C6       DC    AL1(RCLELQ,C6X-C6,06,13,RCLACCM+RCLNEWEL,RCLDICT)                
         DC    AL1(0,0,0,RCLMODT,RCLMON,0,0,0)                                  
         DC    AL1(0,06,06,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSCRA)                                                    
         DC    AL2(AC#RSMOA+X'8000')                                            
         DC    AL2(AC#RSRMO+X'8000')                                            
         DC    C'Credit'                                                        
C6X      EQU   *                                                                
*                                                                               
*CC,CODE                                                                        
C7       DC    AL1(RCLELQ,C7X-C7,07,06,RCLNEWEL,RCLCODE+RCLDICT)                
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,06,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSCLC)                                                    
         DC    AL2(AC#RSCOD+X'C000')                                            
         DC    C'Client'                                                        
C7X      EQU   *                                                                
*                                                                               
*PR,CODE                                                                        
C8       DC    AL1(RCLELQ,C8X-C8,08,07,RCLNEWEL,RCLCODE+RCLDICT)                
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,07,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSPRC)                                                    
         DC    AL2(AC#RSCOD+X'C000')                                            
         DC    C'Product'                                                       
C8X      EQU   *                                                                
*                                                                               
*DEPTC,CODE                                                                     
C9       DC    AL1(RCLELQ,C9X-C9,09,10,RCLNEWEL,RCLCODE+RCLDICT)                
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,10,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSDPC)                                                    
         DC    AL2(AC#RSCOD+X'C000')                                            
         DC    C'Department'                                                    
C9X      EQU   *                                                                
*                                                                               
*PERSC,CODE                                                                     
C10      DC    AL1(RCLELQ,C10X-C10,10,08,RCLNEWEL,RCLCODE+RCLDICT)              
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,06,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSPSC)                                                    
         DC    AL2(AC#RSCOD+X'C000')                                            
         DC    C'Person'                                                        
C10X     EQU   *                                                                
*                                                                               
*NARR                                                                           
C11      DC    AL1(RCLELQ,C11X-C11,11,36,RCLNEWEL,RCLCODE+RCLDICT)              
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,09,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSNAR)                                                    
         DC    C'Narrative'                                                     
C11X     EQU   *                                                                
*                                                                               
*ADTE                                                                           
C12      DC    AL1(RCLELQ,C12X-C12,12,10,RCLNEWEL,RCLCODE+RCLDICT)              
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,08,04)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSADT)                                                    
         DC    C'Activity'                                                      
         DC    C'Date'                                                          
C12X     EQU  *                                                                 
*                                                                               
*                                                                               
PRF1     DC    AL1(RPFELQ,PRF1X-PRF1,RPFBOX+RPFMCASE,RPFEDCMA+RPFEDTRL)         
         DC    C'2P'                                                            
         DC    AL1(RPFNALPV)                                                    
         DC    XL33'00'                                                         
         DC    C' '                                                             
         DC    X'7F5E7A'                                                        
         DC    XL16'00'                                                         
PRF1X    EQU   *                                                                
*                                                                               
FLT1     DC    AL1(RFLELQ,FLT1X-FLT1,0,RFLLDG,0,0)                              
         DC    C'GB'                                                            
FLT1X    EQU   *                                                                
*                                                                               
EXT1     DC    AL1(FFTELQ,EXT1X-EXT1,FFTTEEXT,0,03)                             
         DC    C'FPL'                                                           
EXT1X    EQU   *                                                                
*                                                                               
         DC    X'00'                                                            
FPLFLNQ  EQU   *-GL1F                                                           
*                                                                               
*---------------------------------------------------------------------*         
* Generate formats for balance sheet                                            
*---------------------------------------------------------------------*         
GL2F     DS    0C                                                               
         FMT   CODE=FBS1,NAME='Transaction Details'                             
         REPTY AC#GLG,RBTYPE                                                    
*        REPTY AC#RS540,RBTYPE                                                  
* ROWS                                                                          
*        ROW   KEYWORD=AC#RSA1C,SHOW=B,LEVEL=Y,DICT=Y,HEADING=L                 
*        ROW   KEYWORD=AC#RSA2C,SHOW=B,LEVEL=Y,DICT=Y,HEADING=L                 
*        ROW   KEYWORD=AC#RSA3C,SHOW=B,LEVEL=Y,DICT=Y,HEADING=L                 
*        ROW   KEYWORD=AC#RSA4C,SHOW=B,LEVEL=Y,DICT=Y,HEADING=L                 
*        ROW   KEYWORD=AC#RSOFF,SHOW=B,DICT=Y,PREFIX=Office                     
*        ROW   KEYWORD=AC#RSCOC,SHOW=B,DICT=Y,PREFIX=Source                     
*                                                                               
* ROWS                                                                          
* ACC,BOTH                                                                      
RWB1     DC    AL1(RRWELQ,RWB1X-RWB1,01)                                        
         DC    AL1(RRWPAGE+RRWNAME+RRWCODE+RRWNEWEL)                            
         DC    AL1(RRWLHEAD,RRWDICT,0,0,0,04)                                   
         DC    AL1(07,0,0,0,0,0,0)                                              
         DC    AL2(AC#RSACC)                                                    
         DC    AL2(AC#RSCAN+X'C000')                                            
         DC    C'Account'                                                       
RWB1X    EQU   *                                                                
*                                                                               
*CAC,BOTH                                                                       
RWB2     DC    AL1(RRWELQ,RWB2X-RWB2,02)                                        
         DC    AL1(RRWPAGE+RRWNAME+RRWCODE+RRWNEWEL)                            
         DC    AL1(RRWLHEAD,RRWDICT,0,0,0,04)                                   
         DC    AL1(14,0,0,0,0,0,0)                                              
         DC    AL2(AC#RSCOC)                                                    
         DC    AL2(AC#RSCAN+X'C000')                                            
         DC    C'Contra Account'                                                
RWB2X    EQU   *                                                                
*                                                                               
*                                                                               
* COLUMNS                                                                       
*                                                                               
* TADTE                                                                         
CB1      DC    AL1(RCLELQ,CB1X-CB1,01,10,RCLNEWEL,RCLCODE+RCLDICT)              
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,04,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSTAD)                                                    
         DC    C'Date'                                                          
CB1X     EQU   *                                                                
*                                                                               
*REF                                                                            
CB2      DC    AL1(RCLELQ,CB2X-CB2,02,09,RCLNEWEL,RCLCODE+RCLDICT)              
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,09,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSREF)                                                    
         DC    C'Reference'                                                     
CB2X     EQU   *                                                                
*                                                                               
*                                                                               
*OFC,CODE                                                                       
CB3      DC    AL1(RCLELQ,CB3X-CB3,03,06,RCLNEWEL,RCLCODE+RCLDICT)              
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,06,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSOFF)                                                    
         DC    AL2(AC#RSCOD+X'C000')                                            
         DC    C'Office'                                                        
CB3X     EQU   *                                                                
*                                                                               
*BREF                                                                           
CB4      DC    AL1(RCLELQ,CB4X-CB4,04,09,RCLNEWEL,RCLCODE+RCLDICT)              
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,05,09)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSBRF)                                                    
         DC    C'Batch'                                                         
         DC    C'Reference'                                                     
CB4X     EQU   *                                                                
*                                                                               
*DR,MOA,MON                                                                     
CB5      DC    AL1(RCLELQ,CB5X-CB5,05,13,RCLACCM+RCLNEWEL,RCLDICT)              
         DC    AL1(0,0,0,RCLMODT,RCLMON,0,0,0)                                  
         DC    AL1(0,06,05,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSDRA)                                                    
         DC    AL2(AC#RSMOA+X'8000')                                            
         DC    AL2(AC#RSRMO+X'8000')                                            
         DC    C'Debit'                                                         
CB5X     EQU   *                                                                
*                                                                               
*CR,MOA,MON                                                                     
CB6      DC    AL1(RCLELQ,CB6X-CB6,06,13,RCLACCM+RCLNEWEL,RCLDICT)              
         DC    AL1(0,0,0,RCLMODT,RCLMON,0,0,0)                                  
         DC    AL1(0,06,06,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSCRA)                                                    
         DC    AL2(AC#RSMOA+X'8000')                                            
         DC    AL2(AC#RSRMO+X'8000')                                            
         DC    C'Credit'                                                        
CB6X     EQU   *                                                                
*                                                                               
*CC,CODE                                                                        
CB7      DC    AL1(RCLELQ,CB7X-CB7,07,06,RCLNEWEL,RCLCODE+RCLDICT)              
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,06,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSCLC)                                                    
         DC    AL2(AC#RSCOD+X'C000')                                            
         DC    C'Client'                                                        
CB7X     EQU   *                                                                
*                                                                               
*PR,CODE                                                                        
CB8      DC    AL1(RCLELQ,CB8X-CB8,08,07,RCLNEWEL,RCLCODE+RCLDICT)              
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,04,07,0)                                                   
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSPRC)                                                    
         DC    AL2(AC#RSCOD+X'C000')                                            
         DC    C'Product'                                                       
CB8X     EQU   *                                                                
*                                                                               
*NARR                                                                           
CB9      DC    AL1(RCLELQ,CB9X-CB9,09,36,RCLNEWEL,RCLCODE+RCLDICT)              
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,09,00)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSNAR)                                                    
         DC    C'Narrative'                                                     
CB9X     EQU   *                                                                
*                                                                               
*ADTE                                                                           
CB10     DC    AL1(RCLELQ,CB10X-CB10,10,10,RCLNEWEL,RCLCODE+RCLDICT)            
         DC    AL1(0,0,0,0,0,0,0,0)                                             
         DC    AL1(0,02,08,04)                                                  
         DC    AL1(0,0,0,0,0,0,0)                                               
         DC    AL2(AC#RSADT)                                                    
         DC    C'Activity'                                                      
         DC    C'Date'                                                          
CB10X    EQU  *                                                                 
*                                                                               
PRFB1    DC    AL1(RPFELQ,PRFB1X-PRFB1,RPFBOX+RPFMCASE)                         
         DC    AL1(RPFEDCMA+RPFEDTRL)                                           
         DC    C'2P'                                                            
         DC    AL1(RPFNALPV)                                                    
         DC    XL33'00'                                                         
         DC    C' '                                                             
         DC    X'7F5E7A'                                                        
         DC    XL16'00'                                                         
PRFB1X   EQU   *                                                                
*                                                                               
FLTB1    DC    AL1(RFLELQ,FLTB1X-FLTB1,0,RFLLDG,0,0)                            
         DC    C'GB'                                                            
FLTB1X   EQU   *                                                                
*                                                                               
EXTB1    DC    AL1(FFTELQ,EXTB1X-EXTB1,FFTTEEXT,0,03)                           
         DC    C'FBS'                                                           
EXTB1X   EQU   *                                                                
*                                                                               
         DC    X'00'                                                            
FBSFLNQ  EQU   *-GL2F                                                           
*&&                                                                             
* ACREPRLWRK                                                                    
         PRINT OFF                                                              
       ++INCLUDE ACREPRLWRK                                                     
         PRINT ON                                                               
*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*         
FMTLSTD  DSECT                                                                  
FMTLCDE  DS    CL8                 Format code                                  
FMTLADDR DS    AL4                 Address of default format                    
FMTLLNQ  EQU   *-FMTLCDE                                                        
*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*         
