*          DATA SET ACSCRF6D   AT LEVEL 002 AS OF 08/10/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60CF6D      DATE 08/10/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      4    2    7  L  P N             T        Y              
HLPKYWDH DS    CL8                                                              
HLPKYWD  DS    CL6      4   10    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      6    2    7  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      6   41    7  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL28     7   12   28  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL7      7   41    7  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL28     7   51   28  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL21     8    2   21  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL21     8   41   21  A  P N             T        Y              
HLPKYW1H DS    CL8                                                              
HLPKYW1  DS    CL9      9    2    9  A  P H             T        Y              
HLPDSC1H DS    CL8                                                              
HLPDSC1  DS    CL28     9   12   28  A  U N             T        Y              
HLPKYW2H DS    CL8                                                              
HLPKYW2  DS    CL9      9   41    9  A  P H             T        Y              
HLPDSC2H DS    CL8                                                              
HLPDSC2  DS    CL28     9   51   28  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     10    2    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28    10   12   28  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     10   41    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28    10   51   28  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     11    2    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28    11   12   28  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     11   41    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28    11   51   28  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     12    2    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28    12   12   28  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     12   41    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28    12   51   28  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     13    2    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28    13   12   28  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     13   41    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28    13   51   28  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     14    2    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28    14   12   28  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     14   41    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28    14   51   28  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     15    2    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28    15   12   28  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     15   41    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28    15   51   28  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     16    2    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28    16   12   28  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     16   41    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28    16   51   28  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     17    2    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28    17   12   28  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     17   41    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28    17   51   28  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     18    2    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28    18   12   28  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     18   41    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28    18   51   28  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     19    2    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28    19   12   28  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     19   41    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28    19   51   28  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     20    2    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28    20   12   28  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     20   41    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28    20   51   28  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     21    2    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28    21   12   28  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9     21   41    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL28    21   51   28  A  U N             T        Y              
HLPTABH  DS    CL8                                                              
HLPTAB   DS    CL1     22    9    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  L  P H             T        Y  254         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL77    24    3   77  L  P H             T        Y  254         
         DS    CL8                                                              
HLPLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
HLPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1800 BYTES                            
