*          DATA SET ACSCRE1D   AT LEVEL 022 AS OF 06/03/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60CE1D      DATE 06/03/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
RCAF1MNH DS    CL8                                                              
RCAF1MN  DS    CL9      5   15    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL6      5   25    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1      5   32    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   36    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1      5   43    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   47    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1      5   54    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   58    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1      5   65    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      5   69    6  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1      5   76    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL12     6    2   12  A  P H             T        Y              
RCACODEH DS    CL8                                                              
RCACODE  DS    CL8      6   15    8  A  U N             T        Y              
RCAF2PFH DS    CL8                                                              
RCAF2PF  DS    CL8      6   25    8  A  U N             T        Y              
RCAF3PFH DS    CL8                                                              
RCAF3PF  DS    CL8      6   36    8  A  U N             T        Y              
RCAF4PFH DS    CL8                                                              
RCAF4PF  DS    CL8      6   47    8  A  U N             T        Y              
RCAF5PFH DS    CL8                                                              
RCAF5PF  DS    CL8      6   58    8  A  U N             T        Y              
RCAF6PFH DS    CL8                                                              
RCAF6PF  DS    CL8      6   69    8  A  U N             T        Y              
RCAPROFH DS    CL8                                                              
RCAPROF  DS    CL12     7    2   12  A  P H             T        Y              
RCAF1PRH DS    CL8                                                              
RCAF1PR  DS    CL6      7   15    6  A  P N             T        Y              
RCAF2PRH DS    CL8                                                              
RCAF2PR  DS    CL6      7   25    6  A  U N             T        Y              
RCAF3PRH DS    CL8                                                              
RCAF3PR  DS    CL6      7   36    6  A  U N             T        Y              
RCAF4PRH DS    CL8                                                              
RCAF4PR  DS    CL6      7   47    6  A  U N             T        Y              
RCAF5PRH DS    CL8                                                              
RCAF5PR  DS    CL6      7   58    6  A  U N             T        Y              
RCAF6PRH DS    CL8                                                              
RCAF6PR  DS    CL6      7   69    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     8    2   12  A  P H             T        Y              
RCAF1INH DS    CL8                                                              
RCAF1IN  DS    CL1      8   15    1  A  P N             T        Y              
RCAF2INH DS    CL8                                                              
RCAF2IN  DS    CL1      8   25    1  A  U N             T        Y              
RCAF3INH DS    CL8                                                              
RCAF3IN  DS    CL1      8   36    1  A  U N             T        Y              
RCAF4INH DS    CL8                                                              
RCAF4IN  DS    CL1      8   47    1  A  U N             T        Y              
RCAF5INH DS    CL8                                                              
RCAF5IN  DS    CL1      8   58    1  A  U N             T        Y              
RCAF6INH DS    CL8                                                              
RCAF6IN  DS    CL1      8   69    1  A  U N             T        Y              
RCAF1RHH DS    CL8                                                              
RCAF1RH  DS    CL3     10    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     10    6    2  A  P N             T        Y              
RCAF1R1H DS    CL8                                                              
RCAF1R1  DS    CL6     10   15    6  A  P N             T        Y              
RCAF2R1H DS    CL8                                                              
RCAF2R1  DS    CL6     10   25    6  A  P N             T        Y              
RCAF3R1H DS    CL8                                                              
RCAF3R1  DS    CL6     10   36    6  A  P N             T        Y              
RCAF4R1H DS    CL8                                                              
RCAF4R1  DS    CL6     10   47    6  A  P N             T        Y              
RCAF5R1H DS    CL8                                                              
RCAF5R1  DS    CL6     10   58    6  A  P N             T        Y              
RCAF6R1H DS    CL8                                                              
RCAF6R1  DS    CL6     10   69    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     11    6    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   15    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   25    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   36    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   47    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   58    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   69    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     12    6    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   15    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   25    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   36    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   47    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   58    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   69    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     13    6    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   15    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   25    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   36    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   47    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   58    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   69    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     14    6    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   15    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   25    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   36    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   47    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   58    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   69    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     15    6    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   15    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   25    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   36    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   47    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   58    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   69    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     16    6    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   15    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   25    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   36    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   47    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   58    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   69    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     17    6    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   15    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   25    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   36    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   47    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   58    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   69    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     18    6    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   15    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   25    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   36    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   47    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   58    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   69    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     19    6    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   15    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   25    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   36    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   47    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   58    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   69    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     20    6    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   15    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   25    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   36    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   47    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   58    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   69    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     21    6    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   15    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   25    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   36    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   47    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   58    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   69    6  A  P N             T        Y              
RCATABH  DS    CL8                                                              
RCATAB   DS    CL1     22    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  L  P H             T        Y  254         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL77    24    3   77  L  P H             T        Y  254         
         DS    CL8                                                              
RCALAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
RCAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1888 BYTES                            
