*          DATA SET ACSCRF5D   AT LEVEL 010 AS OF 05/24/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60CF5D      DATE 05/24/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL16     4    2   16  L  P N             T        Y              
RUNCODEH DS    CL8                                                              
RUNCODE  DS    CL9      4   20    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     4   37   16  L  P N             T        Y              
RUNOWNH  DS    CL8                                                              
RUNOWN   DS    CL8      4   55    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     5    2   16  L  P N             T        Y              
RUNOUTH  DS    CL8                                                              
RUNOUT   DS    CL8      5   20    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     5   37   16  L  P N             T        Y              
RUNDESTH DS    CL8                                                              
RUNDEST  DS    CL8      5   55    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     6    2   16  L  P N             T        Y              
RUNPERH  DS    CL8                                                              
RUNPER   DS    CL16     6   20   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     6   37   16  L  P N             T        Y              
RUNOPT2H DS    CL8                                                              
RUNOPT2  DS    CL1      6   55    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     7    2   16  L  P N             T        Y              
RUNUNLH  DS    CL8                                                              
RUNUNL   DS    CL2      7   20    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     7   37   16  L  P N             T        Y              
RUNACCH  DS    CL8                                                              
RUNACC   DS    CL13     7   55   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     8    2   16  L  P N             T        Y              
RUNSTDH  DS    CL8                                                              
RUNSTD   DS    CL10     8   20   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     8   37   16  L  P N             T        Y              
RUNEDDH  DS    CL8                                                              
RUNEDD   DS    CL10     8   55   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     9    2   16  L  P N             T        Y              
RUNMOAH  DS    CL8                                                              
RUNMOA   DS    CL15     9   20   15  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17     9   37   17  L  P N             T        Y              
RUNFRPH  DS    CL8                                                              
RUNFRP   DS    CL1      9   55    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL4     11    7    4  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL9     11   13    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL15    11   23   15  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL9     11   61    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL9     11   71    9  A  P H             T        Y              
RUNSEL1H DS    CL8                                                              
RUNSEL1  DS    CL3     12    2    3  A  U H             T        Y              
RUNLN1H  DS    CL8                                                              
RUNLN1   DS    CL73    12    6   73  A  P N             T        Y              
RUNSEL2H DS    CL8                                                              
RUNSEL2  DS    CL3     13    2    3  A  U H             T        Y              
RUNLN2H  DS    CL8                                                              
RUNLN2   DS    CL73    13    6   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL73    14    6   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL73    15    6   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL73    16    6   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL73    17    6   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL73    18    6   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL73    19    6   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL73    20    6   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL73    21    6   73  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL73    22    6   73  A  P N             T        Y              
RUNTABH  DS    CL8                                                              
RUNTAB   DS    CL1     22   80    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  L  P H             T        Y  253         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    24    2   78  L  P H             T        Y  254         
         DS    CL8                                                              
RUNLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
RUNWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1800 BYTES                            
