*          DATA SET ACSCRF0D   AT LEVEL 002 AS OF 08/10/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60CF0D      DATE 08/10/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL16     4    2   16  L  P H             T        Y              
KWDCODEH DS    CL8                                                              
KWDCODE  DS    CL6      4   20    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     5    2   16  L  P N             T        Y              
KWDDSCPH DS    CL8                                                              
KWDDSCP  DS    CL36     5   20   36  A  U N             T        Y              
KWD006H  DS    CL8                                                              
KWD006   DS    CL16     6    2   16  L  P N             T        Y              
KWDHLPDH DS    CL8                                                              
KWDHLPD  DS    CL36     6   20   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      8    6    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL8      8   18    8  A  P H             T        Y              
KWDFRSTH DS    CL8                                                              
KWDFRST  DS    CL3      9    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2      9    8    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      9   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL24     9   27   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     10    8    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     10   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL24    10   27   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     11    8    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     11   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL24    11   27   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     12    8    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL24    12   27   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     13    8    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     13   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL24    13   27   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     14    8    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     14   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL24    14   27   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     15    8    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     15   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL24    15   27   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     16    8    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL24    16   27   24  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL2     17    8    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   18    6  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL24    17   27   24  A  P N             T        Y              
KWDTABH  DS    CL8                                                              
KWDTAB   DS    CL1     18    9    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  L  P H             T        Y  254         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL77    24    3   77  L  P H             T        Y  254         
         DS    CL8                                                              
KWDLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
KWDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1008 BYTES                            
