*          DATA SET ACSCRF3D   AT LEVEL 003 AS OF 08/10/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60CF3D      DATE 08/10/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      4    2    6  L  P H             T        Y              
INCCODEH DS    CL8                                                              
INCCODE  DS    CL8      4   10    8  A  U N             T        Y              
INCNMH   DS    CL8                                                              
INCNM    DS    CL4      4   20    4  L  P N             T        Y              
INCNMEH  DS    CL8                                                              
INCNME   DS    CL36     4   25   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      4   63    6  L  P N             T        Y              
INCOWNH  DS    CL8                                                              
INCOWN   DS    CL8      4   70    8  A  P H             T        Y              
INCBGNH  DS    CL8                                                              
INCBGN   DS    CL32     6    2   32  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32     7    6   32  L  P N             T        Y              
INCTYPEH DS    CL8                                                              
INCTYPE  DS    CL15     7   39   15  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
INCIN02H DS    CL8                                                              
INCIN02  DS    CL32     8    6   32  L  P N             T        Y              
INCACTH  DS    CL8                                                              
INCACT   DS    CL40     8   39   40  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  P N             T        Y              
INCIN03H DS    CL8                                                              
INCIN03  DS    CL32     9    6   32  L  P N             T        Y              
INCCOSTH DS    CL8                                                              
INCCOST  DS    CL40     9   39   40  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  P N             T        Y              
INCIN04H DS    CL8                                                              
INCIN04  DS    CL32    10    6   32  L  P N             T        Y              
INCCNTRH DS    CL8                                                              
INCCNTR  DS    CL40    10   39   40  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    11    6   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   39    3  A  P N             T        Y              
INCF1H   DS    CL8                                                              
INCF1    DS    CL2     11   43    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     11   47    3  A  P N             T        Y              
INCF2H   DS    CL8                                                              
INCF2    DS    CL2     11   51    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     11   55    3  A  P N             T        Y              
INCF3H   DS    CL8                                                              
INCF3    DS    CL2     11   59    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     11   63    3  A  P N             T        Y              
INCF4H   DS    CL8                                                              
INCF4    DS    CL2     11   67    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     11   71    3  A  P N             T        Y              
INCF5H   DS    CL8                                                              
INCF5    DS    CL2     11   75    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    12    6   32  L  P N             T        Y              
INCCLIH  DS    CL8                                                              
INCCLI   DS    CL40    12   39   40  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    13    6   32  L  P N             T        Y              
INCOFFH  DS    CL8                                                              
INCOFF   DS    CL40    13   39   40  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    14    6   32  L  P N             T        Y              
INCITTYH DS    CL8                                                              
INCITTY  DS    CL40    14   39   40  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  P N             T        Y              
INCIN09H DS    CL8                                                              
INCIN09  DS    CL32    17    6   32  L  P N             T        Y              
INCRVRSH DS    CL8                                                              
INCRVRS  DS    CL1     17   39    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     17   41    3  A  P N             T        Y              
INCIN10H DS    CL8                                                              
INCIN10  DS    CL32    17   45   32  L  P N             T        Y              
INCTY56H DS    CL8                                                              
INCTY56  DS    CL1     17   78    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  P N             T        Y              
INCIN11H DS    CL8                                                              
INCIN11  DS    CL32    18    6   32  L  P N             T        Y              
INCLOCKH DS    CL8                                                              
INCLOCK  DS    CL1     18   39    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     18   41    3  A  P N             T        Y              
INCIN12H DS    CL8                                                              
INCIN12  DS    CL32    18   45   32  L  P N             T        Y              
INCDRFTH DS    CL8                                                              
INCDRFT  DS    CL1     18   78    1  A  U H             T        Y              
INCTABH  DS    CL8                                                              
INCTAB   DS    CL1     19    9    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  L  P H             T        Y  254         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL77    24    3   77  L  P H             T        Y  254         
         DS    CL8                                                              
INCLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
INCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1424 BYTES                            
