*          DATA SET ACSCRREQ   AT LEVEL 038 AS OF 10/10/19                      
***********************************************************************         
*                                                                     *         
* THIS VERSION MATCHES THE UK VERSION LEVEL 36 AS OF 12/16/11         *         
*                                                                     *         
***********************************************************************         
***********************************************************************         
*  SET DYNAMIC SCREEN                                                 *         
***********************************************************************         
         SPACE 1                                                                
         USING REPFD,R2                                                         
         USING TWAELEMD,R4                                                      
         USING TWAD,R5                                                          
         SPACE 1                                                                
SCRPARM  USING TWAPARMD,APPARM                                                  
         SPACE 1                                                                
SETSCRN  NMOD1 0,*SETSCR*                                                       
         L     RC,APALOCAL                                                      
         MVI   APBYTE,1                                                         
         XC    APPARM(24),APPARM                                                
         XC    TWAELEM,TWAELEM                                                  
         ST    R5,SCRPARM.TWAPATWA                                              
         LA    R4,TWAELEM                                                       
         ST    R4,SCRPARM.TWAPAFST                                              
         LA    R3,REQTAGH                                                       
         ST    R3,SCRPARM.TWAPAOUT                                              
         MVI   TWAELCD,1                                                        
         MVI   TWAERLN,1           FIRST PLACE TO INSERT                        
         BAS   RE,FINDSCRT         R2 POINTS TO SCREEN TABLE                    
         BNE   SETSPFK                                                          
*                                                                               
SETS0205 CLI   0(R2),X'FF'         END OF LIST                                  
         BE    SETSPFK             SHOW PFKEYS                                  
         L     R6,=A(FLDTABLE)                                                  
         A     R6,APRELO                                                        
*                                                                               
SETS0210 CLI   0(R6),X'FF'                                                      
         BE    SETSPFK                                                          
         CLC   2(1,R6),REPFFLDN    MATCH ENTRY ON FIELD NUMBER                  
         BNE   SETS0250            NO, SO TRY NEXT FIELD                        
*&&DO*&& TM    REPFIND1,REPFSTO    STEREO FIELD ONLY                            
*&&DO*&& BZ    SETS0215            NO, SO DON'T CARE                            
*&&DO*&& TM    GENIND,GENSTRO      STEREO MODE                                  
*&&DO*&& BZ    SETS0500            NOT IN STEREO MODE, SO SKIP ENTRY            
*                                                                               
SETS0215 CLI   3(R6),0             DEFAULT                                      
         BE    SETS0300                                                         
         CLC   3(1,R6),APREPJCL                                                 
         BE    SETS0300                                                         
*                                                                               
SETS0250 ZIC   R0,0(,R6)                                                        
         AR    R6,R0                                                            
         B     SETS0210                                                         
*                                                                               
SETS0300 CLI   REPFFLDN,FLDNOPT6   SPECIAL SECURITY FOR APG                     
         BNE   SETS0310                                                         
*&&US                                                                           
         CLI   APGFLAG,YES                                                      
         BNE   SETS0310                                                         
         TM    SVCMPST5,CPYAPGS    SHOW $$ FIELD (OPTION 6)                     
         BZ    SETS0400            NO                                           
         TM    CUAUTH,X'20'        ARE THEY AUTHORIZED                          
         BZ    SETS0400            NO                                           
*&&                                                                             
*                                                                               
SETS0310 CLI   REPFFLDN,FLDNBUDG                                                
         BNE   SETS0320                                                         
         CLC   BUD#,APBYTE                                                      
         BL    SETS0400                                                         
         SR    RF,RF                                                            
         IC    RF,APBYTE                                                        
         LA    RF,1(,RF)                                                        
         STC   RF,APBYTE                                                        
         CLI   APBYTE,2                                                         
         BNE   SETS0315                                                         
         LA    RE,4(,R6)                                                        
         LA    R0,5                                                             
*                                                                               
SETS0312 CLI   0(RE),C'?'          MARKER                                       
         BE    SETS0313                                                         
         LA    RE,1(,RE)                                                        
         BCT   R0,SETS0312                                                      
*                                                                               
SETS0313 LA    R1,4(,R6)                                                        
         SR    RE,R1                                                            
         STH   RE,APHALF                                                        
*                                                                               
SETS0315 LA    RE,C'1'-2(,RF)                                                   
         CLI   APBYTE,11                                                        
         BL    SETS0317                                                         
         AHI   RF,-11                                                           
         LA    RE,C'A'(,RF)                                                     
*                                                                               
SETS0317 STC   RE,APFLAG                                                        
         B     SETS0330                                                         
*                                                                               
SETS0320 CLI   REPFFLDN,FLDNOFFC   OFFICE FILED ?                               
         BNE   SETS0324            NO,   SKIP                                   
         L     RF,SCRPARM.TWAPAOUT                                              
         SR    RF,R5                                                            
         STCM  RF,3,TWAOFFLD                                                    
*        MVC   TWAOFFLD,SCRPARM.TWAPAOUT                                        
*                                                                               
SETS0324 CLI   REPFFLDN,FLDNRCAP   Recap field ?                                
         BNE   SETS0330            No, skip                                     
         CLC   RECAP#,REPFDDSP+1   Recap format exsits ?                        
         BL    SETS0400            No, skip                                     
         CLI   REPFDDSP+1,1        First recap field ?                          
         BNE   SETS0330            No                                           
         SR    RF,R5               Yes                                          
         STCM  RF,3,TWARCFLD       Save displacement                            
*                                                                               
SETS0330 MVI   TWAECOL,2           FIELD STARTS @ COL 2                         
         TM    REPFIND1,REPFNXT    USE NEXT AVAILABLE FIELD?                    
         BZ    *+8                                                              
         MVI   TWAECOL,0                                                        
         TM    REPFIND1,REPFMID    START AT MIDWAY?                             
         BZ    *+8                                                              
         MVI   TWAECOL,37                                                       
         MVI   TWAEATB,X'60'       PROT,LOWER                                   
         TM    REPFIND1,REPFREQ    REQUIRED FIELD?                              
         BZ    *+8                                                              
         MVI   TWAEATB,X'68'       PROT,LOWER,HIGHLIGHT                         
         MVI   TWAEFLD,0                                                        
         XC    TWAEDTA(L'TWAELEM-TWAELLNQ),TWAEDTA                              
*                                                                               
         SR    R1,R1                                                            
         IC    R1,0(,R6)                                                        
         AHI   R1,-4               SUBTRACT TO GET CORRECT LENGTH               
         STC   R1,TWAEFLN          FIELD LENGTH                                 
         BCTR  R1,0                                                             
         EXMVC R1,TWAEDTA,4(R6)    MOVE IN DICTIONARY ESC VALUES                
*                                                                               
         CLI   REPFFLDN,FLDNBUDG                                                
         BNE   SETS0335                                                         
         LA    RE,TWAEDTA                                                       
         AH    RE,APHALF                                                        
         MVC   0(1,RE),APFLAG                                                   
*                                                                               
SETS0335 CLI   REPFFLDN,FLDNRCAP   Recap field ?                                
         BNE   SETS0345            No, skip                                     
         LA    RE,TWAEDTA          ->    Field data                             
         ZIC   RF,REPFDDSP+1       Get recap format number                      
         BCTR  RF,0                Adjust format number                         
         MHI   RF,L'RCAPFMTS       Offset to format                             
         LA    RF,RCAPFMTS(RF)     ->   Recap formats                           
         MVC   0(L'RCPCODE,RE),0(RF)    Insert recap format code                
*                                                                               
SETS0345 LA    R1,8(,R1)                                                        
         STC   R1,TWAELLN          Length of element                            
         GOTO1 VTWABLD,APPARM                                                   
         CLI   SCRPARM.TWAPERRS,0                                               
         BE    *+6                                                              
         DC    H'0'                                                             
*                                                                               
         MVI   TWAERLN,0           Same line                                    
         MVC   SCRPARM.TWAPAOUT,SCRPARM.TWAPANXT                                
         MVI   TWAECOL,20          ALL INPUT FILEDS START @ COL 20              
         TM    REPFIND1,REPFMID    START AT MIDWAY?                             
         BZ    *+8                                                              
         MVI   TWAECOL,53                                                       
         TM    REPFIND1,REPFNXT    NEXT AVAILABLE SPOT                          
         BZ    *+8                                                              
         MVI   TWAECOL,0                                                        
*                                                                               
         MVI   TWAELCD,1           ELEMENT CODE                                 
         MVI   TWAEATB,X'00'       THE INPUT FIELD                              
         MVI   TWAEFLD,0                                                        
         XC    TWAEDTA(L'TWAELEM-TWAELLNQ),TWAEDTA                              
         MVC   TWAEFLN,1(R6)       INPUT FIELD LENGTH                           
         MVI   TWAELLN,TWAELLNQ    LENGTH OF ELEM                               
*                                                                               
         GOTO1 VTWABLD,APPARM                                                   
         CLI   SCRPARM.TWAPERRS,0                                               
         BE    *+6                                                              
         DC    H'0'                                                             
*                                                                               
         L     RF,SCRPARM.TWAPAOUT GET DISP OF LAST FIELD                       
         SR    RF,R5               SUBTRACT A(TWA)                              
         STCM  RF,3,LASTTWAF                                                    
*                                                                               
         TM    REPFIND1,REPFNME    NEED NAME FIELD?                             
         BZ    SETS0400                                                         
         MVC   SCRPARM.TWAPAOUT,SCRPARM.TWAPANXT                                
         MVI   TWAERLN,0           ON THE SAME LINE                             
         MVI   TWAECOL,37                                                       
         MVI   TWAEATB,X'68'       PROT,LOWER,HIGHLIGHT                         
         MVI   TWAEFLD,0                                                        
         XC    TWAEDTA(L'TWAELEM-TWAELLNQ),TWAEDTA                              
         MVI   TWAEFLN,40          NAME FIELD LENGTH                            
         MVI   TWAELLN,TWAELLNQ+47 LENGTH OF ELEM                               
*                                                                               
         GOTO1 VTWABLD,APPARM                                                   
         CLI   SCRPARM.TWAPERRS,0                                               
         BE    *+6                                                              
         DC    H'0'                                                             
*                                                                               
SETS0400 MVC   TWAERLN,REPFIND1     NEXT LINE/NEXT AVAIL IS OUTPUT              
         NI    TWAERLN,REPF1LN+REPF2LN                                          
         MVC   SCRPARM.TWAPAOUT,SCRPARM.TWAPANXT                                
*                                                                               
SETS0500 LA    R2,REPFLNQ(,R2)      NEXT FIELD NEEDED                           
         B     SETS0205                                                         
         EJECT ,                                                                
***********************************************************************         
*  BUILD PFKEY LINES                                                  *         
***********************************************************************         
         SPACE 1                                                                
SETSPFK  MVI   TWAELCD,1           ELEMENT CODE                                 
         MVI   TWAERLN,24          STARTS AT ROW 23                             
         OI    TWAERLN,TWAERLAB                                                 
         MVI   TWAECOL,3           COLUMN 2                                     
         MVI   TWAEATB,X'68'       PROT,LOWER, HIGHLIGHTED                      
         MVI   TWAEFLD,X'FE'       FIELD NUMBER                                 
         XC    TWAEDTA(L'TWAELEM-TWAELLNQ),TWAEDTA                              
         MVC   TWAEDTA(10),=CL10'PFKEY 1'                                       
         MVI   TWAEFLN,78          INPUT FIELD LENGTH                           
         MVI   TWAELLN,TWAELLNQ+10 LENGTH OF ELEM                               
*                                                                               
         GOTO1 VTWABLD,APPARM                                                   
         CLI   SCRPARM.TWAPERRS,0                                               
         BE    *+6                                                              
         DC    H'0'                                                             
         MVC   SCRPARM.TWAPAOUT,SCRPARM.TWAPANXT                                
*                                                                               
SETSXIT  XMOD1                                                                  
         DROP  R2,R4                                                            
         DROP  SCRPARM                                                          
         EJECT ,                                                                
FINDSCRT NTR1                                                                   
         L     RF,=A(SCRTABLE)                                                  
         A     RF,APRELO                                                        
*                                                                               
FST010   CLI   0(RF),X'FF'         EOT?                                         
         BNE   FST020                                                           
         MVC   FVMSGNO,=AL2(2090)                                               
         SR    R2,R2                                                            
         B     FST090                                                           
*                                                                               
FST020   CLC   APREPJCL,0(RF)                                                   
         BNE   FST025                                                           
         LA    RE,NO               ASSUME NO                                    
         TM    1(RF),REPIAPG                                                    
         BZ    *+8                                                              
         LA    RE,YES              YES                                          
         CLM   RE,1,APGFLAG        TEST APG YES/NO                              
         BE    FST030                                                           
*                                                                               
FST025   LA    RF,4(,RF)                                                        
         B     FST010                                                           
*                                                                               
FST030   SR    R2,R2                                                            
         ICM   R2,3,2(RF)                                                       
         A     R2,=A(REPFLDS)                                                   
         A     R2,APRELO                                                        
         SR    RE,RE                                                            
*                                                                               
FST090   LTR   RE,RE                                                            
         XIT1  REGS=(R2)                                                        
         SPACE 1                                                                
         DROP  R5                  KEEP IT CLEAN                                
         SPACE 1                                                                
         LTORG                                                                  
         EJECT ,                                                                
***********************************************************************         
*                    FIELD LENGTH EQUATES                             *         
*                           I.E.                                      *         
*  LENGTH OF FIELDS ON SCREEN INCLUDING THE EXCLUDE CHARACTER ("*")   *         
*                                                                     *         
*  NOTE: (#) MEANS DUE TO +/- LIST SUPPORT                            *         
***********************************************************************         
         SPACE 1                                                                
LENFUNLG EQU   LUNLG               UNIT        LEDGER                           
LENFACCT EQU   LACCOUNT+1          ACCOUNT                                      
LENFAC13 EQU   LACCOUNT+1          ACCOUNT     LENGTH   13                      
LENFAC15 EQU   LULACNT+1           ACCOUNT     LENGTH   15                      
LENFCNTR EQU   LULACNT+1           CONTRA      ACCOUNT                          
LENFBGRP EQU   4                   BILLING     GROUP                            
LENFBSCR EQU   LACCOUNT+1          BILLING     SOURCE                           
LENFBILT EQU   2                   BILLING     TYPE                             
LENFTYPE EQU   1                   TYPE                                         
LENFCLNT EQU   LACCOUNT+1          CLIENT                                       
LENFOFFC EQU   3                   OFFICE                                       
LENFOGRP EQU   2                   OFFICE      GROUP                            
LENFDATE EQU   10                  DATE                                         
LENFMOAR EQU   22                  MONTH OF    ACTIVITY RANGE                   
LENFWKCD EQU   6                   WORK        CODE     (#)                     
LENFWCGP EQU   2                   WORK        CODE     GROUP                   
LENFFLTR EQU   2                   FILTER                                       
LENFMEDA EQU   2                   MEDIA                                        
LENFMGRP EQU   2                   MEDIA       GROUP                            
LENFPRDR EQU   26                  PERIOD      RANGE                            
LENFLOCS EQU   9                   LOCATION    STATUS                           
LENFRCON EQU   1                   RECONCILED  ITEMS                            
LENFTTYP EQU   4                   TRANSACTION TYPE                             
LENFESTS EQU   1                   ESTIMATE    STATUS                           
LENFSTTY EQU   5                   STUDIO      TYPE                             
LENFUSRF EQU   3                   USER        FIELD                            
LENFPRSC EQU   8                   PERSON                                       
LENFSELT EQU   6                   SELECT                                       
LENFMTHD EQU   3                   METHOD                                       
LENFNARA EQU   6                   NARRATIVE                                    
LENFOPTN EQU   1                   OPTION                                       
LENFCURC EQU   4                   CURRENCY    CONVERSION                       
LENFOVHD EQU   6                   OVERHEAD                                     
LENFRCAP EQU   1                   RECAP                                        
LENFFRPT EQU   1                   FORMAT REPORT                                
LENFAUTH EQU   20                  Authorization                                
LENFBUDG EQU   LINPBUDG            BUDGET                                       
         EJECT ,                                                                
***********************************************************************         
*  Table of screen to load based on type                              *         
***********************************************************************         
         SPACE 1                                                                
SCRTABLE DC    AL1(REPJCLV,0),AL2(REPFLDSV-REPFLDS)                             
         DC    AL1(REPJCLI,0),AL2(REPFLDSI-REPFLDS)                             
         DC    AL1(REPJCL1,0),AL2(REPFLDSL-REPFLDS)                             
         DC    AL1(REPJCLP,0),AL2(REPFLDSP-REPFLDS)                             
         DC    AL1(REPJCLR,0),AL2(REPFLDSR-REPFLDS)                             
         DC    AL1(REPJCLX,0),AL2(REPFLDSX-REPFLDS)                             
         DC    AL1(REPJCL2,0),AL2(REPFLD1C-REPFLDS)                             
         DC    AL1(REPJCLB,0),AL2(REPFLDSC-REPFLDS)                             
         DC    AL1(REPJCLG,0),AL2(REPFLDGL-REPFLDS)                             
         DC    AL1(REPJCLZ,0),AL2(REPFLDSZ-REPFLDS)                             
         DC    AL1(REPJCLFI,REPIAPG),AL2(REPFLDFI-REPFLDS)                      
         DC    AL1(REPJCLM2,REPIAPG),AL2(REPFLDM2-REPFLDS)                      
*        DC    AL1(REPJCLIV,REPIAPG),AL2(REPFLDIV-REPFLDS)                      
         DC    X'FF'                                                            
         SPACE 1                                                                
REPIAPG  EQU   X'80'                                                            
         EJECT ,                                                                
***********************************************************************         
*  XL1 - LENGTH OF ENTRY                                              *         
*  XL1 - LENGTH OF FIELD - INCLUDING THE EXCLUDE CHARACTER            *         
*  XL1 - FIELD NUMBER                                                 *         
*  0C  - FIELD TITLE                                                  *         
***********************************************************************         
         SPACE 1                                                                
FLDTABLE DS    0C                                                               
         DC    AL1(FTBUNLGX-*,LENFUNLG,FLDNUNLG,0)                              
         DCDD  AC#UNTLD,14                                                      
FTBUNLGX EQU   *                                                                
*                                                                               
         DC    AL1(FTBACCTX-*,LENFACCT,FLDNACCT,0)                              
         DCDD  AC#ACC,14                                                        
FTBACCTX EQU   *                                                                
*                                                                               
         DC    AL1(FTBCNT1X-*,LENFCNTR,FLDNCNTR,REPJCL1)                        
*&&UK                                                                           
         DCDD  AC#CSTNC,14                                                      
*&&                                                                             
*&&US*&& DC    CL14'Cost/Non-Cli'                                               
FTBCNT1X EQU   *                                                                
*                                                                               
         DC    AL1(FTBCNT2X-*,LENFCNTR,FLDNCNTR,0)                              
         DCDD  AC#CTRA,14                                                       
FTBCNT2X EQU   *                                                                
*                                                                               
         DC    AL1(FTBBGRPX-*,LENFBGRP,FLDNBGRP,0)                              
         DCDD  AC#BLGGP,14                                                      
FTBBGRPX EQU   *                                                                
*                                                                               
         DC    AL1(FTBOGRPX-*,LENFOGRP,FLDNOGRP,0)                              
         DCDD  AC#OFFGP,14                                                      
FTBOGRPX EQU   *                                                                
*                                                                               
         DC    AL1(FTBOFCCX-*,LENFOFFC,FLDNOFCC,0)                              
*&&UK                                                                           
         DCDD  AC#RSOCC,14                                                      
*&&                                                                             
*&&US*&& DC    C'Client office'                                                 
FTBOFCCX EQU   *                                                                
*                                                                               
         DC    AL1(FTBOFFCX-*,LENFOFFC,FLDNOFFC,0)                              
         DCDD  AC#OFF,17                                                        
FTBOFFCX EQU   *                                                                
*                                                                               
         DC    AL1(FTBMGRPX-*,LENFMGRP,FLDNMGRP,0)                              
         DCDD  AC#MEDGP,14                                                      
FTBMGRPX EQU   *                                                                
*                                                                               
         DC    AL1(FTBMEDAX-*,LENFMEDA,FLDNMEDA,0)                              
         DCDD  AC#MED,14                                                        
FTBMEDAX EQU   *                                                                
*                                                                               
         DC    AL1(FTBWCGPX-*,LENFWCGP,FLDNWCGP,0)                              
         DCDD  AC#WCGRP,14                                                      
FTBWCGPX EQU   *                                                                
*                                                                               
         DC    AL1(FTBTASKX-*,LENFWKCD,FLDNTASK,REPJCL1)                        
         DCDD  AC#TASK,14                                                       
FTBTASKX EQU   *                                                                
*                                                                               
         DC    AL1(FTBWKCDX-*,LENFWKCD,FLDNWKCD,0)                              
         DCDD  AC#WC,14                                                         
FTBWKCDX EQU   *                                                                
*                                                                               
         DC    AL1(FTBSTDTX-*,LENFDATE,FLDNSTDT,0)                              
         DCDD  AC#STRDT,14                                                      
FTBSTDTX EQU   *                                                                
*                                                                               
         DC    AL1(FTBENDTX-*,LENFDATE,FLDNENDT,0)                              
         DCDD  AC#ENDDT,14                                                      
FTBENDTX EQU   *                                                                
*                                                                               
         DC    AL1(FTBMOARX-*,LENFMOAR,FLDNMOAR,0)                              
         DCDD  AC#MOARA,14                                                      
FTBMOARX EQU   *                                                                
*&&US                                                                           
         DC    AL1(FTBMMOSX-*,LENFMOAR,FLDNMMOS,0)                              
         DCDD  AC#MMOSR,15                                                      
FTBMMOSX EQU   *                                                                
*&&                                                                             
         DC    AL1(FTBACTSX-*,LENFDATE,FLDNACTS,0)                              
         DCDD  AC#ACTST,14                                                      
FTBACTSX EQU   *                                                                
*                                                                               
         DC    AL1(FTBACTEX-*,LENFDATE,FLDNACTE,0)                              
         DCDD  AC#ACTND,14                                                      
FTBACTEX EQU   *                                                                
*                                                                               
         DC    AL1(FTBALTSX-*,LENFDATE,FLDNALTS,0)                              
         DCDD  AC#ALTSD,15                                                      
FTBALTSX EQU   *                                                                
*                                                                               
         DC    AL1(FTBALTEX-*,LENFDATE,FLDNALTE,0)                              
         DCDD  AC#ALTED,14                                                      
FTBALTEX EQU   *                                                                
*                                                                               
         DC    AL1(FTBOCURX-*,LENFDATE,FLDNOCUR,0)                              
*&&UK                                                                           
         DCDD  AC#OVRCU,16                                                      
*&&                                                                             
*&&US*&& DC    C'Override current'                                              
FTBOCURX EQU   *                                                                
*                                                                               
         DC    AL1(FTBPRDRX-*,LENFPRDR,FLDNPRDR,0)                              
*&&UK                                                                           
         DCDD  AC#RLPRA,16                                                      
*&&                                                                             
*&&US*&& DC    C'Period Range'                                                  
FTBPRDRX EQU   *                                                                
*                                                                               
         DC    AL1(FTBCNDRX-*,LENFMOAR,FLDNCNDR,0)                              
*&&UK                                                                           
         DCDD  AC#RLCRA,16                                                      
*&&                                                                             
*&&US*&& DC    C'Calendar range'                                                
FTBCNDRX EQU   *                                                                
*                                                                               
         DC    AL1(FTBLOCSX-*,LENFLOCS,FLDNLOCS,0)                              
*&&UK                                                                           
         DCDD  AC#RSLST,16                                                      
*&&                                                                             
*&&US*&& DC    C'Location Status'                                               
FTBLOCSX EQU   *                                                                
*                                                                               
         DC    AL1(FTBRCONX-*,LENFRCON,FLDNRCON,0)                              
         DCDD  AC#RCND,14                                                       
FTBRCONX EQU   *                                                                
*                                                                               
         DC    AL1(FTBTYPEX-*,LENFTYPE,FLDNTYPE,0)                              
FTBTYPET DCDD  AC#TYPE1,ADODESCL                                                
FTBTYPEX EQU   *                                                                
*                                                                               
         DC    AL1(FTBTRNTX-*,LENFTTYP,FLDNTRNT,0)                              
*&&UK                                                                           
         DCDD  AC#RLTTY,16                                                      
*&&                                                                             
*&&US*&& DC    C'Transaction Type'                                              
FTBTRNTX EQU   *                                                                
*                                                                               
         DC    AL1(FTBBILTX-*,LENFBILT,FLDNBILT,0)                              
         DCDD  AC#BLGTY,14                                                      
FTBBILTX EQU   *                                                                
*                                                                               
         DC    AL1(FTBESTSX-*,LENFESTS,FLDNESTS,0)                              
*&&UK                                                                           
         DCDD  AC#ESTAT,15                                                      
*&&                                                                             
*&&US*&& DC    CL15'Estimate Status'                                            
FTBESTSX EQU   *                                                                
*                                                                               
         DC    AL1(FTBESTYX-*,LENFSTTY,FLDNSTTY,0)                              
         DCDD  AC#STUTY,14                                                      
FTBESTYX EQU   *                                                                
*                                                                               
         DC    AL1(FTBUSRFX-*,LENFUSRF,FLDNUSRF,0)                              
         DCDD  AC#RSUSF,14                                                      
FTBUSRFX EQU   *                                                                
*                                                                               
         DC    AL1(FTBCLIX-*,LENFCLNT,FLDNCLNT,REPJCL2)                         
         DCDD  AC#CLINT,16                                                      
FTBCLIX  EQU   *                                                                
*                                                                               
         DC    AL1(FTBCPJX-*,LENFCLNT,FLDNCLNT,REPJCL1)                         
         DCDD  AC#CPJ,16                                                        
FTBCPJX  EQU   *                                                                
*                                                                               
         DC    AL1(FTBCLNTX-*,LENFCLNT,FLDNCLNT,0)                              
         DCDD  AC#CLIPJ,16                                                      
FTBCLNTX EQU   *                                                                
*                                                                               
         DC    AL1(FTBCSTAX-*,LENFAC13,FLDNCSTA,0)                              
*&&UK                                                                           
         DCDD  AC#RLCAC,14                                                      
*&&                                                                             
*&&US*&& DC    CL14'Cost account'                                               
FTBCSTAX EQU   *                                                                
*                                                                               
         DC    AL1(FTBBSRCX-*,LENFAC13,FLDNBSRC,0)                              
         DCDD  AC#BLGSR,14                                                      
FTBBSRCX EQU   *                                                                
*                                                                               
         DC    AL1(FTBPARTX-*,LENFAC15,FLDNPART,0)                              
*&&UK                                                                           
         DCDD  AC#RLPAR,14                                                      
*&&                                                                             
*&&US*&& DC    CL14'Participant'                                                
FTBPARTX EQU   *                                                                
*                                                                               
         DC    AL1(FTBDEPTX-*,LENFAC13,FLDNDEPT,0)                              
         DCDD  AC#DPT,14                                                        
FTBDEPTX EQU   *                                                                
*                                                                               
         DC    AL1(FTBPRSCX-*,LENFPRSC,FLDNPRSC,0)                              
         DCDD  AC#PRSN,14                                                       
FTBPRSCX EQU   *                                                                
*                                                                               
         DC    AL1(FTBPRSNX-*,LENFAC13,FLDNPRSN,0)                              
         DCDD  AC#PRSN,14                                                       
FTBPRSNX EQU   *                                                                
*                                                                               
         DC    AL1(FTBDEXPX-*,LENFAC13,FLDNDEXP,0)                              
*&&UK                                                                           
         DCDD  AC#RSDXP,14                                                      
*&&                                                                             
*&&US*&& DC    CL14'Direct expense'                                             
FTBDEXPX EQU   *                                                                
*                                                                               
         DC    AL1(FTBVENDX-*,LENFAC15,FLDNVNDR,0)                              
         DCDD  AC#SUP,14                                                        
FTBVENDX EQU   *                                                                
*                                                                               
         DC    AL1(FTBAOFFX-*,LENFOFFC,FLDNAOFF,0)                              
*&&UK                                                                           
         DCDD  AC#ANOFF,12                                                      
*&&                                                                             
*&&US*&& DC    CL14'Analysis Off'                                               
FTBAOFFX EQU   *                                                                
*                                                                               
         DC    AL1(FTBFLT1X-*,LENFFLTR,FLDNFLT1,0)                              
         DCDD  AC#FLT1,3                                                        
FTBFLT1X EQU   *                                                                
*                                                                               
         DC    AL1(FTBFLT2X-*,LENFFLTR,FLDNFLT2,0)                              
         DCDD  AC#FLT2,3                                                        
FTBFLT2X EQU   *                                                                
*                                                                               
         DC    AL1(FTBFLT3X-*,LENFFLTR,FLDNFLT3,0)                              
         DCDD  AC#FLT3,3                                                        
FTBFLT3X EQU   *                                                                
*                                                                               
         DC    AL1(FTBFLT4X-*,LENFFLTR,FLDNFLT4,0)                              
         DCDD  AC#FLT4,3                                                        
FTBFLT4X EQU   *                                                                
*                                                                               
         DC    AL1(FTBFLT5X-*,LENFFLTR,FLDNFLT5,0)                              
         DCDD  AC#FLT5,3                                                        
FTBFLT5X EQU   *                                                                
*                                                                               
         DC    AL1(FTBFLC1X-*,LENFFLTR,FLDNFLC1,0)                              
         DCDD  AC#CTRF1,3                                                       
FTBFLC1X EQU   *                                                                
*                                                                               
         DC    AL1(FTBFLC2X-*,LENFFLTR,FLDNFLC2,0)                              
         DCDD  AC#CTRF2,3                                                       
FTBFLC2X EQU   *                                                                
*                                                                               
         DC    AL1(FTBFLC3X-*,LENFFLTR,FLDNFLC3,0)                              
         DCDD  AC#CTRF3,3                                                       
FTBFLC3X EQU   *                                                                
*                                                                               
         DC    AL1(FTBFLC4X-*,LENFFLTR,FLDNFLC4,0)                              
         DCDD  AC#CTRF4,3                                                       
FTBFLC4X EQU   *                                                                
*                                                                               
         DC    AL1(FTBFLC5X-*,LENFFLTR,FLDNFLC5,0)                              
         DCDD  AC#CTRF5,3                                                       
FTBFLC5X EQU   *                                                                
*                                                                               
         DC    AL1(FTBSELTX-*,LENFSELT,FLDNSELT,0)                              
*&&UK                                                                           
         DCDD  AC#SEL2,14                                                       
*&&                                                                             
*&&US*&& DC    CL14'Select'                                                     
FTBSELTX EQU   *                                                                
*                                                                               
         DC    AL1(FTBMTHDX-*,LENFMTHD,FLDNMTHD,0)                              
*&&UK                                                                           
         DCDD  AC#METH,14                                                       
*&&                                                                             
*&&US*&& DC    CL14'Method'                                                     
FTBMTHDX EQU   *                                                                
*                                                                               
         DC    AL1(FTBNARAX-*,LENFNARA,FLDNNARA,0)                              
*&&UK                                                                           
         DCDD  AC#NRTV3,14                                                      
*&&                                                                             
*&&US*&& DC    CL14'Narrative'                                                  
FTBNARAX EQU   *                                                                
*                                                                               
         DC    AL1(FTBOPT1X-*,LENFOPTN,FLDNOPT1,0)                              
*&&UK                                                                           
         DCDD  AC#RLOP1,14                                                      
*&&                                                                             
*&&US*&& DC    CL14'Option 1'                                                   
FTBOPT1X EQU   *                                                                
*                                                                               
         DC    AL1(FTBOPT2X-*,LENFOPTN,FLDNOPT2,0)                              
*&&UK                                                                           
         DCDD  AC#RLOP2,14                                                      
*&&                                                                             
*&&US*&& DC    CL14'Option 2'                                                   
FTBOPT2X EQU   *                                                                
*                                                                               
         DC    AL1(FTBOPT3X-*,LENFOPTN,FLDNOPT3,0)                              
*&&UK                                                                           
         DCDD  AC#RLOP3,14                                                      
*&&                                                                             
*&&US*&& DC    CL14'Option 3'                                                   
FTBOPT3X EQU   *                                                                
*                                                                               
         DC    AL1(FTBOPT4X-*,LENFOPTN,FLDNOPT4,0)                              
*&&UK                                                                           
         DCDD  AC#RLOP4,14                                                      
*&&                                                                             
*&&US*&& DC    CL14'Option 4'                                                   
FTBOPT4X EQU   *                                                                
*                                                                               
         DC    AL1(FTBOPT5X-*,LENFOPTN,FLDNOPT5,0)                              
*&&UK                                                                           
         DCDD  AC#RLOP5,14                                                      
*&&                                                                             
*&&US*&& DC    CL14'Option 5'                                                   
FTBOPT5X EQU   *                                                                
*                                                                               
         DC    AL1(FTBOPT6X-*,LENFOPTN,FLDNOPT6,0)                              
*&&UK                                                                           
         DCDD  AC#RLOP6,14                                                      
*&&                                                                             
*&&US*&& DC    CL14'Option 6'                                                   
FTBOPT6X EQU   *                                                                
*                                                                               
         DC    AL1(FTBOPT7X-*,LENFOPTN,FLDNOPT7,0)                              
*&&UK                                                                           
         DCDD  AC#RLOP7,14                                                      
*&&                                                                             
*&&US*&& DC    CL14'Option 7'                                                   
FTBOPT7X EQU   *                                                                
*                                                                               
         DC    AL1(FTBCURCX-*,LENFCURC,FLDNCURC,0)                              
*&&UK                                                                           
         DCDD  AC#RLCCV,14                                                      
*&&                                                                             
*&&US*&& DC    CL14'Currency Conv'                                              
FTBCURCX EQU   *                                                                
*                                                                               
         DC    AL1(FTBOVHDX-*,LENFOVHD,FLDNOVHD,0)                              
*&&UK                                                                           
         DCDD  AC#COVER,14                                                      
*&&                                                                             
*&&US*&& DC    CL14'Currency Conv'                                              
FTBOVHDX EQU   *                                                                
*                                                                               
         DC    AL1(FTBBUDGX-*,LENFBUDG,FLDNBUDG,0)                              
         DC    CL4'Bud?'                                                        
FTBBUDGX EQU   *                                                                
*                                                                               
         DC    AL1(FTBRCAPX-*,LENFRCAP,FLDNRCAP,0)                              
         DC    CL8' '              Recap report name                            
FTBRCAPX EQU   *                                                                
*                                                                               
         DC    AL1(FTBFRPTX-*,LENFFRPT,FLDNFRPT,0)                              
         DCDD  AC#FMTDR,17         Format design rpt                            
FTBFRPTX EQU   *                                                                
*                                                                               
         DC    AL1(FTBAUTHX-*,LENFAUTH,FLDNAUTH,0)                              
         DCDD  AC#ATHN,15          Authorization                                
FTBAUTHX EQU   *                                                                
*                                                                               
         DC    X'FF'                                                            
         EJECT ,                                                                
***********************************************************************         
*  PRODUCTION SCREEN FIELDS TO BUILD                                  *         
***********************************************************************         
         SPACE 1                                                                
REPFLDS  DS    0H                                                               
*                                                                               
REPFLDSV DS    0H                                                               
         DC    AL2(ACQUNT-ACQD),AL1(FLDNUNLG)         UNLG                      
         DC    AL1(REPFNME+REPF1LN)                                             
         DC    AL1(REPFPRF)                                                     
*                                                                               
         DC    AL2(ACQACT-ACQD),AL1(FLDNACCT)         ACCT                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                                     
         DC    AL1(REPFWLD+REPFRNRF+REPFPRF)                                    
*                                                                               
         DC    AL2(0),AL1(FLDNCNTR)                   CNTR                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                                     
         DC    AL1(REPFRNRF+REPFPRF)                                            
*                                                                               
         DC    AL2(ACQTTYPE-ACQD),AL1(FLDNTRNT)       TRNT                      
         DC    AL1(REPFXLD)                                                     
         DC    AL1(REPFRNRF+REPFPRF)                                            
*                                                                               
         DC    AL2(ACQACTF1-ACQD),AL1(FLDNFLT1)       FLT1                      
         DC    AL1(REPFNXT+REPFXLD+REPFMID)                                     
         DC    AL1(REPFRNRF)                                                    
*                                                                               
         DC    AL2(ACQACTF2-ACQD),AL1(FLDNFLT2)       FLT2                      
         DC    AL1(REPFNXT+REPFXLD)                                             
         DC    AL1(REPFRNRF)                                                    
*                                                                               
         DC    AL2(ACQACTF3-ACQD),AL1(FLDNFLT3)       FLT3                      
         DC    AL1(REPFNXT+REPFXLD)                                             
         DC    AL1(REPFRNRF)                                                    
         DC    AL2(ACQACTF4-ACQD),AL1(FLDNFLT4)       FLT4                      
         DC    AL1(REPFNXT+REPFXLD)                                             
         DC    AL1(REPFRNRF)                                                    
         DC    AL2(ACQACTF5-ACQD),AL1(FLDNFLT5)       FLT5                      
         DC    AL1(REPFNXT+REPFXLD+REPF1LN)                                     
         DC    AL1(REPFRNRF)                                                    
*                                                                               
         DC    AL2(ACQBILGP-ACQD),AL1(FLDNBGRP)       BGRP                      
         DC    AL1(REPFXLD)                                                     
         DC    AL1(REPFRNRF+REPFPRF)                                            
         DC    AL2(ACQOFGRP-ACQD),AL1(FLDNOGRP)       OGRP                      
         DC    AL1(REPFMID+REPFXLD+REPF1LN)                                     
         DC    AL1(REPFRNRF+REPFPRF)                                            
         DC    AL2(ACQOFFFL-ACQD),AL1(FLDNOFFC)       OFFC                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                                     
         DC    AL1(REPFRNRF+REPFPRF)                                            
         DC    AL2(ACQMEDGP-ACQD),AL1(FLDNMGRP)       MGRP                      
         DC    AL1(REPFXLD)                                                     
         DC    AL1(REPFRNRF+REPFPRF)                                            
         DC    AL2(ACQMEDFL-ACQD),AL1(FLDNMEDA)       MEDA                      
         DC    AL1(REPFXLD+REPFMID+REPF1LN)                                     
         DC    AL1(REPFRNRF+REPFPRF)                                            
         DC    AL2(ACQWCGRP-ACQD),AL1(FLDNWCGP)       WCGP                      
         DC    AL1(REPFXLD)                                                     
         DC    AL1(REPFRNRF+REPFPRF)                                            
         DC    AL2(ACQWRKLS-ACQD),AL1(FLDNWKCD)       WKCD                      
         DC    AL1(REPFXLD+REPFMID+REPF1LN)                                     
         DC    AL1(REPFRNRF+REPFPRF)                                            
*                                                                               
         DC    AL2(ACQSTART-ACQD),AL1(FLDNSTDT)       STDT                      
         DC    AL1(0)                                                           
         DC    AL1(0)                                                           
         DC    AL2(ACQEND-ACQD),AL1(FLDNENDT)         ENDT                      
         DC    AL1(REPFMID+REPF1LN)                                             
         DC    AL1(0)                                                           
         DC    AL2(ACQMOSPD-ACQD),AL1(FLDNMOAR)       MOAR                      
         DC    AL1(REPF1LN)                                                     
         DC    AL1(0)                                                           
         DC    AL2(ACQACTST-ACQD),AL1(FLDNACTS)       ACTS                      
         DC    AL1(0)                                                           
         DC    AL1(0)                                                           
         DC    AL2(ACQACTND-ACQD),AL1(FLDNACTE)       ACTE                      
         DC    AL1(REPFMID+REPF1LN)                                             
         DC    AL1(0)                                                           
         DC    AL2(ACQDTSTR-ACQTYP1),AL1(FLDNALTS)    ALTS                      
         DC    AL1(0)                                                           
         DC    AL1(0)                                                           
         DC    AL2(ACQDTEND-ACQTYP1),AL1(FLDNALTE)    ALTE                      
         DC    AL1(REPFMID)                                                     
         DC    AL1(0)                                                           
         DC    AL2(ACQDTTYP-ACQTYP1),AL1(FLDNTYPE)    TYPE                      
         DC    AL1(REPFNXT+REPF1LN)                                             
         DC    AL1(0)                                                           
         DC    AL2(ACQDTEND-ACQTYP1),AL1(FLDNOCUR)    Override current          
         DC    AL1(0)                                                           
         DC    AL1(0)                                                           
*                                                                               
         DC    AL2(ACQBILTY-ACQD),AL1(FLDNBILT)       BILT                      
         DC    AL1(REPFXLD)                                                     
         DC    AL1(REPFRNRF+REPFPRF)                                            
*                                                                               
         DC    AL2(ACQOPT7-ACQD),AL1(FLDNESTS)        ESTS                      
         DC    AL1(REPFMID+REPF1LN)                                             
         DC    AL1(REPFRNRF+REPFPRF)                                            
*                                                                               
*&&US*&& DC    AL2(ACQSTUTY-ACQD),AL1(FLDNSTTY)       STTY                      
*&&US*&& DC    AL1(REPFXLD)                                                     
*&&US*&& DC    AL1(REPFRNRF+REPFPRF)                                            
         DC    AL2(ACQUSFLD-ACQD),AL1(FLDNUSRF)       USRF                      
*&&US*&& DC    AL1(REPFXLD+REPFMID+REPF1LN)                                     
*&&UK*&& DC    AL1(REPFXLD+REPF1LN)                                             
         DC    AL1(REPFRNRF+REPFPRF)                                            
*                                                                               
         DC    AL2(ACQOPT8-ACQD),AL1(FLDNFRPT)        FRPT                      
*&&UK*&& DC    AL1(REPF1LN)                                                     
*&&US*&& DC    AL1(0)                                                           
         DC    AL1(0)                                                           
*&&US*&& DC    AL2(ACQTYP8-ACQD),AL1(FLDNAUTH)        AUTH                      
*&&US*&& DC    AL1(REPFMID+REPF1LN)                                             
*&&US*&& DC    AL1(0)                                                           
*                                                                               
         DC    AL2(1),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                                             
         DC    AL1(0)                                                           
         DC    AL2(2),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                                             
         DC    AL1(0)                                                           
         DC    AL2(3),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                                             
         DC    AL1(0)                                                           
         DC    AL2(4),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ+REPFMID)                                     
         DC    AL1(0)                                                           
         DC    AL2(5),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ+REPF1LN)                                     
         DC    AL1(0)                                                           
*                                                                               
         DC    X'FF'                                                            
         EJECT ,                                                                
***********************************************************************         
*  INCOME SCREEN FIELDS TO BUILD                                      *         
***********************************************************************         
         SPACE 1                                                                
REPFLDSI DS    0H                                                               
         DC    AL2(ACQUNT-ACQD),AL1(FLDNUNLG)         UNLG                      
         DC    AL1(REPFNME+REPF1LN)                        X'41'                
         DC    AL1(REPFPRF+REPFRNRF)                             X'03'          
         DC    AL2(ACQACT-ACQD),AL1(FLDNACCT)         ACCT                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFWLD+REPFRNRF+REPFPRF)                     X'23           
         DC    AL2(0),AL1(FLDNCNTR)                   CNTR                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03           
         DC    AL2(ACQTTYPE-ACQD),AL1(FLDNTRNT)       TRNT                      
         DC    AL1(REPFXLD)                                X'20'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03'          
*                                                                               
         DC    AL2(ACQACTF1-ACQD),AL1(FLDNFLT1)       FLT1                      
         DC    AL1(REPFNXT+REPFXLD+REPFMID)                X'A8'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF2-ACQD),AL1(FLDNFLT2)       FLT2                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF3-ACQD),AL1(FLDNFLT3)       FLT3                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF4-ACQD),AL1(FLDNFLT4)       FLT4                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF5-ACQD),AL1(FLDNFLT5)       FLT5                      
         DC    AL1(REPFNXT+REPFXLD+REPF1LN)                X'A1'                
         DC    AL1(REPFRNRF)                                     X'02'          
*                                                                               
         DC    AL2(ACQSTART-ACQD),AL1(FLDNSTDT)       STDT                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQEND-ACQD),AL1(FLDNENDT)         ENDT                      
         DC    AL1(REPFMID+REPF1LN)                        X'09'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQMOSPD-ACQD),AL1(FLDNMOAR)       MOAR                      
         DC    AL1(REPF1LN)                                X'01'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQACTST-ACQD),AL1(FLDNACTS)       ACTS                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQACTND-ACQD),AL1(FLDNACTE)       ACTE                      
         DC    AL1(REPFMID+REPF1LN)                        X'09'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTSTR-ACQTYP1),AL1(FLDNALTS)    ALTS                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTEND-ACQTYP1),AL1(FLDNALTE)    ALTE                      
         DC    AL1(REPFMID)                                X'08'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTTYP-ACQTYP1),AL1(FLDNTYPE)    TYPE                      
         DC    AL1(REPFNXT+REPF2LN)                        X'82'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    AL2(ACQDTEND-ACQTYP1),AL1(FLDNOCUR)    Override current          
         DC    AL1(0)                                      X'08'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQOFFFL-ACQD),AL1(FLDNOFFC)       OFFC                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03           
         DC    AL2(ACQTYP1-ACQD),AL1(FLDNCLNT)        CLNT                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFWLD+REPFRNRF+REPFPRF)                     X'23           
         DC    AL2(ACQTYP1-ACQD),AL1(FLDNCSTA)        CSTA                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFWLD+REPFRNRF+REPFPRF)                     X'23           
*&&DO*&& DC    AL2(ACQTTYPE-ACQD),AL1(FLDNTRNT)       TRNT                      
*&&DO*&& DC    AL1(REPFNME+REPFXLD+REPFSTO+REPF1LN)        X'65'                
*&&DO*&& DC    AL1(REPFRNRF+REPFPRF)                             X'03           
*                                                                               
         DC    AL2(ACQOPT8-ACQD),AL1(FLDNFRPT)        FRPT                      
         DC    AL1(REPF1LN)                                X'01'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    AL2(1),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(2),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(3),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(4),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ+REPFMID)                X'98'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(5),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ+REPF1LN)                X'91'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    X'FF'                                                            
         EJECT ,                                                                
***********************************************************************         
*  PERSON (COST) SCREEN FIELDS TO BUILD                               *         
***********************************************************************         
         SPACE 1                                                                
REPFLDSL DS    0H                                                               
         DC    AL2(ACQUNT-ACQD),AL1(FLDNUNLG)         UNLG                      
         DC    AL1(REPFNME+REPF1LN)                        X'41'                
         DC    AL1(REPFPRF+REPFRNRF)                             X'03'          
         DC    AL2(ACQACT-ACQD),AL1(FLDNACCT)         ACCT                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFWLD+REPFRNRF+REPFPRF)                     X'23           
*                                                                               
         DC    AL2(ACQACTF1-ACQD),AL1(FLDNFLT1)       FLT1                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03'          
         DC    AL2(ACQACTF2-ACQD),AL1(FLDNFLT2)       FLT2                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03'          
         DC    AL2(ACQACTF3-ACQD),AL1(FLDNFLT3)       FLT3                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03'          
         DC    AL2(ACQACTF4-ACQD),AL1(FLDNFLT4)       FLT4                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03'          
         DC    AL2(ACQACTF5-ACQD),AL1(FLDNFLT5)       FLT5                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03'          
*                                                                               
         DC    AL2(ACQCFLT1-ACQD),AL1(FLDNFLC1)       FLC1                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03'          
         DC    AL2(ACQCFLT2-ACQD),AL1(FLDNFLC2)       FLC2                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03'          
         DC    AL2(ACQCFLT3-ACQD),AL1(FLDNFLC3)       FLC3                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03'          
         DC    AL2(ACQCFLT4-ACQD),AL1(FLDNFLC4)       FLC4                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03'          
         DC    AL2(ACQCFLT5-ACQD),AL1(FLDNFLC5)       FLC5                      
         DC    AL1(REPFNXT+REPFXLD+REPF1LN)                X'A1'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03'          
*                                                                               
         DC    AL2(ACQSTART-ACQD),AL1(FLDNPRDR)       PRDR                      
         DC    AL1(REPF1LN)                                X'01'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQSTART-ACQD),AL1(FLDNCNDR)       CNDR                      
         DC    AL1(REPF1LN)                                X'01'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQMOSPD-ACQD),AL1(FLDNMOAR)       MOAR                      
         DC    AL1(REPF1LN)                                X'01'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQACTST-ACQD),AL1(FLDNACTS)       ACTS                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQACTND-ACQD),AL1(FLDNACTE)       ACTE                      
         DC    AL1(REPFMID+REPF1LN)                        X'09'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTSTR-ACQTYP1),AL1(FLDNALTS)    ALTS                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTEND-ACQTYP1),AL1(FLDNALTE)    ALTE                      
         DC    AL1(REPFMID)                                X'08'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTTYP-ACQTYP1),AL1(FLDNTYPE)    TYPE                      
         DC    AL1(REPFNXT+REPF1LN)                        X'81'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    AL2(ACQDTEND-ACQTYP1),AL1(FLDNOCUR)    Override current          
         DC    AL1(REPF1LN)                                X'01'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    AL2(ACQOFFFL-ACQD),AL1(FLDNOFFC)       OFFC                      
         DC    AL1(REPFXLD)                                X'20'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03           
         DC    AL2(ACQANOF-ACQD),AL1(FLDNOFCC)        OFCC                      
         DC    AL1(REPFXLD+REPFMID+REPF1LN)                X'29'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03           
*                                                                               
         DC    AL2(ACQMTHD-ACQD),AL1(FLDNMTHD)        MTHD                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03           
         DC    AL2(ACQLOCS-ACQD),AL1(FLDNLOCS)        LOCS                      
         DC    AL1(REPFXLD+REPFMID+REPF1LN)                X'29'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03           
*                                                                               
         DC    AL2(ACQTYP1-ACQD),AL1(FLDNPRSC)        PRSC                      
         DC    AL1(REPFNME+REPF1LN)                        X'41'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(0),AL1(FLDNCNTR)                   CNTR                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03           
         DC    AL2(ACQTYP1-ACQD),AL1(FLDNCLNT)        CLNT                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFWLD+REPFRNRF+REPFPRF)                     X'23           
         DC    AL2(ACQWRKLS-ACQD),AL1(FLDNWKCD)       WKCD                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03           
*                                                                               
         DC    AL2(ACQOPT8-ACQD),AL1(FLDNFRPT)        FRPT                      
         DC    AL1(REPF1LN)                                X'01'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    AL2(1),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(2),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(3),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(4),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ+REPFMID)                X'98'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(5),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ+REPF1LN)                X'91'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    X'FF'                                                            
         EJECT                                                                  
***********************************************************************         
*  PAYABLES SCREEN FIELDS TO BUILD                                    *         
***********************************************************************         
         SPACE 1                                                                
REPFLDSP DS    0H                                                               
         DC    AL2(ACQUNT-ACQD),AL1(FLDNUNLG)         UNLG                      
         DC    AL1(REPFNME+REPF1LN)                        X'41'                
         DC    AL1(REPFPRF+REPFRNRF)                             X'03'          
         DC    AL2(ACQACT-ACQD),AL1(FLDNACCT)         ACCT                      
         DC    AL1(REPFNME+REPFXLD+REPF2LN)                X'62'                
         DC    AL1(REPFWLD+REPFRNRF+REPFPRF)                     X'23           
         DC    AL2(ACQTTYPE-ACQD),AL1(FLDNTRNT)       TRNT                      
         DC    AL1(REPFXLD)                                X'20'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03'          
*                                                                               
         DC    AL2(ACQACTF1-ACQD),AL1(FLDNFLT1)       FLT1                      
         DC    AL1(REPFNXT+REPFXLD+REPFMID)                X'A8'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF2-ACQD),AL1(FLDNFLT2)       FLT2                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF3-ACQD),AL1(FLDNFLT3)       FLT3                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF4-ACQD),AL1(FLDNFLT4)       FLT4                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF5-ACQD),AL1(FLDNFLT5)       FLT5                      
         DC    AL1(REPFNXT+REPFXLD+REPF1LN)                X'A1'                
         DC    AL1(REPFRNRF)                                     X'02'          
*                                                                               
         DC    AL2(ACQSTART-ACQD),AL1(FLDNSTDT)       STDT                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQEND-ACQD),AL1(FLDNENDT)         ENDT                      
         DC    AL1(REPFMID+REPF1LN)                        X'09'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQMOSPD-ACQD),AL1(FLDNMOAR)       MOAR                      
*&&US                                                                           
         DC    AL1(REPF1LN)                                X'01'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTSTR-ACQTYP1),AL1(FLDNMMOS)    MMOS                      
*&&                                                                             
         DC    AL1(REPF1LN)                                X'01'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQACTST-ACQD),AL1(FLDNACTS)       ACTS                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQACTND-ACQD),AL1(FLDNACTE)       ACTE                      
         DC    AL1(REPFMID+REPF1LN)                        X'09'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTSTR-ACQTYP1),AL1(FLDNALTS)    ALTS                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTEND-ACQTYP1),AL1(FLDNALTE)    ALTE                      
         DC    AL1(REPFMID)                                X'08'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTTYP-ACQTYP1),AL1(FLDNTYPE)    TYPE                      
         DC    AL1(REPFNXT+REPF2LN)                        X'82'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    AL2(ACQDTEND-ACQTYP1),AL1(FLDNOCUR)    Override current          
         DC    AL1(0)                                      X'08'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQOFFFL-ACQD),AL1(FLDNOFFC)       OFFC                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03           
         DC    AL2(ACQTYP1-ACQD),AL1(FLDNCLNT)        CLNT                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFWLD+REPFRNRF+REPFPRF)                     X'23           
*&&DO*&& DC    AL2(ACQTTYPE-ACQD),AL1(FLDNTRNT)       TRNT                      
*&&DO*&& DC    AL1(REPFNME+REPFXLD+REPFSTO+REPF1LN)        X'65'                
*&&DO*&& DC    AL1(REPFRNRF+REPFPRF)                             X'03           
*                                                                               
         DC    AL2(ACQOPT8-ACQD),AL1(FLDNFRPT)        FRPT                      
         DC    AL1(REPF1LN)                                X'01'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    AL2(1),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(2),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(3),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(4),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ+REPFMID)                X'98'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(5),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ+REPF1LN)                X'91'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    X'FF'                                                            
         EJECT ,                                                                
***********************************************************************         
*  Receivable Screen fields to build (Debtors UK)                     *         
***********************************************************************         
         SPACE 1                                                                
REPFLDSR DS    0H                                                               
         DC    AL2(ACQUNT-ACQD),AL1(FLDNUNLG)         UNLG                      
         DC    AL1(REPFNME+REPF1LN)                        X'41'                
         DC    AL1(REPFPRF+REPFRNRF)                             X'03'          
         DC    AL2(ACQACT-ACQD),AL1(FLDNACCT)         ACCT                      
         DC    AL1(REPFNME+REPFXLD+REPF2LN)                X'62'                
         DC    AL1(REPFWLD+REPFRNRF+REPFPRF)                     X'23           
         DC    AL2(ACQTTYPE-ACQD),AL1(FLDNTRNT)       TRNT                      
         DC    AL1(REPFXLD)                                X'20'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03'          
*                                                                               
         DC    AL2(ACQACTF1-ACQD),AL1(FLDNFLT1)       FLT1                      
         DC    AL1(REPFNXT+REPFXLD+REPFMID)                X'A8'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF2-ACQD),AL1(FLDNFLT2)       FLT2                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF3-ACQD),AL1(FLDNFLT3)       FLT3                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF4-ACQD),AL1(FLDNFLT4)       FLT4                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF5-ACQD),AL1(FLDNFLT5)       FLT5                      
         DC    AL1(REPFNXT+REPFXLD+REPF1LN)                X'A1'                
         DC    AL1(REPFRNRF)                                     X'02'          
*                                                                               
         DC    AL2(ACQSTART-ACQD),AL1(FLDNSTDT)       STDT                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQEND-ACQD),AL1(FLDNENDT)         ENDT                      
         DC    AL1(REPFMID+REPF1LN)                        X'09'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQMOSPD-ACQD),AL1(FLDNMOAR)       MOAR                      
         DC    AL1(REPF1LN)                                X'01'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQACTST-ACQD),AL1(FLDNACTS)       ACTS                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQACTND-ACQD),AL1(FLDNACTE)       ACTE                      
         DC    AL1(REPFMID+REPF1LN)                        X'09'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTSTR-ACQTYP1),AL1(FLDNALTS)    ALTS                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTEND-ACQTYP1),AL1(FLDNALTE)    ALTE                      
         DC    AL1(REPFMID)                                X'08'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTTYP-ACQTYP1),AL1(FLDNTYPE)    TYPE                      
         DC    AL1(REPFNXT+REPF2LN)                        X'82'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    AL2(ACQDTEND-ACQTYP1),AL1(FLDNOCUR)    Override current          
         DC    AL1(0)                                      X'08'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQOFFFL-ACQD),AL1(FLDNOFFC)       OFFC                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03           
         DC    AL2(ACQTYP1-ACQD),AL1(FLDNCLNT)        CLNT                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFWLD+REPFRNRF+REPFPRF)                     X'23           
         DC    AL2(ACQTYP1-ACQD),AL1(FLDNBSRC)        BSRC                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03           
*&&US*&& DC    AL2(ACQTYP1-ACQD),AL1(FLDNPART)        PART                      
*&&US*&& DC    AL1(REPFNME+REPF1LN)                        X'41'                
*&&US*&& DC    AL1(REPFRNRF+REPFPRF)                             X'03           
*&&DO*&& DC    AL2(ACQTTYPE-ACQD),AL1(FLDNTRNT)       TRNT                      
*&&DO*&& DC    AL1(REPFNME+REPFXLD+REPFSTO+REPF1LN)        X'65'                
*&&DO*&& DC    AL1(REPFRNRF+REPFPRF)                             X'03           
*                                                                               
         DC    AL2(ACQOPT8-ACQD),AL1(FLDNFRPT)        FRPT                      
         DC    AL1(REPF1LN)                                X'01'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    AL2(1),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(2),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(3),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(4),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ+REPFMID)                X'98'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(5),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ+REPF1LN)                X'91'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    X'FF'                                                            
         EJECT ,                                                                
***********************************************************************         
*  EXPENSE SCREEN FIELDS TO BUILD                                     *         
***********************************************************************         
         SPACE 1                                                                
REPFLDSX DS    0H                                                               
         DC    AL2(ACQUNT-ACQD),AL1(FLDNUNLG)         UNLG                      
         DC    AL1(REPFNME+REPF1LN)                        X'41'                
         DC    AL1(REPFPRF+REPFRNRF)                             X'03'          
         DC    AL2(ACQACT-ACQD),AL1(FLDNACCT)         ACCT                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFWLD+REPFRNRF+REPFPRF)                     X'23           
         DC    AL2(0),AL1(FLDNCNTR)                   CNTR                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFPRF+REPFRNRF)                             X'03'          
         DC    AL2(ACQTTYPE-ACQD),AL1(FLDNTRNT)       TRNT                      
         DC    AL1(REPFXLD)                                X'20'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03'          
*                                                                               
         DC    AL2(ACQACTF1-ACQD),AL1(FLDNFLT1)       FLT1                      
         DC    AL1(REPFNXT+REPFXLD+REPFMID)                X'A8'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF2-ACQD),AL1(FLDNFLT2)       FLT2                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF3-ACQD),AL1(FLDNFLT3)       FLT3                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF4-ACQD),AL1(FLDNFLT4)       FLT4                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF5-ACQD),AL1(FLDNFLT5)       FLT5                      
         DC    AL1(REPFNXT+REPFXLD+REPF1LN)                X'A1'                
         DC    AL1(REPFRNRF)                                     X'02'          
*                                                                               
         DC    AL2(ACQSTART-ACQD),AL1(FLDNSTDT)       STDT                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQEND-ACQD),AL1(FLDNENDT)         ENDT                      
         DC    AL1(REPFMID+REPF1LN)                        X'09'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQMOSPD-ACQD),AL1(FLDNMOAR)       MOAR                      
         DC    AL1(REPF1LN)                                X'01'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQACTST-ACQD),AL1(FLDNACTS)       ACTS                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQACTND-ACQD),AL1(FLDNACTE)       ACTE                      
         DC    AL1(REPFMID+REPF1LN)                        X'09'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTSTR-ACQTYP1),AL1(FLDNALTS)    ALTS                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTEND-ACQTYP1),AL1(FLDNALTE)    ALTE                      
         DC    AL1(REPFMID)                                X'08'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTTYP-ACQTYP1),AL1(FLDNTYPE)    TYPE                      
         DC    AL1(REPFNXT+REPF1LN)                        X'81'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    AL2(ACQDTEND-ACQTYP1),AL1(FLDNOCUR)    Override current          
         DC    AL1(0)                                      X'08'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQOFFFL-ACQD),AL1(FLDNOFFC)       OFFC                      
         DC    AL1(REPFXLD)                                X'20'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03'          
         DC    AL2(ACQANOF-ACQD),AL1(FLDNAOFF)        AOFF                      
         DC    AL1(REPFMID+REPF1LN)                        X'09'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03           
         DC    AL2(ACQTYP1-ACQD),AL1(FLDNDEPT)        DEPT                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFWLD+REPFRNRF+REPFPRF)                     X'23           
         DC    AL2(ACQTYP1-ACQD),AL1(FLDNPRSN)        PRSN                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFWLD+REPFRNRF+REPFPRF)                     X'23           
         DC    AL2(ACQTYP1-ACQD),AL1(FLDNCSTA)        CSTA                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFWLD+REPFRNRF+REPFPRF)                     X'23           
         DC    AL2(ACQTYP1-ACQD),AL1(FLDNDEXP)        DEXP                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFWLD+REPFRNRF+REPFPRF)                     X'23           
         DC    AL2(ACQTYP1-ACQD),AL1(FLDNVNDR)        VNDR                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFWLD+REPFRNRF+REPFPRF)                     X'23           
*&&DO*&& DC    AL2(ACQTTYPE-ACQD),AL1(FLDNTRNT)       TRNT                      
*&&DO*&& DC    AL1(REPFNME+REPFXLD+REPFSTO+REPF1LN)        X'65'                
*&&DO*&& DC    AL1(REPFRNRF+REPFPRF)                             X'03           
*                                                                               
         DC    AL2(ACQOPT8-ACQD),AL1(FLDNFRPT)        FRPT                      
         DC    AL1(REPF1LN)                                X'01'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    AL2(1),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(2),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(3),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(4),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ+REPFMID)                X'98'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(5),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ+REPF1LN)                X'91'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    X'FF'                                                            
         EJECT ,                                                                
***********************************************************************         
*  PROFIT AND LOSS SCREEN FIELDS TO BUILD                             *         
***********************************************************************         
         SPACE 1                                                                
REPFLD1C DS    0H                                                               
         DC    AL2(ACQUNT-ACQD),AL1(FLDNUNLG)         UNLG                      
         DC    AL1(REPFNME+REPF1LN)                        X'41'                
         DC    AL1(REPFPRF)                                      X'01'          
         DC    AL2(ACQACT-ACQD),AL1(FLDNACCT)         ACCT                      
         DC    AL1(REPFNME+REPFXLD+REPF2LN)                X'62'                
         DC    AL1(REPFWLD+REPFRNRF+REPFPRF)                     X'23           
*        DC    AL2(ACQTTYPE-ACQD),AL1(FLDNTRNT)       TRNT                      
*        DC    AL1(REPFXLD)                                X'20'                
*        DC    AL1(REPFRNRF+REPFPRF)                             X'03'          
*                                                                               
         DC    AL2(ACQACTF1-ACQD),AL1(FLDNFLT1)       FLT1                      
*        DC    AL1(REPFNXT+REPFXLD+REPFMID)                X'A8'                
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03'          
         DC    AL2(ACQACTF2-ACQD),AL1(FLDNFLT2)       FLT2                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03'          
         DC    AL2(ACQACTF3-ACQD),AL1(FLDNFLT3)       FLT3                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03'          
         DC    AL2(ACQACTF4-ACQD),AL1(FLDNFLT4)       FLT4                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03'          
         DC    AL2(ACQACTF5-ACQD),AL1(FLDNFLT5)       FLT5                      
         DC    AL1(REPFNXT+REPFXLD+REPF1LN)                X'A1'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03'          
*                                                                               
*        DC    AL2(ACQSTART-ACQD),AL1(FLDNSTDT)       STDT                      
*        DC    AL1(0)                                      X'00'                
*        DC    AL1(0)                                            X'00'          
*        DC    AL2(ACQEND-ACQD),AL1(FLDNENDT)         ENDT                      
*        DC    AL1(REPFMID+REPF1LN)                        X'09'                
*        DC    AL1(0)                                            X'00'          
         DC    AL2(ACQMOSPD-ACQD),AL1(FLDNMOAR)       MOAR                      
         DC    AL1(REPF1LN)                                X'01'                
         DC    AL1(0)                                            X'00'          
*        DC    AL2(ACQACTST-ACQD),AL1(FLDNACTS)       ACTS                      
*        DC    AL1(0)                                      X'00'                
*        DC    AL1(0)                                            X'00'          
*        DC    AL2(ACQACTND-ACQD),AL1(FLDNACTE)       ACTE                      
*        DC    AL1(REPFMID+REPF1LN)                        X'09'                
*        DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTSTR-ACQTYP1),AL1(FLDNALTS)    ALTS                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTEND-ACQTYP1),AL1(FLDNALTE)    ALTE                      
         DC    AL1(REPFMID)                                X'08'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTTYP-ACQTYP1),AL1(FLDNTYPE)    TYPE                      
         DC    AL1(REPFNXT+REPF2LN)                        X'82'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    AL2(ACQDTEND-ACQTYP1),AL1(FLDNOCUR)    Override current          
         DC    AL1(0)                                      X'08'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQOFFFL-ACQD),AL1(FLDNOFFC)       OFFC                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFPRF+REPFRNRF)                             X'03'          
         DC    AL2(ACQMTHD-ACQD),AL1(FLDNMTHD)        MTHD                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03           
         DC    AL2(ACQTYP1-ACQD),AL1(FLDNCLNT)        CLNT                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFWLD+REPFRNRF+REPFPRF)                     X'23           
*&&DO*&& DC    AL2(ACQTTYPE-ACQD),AL1(FLDNTRNT)       TRNT                      
*&&DO*&& DC    AL1(REPFNME+REPFXLD+REPFSTO+REPF1LN)        X'65'                
*&&DO*&& DC    AL1(REPFRNRF+REPFPRF)                             X'03           
*                                                                               
         DC    AL2(ACQOPT8-ACQD),AL1(FLDNFRPT)        FRPT                      
         DC    AL1(REPF1LN)                                X'01'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    AL2(1),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(2),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(3),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(4),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ+REPFMID)                X'98'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(5),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ+REPF1LN)                X'91'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    X'FF'                                                            
         EJECT ,                                                                
***********************************************************************         
*  CASH SCREEN FIELDS TO BUILD                                        *         
***********************************************************************         
         SPACE 1                                                                
REPFLDSC DS    0H                                                               
         DC    AL2(ACQUNT-ACQD),AL1(FLDNUNLG)         UNLG                      
         DC    AL1(REPFNME+REPF1LN)                        X'41'                
         DC    AL1(REPFPRF)                                      X'01'          
         DC    AL2(ACQACT-ACQD),AL1(FLDNACCT)         ACCT                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFWLD+REPFRNRF+REPFPRF)                     X'23           
         DC    AL2(0),AL1(FLDNCNTR)                   CNTR                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFPRF+REPFRNRF)                             X'03'          
         DC    AL2(ACQTTYPE-ACQD),AL1(FLDNTRNT)       TRNT                      
         DC    AL1(REPFXLD)                                X'20'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03'          
*                                                                               
         DC    AL2(ACQACTF1-ACQD),AL1(FLDNFLT1)       FLT1                      
         DC    AL1(REPFNXT+REPFXLD+REPFMID)                X'A8'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF2-ACQD),AL1(FLDNFLT2)       FLT2                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF3-ACQD),AL1(FLDNFLT3)       FLT3                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF4-ACQD),AL1(FLDNFLT4)       FLT4                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF5-ACQD),AL1(FLDNFLT5)       FLT5                      
         DC    AL1(REPFNXT+REPFXLD+REPF1LN)                X'A1'                
         DC    AL1(REPFRNRF)                                     X'02'          
*                                                                               
         DC    AL2(ACQSTART-ACQD),AL1(FLDNSTDT)       STDT                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQEND-ACQD),AL1(FLDNENDT)         ENDT                      
         DC    AL1(REPFMID+REPF1LN)                        X'09'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQMOSPD-ACQD),AL1(FLDNMOAR)       MOAR                      
         DC    AL1(REPF1LN)                                X'01'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQACTST-ACQD),AL1(FLDNACTS)       ACTS                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQACTND-ACQD),AL1(FLDNACTE)       ACTE                      
         DC    AL1(REPFMID+REPF1LN)                        X'09'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTSTR-ACQTYP1),AL1(FLDNALTS)    ALTS                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTEND-ACQTYP1),AL1(FLDNALTE)    ALTE                      
         DC    AL1(REPFMID)                                X'08'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTTYP-ACQTYP1),AL1(FLDNTYPE)    TYPE                      
         DC    AL1(REPFNXT+REPF2LN)                        X'82'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    AL2(ACQDTEND-ACQTYP1),AL1(FLDNOCUR)    Override current          
         DC    AL1(0)                                      X'08'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQOFFFL-ACQD),AL1(FLDNOFFC)       OFFC                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFPRF+REPFRNRF)                             X'03'          
         DC    AL2(ACQRECON-ACQD),AL1(FLDNRCON)       RECONCILED                
         DC    AL1(REPF1LN)                                X'01'                
         DC    AL1(REPFPRF)                                      X'01'          
*&&DO*&& DC    AL2(ACQTTYPE-ACQD),AL1(FLDNTRNT)       TRNT                      
*&&DO*&& DC    AL1(REPFNME+REPFXLD+REPFSTO+REPF1LN)        X'65'                
*&&DO*&& DC    AL1(REPFRNRF+REPFPRF)                             X'03           
*                                                                               
         DC    AL2(ACQOPT8-ACQD),AL1(FLDNFRPT)        FRPT                      
         DC    AL1(REPF1LN)                                X'01'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    AL2(1),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(2),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(3),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(4),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ+REPFMID)                X'98'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(5),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ+REPF1LN)                X'91'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    X'FF'                                                            
         EJECT ,                                                                
***********************************************************************         
*  GENERAL LEDGER SCREEN FIELDS TO BUILD                              *         
***********************************************************************         
         SPACE 1                                                                
REPFLDGL DS    0H                                                               
         DC    AL2(ACQUNT-ACQD),AL1(FLDNUNLG)         UNLG                      
         DC    AL1(REPFNME+REPF1LN)                        X'41'                
         DC    AL1(REPFPRF+REPFRNRF)                             X'03'          
         DC    AL2(ACQACT-ACQD),AL1(FLDNACCT)         ACCT                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFWLD+REPFRNRF+REPFPRF)                     X'23           
         DC    AL2(0),AL1(FLDNCNTR)                   CNTR                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFPRF+REPFRNRF)                             X'03'          
         DC    AL2(ACQTTYPE-ACQD),AL1(FLDNTRNT)       TRNT                      
         DC    AL1(REPFXLD)                                X'20'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03'          
*                                                                               
         DC    AL2(ACQACTF1-ACQD),AL1(FLDNFLT1)       FLT1                      
         DC    AL1(REPFNXT+REPFXLD+REPFMID)                X'A8'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF2-ACQD),AL1(FLDNFLT2)       FLT2                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF3-ACQD),AL1(FLDNFLT3)       FLT3                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF4-ACQD),AL1(FLDNFLT4)       FLT4                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF5-ACQD),AL1(FLDNFLT5)       FLT5                      
         DC    AL1(REPFNXT+REPFXLD+REPF1LN)                X'A1'                
         DC    AL1(REPFRNRF)                                     X'02'          
*                                                                               
         DC    AL2(ACQSTART-ACQD),AL1(FLDNSTDT)       STDT                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQEND-ACQD),AL1(FLDNENDT)         ENDT                      
         DC    AL1(REPFMID+REPF1LN)                        X'09'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQMOSPD-ACQD),AL1(FLDNMOAR)       MOAR                      
         DC    AL1(REPF1LN)                                X'01'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQACTST-ACQD),AL1(FLDNACTS)       ACTS                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQACTND-ACQD),AL1(FLDNACTE)       ACTE                      
         DC    AL1(REPFMID+REPF1LN)                        X'09'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTSTR-ACQTYP1),AL1(FLDNALTS)    ALTS                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTEND-ACQTYP1),AL1(FLDNALTE)    ALTE                      
         DC    AL1(REPFMID)                                X'08'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTTYP-ACQTYP1),AL1(FLDNTYPE)    TYPE                      
         DC    AL1(REPFNXT+REPF2LN)                        X'82'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    AL2(ACQDTEND-ACQTYP1),AL1(FLDNOCUR)    Override current          
         DC    AL1(0)                                      X'08'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQOFFFL-ACQD),AL1(FLDNOFFC)       OFFC                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFPRF+REPFRNRF)                             X'03'          
*&&DO*&& DC    AL2(ACQTTYPE-ACQD),AL1(FLDNTRNT)       TRNT                      
*&&DO*&& DC    AL1(REPFNME+REPFXLD+REPFSTO+REPF1LN)        X'65'                
*&&DO*&& DC    AL1(REPFRNRF+REPFPRF)                             X'03           
*                                                                               
         DC    AL2(ACQOPT8-ACQD),AL1(FLDNFRPT)        FRPT                      
         DC    AL1(REPF1LN)                                X'01'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    AL2(1),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(2),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(3),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(4),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ+REPFMID)                X'98'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(5),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ+REPF1LN)                X'91'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    X'FF'                                                            
         EJECT ,                                                                
***********************************************************************         
*  MEDIA   LEDGER SCREEN FIELDS TO BUILD                              *         
***********************************************************************         
         SPACE 1                                                                
REPFLDSZ DS    0H                                                               
         DC    AL2(ACQUNT-ACQD),AL1(FLDNUNLG)         UNLG                      
         DC    AL1(REPFNME+REPF1LN)                        X'41'                
         DC    AL1(REPFPRF+REPFRNRF)                             X'03'          
         DC    AL2(ACQACT-ACQD),AL1(FLDNACCT)         ACCT                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFWLD+REPFRNRF+REPFPRF)                     X'23           
         DC    AL2(0),AL1(FLDNCNTR)                   CNTR                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFPRF+REPFRNRF)                             X'03'          
         DC    AL2(ACQTTYPE-ACQD),AL1(FLDNTRNT)       TRNT                      
         DC    AL1(REPFXLD)                                X'20'                
         DC    AL1(REPFRNRF+REPFPRF)                             X'03'          
*                                                                               
         DC    AL2(ACQACTF1-ACQD),AL1(FLDNFLT1)       FLT1                      
         DC    AL1(REPFNXT+REPFXLD+REPFMID)                X'A8'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF2-ACQD),AL1(FLDNFLT2)       FLT2                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF3-ACQD),AL1(FLDNFLT3)       FLT3                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF4-ACQD),AL1(FLDNFLT4)       FLT4                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF5-ACQD),AL1(FLDNFLT5)       FLT5                      
         DC    AL1(REPFNXT+REPFXLD+REPF1LN)                X'A1'                
         DC    AL1(REPFRNRF)                                     X'02'          
*                                                                               
         DC    AL2(ACQSTART-ACQD),AL1(FLDNSTDT)       STDT                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQEND-ACQD),AL1(FLDNENDT)         ENDT                      
         DC    AL1(REPFMID+REPF1LN)                        X'09'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQMOSPD-ACQD),AL1(FLDNMOAR)       MOAR                      
         DC    AL1(REPF1LN)                                X'01'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQACTST-ACQD),AL1(FLDNACTS)       ACTS                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQACTND-ACQD),AL1(FLDNACTE)       ACTE                      
         DC    AL1(REPFMID+REPF1LN)                        X'09'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTSTR-ACQTYP1),AL1(FLDNALTS)    ALTS                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTEND-ACQTYP1),AL1(FLDNALTE)    ALTE                      
         DC    AL1(REPFMID)                                X'08'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQDTTYP-ACQTYP1),AL1(FLDNTYPE)    TYPE                      
         DC    AL1(REPFNXT+REPF2LN)                        X'82'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    AL2(ACQDTEND-ACQTYP1),AL1(FLDNOCUR)    Override current          
         DC    AL1(0)                                      X'08'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQOFFFL-ACQD),AL1(FLDNOFFC)       OFFC                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(REPFPRF+REPFRNRF)                             X'03'          
*&&DO*&& DC    AL2(ACQTTYPE-ACQD),AL1(FLDNTRNT)       TRNT                      
*&&DO*&& DC    AL1(REPFNME+REPFXLD+REPFSTO+REPF1LN)        X'65'                
*&&DO*&& DC    AL1(REPFRNRF+REPFPRF)                             X'03           
*                                                                               
         DC    AL2(ACQOPT8-ACQD),AL1(FLDNFRPT)        FRPT                      
         DC    AL1(REPF1LN)                                X'01'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    AL2(1),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(2),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(3),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ)                        X'90'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(4),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ+REPFMID)                X'98'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(5),AL1(FLDNRCAP)                   RCAP                      
         DC    AL1(REPFNXT+REPFREQ+REPF1LN)                X'91'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    X'FF'                                                            
         EJECT ,                                                                
***********************************************************************         
*  APG FI SCREEN FIELDS TO BUILD                                      *         
***********************************************************************         
         SPACE 1                                                                
REPFLDFI DS    0H                                                               
         DC    AL2(ACQUNT-ACQD),AL1(FLDNUNLG)         UNLG                      
         DC    AL1(REPFNME+REPFREQ+REPF1LN)                X'51'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQACT-ACQD),AL1(FLDNACCT)         ACCT                      
         DC    AL1(REPFNME+REPF1LN)                        X'41'                
         DC    AL1(0)                                            X'00           
         DC    AL2(ACQOFFFL-ACQD),AL1(FLDNOFFC)       OFFC                      
         DC    AL1(0)                                      X'00                 
         DC    AL1(0)                                            X'00           
*                                                                               
         DC    AL2(ACQACTF1-ACQD),AL1(FLDNFLT1)       FLT1                      
         DC    AL1(REPFNXT+REPFXLD+REPFMID)                X'A8'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF2-ACQD),AL1(FLDNFLT2)       FLT2                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF3-ACQD),AL1(FLDNFLT3)       FLT3                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF4-ACQD),AL1(FLDNFLT4)       FLT4                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF5-ACQD),AL1(FLDNFLT5)       FLT5                      
         DC    AL1(REPFNXT+REPFXLD+REPF1LN)                X'A1'                
         DC    AL1(REPFRNRF)                                     X'02'          
*                                                                               
         DC    AL2(ACQSTART-ACQD),AL1(FLDNSTDT)       STDT                      
         DC    AL1(REPFREQ+REPF1LN)                        X'11'                
         DC    AL1(0)                                            X'00           
         DC    AL2(ACQEND-ACQD),AL1(FLDNENDT)         ENDT                      
         DC    AL1(REPFREQ+REPF1LN)                        X'11'                
         DC    AL1(0)                                            X'00           
         DC    AL2(ACQSEL-ACQD),AL1(FLDNSELT)         SELT                      
         DC    AL1(REPFNME+REPF1LN)                        X'41'                
         DC    AL1(0)                                            X'00           
*                                                                               
         DC    AL2(ACQOPT1-ACQD),AL1(FLDNOPT1)        OPT1                      
         DC    AL1(REPFNME+REPF1LN)                        X'41'                
         DC    AL1(0)                                            X'00           
         DC    AL2(ACQOPT3-ACQD),AL1(FLDNOPT3)        OPT3                      
         DC    AL1(REPFNME+REPF1LN)                        X'41'                
         DC    AL1(0)                                            X'00           
         DC    AL2(ACQOPT4-ACQD),AL1(FLDNOPT4)        OPT4                      
         DC    AL1(REPFNME+REPF1LN)                        X'41'                
         DC    AL1(0)                                            X'00           
         DC    AL2(ACQOPT6-ACQD),AL1(FLDNOPT6)        OPT6                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(0)                                            X'00           
*                                                                               
         DC    AL2(ACQBILGP-ACQD),AL1(FLDNCURC)       CURC                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQTYP1-ACQD),AL1(FLDNOVHD)        OVHD                      
         DC    AL1(REPFMID+REPF1LN)                        X'09'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQCOMNT-ACQD),AL1(FLDNNARA)       NARA                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQMTHD-ACQD),AL1(FLDNMTHD)        MTHD                      
         DC    AL1(REPFMID+REPF1LN)                        X'09'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    AL2(ACQAPPL-ACQD+0),AL1(FLDNBUDG)      BUD 1                     
         DC    AL1(REPFNXT)                                X'80'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQAPPL-ACQD+1),AL1(FLDNBUDG)      BUD 2                     
         DC    AL1(REPFNXT)                                X'80'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQAPPL-ACQD+2),AL1(FLDNBUDG)      BUD 3                     
         DC    AL1(REPFNXT+REPFMID)                        X'88'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQAPPL-ACQD+3),AL1(FLDNBUDG)      BUD 4                     
         DC    AL1(REPFNXT+REPF1LN)                        X'81'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQAPPL-ACQD+4),AL1(FLDNBUDG)      BUD 5                     
         DC    AL1(REPFNXT)                                X'80'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQAPPL-ACQD+5),AL1(FLDNBUDG)      BUD 6                     
         DC    AL1(REPFNXT)                                X'80'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQAPPL-ACQD+6),AL1(FLDNBUDG)      BUD 7                     
         DC    AL1(REPFNXT+REPFMID)                        X'88'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQAPPL-ACQD+7),AL1(FLDNBUDG)      BUD 8                     
         DC    AL1(REPFNXT+REPF1LN)                        X'81'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQAPPL-ACQD+8),AL1(FLDNBUDG)      BUD 9                     
         DC    AL1(REPFNXT)                                X'80'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQAPPL-ACQD+9),AL1(FLDNBUDG)      BUD 10                    
         DC    AL1(REPFNXT)                                X'80'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQAPPL-ACQD+10),AL1(FLDNBUDG)     BUD 11                    
         DC    AL1(REPFNXT+REPFMID)                        X'88'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQAPPL-ACQD+11),AL1(FLDNBUDG)     BUD 12                    
         DC    AL1(REPFNXT+REPF1LN)                        X'81'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    X'FF'                                                            
         EJECT ,                                                                
***********************************************************************         
*  APG M2 SCREEN FIELDS TO BUILD                                      *         
***********************************************************************         
         SPACE 1                                                                
REPFLDM2 DS    0H                                                               
         DC    AL2(ACQUNT-ACQD),AL1(FLDNUNLG)         UNLG                      
         DC    AL1(REPFNME+REPFREQ+REPF1LN)                X'51'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQACT-ACQD),AL1(FLDNACCT)         ACCT                      
         DC    AL1(REPFNME+REPF1LN)                        X'41'                
         DC    AL1(0)                                            X'00           
         DC    AL2(ACQOFFFL-ACQD),AL1(FLDNOFFC)       OFFC                      
         DC    AL1(0)                                      X'00                 
         DC    AL1(0)                                            X'00           
*                                                                               
         DC    AL2(ACQACTF1-ACQD),AL1(FLDNFLT1)       FLT1                      
         DC    AL1(REPFNXT+REPFXLD+REPFMID)                X'A8'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF2-ACQD),AL1(FLDNFLT2)       FLT2                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF3-ACQD),AL1(FLDNFLT3)       FLT3                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF4-ACQD),AL1(FLDNFLT4)       FLT4                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF5-ACQD),AL1(FLDNFLT5)       FLT5                      
         DC    AL1(REPFNXT+REPFXLD+REPF1LN)                X'A1'                
         DC    AL1(REPFRNRF)                                     X'02'          
*                                                                               
         DC    AL2(ACQSTART-ACQD),AL1(FLDNSTDT)       STDT                      
         DC    AL1(REPFREQ+REPF1LN)                        X'11'                
         DC    AL1(0)                                            X'00           
         DC    AL2(ACQEND-ACQD),AL1(FLDNENDT)         ENDT                      
         DC    AL1(REPFREQ+REPF1LN)                        X'11'                
         DC    AL1(0)                                            X'00           
         DC    AL2(ACQSEL-ACQD),AL1(FLDNSELT)         SELT                      
         DC    AL1(REPFNME+REPF1LN)                        X'41'                
         DC    AL1(0)                                            X'00           
*                                                                               
         DC    AL2(ACQOPT1-ACQD),AL1(FLDNOPT1)        OPT1                      
         DC    AL1(REPFNME+REPF1LN)                        X'41'                
         DC    AL1(0)                                            X'00           
         DC    AL2(ACQOPT3-ACQD),AL1(FLDNOPT3)        OPT3                      
         DC    AL1(REPFNME+REPF1LN)                        X'41'                
         DC    AL1(0)                                            X'00           
         DC    AL2(ACQOPT4-ACQD),AL1(FLDNOPT4)        OPT4                      
         DC    AL1(REPFNME+REPF1LN)                        X'41'                
         DC    AL1(0)                                            X'00           
         DC    AL2(ACQOPT6-ACQD),AL1(FLDNOPT6)        OPT6                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(0)                                            X'00           
*                                                                               
         DC    AL2(ACQCOMNT-ACQD),AL1(FLDNNARA)       NARA                      
         DC    AL1(0)                                      X'00'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQMTHD-ACQD),AL1(FLDNMTHD)        MTHD                      
         DC    AL1(REPFMID+REPF1LN)                        X'09'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    AL2(ACQAPPL-ACQD+0),AL1(FLDNBUDG)      BUD 1                     
         DC    AL1(REPFNXT)                                X'80'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQAPPL-ACQD+1),AL1(FLDNBUDG)      BUD 2                     
         DC    AL1(REPFNXT)                                X'80'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQAPPL-ACQD+2),AL1(FLDNBUDG)      BUD 3                     
         DC    AL1(REPFNXT+REPFMID)                        X'88'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQAPPL-ACQD+3),AL1(FLDNBUDG)      BUD 4                     
         DC    AL1(REPFNXT+REPF1LN)                        X'81'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQAPPL-ACQD+4),AL1(FLDNBUDG)      BUD 5                     
         DC    AL1(REPFNXT)                                X'80'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQAPPL-ACQD+5),AL1(FLDNBUDG)      BUD 6                     
         DC    AL1(REPFNXT)                                X'80'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQAPPL-ACQD+6),AL1(FLDNBUDG)      BUD 7                     
         DC    AL1(REPFNXT+REPFMID)                        X'88'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQAPPL-ACQD+7),AL1(FLDNBUDG)      BUD 8                     
         DC    AL1(REPFNXT+REPF1LN)                        X'81'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQAPPL-ACQD+8),AL1(FLDNBUDG)      BUD 9                     
         DC    AL1(REPFNXT)                                X'80'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQAPPL-ACQD+9),AL1(FLDNBUDG)      BUD 10                    
         DC    AL1(REPFNXT)                                X'80'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQAPPL-ACQD+10),AL1(FLDNBUDG)     BUD 11                    
         DC    AL1(REPFNXT+REPFMID)                        X'88'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQAPPL-ACQD+11),AL1(FLDNBUDG)     BUD 12                    
         DC    AL1(REPFNXT+REPF1LN)                        X'81'                
         DC    AL1(0)                                            X'00'          
*                                                                               
         DC    X'FF'                                                            
         EJECT ,                                                                
***********************************************************************         
*  APG IV SCREEN FIELDS TO BUILD                                      *         
***********************************************************************         
         SPACE 1                                                                
REPFLDIV DS    0H                                                               
         DC    AL2(ACQUNT-ACQD),AL1(FLDNUNLG)         UNLG                      
         DC    AL1(REPFNME+REPFREQ+REPF1LN)                X'51'                
         DC    AL1(0)                                            X'00'          
         DC    AL2(ACQACT-ACQD),AL1(FLDNACCT)         ACCT                      
         DC    AL1(REPFNME+REPF1LN)                        X'41'                
         DC    AL1(0)                                            X'00           
         DC    AL2(ACQOFFFL-ACQD),AL1(FLDNOFFC)       OFFC                      
         DC    AL1(0)                                      X'00                 
         DC    AL1(0)                                            X'00           
*                                                                               
         DC    AL2(ACQACTF1-ACQD),AL1(FLDNFLT1)       FLT1                      
         DC    AL1(REPFNXT+REPFXLD+REPFMID)                X'A8'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF2-ACQD),AL1(FLDNFLT2)       FLT2                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF3-ACQD),AL1(FLDNFLT3)       FLT3                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF4-ACQD),AL1(FLDNFLT4)       FLT4                      
         DC    AL1(REPFNXT+REPFXLD)                        X'A0'                
         DC    AL1(REPFRNRF)                                     X'02'          
         DC    AL2(ACQACTF5-ACQD),AL1(FLDNFLT5)       FLT5                      
         DC    AL1(REPFNXT+REPFXLD+REPF1LN)                X'A1'                
         DC    AL1(REPFRNRF)                                     X'02'          
*                                                                               
         DC    AL2(ACQSTART-ACQD),AL1(FLDNSTDT)       STDT                      
         DC    AL1(REPFREQ+REPF1LN)                        X'11'                
         DC    AL1(0)                                            X'00           
         DC    AL2(ACQEND-ACQD),AL1(FLDNENDT)         ENDT                      
         DC    AL1(REPFREQ+REPF1LN)                        X'11'                
         DC    AL1(0)                                            X'00           
         DC    AL2(ACQSEL-ACQD),AL1(FLDNSELT)         SELT                      
         DC    AL1(REPFNME+REPF1LN)                        X'41'                
         DC    AL1(0)                                            X'00           
*                                                                               
         DC    AL2(ACQOPT1-ACQD),AL1(FLDNOPT1)        OPT1                      
         DC    AL1(REPFNME+REPF1LN)                        X'41'                
         DC    AL1(0)                                            X'00           
         DC    AL2(ACQOPT3-ACQD),AL1(FLDNOPT3)        OPT3                      
         DC    AL1(REPFNME+REPF1LN)                        X'41'                
         DC    AL1(0)                                            X'00           
         DC    AL2(ACQOPT4-ACQD),AL1(FLDNOPT4)        OPT4                      
         DC    AL1(REPFNME+REPF1LN)                        X'41'                
         DC    AL1(0)                                            X'00           
         DC    AL2(ACQOPT6-ACQD),AL1(FLDNOPT6)        OPT6                      
         DC    AL1(REPFNME+REPFXLD+REPF1LN)                X'61'                
         DC    AL1(0)                                            X'00           
*                                                                               
         DC    X'FF'                                                            
         EJECT ,                                                                
***********************************************************************         
*  ALTERNATE DATE OPTIONS TABLE                                       *         
***********************************************************************         
         SPACE 1                                                                
*                                                                               
*        USA,UK,GER,FRA,SPA,ITA,DUT,???,???,???,???,???,???,???                 
*                                                                               
ADOPTTAB DS    0F                  ALTERNATE DATE OPTIONS TABLE                 
*                                                                               
         DC    AL1(ACQOPT3-ACQD,ACQDTCHK)    CHECK      DATE                    
         DC    CL8'RP'                                                          
         DC    CL14'CCSCCCBCCCCCCC'                                             
         DCDD  AC#CHKDT,ADODESCL                                                
*                                                                               
         DC    AL1(ACQOPT3-ACQD,ACQDTDEP)    DEPOSIT    DATE                    
         DC    CL8'R'                                                           
         DC    CL14'DDADDDSDDDDDDD'                                             
         DCDD  AC#DPSDT,ADODESCL                                                
*                                                                               
         DC    AL1(ACQOPT3-ACQD,ACQDTDUE)    DUE        DATE                    
*&&UK*&& DC    CL8'R'                                                           
*&&US*&& DC    CL8'RPV'                                                         
         DC    CL14'UUFUUUVUUUUUUU'                                             
*        DC    CL14'QQFQQQVQQQQQQQ'                                             
         DCDD  AC#DPSDT,ADODESCL                                                
*                                                                               
         DC    AL1(ACQOPT3-ACQD,ACQDTITF)    Interface  date                    
         DC    CL8'RI'                                                          
         DC    CL14'IIIIIIIIIIIIII'                                             
         DCDD  AC#RSXDT,ADODESCL                                                
*                                                                               
         DC    AL1(ACQOPT3-ACQD,ACQDTUTL)    Utilized   date                    
         DC    CL8'V'                                                           
*&&US*&& DC    CL14'UUAAUUAUUUUUUU'                                             
*&&UK*&& DC    CL14'UUUAUUAUUUUUUU'                                             
*&&US*&& DCDD  AC#UDATE,ADODESCL                                                
*&&UK*&& DCDD  AC#ALTDT,ADODESCL                                                
*                                                                               
         DC    AL1(ACQOPT3-ACQD,ACQDTOPN)    Open       Date                    
         DC    CL8'V'                                                           
         DC    CL14'OOOOOOOOOOOOOO'                                             
         DCDD  AC#OPNDT,ADODESCL                                                
*                                                                               
         DC    AL1(ACQOPT3-ACQD,ACQDTCLS)    Closed     Date                    
         DC    CL8'V'                                                           
         DC    CL14'CCCFCCSCCCCCCC'                                             
         DCDD  AC#CLSDD,ADODESCL                                                
*                                                                               
         DC    AL1(ACQOPT3-ACQD,ACQDTAPR)    Est Approv Date                    
*&&UK*&& DC    CL8'V'                                                           
*&&US*&& DC    CL8'V'                                                           
*&&US*&& DC    CL14'AAPEAAGAAAAAAA'                                             
*&&UK*&& DC    CL14'AAXEAAGAAAAAAA'                                             
         DCDD  AC#APRVD,ADODESCL                                                
*                                                                               
         DC    AL1(ACQOPT3-ACQD,ACQDTPRE)    Est Prepar date                    
         DC    CL8'V'                                                           
         DC    CL14'PPEPPPPPPPPPPP'                                             
         DCDD  AC#PREPD,ADODESCL                                                
*                                                                               
         DC    AL1(ACQOPT3-ACQD,ACQDTHIR)    Hired      date                    
         DC    CL8'1'                                                           
         DC    CL14'HHELHHIHHHHHHH'                                             
         DCDD  AC#HREDT,ADODESCL                                                
*                                                                               
         DC    AL1(ACQOPT3-ACQD,ACQDTTRM)    Terminated date                    
         DC    CL8'1'                                                           
         DC    CL14'TTAFTTBTTTTTTT'                                             
         DCDD  AC#TRMDT,ADODESCL                                                
*                                                                               
         DC    AL1(ACQOPT3-ACQD,ACQDTSAP)    Timesheet Approved Date            
         DC    CL8'1'                                                           
         DC    CL14'FFFFFFFFFFFFFF'                                             
         DCDD  AC#APRVD,ADODESCL                                                
*                                                                               
         DC    AL1(ACQOPT3-ACQD,ACQDTSSD)    Timesheet Submitted Date           
         DC    CL8'1'                                                           
         DC    CL14'SSSSSSSSSSSSSS'                                             
         DCDD  AC#SUBMT,ADODESCL                                                
*                                                                               
*&&US                                                                           
         DC    AL1(ACQOPT3-ACQD,ACQDTTRM)    Terminated date                    
         DC    CL8'V'                                                           
         DC    CL14'EEEEEEEEEEEEEE'                                             
         DCDD  AC#TRMDT,ADODESCL                                                
*&&                                                                             
         DC    AL1(ACQOPT3-ACQD,ACQDTSTM)    Statement  date                    
         DC    CL8'B'                                                           
         DC    CL14'SSARSSASSSSSSS'                                             
         DCDD  AC#STMDT,ADODESCL                                                
*&&US                                                                           
         DC    AL1(ACQOPT3-ACQD,ACQDTXMT)    Transmit   DATE                    
         DC    CL8'RV'                                                          
         DC    CL14'XXXXXXXXXXXXXX'                                             
         DCDD  AC#RSBXD,ADODESCL                                                
*&&                                                                             
         DC    AL1(ACQOPT3-ACQD,ACQDTPOA)    PO approval date (prod)            
         DC    CL8'V'                                                           
         DC    CL14'LLLLLLLLLLLLLL'                                             
*&&US*&& DCDD  AC#RSBXD,ADODESCL                                                
*&&UK*&& DCDD  AC#APRVD,ADODESCL                                                
*&&UK                                                                           
         DC    AL1(ACQOPT3-ACQD,X'01')       Early payment date                 
         DC    CL8'P'                        THIS IS NOT IN ACQDTTYP            
         DC    CL14'EEEEEEEEEEEEEE'                                             
         DC    CL(ADODESCL)'Early payment'                                      
*                                                                               
         DC    AL1(ACQOPT3-ACQD,ACQDTEST)    ESTIMATE   DATE                    
         DC    CL8'V'                                                           
*        DC    CL14'EEEKDEEBEEEEEE'                                             
         DC    CL14'EEAKDEEBEEEEEE'                                             
         DCDD  AC#ESTDT,ADODESCL                                                
*&&                                                                             
         DC    AL1(EOT)                                                         
