*          DATA SET ACSCRF8D   AT LEVEL 007 AS OF 03/03/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60CF8D      DATE 03/03/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      4    2    6  L  P H             T        Y              
REQRUNH  DS    CL8                                                              
REQRUN   DS    CL8      4   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      4   20    6  L  P N             T        Y              
REQOTYPH DS    CL8                                                              
REQOTYP  DS    CL8      4   27    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     4   37   11  L  P N             T        Y              
REQDESH  DS    CL8                                                              
REQDES   DS    CL8      4   49    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     4   63   11  L  P N             T        Y              
REQOPT2H DS    CL8                                                              
REQOPT2  DS    CL1      4   75    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     5    2   16  L  P H             T        Y              
REQPERH  DS    CL8                                                              
REQPER   DS    CL16     5   20   16  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     7    2   16  L  P H             T        Y              
REQFMTH  DS    CL8                                                              
REQFMT   DS    CL8      7   20    8  A  U N             T        Y              
REQFMTNH DS    CL8                                                              
REQFMTN  DS    CL36     7   37   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL16     8    2   16  L  P N             T        Y              
REQUNLH  DS    CL8                                                              
REQUNL   DS    CL2      8   20    2  A  U N             T        Y              
REQUNLNH DS    CL8                                                              
REQUNLN  DS    CL36     8   37   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL16     9    2   16  L  P N             T        Y              
REQACCH  DS    CL8                                                              
REQACC   DS    CL12     9   20   12  A  U N             T        Y              
REQACCNH DS    CL8                                                              
REQACCN  DS    CL36     9   37   36  A  P H             T        Y              
REQCONTH DS    CL8                                                              
REQCONT  DS    CL16    10    2   16  L  P N             T        Y              
REQCONH  DS    CL8                                                              
REQCON   DS    CL12    10   20   12  A  U N             T        Y              
REQCONNH DS    CL8                                                              
REQCONN  DS    CL36    10   37   36  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL16    11    2   16  L  P N             T        Y              
REQTYPH  DS    CL8                                                              
REQTYP   DS    CL3     11   20    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   37    3  A  P N             T        Y              
REQFL1H  DS    CL8                                                              
REQFL1   DS    CL2     11   41    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     11   45    3  A  P N             T        Y              
REQFL2H  DS    CL8                                                              
REQFL2   DS    CL2     11   49    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     11   53    3  A  P N             T        Y              
REQFL3H  DS    CL8                                                              
REQFL3   DS    CL2     11   57    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     11   61    3  A  P N             T        Y              
REQFL4H  DS    CL8                                                              
REQFL4   DS    CL2     11   65    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     11   69    3  A  P N             T        Y              
REQFL5H  DS    CL8                                                              
REQFL5   DS    CL2     11   73    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL16    12    2   16  L  P N             T        Y              
REQSTRH  DS    CL8                                                              
REQSTR   DS    CL9     12   20    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    13    2   16  L  P N             T        Y              
REQENDH  DS    CL8                                                              
REQEND   DS    CL9     13   20    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    14    2   16  L  P N             T        Y              
REQMOAH  DS    CL8                                                              
REQMOA   DS    CL13    14   20   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    15    2   16  L  P N             T        Y              
REQACSTH DS    CL8                                                              
REQACST  DS    CL9     15   20    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     15   37    7  L  P N             T        Y              
REQACNDH DS    CL8                                                              
REQACND  DS    CL9     15   45    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16    16    2   16  L  P N             T        Y              
REQALSTH DS    CL8                                                              
REQALST  DS    CL9     16   20    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7     16   37    7  L  P N             T        Y              
REQALNDH DS    CL8                                                              
REQALND  DS    CL9     16   45    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6     16   57    6  L  P N             T        Y              
REQALTH  DS    CL8                                                              
REQALT   DS    CL1     16   64    1  A  U N             T        Y              
REQALTNH DS    CL8                                                              
REQALTN  DS    CL14    16   66   14  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    18    2   16  L  P N             T        Y              
REQOFFH  DS    CL8                                                              
REQOFF   DS    CL2     18   20    2  A  U N             T        Y              
REQOTXTH DS    CL8                                                              
REQOTXT  DS    CL16    18   37   16  L  P N             T        Y              
REQANOFH DS    CL8                                                              
REQANOF  DS    CL2     18   57    2  A  U N             T        Y              
REQTXT1H DS    CL8                                                              
REQTXT1  DS    CL16    19    2   16  L  P N             T        Y              
REQLFD1H DS    CL8                                                              
REQLFD1  DS    CL14    19   20   14  A  U N             T        Y              
REQLNM1H DS    CL8                                                              
REQLNM1  DS    CL36    19   37   36  A  P H             T        Y              
REQTXT2H DS    CL8                                                              
REQTXT2  DS    CL16    20    2   16  L  P N             T        Y              
REQLFD2H DS    CL8                                                              
REQLFD2  DS    CL14    20   20   14  A  U N             T        Y              
REQLNM2H DS    CL8                                                              
REQLNM2  DS    CL36    20   37   36  A  P H             T        Y              
REQTXT3H DS    CL8                                                              
REQTXT3  DS    CL16    21    2   16  L  P N             T        Y              
REQLFD3H DS    CL8                                                              
REQLFD3  DS    CL14    21   20   14  A  U N             T        Y              
REQLNM3H DS    CL8                                                              
REQLNM3  DS    CL36    21   37   36  A  P H             T        Y              
REQTXT4H DS    CL8                                                              
REQTXT4  DS    CL16    22    2   16  L  P N             T        Y              
REQLFD4H DS    CL8                                                              
REQLFD4  DS    CL14    22   20   14  A  U N             T        Y              
REQLNM4H DS    CL8                                                              
REQLNM4  DS    CL36    22   37   36  A  P H             T        Y              
REQTXT5H DS    CL8                                                              
REQTXT5  DS    CL16    23    2   16  L  P N             T        Y              
REQLFD5H DS    CL8                                                              
REQLFD5  DS    CL14    23   20   14  A  U N             T        Y              
REQLNM5H DS    CL8                                                              
REQLNM5  DS    CL36    23   37   36  A  P H             T        Y              
REQTABH  DS    CL8                                                              
REQTAB   DS    CL1     23   79    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  L  P H             T        Y  254         
         DS    CL8                                                              
REQLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
REQWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1592 BYTES                            
