*          DATA SET ACSCRF9D   AT LEVEL 003 AS OF 07/31/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60CF9D      DATE 07/31/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      4    2    6  L  P N             T        Y              
LSTCODEH DS    CL8                                                              
LSTCODE  DS    CL9      4   10    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      4   37    6  L  P N             T        Y              
LSTOWNH  DS    CL8                                                              
LSTOWN   DS    CL8      4   48    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL3      6    2    3  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      6    7    4  A  P H             T        Y              
LSTCDEH  DS    CL8                                                              
LSTCDE   DS    CL9      6   13    9  A  P H             T        Y              
LSTNMEH  DS    CL8                                                              
LSTNME   DS    CL15     6   23   15  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL9      6   61    9  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL9      6   71    9  A  P H             T        Y              
LSTSEL1H DS    CL8                                                              
LSTSEL1  DS    CL3      7    2    3  A  U H             T        Y              
LSTLN1H  DS    CL8                                                              
LSTLN1   DS    CL74     7    6   74  A  P N             T        Y              
LSTSEL2H DS    CL8                                                              
LSTSEL2  DS    CL3      8    2    3  A  U H             T        Y              
LSTLN2H  DS    CL8                                                              
LSTLN2   DS    CL74     8    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74     9    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    10    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    11    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    12    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
LSTTABH  DS    CL8                                                              
LSTTAB   DS    CL1     22    9    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  L  P H             T        Y  253         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    24    2   78  L  P H             T        Y  254         
         DS    CL8                                                              
LSTLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1760 BYTES                            
