*          DATA SET ACSCRE3D   AT LEVEL 002 AS OF 08/10/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60CE3D      DATE 08/10/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      4    2    6  L  P H             T        Y              
CSHCODEH DS    CL8                                                              
CSHCODE  DS    CL8      4   10    8  A  U N             T        Y              
CSHNMH   DS    CL8                                                              
CSHNM    DS    CL4      4   20    4  L  P N             T        Y              
CSHNMEH  DS    CL8                                                              
CSHNME   DS    CL36     4   25   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      4   63    6  L  P N             T        Y              
CSHOWNH  DS    CL8                                                              
CSHOWN   DS    CL8      4   70    8  A  P H             T        Y              
CSHBGNH  DS    CL8                                                              
CSHBGN   DS    CL32     6    2   32  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL3      7    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32     7    6   32  L  P N             T        Y              
CSHTYPEH DS    CL8                                                              
CSHTYPE  DS    CL15     7   39   15  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
CSHCA02H DS    CL8                                                              
CSHCA02  DS    CL32     8    6   32  L  P N             T        Y              
CSHACCTH DS    CL8                                                              
CSHACCT  DS    CL40     8   39   40  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  P N             T        Y              
CSHCA03H DS    CL8                                                              
CSHCA03  DS    CL32     9    6   32  L  P N             T        Y              
CSHCNTRH DS    CL8                                                              
CSHCNTR  DS    CL40     9   39   40  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    10    6   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10   39    3  A  P N             T        Y              
CSHF1H   DS    CL8                                                              
CSHF1    DS    CL2     10   43    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     10   47    3  A  P N             T        Y              
CSHF2H   DS    CL8                                                              
CSHF2    DS    CL2     10   51    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     10   55    3  A  P N             T        Y              
CSHF3H   DS    CL8                                                              
CSHF3    DS    CL2     10   59    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     10   63    3  A  P N             T        Y              
CSHF4H   DS    CL8                                                              
CSHF4    DS    CL2     10   67    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     10   71    3  A  P N             T        Y              
CSHF5H   DS    CL8                                                              
CSHF5    DS    CL2     10   75    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    11    6   32  L  P N             T        Y              
CSHOFFH  DS    CL8                                                              
CSHOFF   DS    CL40    11   39   40  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    12    6   32  L  P N             T        Y              
CSHITTYH DS    CL8                                                              
CSHITTY  DS    CL40    12   39   40  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  P N             T        Y              
CSHCA07H DS    CL8                                                              
CSHCA07  DS    CL32    15    6   32  L  P N             T        Y              
CSHBRIH  DS    CL8                                                              
CSHBRI   DS    CL1     15   39    1  A  U H             T        Y              
CSHTABH  DS    CL8                                                              
CSHTAB   DS    CL1     16    2    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  L  P H             T        Y  254         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL77    24    3   77  L  P H             T        Y  254         
         DS    CL8                                                              
CSHLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
CSHWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1048 BYTES                            
