*          DATA SET ACSCRE5D   AT LEVEL 019 AS OF 08/10/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60CE5D      DATE 08/10/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      4    2    6  L  P H             T        Y              
COMCODEH DS    CL8                                                              
COMCODE  DS    CL1      4   10    1  A  U N             T        Y              
COMNMH   DS    CL8                                                              
COMNM    DS    CL4      4   20    4  L  P N             T        Y              
COMNMEH  DS    CL8                                                              
COMNME   DS    CL36     4   25   36  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      4   63    6  L  P N             T        Y              
COMOWNH  DS    CL8                                                              
COMOWN   DS    CL8      4   70    8  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL15     6    2   15  L  P H             T        Y              
COMLDTEH DS    CL8                                                              
COMLDTE  DS    CL9      6   24    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15     6   35   15  L  P H             T        Y              
COMRDTEH DS    CL8                                                              
COMRDTE  DS    CL9      6   59    9  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     7    2   10  L  P H             T        Y              
COMLDGRH DS    CL8                                                              
COMLDGR  DS    CL20     7   13   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15     7   35   15  L  P H             T        Y              
COMSLDGH DS    CL8                                                              
COMSLDG  DS    CL2      7   53    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     8    2   10  L  P H             T        Y              
COMOPT1H DS    CL8                                                              
COMOPT1  DS    CL20     8   13   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15     8   35   15  L  P H             T        Y              
COMQ1RDH DS    CL8                                                              
COMQ1RD  DS    CL14     8   53   14  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     9    2   10  L  P H             T        Y              
COMOPT3H DS    CL8                                                              
COMOPT3  DS    CL20     9   13   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15     9   35   15  L  P H             T        Y              
COMQ3RDH DS    CL8                                                              
COMQ3RD  DS    CL14     9   53   14  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    10    2   10  L  P H             T        Y              
COMOPT4H DS    CL8                                                              
COMOPT4  DS    CL20    10   13   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    10   35   15  L  P H             T        Y              
COMQ4RDH DS    CL8                                                              
COMQ4RD  DS    CL14    10   53   14  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    11    2   10  L  P H             T        Y              
COMSECLH DS    CL8                                                              
COMSECL  DS    CL2     11   13    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    11   35   15  L  P H             T        Y              
COMSELDH DS    CL8                                                              
COMSELD  DS    CL25    11   53   25  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL10    12    2   10  L  P H             T        Y              
COMBUD1H DS    CL8                                                              
COMBUD1  DS    CL66    12   13   66  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL15    14    2   15  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL80    15    1   80  A  P H             T        Y              
COMLINEH DS    CL8                                                              
COMLINE  DS    CL1     16    1    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL75    16    3   75  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   79    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     17    1    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL75    17    3   75  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   79    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     18    1    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL75    18    3   75  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   79    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     19    1    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL75    19    3   75  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   79    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     20    1    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL75    20    3   75  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   79    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     21    1    1  A  P H             T        Y              
COMTABH  DS    CL8                                                              
COMTAB   DS    CL75    21    3   75  L  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   79    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL79    22    1   79  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  L  P H             T        Y  254         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL77    24    3   77  L  P H             T        Y  254         
         DS    CL8                                                              
COMLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
COMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1712 BYTES                            
