*          DATA SET ACSCRE4D   AT LEVEL 003 AS OF 12/06/11                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T60CE4D      DATE 12/06/11                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  L  P H             T        Y              
GNLCODEH DS    XL8                                                              
GNLCODE  DS    CL8      4   10    8  A  U N             T        Y              
GNLNMH   DS    XL8                                                              
GNLNM    DS    CL4      4   20    4  L  P N             T        Y              
GNLNMEH  DS    XL8                                                              
GNLNME   DS    CL36     4   25   36  L  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      4   63    6  L  P N             T        Y              
GNLOWNH  DS    XL8                                                              
GNLOWN   DS    CL8      4   70    8  A  P H             T        Y              
GNLBGNH  DS    XL8                                                              
GNLBGN   DS    CL32     6    2   32  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL3      7    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32     7    6   32  L  P N             T        Y              
GNLTYPEH DS    XL8                                                              
GNLTYPE  DS    CL15     7   39   15  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
GNLGL02H DS    XL8                                                              
GNLGL02  DS    CL32     8    6   32  L  P N             T        Y              
GNLACCTH DS    XL8                                                              
GNLACCT  DS    CL40     8   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  P N             T        Y              
GNLGL03H DS    XL8                                                              
GNLGL03  DS    CL32     9    6   32  L  P N             T        Y              
GNLCNTRH DS    XL8                                                              
GNLCNTR  DS    CL40     9   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    10    6   32  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   39    3  A  P N             T        Y              
GNLF1H   DS    XL8                                                              
GNLF1    DS    CL2     10   43    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     10   47    3  A  P N             T        Y              
GNLF2H   DS    XL8                                                              
GNLF2    DS    CL2     10   51    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     10   55    3  A  P N             T        Y              
GNLF3H   DS    XL8                                                              
GNLF3    DS    CL2     10   59    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     10   63    3  A  P N             T        Y              
GNLF4H   DS    XL8                                                              
GNLF4    DS    CL2     10   67    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     10   71    3  A  P N             T        Y              
GNLF5H   DS    XL8                                                              
GNLF5    DS    CL2     10   75    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    11    6   32  L  P N             T        Y              
GNLOFFH  DS    XL8                                                              
GNLOFF   DS    CL40    11   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    12    6   32  L  P N             T        Y              
GNLITTYH DS    XL8                                                              
GNLITTY  DS    CL40    12   39   40  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL32    13    6   32  L  P N             T        Y              
GNLRETH  DS    XL8                                                              
GNLRET   DS    CL1     13   39    1  A  U H             T        Y              
GNLTABH  DS    XL8                                                              
GNLTAB   DS    CL1     14    2    1  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL78    23    2   78  L  P H             T        Y  254         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL77    24    3   77  L  P H             T        Y  254         
         DS    XL8                                                              
GNLLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
GNLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1048 BYTES                            
