*          DATA SET ACTOBACCOD AT LEVEL 004 AS OF 06/13/00                      
***********************************************************************         
* PARAMETER LIST FOR TOBACCO CALLS AND EQUATED VALUES                 *         
***********************************************************************         
                                                                                
TOBACCOD DSECT                                                                  
TOBAACTN DS    0XL1                ACTION CODE:-                                
TOBAAOUT EQU   1                   CONVERT INTO OUTPUT CURRENCY                 
TOBAACNV EQU   2                   CONVERT                                      
TOBAACVB EQU   3                   CONVERT INTO BASE CURRENCY                   
TOBAACVS EQU   4                   CONVERT INTO SECONDARY CURRENCY              
TOBAADEL EQU   5                   DELETE AN ELEMENT                            
TOBAAADD EQU   6                   ADD AN ELEMENT                               
TOBAAREV EQU   7                   REVERSE CASH VALUES ON A RECORD              
TOBAALST EQU   8                   RETURN PL8 LIST OF OCAEL VALUES              
TOBAACUR DS    A                   A(RECORD CURRENCY/OUTPUT CURRENCY)           
TOBAINDS DS    0XL1                RECORD INDICATOR BYTE:-                      
TOBAIOLD EQU   X'80'               OLD-STYLE RECORD PASSED                      
TOBAIMAX EQU   X'04'               OCA ELEMENT TOO BIG                          
TOBAIBIG EQU   X'02'               RECORD TOO BIG                               
TOBAIINV EQU   X'01'               INVALID PACKED NUMBER FIELD FOUND            
TOBAAREC DS    A                   A(INPUT RECORD)                              
TOBAACOM DS    A                   A(COMFACS)                                   
TOBAAOCA DS    A                   A(LIST OF OCA VALUES)                        
TOBAAELE DS    A                   A(ELEMENT FOR ADD/DELETE)                    
TOBALIST DS    A                   A(LIST OF DELETED OCA VALUES)                
                                                                                
***********************************************************************         
* EQUATED VALUES FOR DATA TYPES (THESE ARE THE OCANTYPE VALUES)       *         
***********************************************************************         
                                                                                
QTRNAMNT  EQU   1                                                               
QTRNCOMM  EQU   2                                                               
QTRNGRSXR EQU   3                                                               
QTRNGRSZR EQU   4                                                               
QTRNGRSR1 EQU   5                                                               
QTRNGRSR2 EQU   6                                                               
QTRNGRSR3 EQU   7                                                               
QTRNGRSR4 EQU   8                                                               
QTRNGRSR5 EQU   9                                                               
QTRNVATR1 EQU   10                                                              
QTRNVATR2 EQU   11                                                              
QTRNVATR3 EQU   12                                                              
QTRNVATR4 EQU   13                                                              
QTRNVATR5 EQU   14                                                              
*                                                                               
QBUKDR    EQU   15                                                              
QBUKCR    EQU   16                                                              
QPBKDR    EQU   17                                                              
QPBKCR    EQU   18                                                              
*                                                                               
QPTANET   EQU   19                                                              
QPTAWUAMT EQU   20                                                              
QPTACDSC  EQU   21                                                              
QPTARCOM  EQU   22                                                              
*                                                                               
QBUDBUDG  EQU   23                                                              
*                                                                               
QESTORIG  EQU   24                                                              
QESTCURR  EQU   25                                                              
QESTPRV   EQU   26                                                              
*                                                                               
QBAMBUDG  EQU   27                                                              
*                                                                               
QABLFRWD  EQU   28                                                              
QABLDR    EQU   29                                                              
QABLCR    EQU   30                                                              
*                                                                               
QWPBSOFA  EQU   31                                                              
QWPBTODA  EQU   32                                                              
QWPBGRSS  EQU   33                                                              
QWPBGRST  EQU   34                                                              
*                                                                               
QXPRLOW   EQU   35                                                              
*                                                                               
QPRTRATE  EQU   36                                                              
*                                                                               
QMSALARY  EQU   37                                                              
*                                                                               
QTCIAMT   EQU   38                                                              
*                                                                               
QGXBIINC  EQU   39                                                              
QGXBIGRS  EQU   40                                                              
QGXBEINC  EQU   41                                                              
QGXBEGRS  EQU   42                                                              
*                                                                               
QOAMAMNT  EQU   43                                                              
QOAMIVAL  EQU   44                                                              
*                                                                               
QADSCP    EQU   45                                                              
QADSBATV  EQU   46                                                              
QADSTATV  EQU   47                                                              
*                                                                               
QADIAMNT  EQU   48                                                              
*                                                                               
QPGHNET   EQU   49                                                              
QPGHCOM   EQU   50                                                              
QPGHOALLC EQU   51                                                              
*                                                                               
QTIMRATE  EQU   52                                                              
QTIMCRATE EQU   53                                                              
QTIMAMNT  EQU   54                                                              
*                                                                               
QTRPAMNT  EQU   55                                                              
*                                                                               
QOPNOVAMT EQU   56                                                              
QOPNMIN   EQU   57                                                              
*                                                                               
QEDACOMM  EQU   58                                                              
QEDANCOM  EQU   59                                                              
QEDAPAMT  EQU   60                                                              
*                                                                               
QMXPGRSS  EQU   61                                                              
QMXPNETP  EQU   62                                                              
QMXPVATP  EQU   63                                                              
QMXPSLSH  EQU   64                                                              
*                                                                               
QBUDORIG  EQU   65                                                              
*                                                                               
QMPYAMNT  EQU   66                                                              
QMPYPART  EQU   67                                                              
*                                                                               
QPDEAMT   EQU   68                                                              
QPDEADJ   EQU   69                                                              
*                                                                               
QSCITNULL EQU   80                                                              
QSCITFEEA EQU   81                                                              
QSCITKSVB EQU   82                                                              
QSCITCOMM EQU   83                                                              
QSCITCRAT EQU   84                                                              
QSCITCDSC EQU   85                                                              
QSCITDEPR EQU   86                                                              
QSCITFEES EQU   87                                                              
QSCITGRSS EQU   88                                                              
QSCITINCA EQU   89                                                              
QSCITFTAX EQU   90                                                              
QSCITCLIM EQU   91                                                              
QSCITGINV EQU   92                                                              
QSCITGLEV EQU   93                                                              
QSCITFORD EQU   94                                                              
QSCITPORD EQU   95                                                              
QSCITMEXP EQU   97                                                              
QSCITFAMT EQU   98                                                              
QSCITPRAT EQU   99                                                              
QSCITSJXP EQU   100                                                             
QSCITSRAT EQU   101                                                             
QSCITTTAX EQU   106                                                             
QSCITCHQT EQU   QSCITTTAX                                                       
QSCITKSVU EQU   107                                                             
QSCITPREP EQU   108                                                             
QSCITFVAT EQU   109                                                             
QSCITIVAT EQU   110                                                             
QSCITNOCD EQU   QSCITIVAT                                                       
QSCITASBF EQU   111                                                             
QSCITCTOT EQU   QSCITASBF                                                       
QSCITRECN EQU   112                                                             
QSCITANAL EQU   113                                                             
QSCITITAX EQU   114                                                             
QSCITINVT EQU   115                                                             
QSCITMTAX EQU   116                                                             
QSCITCBAP EQU   117                                                             
QSCITCBWP EQU   118                                                             
QSCITCBTP EQU   119                                                             
QSCITICLM EQU   120                                                             
QSCITCBRP EQU   121                                                             
QSCITSTAX EQU   122                                                             
QSCITCBSG EQU   123                                                             
QSCITCBDC EQU   124                                                             
QSCITT99S EQU   125                                                             
QSCITBCHA EQU   126                                                             
QSCITDMAX EQU   127                                                             
QSCITCMAX EQU   128                                                             
QSCIOFFST EQU   QSCI2AVTA-QSCITAVTA OFFSET AT PRESENT = 64                      
QSCITAVTA EQU   129                LOWER CASE VAT TYPE                          
QSCITAVTB EQU   130                                                             
QSCITAVTC EQU   131                                                             
QSCITAVTD EQU   132                                                             
QSCITAVTE EQU   133                                                             
QSCITAVTF EQU   134                                                             
QSCITAVTG EQU   135                                                             
QSCITAVTH EQU   136                                                             
QSCITAVTI EQU   137                                                             
QSCI2ANAL EQU   138                                                             
QSCITAVTJ EQU   145                                                             
QSCITAVTK EQU   146                                                             
QSCITAVTL EQU   147                                                             
QSCITAVTM EQU   148                                                             
QSCITAVTN EQU   149                                                             
QSCITAVTO EQU   150                                                             
QSCITAVTP EQU   151                                                             
QSCITAVTQ EQU   152                                                             
QSCITAVTR EQU   153                                                             
QSCITAVTS EQU   162                                                             
QSCITAVTT EQU   163                                                             
QSCITAVTU EQU   164                                                             
QSCITAVTV EQU   165                                                             
QSCITAVTW EQU   166                                                             
QSCITAVTX EQU   167                                                             
QSCITAVTY EQU   168                                                             
QSCITAVTZ EQU   169                                                             
QSCITAVT0 EQU   176                                                             
QSCITAVT1 EQU   177                                                             
QSCITAVT2 EQU   178                                                             
QSCITAVT3 EQU   179                                                             
QSCITAVT4 EQU   180                                                             
QSCITAVT5 EQU   181                                                             
QSCITAVT6 EQU   182                                                             
QSCITAVT7 EQU   183                                                             
QSCITAVT8 EQU   184                                                             
QSCITAVT9 EQU   185                                                             
QSCI2AVTA EQU   193                UPPER CASE VAT TYPE                          
QSCI2AVTB EQU   194                                                             
QSCI2AVTC EQU   195                                                             
QSCI2AVTD EQU   196                                                             
QSCI2AVTE EQU   197                                                             
QSCI2AVTF EQU   198                                                             
QSCI2AVTG EQU   199                                                             
QSCI2AVTH EQU   200                                                             
QSCI2AVTI EQU   201                                                             
QSCI2AVTJ EQU   209                                                             
QSCI2AVTK EQU   210                                                             
QSCI2AVTL EQU   211                                                             
QSCI2AVTM EQU   212                                                             
QSCI2AVTN EQU   213                                                             
QSCI2AVTO EQU   214                                                             
QSCI2AVTP EQU   215                                                             
QSCI2AVTQ EQU   216                                                             
QSCI2AVTR EQU   217                                                             
QSCI2AVTS EQU   226                                                             
QSCI2AVTT EQU   227                                                             
QSCI2AVTU EQU   228                                                             
QSCI2AVTV EQU   229                                                             
QSCI2AVTW EQU   230                                                             
QSCI2AVTX EQU   231                                                             
QSCI2AVTY EQU   232                                                             
QSCI2AVTZ EQU   233                                                             
                                                                                
QAFCAMNT  EQU   234                                                             
QUNPRICE  EQU   235                                                             
QPTARFCOM EQU   236                                                             
QBNDAMTP  EQU   237                                                             
QSCI2DEPR EQU   238                                                             
                                                                                
QSCI2AVT0 EQU   240                UPPER CASE VAT TYPES                         
QSCI2AVT1 EQU   241                                                             
QSCI2AVT2 EQU   242                                                             
QSCI2AVT3 EQU   243                                                             
QSCI2AVT4 EQU   244                                                             
QSCI2AVT5 EQU   245                                                             
QSCI2AVT6 EQU   246                                                             
QSCI2AVT7 EQU   247                                                             
QSCI2AVT8 EQU   248                                                             
QSCI2AVT9 EQU   249                                                             
