*          DATA SET ACTRADBD   AT LEVEL 005 AS OF 11/29/18                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T622DBD      DATE 11/29/18                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
MPRSYSH  DS    XL8                                                              
MPRSYS   DS    CL3      5   10    3  A  U N             T        Y  120         
MPRSYSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   15    5  A  P N             T        Y              
MPRMEDH  DS    XL8                                                              
MPRMED   DS    CL1      5   22    1  A  U N             T        Y  130         
MPRMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   25    7  A  P N             T        Y              
MPROFFH  DS    XL8                                                              
MPROFF   DS    CL3      5   33    3  A  U N             T        Y  140         
MPROFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
MPRCLTH  DS    XL8                                                              
MPRCLT   DS    CL3      5   47    3  A  U N             T        Y  150         
MPRCLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   52    7  A  P N             T        Y              
MPRPRDH  DS    XL8                                                              
MPRPRD   DS    CL3      5   61    3  A  U N             T        Y  160         
MPRPRDX  DS    XL8                                                              
MPRCODH  DS    XL8                                                              
MPRCOD   DS    CL15     5   65   15  A  P N             T        Y              
MPRMSGH  DS    XL8                                                              
MPRMSG   DS    CL40     6    4   40  A  P N             T        Y              
MPRSDISH DS    XL8                                                              
MPRSDIS  DS    CL7      7    4    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      7   30    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL18     7   52   18  A  P N             T        Y              
MPRL1DH  DS    XL8                                                              
MPRL1D   DS    CL26     8    2   26  A  P N             T        Y              
MPRL1H   DS    XL8                                                              
MPRL1    DS    CL20     8   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     8   57   13  A  P N             T        Y              
MPRL2DH  DS    XL8                                                              
MPRL2D   DS    CL26     9    2   26  A  P N             T        Y              
MPRL2H   DS    XL8                                                              
MPRL2    DS    CL20     9   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      9   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     9   57   13  A  P N             T        Y              
MPRL3DH  DS    XL8                                                              
MPRL3D   DS    CL26    10    2   26  A  P N             T        Y              
MPRL3H   DS    XL8                                                              
MPRL3    DS    CL20    10   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    10   57   13  A  P N             T        Y              
MPRL4DH  DS    XL8                                                              
MPRL4D   DS    CL26    11    2   26  A  P N             T        Y              
MPRL4H   DS    XL8                                                              
MPRL4    DS    CL20    11   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    11   57   13  A  P N             T        Y              
MPRL5DH  DS    XL8                                                              
MPRL5D   DS    CL26    12    2   26  A  P N             T        Y              
MPRL5H   DS    XL8                                                              
MPRL5    DS    CL20    12   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    12   57   13  A  P N             T        Y              
MPRL6DH  DS    XL8                                                              
MPRL6D   DS    CL26    13    2   26  A  P N             T        Y              
MPRL6H   DS    XL8                                                              
MPRL6    DS    CL20    13   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    13   57   13  A  P N             T        Y              
MPRL7DH  DS    XL8                                                              
MPRL7D   DS    CL26    14    2   26  A  P N             T        Y              
MPRL7H   DS    XL8                                                              
MPRL7    DS    CL20    14   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    14   57   13  A  P N             T        Y              
MPRL8DH  DS    XL8                                                              
MPRL8D   DS    CL26    15    2   26  A  P N             T        Y              
MPRL8H   DS    XL8                                                              
MPRL8    DS    CL20    15   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    15   57   13  A  P N             T        Y              
MPRL9DH  DS    XL8                                                              
MPRL9D   DS    CL26    16    2   26  A  P N             T        Y              
MPRL9H   DS    XL8                                                              
MPRL9    DS    CL20    16   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    16   57   13  A  P N             T        Y              
MPRL10DH DS    XL8                                                              
MPRL10D  DS    CL26    17    2   26  A  P N             T        Y              
MPRL10H  DS    XL8                                                              
MPRL10   DS    CL20    17   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    17   57   13  A  P N             T        Y              
MPRL11DH DS    XL8                                                              
MPRL11D  DS    CL26    18    2   26  A  P N             T        Y              
MPRL11H  DS    XL8                                                              
MPRL11   DS    CL20    18   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    18   57   13  A  P N             T        Y              
MPRL12DH DS    XL8                                                              
MPRL12D  DS    CL26    19    2   26  A  P N             T        Y              
MPRL12H  DS    XL8                                                              
MPRL12   DS    CL20    19   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    19   57   13  A  P N             T        Y              
MPRL13DH DS    XL8                                                              
MPRL13D  DS    CL26    20    2   26  A  P N             T        Y              
MPRL13H  DS    XL8                                                              
MPRL13   DS    CL20    20   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    20   57   13  A  P N             T        Y              
MPRL14DH DS    XL8                                                              
MPRL14D  DS    CL26    21    2   26  A  P N             T        Y              
MPRL14H  DS    XL8                                                              
MPRL14   DS    CL20    21   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    21   57   13  A  P N             T        Y              
MPRL15DH DS    XL8                                                              
MPRL15D  DS    CL26    22    2   26  A  P N             T        Y              
MPRL15H  DS    XL8                                                              
MPRL15   DS    CL20    22   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    22   57   13  A  P N             T        Y              
MPRL16DH DS    XL8                                                              
MPRL16D  DS    CL26    23    2   26  A  P N             T        Y              
MPRL16H  DS    XL8                                                              
MPRL16   DS    CL20    23   30   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    23   57   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  254         
         DS    XL8                                                              
MPRLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
MPRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1896 BYTES                            
