*          DATA SET ACTRACDD   AT LEVEL 002 AS OF 11/29/18                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T622CDD      DATE 11/29/18                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
XPRSYSH  DS    XL8                                                              
XPRSYS   DS    CL3      5   10    3  A  U N             T        Y  120         
XPRSYSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   15    5  A  P N             T        Y              
XPRMEDH  DS    XL8                                                              
XPRMED   DS    CL1      5   22    1  A  U N             T        Y  130         
XPRMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   25    7  A  P N             T        Y              
XPROFFH  DS    XL8                                                              
XPROFF   DS    CL3      5   33    3  A  U N             T        Y  140         
XPROFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
XPRCLTH  DS    XL8                                                              
XPRCLT   DS    CL3      5   47    3  A  U N             T        Y  150         
XPRCLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   52    7  A  P N             T        Y              
XPRPRDH  DS    XL8                                                              
XPRPRD   DS    CL3      5   61    3  A  U N             T        Y  160         
XPRPRDX  DS    XL8                                                              
XPRCODH  DS    XL8                                                              
XPRCOD   DS    CL15     5   65   15  A  P N             T        Y              
XPRMSGH  DS    XL8                                                              
XPRMSG   DS    CL40     6    4   40  A  P N             T        Y              
XPRSDISH DS    XL8                                                              
XPRSDIS  DS    CL7      7    4    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      7   30    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL18     7   52   18  A  P N             T        Y              
XPRL1DH  DS    XL8                                                              
XPRL1D   DS    CL26     8    2   26  A  P N             T        Y              
XPRL1H   DS    XL8                                                              
XPRL1    DS    CL20     8   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     8   57   13  A  P N             T        Y              
XPRL2DH  DS    XL8                                                              
XPRL2D   DS    CL26     9    2   26  A  P N             T        Y              
XPRL2H   DS    XL8                                                              
XPRL2    DS    CL20     9   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      9   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     9   57   13  A  P N             T        Y              
XPRL3DH  DS    XL8                                                              
XPRL3D   DS    CL26    10    2   26  A  P N             T        Y              
XPRL3H   DS    XL8                                                              
XPRL3    DS    CL20    10   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    10   57   13  A  P N             T        Y              
XPRL4DH  DS    XL8                                                              
XPRL4D   DS    CL26    11    2   26  A  P N             T        Y              
XPRL4H   DS    XL8                                                              
XPRL4    DS    CL20    11   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    11   57   13  A  P N             T        Y              
XPRL5DH  DS    XL8                                                              
XPRL5D   DS    CL26    12    2   26  A  P N             T        Y              
XPRL5H   DS    XL8                                                              
XPRL5    DS    CL20    12   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    12   57   13  A  P N             T        Y              
XPRL6DH  DS    XL8                                                              
XPRL6D   DS    CL26    13    2   26  A  P N             T        Y              
XPRL6H   DS    XL8                                                              
XPRL6    DS    CL20    13   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    13   57   13  A  P N             T        Y              
XPRL7DH  DS    XL8                                                              
XPRL7D   DS    CL26    14    2   26  A  P N             T        Y              
XPRL7H   DS    XL8                                                              
XPRL7    DS    CL20    14   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    14   57   13  A  P N             T        Y              
XPRL8DH  DS    XL8                                                              
XPRL8D   DS    CL26    15    2   26  A  P N             T        Y              
XPRL8H   DS    XL8                                                              
XPRL8    DS    CL20    15   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    15   57   13  A  P N             T        Y              
XPRL9DH  DS    XL8                                                              
XPRL9D   DS    CL26    16    2   26  A  P N             T        Y              
XPRL9H   DS    XL8                                                              
XPRL9    DS    CL20    16   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    16   57   13  A  P N             T        Y              
XPRL10DH DS    XL8                                                              
XPRL10D  DS    CL26    17    2   26  A  P N             T        Y              
XPRL10H  DS    XL8                                                              
XPRL10   DS    CL20    17   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    17   57   13  A  P N             T        Y              
XPRL11DH DS    XL8                                                              
XPRL11D  DS    CL26    18    2   26  A  P N             T        Y              
XPRL11H  DS    XL8                                                              
XPRL11   DS    CL20    18   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    18   57   13  A  P N             T        Y              
XPRL12DH DS    XL8                                                              
XPRL12D  DS    CL26    19    2   26  A  P N             T        Y              
XPRL12H  DS    XL8                                                              
XPRL12   DS    CL20    19   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    19   57   13  A  P N             T        Y              
XPRL13DH DS    XL8                                                              
XPRL13D  DS    CL26    20    2   26  A  P N             T        Y              
XPRL13H  DS    XL8                                                              
XPRL13   DS    CL20    20   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    20   57   13  A  P N             T        Y              
XPRL14DH DS    XL8                                                              
XPRL14D  DS    CL26    21    2   26  A  P N             T        Y              
XPRL14H  DS    XL8                                                              
XPRL14   DS    CL20    21   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    21   57   13  A  P N             T        Y              
XPRL15DH DS    XL8                                                              
XPRL15D  DS    CL26    22    2   26  A  P N             T        Y              
XPRL15H  DS    XL8                                                              
XPRL15   DS    CL20    22   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    22   57   13  A  P N             T        Y              
XPRL16DH DS    XL8                                                              
XPRL16D  DS    CL26    23    2   26  A  P N             T        Y              
XPRL16H  DS    XL8                                                              
XPRL16   DS    CL20    23   30   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    23   57   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  254         
         DS    XL8                                                              
XPRLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
XPRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1896 BYTES                            
