*          DATA SET ACTRAFCD   AT LEVEL 005 AS OF 11/29/18                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T622FCD      DATE 11/29/18                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
TRCSYSH  DS    XL8                                                              
TRCSYS   DS    CL3      5   10    3  A  U N             T        Y  120         
TRCSYSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   15    5  A  P N             T        Y              
TRCMEDH  DS    XL8                                                              
TRCMED   DS    CL1      5   22    1  A  U N             T        Y  130         
TRCMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   25    7  A  P N             T        Y              
TRCOFFH  DS    XL8                                                              
TRCOFF   DS    CL3      5   33    3  A  U N             T        Y  140         
TRCOFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
TRCCLTH  DS    XL8                                                              
TRCCLT   DS    CL3      5   47    3  A  U N             T        Y  150         
TRCCLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   52    7  A  P N             T        Y              
TRCPRDH  DS    XL8                                                              
TRCPRD   DS    CL3      5   61    3  A  U N             T        Y  160         
TRCPRDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   66    7  A  P N             T        Y              
TRCPSTH  DS    XL8                                                              
TRCPST   DS    CL3      5   75    3  A  U N             T        Y  170         
TRCPSTX  DS    XL8                                                              
TRCDESH  DS    XL8                                                              
TRCDES   DS    CL40     7    2   40  A  P N             T        Y              
TRCSTRAH DS    XL8                                                              
TRCSTRA  DS    CL39     9    2   39  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23     9   45   23  A  P N             T        Y              
TRCL1DH  DS    XL8                                                              
TRCL1D   DS    CL15    11    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    11   19   50  A  P N             T        Y              
TRCL2DH  DS    XL8                                                              
TRCL2D   DS    CL15    12    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    12   19   50  A  P N             T        Y              
TRCL3DH  DS    XL8                                                              
TRCL3D   DS    CL15    13    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    13   19   50  A  P N             T        Y              
TRCL4DH  DS    XL8                                                              
TRCL4D   DS    CL15    14    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    14   19   50  A  P N             T        Y              
TRCL5DH  DS    XL8                                                              
TRCL5D   DS    CL15    15    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    15   19   50  A  P N             T        Y              
TRCL6DH  DS    XL8                                                              
TRCL6D   DS    CL15    16    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    16   19   50  A  P N             T        Y              
TRCL7DH  DS    XL8                                                              
TRCL7D   DS    CL15    17    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    17   19   50  A  P N             T        Y              
TRCL8DH  DS    XL8                                                              
TRCL8D   DS    CL15    18    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    18   19   50  A  P N             T        Y              
TRCL9DH  DS    XL8                                                              
TRCL9D   DS    CL15    19    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    19   19   50  A  P N             T        Y              
TRCL10DH DS    XL8                                                              
TRCL10D  DS    CL15    20    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    20   19   50  A  P N             T        Y              
TRCL11DH DS    XL8                                                              
TRCL11D  DS    CL15    21    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    21   19   50  A  P N             T        Y              
TRCL12DH DS    XL8                                                              
TRCL12D  DS    CL15    22    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    22   19   50  A  P N             T        Y              
TRCL13DH DS    XL8                                                              
TRCL13D  DS    CL15    23    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    23   19   50  A  P N             T        Y              
TRCPFKH  DS    XL8                                                              
TRCPFK   DS    CL78    24    2   78  A  U N             T        Y  254         
TRCPFKX  DS    XL8                                                              
TRCLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
TRCWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1480 BYTES                            
