*          DATA SET ACTRAEBD   AT LEVEL 002 AS OF 11/29/18                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T622EBD      DATE 11/29/18                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
BDISYSH  DS    XL8                                                              
BDISYS   DS    CL3      5    9    3  A  U N             T        Y  120         
BDISYSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   14    5  A  P H             T        Y              
BDIMEDH  DS    XL8                                                              
BDIMED   DS    CL1      5   20    1  A  U N             T        Y  130         
BDIMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   23    6  A  P H             T        Y              
BDICLTH  DS    XL8                                                              
BDICLT   DS    CL3      5   30    3  A  U N             T        Y  150         
BDICLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   35    7  A  P H             T        Y              
BDIPRDH  DS    XL8                                                              
BDIPRD   DS    CL3      5   43    3  A  U N             T        Y  160         
BDIPRDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      5   51    3  A  P H             T        Y              
BDIESTH  DS    XL8                                                              
BDIEST   DS    CL3      5   56    3  A  U N             T        Y  170         
BDIESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   61    6  A  P H             T        Y              
BDIRDTH  DS    XL8                                                              
BDIRDT   DS    CL8      5   68    8  A  U N             T        Y  180         
BDIRDTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      6    2    3  A  P H             T        Y              
BDISDTH  DS    XL8                                                              
BDISDT   DS    CL8      6    8    8  A  U N             T        Y  190         
BDISDTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      6   18    7  A  P H             T        Y              
BDIINVH  DS    XL8                                                              
BDIINV   DS    CL10     6   26   10  A  U N             T        Y  200         
BDIINVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   37    6  A  P N             T        Y              
BDIIDTH  DS    XL8                                                              
BDIIDT   DS    CL8      6   44    8  A  U N             T        Y  210         
BDIIDTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     6   53   12  A  P N             T        Y              
BDITDTH  DS    XL8                                                              
BDITDT   DS    CL8      6   66    8  A  U N             T        Y  220         
BDITDTX  DS    XL8                                                              
BDIMSGH  DS    XL8                                                              
BDIMSG   DS    CL78     7    2   78  A  P H             T        Y              
BDIMSG2H DS    XL8                                                              
BDIMSG2  DS    CL78     8    2   78  A  P H             T        Y              
BDISBILH DS    XL8                                                              
BDISBIL  DS    CL14     9    1   14  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL24     9   16   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14     9   41   14  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL24     9   56   24  A  P N             T        Y              
BDIL1H   DS    XL8                                                              
BDIL1    DS    CL40    10    1   40  A  P N             T        Y              
BDIL1BH  DS    XL8                                                              
BDIL1B   DS    CL39    10   41   39  A  P N             T        Y              
BDIL2H   DS    XL8                                                              
BDIL2    DS    CL40    11    1   40  A  P N             T        Y              
BDIL2BH  DS    XL8                                                              
BDIL2B   DS    CL39    11   41   39  A  P N             T        Y              
BDIL3H   DS    XL8                                                              
BDIL3    DS    CL40    12    1   40  A  P N             T        Y              
BDIL3BH  DS    XL8                                                              
BDIL3B   DS    CL39    12   41   39  A  P N             T        Y              
BDIL4H   DS    XL8                                                              
BDIL4    DS    CL40    13    1   40  A  P N             T        Y              
BDIL4BH  DS    XL8                                                              
BDIL4B   DS    CL39    13   41   39  A  P N             T        Y              
BDIL5H   DS    XL8                                                              
BDIL5    DS    CL40    14    1   40  A  P N             T        Y              
BDIL5BH  DS    XL8                                                              
BDIL5B   DS    CL39    14   41   39  A  P N             T        Y              
BDIL6H   DS    XL8                                                              
BDIL6    DS    CL40    15    1   40  A  P N             T        Y              
BDIL6BH  DS    XL8                                                              
BDIL6B   DS    CL39    15   41   39  A  P N             T        Y              
BDIL7H   DS    XL8                                                              
BDIL7    DS    CL40    16    1   40  A  P N             T        Y              
BDIL7BH  DS    XL8                                                              
BDIL7B   DS    CL39    16   41   39  A  P N             T        Y              
BDIL8H   DS    XL8                                                              
BDIL8    DS    CL40    17    1   40  A  P N             T        Y              
BDIL8BH  DS    XL8                                                              
BDIL8B   DS    CL39    17   41   39  A  P N             T        Y              
BDIL9H   DS    XL8                                                              
BDIL9    DS    CL40    18    1   40  A  P N             T        Y              
BDIL9BH  DS    XL8                                                              
BDIL9B   DS    CL39    18   41   39  A  P N             T        Y              
BDIL10H  DS    XL8                                                              
BDIL10   DS    CL40    19    1   40  A  P N             T        Y              
BDIL10BH DS    XL8                                                              
BDIL10B  DS    CL39    19   41   39  A  P N             T        Y              
BDIL11H  DS    XL8                                                              
BDIL11   DS    CL40    20    1   40  A  P N             T        Y              
BDIL11BH DS    XL8                                                              
BDIL11B  DS    CL39    20   41   39  A  P N             T        Y              
BDIL12H  DS    XL8                                                              
BDIL12   DS    CL40    21    1   40  A  P N             T        Y              
BDIL12BH DS    XL8                                                              
BDIL12B  DS    CL39    21   41   39  A  P N             T        Y              
BDIL13H  DS    XL8                                                              
BDIL13   DS    CL40    22    1   40  A  P N             T        Y              
BDIL13BH DS    XL8                                                              
BDIL13B  DS    CL39    22   41   39  A  P N             T        Y              
BDIL14H  DS    XL8                                                              
BDIL14   DS    CL40    23    1   40  A  P N             T        Y              
BDIL14BH DS    XL8                                                              
BDIL14B  DS    CL39    23   41   39  A  P N             T        Y              
BDIL15H  DS    XL8                                                              
BDIL15   DS    CL79    24    1   79  A  P N             T        Y  254         
BDIL15X  DS    XL8                                                              
BDILAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
BDIWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2064 BYTES                            
