*          DATA SET ACTRAFAD   AT LEVEL 005 AS OF 11/29/18                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T622FAD      DATE 11/29/18                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
TR2SYSH  DS    XL8                                                              
TR2SYS   DS    CL3      5   10    3  A  U N             T        Y  120         
TR2SYSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   15    5  A  P N             T        Y              
TR2MEDH  DS    XL8                                                              
TR2MED   DS    CL1      5   22    1  A  U N             T        Y  130         
TR2MEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   25    7  A  P N             T        Y              
TR2OFFH  DS    XL8                                                              
TR2OFF   DS    CL3      5   33    3  A  U N             T        Y  140         
TR2OFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
TR2CLTH  DS    XL8                                                              
TR2CLT   DS    CL3      5   47    3  A  U N             T        Y  150         
TR2CLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   52    7  A  P N             T        Y              
TR2PRDH  DS    XL8                                                              
TR2PRD   DS    CL3      5   61    3  A  U N             T        Y  160         
TR2PRDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   66    7  A  P N             T        Y              
TR2PROH  DS    XL8                                                              
TR2PRO   DS    CL3      5   75    3  A  U N             T        Y  170         
TR2PROX  DS    XL8                                                              
TR2DESH  DS    XL8                                                              
TR2DES   DS    CL40     7    2   40  A  P N             T        Y              
TR2STR2H DS    XL8                                                              
TR2STR2  DS    CL38     9    2   38  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL23     9   43   23  A  P N             T        Y              
TR2L1DH  DS    XL8                                                              
TR2L1D   DS    CL15    10    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    10   19   50  A  P N             T        Y              
TR2L2DH  DS    XL8                                                              
TR2L2D   DS    CL15    11    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    11   19   50  A  P N             T        Y              
TR2L3DH  DS    XL8                                                              
TR2L3D   DS    CL15    12    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    12   19   50  A  P N             T        Y              
TR2L4DH  DS    XL8                                                              
TR2L4D   DS    CL15    13    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    13   19   50  A  P N             T        Y              
TR2L5DH  DS    XL8                                                              
TR2L5D   DS    CL15    14    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    14   19   50  A  P N             T        Y              
TR2L6DH  DS    XL8                                                              
TR2L6D   DS    CL15    15    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    15   19   50  A  P N             T        Y              
TR2L7DH  DS    XL8                                                              
TR2L7D   DS    CL15    16    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    16   19   50  A  P N             T        Y              
TR2L8DH  DS    XL8                                                              
TR2L8D   DS    CL15    17    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    17   19   50  A  P N             T        Y              
TR2L9DH  DS    XL8                                                              
TR2L9D   DS    CL15    18    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    18   19   50  A  P N             T        Y              
TR2L10DH DS    XL8                                                              
TR2L10D  DS    CL15    19    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    19   19   50  A  P N             T        Y              
TR2L11DH DS    XL8                                                              
TR2L11D  DS    CL15    20    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    20   19   50  A  P N             T        Y              
TR2L12DH DS    XL8                                                              
TR2L12D  DS    CL15    21    2   15  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL50    21   19   50  A  P N             T        Y              
TR2PFKH  DS    XL8                                                              
TR2PFK   DS    CL78    24    2   78  A  P N             T        Y  254         
TR2PFKX  DS    XL8                                                              
TR2LAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
TR2WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1400 BYTES                            
