*          DATA SET ACTRADFD   AT LEVEL 002 AS OF 11/29/18                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T622DFD      DATE 11/29/18                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
PPRSYSH  DS    XL8                                                              
PPRSYS   DS    CL3      5   10    3  A  U N             T        Y  120         
PPRSYSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   15    5  A  P N             T        Y              
PPRMEDH  DS    XL8                                                              
PPRMED   DS    CL1      5   22    1  A  U N             T        Y  130         
PPRMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   25    7  A  P N             T        Y              
PPROFFH  DS    XL8                                                              
PPROFF   DS    CL3      5   33    3  A  U N             T        Y  140         
PPROFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
PPRCLTH  DS    XL8                                                              
PPRCLT   DS    CL3      5   47    3  A  U N             T        Y  150         
PPRCLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   52    7  A  P N             T        Y              
PPRPRDH  DS    XL8                                                              
PPRPRD   DS    CL3      5   61    3  A  U N             T        Y  160         
PPRPRDX  DS    XL8                                                              
PPRCODH  DS    XL8                                                              
PPRCOD   DS    CL15     5   65   15  A  P N             T        Y              
PPRMSGH  DS    XL8                                                              
PPRMSG   DS    CL40     6    4   40  A  P N             T        Y              
PPRSDISH DS    XL8                                                              
PPRSDIS  DS    CL7      7    4    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      7   30    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL18     7   52   18  A  P N             T        Y              
PPRL1DH  DS    XL8                                                              
PPRL1D   DS    CL26     8    2   26  A  P N             T        Y              
PPRL1H   DS    XL8                                                              
PPRL1    DS    CL20     8   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     8   57   13  A  P N             T        Y              
PPRL2DH  DS    XL8                                                              
PPRL2D   DS    CL26     9    2   26  A  P N             T        Y              
PPRL2H   DS    XL8                                                              
PPRL2    DS    CL20     9   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      9   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     9   57   13  A  P N             T        Y              
PPRL3DH  DS    XL8                                                              
PPRL3D   DS    CL26    10    2   26  A  P N             T        Y              
PPRL3H   DS    XL8                                                              
PPRL3    DS    CL20    10   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    10   57   13  A  P N             T        Y              
PPRL4DH  DS    XL8                                                              
PPRL4D   DS    CL26    11    2   26  A  P N             T        Y              
PPRL4H   DS    XL8                                                              
PPRL4    DS    CL20    11   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    11   57   13  A  P N             T        Y              
PPRL5DH  DS    XL8                                                              
PPRL5D   DS    CL26    12    2   26  A  P N             T        Y              
PPRL5H   DS    XL8                                                              
PPRL5    DS    CL20    12   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    12   57   13  A  P N             T        Y              
PPRL6DH  DS    XL8                                                              
PPRL6D   DS    CL26    13    2   26  A  P N             T        Y              
PPRL6H   DS    XL8                                                              
PPRL6    DS    CL20    13   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    13   57   13  A  P N             T        Y              
PPRL7DH  DS    XL8                                                              
PPRL7D   DS    CL26    14    2   26  A  P N             T        Y              
PPRL7H   DS    XL8                                                              
PPRL7    DS    CL20    14   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    14   57   13  A  P N             T        Y              
PPRL8DH  DS    XL8                                                              
PPRL8D   DS    CL26    15    2   26  A  P N             T        Y              
PPRL8H   DS    XL8                                                              
PPRL8    DS    CL20    15   30   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    15   57   13  A  P N             T        Y              
PPRL9DH  DS    XL8                                                              
PPRL9D   DS    CL26    16    2   26  A  P N             T        Y              
PPRL9H   DS    XL8                                                              
PPRL9    DS    CL20    16   30   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    16   57   13  A  P N             T        Y              
PPRL10DH DS    XL8                                                              
PPRL10D  DS    CL26    17    2   26  A  P N             T        Y              
PPRL10H  DS    XL8                                                              
PPRL10   DS    CL20    17   30   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    17   57   13  A  P N             T        Y              
PPRL11DH DS    XL8                                                              
PPRL11D  DS    CL26    18    2   26  A  P N             T        Y              
PPRL11H  DS    XL8                                                              
PPRL11   DS    CL20    18   30   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    18   57   13  A  P N             T        Y              
PPRL12DH DS    XL8                                                              
PPRL12D  DS    CL26    19    2   26  A  P N             T        Y              
PPRL12H  DS    XL8                                                              
PPRL12   DS    CL20    19   30   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    19   57   13  A  P N             T        Y              
PPRL13DH DS    XL8                                                              
PPRL13D  DS    CL26    20    2   26  A  P N             T        Y              
PPRL13H  DS    XL8                                                              
PPRL13   DS    CL20    20   30   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    20   57   13  A  P N             T        Y              
PPRL14DH DS    XL8                                                              
PPRL14D  DS    CL26    21    2   26  A  P N             T        Y              
PPRL14H  DS    XL8                                                              
PPRL14   DS    CL20    21   30   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    21   57   13  A  P N             T        Y              
PPRL15DH DS    XL8                                                              
PPRL15D  DS    CL26    22    2   26  A  P N             T        Y              
PPRL15H  DS    XL8                                                              
PPRL15   DS    CL20    22   30   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    22   57   13  A  P N             T        Y              
PPRL16DH DS    XL8                                                              
PPRL16D  DS    CL26    23    2   26  A  P N             T        Y              
PPRL16H  DS    XL8                                                              
PPRL16   DS    CL20    23   30   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    23   57   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  254         
         DS    XL8                                                              
PPRLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
PPRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1896 BYTES                            
