*          DATA SET ACTRAEED   AT LEVEL 004 AS OF 11/29/18                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T622EED      DATE 11/29/18                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
APSSYSH  DS    XL8                                                              
APSSYS   DS    CL3      5   10    3  A  U N             T        Y  120         
APSSYSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   15    5  A  P N             T        Y              
APSMEDH  DS    XL8                                                              
APSMED   DS    CL1      5   22    1  A  U N             T        Y  130         
APSMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   25    7  A  P N             T        Y              
APSOFFH  DS    XL8                                                              
APSOFF   DS    CL3      5   33    3  A  U N             T        Y  140         
APSOFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
APSCLTH  DS    XL8                                                              
APSCLT   DS    CL3      5   47    3  A  U N             T        Y  150         
APSCLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   52    7  A  P N             T        Y              
APSPRDH  DS    XL8                                                              
APSPRD   DS    CL3      5   61    3  A  U N             T        Y  160         
APSPRDX  DS    XL8                                                              
APSCODH  DS    XL8                                                              
APSCOD   DS    CL15     5   65   15  A  P N             T        Y              
APSMSGH  DS    XL8                                                              
APSMSG   DS    CL40     6    4   40  A  P N             T        Y              
APSSDISH DS    XL8                                                              
APSSDIS  DS    CL38     7    4   38  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   43    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      7   52    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17     7   61   17  A  P N             T        Y              
APSL1DH  DS    XL8                                                              
APSL1D   DS    CL16     8    2   16  A  P N             T        Y              
APSL1H   DS    XL8                                                              
APSL1    DS    CL2      8   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14     8   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      8   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     8   65   13  A  P N             T        Y              
APSL2DH  DS    XL8                                                              
APSL2D   DS    CL16     9    2   16  A  P N             T        Y              
APSL2H   DS    XL8                                                              
APSL2    DS    CL2      9   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14     9   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      9   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      9   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     9   65   13  A  P N             T        Y              
APSL3DH  DS    XL8                                                              
APSL3D   DS    CL16    10    2   16  A  P N             T        Y              
APSL3H   DS    XL8                                                              
APSL3    DS    CL2     10   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    10   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    10   65   13  A  P N             T        Y              
APSL4DH  DS    XL8                                                              
APSL4D   DS    CL16    11    2   16  A  P N             T        Y              
APSL4H   DS    XL8                                                              
APSL4    DS    CL2     11   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    11   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    11   65   13  A  P N             T        Y              
APSL5DH  DS    XL8                                                              
APSL5D   DS    CL16    12    2   16  A  P N             T        Y              
APSL5H   DS    XL8                                                              
APSL5    DS    CL2     12   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    12   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    12   65   13  A  P N             T        Y              
APSL6DH  DS    XL8                                                              
APSL6D   DS    CL16    13    2   16  A  P N             T        Y              
APSL6H   DS    XL8                                                              
APSL6    DS    CL2     13   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    13   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    13   65   13  A  P N             T        Y              
APSL7DH  DS    XL8                                                              
APSL7D   DS    CL16    14    2   16  A  P N             T        Y              
APSL7H   DS    XL8                                                              
APSL7    DS    CL2     14   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    14   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    14   65   13  A  P N             T        Y              
APSL8DH  DS    XL8                                                              
APSL8D   DS    CL16    15    2   16  A  P N             T        Y              
APSL8H   DS    XL8                                                              
APSL8    DS    CL2     15   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    15   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    15   65   13  A  P N             T        Y              
APSL9DH  DS    XL8                                                              
APSL9D   DS    CL16    16    2   16  A  P N             T        Y              
APSL9H   DS    XL8                                                              
APSL9    DS    CL2     16   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    16   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    16   65   13  A  P N             T        Y              
APSL10DH DS    XL8                                                              
APSL10D  DS    CL16    17    2   16  A  P N             T        Y              
APSL10H  DS    XL8                                                              
APSL10   DS    CL2     17   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    17   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    17   65   13  A  P N             T        Y              
APSL11DH DS    XL8                                                              
APSL11D  DS    CL16    18    2   16  A  P N             T        Y              
APSL11H  DS    XL8                                                              
APSL11   DS    CL2     18   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    18   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    18   65   13  A  P N             T        Y              
APSL12DH DS    XL8                                                              
APSL12D  DS    CL16    19    2   16  A  P N             T        Y              
APSL12H  DS    XL8                                                              
APSL12   DS    CL2     19   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    19   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    19   65   13  A  P N             T        Y              
APSL13DH DS    XL8                                                              
APSL13D  DS    CL16    20    2   16  A  P N             T        Y              
APSL13H  DS    XL8                                                              
APSL13   DS    CL2     20   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    20   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    20   65   13  A  P N             T        Y              
APSL14DH DS    XL8                                                              
APSL14D  DS    CL16    21    2   16  A  P N             T        Y              
APSL14H  DS    XL8                                                              
APSL14   DS    CL2     21   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    21   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    21   65   13  A  P N             T        Y              
APSL15DH DS    XL8                                                              
APSL15D  DS    CL16    22    2   16  A  P N             T        Y              
APSL15H  DS    XL8                                                              
APSL15   DS    CL2     22   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    22   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    22   65   13  A  P N             T        Y              
APSL16DH DS    XL8                                                              
APSL16D  DS    CL16    23    2   16  A  P N             T        Y              
APSL16H  DS    XL8                                                              
APSL16   DS    CL2     23   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    23   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    23   65   13  A  P N             T        Y              
APSPFKH  DS    XL8                                                              
APSPFK   DS    CL78    24    2   78  A  P N             T        Y  254         
APSPFKX  DS    XL8                                                              
APSLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
APSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2528 BYTES                            
