*          DATA SET ACTRAEAD   AT LEVEL 003 AS OF 11/29/18                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T622EAD      DATE 11/29/18                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL8      5    2    8  A  P H             T        Y              
BLISYSH  DS    XL8                                                              
BLISYS   DS    CL3      5   11    3  A  U N             T        Y  120         
BLISYSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   15    5  A  P N             T        Y              
BLIMEDH  DS    XL8                                                              
BLIMED   DS    CL1      5   21    1  A  U N             T        Y  130         
BLIMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   30    7  A  P N             T        Y              
BLIOFFH  DS    XL8                                                              
BLIOFF   DS    CL3      5   38    3  A  U N             T        Y  140         
BLIOFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   48    7  A  P N             T        Y              
BLICLTH  DS    XL8                                                              
BLICLT   DS    CL3      5   57    3  A  U N             T        Y  150         
BLICLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   66    7  A  P N             T        Y              
BLIPRDH  DS    XL8                                                              
BLIPRD   DS    CL3      5   74    3  A  U N             T        Y  160         
BLIPRDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      6    2    8  A  P N             T        Y              
BLIESTH  DS    XL8                                                              
BLIEST   DS    CL3      6   11    3  A  U N             T        Y  170         
BLIESTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      6   15    3  A  P N             T        Y              
BLISDTH  DS    XL8                                                              
BLISDT   DS    CL8      6   21    8  A  U N             T        Y  180         
BLISDTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      6   30    8  A  P N             T        Y              
BLIRDTH  DS    XL8                                                              
BLIRDT   DS    CL8      6   39    8  A  U N             T        Y  190         
BLIRDTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      6   48    8  A  P N             T        Y              
BLIIDTH  DS    XL8                                                              
BLIIDT   DS    CL8      6   57    8  A  U N             T        Y  200         
BLIIDTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  P N             T        Y              
BLISLSTH DS    XL8                                                              
BLISLST  DS    CL40     8    6   40  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL30     8   48   30  A  P N             T        Y              
BLISL1H  DS    XL8                                                              
BLISL1   DS    CL3      9    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75     9    6   75  A  P N             T        Y              
BLISL2H  DS    XL8                                                              
BLISL2   DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    10    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    11    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    23    6   75  A  P N             T        Y              
BLIPFKH  DS    XL8                                                              
BLIPFK   DS    CL78    24    2   78  A  P N             T        Y  254         
BLIPFKX  DS    XL8                                                              
BLILAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
BLIWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1928 BYTES                            
