*          DATA SET ACTRACKD   AT LEVEL 002 AS OF 03/07/03                      
* DSECT TO COVER TRACKING INFORMATION RECORD                                    
*                                                                               
TRAKD    DSECT                     **TRACKING RECORD**                          
TRAKLN   DS    H                   RECORD LENGTH                                
TRAKTYP  DS    C                   RECORD TYPE                                  
TRAKTYPP EQU   C'P'                POSTINGS INFORMATION                         
TRAKTYPB EQU   C'B'                SPOT BILLING SOON CD-ROM (SRUPD00)           
TRAKSTAT DS    X                   STATUS                                       
TRAKSOON EQU   X'80'               SOON REPORT                                  
TRAKTEST EQU   X'40'               TEST RUN                                     
TRAKFIL  DS    CL7                 FILE NAME                                    
TRAKJIB  DS    CL8                 JOB ID                                       
TRAKDAT  DS    CL8                 TODAY'S DATE                                 
TRAKTIM  DS    CL8                 TIME (HH.MM.SS)                              
TRAKUID  DS    CL8                 USER ID                                      
TRAKFID  DS    0CL7                WORKER FILE ID                               
TRAKPRG  DS    CL3                 PROGRAM                                      
TRAKSUB  DS    CL1                 SUB PROGRAM                                  
TRAKDAY  DS    CL2                 DAY                                          
TRAKCLS  DS    CL1                 CLASS                                        
TRAKSEQ  DS    CL4                 SEQUENCE NUMBER                              
         DS    XL4                 SPARE                                        
TRAKPOS  DS    PL8                 TOTAL POSTINGS                               
TRAKMRK  DS    PL8                 TOTAL MARKINGS                               
TRAKREC  DS    PL8                 TOTAL RECORDS                                
         DS    PL8                 SPARE                                        
TRAKLNQ EQU    *-TRAKD             RECORD LENGTH                                
