*          DATA SET ACTRAFBD   AT LEVEL 005 AS OF 11/29/18                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T622FBD      DATE 11/29/18                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
PROSYSH  DS    XL8                                                              
PROSYS   DS    CL3      5   10    3  A  U N             T        Y  120         
PROSYSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   15    5  A  P N             T        Y              
PROMEDH  DS    XL8                                                              
PROMED   DS    CL1      5   22    1  A  U N             T        Y  130         
PROMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   25    7  A  P N             T        Y              
PROOFFH  DS    XL8                                                              
PROOFF   DS    CL3      5   33    3  A  U N             T        Y  140         
PROOFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
PROCLTH  DS    XL8                                                              
PROCLT   DS    CL3      5   47    3  A  U N             T        Y  150         
PROCLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   52    7  A  P N             T        Y              
PROPRDH  DS    XL8                                                              
PROPRD   DS    CL3      5   61    3  A  U N             T        Y  160         
PROPRDX  DS    XL8                                                              
PROCODH  DS    XL8                                                              
PROCOD   DS    CL15     5   65   15  A  P N             T        Y              
PROMSGH  DS    XL8                                                              
PROMSG   DS    CL40     6    4   40  A  P N             T        Y              
PROSDISH DS    XL8                                                              
PROSDIS  DS    CL7      7    4    7  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL5      7   30    5  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL18     7   52   18  A  P N             T        Y              
PROL1DH  DS    XL8                                                              
PROL1D   DS    CL26     8    2   26  A  P N             T        Y              
PROL1H   DS    XL8                                                              
PROL1    DS    CL20     8   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     8   57   13  A  P N             T        Y              
PROL2DH  DS    XL8                                                              
PROL2D   DS    CL26     9    2   26  A  P N             T        Y              
PROL2H   DS    XL8                                                              
PROL2    DS    CL20     9   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      9   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     9   57   13  A  P N             T        Y              
PROL3DH  DS    XL8                                                              
PROL3D   DS    CL26    10    2   26  A  P N             T        Y              
PROL3H   DS    XL8                                                              
PROL3    DS    CL20    10   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    10   57   13  A  P N             T        Y              
PROL4DH  DS    XL8                                                              
PROL4D   DS    CL26    11    2   26  A  P N             T        Y              
PROL4H   DS    XL8                                                              
PROL4    DS    CL20    11   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    11   57   13  A  P N             T        Y              
PROL5DH  DS    XL8                                                              
PROL5D   DS    CL26    12    2   26  A  P N             T        Y              
PROL5H   DS    XL8                                                              
PROL5    DS    CL20    12   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    12   57   13  A  P N             T        Y              
PROL6DH  DS    XL8                                                              
PROL6D   DS    CL26    13    2   26  A  P N             T        Y              
PROL6H   DS    XL8                                                              
PROL6    DS    CL20    13   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    13   57   13  A  P N             T        Y              
PROL7DH  DS    XL8                                                              
PROL7D   DS    CL26    14    2   26  A  P N             T        Y              
PROL7H   DS    XL8                                                              
PROL7    DS    CL20    14   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    14   57   13  A  P N             T        Y              
PROL8DH  DS    XL8                                                              
PROL8D   DS    CL26    15    2   26  A  P N             T        Y              
PROL8H   DS    XL8                                                              
PROL8    DS    CL20    15   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    15   57   13  A  P N             T        Y              
PROL9DH  DS    XL8                                                              
PROL9D   DS    CL26    16    2   26  A  P N             T        Y              
PROL9H   DS    XL8                                                              
PROL9    DS    CL20    16   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    16   57   13  A  P N             T        Y              
PROL10DH DS    XL8                                                              
PROL10D  DS    CL26    17    2   26  A  P N             T        Y              
PROL10H  DS    XL8                                                              
PROL10   DS    CL20    17   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    17   57   13  A  P N             T        Y              
PROL11DH DS    XL8                                                              
PROL11D  DS    CL26    18    2   26  A  P N             T        Y              
PROL11H  DS    XL8                                                              
PROL11   DS    CL20    18   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    18   57   13  A  P N             T        Y              
PROL12DH DS    XL8                                                              
PROL12D  DS    CL26    19    2   26  A  P N             T        Y              
PROL12H  DS    XL8                                                              
PROL12   DS    CL20    19   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    19   57   13  A  P N             T        Y              
PROL13DH DS    XL8                                                              
PROL13D  DS    CL26    20    2   26  A  P N             T        Y              
PROL13H  DS    XL8                                                              
PROL13   DS    CL20    20   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    20   57   13  A  P N             T        Y              
PROL14DH DS    XL8                                                              
PROL14D  DS    CL26    21    2   26  A  P N             T        Y              
PROL14H  DS    XL8                                                              
PROL14   DS    CL20    21   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    21   57   13  A  P N             T        Y              
PROL15DH DS    XL8                                                              
PROL15D  DS    CL26    22    2   26  A  P N             T        Y              
PROL15H  DS    XL8                                                              
PROL15   DS    CL20    22   30   20  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    22   57   13  A  P N             T        Y              
PROL16DH DS    XL8                                                              
PROL16D  DS    CL26    23    2   26  A  P N             T        Y              
PROL16H  DS    XL8                                                              
PROL16   DS    CL20    23   30   20  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   52    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    23   57   13  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  P N             T        Y  254         
         DS    XL8                                                              
PROLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1896 BYTES                            
