*          DATA SET ACTRADAD   AT LEVEL 002 AS OF 11/29/18                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T622DAD      DATE 11/29/18                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
RPLSYSH  DS    XL8                                                              
RPLSYS   DS    CL3      5   10    3  A  U N             T        Y  120         
RPLSYSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   15    5  A  P N             T        Y              
RPLMEDH  DS    XL8                                                              
RPLMED   DS    CL1      5   22    1  A  U N             T        Y  130         
RPLMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   25    7  A  P N             T        Y              
RPLOFFH  DS    XL8                                                              
RPLOFF   DS    CL3      5   33    3  A  U N             T        Y  140         
RPLOFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
RPLCLTH  DS    XL8                                                              
RPLCLT   DS    CL3      5   47    3  A  U N             T        Y  150         
RPLCLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   52    7  A  P N             T        Y              
RPLPRDH  DS    XL8                                                              
RPLPRD   DS    CL3      5   61    3  A  U N             T        Y  160         
RPLPRDX  DS    XL8                                                              
RPLCODH  DS    XL8                                                              
RPLCOD   DS    CL15     5   65   15  A  P N             T        Y              
RPLMSGH  DS    XL8                                                              
RPLMSG   DS    CL40     6    4   40  A  P N             T        Y              
RPLSDISH DS    XL8                                                              
RPLSDIS  DS    CL38     7    4   38  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   43    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      7   52    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17     7   61   17  A  P N             T        Y              
RPLL1DH  DS    XL8                                                              
RPLL1D   DS    CL16     8    2   16  A  P N             T        Y              
RPLL1H   DS    XL8                                                              
RPLL1    DS    CL2      8   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14     8   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      8   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     8   65   13  A  P N             T        Y              
RPLL2DH  DS    XL8                                                              
RPLL2D   DS    CL16     9    2   16  A  P N             T        Y              
RPLL2H   DS    XL8                                                              
RPLL2    DS    CL2      9   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14     9   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      9   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     9   65   13  A  P N             T        Y              
RPLL3DH  DS    XL8                                                              
RPLL3D   DS    CL16    10    2   16  A  P N             T        Y              
RPLL3H   DS    XL8                                                              
RPLL3    DS    CL2     10   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    10   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    10   65   13  A  P N             T        Y              
RPLL4DH  DS    XL8                                                              
RPLL4D   DS    CL16    11    2   16  A  P N             T        Y              
RPLL4H   DS    XL8                                                              
RPLL4    DS    CL2     11   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    11   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    11   65   13  A  P N             T        Y              
RPLL5DH  DS    XL8                                                              
RPLL5D   DS    CL16    12    2   16  A  P N             T        Y              
RPLL5H   DS    XL8                                                              
RPLL5    DS    CL2     12   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    12   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    12   65   13  A  P N             T        Y              
RPLL6DH  DS    XL8                                                              
RPLL6D   DS    CL16    13    2   16  A  P N             T        Y              
RPLL6H   DS    XL8                                                              
RPLL6    DS    CL2     13   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    13   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    13   65   13  A  P N             T        Y              
RPLL7DH  DS    XL8                                                              
RPLL7D   DS    CL16    14    2   16  A  P N             T        Y              
RPLL7H   DS    XL8                                                              
RPLL7    DS    CL2     14   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    14   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    14   65   13  A  P N             T        Y              
RPLL8DH  DS    XL8                                                              
RPLL8D   DS    CL16    15    2   16  A  P N             T        Y              
RPLL8H   DS    XL8                                                              
RPLL8    DS    CL2     15   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    15   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    15   65   13  A  P N             T        Y              
RPLL9DH  DS    XL8                                                              
RPLL9D   DS    CL16    16    2   16  A  P N             T        Y              
RPLL9H   DS    XL8                                                              
RPLL9    DS    CL2     16   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    16   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    16   65   13  A  P N             T        Y              
RPLL10DH DS    XL8                                                              
RPLL10D  DS    CL16    17    2   16  A  P N             T        Y              
RPLL10H  DS    XL8                                                              
RPLL10   DS    CL2     17   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    17   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    17   65   13  A  P N             T        Y              
RPLL11DH DS    XL8                                                              
RPLL11D  DS    CL16    18    2   16  A  P N             T        Y              
RPLL11H  DS    XL8                                                              
RPLL11   DS    CL2     18   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    18   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    18   65   13  A  P N             T        Y              
RPLL12DH DS    XL8                                                              
RPLL12D  DS    CL16    19    2   16  A  P N             T        Y              
RPLL12H  DS    XL8                                                              
RPLL12   DS    CL2     19   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    19   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    19   65   13  A  P N             T        Y              
RPLL13DH DS    XL8                                                              
RPLL13D  DS    CL16    20    2   16  A  P N             T        Y              
RPLL13H  DS    XL8                                                              
RPLL13   DS    CL2     20   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    20   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    20   65   13  A  P N             T        Y              
RPLL14DH DS    XL8                                                              
RPLL14D  DS    CL16    21    2   16  A  P N             T        Y              
RPLL14H  DS    XL8                                                              
RPLL14   DS    CL2     21   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    21   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    21   65   13  A  P N             T        Y              
RPLL15DH DS    XL8                                                              
RPLL15D  DS    CL16    22    2   16  A  P N             T        Y              
RPLL15H  DS    XL8                                                              
RPLL15   DS    CL2     22   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    22   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    22   65   13  A  P N             T        Y              
RPLL16DH DS    XL8                                                              
RPLL16D  DS    CL16    23    2   16  A  P N             T        Y              
RPLL16H  DS    XL8                                                              
RPLL16   DS    CL2     23   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    23   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    23   65   13  A  P N             T        Y              
RPLPFKH  DS    XL8                                                              
RPLPFK   DS    CL78    24    2   78  A  P N             T        Y  254         
RPLPFKX  DS    XL8                                                              
RPLLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
RPLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2528 BYTES                            
