*          DATA SET ACTRAPRVS  AT LEVEL 019 AS OF 12/08/93                      
         SPACE 1                                                                
*              CANADIAN PROVIDENCE TABLE OF CODES                               
*              ONLY ROWS WITH ELEMENT EQUATES ARE CURRENTLY VALID               
*              DSECT TO COVER TABLE IN ACTRAPRVD                                
         SPACE 2                                                                
PRVTAB   DS    0CL4                                                             
         DC    C'BC',AL1(0),AL1(0)                                              
         DC    C'AL',AL1(0),AL1(0)                                              
         DC    C'SA',AL1(0),AL1(0)                                              
         DC    C'MA',AL1(0),AL1(0)                                              
         DC    C'ON',AL1(0),AL1(0)                                              
         DC    C'PQ',AL1(MBTTPQO),AL1(MBTTPQI)                                  
         DC    C'NB',AL1(0),AL1(0)                                              
         DC    C'NS',AL1(0),AL1(0)                                              
         DC    C'PE',AL1(0),AL1(0)                                              
         DC    C'NF',AL1(0),AL1(0)                                              
         DC    X'FF'                                                            
