*          DATA SET ACTRADCD   AT LEVEL 005 AS OF 11/29/18                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T622DCD      DATE 11/29/18                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
MPOSYSH  DS    XL8                                                              
MPOSYS   DS    CL3      5   10    3  A  U N             T        Y  120         
MPOSYSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   15    5  A  P N             T        Y              
MPOMEDH  DS    XL8                                                              
MPOMED   DS    CL1      5   22    1  A  U N             T        Y  130         
MPOMEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   25    7  A  P N             T        Y              
MPOOFFH  DS    XL8                                                              
MPOOFF   DS    CL3      5   33    3  A  U N             T        Y  140         
MPOOFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
MPOCLTH  DS    XL8                                                              
MPOCLT   DS    CL3      5   47    3  A  U N             T        Y  150         
MPOCLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   52    7  A  P N             T        Y              
MPOPRDH  DS    XL8                                                              
MPOPRD   DS    CL3      5   61    3  A  U N             T        Y  160         
MPOPRDX  DS    XL8                                                              
MPOCODH  DS    XL8                                                              
MPOCOD   DS    CL15     5   65   15  A  P N             T        Y              
MPOMSGH  DS    XL8                                                              
MPOMSG   DS    CL40     6    4   40  A  P N             T        Y              
MPOSDISH DS    XL8                                                              
MPOSDIS  DS    CL38     7    4   38  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   43    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      7   52    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17     7   61   17  A  P N             T        Y              
MPOL1DH  DS    XL8                                                              
MPOL1D   DS    CL16     8    2   16  A  P N             T        Y              
MPOL1H   DS    XL8                                                              
MPOL1    DS    CL2      8   20    2  A  P N             T        Y              
MPOL1ACH DS    XL8                                                              
MPOL1AC  DS    CL14     8   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      8   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     8   65   13  A  P N             T        Y              
MPOL2DH  DS    XL8                                                              
MPOL2D   DS    CL16     9    2   16  A  P N             T        Y              
MPOL2H   DS    XL8                                                              
MPOL2    DS    CL2      9   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14     9   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      9   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      9   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     9   65   13  A  P N             T        Y              
MPOL3DH  DS    XL8                                                              
MPOL3D   DS    CL16    10    2   16  A  P N             T        Y              
MPOL3H   DS    XL8                                                              
MPOL3    DS    CL2     10   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    10   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    10   65   13  A  P N             T        Y              
MPOL4DH  DS    XL8                                                              
MPOL4D   DS    CL16    11    2   16  A  P N             T        Y              
MPOL4H   DS    XL8                                                              
MPOL4    DS    CL2     11   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    11   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    11   65   13  A  P N             T        Y              
MPOL5DH  DS    XL8                                                              
MPOL5D   DS    CL16    12    2   16  A  P N             T        Y              
MPOL5H   DS    XL8                                                              
MPOL5    DS    CL2     12   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    12   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    12   65   13  A  P N             T        Y              
MPOL6DH  DS    XL8                                                              
MPOL6D   DS    CL16    13    2   16  A  P N             T        Y              
MPOL6H   DS    XL8                                                              
MPOL6    DS    CL2     13   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    13   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    13   65   13  A  P N             T        Y              
MPOL7DH  DS    XL8                                                              
MPOL7D   DS    CL16    14    2   16  A  P N             T        Y              
MPOL7H   DS    XL8                                                              
MPOL7    DS    CL2     14   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    14   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    14   65   13  A  P N             T        Y              
MPOL8DH  DS    XL8                                                              
MPOL8D   DS    CL16    15    2   16  A  P N             T        Y              
MPOL8H   DS    XL8                                                              
MPOL8    DS    CL2     15   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    15   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    15   65   13  A  P N             T        Y              
MPOL9DH  DS    XL8                                                              
MPOL9D   DS    CL16    16    2   16  A  P N             T        Y              
MPOL9H   DS    XL8                                                              
MPOL9    DS    CL2     16   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    16   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    16   65   13  A  P N             T        Y              
MPOL10DH DS    XL8                                                              
MPOL10D  DS    CL16    17    2   16  A  P N             T        Y              
MPOL10H  DS    XL8                                                              
MPOL10   DS    CL2     17   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    17   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    17   65   13  A  P N             T        Y              
MPOL11DH DS    XL8                                                              
MPOL11D  DS    CL16    18    2   16  A  P N             T        Y              
MPOL11H  DS    XL8                                                              
MPOL11   DS    CL2     18   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    18   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    18   65   13  A  P N             T        Y              
MPOL12DH DS    XL8                                                              
MPOL12D  DS    CL16    19    2   16  A  P N             T        Y              
MPOL12H  DS    XL8                                                              
MPOL12   DS    CL2     19   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    19   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    19   65   13  A  P N             T        Y              
MPOL13DH DS    XL8                                                              
MPOL13D  DS    CL16    20    2   16  A  P N             T        Y              
MPOL13H  DS    XL8                                                              
MPOL13   DS    CL2     20   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    20   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    20   65   13  A  P N             T        Y              
MPOL14DH DS    XL8                                                              
MPOL14D  DS    CL16    21    2   16  A  P N             T        Y              
MPOL14H  DS    XL8                                                              
MPOL14   DS    CL2     21   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    21   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    21   65   13  A  P N             T        Y              
MPOL15DH DS    XL8                                                              
MPOL15D  DS    CL16    22    2   16  A  P N             T        Y              
MPOL15H  DS    XL8                                                              
MPOL15   DS    CL2     22   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    22   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    22   65   13  A  P N             T        Y              
MPOL16DH DS    XL8                                                              
MPOL16D  DS    CL16    23    2   16  A  P N             T        Y              
MPOL16H  DS    XL8                                                              
MPOL16   DS    CL2     23   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    23   24   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    23   65   13  A  P N             T        Y              
MPOPFKH  DS    XL8                                                              
MPOPFK   DS    CL78    24    2   78  A  P N             T        Y  254         
MPOPFKX  DS    XL8                                                              
MPOLAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
MPOWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2528 BYTES                            
