*          DATA SET ACTRAEDD   AT LEVEL 002 AS OF 11/29/18                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T622EDD      DATE 11/29/18                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
AP2SYSH  DS    XL8                                                              
AP2SYS   DS    CL3      5   10    3  A  U N             T        Y  120         
AP2SYSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   15    5  A  P N             T        Y              
AP2MEDH  DS    XL8                                                              
AP2MED   DS    CL1      5   22    1  A  U N             T        Y  130         
AP2MEDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   25    7  A  P N             T        Y              
AP2OFFH  DS    XL8                                                              
AP2OFF   DS    CL3      5   33    3  A  U N             T        Y  140         
AP2OFFX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   38    7  A  P N             T        Y              
AP2CLTH  DS    XL8                                                              
AP2CLT   DS    CL3      5   47    3  A  U N             T        Y  150         
AP2CLTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   52    7  A  P N             T        Y              
AP2PRDH  DS    XL8                                                              
AP2PRD   DS    CL3      5   61    3  A  U N             T        Y  160         
AP2PRDX  DS    XL8                                                              
AP2CODH  DS    XL8                                                              
AP2COD   DS    CL15     5   65   15  A  P N             T        Y              
AP2MSGH  DS    XL8                                                              
AP2MSG   DS    CL40     6    4   40  A  P N             T        Y              
AP2SDISH DS    XL8                                                              
AP2SDIS  DS    CL38     7    4   38  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL6      7   43    6  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL4      7   52    4  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL17     7   61   17  A  P N             T        Y              
AP2L17DH DS    XL8                                                              
AP2L17D  DS    CL16     8    2   16  A  P N             T        Y              
AP2L17H  DS    XL8                                                              
AP2L17   DS    CL2      8   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14     8   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      8   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      8   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     8   65   13  A  P N             T        Y              
AP2L18DH DS    XL8                                                              
AP2L18D  DS    CL16     9    2   16  A  P N             T        Y              
AP2L18H  DS    XL8                                                              
AP2L18   DS    CL2      9   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14     9   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      9   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13     9   65   13  A  P N             T        Y              
AP2L19DH DS    XL8                                                              
AP2L19D  DS    CL16    10    2   16  A  P N             T        Y              
AP2L19H  DS    XL8                                                              
AP2L19   DS    CL2     10   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    10   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    10   65   13  A  P N             T        Y              
AP2L20DH DS    XL8                                                              
AP2L20D  DS    CL16    11    2   16  A  P N             T        Y              
AP2L20H  DS    XL8                                                              
AP2L20   DS    CL2     11   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    11   24   14  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   43    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    11   65   13  A  P N             T        Y              
AP2L21DH DS    XL8                                                              
AP2L21D  DS    CL16    12    2   16  A  P N             T        Y              
AP2L21H  DS    XL8                                                              
AP2L21   DS    CL2     12   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    12   24   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    12   65   13  A  P N             T        Y              
AP2L22DH DS    XL8                                                              
AP2L22D  DS    CL16    13    2   16  A  P N             T        Y              
AP2L22H  DS    XL8                                                              
AP2L22   DS    CL2     13   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    13   24   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    13   65   13  A  P N             T        Y              
AP2L23DH DS    XL8                                                              
AP2L23D  DS    CL16    14    2   16  A  P N             T        Y              
AP2L23H  DS    XL8                                                              
AP2L23   DS    CL2     14   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    14   24   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    14   65   13  A  P N             T        Y              
AP2L24DH DS    XL8                                                              
AP2L24D  DS    CL16    15    2   16  A  P N             T        Y              
AP2L24H  DS    XL8                                                              
AP2L24   DS    CL2     15   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    15   24   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    15   65   13  A  P N             T        Y              
AP2L25DH DS    XL8                                                              
AP2L25D  DS    CL16    16    2   16  A  P N             T        Y              
AP2L25H  DS    XL8                                                              
AP2L25   DS    CL2     16   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    16   24   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    16   65   13  A  P N             T        Y              
AP2L26DH DS    XL8                                                              
AP2L26D  DS    CL16    17    2   16  A  P N             T        Y              
AP2L26H  DS    XL8                                                              
AP2L26   DS    CL2     17   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    17   24   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    17   65   13  A  P N             T        Y              
AP2L27DH DS    XL8                                                              
AP2L27D  DS    CL16    18    2   16  A  P N             T        Y              
AP2L27H  DS    XL8                                                              
AP2L27   DS    CL2     18   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    18   24   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    18   65   13  A  P N             T        Y              
AP2L28DH DS    XL8                                                              
AP2L28D  DS    CL16    19    2   16  A  P N             T        Y              
AP2L28H  DS    XL8                                                              
AP2L28   DS    CL2     19   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    19   24   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    19   65   13  A  P N             T        Y              
AP2L29DH DS    XL8                                                              
AP2L29D  DS    CL16    20    2   16  A  P N             T        Y              
AP2L29H  DS    XL8                                                              
AP2L29   DS    CL2     20   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    20   24   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    20   65   13  A  P N             T        Y              
AP2L30DH DS    XL8                                                              
AP2L30D  DS    CL16    21    2   16  A  P N             T        Y              
AP2L30H  DS    XL8                                                              
AP2L30   DS    CL2     21   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    21   24   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    21   65   13  A  P N             T        Y              
AP2L31DH DS    XL8                                                              
AP2L31D  DS    CL16    22    2   16  A  P N             T        Y              
AP2L31H  DS    XL8                                                              
AP2L31   DS    CL2     22   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    22   24   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    22   65   13  A  P N             T        Y              
AP2L32DH DS    XL8                                                              
AP2L32D  DS    CL16    23    2   16  A  P N             T        Y              
AP2L32H  DS    XL8                                                              
AP2L32   DS    CL2     23   20    2  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL14    23   24   14  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   39    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   43    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   52    8  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   61    3  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL13    23   65   13  A  P N             T        Y              
AP2PFKH  DS    XL8                                                              
AP2PFK   DS    CL78    24    2   78  A  P N             T        Y  254         
AP2PFKX  DS    XL8                                                              
AP2LAST  DS    XL1                                                              
         DS    XL2    INDICS=X                                                  
AP2WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2528 BYTES                            
