*          DATA SET ACUPD      AT LEVEL 003 AS OF 05/12/11                      
***********************************************************************         
* FACWRK file header record                                           *         
***********************************************************************         
                                                                                
         ORG   FW_HDATA                                                         
FW_FLAG  DS    X                   ** Flags **                                  
FW_FOFFL EQU   X'80'               File created off-line                        
FW_FKFWK EQU   X'40'               Don't purge =FWK file                        
                                                                                
FW_AGY   DS    CL2                 Agency alpha ID                              
FW_USER  DS    AL2                 User-ID                                      
FW_CPY   DS    XL(L'ACTKCPY)       Company code                                 
FW_CPYS1 DS    X                   Company status byte 1                        
FW_CPYS2 DS    X                   Company status byte 2                        
FW_CPYS3 DS    X                   Company status byte 3                        
FW_CPYS4 DS    X                   Company status byte 4                        
FW_CPYS5 DS    X                   Company status byte 5                        
FW_CPYS6 DS    X                   Company status byte 6                        
FW_CPYS7 DS    X                   Company status byte 7                        
FW_CPYS8 DS    X                   Company status byte 8                        
FW_CPYS9 DS    X                   Company status byte 9                        
FW_CPYSA DS    X                   Company status byte 10                       
FW_CPYSB DS    X                   Company status byte 11                       
FW_CPYSC DS    X                   Company status byte 12                       
FW_CPYGL DS    XL2                 Company GL MOA                               
FW_CPYSF DS    XL1                 Company Fiscal Start month                   
FW_PERLV DS    XL4                 1R ledger account lengths                    
FW_SJALV DS    XL3                 SJ ledger account lengths                    
FW_BOVLY DS    X                   BrandOcean overlay created from              
FW_BTIME EQU   X'1B'               BrandOcean time                              
FW_BEXPN EQU   X'16'               BrandOcean expenses                          
FW_BINVS EQU   X'23'               BrandOcean invoices                          
                                                                                
