*          DATA SET ACWFMFED   AT LEVEL 018 AS OF 01/24/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T61AFED      DATE 01/24/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL3      4    2    3  L  P H             T        Y              
WFMLHEDH DS    CL8                                                              
WFMLHED  DS    CL74     4    6   74  L  P H             T        Y              
WFMLACTH DS    CL8                                                              
WFMLACT  DS    CL1      5    2    1  A  U N             T        Y    1         
WFMLACTX DS    CL8                                                              
WFMLCFMH DS    CL8                                                              
WFMLCFM  DS    CL1      5    4    1  A  P N             T        Y              
WFMLDETH DS    CL8                                                              
WFMLDET  DS    CL74     5    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      6    2    1  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      6    4    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74     6    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      7    2    1  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7    4    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74     7    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      8    2    1  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      8    4    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74     8    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      9    2    1  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      9    4    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74     9    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     10    2    1  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     10    4    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74    10    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     11    2    1  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     11    4    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74    11    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12    2    1  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     12    4    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74    12    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     13    2    1  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13    4    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14    2    1  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     14    4    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15    2    1  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15    4    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16    2    1  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16    4    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17    2    1  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17    4    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     18    2    1  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18    4    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19    2    1  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19    4    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20    2    1  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20    4    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21    2    1  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21    4    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22    2    1  A  U N             T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     22    4    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
WFMLDTLH DS    CL8                                                              
WFMLDTL  DS    CL1     23    2    1  A  U N             T        Y    1         
WFMLDTLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     23    4    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL74    23    6   74  A  P N             T        Y              
WFMLPFKH DS    CL8                                                              
WFMLPFK  DS    CL78    24    2   78  L  P H             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=11                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2240 BYTES                            
