*          DATA SET ACWRIDATED AT LEVEL 001 AS OF 04/16/87                      
*              DSECT TO COVER DATE BUFFER                                       
         SPACE 3                                                                
DATED    DSECT                                                                  
MONLIST  DS    CL216               36 MONTHS YYMM (EBCDIC) YM(PWOS)             
PERIOD   DS    CL40                20 START/END MONTH NUMBER PAIRS              
YTD      DS    CL40                                                             
ROLLING  DS    CL40                                                             
FISCAL   DS    CL40                                                             
LASTPER  DS    CL40                                                             
LASTYTD  DS    CL40                                                             
LASTROLL DS    CL40                                                             
LASTFISC DS    CL40                                                             
AHEAD    DS    CL40                                                             
LASTAHED DS    CL40                                                             
         SPACE 1                                                                
