*          DATA SET ACWRIWORKD AT LEVEL 051 AS OF 10/13/88                      
SUBSYSD  DSECT                                                                  
       ++INCLUDE ACWRISYSD                                                      
         EJECT                                                                  
*              THE REST                                                         
         SPACE 3                                                                
DUMPDATE DS    D                   **DATES* IN DUMP                             
BUFF     DS    960C                                                             
         DS    D                   *ACCFLT* IN DUMP                             
         DS    2048C                                                            
         DS    D                   **DPG*** IN DUMP                             
         DS    3000C                                                            
         DS    D                   **DPGIO* IN DUMP                             
         DS    1000C                                                            
         SPACE 1                                                                
SYSEND   DS    0C                  END OF SAVED STORAGE                         
