*          DATA SET ACWRIF1D   AT LEVEL 013 AS OF 03/09/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T614F1D      DATE 03/09/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A  U N             T        N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL26     5   28   26  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   56    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   64    8  A  U N             T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7    2    6  A  P H             T        Y              
WRILEDGH DS    CL8                                                              
WRILEDG  DS    CL8      7   10    8  A  U H             T        Y   10         
WRILEDGX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7   20    7  A  P N             T        Y              
WRIPERH  DS    CL8                                                              
WRIPER   DS    CL17     7   28   17  A  U N             T        Y   16         
WRIPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      7   56    6  A  P N             T        Y              
WRIMOSH  DS    CL8                                                              
WRIMOS   DS    CL13     7   64   13  A  U N             T        Y   17         
WRIMOSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
WRIACCH  DS    CL8                                                              
WRIACC   DS    CL12     8   10   12  A  U N             T        Y   12         
WRIACCX  DS    CL8                                                              
WRIACCNH DS    CL8                                                              
WRIACCN  DS    CL36     8   24   36  A  P N             T        Y              
WRICHATH DS    CL8                                                              
WRICHAT  DS    CL16     8   64   16  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
WRIFILTH DS    CL8                                                              
WRIFILT  DS    CL26     9   10   26  A  U N             T        Y   14         
WRIFILTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9   38    7  A  P N             T        Y              
WRIOPTH  DS    CL8                                                              
WRIOPT   DS    CL32     9   46   32  A  U N             T        Y   50         
WRIOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
WRIHEADH DS    CL8                                                              
WRIHEAD  DS    CL20    11   10   20  A  U N             T        Y   20         
WRIHEADX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    11   34   20  A  U N             T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    11   59   20  A  U N             T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    12   10   20  A  U N             T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    12   34   20  A  U N             T        Y   20         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3     12   55    3  A  P N             T        Y              
WRIMIDH  DS    CL8                                                              
WRIMID   DS    CL20    12   59   20  A  U N             T        Y   22         
WRIMIDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13    2    7  A  P H             T        Y              
WRIROWSH DS    CL8                                                              
WRIROWS  DS    CL20    13   10   20  A  U N             T        Y   24         
WRIROWSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    13   34   20  A  U N             T        Y   24         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    13   59   20  A  U N             T        Y   24         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    14   10   20  A  U N             T        Y   24         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    14   34   20  A  U N             T        Y   24         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL20    14   59   20  A  U N             T        Y   24         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     15    2    7  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL1     15   10    1  A  P N             T        Y              
WRICOLSH DS    CL8                                                              
WRICOLS  DS    CL32    15   12   32  A  U N             T        Y   30         
WRICOLSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    15   47   32  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    16   12   32  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    16   47   32  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    17   12   32  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    17   47   32  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    18   12   32  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    18   47   32  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    19   12   32  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    19   47   32  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    20   12   32  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    20   47   32  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    21   12   32  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    21   47   32  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     22   10    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    22   12   32  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     22   45    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    22   47   32  A  U N             T        Y   30         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     23    2    7  A  P N             T        Y              
WRITITH  DS    CL8                                                              
WRITIT   DS    CL32    23   10   32  A  U N             T        Y   40         
WRITITX  DS    CL8                                                              
WRISUBH  DS    CL8                                                              
WRISUB   DS    CL32    23   45   32  A  U N             T        Y   42         
WRISUBX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL32    24   10   32  A  U N             T        Y   44         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL32    24   45   32  A  U N             T        Y   46         
         DS    CL8                                                              
WRILAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
WRIWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2096 BYTES                            
