*          DATA SET AGXWORKD   AT LEVEL 033 AS OF 08/17/20                      
***********************************************************************         
*   Global Working Storage for AGXTRACT BulkAPI extract program       *         
***********************************************************************         
* Who  Lvl Date    Change(s)                                 Audit              
* ---- --- ------- ----------------------------------------- ----------         
* vgup 022 06Aug19 Increase SJOTMAX from 4000 8000           ITMF-48726         
* YNGX 021 10Mar20 New Timeoff for Load/Update purposes      DSRD-23410         
* NSHE 020 06Nov19 Extend extract to include expense trans   DSRD-23387         
* YNGX 019 06Aug19 Increase SJOTMAX from 2500 4000           ITMF-38626         
* YNGX 018 28May19 New field No of Invoices in Order fact    DSRD-22573         
* TKLU 017 08Feb19 New data fields for high level accounts   DSRD-21185         
* TKLU 016 06Dec18 Increase SJOTMAX                          ITMF-31733         
* TKLU 015 26Nov18 SETSJO coding for TRNFOFF if update mode  DSRD-20807         
* TKLU 014 01Oct18 SAVEEUR estimate exchange rate            DSRD-20352         
* TKLU 014 01Oct18 SAVEEUR estimate exchange rate            DSRD-20352         
* TKLU 013 14Sep18 Add SR ledger                             DSRD-20140         
* TKLU 012 17Aug18 Dummy US w/c 99 entry on load             DSRD-19969         
* TKLU 011 14Aug18 SETACTV logic change                      DSRD-19938         
* TKLU 010 30Jul18 New CUT dimension for update purposes     DSRD-19766         
* TKLU 009 10May18 SCMEL/ARTEL sub sequence logic change     DSRD-18977         
* TKLU 008 23Apr18 Currency order add up to avoid 'pennies'  DSRD-18850         
* TKLU 007 29Mar18 Estimates and order time manipulation     DSRD-18638         
* TKLU 006 26Mar18 Add TEMPSTOR storage (multiple purpose)   DSRD-18601         
* TKLU 005 26Jan18 Transaction billing enhancements          DSRD-18079         
* TKLU 004 09Jan18 GETOPT IO improvements                    DSRD-17593         
* TKLU 003 05Jan18 Add TYPE=TRN and TYPE=EXP                 DSRD-17376         
* TKLU 002 15Nov17 Order update bug fix                      DSRD-16206         
* TKLU 001 27Oct17 Initial Version for BulkAPI Extract       DSRD-13993         
*                  If change relink AGXRECD=>AGXCNVX+AGXROUTS                   
***********************************************************************         
                                                                                
GWORKD   DSECT                                                                  
                                                                                
TSTJCLQ  EQU   C'T'                                                             
TSTSKPQ  EQU   C'S'                                                             
TSTMESQ  EQU   C'M'                                                             
FSTCPYQ  EQU   X'41'                                                            
TRUEQ    EQU   C'1'                                                             
FALSEQ   EQU   C'0'                                                             
CZEROQ   EQU   C'0'                                                             
YESQ     EQU   C'Y'                                                             
SPACEQ   EQU   C' '                                                             
NOQ      EQU   C'N'                                                             
SLASHQ   EQU   C'/'                                                             
UNDSCQ   EQU   C'_'                                                             
DOUBLEQ  EQU   C':'                                                             
*PLUSQ    EQU   C'+'                                                            
*14AUG - EDITR: replace by space. At the end remove at all?|                    
PLUSQ    EQU   C' '                                                             
MINUSQ   EQU   C'-'                                                             
FFQ      EQU   X'FF'                                                            
SILDGQ   EQU   C'I'                                                             
SKLDGQ   EQU   C'K'                                                             
STLDGQ   EQU   C'T'                                                             
PRODORDQ EQU   C'P'                                                             
EXPORDQ  EQU   C'E'                                                             
                                                                                
EXFMAXLQ EQU   8192                                                             
                                                                                
DMCB     DS    6F                                                               
PARM     DS    6F                                                               
DMWORK   DS    12D                                                              
ACCADDR  DS    F                   Disk address                                 
                                                                                
ACOMFAC  DS    A                   Comfacs                                      
AIOAREA  DS    A                                                                
AIOGEN   DS    A                                                                
APRORATA DS    A                                                                
AGOBLOCB DS    A                                                                
AGOXBLCK DS    A                                                                
AGOBBLCK DS    A                                                                
ABIGAREA DS    0A                  Combined SVREC/SVOREC/XSPARE                 
BIGLENQ  EQU   2*2048+6144                                                      
ASVREC   DS    A                                                                
ASVOREC  DS    A                                                                
APERBUF  DS    A                                                                
APBULEN  DS    A                                                                
ABUFFER  DS    A                                                                
ABUFLEN  DS    A                                                                
ABUFOLD  DS    A                                                                
ABUFOLN  DS    A                                                                
AODBUF   DS    A                                                                
AODOBUF  DS    A                                                                
AWCACUM  DS    A                                                                
AUIDTAB  DS    A                                                                
APIDBUF  DS    A                                                                
*&&DO                                                                           
ASUPBLN  DS    A                                                                
ASUPBUF  DS    A                                                                
*&&                                                                             
ACLCBLN  DS    A                   Buffer length for compare record             
ACLCBUF  DS    A                   Buffer to compare record data 6K             
ACURBUF  DS    A                   BLDCUR buffer                                
ASJOTAB  DS    A                   SJ Office table                              
                                                                                
DUB      DS    D                                                                
EDDUB    DS    D                                                                
PL16     DS    0PL16                                                            
DUBNET   DS    D                                                                
DUBCOM   DS    D                                                                
DUBFBC   DS    D                                                                
DUBFBN   DS    D                                                                
FULL     DS    F                                                                
AGXCPYOF DS    F                                                                
SAVERE   DS    A                                                                
HALF     DS    H                                                                
                                                                                
TWOBYTES DS    XL2                                                              
PREVODB  DS    XL(L'ODBKEY)                                                     
TEMPSTOR DS    XL40                                                             
                                                                                
RETBYTE  DS    XL1                 Extract routine return byte                  
RETBNWQ  EQU   X'80'               - don't write                                
RETBCBQ  EQU   X'40'               - call back required                         
RETBERQ  EQU   X'20'               - error from routine                         
RETBFFQ  EQU   X'10'               - fact follows - no read                     
RETBNCQ  EQU   X'08'               - no write as data not complete              
RETBTXT  EQU   X'04'               - text row call                              
RETBNMQ  EQU   0                   - no more to come                            
                                                                                
PROCMODE DS    XL1                 Processing mode                              
PROCMLQ  EQU   X'01'               - Load                                       
PROCMUQ  EQU   X'02'               - Update                                     
PROCMPQ  EQU   X'04'               - Passives                                   
PROCOPQ  EQU   X'08'               - 'Copy' record processing                   
PROCCLQ  EQU   X'10'               - Currency load mode                         
PROCTDQ  EQU   X'20'               - Text dimension mode                        
PROC2DQ  EQU   X'40'               - Extra dimension mode                       
PROCBNQ  EQU   X'80'               - Bill number dimension mode                 
                                                                                
PROCMOD2 DS    XL1                 Processing mode #2                           
PROCMRQ  EQU   X'01'               - Multi record scenario                      
PROCMFQ  EQU   X'02'               - Multi records - ok to go                   
PROCSFQ  EQU   X'04'               - Multi records - Sequentials found          
PROCOEQ  EQU   X'08'               - Order extension received                   
PROCACQ  EQU   X'10'               - Add treated as change(add)                 
PROCDCQ  EQU   X'20'               - Delete treated as change(delete)           
PROCP1Q  EQU   X'40'               - Phase 1 (estimates delete)                 
PROCP2Q  EQU   X'80'               - Phase 2 (estimates readd)                  
                                                                                
PROCMOD3 DS    XL1                 Processing mode #3                           
PROCMOEQ EQU   X'01'               - Order extension only scenario              
PROCMOSQ EQU   X'02'               - Order status update scenario               
PROCAASQ EQU   X'04'               - Add a second                               
PROCCUTQ EQU   X'08'               - Do CUT record                              
PROCW99Q EQU   X'10'               - Dummy w/c 99                               
PROCTOFQ EQU   X'20'               - Timeoff mode                               
                                                                                
BYTE     DS    XL1                                                              
ISDATA   DS    CL1                                                              
SVACTION DS    CL1                                                              
SVSOURCE DS    XL1                                                              
SVBYTE   DS    XL1                                                              
IS_DIM   DS    CL1                 (see AUPD024)                                
LEN_DATA DS    CL2                 - L'Data w/o key (=xyzLEDQ)                  
SV_REDAT DS    CL10                                                             
SV_RETIM DS    CL8                                                              
SV_LDDAT DS    CL10                                                             
SV_LDTIM DS    CL8                                                              
SV_TOAID DS    CL2                 Timeoff alpha-id for VAGXTOFF                
                                                                                
CHAMODE  DS    CL1                 Change mode                                  
CHAMCHAQ EQU   C'C'                - Change                                     
CHAMDARQ EQU   C'A'                - Delete and readd                           
                                                                                
LT_ACT   DS    CL1                 Last time DX action                          
LT_SIN   DS    XL4                 Last time SIN                                
LT_GIN   DS    XL8                 Last time GIN                                
LT_RTYP  DS    XL1                 Last time record type                        
                                                                                
S_PROCMO DS    XL1                                                              
S_PROCM2 DS    XL1                                                              
S_PROCM3 DS    XL1                                                              
                                                                                
         DS    0D                                                               
FCOUNT   DS    F                                                                
WORK     DS    XL128                                                            
AFCTEMP  DS    XL(AFCLNQ)                                                       
                                                                                
TODAYC   DS    XL2                                                              
                                                                                
IOKEY    DS    XL64                                                             
IOKEYSAV DS    XL42                                                             
IOKEYPAS DS    XL64                                                             
                                                                                
TIMTSWP  DS    XL42                Previous and current TSW key                 
TIMTSWC  DS    XL42                                                             
                                                                                
VERSION  DS    XL1                 Version number of extract                    
                                                                                
OBTSERR  DS    XL1                 Saved TSAR error                             
OBTTAREA DS    XL(OB_LNQ)          Agency level TSAR record area                
                                                                                
KEY4TXT  DS    CL6                                                              
ROW4TXT  DS    CL6                                                              
SUB4TXT  DS    CL6                                                              
LEN4TXT  DS    XL1                                                              
ADR4TXT  DS    XL4                                                              
LEN4TX2  DS    XL1                                                              
ADR4TX2  DS    XL4                                                              
LEN4TX3  DS    XL1                                                              
ADR4TX3  DS    XL4                                                              
LEN4TX4  DS    XL1                                                              
ADR4TX4  DS    XL4                                                              
NUMTXTS  EQU   4                                                                
                                                                                
LAST_CLI DS    0XL17                                                            
LAST_CKY DS    XL15                                                             
LAST_COF DS    CL2                                                              
                                                                                
LAST_PRO DS    0XL17                                                            
LAST_PKY DS    XL15                                                             
LAST_POF DS    CL2                                                              
                                                                                
LAST_JOF DS    CL2                                                              
                                                                                
SAVCPY   DS    0X                  Saved company values                         
SAVCALP  DS    CL2                                                              
SAVCSEC  DS    CL2                                                              
SAVCACT  DS    CL1                 Y/N BulkAPI user (CPYSGPDX)?                 
SAVCOMP  DS    XL1                                                              
SAVCCUR  DS    CL3                                                              
OFFLEN   DS    XL1                                                              
DEPLEN   DS    XL1                                                              
SUBLEN   DS    XL1                                                              
PERLEN   DS    XL1                                                              
CLILEN   DS    XL1                                                              
PROLEN   DS    XL1                                                              
JOBLEN   DS    XL1                                                              
SAVICAL  DS    CL1                                                              
SAVCLOC  DS    XL1                                                              
SAVCRQNP DS    CL1                 CPYREQPF                                     
SAVCRQNS DS    CL1                 CPYREQSF                                     
SAVC2CO  DS    CL1                 CPYSOFF2 Y/N                                 
SAVCLVLA DS    0X                                                               
SAVC1RL  DS    CL2                                                              
SAVC1RA  DS    XL1                                                              
SAVC1RB  DS    XL1                                                              
SAVC1RC  DS    XL1                                                              
SAVC1RD  DS    XL1                                                              
SAVCSJL  DS    CL2                                                              
SAVCSJA  DS    XL1                                                              
SAVCSJB  DS    XL1                                                              
SAVCSJC  DS    XL1                                                              
SAVCSJD  DS    XL1                                                              
SAVCLVLS DS    (SAVCLVL#)XL6       other ledger levels                          
SAVCLVL# EQU   22                                                               
SAVCLVLQ EQU   22+2                                                             
         DS    XL2                 (end of SAVCLVLS)                            
SAVCPYLQ EQU   *-SAVCPY            Make sure OB_LNQ is long enough              
                                                                                
SAV_TRN  DS    0X                  Special transaction saved data               
SAV_TBNC DS    XL1                                                              
SAV_TELE DS    XL4                                                              
SAV_TOFF DS    CL2                                                              
SAV_TIND DS    XL1                                                              
SAV_TICQ EQU   X'80'                                                            
SAV_TIAQ EQU   X'40'                                                            
SAV_TIFQ EQU   X'20'                                                            
         DS    XL1                 (spare)                                      
SAV_TRNL EQU   *-SAV_TRN                                                        
                                                                                
SAV_EST  DS    0X                  Special estimate saved data                  
SAV_ECKY DS    XL13                                                             
SAV_EKEY DS    XL13                                                             
SAV_ESCE DS    CL1                                                              
SAV_EADD EQU   C'A'                                                             
SAV_ESTA EQU   C'S'                                                             
SAV_ECHA EQU   C'C'                                                             
SAV_EIND DS    XL1                 Estimate scenario indicator                  
SAV_EIBQ EQU   X'80'               - is ballpark                                
SAV_EJCQ EQU   X'40'               - is job close scenario                      
SAV_EASQ EQU   X'20'               - is 'add a second' scenario                 
SAV_ESEQ DS    XL3                                                              
SAV_ECRD DS    XL3                 Recovery 'copy' date & time                  
SAV_ECRT DS    XL4                 (RCVDATE+RCVTIME)                            
SAV_ESTL EQU   *-SAV_EST                                                        
                                                                                
SAV_ORD  DS    0X                  Special order saved data area                
SAV_OCRD DS    XL3                 Recovery 'copy' date & time                  
SAV_OCRT DS    XL4                 (RCVDATE+RCVTIME)                            
SAV_OAAS DS    CL1                 Set PROCAASQ                                 
SAV_ORDL EQU   *-SAV_ORD                                                        
                                                                                
SAV_EXP  DS    0X                  Special expense claim saved data             
SAV_XINI DS    CL1                                                              
SAV_XKEY DS    CL7                                                              
         DS    XL8                 (spare)                                      
SAV_EXPL EQU   *-SAV_EXP                                                        
                                                                                
SAV_TIM  DS    0X                  Special time sheet saved data                
SAV_TINI DS    CL1                                                              
         DS    XL8                 (spare)                                      
SAV_TIML EQU   *-SAV_TIM                                                        
                                                                                
SAVEBLOK DS    XL256                                                            
                                                                                
         ORG   SAVEBLOK                                                         
SAVCUR   DS    0X                  Saved currency load values                   
SAVCURAD DS    A                                                                
SAVCURLQ EQU   *-SAVCUR                                                         
                                                                                
         ORG   SAVEBLOK                                                         
SAVORD   DS    0X                  Saved order values                           
SAVOORD  DS    CL6                                                              
SAVOROW  DS    CL6                                                              
SAVOSUB  DS    CL6                                                              
SAVOCPJ  DS    CL12                                                             
SAVOSUP  DS    CL14                                                             
SAVOEXP  DS    CL14                                                             
SAVO2DA  DS    CL14                                                             
SAVO2PA  DS    CL14                                                             
SAVOCUR  DS    CL3                                                              
SAVODAT  DS    XL3                                                              
SAVODUE  DS    XL3                                                              
SAVOETY  DS    CL3                                                              
SAVOOFF  DS    CL2                                                              
SAVOEXT  DS    CL1                 ORDSEXEX order                               
SAVOMOD  DS    CL1                                                              
SAVOCNT  DS    XL1                                                              
SAVOALL  DS    XL1                                                              
SAVOIND  DS    XL1                                                              
SAVOISTQ EQU   X'80'               ORDSSTAT scenario                            
SAVOIORQ EQU   X'40'                                                            
SAVOIOAQ EQU   X'20'                                                            
SAVOINQ  EQU   X'10'               AGFORD not first time flag                   
SAVOIAQ  EQU   X'01'               ARTELQ scenario                              
SAVOITQ  EQU   X'02'               ATXELQ present                               
SAVOISQ  EQU   X'04'               SCMELQ scenario                              
SAVOIXQ  EQU   X'08'               'no more to come' flag                       
SAVOWCS  DS    CL1                 Y/N for work code set                        
SAVOACT  DS    XL7                                                              
SAVOADR  DS    XL4                 A(current fact entry via ODB)                
SAVOSCM  DS    XL4                 A(current SCM entry via ODB)                 
SAVOATX  DS    XL4                 A(current ATX entry via ODB)                 
SAVO1ST  DS    XL4                                                              
SAVOEWC  DS    CL2                 Expense order w/c                            
SAVOINUM DS    PL6                 No of invoice to date                        
SAVOEUR  DS    XL(EURKBLKL)                                                     
SAVORDLQ EQU   *-SAVORD                                                         
                                                                                
         ORG   SAVEBLOK                                                         
SAVEST   DS    0X                                                               
SAVEST#  DS    CL6                                                              
SAVESTD  DS    PL3                                                              
SAVESCH  DS    CL8                                                              
SAVECUR  DS    CL3                                                              
SAVEOFF  DS    CL2                                                              
SAVEROW  DS    CL6                                                              
SAVESUB  DS    CL6                                                              
SAVETYP  DS    XL1                                                              
SAVETEQ  EQU   FFQ                                                              
SAVETNQ  EQU   0                                                                
SAVET1Q  EQU   1                                                                
* also ERDTYP values                                                            
SAVEADR  DS    XL4                                                              
SAVEWCA  DS    XL4                                                              
SAVEACT  DS    XL6                                                              
SAVEINST DS    CL26                                                             
*AVECTNA DS    CL20                                                             
SAVEEUR  DS    XL(EURKBLKL)                                                     
SAVESTLQ EQU   *-SAVEST                                                         
                                                                                
         ORG   SAVEBLOK                                                         
SAVEXP   DS    0X                                                               
SAVXTYP  DS    CL1                                                              
SAVXREF  DS    CL6                                                              
SAVXSEQ  DS    XL1                                                              
SAVXICN  DS    XL1                                                              
SAVXSEQR DS    XL1                                                              
SAVXICNR DS    XL1                                                              
SAVXPID  DS    CL8                                                              
SAVEXPLQ EQU   *-SAVEXP                                                         
                                                                                
         ORG   SAVEBLOK                                                         
SAVTIM   DS    0X                                                               
SAVZPID  DS    XL2                                                              
SAVZPER  DS    CL8                                                              
SAVZPSD  DS    XL3                                                              
SAVZPED  DS    XL3                                                              
SAVZLSD  DS    XL3                                                              
SAVZLED  DS    XL3                                                              
SAVZSEQ  DS    XL1                                                              
SAVZSTA  DS    XL1                                                              
SAVZSDQ  EQU   X'80'                                                            
SAVZSIQ  EQU   X'40'                                                            
SAVZITM  DS    XL1                                                              
SAVZDAY  DS    XL1                                                              
SAVZNPI  DS    XL1                                                              
SAVZSTAR DS    XL1                                                              
SAVZITMR DS    XL1                                                              
SAVZDAYR DS    XL1                                                              
SAVZNPIR DS    XL1                                                              
SAVZODS  DS    CL8                                                              
SAVZTIDS DS    CL10                                                             
SAVZROW# DS    CL3                                                              
SAVZSUB# DS    CL5                                                              
SAVZTID  DS    0CL30               Timesheet ID                                 
SAVZTIDP DS    CL8                                                              
SAVZTID1 DS    CL1                                                              
SAVZTIDE DS    CL10                                                             
SAVZTID2 DS    CL1                                                              
SAVZTIDL DS    CL10                                                             
SAVTIMLQ EQU   *-SAVTIM                                                         
                                                                                
         ORG   SAVEBLOK+L'SAVEBLOK                                              
                                                                                
LITVALS  DS    0X                  List of literals                             
                                                                                
DMOPEN   DS    CL7                                                              
DMREAD   DS    CL7                                                              
DMRSEQ   DS    CL7                                                              
DMRDHI   DS    CL7                                                              
DMCLSE   DS    CL7                                                              
DMFAST   DS    CL7                                                              
DMPRINT  DS    CL7                                                              
PRTQUE   DS    CL7                                                              
GETREC   DS    CL7                                                              
DMRFIL   DS    CL7                                                              
CONTROL  DS    CL7                                                              
CTFILE   DS    CL7                                                              
ACCDIR   DS    CL7                                                              
ACCMST   DS    CL7                                                              
ACCARC   DS    CL7                                                              
GSPACES  DS    CL256                                                            
PZERO    DS    PL1                                                              
PMONE    DS    PL1                                                              
PONE     DS    PL1                                                              
P10      DS    PL2                                                              
P100     DS    PL2                                                              
ORDCNT   DS    CL6                 000000                                       
MIXLIT   DS    CL3                 MIX                                          
GBPLIT   DS    CL3                 GBP                                          
USDLIT   DS    CL3                 USD                                          
EUROPE   DS    CL2                 EU                                           
NORTHAM  DS    CL2                 NA                                           
TYPE_ALL DS    CL3                 ALL                                          
PRODUL   DS    CL2                 SJ                                           
ACCLDGS  DS    0X                  TYPE=ACC Ledgers                             
EXPLDGS  DS    0X                  TYPE=Expense ledgers                         
SEUL     DS    CL2                 SE                                           
SAUL     DS    CL2                 SA                                           
*&&UK                                                                           
SQUL     DS    CL2                 SQ                                           
*&&                                                                             
*&&US                                                                           
SBUL     DS    CL2                 SB                                           
*&&                                                                             
EXPLDGLQ EQU   *-EXPLDGS                                                        
SCUL     DS    CL2                 SC                                           
SGUL     DS    CL2                 SG                                           
SIUL     DS    CL2                 SI                                           
SKUL     DS    CL2                 SK                                           
*&&US                                                                           
SQUL     DS    CL2                 SQ                                           
*&&                                                                             
SRUL     DS    CL2                 SR                                           
CRDLDGS  DS    0X                  TYPE=Creditor ledgers                        
SVUL     DS    CL2                 SV                                           
SXUL     DS    CL2                 SX                                           
SFUL     DS    CL2                 SF                                           
*&&US                                                                           
SWUL     DS    CL2                 SW                                           
SYUL     DS    CL2                 SY                                           
*&&                                                                             
CRDLDGLQ EQU   *-CRDLDGS                                                        
OCUL     DS    CL2                 1C                                           
ONUL     DS    CL2                 1N                                           
ORUL     DS    CL2                 1R                                           
TDUL     DS    CL2                 2D                                           
TPUL     DS    CL2                 2P                                           
ACCLDGX  DS    XL1                 (up to here)                                 
RUNINDS  DS    XL1                 Run indicator                                
RUNUPDT  EQU   X'80'               - update mode                                
RUNLOAD  EQU   X'40'               - load mode                                  
RUNLAST  EQU   X'20'               - last for either mode                       
RUNCOMP  EQU   X'10'               - company has been updated                   
RUNHDR   EQU   X'08'               - if update mode do header as load           
RUNTIMOF EQU   X'04'               - Timeoff has been updated                   
RUNCUT   EQU   X'02'               - company update time sent                   
BILWC    DS    CL2                 99                                           
                                                                                
LITVALSL EQU   *-LITVALS                                                        
                                                                                
GWORKDL  EQU   *-GWORKD                                                         
                                                                                
       ++INCLUDE AGXRECID                                                       
                                                                                
GWORKMAX EQU   4096                Maximum global work can be this here         
         DS    (GWORKMAX-(*-GWORKD))X                                           
                                                                                
       ++INCLUDE DDCTRYEQUS                                                     
                                                                                
       ++INCLUDE DDCURTABD                                                      
                                                                                
       ++INCLUDE DDEUREKAD                                                      
***********************************************************************         
* Optimisation buffer record layout                                   *         
***********************************************************************         
                                                                                
OB_D     DSECT                                                                  
OB_LEN   DS    AL2                 Buffer record length                         
                                                                                
OB_KEY   DS    XL20                Record key                                   
         ORG   OB_KEY                                                           
OB_KTYP  DS    XL1                 Type (1 < 40)                                
OB_KTYPQ EQU   X'01'               Client summary record                        
OB_KAGY  DS    CL5                 Continent_alpha id                           
OB_KCLI  DS    CL6                 Client code                                  
OB_KOFF  DS    CL2                 Office                                       
OB_KMOA  DS    PL2                 YYMM                                         
         DS    XL1                                                              
         ORG   OB_KEY                                                           
OB_KCPY  DS    XL1                 Company hex code (>40)                       
         DS    XL19                                                             
                                                                                
OB_DATA  DS    0X                  Data starts here                             
OB_RC300 DS    PL6                 AGXCPYDQ                                     
OB_RC301 DS    PL6                 AGXCLIDQ                                     
OB_RC302 DS    PL6                 AGXPRODQ                                     
OB_RC303 DS    PL6                 AGXJOBDQ                                     
OB_RC304 DS    PL6                 AGXETYDQ                                     
OB_RC305 DS    PL6                 AGXWCODQ                                     
OB_RC306 DS    PL6                 AGXCATDQ                                     
OB_RC307 DS    PL6                 AGXACCDQ                                     
OB_RC308 DS    PL6                 AGXPERDQ                                     
OB_RC309 DS    PL6                 AGXEST2Q                                     
OB_RC310 DS    PL6                 AGXTRNDQ                                     
OB_RC311 DS    PL6                 AGXTRNFQ                                     
OB_RC312 DS    PL6                 AGXORDDQ                                     
OB_RC313 DS    PL6                 AGXORDFQ                                     
OB_RC314 DS    PL6                 AGXESTDQ                                     
OB_RC315 DS    PL6                 AGXESTFQ                                     
OB_RC316 DS    PL6                 AGXEXPDQ                                     
OB_RC317 DS    PL6                 AGXEXPFQ                                     
OB_RC318 DS    PL6                 AGXTIMDQ                                     
OB_RC319 DS    PL6                 AGXTIMFQ                                     
OB_RC320 DS    PL6                 AGXITMDQ                                     
OB_RC321 DS    PL6                 AGXCURDQ                                     
OB_RC322 DS    PL6                 AGXETXDQ                                     
OB_RC323 DS    PL6                 AGXORD2Q                                     
OB_RC324 DS    PL6                 AGXBILDQ                                     
OB_RC325 DS    PL6                 AGXTIMRQ                                     
OB_RC326 DS    PL6                 AGXEXPRQ                                     
OB_RC327 DS    PL6                 AGXORDSQ                                     
OB_RC328 DS    PL6                 AGXESTSQ                                     
OB_RC329 DS    PL6                 AGXOTXDQ                                     
OB_RC330 DS    PL6                 AGXOFFDQ                                     
* 31-35 not required as artificial records                                      
OB_RC336 DS    PL6                 AGXCUTDQ                                     
OB_RC337 DS    PL6                 AGXXTRFQ                                     
* 38 not required as artificial records                                         
OB_RC339 DS    PL6                 AGXTOFFQ                                     
OB_RC340 DS    PL6                 AGXCSMFQ                                     
OB_RCMAX EQU   (*-OB_RC300)/(L'OB_RC320)                                        
OB_CPY   DS    XL(SAVCPYLQ)        Company buffer record                        
                                                                                
         ORG   OB_DATA                                                          
OB_BHRS  DS    PL8                 Approved billable hours                      
OB_NHRS  DS    PL8                 Approved N&R type hours for all lvls         
OB_EHRS  DS    PL8                 Current estimated hours                      
OB_AHRS  DS    PL8                 Actual hours (B&R&N) for job                 
OB_NEXA  DS    PL8                 Non billable postings, orders                
OB_ESTA  DS    PL8                 Current estimated amount for jobs            
OB_BILD  DS    PL8                 Billed amounts for jobs                      
OB_CSLNQ EQU   *-OB_D              Client summary record length                 
         ORG                                                                    
                                                                                
OB_DATAL EQU   *-OB_DATA                                                        
OB_LNQ   EQU   *-OB_D                                                           
                                                                                
***********************************************************************         
* Other common DSECTs                                                 *         
***********************************************************************         
                                                                                
ODBUFFD  DSECT                                                                  
ODBKEY   DS    0XL5                Order details buffer key                     
ODBCOMPS DS    0XL4                                                             
ODBCOMP  DS    0XL3                                                             
ODBKSEQ  DS    XL1                                                              
ODBKWC   DS    CL2                                                              
ODBKSUB  DS    XL1                                                              
ODBKELE  DS    XL1                                                              
ODBDATA  DS    0XL4                Data                                         
ODBADR   DS    XL4                                                              
ODBLENQ  EQU   *-ODBUFFD                                                        
ODBMAXQ  EQU   1000                                                             
                                                                                
SUPBKEYD DSECT                                                                  
SUPBKTYP DS    CL1                 Type:                                        
SUPBKTXQ EQU   X'00'               - Spare                                      
SUPBKTEQ EQU   C'E'                - Estimate                                   
SUPBKTOQ EQU   C'O'                - Order                                      
SUPBKSIN DS    XL4                 SIN                                          
SUPBKGIN DS    XL4                 GIN                                          
SUPBKLNQ EQU   *-SUPBKEYD                                                       
SUPBDLNQ EQU   400                 (to be defined for data)                     
                                                                                
SJOTABD  DSECT                                                                  
SJOTCPY  DS    XL1                 Account company code or 00 for EoT           
SJOTACT  DS    CL12                SJ client/product/job account                
SJOTOFF  DS    CL2                 Office code                                  
SJOTLNQ  EQU   *-SJOTABD                                                        
SJOTMAX  EQU   8000                (was 4000)                                   
                                                                                
PIDBUFD  DSECT                                                                  
PIDBSAGY DS    CL2                                                              
PIDBPIDX DS    XL2                                                              
PIDBPIDC DS    CL8                                                              
PIDBFNAM DS    CL16                                                             
PIDBMNAM DS    CL16                                                             
PIDBLNAM DS    CL16                                                             
PIDBNAME DS    CL20                                                             
PIDBLNQ  EQU   *-PIDBUFD                                                        
PIDB#Q   EQU   1000                                                             
PIDBSIZQ EQU   (PIDBLNQ*(PIDB#Q+1))                                             
                                                                                
BUFLENQ  EQU   250000                                                           
                                                                                
PBULENQ  EQU   50000                                                            
                                                                                
WCACUMD  DSECT                                                                  
WCACWC   DS    CL2                 Work code                                    
WCACAGY  DS    PL6                 Agency amount                                
WCACLNQ  EQU   *-WCACUMD                                                        
WCACUML  EQU   WCACUM#*WCACLNQ                                                  
WCACUM#  EQU   21                                                               
                                                                                
SUPBLNQ  EQU   (SUPBUF#)*(SUPBKLNQ+2*BUFLENQ+SUPBDLNQ)                          
SUPBUF#  EQU   10                                                               
                                                                                
