*          DATA SET ARB2DDSTB  AT LEVEL 049 AS OF 07/22/09                      
* THIS TABLE CONVERTS ARB/STRATA 3 CHARACTER MARKETS TO THE                     
*  COORESPONDING DDS 3 CHARACTER MARKET                                         
*                                                                               
*  CL3(ARB)=CODE FROM STRATA RAW DOS FILE                                       
*  CL3(DDS)=CODE FROM DEM ON DDS FILE                                           
*                                                                               
ARB2DDS  DS    0CL(3+3)                                                         
         DC    C'ABE',C'ALL'                                                    
         DC    C'ABI',C'ABI'                                                    
         DC    C'AGM',C'AWM'                                                    
         DC    C'AKR',C'AKR'                                                    
         DC    C'ALG',C'ABG'                                                    
         DC    C'ALQ',C'ABQ'                                                    
         DC    C'ALT',C'ATO'                                                    
         DC    C'ALX',C'ALX'                                                    
         DC    C'AMA',C'AMA'                                                    
         DC    C'ANA',C'ANA'                                                    
         DC    C'ANC',C'ANC'                                                    
         DC    C'ANN',C'ANN'                                                    
         DC    C'ASH',C'ASH'                                                    
         DC    C'AST',C'ALB'                                                    
         DC    C'ATC',C'AC '                                                    
         DC    C'ATL',C'ATL'                                                    
         DC    C'AUG',C'AUG'                                                    
         DC    C'AUS',C'AUS'                                                    
         DC    C'BAK',C'BAK'                                                    
         DC    C'BAL',C'BAL'                                                    
         DC    C'BAN',C'BME'                                                    
         DC    C'BAT',C'BAT'                                                    
****>    DC    C'BCR',C'BCR'       ADDED 4/17/98 REMOVED 2/28/06                
         DC    C'BCS',C'BRY'                                                    
         DC    C'BEC',C'BEC'                                                    
         DC    C'BEL',C'BEL'       ADDED 9/21/00                                
         DC    C'BIG',C'BLX'                                                    
         DC    C'BIN',C'BNG'                                                    
         DC    C'BIR',C'BIR'                                                    
         DC    C'BIS',C'BIS'                                                    
         DC    C'BLF',C'BLU'       ADDED 2/5/02                                 
         DC    C'BLG',C'BLL'                                                    
         DC    C'BLM',C'BLO'                                                    
         DC    C'BND',C'BND'       ADDED 2/28/06                                
         DC    C'BOI',C'BSC'                                                    
         DC    C'BOS',C'BOS'                                                    
         DC    C'BOW',C'BOW'       ADDED 8/24/00                                
         DC    C'BPA',C'BEA'                                                    
         DC    C'BRG',C'BRU'       ADDED 5/11/99                                
         DC    C'BRI',C'BDP'                                                    
         DC    C'BSU',C'BSU'       ADDED 3/19/99                                
         DC    C'BTC',C'BTL'                                                    
         DC    C'BUF',C'BUF'                                                    
         DC    C'BUR',C'BUR'                                                    
         DC    C'CAN',C'CAN'                                                    
         DC    C'CAS',C'CAS'                                                    
         DC    C'CED',C'CED'                                                    
         DC    C'CHE',C'CHY'                                                    
         DC    C'CHI',C'CHI'                                                    
         DC    C'CHL',C'CHL'                                                    
         DC    C'CHM',C'CHM'                                                    
         DC    C'CHO',C'CHC'                                                    
         DC    C'CHS',C'CRL'                                                    
         DC    C'CHT',C'CKA'                                                    
         DC    C'CHV',C'CVA'                                                    
         DC    C'CHW',C'CWV'                                                    
         DC    C'CIN',C'CIN'                                                    
         DC    C'CLE',C'CLE'                                                    
         DC    C'CLH',C'CLH'       ADDED 1/4/02                                 
         DC    C'CLO',C'CLV'       ADDED 10/03/08                               
         DC    C'CND',C'CND'       ADDED 2/23/05                                
         DC    C'CNJ',C'CNJ'       ADDED 4/17/98                                
         DC    C'COG',C'CMB'                                                    
         DC    C'COM',C'CMO'                                                    
         DC    C'COO',C'CLO'                                                    
         DC    C'COR',C'CC '                                                    
         DC    C'COS',C'CSC'                                                    
         DC    C'CPC',C'CCM'                                                    
         DC    C'CKV',C'CM '       CPM CHANGED TO CKV 9/25/01                   
         DC    C'CSP',C'CSP'                                                    
         DC    C'CSW',C'COM'       ADDED 3/20/00                                
         DC    C'DAL',C'DF '                                                    
         DC    C'DAV',C'RKI'                                                    
         DC    C'DAY',C'DAY'                                                    
         DC    C'DEC',C'DEC'       ADDED 3/20/00                                
         DC    C'DEN',C'DEN'                                                    
         DC    C'DES',C'DMO'                                                    
         DC    C'DET',C'DET'                                                    
         DC    C'DIC',C'DEC'       ADDED 4/19/00                                
         DC    C'DNB',C'DAN'                                                    
         DC    C'DNV',C'DVL'                                                    
         DC    C'DOT',C'DOT'                                                    
         DC    C'DTB',C'DTB'                                                    
         DC    C'DUB',C'DUB'                                                    
         DC    C'DUL',C'DUL'                                                    
         DC    C'ECN',C'ECN'       ADDED 8/24/00                                
         DC    C'ELK',C'ELK'       ADDED 2/28/06                                
         DC    C'ELM',C'ELM'                                                    
         DC    C'ELP',C'ELP'                                                    
         DC    C'ERI',C'ERE'                                                    
         DC    C'EUC',C'EAU'                                                    
         DC    C'EUG',C'EUG'                                                    
         DC    C'EUR',C'EUR'       ADDED 10/02/01                               
         DC    C'EVA',C'EVN'                                                    
         DC    C'FAI',C'FFC'       ADDED 4/17/98                                
         DC    C'FAS',C'FYA'                                                    
         DC    C'FAY',C'FAY'                                                    
         DC    C'FCL',C'FCL'       ADDED 4/17/98                                
         DC    C'FDK',C'FRD'                                                    
         DC    C'FGO',C'FAR'                                                    
         DC    C'FKB',C'FKB'       ADDED 10/02/01                               
         DC    C'FKY',C'FKY'       ADDED 02/13/06                               
         DC    C'FLA',C'FLC'       ADDED 3/20/00                                
         DC    C'FLG',C'FLG'       ADDED 10/17/01                               
         DC    C'FLI',C'FLT'                                                    
         DC    C'FLO',C'FLO'                                                    
         DC    C'FRE',C'FRS'                                                    
         DC    C'FTM',C'FM '                                                    
         DC    C'FTP',C'FP '                                                    
         DC    C'FTS',C'FSM'                                                    
         DC    C'FTW',C'FTW'                                                    
         DC    C'FWL',C'FWB'                                                    
         DC    C'GAI',C'GAN'                                                    
         DC    C'GFL',C'GFL'                                                    
         DC    C'GIK',C'GIK'       ADDED 10/03/08                               
         DC    C'GRB',C'GRB'                                                    
         DC    C'GRF',C'GFK'                                                    
         DC    C'GRJ',C'GJC'                                                    
         DC    C'GRN',C'GNC'                                                    
         DC    C'GRR',C'GRP'                                                    
         DC    C'GRS',C'GVS'                                                    
         DC    C'GWH',C'GWH'                                                    
         DC    C'HAR',C'HRS'                                                    
         DC    C'HCW',C'HAG'                                                    
         DC    C'HSC',C'HSC'       CHANGED 02/15/06 FROM HIH=HSC                
         DC    C'HMR',C'HMR'       ADDED 12/16/05                               
         DC    C'HNB',C'HAT'                                                    
         DC    C'HNH',C'HAT'       ADDED 8/20/98                                
         DC    C'HON',C'HON'                                                    
         DC    C'HOU',C'HOU'                                                    
         DC    C'HSB',C'ABD'                                                    
         DC    C'HTG',C'HUN'                                                    
         DC    C'HTS',C'HTS'       ADDED 10/03/08                               
         DC    C'HUN',C'HNT'                                                    
         DC    C'HVC',C'HVC'       ADDED 9/21/00                                
         DC    C'IND',C'IND'                                                    
         DC    C'ITH',C'ITH'                                                    
         DC    C'JAK',C'JMS'                                                    
         DC    C'JAX',C'JKV'                                                    
         DC    C'JCK',C'JOH'                                                    
         DC    C'JKT',C'JKT'       ADDED 4/17/98                                
         DC    C'JON',C'JON'       ADDED 3/20/00                                
         DC    C'JOP',C'JOP'                                                    
         DC    C'JTN',C'JST'                                                    
         DC    C'KAL',C'KAL'                                                    
         DC    C'KAN',C'KC '                                                    
         DC    C'KIT',C'KIL'                                                    
         DC    C'KNO',C'KNX'                                                    
         DC    C'KSM',C'KSM'       ADDED 2009-07-22                             
         DC    C'LAF',C'LAF'                                                    
         DC    C'LAI',C'LFI'                                                    
         DC    C'LAK',C'LWI'                                                    
         DC    C'LAN',C'LNS'                                                    
         DC    C'LAR',C'LAR'                                                    
         DC    C'LAS',C'LAS'                                                    
         DC    C'LAW',C'LAW'                                                    
         DC    C'LAX',C'LA '                                                    
         DC    C'LEW',C'PSG'       ADDED 8/13/98                                
         DC    C'LEX',C'LEX'                                                    
         DC    C'LHB',C'LAU'                                                    
         DC    C'LIM',C'LMA'                                                    
         DC    C'LIN',C'LIN'                                                    
         DC    C'LIT',C'LRK'                                                    
         DC    C'LKC',C'LCL'                                                    
         DC    C'LNM',C'LNM'       ADDED 10/03/08                               
         DC    C'LOU',C'LOU'                                                    
         DC    C'LRJ',C'LRJ'       ADDED 2/23/05                                
         DC    C'LSP',C'LSP'       ADDED 2/28/06                                
         DC    C'LST',C'LCT'                                                    
         DC    C'LUB',C'LUB'                                                    
         DC    C'LUN',C'LUF'                                                    
         DC    C'LWH',C'LKL'                                                    
         DC    C'MAC',C'MAC'                                                    
         DC    C'MAD',C'MAD'                                                    
         DC    C'MAN',C'MAN'                                                    
         DC    C'MBW',C'MBW'       ADDED 2/28/06                                
         DC    C'MCA',C'MB '                                                    
         DC    C'MCD',C'MRC'                                                    
         DC    C'MCF',C'SVA'       ADDED 1/14/98                                
         DC    C'MCI',C'MAS'       ADDED 3/20/00                                
         DC    C'MCW',C'SVA'                                                    
         DC    C'MDF',C'MDF'       ADDED 10/02/01                               
         DC    C'MED',C'MED'                                                    
         DC    C'MEL',C'MIC'                                                    
         DC    C'MEM',C'MEM'                                                    
         DC    C'MER',C'MER'                                                    
         DC    C'MFH',C'MF '                                                    
         DC    C'MGY',C'MON'                                                    
         DC    C'MID',C'NWB'                                                    
         DC    C'MIL',C'MIL'                                                    
****>    DC    C'MIN',C'MNT'       REMOVED 2/28/06                              
         DC    C'MNK',C'MAK'       ADDED 3/20/00                                
         DC    C'MOB',C'MOB'                                                    
         DC    C'MOD',C'MOD'                                                    
         DC    C'MON',C'MLA'                                                    
         DC    C'MOO',C'MO '                                                    
         DC    C'MOR',C'MOR'                                                    
         DC    C'MSP',C'MIN'                                                    
         DC    C'MSU',C'MSU'       ADDED 12/17/01                               
         DC    C'MUN',C'MUN'       ADDED 02/27/07                               
         DC    C'MUS',C'MUS'                                                    
         DC    C'MYR',C'MRT'                                                    
         DC    C'NAS',C'NAS'                                                    
         DC    C'NBF',C'NB '                                                    
         DC    C'NLN',C'NL '                                                    
         DC    C'NMI',C'NAP'                                                    
         DC    C'NNE',C'NNE'       ADDED 4/17/98                                
         DC    C'NPN',C'NOR'                                                    
         DC    C'NRV',C'BCR'       ADDED 2/28/06                                
         DC    C'NSU',C'NAU'                                                    
         DC    C'NWH',C'NH '                                                    
         DC    C'NWM',C'NWM'                                                    
         DC    C'NWO',C'NOL'                                                    
         DC    C'NYK',C'NY '                                                    
         DC    C'ODM',C'ODM'                                                    
         DC    C'OKL',C'OKC'                                                    
         DC    C'OLN',C'OLN'       ADDED 3/29/04                                
         DC    C'OMA',C'OMH'                                                    
         DC    C'ORL',C'ORL'                                                    
         DC    C'OSH',C'APP'                                                    
         DC    C'OWE',C'OWN'                                                    
         DC    C'OXV',C'OXV'                                                    
         DC    C'PAD',C'PAD'                                                    
         DC    C'PAS',C'PSG'                                                    
         DC    C'PDR',C'PDR'                                                    
         DC    C'PEN',C'PFL'                                                    
         DC    C'PEO',C'PEO'                                                    
         DC    C'PHI',C'PHL'                                                    
         DC    C'PHO',C'PHX'                                                    
         DC    C'PIT',C'PIT'                                                    
         DC    C'PKM',C'PKS'                                                    
         DC    C'PKS',C'KPS'       ADDED 2/28/06                                
         DC    C'PMC',C'PAN'                                                    
         DC    C'POK',C'POU'                                                    
         DC    C'POO',C'PTO'                                                    
         DC    C'POP',C'PTM'                                                    
         DC    C'PRO',C'PRV'                                                    
         DC    C'PSP',C'PS '                                                    
***>     DC    C'PTR',C'PTR'       ADDED 9/14/99  REMOVED 2/28/06               
         DC    C'PTR',C'MNT'       ADDED 2/28/06                                
         DC    C'PUE',C'PBL'                                                    
         DC    C'RAL',C'RAL'                                                    
         DC    C'REA',C'RDG'                                                    
         DC    C'RED',C'RED'                                                    
         DC    C'REN',C'REN'                                                    
         DC    C'RIC',C'RCH'                                                    
         DC    C'RIV',C'RSB'                                                    
         DC    C'RKF',C'ROK'                                                    
         DC    C'RKP',C'RKP'                                                    
         DC    C'RMW',C'RMW'       ADDED 02/13/06                               
         DC    C'ROA',C'RNK'                                                    
         DC    C'ROM',C'RMN'                                                    
         DC    C'RON',C'ROH'                                                    
         DC    C'RPC',C'RAP'                                                    
         DC    C'SAC',C'SAC'                                                    
         DC    C'SAG',C'SAG'                                                    
         DC    C'SAL',C'SOC'                                                    
         DC    C'SAM',C'SAL'                                                    
         DC    C'SAR',C'SAR'                                                    
         DC    C'SAV',C'SAV'                                                    
         DC    C'SBR',C'SBR'       ADDED 8/24/00                                
         DC    C'SCP',C'STC'                                                    
         DC    C'SCT',C'SXC'                                                    
         DC    C'SEA',C'SEA'                                                    
         DC    C'SFL',C'SXF'                                                    
         DC    C'SGC',C'SGC'       ADDED 10/11/01                               
         DC    C'SHB',C'SHB'       ADDED 12/01/03                               
         DC    C'SHR',C'SVP'                                                    
         DC    C'SIL',C'SOU'                                                    
         DC    C'SLC',C'SLC'                                                    
         DC    C'SLK',C'SLK'       ADDED 10/03/08                               
         DC    C'SLO',C'SLO'       *ADDED 2/26/99                               
         DC    C'SML',C'SML'       *ADDED 2/26/99                               
         DC    C'SNA',C'SAT'                                                    
         DC    C'SNC',C'SDN'                                                    
         DC    C'SND',C'SD '                                                    
         DC    C'SNF',C'SF '                                                    
         DC    C'SNJ',C'SJ '                                                    
         DC    C'SNT',C'SAN'                                                    
         DC    C'SOU',C'SBD'                                                    
         DC    C'SPI',C'SIL'                                                    
         DC    C'SPM',C'SMO'                                                    
         DC    C'SPO',C'SPK'                                                    
         DC    C'SPR',C'SCH'                                                    
         DC    C'SSL',C'SSL'        ADDED 2/28/06                               
         DC    C'SSX',C'SUS'       *ADDED 9/09/99                               
         DC    C'STA',C'STF'                                                    
         DC    C'STB',C'SB '                                                    
         DC    C'STC',C'SCD'                                                    
         DC    C'STF',C'SFE'                                                    
         DC    C'STL',C'STL'                                                    
         DC    C'STO',C'STK'                                                    
         DC    C'STR',C'SRO'                                                    
         DC    C'STW',C'SW '                                                    
         DC    C'SYR',C'SYR'                                                    
         DC    C'TAL',C'TAL'                                                    
         DC    C'TAM',C'TAM'                                                    
         DC    C'TER',C'THI'                                                    
         DC    C'TEX',C'TEX'                                                    
         DC    C'TOL',C'TOL'                                                    
         DC    C'TOP',C'TOK'                                                    
         DC    C'TPL',C'TUP'                                                    
         DC    C'TRN',C'TNJ'                                                    
         DC    C'TUC',C'TUC'                                                    
         DC    C'TUL',C'TUL'                                                    
         DC    C'TUS',C'TUS'                                                    
         DC    C'TWF',C'TWF'       ADDED 2008-11-04                             
         DC    C'TYL',C'TYL'                                                    
         DC    C'UTI',C'UTR'                                                    
         DC    C'VAL',C'VAL'       ADDED 02/15/06                               
         DC    C'VIC',C'VIC'                                                    
         DC    C'VTH',C'VIS'                                                    
         DC    C'VTV',C'VTV'       ADDED 7/19/04                                
         DC    C'WAC',C'WCO'                                                    
         DC    C'WAS',C'WAS'                                                    
         DC    C'WAT',C'WAT'                                                    
         DC    C'WAU',C'WAU'                                                    
         DC    C'WBS',C'SCR'                                                    
         DC    C'WCV',C'WCV'       ADDED 4/17/98                                
         DC    C'WEN',C'WEN'       ADDED 2009-03-16                             
         DC    C'WHE',C'WHL'                                                    
         DC    C'WIL',C'WLM'                                                    
         DC    C'WNC',C'WNC'                                                    
         DC    C'WNY',C'WNY'       ADDED 5/29/01                                
         DC    C'WPB',C'WPB'                                                    
         DC    C'WPT',C'WPA'                                                    
         DC    C'WTA',C'WIT'                                                    
         DC    C'WTB',C'WBY'                                                    
         DC    C'WTF',C'WFL'                                                    
         DC    C'WTN',C'WTN'                                                    
         DC    C'WTR',C'WOR'                                                    
         DC    C'YAK',C'YAK'                                                    
         DC    C'YOR',C'YRK'                                                    
         DC    C'YOU',C'YGS'                                                    
         DC    X'FF'                                                            
