*          DATA SET ATXRECD    AT LEVEL 001 AS OF 10/31/02                      
***********************************************************************         
*                                                                     *         
*          ACCOUNTING AND PROD SQL EXTRACT - @TRACKER                 *         
*          EXTRACT RECORD DSECTS BY RECORD TYPE                       *         
*          AVAILABLE RECORD TYPE RANGE - 05100 TO 05199               *         
*                                                                     *         
*DXHDRD    00000  HEADER RECORD (COMMON ACROSS SYSTEMS)               *         
*                                                                     *         
*          SPARE - 05128-05199                                        *         
*                                                                     *         
*DXTRLD    99999  TRAILER RECORD (COMMON ACROSS SYSTEMS)              *         
*                                                                     *         
*        NOTES ON ATXREACT (SEE ATXCTLD)                              *         
*        -----------------                                            *         
*        ATXREACT CONTAINS THE CODE L FOR ALL RECORDS WHEN A LOAD     *         
*        MODE EXTRACT IS PERFORMED. ALL RECORDS IN THE DATABASE WILL  *         
*        BE REPLACED BY THE EXTRACTED FILE.                           *         
*                                                                     *         
*        FOR AN UPDATE MODE EXTRACT, GXRECACT CONTAINS C (CHANGE),    *         
*        A (ADD) OR D (DELETE) FOR ALL RECORDS EXCEPT MONEY RECORDS.  *         
*        MONEY RECORDS CONTAIN M (MERGE). THE CONTENTS OF A MERGED    *         
*        RECORD ARE ADDED TO THE EXISTING RECORD OF THE SAME KEY, OR  *         
*        ADDED AS A NEW RECORD IF THE KEY DOES NOT ALREADY EXIST. IF  *         
*        THE RESULT OF ADDING THE CONTENTS TO AN EXISTING RECORD IS   *         
*        A RECORD WITH ALL ZERO VALUES, IT CAN THEN BE DELETED. FOR   *         
*        AN ADD, ONE POSITIVE MERGE RECORD IS CREATED. FOR A DELETE,  *         
*        AN IDENTICAL RECORD IS CREATED, BUT WITH ALL VALUES NEGATED. *         
*        FOR A CHANGE, TWO RECORDS ARE CREATED - A NEGATIVE DELETE OF *         
*        THE OLD VALUES AND A POSITIVE ADD OF THE NEW VALUES. THESE   *         
*        MAY BE COMBINED IF THE KEYS ARE THE SAME.                    *         
*                                                                     *         
***********************************************************************         
         EJECT                                                                  
       ++INCLUDE DXHDRD                                                         
         EJECT                                                                  
       ++INCLUDE DXTRLD                                                         
         EJECT                                                                  
       ++INCLUDE ATXCTLD                                                        
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION EXTRACT - COMPANY RECORD (05100)                     *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXCPAID DS    CL2     R CHAR      ALPHA AGENCY CODE                            
         DS    C                                                                
ATXCPNAM DS    CL36    R CHAR      COMPANY NAME                                 
         DS    C                                                                
ATXCPGRP DS    CL2     R CHAR      COMPANY GROUP                                
         DS    C                                                                
ATXCPLDG DS    CL1     R CHAR      ISLEDGERSECURITY                             
         DS    C                                                                
ATXCPOFF DS    CL1     R CHAR      ISOFFICESECURITY                             
         DS    C                                                                
ATXCPAD1 DS    CL26    R CHAR      ADDRESS 1                                    
         DS    C                                                                
ATXCPALQ EQU   *-ATXCPAD1          LENGTH OF EACH ADDRESS LINE                  
ATXCPAD2 DS    CL26    O CHAR      ADDRESS 2                                    
         DS    C                                                                
ATXCPAD3 DS    CL26    O CHAR      ADDRESS 3                                    
         DS    C                                                                
ATXCPAD4 DS    CL26    O CHAR      ADDRESS 4                                    
*                                                                               
ATXCPYX  DS    CL2                 RECORD END                                   
ATXCPYL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION EXTRACT - ACCOUNT GROUP RECORD (05110)               *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
ATXAGAID DS    CL2     R CHAR      AGENCY ALPHA ID                              
         DS    C                                                                
ATXAGRGT DS    CL1     R CHAR      ACCOUNTGROUP TYPE                            
         DS    C                                                                
ATXAGRGC DS    CL3     R CHAR      ACCOUNTGROUP CODE                            
         DS    C                                                                
ATXAGRNM DS    CL36    R CHAR      ACCOUNTGROUP NAME                            
         DS    C                                                                
ATXAGROF DS    CL2     R CHAR      OFFICE                                       
*                                                                               
ATXAGRX  DS    CL2                 RECORD END                                   
ATXAGRL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION EXTRACT - CLIENT RECORD (05101)                      *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXCLAID DS    CL2     R CHAR      AGENCY ALPHA ID                              
         DS    C                                                                
ATXCLCLI DS    CL6     R CHAR      CLIENT CODE                                  
         DS    C                                                                
ATXCLNAM DS    CL36    R CHAR      CLIENT NAME                                  
         DS    C                                                                
ATXCLF1  DS    CL1     R CHAR      FILTER 1                                     
         DS    C                                                                
ATXCLF2  DS    CL1     R CHAR      FILTER 2                                     
         DS    C                                                                
ATXCLF3  DS    CL1     R CHAR      FILTER 3                                     
         DS    C                                                                
ATXCLF4  DS    CL1     R CHAR      FILTER 4                                     
         DS    C                                                                
ATXCLF5  DS    CL1     R CHAR      FILTER 5                                     
         DS    C                                                                
ATXCLOFC DS    CL2     R CHAR      OFFICE CODE                                  
         DS    C                                                                
ATXCLRAC DS    CL14    R CHAR      RECEIVE ACCOUNT CODE                         
         DS    C                                                                
ATXCLCAC DS    CL14    R CHAR      COSTING ACCOUNT CODE                         
         DS    C                                                                
ATXCLAG1 DS    CL3     R CHAR      ACCOUNT GROUP 1                              
         DS    C                                                                
ATXCLAG2 DS    CL3     R CHAR      ACCOUNT GROUP 2                              
         DS    C                                                                
ATXCLIL  DS    CL1     R CHAR      ACCOUNT LOCKED                               
         DS    C                                                                
ATXCLENP DS    CL1     R CHAR      EXCUDE FROM NEW PRODUCTION                   
         DS    C                                                                
ATXCLBA1 DS    CL26    R CHAR      BILLING ADDRESS 1                            
         DS    C                                                                
ATXCLBLQ EQU   *-ATXCLBA1          LENGTH OF EACH ADDRESS LINE                  
ATXCLBA2 DS    CL26    O CHAR      BILLING ADDRESS 2                            
         DS    C                                                                
ATXCLBA3 DS    CL26    O CHAR      BILLING ADDRESS 3                            
         DS    C                                                                
ATXCLBA4 DS    CL26    O CHAR      BILLING ADDRESS 4                            
         DS    C                                                                
ATXCLPOB DS    CL50    O CHAR      PRINT ON BILL                                
         DS    C                                                                
*&&US                                                                           
ATXCLCDT DS    CL10    O DATE      CREATE DATE                                  
*&&                                                                             
*&&UK                                                                           
ATXCLCDT DS    CL8     O DATE      CREATE DATE                                  
*&&                                                                             
*                                                                               
ATXCLIX  DS    CL2                 RECORD END                                   
ATXCLILN EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION EXTRACT - PRODUCT RECORD (05102)                     *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXPRAID DS    CL2     R CHAR      AGENCY ALPHA ID                              
         DS    C                                                                
ATXPRCLI DS    CL6     R CHAR      CLIENT CODE                                  
         DS    C                                                                
ATXPRPRO DS    CL6     R CHAR      PRODUCT CODE                                 
         DS    C                                                                
ATXPRNAM DS    CL36    R CHAR      PRODUCT NAME                                 
         DS    C                                                                
ATXPRF1  DS    CL1     R CHAR      FILTER 1                                     
         DS    C                                                                
ATXPRF2  DS    CL1     R CHAR      FILTER 2                                     
         DS    C                                                                
ATXPRF3  DS    CL1     R CHAR      FILTER 3                                     
         DS    C                                                                
ATXPRF4  DS    CL1     R CHAR      FILTER 4                                     
         DS    C                                                                
ATXPRF5  DS    CL1     R CHAR      FILTER 5                                     
         DS    C                                                                
ATXPROFC DS    CL2     R CHAR      OFFICE CODE                                  
         DS    C                                                                
ATXPRCAC DS    CL14    R CHAR      COSTING ACCOUNT CODE                         
         DS    C                                                                
ATXPRRAC DS    CL14    R CHAR      RECEIVABLE ACCOUNT CODE                      
         DS    C                                                                
ATXPRAG1 DS    CL3     R CHAR      ACCOUNT GROUP 1                              
         DS    C                                                                
ATXPRAG2 DS    CL3     R CHAR      ACCOUNT GROUP 2                              
         DS    C                                                                
ATXPRIL  DS    CL1     R CHAR      ACCOUNT LOCKED                               
         DS    C                                                                
ATXPRENP DS    CL1     R CHAR      EXCUDE FROM NEW PRODUCTION                   
         DS    C                                                                
ATXPRBA1 DS    CL26    O CHAR      BILLING ADDRESS 1                            
         DS    C                                                                
ATXPRBLQ EQU   *-ATXPRBA1          LENGTH OF EACH ADDRESS LINE                  
ATXPRBA2 DS    CL26    O CHAR      BILLING ADDRESS 2                            
         DS    C                                                                
ATXPRBA3 DS    CL26    O CHAR      BILLING ADDRESS 3                            
         DS    C                                                                
ATXPRBA4 DS    CL26    O CHAR      BILLING ADDRESS 4                            
         DS    C                                                                
ATXPRPOB DS    CL50    O CHAR      PRINT ON BILL                                
         DS    C                                                                
*&&US                                                                           
ATXPRCDT DS    CL10    O DATE      CREATE DATE                                  
*&&                                                                             
*&&UK                                                                           
ATXPRCDT DS    CL8     O DATE      CREATE DATE                                  
*&&                                                                             
*                                                                               
ATXPRDX  DS    CL2                 RECORD END                                   
ATXPRDL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION EXTRACT - JOB RECORD (05103)                         *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXJBAID DS    CL2     R CHAR      AGENCY ALPHA ID                              
         DS    C                                                                
ATXJBCLI DS    CL6     R CHAR      CLIENT CODE                                  
         DS    C                                                                
ATXJBPRO DS    CL6     R CHAR      PRODUCT CODE                                 
         DS    C                                                                
ATXJBJOB DS    CL6     R CHAR      JOB CODE                                     
         DS    C                                                                
ATXJBNAM DS    CL36    R CHAR      NAME                                         
         DS    C                                                                
ATXJBF1  DS    CL1     R CHAR      FILTER 1                                     
         DS    C                                                                
ATXJBF2  DS    CL1     R CHAR      FILTER 2                                     
         DS    C                                                                
ATXJBF3  DS    CL1     R CHAR      FILTER 3                                     
         DS    C                                                                
ATXJBF4  DS    CL1     R CHAR      FILTER 4                                     
         DS    C                                                                
ATXJBF5  DS    CL1     R CHAR      FILTER 5                                     
         DS    C                                                                
*&&US                                                                           
ATXJBOD  DS    CL10    O DATE      OPEN DATE                                    
*&&                                                                             
*&&UK                                                                           
ATXJBOD  DS    CL8     O DATE      OPEN DATE                                    
*&&                                                                             
         DS    C                                                                
*&&US                                                                           
ATXJBCD  DS    CL10    O DATE      CLOSE DATE                                   
*&&                                                                             
*&&UK                                                                           
ATXJBCD  DS    CL8     O DATE      CLOSE DATE                                   
*&&                                                                             
         DS    C                                                                
ATXJBSTA DS    CL3     R CHAR      STATUS                                       
         DS    C                                                                
ATXJBIRA DS    CL1     R CHAR      IS RATE ADJUSTED                             
         DS    C                                                                
ATXJBIWO DS    CL1     R CHAR      IS WRITE OFF                                 
         DS    C                                                                
ATXJBOFC DS    CL2     R CHAR      OFFICE CODE                                  
         DS    C                                                                
ATXJBCAC DS    CL14    R CHAR      COSTING ACCOUNT CODE                         
         DS    C                                                                
ATXJBRAC DS    CL14    R CHAR      RECEIVABLE ACCOUNT CODE                      
         DS    C                                                                
ATXJBAG1 DS    CL3     R CHAR      ACCOUNT GROUP 1                              
         DS    C                                                                
ATXJBAG2 DS    CL3     R CHAR      ACCOUNT GROUP 2                              
         DS    C                                                                
ATXJBBA1 DS    CL26    R CHAR      BILLING ADDRESS 1                            
         DS    C                                                                
ATXJBBLQ EQU   *-ATXJBBA1          LENGTH OF EACH ADDRESS LINE                  
ATXJBBA2 DS    CL26    O CHAR      BILLING ADDRESS 2                            
         DS    C                                                                
ATXJBBA3 DS    CL26    O CHAR      BILLING ADDRESS 3                            
         DS    C                                                                
ATXJBBA4 DS    CL26    O CHAR      BILLING ADDRESS 4                            
         DS    C                                                                
ATXJBBA5 DS    CL26    O CHAR      BILLING ADDRESS 5                            
         DS    C                                                                
ATXJBPOB DS    CL50    R CHAR      PRINT ON BILL                                
         DS    C                                                                
ATXJBOI1 DS    CL50    R CHAR      OTHER INFO LINE 1                            
         DS    C                                                                
ATXJBOLQ EQU   *-ATXJBOI1          LENGTH OF EACH OTHER INFO LINE               
ATXJBOI2 DS    CL50    R CHAR      OTHER INFO LINE 2                            
         DS    C                                                                
ATXJBOI3 DS    CL50    R CHAR      OTHER INFO LINE 3                            
         DS    C                                                                
ATXJBTSH DS    CL1     R CHAR      TIME SHEET                                   
         DS    C                                                                
ATXJBENP DS    CL1     R CHAR      EXCUDE FROM NEW PRODUCTION                   
         DS    C                                                                
ATXJBCL1 DS    XL2                 COMMENTS 1 LENGTH                            
ATXJBCM1 DS    CL60    R VARCHAR   COMMENTS 1                                   
         DS    C                                                                
ATXJBCL2 DS    XL2                 COMMENTS 2 LENGTH                            
ATXJBCM2 DS    CL60    R VARCHAR   COMMENTS 2                                   
         DS    C                                                                
ATXJBCL3 DS    XL2                 COMMENTS 3 LENGTH                            
ATXJBCM3 DS    CL60    R VARCHAR   COMMENTS 3                                   
         DS    C                                                                
ATXJBCRT DS    CL9     R CHAR      CREATOR                                      
         DS    C                                                                
*&&US                                                                           
ATXJBCDT DS    CL10    O DATE      CREATE DATE                                  
*&&                                                                             
*&&UK                                                                           
ATXJBCDT DS    CL8     O DATE      CREATE DATE                                  
*&&                                                                             
*                                                                               
ATXJOBX  DS    CL2                 RECORD END                                   
ATXJOBL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION EXTRACT - MEDIA RECORD (05104)                       *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXMDAID DS    CL2     R CHAR      AGENCY ALPHA ID                              
         DS    C                                                                
ATXMDMCD DS    CL1     R CHAR      MEDIA CODE                                   
         DS    C                                                                
ATXMDMDS DS    CL12    R CHAR      MEDIA DESCRIPTION                            
         DS    C                                                                
ATXMDGRP DS    CL1     R CHAR      MEDIA GROUP                                  
         DS    C                                                                
ATXMNAM  DS    CL38    R CHAR      MEDIA NAME (LONG)                            
         DS    C                                                                
ATXMDAN1 DS    CL1     R CHAR      ANALYSIS CODE                                
         DS    C                                                                
ATXMDIXA DS    CL14    R CHAR      INC. ACC. EXT. ACCOUNT (U/L/A)               
         DS    C                                                                
ATXMDV1A DS    CL14    R CHAR      VAT 1 ACC. ACCOUNT (U/L/A)                   
         DS    C                                                                
ATXMDFNM DS    CL36    R CHAR      FOREIGN NAME                                 
         DS    C                                                                
ATXMDFLN DS    CL13    R CHAR      FOREIGN LANGUAGE                             
         DS    C                                                                
ATXMDAN2 DS    CL1     R CHAR      ANALYSIS CODE 2                              
         DS    C                                                                
ATXMDIIA DS    CL14    R CHAR      INC. ACC. INT. ACCOUNT (U/L/A)               
         DS    C                                                                
ATXMDV2A DS    CL14    R CHAR      VAT 2 ACC. ACCOUNT (U/L/A)                   
*                                                                               
ATXMEDX  DS    CL2                 RECORD END                                   
ATXMEDL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION EXTRACT - MEDIA GROUP RECORD (05105)                 *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXMGAID DS    CL2     R CHAR      AGENCY ALPHA ID                              
         DS    C                                                                
ATXMGGC  DS    CL1     R CHAR      MEDIA GROUP CODE                             
         DS    C                                                                
ATXMGNAM DS    CL36    R CHAR      MEDIA GROUP NAME                             
*                                                                               
ATXMDGX  DS    CL2                 RECORD END                                   
ATXMDGL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION EXTRACT - TASK CODE RECORD (05106)                   *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXWKAID DS    CL2      R CHAR     AGENCY ALPHA ID                              
         DS    C                                                                
ATXWKLDG DS    CL2      R CHAR     LEDGER (U/L)                                 
         DS    C                                                                
ATXWKWRK DS    CL2      R CHAR     TASK CODE                                    
         DS    C                                                                
ATXWKDES DS    CL15     R CHAR     TASK CODE DES                                
         DS    C                                                                
ATXWKNAM DS    CL36     R CHAR     EXTRA NAME (LONG)                            
         DS    C                                                                
ATXWKIC  DS    CL1      R CHAR     IS COMMISIONABLE                             
         DS    C                                                                
ATXWKIA  DS    CL1      R CHAR     IS ACTIVE                                    
         DS    C                                                                
ATXWKIRA DS    CL1      R CHAR     IS RATE ADJUSTABLE                           
         DS    C                                                                
ATXWKIFT DS    CL1      R CHAR     IS FOR TIME                                  
         DS    C                                                                
ATXWKWGR DS    CL1      R CHAR     TASK CODE GROUP                              
         DS    C                                                                
ATXWKINT DS    CL1      R CHAR     INTERNAL                                     
         DS    C                                                                
ATXWKEXT DS    CL1      R CHAR     EXTERNAL                                     
*                                                                               
ATXWKCX  DS    CL2                 RECORD END                                   
ATXWKCL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION EXTRACT - SUB-TASK CODE RECORD (05111)               *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXSWAID DS    CL2      R CHAR     AGENCY ALPHA ID                              
         DS    C                                                                
ATXSWLDG DS    CL2      R CHAR     LEDGER                                       
         DS    C                                                                
ATXSWCWC DS    CL2      R CHAR     TASK CODE                                    
         DS    C                                                                
ATXSWCRF DS    CL2      R CHAR     SUB-TASK CODE REFERENCE                      
         DS    C                                                                
ATXSWCLG DS    CL3      R CHAR     SUB-TASK CODE LANGUAGE                       
         DS    C                                                                
ATXSWCDS DS    CL30     R CHAR     SUB-TASK CODE DESCRIPTION                    
*                                                                               
ATXSWCX  DS    CL2                 RECORD END                                   
ATXSWCL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION EXTRACT - TASK CODE GROUP RECORD (05107)             *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXWGAID DS    CL2      R CHAR     AGENCY ALPHA ID                              
         DS    C                                                                
ATXWGLDG DS    CL2      R CHAR     LEDGER (U/L)                                 
         DS    C                                                                
ATXWGCDE DS    CL1      R CHAR     TASK CODE GROUP CODE                         
         DS    C                                                                
ATXWGNAM DS    CL36     R CHAR     TASK CODE GROUP NAME                         
*                                                                               
ATXWCGX  DS    CL2                 RECORD END                                   
ATXWCGL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION EXTRACT - PRODUCTION OFFICE RECORD (05108)           *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXPFAID DS    CL2      R CHAR     AGENCY ALPHA ID                              
         DS    C                                                                
ATXPOFOC DS    CL2      R CHAR     PRODUCTION OFFICE CODE                       
         DS    C                                                                
ATXPOFGC DS    CL1      R CHAR     PRODUCTION OFFICE GROUP CODE                 
         DS    C                                                                
ATXPOFNM DS    CL36     R CHAR     PRODUCTION OFFICE NAME                       
*                                                                               
ATXPOFX  DS    CL2                 RECORD END                                   
ATXPOFL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION EXTRACT - PRODUCTION OFFICE GROUP RECORD (05109)     *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXOGAID DS    CL2      R CHAR     AGENCY ALPHA ID                              
         DS    C                                                                
ATXOGRGC DS    CL1      R CHAR     PRODUCTION OFFICE GROUP CODE                 
         DS    C                                                                
ATXOGRNM DS    CL36     R CHAR     PRODUCTION OFFICE NAME                       
*                                                                               
ATXOGRX  DS    CL2                 RECORD END                                   
ATXOGRL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
*  NEW PRODUCTION EXTRACT - PRODUCTION OFFICE LIST RECORD (05112)     *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXOLAID DS    CL2      R CHAR     AGENCY ALPHA ID                              
         DS    C                                                                
ATXOFFLC DS    CL2      R CHAR     PRODUCTION OFFICE LIST CODE                  
         DS    C                                                                
ATXOFLSC DS    CL1      R CHAR     PRODUCTION OFFICE LIST SUB CODE              
         DS    C                                                                
ATXOFLNM DS    CL36     R CHAR     PRODUCTION OFFICE LIST NAME                  
*                                                                               
ATXOFLX  DS    CL2                 RECORD END                                   
ATXOFLL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION EXTRACT - PRODUCTION OFFICE LIST ENTRY RECORD (05113)*         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXOEAID DS    CL2      R CHAR     AGENCY ALPHA ID                              
         DS    C                                                                
ATXOFLEC DS    CL2      R CHAR     PRODUCTION OFFICE LIST CODE                  
         DS    C                                                                
ATXOLESC DS    CL1      R CHAR     PRODUCTION OFFICE LIST SUB CODE              
         DS    C                                                                
ATXOLEOC DS    CL2      R CHAR     PRODUCTION OFFICE CODE                       
*                                                                               
ATXOLEX  DS    CL2                 RECORD END                                   
ATXOLEL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION EXTRACT - 1R OFFICE RECORD (05114)                   *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXOFAID DS    CL2      R CHAR     AGENCY ALPHA ID                              
         DS    C                                                                
ATXOFFOC DS    CL2      R CHAR     PRODUCTION OFFICE CODE                       
         DS    C                                                                
ATXOFFNM DS    CL36     R CHAR     PRODUCTION OFFICE NAME                       
         DS    C                                                                
ATXOFFIL DS    CL1      R CHAR     ISLOCKED                                     
         DS    C                                                                
ATXOFFGC DS    CL1      R CHAR     PRODUCTION OFFICE GROUP CODE                 
*                                                                               
ATXOFFX  DS    CL2                 RECORD END                                   
ATXOFFL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION EXTRACT - 1R DEPARTMENT RECORD (05115)               *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXDPAID DS    CL2      R CHAR     COMPANY CODE                                 
         DS    C                                                                
ATXDPOFC DS    CL2      R CHAR     OFFICE CODE                                  
         DS    C                                                                
ATXDPDEC DS    CL6      R CHAR     DEPARTMENT CODE                              
         DS    C                                                                
ATXDPNAM DS    CL36     R CHAR     NAME                                         
         DS    C                                                                
ATXDPANC DS    CL1      R CHAR     ANALYSIS CODE                                
         DS    C                                                                
ATXDPIL  DS    CL1      R CHAR     ACCOUNT LOCKED                               
*                                                                               
ATXDEPX  DS    CL2                 RECORD END                                   
ATXDEPL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION EXTRACT - 1R SUB-DEPARTMENT RECORD (05116)           *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXSDAID DS    CL2      R CHAR     COMPANY CODE                                 
         DS    C                                                                
ATXSDOFC DS    CL2      R CHAR     OFFICE CODE                                  
         DS    C                                                                
ATXSDDEC DS    CL6      R CHAR     DEPARTMENT CODE                              
         DS    C                                                                
ATXSDSDC DS    CL6      R CHAR     SUB - DEPARTMENT CODE                        
         DS    C                                                                
ATXSDNAM DS    CL36     R CHAR     SUB - DEPARTMENT NAME                        
         DS    C                                                                
ATXSDIL  DS    CL1      R CHAR     ACCOUNT LOCKED                               
*                                                                               
ATXSDPX  DS    CL2                 RECORD END                                   
ATXSDPL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION SYSTEM EXTRACT - PERSON RECORD (05117)               *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXPEAID DS    CL2     R CHAR      COMPANY CODE                                 
         DS    C                                                                
ATXPECSC DS    CL5     R INTEGER   CONSYSPERCODE                                
         DS    C                                                                
ATXPEPC  DS    CL8     R CHAR      PERSON CODE                                  
         DS    C                                                                
ATXPEP   DS    CL9     R CHAR      PERSON (I + PERSON CODE)                     
         DS    C                                                                
ATXPELN  DS    CL36    R CHAR      LAST NAME                                    
         DS    C                                                                
ATXPEFN  DS    CL36    R CHAR      FIRST NAME                                   
         DS    C                                                                
*&&US                                                                           
ATXPEHDT DS    CL10    R DATE      HIRE DATE                                    
*&&                                                                             
*&&UK                                                                           
ATXPEHDT DS    CL8     R DATE      HIRE DATE                                    
*&&                                                                             
         DS    C                                                                
*&&US                                                                           
ATXPETDT DS    CL10    O DATE      TERMINATION DATE                             
*&&                                                                             
*&&UK                                                                           
ATXPETDT DS    CL8     O DATE      TERMINATION DATE                             
*&&                                                                             
*                                                                               
ATXPERX  DS    CL2                 RECORD END                                   
ATXPERL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION SYSTEM EXTRACT - PERSON ASSIGNMENT RECORD (05118)    *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXPAAID DS    CL2      R CHAR     COMPANY CODE                                 
         DS    C                                                                
ATXPAPC  DS    CL8      R CHAR     PERSON CODE                                  
         DS    C                                                                
ATXPACSC DS    CL5      R CHAR     CONSYSPERCODE                                
         DS    C                                                                
*&&US                                                                           
ATXPASTD DS    CL10     R DATE     START DATE                                   
*&&                                                                             
*&&UK                                                                           
ATXPASTD DS    CL8      R DATE     START DATE                                   
*&&                                                                             
         DS    C                                                                
*&&US                                                                           
ATXPAEND DS    CL10     O DATE     END DATE                                     
*&&                                                                             
*&&UK                                                                           
ATXPAEND DS    CL8      O DATE     END DATE                                     
*&&                                                                             
         DS    C                                                                
ATXPAOFC DS    CL2      R CHAR     OFFICE CODE                                  
         DS    C                                                                
ATXPADEC DS    CL6      R CHAR     DEPARTMENT CODE                              
         DS    C                                                                
ATXPASDC DS    CL6      R CHAR     SUB DEPARTMENT CODE                          
         DS    C                                                                
ATXPAATT DS    CL3      R CHAR     LOCATTR                                      
         DS    C                                                                
ATXPASTA DS    CL3      R CHAR     LOCSTAT                                      
*                                                                               
ATXPEAX  DS    CL2                 RECORD END                                   
ATXPEAL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION SYSTEM EXTRACT - COSTING ACCOUNT RECORD (05119)      *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXCSAID DS    CL2      R CHAR     COMPANY CODE                                 
         DS    C                                                                
ATXCSACC DS    CL14     R CHAR     COSTING ACCOUNT CODE                         
         DS    C                                                                
ATXCSNAM DS    CL36     R CHAR     COSTING ACCOUNT NAME                         
         DS    C                                                                
ATXCSIL  DS    CL1      R CHAR     ACCOUNT LOCKED                               
*                                                                               
ATXCSAX  DS    CL2                 RECORD END                                   
ATXCSAL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION SYSTEM EXTRACT - LEDGER RECORD (05120)               *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXLEAID DS    CL2      R CHAR     COMPANY CODE                                 
         DS    C                                                                
ATXLELC  DS    CL2      R CHAR     LEDGER CODE                                  
         DS    C                                                                
ATXLENAM DS    CL36     R CHAR     NAME                                         
         DS    C                                                                
ATXLEDSL DS    CL5      R CHAR     SECURITY LEVEL                               
*                                                                               
ATXLEDX  DS    CL2                 RECORD END                                   
ATXLEDL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION SYSTEM EXTRACT - LEDGER STRUCTURE RECORD (05121)     *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXLSAID DS    CL2      R CHAR     COMPANY CODE                                 
         DS    C                                                                
ATXLSLC  DS    CL2      R CHAR     LEDGER CODE                                  
         DS    C                                                                
ATXLSNUM DS    CL3      R CHAR     LEVEL NUMBER                                 
         DS    C                                                                
ATXLSNAM DS    CL15     R CHAR     LEVEL NAME                                   
         DS    C                                                                
ATXLSLLN DS    CL3      R CHAR     LEVEL LENGTH                                 
*                                                                               
ATXLESX  DS    CL2                 RECORD END                                   
ATXLESL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION SYSTEM EXTRACT - OPTION RECORD (05122)               *         
***********************************************************************         
*        SPACE 1                                                                
*ATXRECD  DSECT                                                                 
*         ORG   ATXREDET                                                        
*         SPACE 1                                                               
*ATXOPAID DS    CL2     R CHAR      COMPANY CODE                                
*         DS    C                                                               
*ATXOPOGC DS    CL1     R CHAR      OFFICE GROUP CODE                           
*         DS    C                                                               
*ATXOPOFC DS    CL2     R CHAR      OFFICE CODE                                 
*         DS    C                                                               
*ATXOPCLI DS    CL6     R CHAR      CLIENT CODE                                 
*         DS    C                                                               
*ATXOPPRO DS    CL6     R CHAR      PRODUCT CODE                                
*         DS    C                                                               
*ATXOPMGC DS    CL1     R CHAR      MEDIA GROUP CODE                            
*         DS    C                                                               
*ATXOPMCD DS    CL1     R CHAR      MEDIA CODE                                  
*         DS    C                                                               
*ATXOPJOB DS    CL7     R CHAR      JOB CODE                                    
*                                                                               
*ATXOPTX  DS    CL2                 RECORD END                                  
*ATXOPTL  EQU   *-ATXRECD           RECORD LENGTH                               
*         EJECT                                                                 
***********************************************************************         
* NEW PRODUCTION SYSTEM EXTRACT - STANDARD COMMENT RECORD (05123)     *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXSTAID DS    CL2      R CHAR     COMPANY CODE                                 
         DS    C                                                                
ATXSTCCD DS    CL6      R CHAR     STANDARD COMMENT CODE                        
         DS    C                                                                
ATXSTCCM DS    CL30     R CHAR     STANDARD COMMENT                             
*                                                                               
ATXSTCX  DS    CL2                 RECORD END                                   
ATXSTCL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION SYSTEM EXTRACT - USERFIELD RECORD RECORD (05124)     *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXUSAID DS    CL2     R CHAR      COMPANY CODE                                 
         DS    C                                                                
ATXUSLDG DS    CL2     R CHAR      LEDGER CODE                                  
         DS    C                                                                
ATXUSOFG DS    CL1     R CHAR      OFFICE GROUP                                 
         DS    C                                                                
ATXUSOFF DS    CL2     R CHAR      OFFICE                                       
         DS    C                                                                
ATXUSCLI DS    CL6     R CHAR      CLIENT                                       
         DS    C                                                                
ATXUSPRO DS    CL6     R CHAR      PRODUCT                                      
         DS    C                                                                
ATXUSMDG DS    CL1     R CHAR      MEDIA GROUP                                  
         DS    C                                                                
ATXUSMED DS    CL1     R CHAR      MEDIA                                        
         DS    C                                                                
ATXUSJOB DS    CL6     R CHAR      JOB                                          
         DS    C                                                                
ATXUSSEQ DS    CL3     R SINT      SEQUENCE                                     
         DS    C                                                                
ATXUSFLD DS    CL2     R CHAR      FIELD                                        
         DS    C                                                                
ATXUSNAM DS    CL12    R CHAR      NAME                                         
         DS    C                                                                
ATXUSERL DS    CL1     R CHAR      EDIT RULE                                    
         DS    C                                                                
ATXUSMXL DS    CL3     R SINT      MAX LENGTH                                   
         DS    C                                                                
ATXUSISR DS    CL1     R CHAR      IS REQUIRED                                  
         DS    C                                                                
*&&US                                                                           
ATXUSCDT DS    CL10    O DATE      CUTOFF DATE                                  
*&&                                                                             
*&&UK                                                                           
ATXUSCDT DS    CL8     O DATE      CUTOFF DATE                                  
*&&                                                                             
*                                                                               
ATXUSRX  DS    CL2                 RECORD END                                   
ATXUSRL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION SYSTEM EXTRACT - JOB USERFIELD RECORD RECORD (05125) *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXJUAID DS    CL2     R CHAR      COMPANY CODE                                 
         DS    C                                                                
ATXJUCLI DS    CL6     R CHAR      CLIENT                                       
         DS    C                                                                
ATXJUPRO DS    CL6     R CHAR      PRODUCT                                      
         DS    C                                                                
ATXJUJOB DS    CL6     R CHAR      JOB                                          
         DS    C                                                                
ATXJUFLD DS    CL2     R CHAR      FIELD                                        
         DS    C                                                                
ATXJUCON DS    CL30    R CHAR      CONTENTS                                     
*                                                                               
ATXJUFX  DS    CL2                 RECORD END                                   
ATXJUFL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION SYSTEM EXTRACT - CONTROL AGENCY RECORD (05126)       *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXCAAID DS    CL2     R CHAR      CONTROL AGENCY ID                            
         DS    C                                                                
ATXCASEC DS    CL2     R CHAR      SECURITY AGENCY ID                           
*                                                                               
ATXCAGX  DS    CL2                 RECORD END                                   
ATXCAGL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* NEW PRODUCTION SYSTEM EXTRACT - CONTROL PERSON RECORD (05127)       *         
***********************************************************************         
         SPACE 1                                                                
ATXRECD  DSECT                                                                  
         ORG   ATXREDET                                                         
         SPACE 1                                                                
ATXCPSID DS    CL2     R CHAR      SECURITY AGENCY ID                           
         DS    C                                                                
ATXCPCSC DS    CL5     R INT       CONSYSPERCODE                                
         DS    C                                                                
*&&US                                                                           
ATXCPEFD DS    CL10    R DATE      EFFECTIVE DATE                               
*&&                                                                             
*&&UK                                                                           
ATXCPEFD DS    CL8     R DATE      EFFECTIVE DATE                               
*&&                                                                             
         DS    C                                                                
ATXCPEIL DS    XL2                 EMAIL ID LENGTH                              
ATXCPEID DS    CL255   R VARCH     EMAIL ID                                     
*                                                                               
ATXCPEX  DS    CL2                 RECORD END                                   
ATXCPEL  EQU   *-ATXRECD           RECORD LENGTH                                
         EJECT                                                                  
