*          DATA SET AXRECD     AT LEVEL 036 AS OF 04/30/10                      
       ++INCLUDE DXHDRD                                                         
         EJECT                                                                  
       ++INCLUDE DXTRLD            TRAILER                                      
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - GENERAL ACCOUNT RECORD                       *         
***********************************************************************         
         SPACE 1                                                                
AXGEND   DSECT                     GENERAL ACCOUNT RECORD                       
AXGENLEN DS    CL4                 RECORD LENGTH                                
AXGENTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXGENACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXGENDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXGENTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXGENCCD DS    CL2                 COMPANY CODE                                 
*                                                                               
AXGENDX  DS    CL2                 RECORD END                                   
AXGENDL  EQU   *-AXGEND            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - ADJUSTED RATE                        (05003) *         
***********************************************************************         
         SPACE 1                                                                
AXADRD   DSECT                     TRANSACTION RECORD                           
AXADRLEN DS    CL4                 RECORD LENGTH                                
AXADRTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXADRACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXADRDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXADRTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
AXADRCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXADRHST DS    CL30                HOST KEY                                     
         DS    C                                                                
AXADRCOC DS    CL2                 CLIENT OFFICE CODE                           
         DS    C                                                                
AXADRCLI DS    CL5                 CLIENT CODE                                  
         DS    C                                                                
AXADRPRO DS    CL3                 PRODUCT CODE                                 
         DS    C                                                                
AXADRJOB DS    CL7                 JOB CODE                                     
         DS    C                                                                
AXADRPOC DS    CL2                 PERSON OFFICE CODE                           
         DS    C                                                                
AXADRDPT DS    CL6                 DEPARTMENT CODE                              
         DS    C                                                                
AXADRSBD DS    CL6                 SUB-DEPARTMENT CODE                          
         DS    C                                                                
AXADRCSP DS    CL8                 STAFF CODE                                   
         DS    C                                                                
AXADRTSK DS    CL2                 TASK CODE                                    
         DS    C                                                                
AXADRDTE DS    CL8                 EFFECTIVE DATE                               
         DS    C                                                                
AXADRPCT DS    CL10                PERCENT                                      
AXADRDX  DS    CL2                 RECORD END                                   
AXADRDL  EQU   *-AXADRD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - CALENDAR                             (05004) *         
***********************************************************************         
         SPACE 1                                                                
AXCALD   DSECT                     CALENDAR RECORD                              
AXCALLEN DS    CL4                 RECORD LENGTH                                
AXCALTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXCALACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXCALDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXCALTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXCALCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXCALOFC DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
AXCALEYC DS    CL4                 END YEAR MONTH                               
         DS    C                                                                
AXCALSYC DS    CL4                 START YEAR MONTH                             
AXCALDX  DS    CL2                 RECORD END                                   
AXCALDL  EQU   *-AXCALD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - CLIENT                               (05005) *         
***********************************************************************         
         SPACE 1                                                                
AXCLID   DSECT                     CLIENT RECORD                                
AXCLILEN DS    CL4                 RECORD LENGTH                                
AXCLITYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXCLIACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXCLIDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXCLITME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXCLICCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXCLICLC DS    CL5                 CLIENT CODE                                  
         DS    C                                                                
AXCLINAM DS    CL36                CLIENT NAME                                  
         DS    C                                                                
AXCLIF1  DS    CL1                 FILTER 1                                     
         DS    C                                                                
AXCLIF2  DS    CL1                 FILTER 2                                     
         DS    C                                                                
AXCLIF3  DS    CL1                 FILTER 3                                     
         DS    C                                                                
AXCLIF4  DS    CL1                 FILTER 4                                     
         DS    C                                                                
AXCLIF5  DS    CL1                 FILTER 5                                     
         DS    C                                                                
AXCLIOFC DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
AXCLICAC DS    CL12                COSTING ACCOUNT CODE                         
         DS    C                                                                
AXCLILCK DS    CL1                 ACCOUNT LOCKED                               
AXCLIDX  DS    CL2                 RECORD END                                   
AXCLIDL  EQU   *-AXCLID            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - COMPANY                              (05006) *         
***********************************************************************         
         SPACE 1                                                                
AXCPYD   DSECT                     COMPANY RECORD                               
AXCPYLEN DS    CL4                 RECORD LENGTH                                
AXCPYTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXCPYACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXCPYDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXCPYTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXCPYCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXCPYCPN DS    CL36                COMPANY NAME                                 
         DS    C                                                                
AXCPYTMS DS    CL1                 TMS STATE                                    
         DS    C                                                                
AXCPYCGC DS    CL2                 COMPANY GROUP CODE                           
         DS    C                                                                
AXCPYLSF DS    CL1                 ENABLE LEDGER SECURITY FLAG                  
         DS    C                                                                
AXCPYOSF DS    CL1                 ENABLE OFFICE SECURITY FLAG                  
         DS    C                                                                
AXCPYLYR DS    CL2                 MOA LOCK YEAR                                
         DS    CL1                                                              
AXCPYLMN DS    CL2                 MOA LOCK MONTH                               
         DS    CL1                                                              
AXCPYEHF DS    CL1                 EDIT HOURS FLAG                              
AXCPYDX  DS    CL2                 RECORD END                                   
AXCPYDL  EQU   *-AXCPYD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - COST ALLOCATION PROFILE              (05043) *         
***********************************************************************         
         SPACE 1                                                                
AXCAPD   DSECT                     STANDARD HOURS RECORD                        
AXCAPLEN DS    CL4                 RECORD LENGTH                                
AXCAPTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXCAPACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXCAPDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXCAPTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXCAPCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXCAPOFC DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
AXCAPDEP DS    CL6                 DEPARTMENT CODE                              
         DS    C                                                                
AXCAPSDC DS    CL6                 SUB DEPARTMENT CODE                          
         DS    C                                                                
AXCAPPER DS    CL8                 PERSON CODE                                  
         DS    C                                                                
AXCAPPSB DS    CL1                 POST SALES FOR BILLABLE                      
         DS    C                                                                
AXCAPPSC DS    CL1                 POST SALES FOR CHARGEABLE                    
         DS    C                                                                
AXCAPPBI DS    CL1                 POST BILLABLE TO INCOME                      
         DS    C                                                                
AXCAPUDI DS    CL1                 USE DEFAULT INCOME                           
AXCAPDX  DS    CL2                 RECORD END                                   
AXCAPDL  EQU   *-AXCAPD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - COST RATE                            (05007) *         
***********************************************************************         
         SPACE 1                                                                
AXCSRD   DSECT                     COST RATE RECORD                             
AXCSRLEN DS    CL4                 RECORD LENGTH                                
AXCSRTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXCSRCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXCSRCSC DS    CL2                 CONSYSPERSONCODE                             
         DS    C                                                                
AXCSRMTD DS    CL2                 METHOD                                       
         DS    C                                                                
AXCSRSLY DS    CL4                 SALARY                                       
         DS    C                                                                
AXCSRBEN DS    CL4                 BENEFIT                                      
         DS    C                                                                
AXCSRPEN DS    CL4                 PENSION                                      
AXCSRDX  DS    CL2                 RECORD END                                   
AXCSRDL  EQU   *-AXCSRD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - COSTING ACCOUNT                      (05008) *         
***********************************************************************         
         SPACE 1                                                                
AXCSAD   DSECT                     COSTING ACCOUNT RECORD                       
AXCSALEN DS    CL4                 RECORD LENGTH                                
AXCSATYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXCSAACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXCSADAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXCSATME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXCSACCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXCSACAC DS    CL12                COSTING ACCOUNT CODE                         
         DS    C                                                                
AXCSANAM DS    CL36                COSTING ACCOUNT NAME                         
         DS    C                                                                
AXCSALCK DS    CL1                 ACCOUNT LOCKED                               
         DS    C                                                                
AXCSAI1  DS    CL1                 RSTSPROD                                     
         DS    C                                                                
AXCSAI2  DS    CL1                 RSTSPRJB                                     
AXCSADX  DS    CL2                 RECORD END                                   
AXCSADL  EQU   *-AXCSAD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - DEPARTMENT                           (05009) *         
***********************************************************************         
         SPACE 1                                                                
AXDEPD   DSECT                     DEPARTMENT RECORD                            
AXDEPLEN DS    CL4                 RECORD LENGTH                                
AXDEPTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXDEPACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXDEPDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXDEPTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXDEPCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXDEPOFC DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
AXDEPDEC DS    CL6                 DEPARTMENT CODE                              
         DS    C                                                                
AXDEPNAM DS    CL36                NAME                                         
         DS    C                                                                
AXDEPANC DS    CL1                 ANALYSIS CODE                                
         DS    C                                                                
AXDEPIAC DS    CL14                INCOME ACCOUNT CODE                          
         DS    C                                                                
AXDEPTC  DS    CL2                 TASK CODE                                    
         DS    C                                                                
AXDEPLCK DS    CL1                 ACCOUNT LOCKED                               
         DS    C                                                                
AXDEPI1  DS    CL1                 RSTSPROD                                     
         DS    C                                                                
AXDEPI2  DS    CL1                 RSTSPRJB                                     
AXDEPDX  DS    CL2                 RECORD END                                   
AXDEPDL  EQU   *-AXDEPD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - DEPARTMENT GROUP                     (05010) *         
***********************************************************************         
         SPACE 1                                                                
AXDEGD   DSECT                     DEPARTMENT GROUP RECORD                      
AXDEGLEN DS    CL4                 RECORD LENGTH                                
AXDEGTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXDEGACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXDEGDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXDEGTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
AXDEGCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXDEGDGC DS    CL1                 DEPARTMENT GROUP CODE                        
         DS    C                                                                
AXDEGNAM DS    CL36                NAME                                         
AXDEGDX  DS    CL2                 RECORD END                                   
AXDEGDL  EQU   *-AXDEGD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - HOURS                                (05011) *         
***********************************************************************         
         SPACE 1                                                                
AXHRSD   DSECT                     HOURS RECORD                                 
AXHRSLEN DS    CL4                 RECORD LENGTH                                
AXHRSTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXHRSCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXHRSMTH DS    CL4                 MONTH                                        
         DS    C                                                                
AXHRSHRS DS    CL2                 HOURS                                        
AXHRSDX  DS    CL2                 RECORD END                                   
AXHRSDL  EQU   *-AXHRSD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - INCOME ACCOUNT                       (05012) *         
***********************************************************************         
         SPACE 1                                                                
AXINAD   DSECT                     HOURS RECORD                                 
AXINALEN DS    CL4                 RECORD LENGTH                                
AXINATYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXINAACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXINADAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXINATME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXINACCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXINAIAC DS    CL12                INCOME ACCOUNT CODE                          
         DS    C                                                                
AXINANAM DS    CL36                NAME                                         
         DS    C                                                                
AXINALCK DS    CL1                 LOCKED                                       
         DS    C                                                                
AXINAACD DS    CL12                ANALYSIS CODE                                
AXINADX  DS    CL2                 RECORD END                                   
AXINADL  EQU   *-AXINAD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - INCOME SUSPENSE ACCOUNT              (05013) *         
***********************************************************************         
         SPACE 1                                                                
AXISAD   DSECT                     HOURS RECORD                                 
AXISALEN DS    CL4                 RECORD LENGTH                                
AXISATYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXISAACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXISADAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXISATME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXISACCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXISAIAC DS    CL12                INCOME ACCOUNT CODE                          
         DS    C                                                                
AXISANAM DS    CL36                NAME                                         
         DS    C                                                                
AXISALCK DS    CL1                 LOCKED                                       
AXISADX  DS    CL2                 RECORD END                                   
AXISADL  EQU   *-AXISAD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - JOB                                  (05014) *         
***********************************************************************         
         SPACE 1                                                                
AXJOBD   DSECT                     HOURS RECORD                                 
AXJOBLEN DS    CL4                 RECORD LENGTH                                
AXJOBTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXJOBACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXJOBDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXJOBTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXJOBCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXJOBCLI DS    CL5                 CLIENT CODE                                  
         DS    C                                                                
AXJOBPRO DS    CL3                 PRODUCT CODE                                 
         DS    C                                                                
AXJOBJOB DS    CL7                 JOB CODE                                     
         DS    C                                                                
AXJOBNAM DS    CL36                NAME                                         
         DS    C                                                                
AXJOBF1  DS    CL1                 FILTER 1                                     
         DS    C                                                                
AXJOBF2  DS    CL1                 FILTER 2                                     
         DS    C                                                                
AXJOBF3  DS    CL1                 FILTER 3                                     
         DS    C                                                                
AXJOBF4  DS    CL1                 FILTER 4                                     
         DS    C                                                                
AXJOBF5  DS    CL1                 FILTER 5                                     
         DS    C                                                                
AXJOBOD  DS    CL8                 OPEN DATE                                    
         DS    C                                                                
AXJOBCD  DS    CL8                 CLOSE DATE                                   
         DS    C                                                                
AXJOBSTA DS    CL3                 STATUS                                       
         DS    C                                                                
AXJOBIRA DS    CL1                 IS RATE ADJUSTED                             
         DS    C                                                                
AXJOBIWO DS    CL1                 IS WRITE OFF                                 
         DS    C                                                                
AXJOBOFC DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
AXJOBCAC DS    CL12                COSTING ACCOUNT CODE                         
AXJOBDX  DS    CL2                 RECORD END                                   
AXJOBDL  EQU   *-AXJOBD            RECORD LENGTH                                
          EJECT                                                                 
***********************************************************************         
* TEMPO SYSTEM EXTRACT - LEDGER                               (05015) *         
***********************************************************************         
         SPACE 1                                                                
AXLEDD   DSECT                     LEDGER RECORD                                
AXLEDLEN DS    CL4                 RECORD LENGTH                                
AXLEDTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXLEDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXLEDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXLEDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
AXLEDCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXLEDLC  DS    CL2                 LEDGER CODE                                  
         DS    C                                                                
AXLEDNAM DS    CL36                NAME                                         
         DS    C                                                                
AXLEDSL  DS    CL5                 SECURITY LEVEL                               
AXLEDDX  DS    CL2                 RECORD END                                   
AXLEDDL  EQU   *-AXLEDD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - LEDGER STRUCTURE                     (05016) *         
***********************************************************************         
         SPACE 1                                                                
AXLESD   DSECT                     LEDGER STRUCTURE RECORD                      
AXLESLEN DS    CL4                 RECORD LENGTH                                
AXLESTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXLESACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXLESDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXLESTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
AXLESCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXLESLC  DS    CL2                 LEDGER CODE                                  
         DS    C                                                                
AXLESNUM DS    CL3                 LEVEL NUMBER                                 
         DS    C                                                                
AXLESNAM DS    CL15                LEVEL NAME                                   
         DS    C                                                                
AXLESLLN DS    CL3                 LEVEL LENGTH                                 
AXLESDX  DS    CL2                 RECORD END                                   
AXLESDL  EQU   *-AXLESD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - LOCALITY                             (05017) *         
***********************************************************************         
         SPACE 1                                                                
AXLOCD   DSECT                     LOCALITY RECORD                              
AXLOCLEN DS    CL4                 RECORD LENGTH                                
AXLOCTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXLOCACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXLOCDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXLOCTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXLOCCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXLOCLCD DS    CL8                 LOCALITY CODE                                
         DS    C                                                                
AXLOCNAM DS    CL36                NAME                                         
AXLOCDX  DS    CL2                 RECORD END                                   
AXLOCDL  EQU   *-AXLOCD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - LOCALITY INFORMATION                 (05018) *         
***********************************************************************         
         SPACE 1                                                                
AXLCID   DSECT                     LOCALITY INFORMATION RECORD                  
AXLCILEN DS    CL4                 RECORD LENGTH                                
AXLCITYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXLCIACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXLCIDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXLCITME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXLCICCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXLCILCD DS    CL8                 LOCALITY CODE                                
         DS    C                                                                
AXLCIEFF DS    CL8                 EFFECTIVE DATE                               
         DS    C                                                                
AXLCITAX DS    CL10                TAX RATE                                     
AXLCIDX  DS    CL2                 RECORD END                                   
AXLCIDL  EQU   *-AXLCID            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - MEDIA                                (05021) *         
***********************************************************************         
         SPACE 1                                                                
AXMEDD   DSECT                     MEDIA RECORD                                 
AXMEDLEN DS    CL4                 RECORD LENGTH                                
AXMEDTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXMEDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXMEDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXMEDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXMEDCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXMEDMCD DS    CL1                 MEDIA CODE                                   
         DS    C                                                                
AXMEDMDS DS    CL12                MEDIA DESCRIPTION                            
         DS    C                                                                
AXMEDGRP DS    CL1                 MEDIA GROUP                                  
AXMEDDX  DS    CL2                 RECORD END                                   
AXMEDDL  EQU   *-AXMEDD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - MEDIA GROUP RECORD                   (05022) *         
***********************************************************************         
         SPACE 1                                                                
AXMGRD   DSECT                     MEDIA GROUP RECORD                           
AXMGRLEN DS    CL4                 RECORD LENGTH                                
AXMGRTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXMGRACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXMGRDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXMGRTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXMGRCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXMGRGC  DS    CL1                 MEDIA GROUP CODE                             
         DS    C                                                                
AXMGRNAM DS    CL36                MEDIA GROUP NAME                             
AXMGRDX  DS    CL2                 RECORD END                                   
AXMGRDL  EQU   *-AXMGRD            RECORD LENGTH                                
          EJECT                                                                 
***********************************************************************         
* TEMPO SYSTEM EXTRACT - NON CLIENT TIME RECORD               (05023) *         
***********************************************************************         
         SPACE 1                                                                
AXNCTD   DSECT                     NON CLIENT TIME RECORD                       
AXNCTLEN DS    CL4                 RECORD LENGTH                                
AXNCTTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXNCTACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXNCTDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXNCTTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXNCTCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXNCTTAC DS    CL12                NON CLIENT TIME ACCOUNT CODE                 
         DS    C                                                                
AXNCTNAM DS    CL36                NON CLIENT TIME ACCOUNT NAME                 
         DS    C                                                                
AXNCTF1  DS    CL1                 FILTER 1                                     
         DS    C                                                                
AXNCTF2  DS    CL1                 FILTER 2                                     
         DS    C                                                                
AXNCTF3  DS    CL1                 FILTER 3                                     
         DS    C                                                                
AXNCTF4  DS    CL1                 FILTER 4                                     
         DS    C                                                                
AXNCTF5  DS    CL1                 FILTER 5                                     
         DS    C                                                                
AXNCTANC DS    CL1                 ANALYSIS CODE                                
         DS    C                                                                
AXNCTISL DS    CL1                 IS LOCKED                                    
AXNCTDX  DS    CL2                 RECORD END                                   
AXNCTDL  EQU   *-AXNCTD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - OFFICE RECORD                        (05024) *         
***********************************************************************         
         SPACE 1                                                                
AXOFFD   DSECT                     OFFICE RECORD                                
AXOFFLEN DS    CL4                 RECORD LENGTH                                
AXOFFTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXOFFACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXOFFDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXOFFTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXOFFCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXOFFCDE DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
AXOFFNAM DS    CL36                OFFICE NAME                                  
         DS    C                                                                
AXOFFIAC DS    CL14                INCOME ACCOUNT                               
         DS    C                                                                
AXOFFTC  DS    CL2                 TASK CODE                                    
         DS    C                                                                
AXOFFLCK DS    CL1                 ACCOUNT LOCKED                               
         DS    C                                                                
AXOFFI1  DS    CL1                 RSTSPROD                                     
         DS    C                                                                
AXOFFI2  DS    CL1                 RSTSPRJB                                     
AXOFFDX  DS    CL2                 RECORD END                                   
AXOFFDL  EQU   *-AXOFFD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - OFFICE GROUP RECORD                  (05025) *         
***********************************************************************         
         SPACE 1                                                                
AXOGRD   DSECT                     OFFICE GROUP RECORD                          
AXOGRLEN DS    CL4                 RECORD LENGTH                                
AXOGRTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXOGRACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXOGRDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXOGRTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXOGRCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXOGRGC  DS    CL1                 OFFICE GROUP CODE                            
         DS    C                                                                
AXOGRNAM DS    CL36                OFFICE GROUP NAME                            
AXOGRDX  DS    CL2                 RECORD END                                   
AXOGRDL  EQU   *-AXOGRD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - OFFICE LIST                          (05026) *         
***********************************************************************         
         SPACE 1                                                                
AXOFLD   DSECT                     OFFICE LIST RECORD                           
AXOFLLEN DS    CL4                 RECORD LENGTH                                
AXOFLTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXOFLACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXOFLDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXOFLTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXOFLCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXOFLGC  DS    CL2                 OFFICE LIST CODE                             
         DS    C                                                                
AXOFLSC  DS    CL1                 OFFICE LIST SUB CODE                         
         DS    C                                                                
AXOFLNAM DS    CL36                OFFICE LIST NAME                             
         DS    C                                                                
AXOFLDX  DS    CL2                 RECORD END                                   
AXOFLDL  EQU   *-AXOFLD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - OFFICE LIST ENTRY                    (05027) *         
***********************************************************************         
         SPACE 1                                                                
AXOLED   DSECT                     OFFICE LIST ENTRY RECORD                     
AXOLELEN DS    CL4                 RECORD LENGTH                                
AXOLETYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXOLEACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXOLEDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXOLETME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXOLECCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXOLEGC  DS    CL2                 OFFICE LIST CODE                             
         DS    C                                                                
AXOLESC  DS    CL1                 OFFICE LIST SUB CODE                         
         DS    C                                                                
AXOLEOFC DS    CL2                 OFFICE CODE                                  
AXOLEDX  DS    CL2                 RECORD END                                   
AXOLEDL  EQU   *-AXOLED            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - PERIOD                               (05028) *         
***********************************************************************         
         SPACE 1                                                                
AXPEDD   DSECT                     PERIOD RECORD                                
AXPEDLEN DS    CL4                 RECORD LENGTH                                
AXPEDTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXPEDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXPEDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXPEDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXPEDCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXPEDOFC DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
AXPEDSYM DS    CL4                 END YEAR MONTH                               
         DS    C                                                                
AXPEDEYM DS    CL4                 START YEAR MONTH                             
         DS    C                                                                
AXPEDSDT DS    CL8                 START DATE                                   
         DS    C                                                                
AXPEDEDT DS    CL8                 END DATE                                     
         DS    C                                                                
AXPEDPN  DS    CL3                 PERIOD NUMBER (AS NUMBER)                    
         DS    C                                                                
AXPEDMAY DS    CL3                 MOA YEAR                                     
         DS    C                                                                
AXPEDMAM DS    CL3                 MOA MONTH                                    
AXPEDDX  DS    CL2                 RECORD END                                   
AXPEDDL  EQU   *-AXPEDD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - PERSON                               (05029) *         
***********************************************************************         
         SPACE 1                                                                
AXPERD   DSECT                     PERSON RECORD                                
AXPERLEN DS    CL4                 RECORD LENGTH                                
AXPERTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXPERACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXPERDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXPERTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXPERCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXPERCSC DS    CL5                 CONSYSPERCODE                                
         DS    C                                                                
AXPERPC  DS    CL8                 PERSON CODE                                  
         DS    C                                                                
AXPERLN  DS    CL36                LAST NAME                                    
         DS    C                                                                
AXPERFN  DS    CL36                FIRST NAME                                   
         DS    C                                                                
AXPERHDT DS    CL8                 HIRE DATE                                    
         DS    C                                                                
AXPERTDT DS    CL8                 TERMINATION DATE                             
AXPERDX  DS    CL2                 RECORD END                                   
AXPERDL  EQU   *-AXPERD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - PERSON ASSIGNMENT                    (05030) *         
***********************************************************************         
         SPACE 1                                                                
AXPEAD   DSECT                     PERSON ASSIGNMENT RECORD                     
AXPEALEN DS    CL4                 RECORD LENGTH                                
AXPEATYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXPEAACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXPEADAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXPEATME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXPEACCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXPEAPC  DS    CL8                 PERSON CODE                                  
         DS    C                                                                
AXPEACSC DS    CL5                 CONSYSPERCODE                                
         DS    C                                                                
AXPEASTD DS    CL8                 START DATE                                   
         DS    C                                                                
AXPEAEND DS    CL8                 END DATE                                     
         DS    C                                                                
AXPEAOFC DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
AXPEADEC DS    CL6                 DEPARTMENT CODE                              
         DS    C                                                                
AXPEASDC DS    CL6                 SUB DEPARTMENT CODE                          
         DS    C                                                                
*XPEAMGC DS    CL8                 MANAGER GROUP CODE                           
*        DS    C                                                                
AXPEAATT DS    CL3                 LOCATTR                                      
         DS    C                                                                
AXPEASTA DS    CL3                 LOCSTAT                                      
AXPEADX  DS    CL2                 RECORD END                                   
AXPEADL  EQU   *-AXPEAD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - PRODUCT                              (05031) *         
***********************************************************************         
         SPACE 1                                                                
AXPROD   DSECT                     PRODUCT RECORD                               
AXPROLEN DS    CL4                 RECORD LENGTH                                
AXPROTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXPROACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXPRODAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXPROTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXPROCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXPROCLC DS    CL5                 CLIENT CODE                                  
         DS    C                                                                
AXPROPRO DS    CL3                 PRODUCT CODE                                 
         DS    C                                                                
AXPRONAM DS    CL36                PRODUCT NAME                                 
         DS    C                                                                
AXPROF1  DS    CL1                 FILTER 1                                     
         DS    C                                                                
AXPROF2  DS    CL1                 FILTER 2                                     
         DS    C                                                                
AXPROF3  DS    CL1                 FILTER 3                                     
         DS    C                                                                
AXPROF4  DS    CL1                 FILTER 4                                     
         DS    C                                                                
AXPROF5  DS    CL1                 FILTER 5                                     
         DS    C                                                                
AXPROOFC DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
AXPROCAC DS    CL12                COSTING ACCOUNT CODE                         
         DS    C                                                                
AXPROLCK DS    CL1                 ACCOUNT LOCKED                               
AXPRODX  DS    CL2                 RECORD END                                   
AXPRODL  EQU   *-AXPROD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - RATE                                 (05032) *         
***********************************************************************         
         SPACE 1                                                                
AXRATD   DSECT                     RATE RECORD                                  
AXRATLEN DS    CL4                 RECORD LENGTH                                
AXRATTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXRATACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXRATDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXRATTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXRATCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXRATHST DS    CL27                HOST KEY COPIED FROM FILE                    
         DS    C                                                                
AXRATOFC DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
AXRATDEC DS    CL6                 DEPARTMENT CODE                              
         DS    C                                                                
AXRATSDC DS    CL6                 SUB - DEPARTMENT CODE                        
         DS    C                                                                
AXRATPC  DS    CL8                 PERSON CODE                                  
         DS    C                                                                
AXRATTSK DS    CL2                 TASK CODE                                    
         DS    C                                                                
AXRATCOF DS    CL2                 CLIENT OFFICE                                
         DS    C                                                                
AXRATCLI DS    CL5                 CLIENT CODE                                  
         DS    C                                                                
AXRATPRO DS    CL3                 PRODUCT CODE                                 
         DS    C                                                                
AXRATEFD DS    CL8                 EFFECTIVE DATE                               
         DS    C                                                                
AXRATE   DS    CL10                RATE                                         
AXRATDX  DS    CL2                 RECORD END                                   
AXRATDL  EQU   *-AXRATD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - STANDARD HOURS                       (05033) *         
***********************************************************************         
         SPACE 1                                                                
AXSTHD   DSECT                     STANDARD HOURS RECORD                        
AXSTHLEN DS    CL4                 RECORD LENGTH                                
AXSTHTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXSTHACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXSTHDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXSTHTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXSTHCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXSTHOFC DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
AXSTHDEC DS    CL6                 DEPARTMENT CODE                              
         DS    C                                                                
AXSTHSDC DS    CL6                 SUB DEPARTMENT CODE                          
         DS    C                                                                
AXSTHPER DS    CL8                 PERSON CODECODE                              
         DS    C                                                                
AXSTHFDT DS    CL8                 FIRST DATE                                   
         DS    C                                                                
AXSTHLDT DS    CL8                 LAST DATE                                    
         DS    C                                                                
AXSTHSDT DS    CL8                 START DATE                                   
         DS    C                                                                
AXSTHEDT DS    CL8                 END DATE                                     
         DS    C                                                                
AXSTHHRS DS    CL10                HOURS                                        
AXSTHDX  DS    CL2                 RECORD END                                   
AXSTHDL  EQU   *-AXSTHD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - SUB-DEPARTMENT RECORD                (05034) *         
***********************************************************************         
         SPACE 1                                                                
AXSBDD   DSECT                     SUB - DEPARTMENT RECORD                      
AXSBDLEN DS    CL4                 RECORD LENGTH                                
AXSBDTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXSBDACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXSBDDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXSBDTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXSBDCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXSBDOFC DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
AXSBDDEC DS    CL6                 DEPARTMENT CODE                              
         DS    C                                                                
AXSBDSDC DS    CL6                 SUB - DEPARTMENT CODE                        
         DS    C                                                                
AXSBDNAM DS    CL36                SUB - DEPARTMENT NAME                        
         DS    C                                                                
AXSBDIAC DS    CL14                INCOME ACCOUNT CODE                          
         DS    C                                                                
AXSBDTC  DS    CL2                 TASK CODE                                    
         DS    C                                                                
AXSBDLCK DS    CL1                 ACCOUNT LOCKED                               
         DS    C                                                                
AXSBDI1  DS    CL1                 RSTSPROD                                     
         DS    C                                                                
AXSBDI2  DS    CL1                 RSTSPRJB                                     
AXSBDDX  DS    CL2                 RECORD END                                   
AXSBDDL  EQU   *-AXSBDD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - TASK                                 (05035) *         
***********************************************************************         
         SPACE 1                                                                
AXTSKD   DSECT                     TASK RECORD                                  
AXTSKLEN DS    CL4                 RECORD LENGTH                                
AXTSKTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXTSKACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXTSKDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXTSKTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXTSKCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXTSKLC  DS    CL2                 LEDGER CODE                                  
         DS    C                                                                
AXTSKCDE DS    CL2                 TASK CODE                                    
         DS    C                                                                
AXTSKSNM DS    CL15                TASK SHORT NAME                              
         DS    C                                                                
AXTSKNAM DS    CL36                TASK LONG NAME                               
         DS    C                                                                
AXTSKISC DS    CL1                 IS COMMISIONABLE                             
         DS    C                                                                
AXTSKISA DS    CL1                 IS ACTIVE                                    
         DS    C                                                                
AXTSKISR DS    CL1                 IS RATE ADJUSTED                             
         DS    C                                                                
AXTSKIST DS    CL1                 IS FOR TIME                                  
         DS    C                                                                
AXTSKTGC DS    CL1                 WORKCODE GROUP                               
AXTSKDX  DS    CL2                 RECORD END                                   
AXTSKDL  EQU   *-AXTSKD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - WORKCODE GROUP                       (05045) *         
***********************************************************************         
         SPACE 1                                                                
AXTGRD   DSECT                     TASK RECORD                                  
AXTGRLEN DS    CL4                 RECORD LENGTH                                
AXTGRTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXTGRACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXTGRDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXTGRTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXTGRCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXTGRUL  DS    CL2                 UNIT/LEDGER CODE                             
         DS    C                                                                
AXTGRCDE DS    CL1                 WORKCODE GROUP CODE                          
         DS    C                                                                
AXTGRNAM DS    CL36                WORKCODE GROUP NAME                          
         DS    C                                                                
AXTGRDX  DS    CL2                 RECORD END                                   
AXTGRDL  EQU   *-AXTGRD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - TIMESHEET RECORD                     (05036) *         
***********************************************************************         
         SPACE 1                                                                
AXTISD   DSECT                     TRANSACTION RECORD                           
AXTISLEN DS    CL4                 RECORD LENGTH                                
AXTISTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXTISACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXTISDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXTISTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
AXTISCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXTISCSC DS    CL5                 CONSYSPERCODE                                
         DS    C                                                                
AXTISEND DS    CL8                 END DATE                                     
         DS    C                                                                
AXTISOFF DS    CL2                 OFFICE                                       
         DS    C                                                                
AXTISDPT DS    CL6                 DEPARTMENT                                   
         DS    C                                                                
AXTISSBD DS    CL6                 SUB-DEPARTMENT                               
         DS    C                                                                
AXTISTMP DS    CL1                 IS FROM TEMPO                                
         DS    C                                                                
AXTISSTA DS    CL5                 TIME SHEET STATE                             
         DS    C                                                                
AXTISSID DS    CL1                 TEMPO ONLY - SUBMIT PERSON ID                
         DS    C                                                                
AXTISSDT DS    CL8                 TEMPO ONLY - SUBMIT DATE/TIME                
         DS    C                                                                
AXTISAPR DS    CL5                 TEMPO ONLY - APPROVER                        
         DS    C                                                                
AXTISADT DS    CL8                 TEMPO ONLY - APPROVE DATE/TIME               
         DS    C                                                                
AXTISUPR DS    CL5                 TEMPO ONLY - UPLOADER                        
         DS    C                                                                
AXTISUDT DS    CL8                 TEMPO ONLY - UPLOAD DATE/TIME                
         DS    C                                                                
AXTISPN  DS    CL3                 PERIOD NUMBER (AS NUMBER)                    
         DS    C                                                                
AXTISBIH DS    CL6                 TEMPO ONLY - BILLABLE HOURS                  
         DS    C                                                                
AXTISCHH DS    CL6                 TEMPO ONLY - CHARGEABLE HOURS                
         DS    C                                                                
AXTISNBH DS    CL6                 TEMPO ONLY - NON-BILLABLE HOURS              
         DS    C                                                                
AXTISNCH DS    CL6                 TEMPO ONLY - NON-CLIENT HOURS                
         DS    C                                                                
AXTISMDT DS    CL8                 TEMPO ONLY - MODIFY DATE/TIME                
         DS    C                                                                
AXTISERR DS    CL5                 TEMPO ONLY - ERROR NUMBER                    
         DS    C                                                                
AXTISSTD DS    CL8                 START DATE                                   
*&&UK                                                                           
         DS    C                                                                
AXTISDLY DS    CL1                 IS DAILY TIME                                
         DS    C                                                                
AXTISREV DS    CL1                 REVIEW REQUIRED                              
         DS    C                                                                
AXTISSUB DS    CL1                 IS SUBMITTED AND ABOVE IS BRANDOCN           
*&&                                                                             
AXTISDX  DS    CL2                 RECORD END                                   
AXTISDL  EQU   *-AXTISD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - TIMESHEET ALLOCATION LINE RECORD     (05037) *         
***********************************************************************         
         SPACE 1                                                                
AXTALD   DSECT                     TRANSACTION RECORD                           
AXTALLEN DS    CL4                 RECORD LENGTH                                
AXTALTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXTALACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXTALDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXTALTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
AXTALCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXTALCSC DS    CL5                 CONSYSPERCODE                                
         DS    C                                                                
AXTALPED DS    CL8                 TIME SHEET END DATE                          
         DS    C                                                                
AXTALLNO DS    CL5                 LINE NUMBER                                  
         DS    C                                                                
AXTALCLI DS    CL5                 CLIENT                                       
         DS    C                                                                
AXTALPRD DS    CL3                 PRODUCT                                      
         DS    C                                                                
AXTALJOB DS    CL7                 JOB                                          
         DS    C                                                                
AXTALNCA DS    CL12                NON-CLIENT ACCOUNT                           
         DS    C                                                                
AXTALTSK DS    CL2                 TASK CODE                                    
         DS    C                                                                
AXTALTIM DS    CL3                 TIME TYPE                                    
         DS    C                                                                
AXTALRAT DS    CL10                RATE                                         
         DS    C                                                                
AXTALIAC DS    CL12                INCOME ACCOUNT CODE                          
         DS    C                                                                
AXTALISA DS    CL12                INCOME SUSPENSE ACCOUNT CODE                 
         DS    C                                                                
AXTALPOF DS    CL2                 PRODUCTION OFFICE CODE                       
         DS    C                                                                
AXTALHBI DS    CL10                BILLABLE HOURS                               
         DS    C                                                                
AXTALHCH DS    CL10                CHARGEABLE HOURS                             
         DS    C                                                                
AXTALHNB DS    CL10                NON-BILLABLE HOURS                           
         DS    C                                                                
AXTALHNC DS    CL10                NON-CLIENT HOURS                             
         DS    C                                                                
AXTALIFT DS    CL1                 ISFROMTEMPO                                  
         DS    C                                                                
AXTALINV DS    CL1                 IS INVALID (TEMPO ONLY)                      
         DS    C                                                                
AXTALCAC DS    CL12                COSTING ACCOUNT CODE (IF 1C)                 
         DS    C                                                                
AXTALERR DS    CL6                 ERROR NUMBER                                 
         DS    C                                                                
AXTALMAY DS    CL3                 MOA YEAR                                     
         DS    C                                                                
AXTALMAM DS    CL3                 MOA MONTH                                    
         DS    C                                                                
AXTALWRI DS    CL1                 IS WRITE-OFF                                 
         DS    C                                                                
AXTALADJ DS    CL1                 IS ADJUSTED                                  
         DS    C                                                                
AXTALCMT DS    CL80                COMMENT                                      
AXTALDX  DS    CL2                 RECORD END                                   
AXTALDL  EQU   *-AXTALD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - TIMESHEET ALLOCATION LINE TAX INFO   (05038) *         
***********************************************************************         
         SPACE 1                                                                
AXTATD   DSECT                     TRANSACTION RECORD                           
AXTATLEN DS    CL4                 RECORD LENGTH                                
AXTATTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXTATACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXTATDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXTATTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
AXTATCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXTATCSC DS    CL5                 CONSYSPERCODE                                
         DS    C                                                                
AXTATPED DS    CL8                 PERIOD END DATE                              
         DS    C                                                                
AXTATLNO DS    CL5                 LINE NUMBER (TIMLINE#)                       
         DS    C                                                                
AXTATLOC DS    CL8                 LOCALITY CODE                                
         DS    C                                                                
AXTATBAS DS    CL10                BASIS AMOUNT                                 
         DS    C                                                                
AXTATTSK DS    CL2                 TASK CODE                                    
AXTATDX  DS    CL2                 RECORD END                                   
AXTATDL  EQU   *-AXTATD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - OPTION EXTRACT                       (05039) *         
***********************************************************************         
         SPACE 1                                                                
AXOPTD   DSECT                     PERIOD RECORD                                
AXOPTLEN DS    CL4                 RECORD LENGTH                                
AXOPTTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXOPTACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXOPTDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXOPTTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXOPTCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXOPTKEY DS    0XL27               COMPOSITE KEY                                
AXOPTK1  DS    CL(L'AXOPTTGC)      1                                            
AXOPTK2  DS    CL(L'AXOPTTFC)      2                                            
AXOPTK3  DS    CL(L'AXOPTOGC)      1                                            
AXOPTK4  DS    CL(L'AXOPTOFC)      2                                            
AXOPTK5  DS    CL(L'AXOPTCLI)      6                                            
AXOPTK6  DS    CL(L'AXOPTPRO)      6                                            
AXOPTK7  DS    CL(L'AXOPTJOB)      7                                            
AXOPTK8  DS    CL(L'AXOPTMGC)      1                                            
AXOPTK9  DS    CL(L'AXOPTMCD)      1                                            
         DS    C                                                                
AXOPTTGC DS    CL1                 WORKCODE GROUP                               
         DS    C                                                                
AXOPTTFC DS    CL2                 WORKCODE                                     
         DS    C                                                                
AXOPTOGC DS    CL1                 OFFICE GROUP CODE                            
         DS    C                                                                
AXOPTOFC DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
AXOPTCLI DS    CL6                 CLIENT CODE                                  
         DS    C                                                                
AXOPTPRO DS    CL6                 PRODUCT CODE                                 
         DS    C                                                                
AXOPTJOB DS    CL7                 JOB CODE                                     
         DS    C                                                                
AXOPTMGC DS    CL1                 MEDIA GROUP CODE                             
         DS    C                                                                
AXOPTMCD DS    CL1                 MEDIA CODE                                   
         DS    C                                                                
AXOPTIPR DS    CL1                 PRODUCT REQUIRED                             
         DS    C                                                                
AXOPTIJR DS    CL1                 JOB REQUIRED                                 
         DS    C                                                                
AXOPTITR DS    CL1                 IS TAX REQUIRED                              
         DS    C                                                                
AXOPTLOC DS    CL8                 LOCALITY CODE                                
         DS    C                                                                
AXOPTTTC DS    CL2                 TAX TASK CODE                                
         DS    C                                                                
AXOPTIAC DS    CL14                INCOME ACCOUNT   OPNICA                      
         DS    C                                                                
AXOPTDTT DS    CL1                 DEFAULT TIME TYPE                            
AXOPTDX  DS    CL2                 RECORD END                                   
AXOPTDL  EQU   *-AXOPTD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - PERSON1R RECORD                      (05040) *         
***********************************************************************         
         SPACE 1                                                                
AXP1RD   DSECT                     PERSON1R RECORD                              
AXP1RLEN DS    CL4                 RECORD LENGTH                                
AXP1RTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXP1RACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXP1RDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXP1RTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXP1RCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXP1ROFC DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
AXP1RDEC DS    CL6                 DEPARTMENT CODE                              
         DS    C                                                                
AXP1RSDC DS    CL6                 SUB - DEPARTMENT CODE                        
         DS    C                                                                
AXP1RPC  DS    CL8                 PERSON CODE                                  
         DS    C                                                                
AXP1RIAC DS    CL14                INCOME ACCOUNT CODE                          
         DS    C                                                                
AXP1RTC  DS    CL2                 TASK CODE                                    
AXP1RDX  DS    CL2                 RECORD END                                   
AXP1RDL  EQU   *-AXP1RD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - PRODUCTION OFFICE                    (05041) *         
***********************************************************************         
         SPACE 1                                                                
AXPOFD   DSECT                     POFICE RECORD                                
AXPOFLEN DS    CL4                 RECORD LENGTH                                
AXPOFTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXPOFACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXPOFDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXPOFTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXPOFCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXPOFCDE DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
AXPOFGC  DS    CL1                 OFFICE GROUP CODE                            
         DS    C                                                                
AXPOFNAM DS    CL36                OFFICE NAME                                  
AXPOFDX  DS    CL2                 RECORD END                                   
AXPOFDL  EQU   *-AXPOFD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - EDIT HOURS                           (05042) *         
***********************************************************************         
         SPACE 1                                                                
AXEDTD   DSECT                     STANDARD HOURS RECORD                        
AXEDTLEN DS    CL4                 RECORD LENGTH                                
AXEDTTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXEDTACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXEDTDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXEDTTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXEDTCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXEDTOFC DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
AXEDTDEC DS    CL6                 DEPARTMENT CODE                              
         DS    C                                                                
AXEDTSDC DS    CL6                 SUB DEPARTMENT CODE                          
         DS    C                                                                
AXEDTPER DS    CL8                 PERSON CODECODE                              
         DS    C                                                                
AXEDTFDT DS    CL8                 FIRST DATE                                   
         DS    C                                                                
AXEDTLDT DS    CL8                 LAST DATE                                    
         DS    C                                                                
AXEDTSDT DS    CL8                 START DATE                                   
         DS    C                                                                
AXEDTEDT DS    CL8                 END DATE                                     
         DS    C                                                                
AXEDTHRS DS    CL10                HOURS                                        
         DS    C                                                                
AXEDTWKD DS    CL3                 WEEKDAY                                      
         DS    C                                                                
AXEDTVAR DS    CL1                 VARIANCE                                     
AXEDTDX  DS    CL2                 RECORD END                                   
AXEDTDL  EQU   *-AXEDTD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - PAYROLL HISTORY RECORD               (05044) *         
***********************************************************************         
         SPACE 1                                                                
AXPHID   DSECT                     STANDARD HOURS RECORD                        
AXPHILEN DS    CL4                 RECORD LENGTH                                
AXPHITYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXPHIACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXPHIDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXPHITME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXPHICCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXPHIOFC DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
AXPHIDEP DS    CL6                 DEPARTMENT CODE                              
         DS    C                                                                
AXPHISDC DS    CL6                 SUB DEPARTMENT CODE                          
         DS    C                                                                
AXPHICSP DS    CL8                 PERSON CODE                                  
         DS    C                                                                
AXPHIDTE DS    CL8                 DATE                                         
         DS    C                                                                
AXPHISUB DS    CL5                 SEQUENCE NUMBER                              
         DS    C                                                                
AXPHIAMT DS    CL10                AMOUNT                                       
AXPHIDX  DS    CL2                 RECORD END                                   
AXPHIDL  EQU   *-AXPHID            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - DAILY TIME RECORD                    (05046) *         
***********************************************************************         
         SPACE 1                                                                
AXDTMD   DSECT                     PERSON1R RECORD                              
AXDTMLEN DS    CL4                 RECORD LENGTH                                
AXDTMTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXDTMACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXDTMDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXDTMTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXDTMCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXDTMOFC DS    CL2                 OFFICE CODE                                  
         DS    C                                                                
AXDTMDEC DS    CL6                 DEPARTMENT CODE                              
         DS    C                                                                
AXDTMSDC DS    CL6                 SUB - DEPARTMENT CODE                        
         DS    C                                                                
AXDTMPC  DS    CL8                 PERSON CODE                                  
         DS    C                                                                
AXDTMSDT DS    CL8                 START DATE                                   
         DS    C                                                                
AXDTMEDT DS    CL8                 END DATE                                     
AXDTMDX  DS    CL2                 RECORD END                                   
AXDTMDL  EQU   *-AXDTMD            RECORD LENGTH                                
         EJECT                                                                  
***********************************************************************         
* TEMPO SYSTEM EXTRACT - TIMESHEET ALLOCATION LINE DAY        (05047) *         
***********************************************************************         
         SPACE 1                                                                
AXTADD   DSECT                     PERSON1R RECORD                              
AXTADLEN DS    CL4                 RECORD LENGTH                                
AXTADTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXTADACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXTADDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXTADTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXTADCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXTADCSC DS    CL5                 CONSYSPERSONCODE                             
         DS    C                                                                
AXTADPED DS    CL8                 TIME SHEET END DATE                          
         DS    C                                                                
AXTADLNO DS    CL5                 LINE NUMBER                                  
         DS    C                                                                
AXTADDAY DS    CL3                 DAY                                          
         DS    C                                                                
AXTADHRS DS    CL10                HOURS                                        
*&&UK                                                                           
         DS    C                                                                
AXTADIBO DS    CL1                 IS BRANDOCEAN TIME                           
*&&                                                                             
AXTADDX  DS    CL2                 RECORD END                                   
AXTADDL  EQU   *-AXTADD            RECORD LENGTH                                
***********************************************************************         
* TEMPO SYSTEM EXTRACT - TIMESHEET BRANDO LINE                (05048) *         
***********************************************************************         
         SPACE 1                                                                
AXBOLD   DSECT                     TIMESHEET BRANDOCEAN LINE RECORD             
AXBOLLEN DS    CL4                 RECORD LENGTH                                
AXBOLTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXBOLACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXBOLDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXBOLTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXBOLCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXBOLCSC DS    CL5                 CONSYSPERSONCODE                             
         DS    C                                                                
AXBOLPED DS    CL8                 TIME SHEET END DATE                          
         DS    C                                                                
AXBOLLNO DS    CL5                 LINE NUMBER                                  
         DS    C                                                                
AXBOLIBO DS    CL1                 ISFROMBRANDO                                 
AXBOLDX  DS    CL2                 RECORD END                                   
AXBOLDL  EQU   *-AXBOLD            RECORD LENGTH                                
***********************************************************************         
* TEMPO SYSTEM EXTRACT - TIMESHEET BRANDO STATUS              (05049) *         
***********************************************************************         
         SPACE 1                                                                
AXBOSD   DSECT                     TIMESHEET BRANDOCEAN LINE RECORD             
AXBOSLEN DS    CL4                 RECORD LENGTH                                
AXBOSTYP DS    CL5                 RECORD TYPE                                  
         DS    C                                                                
AXBOSACT DS    CL1                 RECORD ACTION                                
         DS    C                                                                
AXBOSDAT DS    CL8                 RECORD DATE                                  
         DS    C                                                                
AXBOSTME DS    CL6                 RECORD TIME                                  
         DS    C                                                                
*                                                                               
AXBOSCCD DS    CL2                 COMPANY CODE                                 
         DS    C                                                                
AXBOSCSC DS    CL5                 CONSYSPERSONCODE                             
         DS    C                                                                
AXBOSPED DS    CL8                 TIME SHEET END DATE                          
         DS    C                                                                
AXBOSSTA DS    CL5                 BRANDO STATUS                                
*                                  TIMSFAPP EQU   X'40'                         
*                                  TIMSSUBM EQU   X'20'                         
*                                  TIMSPAPP EQU   X'10'                         
*                                  TIMSAWAP EQU   X'08'                         
*                                  TIMSREJE EQU   X'02'                         
*                                  TIMSRETR EQU   X'01'                         
*                                  PLUS 00 WHICH MAKES 7 (IN PROGRESS)          
AXBOSDX  DS    CL2                 RECORD END                                   
AXBOSDL  EQU   *-AXBOSD            RECORD LENGTH                                
         EJECT                                                                  
