*          DATA SET BUEXTRULTB AT LEVEL 005 AS OF 04/28/93                      
QRESTDSP DS    XL2                 DSP TO EST LIST (4 BYTE ENTRIES)             
QRMGRDSP DS    XL2                 DSP TO MGR LIST (5 BYTE ENTRIES)             
QRDPTDSP DS    XL2                 DSP TO DPT LIST (1 BYTE ENTRIES)             
QRSLNDSP DS    XL2                 DSP TO SLN LIST (1 BYTE ENTRIES)             
QRMKTDSP DS    XL2                 DSP TO MARKETS  (2 BYTE ENTRIES)             
QRSTADSP DS    XL2                 DSP TO STATIONS (3 BYTE ENTRIES)             
QRPAYDSP DS    XL2                 DSP TO PAY REPS (3 BYTE ENTRIES)             
QRSPRDSP DS    XL2                 DSP TO SPCL REPS(3 BYTE ENTRIES)             
QRAFFDSP DS    XL2                 DSP TO AFFILS   (3 BYTE ENTRIES)             
*                                                                               
QRNETDSP DS    XL2                 DSP TO NETWORKS (4 BYTE ENTRIES)             
QRPKGDSP DS    XL2                 DSP TO PACKAGES (1 BYTE ENTRIES)             
QRCOSDSP DS    XL2                 DSP TO NETWORK COST (1 BYTE ENTRY)           
*                                                                               
QRLSTDSP DS    XL2                 DSP TO PUB LIST (3 BYTE ENTRIES)             
QRFRQDSP DS    XL2                 DSP TO FRQ      (1 BYTE ENTRIES)             
QRADCDSP DS    XL2                 DSP TO AD CODE  (6 BYTE ENTRIES)             
QRPUBDSP DS    XL2                 DSP TO PUBS (6 BYTE ENTRIES)                 
QRDIVDSP DS    XL2                 DSP TO DIVISION (3 BYTE ENTRIES)             
QRDRDDSP DS    XL2                 DSP TO DRD (12 BYTE ENTRIES)                 
*                                                                               
QRJOBDSP DS    XL2                 DSP TO JOBS (6 BYTE ENTRIES)                 
QRWCDDSP DS    XL2                 DSP TO WORK CODES (2 BYTE ENTRIES)           
QRAF1DSP DS    XL2                 DSP TO ACCT FIL 1 (1 BYTE ENTRIES)           
QRAF2DSP DS    XL2                 DSP TO ACCT FIL 2 (1 BYTE ENTRIES)           
QRAF3DSP DS    XL2                 DSP TO ACCT FIL 3 (1 BYTE ENTRIES)           
QRAF4DSP DS    XL2                 DSP TO ACCT FIL 4 (1 BYTE ENTRIES)           
QRAF5DSP DS    XL2                 DSP TO ACCT FIL 5 (1 BYTE ENTRIES)           
*                                                                               
QRCOMDSP DS    XL2                 DSP TO COMMERCIALS (8 BYTE ENTRIES)          
QRESNDSP DS    XL2                 DSP TO ESTIMATE NUMS(6 BYTE ENTRIES)         
*                                                                               
QRCLDDSP DS    XL2                 DSP TO DRD CLIENT (3 BYTE ENTRY)             
*                                                                               
QRMEDDSP DS    XL2                 DSP TO MEDIA (1 BYTE ENTRIES)                
*                                                                               
QRPCODSP DS    XL2                 DSP TO PROGRAM CODE (6 BYTE ENTRIES)         
QRPFIDSP DS    XL2                 DSP TO PKG FILTERS (6 BYTE ENTRIES)          
QRSTYDSP DS    XL2                 DSP TO STATION TYPES (1 BYTE ENTRY)          
*                                                                               
QRIESDSP DS    XL2                 DSP TO INTERAGY EST(6 BYTE ENTRIES)          
QRIMIDSP DS    XL2                 DSP TO INTERAGY MED(2 BYTE ENTRIES)          
