*          DATA SET BUFILE2D   AT LEVEL 008 AS OF 12/01/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T502E2D      DATE 12/01/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
CLLCLTH  DS    CL8                                                              
CLLCLT   DS    CL3      6   10    3  A   U    H         T    I   Y    1         
CLLCLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A   P    N         T        Y              
CLLHEDH  DS    CL8                                                              
CLLHED   DS    CL68     8   10   68  A   P    N         T        Y              
CLLSELH  DS    CL8                                                              
CLLSEL   DS    CL3      9    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68     9   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    10   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    11   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    12   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    13   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    14   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    15   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    16   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    17   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    18   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    19   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    20   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    21   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    22   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    23   10   68  A   P    N         T        Y              
CLLPFH   DS    CL8                                                              
CLLPF    DS    CL78    24    2   78  A   P    H         T        Y              
CLLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
CLLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1523 BYTES                            
