*          DATA SET BUFILE3D   AT LEVEL 007 AS OF 12/15/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T502E3D      DATE 12/15/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
PRLCLTH  DS    CL8                                                              
PRLCLT   DS    CL3      6   10    3  A   U    H         T    I   Y    1         
PRLCLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   20    7  A   P    N         T        Y              
PRLCODH  DS    CL8                                                              
PRLCOD   DS    CL3      6   28    3  A   U    H         T        Y    2         
PRLCODX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A   P    N         T        Y              
PRLHEDH  DS    CL8                                                              
PRLHED   DS    CL68     8   10   68  A   P    N         T        Y              
PRLSELH  DS    CL8                                                              
PRLSEL   DS    CL3      9    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68     9   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    10   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    11   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    12   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    13   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    14   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    15   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    16   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    17   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    18   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    19   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    20   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    21   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    22   10   68  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL68    23   10   68  A   P    N         T        Y              
PRLPFH   DS    CL8                                                              
PRLPF    DS    CL78    24    2   78  A   P    H         T        Y              
PRLLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PRLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1557 BYTES                            
