*          DATA SET BUFILEFD   AT LEVEL 001 AS OF 11/13/85                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T502EFD      DATE 11/13/85                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      6    2    7  A   P    N         T        Y              
TSTOPTH  DS    CL8                                                              
TSTOPT   DS    CL30     6   13   30  A   U    N         T    I   Y              
         DS    CL8                                                              
         DS    CL1      7    2    1  A   U    N         T        Y              
TSTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 65   BYTES                            
