*          DATA SET BUFILFAD   AT LEVEL 003 AS OF 11/19/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T502FAD      DATE 11/19/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL12     6    2   12  A   P    N         T        Y              
FIXKEYH  DS    CL8                                                              
FIXKEY   DS    CL8      6   20    8  A   U    H         T    I   Y    1         
FIXKEYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      7    2    4  A   P    N         T        Y              
FIXMODEH DS    CL8                                                              
FIXMODE  DS    CL1      7   20    1  A   U    H         T        Y    2         
FIXMODEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL15     7   38   15  A   P    N         T        Y              
FIXTABH  DS    CL8                                                              
FIXTAB   DS    CL1      8   20    1  A   U    N         T        Y              
FIXLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
FIXWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 108  BYTES                            
