*          DATA SET BUFILC6D   AT LEVEL 004 AS OF 02/19/86                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T502C6D      DATE 02/19/86                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     6    2   11  A   P    N         T        Y              
DCYFCLTH DS    CL8                                                              
DCYFCLT  DS    CL3      6   20    3  A   U    H         T    I   Y    1         
DCYFCLTX DS    CL8                                                              
DCYFCLNH DS    CL8                                                              
DCYFCLN  DS    CL20     6   38   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12     7    2   12  A   P    N         T        Y              
DCYFPRDH DS    CL8                                                              
DCYFPRD  DS    CL3      7   20    3  A   U    H         T        Y    2         
DCYFPRDX DS    CL8                                                              
DCYFPRNH DS    CL8                                                              
DCYFPRN  DS    CL20     7   38   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9      8    2    9  A   P    N         T        Y              
DCYFPLAH DS    CL8                                                              
DCYFPLA  DS    CL3      8   20    3  A   U    H         T        Y    3         
DCYFPLAX DS    CL8                                                              
DCYFPLNH DS    CL8                                                              
DCYFPLN  DS    CL20     8   38   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9     10    2    9  A   P    N         T        Y              
DCYTCLTH DS    CL8                                                              
DCYTCLT  DS    CL3     10   20    3  A   U    H         T        Y    4         
DCYTCLTX DS    CL8                                                              
DCYTCLNH DS    CL8                                                              
DCYTCLN  DS    CL20    10   38   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    11    2   10  A   P    N         T        Y              
DCYTPRDH DS    CL8                                                              
DCYTPRD  DS    CL3     11   20    3  A   U    H         T        Y    5         
DCYTPRDX DS    CL8                                                              
DCYTPRNH DS    CL8                                                              
DCYTPRN  DS    CL20    11   38   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12    2    7  A   P    N         T        Y              
DCYTPLAH DS    CL8                                                              
DCYTPLA  DS    CL3     12   20    3  A   U    H         T        Y    6         
DCYTPLAX DS    CL8                                                              
DCYTPLNH DS    CL8                                                              
DCYTPLN  DS    CL20    12   38   20  A   P    N         T        Y              
DCYTABH  DS    CL8                                                              
DCYTAB   DS    CL1     13   20    1  A   U    N         T        Y              
DCYLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DCYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 409  BYTES                            
