*          DATA SET BUFILF8D   AT LEVEL 008 AS OF 04/13/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T502F8D      DATE 04/13/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
TEXCLTH  DS    CL8                                                              
TEXCLT   DS    CL3      6   20    3  A   U    H         T    I   Y    1         
TEXCLTX  DS    CL8                                                              
TEXCLNH  DS    CL8                                                              
TEXCLN   DS    CL20     6   38   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
TEXPRDH  DS    CL8                                                              
TEXPRD   DS    CL3      7   20    3  A   U    H         T        Y    2         
TEXPRDX  DS    CL8                                                              
TEXPRNH  DS    CL8                                                              
TEXPRN   DS    CL20     7   38   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      8    2    4  A   P    N         T        Y              
TEXPLAH  DS    CL8                                                              
TEXPLA   DS    CL3      8   20    3  A   U    H         T        Y    3         
TEXPLAX  DS    CL8                                                              
TEXPLNH  DS    CL8                                                              
TEXPLN   DS    CL20     8   38   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    N         T        Y              
TEXOUTH  DS    CL8                                                              
TEXOUT   DS    CL8      9   20    8  A   U    H         T        Y    4         
TEXOUTX  DS    CL8                                                              
TEXOUTNH DS    CL8                                                              
TEXOUTN  DS    CL20     9   38   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9     10    2    9  A   P    N         T        Y              
TEXDTH   DS    CL8                                                              
TEXDT    DS    CL8     10   20    8  A   U    H         T        Y    5         
TEXDTX   DS    CL8                                                              
TEXDTNH  DS    CL8                                                              
TEXDTN   DS    CL40    10   38   40  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     11    2    6  A   P    N         T        Y              
TEXPERH  DS    CL8                                                              
TEXPER   DS    CL13    11   20   13  A   U    H         T        Y    6         
TEXPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4     12    2    4  A   P    N         T        Y              
TEXCODEH DS    CL8                                                              
TEXCODE  DS    CL2     12   20    2  A   U    H         T        Y    8         
TEXCODEX DS    CL8                                                              
TEXDAH   DS    CL8                                                              
TEXDA    DS    CL30    12   38   30  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     14    2    4  A   P    N         T        Y              
TEXTEX1H DS    CL8                                                              
TEXTEX1  DS    CL56    14   20   56  L   U    H         T        Y    7         
TEXTEX1X DS    CL8                                                              
TEXTEX2H DS    CL8                                                              
TEXTEX2  DS    CL56    15   20   56  L   U    H         T        Y              
TEXTEX3H DS    CL8                                                              
TEXTEX3  DS    CL56    16   20   56  L   U    H         T        Y              
TEXTEX4H DS    CL8                                                              
TEXTEX4  DS    CL56    17   20   56  L   U    H         T        Y              
TEXTEX5H DS    CL8                                                              
TEXTEX5  DS    CL56    18   20   56  L   U    H         T        Y              
TEXTEX6H DS    CL8                                                              
TEXTEX6  DS    CL56    19   20   56  L   U    H         T        Y              
TEXTEX7H DS    CL8                                                              
TEXTEX7  DS    CL56    20   20   56  L   U    H         T        Y              
TEXTEX8H DS    CL8                                                              
TEXTEX8  DS    CL56    21   20   56  L   U    H         T        Y              
TEXTEX9H DS    CL8                                                              
TEXTEX9  DS    CL56    22   20   56  L   U    H         T        Y              
TEXTEXAH DS    CL8                                                              
TEXTEXA  DS    CL56    23   20   56  L   U    H         T        Y              
TEXPFH   DS    CL8                                                              
TEXPF    DS    CL78    24    2   78  A   P    H         T        Y              
TEXLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TEXWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1207 BYTES                            
