*          DATA SET BUFIL40PTB AT LEVEL 007 AS OF 04/29/93                      
         DC    AL2(QRESTDSP-QRD),AL3(PRTEST),C'EST='                            
         DC    AL2(QRMGRDSP-QRD),AL3(PRTMGR),C'MGR='                            
         DC    AL2(QRMKTDSP-QRD),AL3(PRTMKT),C'MKT='                            
         DC    AL2(QRSTADSP-QRD),AL3(PRTSTA),C'STA='                            
         DC    AL2(QRDPTDSP-QRD),AL3(PRTDPT),C'DPT='                            
         DC    AL2(QRSLNDSP-QRD),AL3(PRTSLN),C'SLN='                            
         DC    AL2(QRPAYDSP-QRD),AL3(PRTREP),C'PAY='                            
         DC    AL2(QRSPRDSP-QRD),AL3(PRTREP),C'SPR='                            
         DC    AL2(QRAFFDSP-QRD),AL3(PRTAFF),C'AFF='                            
         DC    AL2(QRNETDSP-QRD),AL3(PRTNET),C'NET='                            
         DC    AL2(QRPKGDSP-QRD),AL3(PRTPKG),C'PAK='                            
         DC    AL2(QRCOSDSP-QRD),AL3(PRTCOS),C'COS='                            
         DC    AL2(QRPCODSP-QRD),AL3(PRTPCO),C'PCO='                            
         DC    AL2(QRPFIDSP-QRD),AL3(PRTPF),C'PFI='                             
         DC    AL2(QRSTYDSP-QRD),AL3(PRTONE),C'STY='                            
         DC    AL2(QRLSTDSP-QRD),AL3(PRTLST),C'LST='                            
         DC    AL2(QRPUBDSP-QRD),AL3(PRTPUB),C'PUB='                            
         DC    AL2(QRFRQDSP-QRD),AL3(PRTFRQ),C'FRQ='                            
         DC    AL2(QRADCDSP-QRD),AL3(PRTADC),C'ADC='                            
         DC    AL2(QRDIVDSP-QRD),AL3(PRTDIV),C'DIV='                            
         DC    AL2(QRDRDDSP-QRD),AL3(PRTDRD),C'DRD='                            
         DC    AL2(QRCLDDSP-QRD),AL3(PRTCLD),C'CLD='                            
         DC    AL2(QRAF1DSP-QRD),AL3(PRTONE),C'AF1='                            
         DC    AL2(QRAF2DSP-QRD),AL3(PRTONE),C'AF2='                            
         DC    AL2(QRAF3DSP-QRD),AL3(PRTONE),C'AF3='                            
         DC    AL2(QRAF4DSP-QRD),AL3(PRTONE),C'AF4='                            
         DC    AL2(QRAF5DSP-QRD),AL3(PRTONE),C'AF5='                            
         DC    AL2(QRMEDDSP-QRD),AL3(PRTMED),C'MED='                            
         DC    AL2(QRJOBDSP-QRD),AL3(PRTJOB),C'JOB='                            
         DC    AL2(QRWCDDSP-QRD),AL3(PRTWCD),C'WCD='                            
         DC    AL2(QRCOMDSP-QRD),AL3(PRTCOM),C'COM='                            
         DC    AL2(QRESNDSP-QRD),AL3(PRTESN),C'ESN='                            
         DC    AL2(QRIESDSP-QRD),AL3(PRTIES),C'IES='                            
         DC    AL2(QRIMIDSP-QRD),AL3(PRTIMI),C'MI= '                            
