*          DATA SET BUFILF5D   AT LEVEL 010 AS OF 02/12/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T502F5D      DATE 02/12/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
OUTCLTH  DS    CL8                                                              
OUTCLT   DS    CL3      6   20    3  A   U    H         T    I   Y    1         
OUTCLTX  DS    CL8                                                              
OUTCLNH  DS    CL8                                                              
OUTCLN   DS    CL20     6   30   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
OUTPRDH  DS    CL8                                                              
OUTPRD   DS    CL3      7   20    3  A   U    H         T        Y    2         
OUTPRDX  DS    CL8                                                              
OUTPRNH  DS    CL8                                                              
OUTPRN   DS    CL20     7   30   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      8    2    4  A   P    N         T        Y              
OUTPLAH  DS    CL8                                                              
OUTPLA   DS    CL3      8   20    3  A   U    H         T        Y    3         
OUTPLAX  DS    CL8                                                              
OUTPLNH  DS    CL8                                                              
OUTPLN   DS    CL35     8   30   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9      9    2    9  A   P    N         T        Y              
OUTATTH  DS    CL8                                                              
OUTATT   DS    CL8      9   20    8  A   U    H         T        Y    4         
OUTATTX  DS    CL8                                                              
OUTATNH  DS    CL8                                                              
OUTATN   DS    CL30     9   30   30  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    10    2   10  A   P    N         T        Y              
OUTADDH  DS    CL8                                                              
OUTADD   DS    CL8     10   20    8  A   U    H         T        Y    5         
OUTADDX  DS    CL8                                                              
OUTADNH  DS    CL8                                                              
OUTADN   DS    CL20    10   30   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    11    2   12  A   P    N         T        Y              
OUTCODH  DS    CL8                                                              
OUTCOD   DS    CL8     11   20    8  A   U    H         T        Y    6         
OUTCODX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     12    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    13    2   12  A   P    N         T        Y              
OUTNAMH  DS    CL8                                                              
OUTNAM   DS    CL20    13   20   20  L   U    H         T        Y    7         
OUTNAMX  DS    CL8                                                              
OUTDAH   DS    CL8                                                              
OUTDA    DS    CL30    13   44   30  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5     14    2    5  A   P    N         T        Y              
OUTRUH   DS    CL8                                                              
OUTRU    DS    CL56    14   20   56  A   U    H         T        Y    8         
OUTRUX   DS    CL8                                                              
OUTRU2H  DS    CL8                                                              
OUTRU2   DS    CL56    15   20   56  A   U    H         T        Y              
OUTRU3H  DS    CL8                                                              
OUTRU3   DS    CL56    16   20   56  A   U    H         T        Y              
OUTRU4H  DS    CL8                                                              
OUTRU4   DS    CL56    17   20   56  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL7     18    2    7  A   P    N         T        Y              
OUTFOH   DS    CL8                                                              
OUTFO    DS    CL56    18   20   56  A   U    H         T        Y    9         
OUTFOX   DS    CL8                                                              
OUTFO2H  DS    CL8                                                              
OUTFO2   DS    CL56    19   20   56  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL13    20    2   13  A   P    N         T        Y              
OUTCONH  DS    CL8                                                              
OUTCON   DS    CL56    20   20   56  A   U    H         T        Y   10         
OUTCONX  DS    CL8                                                              
OUTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
OUTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1017 BYTES                            
