*          DATA SET BUFILE5D   AT LEVEL 015 AS OF 04/19/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T502E5D      DATE 04/19/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
OULCLTH  DS    CL8                                                              
OULCLT   DS    CL3      6   10    3  A   U    H         T    I   Y    1         
OULCLTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   20    7  A   P    N         T        Y              
OULPRDH  DS    CL8                                                              
OULPRD   DS    CL3      6   28    3  A   U    H         T        Y    2         
OULPRDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      6   38    4  A   P    N         T        Y              
OULPLAH  DS    CL8                                                              
OULPLA   DS    CL3      6   46    3  A   U    H         T        Y    3         
OULPLAX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   56    7  A   P    N         T        Y              
OULCODH  DS    CL8                                                              
OULCOD   DS    CL8      6   64    8  A   U    H         T        Y    4         
OULCODX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
OULOPTH  DS    CL8                                                              
OULOPT   DS    CL56     7   10   56  A   U    H         T        Y    5         
OULOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   70    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      8    2    3  A   P    N         T        Y              
OULHEDH  DS    CL8                                                              
OULHED   DS    CL70     8   10   70  A   P    N         T        Y              
OULSELH  DS    CL8                                                              
OULSEL   DS    CL3      9    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70     9   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    10   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    11   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    12   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    13   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    14   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    15   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    16   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    17   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    18   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    19   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    20   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    21   10   70  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL70    22   10   70  A   P    N         T        Y              
OULPFH   DS    CL8                                                              
OULPF    DS    CL78    23    2   78  A   P    H         T        Y              
OULPF2H  DS    CL8                                                              
OULPF2   DS    CL78    24    2   78  A   P    H         T        Y              
OULLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
OULWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1743 BYTES                            
