*          DATA SET BUFILB1D   AT LEVEL 005 AS OF 05/28/86                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T502B1D      DATE 05/28/86                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL21     6    2   21  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A   P    N         T        Y              
SNACLTH  DS    CL8                                                              
SNACLT   DS    CL3      7   20    3  A   U    H         T    I   Y    1         
SNACLTX  DS    CL8                                                              
SNACLNH  DS    CL8                                                              
SNACLN   DS    CL20     7   38   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
SNAPRDH  DS    CL8                                                              
SNAPRD   DS    CL3      8   20    3  A   U    H         T        Y    2         
SNAPRDX  DS    CL8                                                              
SNAPRNH  DS    CL8                                                              
SNAPRN   DS    CL20     8   38   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      9    2    4  A   P    N         T        Y              
SNAPLAH  DS    CL8                                                              
SNAPLA   DS    CL3      9   20    3  A   U    H         T        Y    3         
SNAPLAX  DS    CL8                                                              
SNAPLNH  DS    CL8                                                              
SNAPLN   DS    CL20     9   38   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     10    2    4  A   P    N         T        Y              
SNAMODEH DS    CL8                                                              
SNAMODE  DS    CL1     10   20    1  A   U    H         T        Y    4         
SNAMODEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL32    10   38   32  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL29    12    2   29  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL11    13    2   11  A   P    N         T        Y              
SNADDH   DS    CL8                                                              
SNADD    DS    CL8     13   20    8  A   U    H         T        Y    5         
SNADDX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL40    13   38   40  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    15    2   20  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL6     16    2    6  A   P    N         T        Y              
SNATESTH DS    CL8                                                              
SNATEST  DS    CL1     16   20    1  A   U    H         T        Y    6         
SNATESTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL21    16   38   21  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL14    17    2   14  A   P    N         T        Y              
SNADETH  DS    CL8                                                              
SNADET   DS    CL1     17   20    1  A   U    H         T        Y    7         
SNADETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL21    17   38   21  A   P    N         T        Y              
SNATABH  DS    CL8                                                              
SNATAB   DS    CL1     18   20    1  A   U    N         T        Y              
SNALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
SNAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 594  BYTES                            
