*          DATA SET BUFILF4D   AT LEVEL 011 AS OF 05/18/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T502F4D      DATE 05/18/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
PLACLTH  DS    CL8                                                              
PLACLT   DS    CL3      6   10    3  A   U    H         T    I   Y    1         
PLACLTX  DS    CL8                                                              
PLACLNH  DS    CL8                                                              
PLACLN   DS    CL20     6   20   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    N         T        Y              
PLAPRDH  DS    CL8                                                              
PLAPRD   DS    CL3      7   10    3  A   U    H         T        Y    2         
PLAPRDX  DS    CL8                                                              
PLAPRNH  DS    CL8                                                              
PLAPRN   DS    CL20     7   20   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      8    2    4  A   P    N         T        Y              
PLACODH  DS    CL8                                                              
PLACOD   DS    CL3      8   10    3  A   U    H         T        Y    3         
PLACODX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      9    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9     10    2    9  A   P    N         T        Y              
PLANAMH  DS    CL8                                                              
PLANAM   DS    CL20    10   20   20  L   U    H         T        Y    4         
PLANAMX  DS    CL8                                                              
PLADAH   DS    CL8                                                              
PLADA    DS    CL30    10   45   30  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL15    11    2   15  A   P    N         T        Y              
PLASEH   DS    CL8                                                              
PLASE    DS    CL13    11   20   13  A   U    H         T        Y    5         
PLASEX   DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    12    2   16  A   P    N         T        Y              
PLAFOVH  DS    CL8                                                              
PLAFOV   DS    CL56    12   20   56  A   U    H         T        Y    6         
PLAFOVX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13    2    7  A   P    N         T        Y              
PLAOPTH  DS    CL8                                                              
PLAOPT   DS    CL56    13   20   56  A   U    H         T        Y    7         
PLAOPTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    14    2   12  A   P    N         T        Y              
PLADEMH  DS    CL8                                                              
PLADEM   DS    CL56    14   20   56  A   U    N         T        Y    8         
PLADEMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15    2    1  A   P    N         T        Y              
PLATITH  DS    CL8                                                              
PLATIT   DS    CL78    16    2   78  A   P    H         T        Y              
PLASNA1H DS    CL8                                                              
PLASNA1  DS    CL78    17    2   78  A   P    H         T        Y              
PLASNA2H DS    CL8                                                              
PLASNA2  DS    CL78    18    2   78  A   P    H         T        Y              
PLASNA3H DS    CL8                                                              
PLASNA3  DS    CL78    19    2   78  A   P    H         T        Y              
PLASNA4H DS    CL8                                                              
PLASNA4  DS    CL78    20    2   78  A   P    H         T        Y              
PLALAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PLAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1023 BYTES                            
