*          DATA SET BUFILB5D   AT LEVEL 010 AS OF 07/29/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T502B5D      DATE 07/29/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
OJTCLTH  DS    CL8                                                              
OJTCLT   DS    CL3      6   20    3  A  U H             T    I   Y    1         
OJTCLTX  DS    CL8                                                              
OJTCLNH  DS    CL8                                                              
OJTCLN   DS    CL20     6   38   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
OJTPRDH  DS    CL8                                                              
OJTPRD   DS    CL3      7   20    3  A  U H             T        Y    2         
OJTPRDX  DS    CL8                                                              
OJTPRNH  DS    CL8                                                              
OJTPRN   DS    CL20     7   38   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4      8    2    4  A  P N             T        Y              
OJTPLAH  DS    CL8                                                              
OJTPLA   DS    CL3      8   20    3  A  U H             T        Y    3         
OJTPLAX  DS    CL8                                                              
OJTPLNH  DS    CL8                                                              
OJTPLN   DS    CL20     8   38   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL9      9    2    9  A  P N             T        Y              
OJTATTH  DS    CL8                                                              
OJTATT   DS    CL8      9   20    8  A  U H             T        Y    0         
OJTATTX  DS    CL8                                                              
OJTATTNH DS    CL8                                                              
OJTATTN  DS    CL20     9   38   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    10    2   10  A  P N             T        Y              
OJTBEFH  DS    CL8                                                              
OJTBEF   DS    CL8     10   20    8  A  U H             T        Y    0         
OJTBEFX  DS    CL8                                                              
OJTBEFNH DS    CL8                                                              
OJTBEFN  DS    CL20    10   38   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL14    11    2   14  A  P N             T        Y              
OJTPCLTH DS    CL8                                                              
OJTPCLT  DS    CL3     11   17    3  A  U H             T        Y    4         
OJTPCLTX DS    CL8                                                              
OJTPCLNH DS    CL8                                                              
OJTPCLN  DS    CL20    11   21   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     11   45    7  A  P N             T        Y              
OJTPPRDH DS    CL8                                                              
OJTPPRD  DS    CL3     11   53    3  A  U H             T        Y    5         
OJTPPRDX DS    CL8                                                              
OJTPPRNH DS    CL8                                                              
OJTPPRN  DS    CL20    11   57   20  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10    12    2   10  A  P N             T        Y              
OJTPDTEH DS    CL8                                                              
OJTPDTE  DS    CL17    12   17   17  A  U H             T        Y    6         
OJTPDTEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     12   45    5  A  P N             T        Y              
OJTPMEDH DS    CL8                                                              
OJTPMED  DS    CL1     12   53    1  A  U H             T        Y    7         
OJTPMEDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     13    2    7  A  P N             T        Y              
OJTPFILH DS    CL8                                                              
OJTPFIL  DS    CL40    13   17   40  A  U N             T        Y    8         
OJTPFILX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     14    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL32    15    2   32  A  P H             T        Y              
OJTSEL1H DS    CL8                                                              
OJTSEL1  DS    CL3     16    2    3  A  U H             T        Y              
OJTCLT1H DS    CL8                                                              
OJTCLT1  DS    CL3     16    7    3  A  P N             T        Y              
OJTPRD1H DS    CL8                                                              
OJTPRD1  DS    CL3     16   11    3  A  P N             T        Y              
OJTJCD1H DS    CL8                                                              
OJTJCD1  DS    CL6     16   16    6  A  P N             T        Y              
OJTJBN1H DS    CL8                                                              
OJTJBN1  DS    CL30    16   26   30  A  P N             T        Y              
OJTSEL2H DS    CL8                                                              
OJTSEL2  DS    CL3     17    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     17    7    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   11    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     17   16    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30    17   26   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     18    7    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18   11    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     18   16    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30    18   26   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     19    7    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19   11    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     19   16    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30    19   26   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     20    7    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20   11    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     20   16    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30    20   26   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     21    7    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   11    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     21   16    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30    21   26   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     22    7    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22   11    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     22   16    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30    22   26   30  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     23    7    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23   11    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     23   16    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30    23   26   30  A  P N             T        Y              
OJTSELLH DS    CL8                                                              
OJTSELL  DS    CL3     24    2    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3     24    7    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     24   11    3  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     24   16    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL30    24   26   30  A  P N             T        Y              
OJTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
OJTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1424 BYTES                            
