*          DATA SET BUFILB2D   AT LEVEL 005 AS OF 03/11/86                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T502B2D      DATE 03/11/86                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL21     6    2   21  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A   P    N         T        Y              
DTRCLTH  DS    CL8                                                              
DTRCLT   DS    CL3      7   20    3  A   U    H         T    I   Y    1         
DTRCLTX  DS    CL8                                                              
DTRCLNH  DS    CL8                                                              
DTRCLN   DS    CL20     7   38   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      8    2    7  A   P    N         T        Y              
DTRPRDH  DS    CL8                                                              
DTRPRD   DS    CL3      8   20    3  A   U    H         T        Y    2         
DTRPRDX  DS    CL8                                                              
DTRPRNH  DS    CL8                                                              
DTRPRN   DS    CL20     8   38   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      9    2    4  A   P    N         T        Y              
DTRPLAH  DS    CL8                                                              
DTRPLA   DS    CL3      9   20    3  A   U    H         T        Y    3         
DTRPLAX  DS    CL8                                                              
DTRPLNH  DS    CL8                                                              
DTRPLN   DS    CL34     9   38   34  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     10    2    7  A   P    N         T        Y              
DTROUTH  DS    CL8                                                              
DTROUT   DS    CL8     10   20    8  A   U    H         T        Y    4         
DTROUTX  DS    CL8                                                              
DTROUTNH DS    CL8                                                              
DTROUTN  DS    CL20    10   38   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL14    12    2   14  A   P    N         T        Y              
DTRFRDTH DS    CL8                                                              
DTRFRDT  DS    CL17    12   20   17  A   U    H         T        Y    5         
DTRFRDTX DS    CL8                                                              
DTRFRDNH DS    CL8                                                              
DTRFRDN  DS    CL20    12   38   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    13    2   12  A   P    N         T        Y              
DTRTODTH DS    CL8                                                              
DTRTODT  DS    CL8     13   20    8  A   U    H         T        Y    6         
DTRTODTX DS    CL8                                                              
DTRTODNH DS    CL8                                                              
DTRTODN  DS    CL20    13   38   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     14    2    6  A   P    N         T        Y              
DTRPERH  DS    CL8                                                              
DTRPER   DS    CL13    14   20   13  A   U    H         T        Y    7         
DTRPERX  DS    CL8                                                              
DTRPERNH DS    CL8                                                              
DTRPERN  DS    CL13    14   38   13  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20    16    2   20  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL6     17    2    6  A   P    N         T        Y              
DTRTESTH DS    CL8                                                              
DTRTEST  DS    CL1     17   20    1  A   U    H         T        Y    8         
DTRTESTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL21    17   38   21  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL14    18    2   14  A   P    N         T        Y              
DTRDETH  DS    CL8                                                              
DTRDET   DS    CL1     18   20    1  A   U    H         T        Y    9         
DTRDETX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL21    18   38   21  A   P    N         T        Y              
DTRTABH  DS    CL8                                                              
DTRTAB   DS    CL1     19   20    1  A   U    N         T        Y              
DTRLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DTRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 697  BYTES                            
