*          DATA SET BUFILC4D   AT LEVEL 003 AS OF 12/09/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T502C4D      DATE 12/09/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     6    2   11  A   P    N         T        Y              
PCYFCLTH DS    CL8                                                              
PCYFCLT  DS    CL3      6   20    3  A   U    H         T    I   Y    1         
PCYFCLTX DS    CL8                                                              
PCYFCLNH DS    CL8                                                              
PCYFCLN  DS    CL38     6   38   38  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12     7    2   12  A   P    N         T        Y              
PCYFPRDH DS    CL8                                                              
PCYFPRD  DS    CL3      7   20    3  A   U    H         T        Y    2         
PCYFPRDX DS    CL8                                                              
PCYFPRNH DS    CL8                                                              
PCYFPRN  DS    CL20     7   38   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9      8    2    9  A   P    N         T        Y              
PCYFPLAH DS    CL8                                                              
PCYFPLA  DS    CL3      8   20    3  A   U    H         T        Y    3         
PCYFPLAX DS    CL8                                                              
PCYFPLNH DS    CL8                                                              
PCYFPLN  DS    CL34     8   38   34  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9     10    2    9  A   P    N         T        Y              
PCYTCLTH DS    CL8                                                              
PCYTCLT  DS    CL3     10   20    3  A   U    H         T        Y    4         
PCYTCLTX DS    CL8                                                              
PCYTCLNH DS    CL8                                                              
PCYTCLN  DS    CL38    10   38   38  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10    11    2   10  A   P    N         T        Y              
PCYTPRDH DS    CL8                                                              
PCYTPRD  DS    CL3     11   20    3  A   U    H         T        Y    5         
PCYTPRDX DS    CL8                                                              
PCYTPRNH DS    CL8                                                              
PCYTPRN  DS    CL20    11   38   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     12    2    7  A   P    N         T        Y              
PCYTPLAH DS    CL8                                                              
PCYTPLA  DS    CL3     12   20    3  A   U    H         T        Y    6         
PCYTPLAX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17    14    2   17  A   P    N         T        Y              
PCYLEVH  DS    CL8                                                              
PCYLEV   DS    CL1     14   20    1  A   U    H         T        Y    7         
PCYLEVX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL30    14   38   30  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL12    15    2   12  A   P    N         T        Y              
PCYTNAMH DS    CL8                                                              
PCYTNAM  DS    CL20    15   20   20  L   U    H         T        Y    8         
PCYTNAMX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    16    2   14  A   P    N         T        Y              
PCYTPERH DS    CL8                                                              
PCYTPER  DS    CL13    16   20   13  A   U    H         T        Y    9         
PCYTPERX DS    CL8                                                              
PCYTABH  DS    CL8                                                              
PCYTAB   DS    CL1     17   20    1  A   U    N         T        Y              
PCYLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
PCYWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 627  BYTES                            
