*          DATA SET BUSETRULTB AT LEVEL 005 AS OF 04/28/93                      
         DC    AL1(RUFLT),AL3(SETFLT),AL1(STTBDATA),AL2(QRFLT-QRD)              
         DC    AL1(0),CL3'EF'                                                   
*                                                                               
         DC    AL1(RUEST),AL3(SETLST),AL1(0),AL2(QRESTDSP-QRD)                  
         DC    AL1(LRUEST),CL3'EST'                                             
*                                                                               
         DC    AL1(RUPGR),AL3(SETPGR),AL1(STTBDATA),AL2(QRPGR-QRD)              
         DC    AL1(0),CL3'PGR'                                                  
*                                                                               
         DC    AL1(RUMGR),AL3(SETLST),AL1(0),AL2(QRMGRDSP-QRD)                  
         DC    AL1(LRUMGR),CL3'MGR'                                             
*                                                                               
         DC    AL1(RUMKT),AL3(SETLST),AL1(0),AL2(QRMKTDSP-QRD)                  
         DC    AL1(LRUMKT),CL3'MKT'                                             
*                                                                               
         DC    AL1(RUSTA),AL3(SETLST),AL1(0),AL2(QRSTADSP-QRD)                  
         DC    AL1(LRUSTA),CL3'STA'                                             
*                                                                               
         DC    AL1(RUDPT),AL3(SETLST),AL1(0),AL2(QRDPTDSP-QRD)                  
         DC    AL1(LRUDPT),CL3'DPT'                                             
*                                                                               
         DC    AL1(RUSLN),AL3(SETLST),AL1(0),AL2(QRSLNDSP-QRD)                  
         DC    AL1(LRUSLN),CL3'SLN'                                             
*                                                                               
         DC    AL1(RUPAY),AL3(SETLST),AL1(0),AL2(QRPAYDSP-QRD)                  
         DC    AL1(LRUPAY),CL3'PAY'                                             
*                                                                               
         DC    AL1(RUSPR),AL3(SETLST),AL1(0),AL2(QRSPRDSP-QRD)                  
         DC    AL1(LRUSPR),CL3'SPR'                                             
*                                                                               
         DC    AL1(RUAFF),AL3(SETLST),AL1(0),AL2(QRAFFDSP-QRD)                  
         DC    AL1(LRUAFF),CL3'AFF'                                             
*                                                                               
         DC    AL1(RUNET),AL3(SETLST),AL1(0),AL2(QRNETDSP-QRD)                  
         DC    AL1(LRUNET),CL3'NET'                                             
*                                                                               
*                                                                               
         DC    AL1(RUPKG),AL3(SETLST),AL1(0),AL2(QRPKGDSP-QRD)                  
         DC    AL1(LRUPKG),CL3'PKG'                                             
*                                                                               
         DC    AL1(RUCOS),AL3(SETLST),AL1(0),AL2(QRCOSDSP-QRD)                  
         DC    AL1(LRUCOS),CL3'COS'                                             
*                                                                               
         DC    AL1(RUPCO),AL3(SETLST),AL1(0),AL2(QRPCODSP-QRD)                  
         DC    AL1(LRUPCO),CL3'PCO'                                             
*                                                                               
         DC    AL1(RUPFI),AL3(SETLST),AL1(0),AL2(QRPFIDSP-QRD)                  
         DC    AL1(LRUPFI),CL3'PFI'                                             
*                                                                               
         DC    AL1(RUSTYPE),AL3(SETLST),AL1(0),AL2(QRSTYDSP-QRD)                
         DC    AL1(LRUSTYPE),CL3'STY'                                           
*                                                                               
*                                                                               
         DC    AL1(RULST),AL3(SETLST),AL1(0),AL2(QRLSTDSP-QRD)                  
         DC    AL1(LRULST),CL3'LST'                                             
*                                                                               
         DC    AL1(RUFRQ),AL3(SETLST),AL1(0),AL2(QRFRQDSP-QRD)                  
         DC    AL1(LRUFRQ),CL3'FRQ'                                             
*                                                                               
         DC    AL1(RUADC),AL3(SETLST),AL1(0),AL2(QRADCDSP-QRD)                  
         DC    AL1(LRUADC),CL3'ADC'                                             
*                                                                               
         DC    AL1(RUPUB),AL3(SETLST),AL1(0),AL2(QRPUBDSP-QRD)                  
         DC    AL1(LRUPUB),CL3'PUB'                                             
*                                                                               
         DC    AL1(RUDIV),AL3(SETLST),AL1(0),AL2(QRDIVDSP-QRD)                  
         DC    AL1(LRUDIV),CL3'DIV'                                             
*                                                                               
         DC    AL1(RUDRD),AL3(SETLST),AL1(0),AL2(QRDRDDSP-QRD)                  
         DC    AL1(LRUDRD),CL3'DRD'                                             
*                                                                               
         DC    AL1(RUCLD),AL3(SETLST),AL1(0),AL2(QRCLDDSP-QRD)                  
         DC    AL1(LRUCLD),CL3'CLD'                                             
*                                                                               
*                                                                               
         DC    AL1(RUJOB),AL3(SETLST),AL1(0),AL2(QRJOBDSP-QRD)                  
         DC    AL1(LRUJOB),CL3'JOB'                                             
*                                                                               
         DC    AL1(RUWCD),AL3(SETLST),AL1(0),AL2(QRWCDDSP-QRD)                  
         DC    AL1(LRUWCD),CL3'WCD'                                             
*                                                                               
         DC    AL1(RUAF1),AL3(SETLST),AL1(0),AL2(QRAF1DSP-QRD)                  
         DC    AL1(LRUAF1),CL3'AF1'                                             
*                                                                               
         DC    AL1(RUAF2),AL3(SETLST),AL1(0),AL2(QRAF2DSP-QRD)                  
         DC    AL1(LRUAF2),CL3'AF2'                                             
*                                                                               
         DC    AL1(RUAF3),AL3(SETLST),AL1(0),AL2(QRAF3DSP-QRD)                  
         DC    AL1(LRUAF3),CL3'AF3'                                             
*                                                                               
         DC    AL1(RUAF4),AL3(SETLST),AL1(0),AL2(QRAF4DSP-QRD)                  
         DC    AL1(LRUAF4),CL3'AF4'                                             
*                                                                               
         DC    AL1(RUAF5),AL3(SETLST),AL1(0),AL2(QRAF5DSP-QRD)                  
         DC    AL1(LRUAF5),CL3'AF5'                                             
*                                                                               
         DC    AL1(RUMED),AL3(SETLST),AL1(0),AL2(QRMEDDSP-QRD)                  
         DC    AL1(LRUMED),CL3'MED'                                             
*                                                                               
*                                                                               
         DC    AL1(RUCOM),AL3(SETLST),AL1(0),AL2(QRCOMDSP-QRD)                  
         DC    AL1(LRUCOM),CL3'COM'                                             
*                                                                               
         DC    AL1(RUESN),AL3(SETLST),AL1(0),AL2(QRESNDSP-QRD)                  
         DC    AL1(LRUESN),CL3'EN'                                              
*                                                                               
*                                                                               
         DC    AL1(RUIES),AL3(SETLST),AL1(0),AL2(QRIESDSP-QRD)                  
         DC    AL1(LRUIES),CL3'IES'                                             
*                                                                               
         DC    AL1(RUIMI),AL3(SETLST),AL1(0),AL2(QRIMIDSP-QRD)                  
         DC    AL1(LRUIMI),CL3'IME'                                             
