*          DATA SET BUWRIF4D   AT LEVEL 013 AS OF 12/06/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN T503F4D      DATE 12/06/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   10    8  A   U    N         T        N              
         DS    CL8                                                              
         DS    CL1      5   19    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      5   20    5  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL48     5   28   48  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    H         T        Y              
WRICLIH  DS    CL8                                                              
WRICLI   DS    CL3      6   10    3  A   U    N         T        Y    1         
WRICLIX  DS    CL8                                                              
WRICLIDH DS    CL8                                                              
WRICLID  DS    CL20     6   28   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  A   P    H         T        Y              
WRIPRDH  DS    CL8                                                              
WRIPRD   DS    CL3      7   10    3  A   U    N         T        Y    2         
WRIPRDX  DS    CL8                                                              
WRIPRDDH DS    CL8                                                              
WRIPRDD  DS    CL20     7   28   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      8    2    4  A   P    H         T        Y              
WRIPLANH DS    CL8                                                              
WRIPLAN  DS    CL3      8   10    3  A   U    N         T        Y    3         
WRIPLANX DS    CL8                                                              
WRIPLADH DS    CL8                                                              
WRIPLAD  DS    CL20     8   28   20  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A   P    N         T        Y              
WRIOUTLH DS    CL8                                                              
WRIOUTL  DS    CL17     9   10   17  A   U    N         T        Y    4         
WRIOUTLX DS    CL8                                                              
WRIOUTDH DS    CL8                                                              
WRIOUTD  DS    CL43     9   28   43  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     10    2    6  A   P    N         T        Y              
WRIPERH  DS    CL8                                                              
WRIPER   DS    CL20    10   10   20  A   U    N         T        Y   10         
WRIPERX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     12    2    7  A   P    H         T        Y              
WRICOLSH DS    CL8                                                              
WRICOLS  DS    CL70    12   10   70  A   U    N         T        Y   22         
WRICOLSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL70    13   10   70  A   U    N         T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL70    14   10   70  A   U    N         T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL70    15   10   70  A   U    N         T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL70    16   10   70  A   U    N         T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL70    17   10   70  A   U    N         T        Y   22         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL70    18   10   70  A   U    N         T        Y   22         
         DS    CL8                                                              
WRICLSTH DS    CL8                                                              
WRICLST  DS    CL70    19   10   70  A   U    N         T        Y   22         
WRICLSTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7     20    2    7  A   P    N         T        Y              
WRIOPTSH DS    CL8                                                              
WRIOPTS  DS    CL60    20   20   60  A   U    N         T        Y   40         
WRIOPTSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14    21    2   14  A   P    N         T        Y              
WRIDETLH DS    CL8                                                              
WRIDETL  DS    CL60    21   20   60  A   U    N         T        Y   42         
WRIDETLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL5     22    2    5  A   P    H         T        Y              
WRITITLH DS    CL8                                                              
WRITITL  DS    CL50    22   20   50  L   U    N         T        Y   44         
WRITITLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     23    2    9  A   P    N         T        Y              
WRISTITH DS    CL8                                                              
WRISTIT  DS    CL50    23   20   50  L   U    N         T        Y   46         
WRISTITX DS    CL8                                                              
WRILAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
WRIWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1496 BYTES                            
