*          DATA SET CPDPTRTGEQ AT LEVEL 026 AS OF 12/11/84                      
*&&US                                                                           
RTGGRP   DC    AL1(M1824),C'MA   ',AL3(0) MEN GROUP                             
         DC    AL1(M1834),C'MA   ',AL3(0)                                       
         DC    AL1(M1849),C'MA   ',AL3(0)                                       
         DC    AL1(MO18),C'MA   ',AL3(0)                                        
         DC    AL1(M2534),C'MA   ',AL3(0)                                       
         DC    AL1(M2549),C'MA   ',AL3(0)                                       
         DC    AL1(MO25),C'MA   ',AL3(0)                                        
         DC    AL1(M3549),C'MA   ',AL3(0)                                       
         DC    AL1(MO35),C'MA   ',AL3(0)                                        
         DC    AL1(MO50),C'MA   ',AL3(0)                                        
         DC    AL1(M2554),C'MA   ',AL3(0)                                       
         DC    AL1(M2564),C'MA   ',AL3(0)                                       
         DC    AL1(HOMES),C'A    ',AL3(0) TOT HMS                               
         DC    AL1(W1824),C'WA   ',AL3(0) WOMEN GROUP                           
         DC    AL1(W1834),C'WA   ',AL3(0)                                       
         DC    AL1(W1849),C'WA1  ',AL3(0)                                       
         DC    AL1(WO18),C'WA   ',AL3(0)                                        
         DC    AL1(W2534),C'WA   ',AL3(0)                                       
         DC    AL1(W2549),C'WA   ',AL3(0)                                       
         DC    AL1(WO25),C'WA   ',AL3(0)                                        
         DC    AL1(W3549),C'WA   ',AL3(0)                                       
         DC    AL1(WO35),C'WA   ',AL3(0)                                        
         DC    AL1(WO50),C'WA   ',AL3(0)                                        
         DC    AL1(W2554),C'WA   ',AL3(0)                                       
         DC    AL1(W2564),C'WA   ',AL3(0)                                       
         DC    AL1(W3564),C'WA   ',AL3(0)                                       
         DC    AL1(V1834),C'A2   ',AL3(0) ADULTS                                
         DC    AL1(V1849),C'A2M  ',AL3(0)                                       
         DC    AL1(VO18),C'A2   ',AL3(0)                                        
         DC    AL1(V2534),C'A    ',AL3(0)                                       
         DC    AL1(V2549),C'A    ',AL3(0)                                       
         DC    AL1(V2554),C'A    ',AL3(0)                                       
         DC    AL1(V3549),C'A    ',AL3(0)                                       
         DC    AL1(VO35),C'A    ',AL3(0)                                        
         DC    AL1(VO50),C'A    ',AL3(0)                                        
         DC    AL1(V1217),C'K    ',AL3(0) CHILDREN                              
         DC    AL1(V611),C'K    ',AL3(0)                                        
         DC    AL1(V617),C'K    ',AL3(0)                                        
         DC    AL1(V25),C'K    ',AL3(0)                                         
         DC    AL1(V211),C'K    ',AL3(0)                                        
         DC    AL1(V611),C'K    ',AL3(0)                                        
         DC    AL1(240),C'A    ',AL3(0) LEADING GROUP                           
         DC    AL1(241),C'W    ',AL3(0) WOMEN GROUP                             
         DC    AL1(242),C'M    ',AL3(0) WOMEN GROUP                             
         DC    AL1(243),C'A    ',AL3(0) VIEWERS GROUP                           
         DC    AL1(244),C'K    ',AL3(0) YOUNG GROUP                             
         DC    AL1(245),C'A    ',AL3(0) ADULTS GROUP                            
         DC    AL1(246),C'K    ',AL3(0) CHILDREN GROUP                          
         DC    AL1(247),C'W    ',AL3(0) TB WOMEN GROUP                          
         DC    AL1(248),C'M    ',AL3(0) TB MEN GROUP                            
         DC    AL1(249),C'A    ',AL3(0) TB ADULTS GROUP                         
         DC    AL1(250),C'K    ',AL3(0) TB CHILDREN GROUP                       
         DC    AL1(251),C'W    ',AL3(0) TB DEFINED MENU                         
         DC    AL1(252),C'W    ',AL3(0) BATES ADULTS                            
         DC    X'FF'                                                            
RTGGRPLN EQU   9                                                                
         EJECT                                                                  
DPTNAM   DC    AL1(01),AL1(15),C'WEEKEND DAYTIME'                               
         DC    AL1(02),AL1(15),C'--EARLY FRINGE-'                               
         DC    AL1(03),AL1(15),C'-----PRIME-----'                               
         DC    AL1(04),AL1(15),C'--LATE FRINGE--'                               
         DC    AL1(05),AL1(15),C'- M-F DAYTIME--'                               
         DC    AL1(06),AL1(15),C'--ALL DAYTIME--'                               
         DC    AL1(07),AL1(15),C'WKEND AFTERNOON'                               
         DC    AL1(08),AL1(15),C'WEEKEND MORNING'                               
         DC    AL1(09),AL1(15),C'-----TOTAL-----'                               
         EJECT                                                                  
*                                                                               
* DAYPART REPORTING FOR DEMO GROUPS                                             
*        DEMO ID                                                                
*        DEMO CODE                                                              
*        DEMO CAPTION                                                           
*        DAYPARTS                                                               
DEMGTAB  DS    0C                                                               
DEMGM    DC    C'M   '             MEN ID                                       
         DC    AL1(200)            MEN CODE                                     
         DC    AL2(DEMGMEN-DEMGM)  ENTRY LENGTH                                 
         DC    CL20'MEN BRANDS',AL1(07,02,03,04)                                
         DC    X'21',AL1(07)                                                    
         DC    X'22',AL1(02)                                                    
         DC    X'21',AL1(02)                                                    
         DC    X'23',AL1(02)                                                    
         DC    X'32',AL1(03)                                                    
         DC    X'41',AL1(04)                                                    
         DC    C'G',AL1(07)                                                     
         DC    C'J',AL1(02)                                                     
         DC    C'G',AL1(02)                                                     
         DC    C'L',AL1(02)                                                     
         DC    C'N',AL1(03)                                                     
         DC    C'K',AL1(03)                                                     
         DC    C'P',AL1(04)                                                     
         DC    C'R',AL1(04)                                                     
         DC    AL1(0)                                                           
DEMGMEN  DS    0C                                                               
         SPACE 2                                                                
DEMGW    DC    C'W   '                                                          
         DC    AL1(201)                                                         
         DC    AL2(DEMGWEN-DEMGW)                                               
         DC    CL20'WOMEN BRANDS',AL1(05,02,03,04)                              
         DC    X'11',AL1(05)                                                    
         DC    X'22',AL1(02)                                                    
         DC    X'21',AL1(02)                                                    
         DC    X'23',AL1(02)                                                    
         DC    X'32',AL1(03)                                                    
         DC    X'41',AL1(04)                                                    
         DC    C'A',AL1(05)                                                     
         DC    C'C',AL1(05)                                                     
         DC    C'J',AL1(02)                                                     
         DC    C'G',AL1(02)                                                     
         DC    C'L',AL1(02)                                                     
         DC    C'N',AL1(03)                                                     
         DC    C'K',AL1(03)                                                     
         DC    C'P',AL1(04)                                                     
         DC    C'R',AL1(04)                                                     
         DC    AL1(0)                                                           
DEMGWEN  DS    0C                                                               
         SPACE 2                                                                
DEMGA    DC    C'A   '                                                          
         DC    AL1(202)                                                         
         DC    AL2(DEMGAEN-DEMGA)                                               
         DC    CL20'ADULT BRANDS',AL1(06,02,03,04)                              
         DC    X'11',AL1(06)                                                    
         DC    X'12',AL1(06)                                                    
         DC    X'22',AL1(02)                                                    
         DC    X'21',AL1(02)                                                    
         DC    X'23',AL1(02)                                                    
         DC    X'32',AL1(03)                                                    
         DC    X'41',AL1(04)                                                    
         DC    C'A',AL1(06)                                                     
         DC    C'C',AL1(06)                                                     
         DC    C'E',AL1(06)                                                     
         DC    C'J',AL1(02)                                                     
         DC    C'G',AL1(02)                                                     
         DC    C'L',AL1(02)                                                     
         DC    C'N',AL1(03)                                                     
         DC    C'K',AL1(03)                                                     
         DC    C'P',AL1(04)                                                     
         DC    C'R',AL1(04)                                                     
         DC    AL1(0)                                                           
DEMGAEN  DS    0C                                                               
         SPACE 2                                                                
DEMGK    DC    C'K   '                                                          
         DC    AL1(203)                                                         
         DC    AL2(DEMGKEN-DEMGK)                                               
         DC    CL20'CHILDREN BRANDS',AL1(05,08,02,03)                           
         DC    X'11',AL1(05)                                                    
         DC    X'12',AL1(08)                                                    
         DC    X'22',AL1(02)                                                    
         DC    X'21',AL1(02)                                                    
         DC    X'23',AL1(02)                                                    
         DC    X'32',AL1(03)                                                    
         DC    C'A',AL1(05)                                                     
         DC    C'C',AL1(05)                                                     
         DC    C'E',AL1(08)                                                     
         DC    C'J',AL1(02)                                                     
         DC    C'G',AL1(02)                                                     
         DC    C'L',AL1(02)                                                     
         DC    C'N',AL1(03)                                                     
         DC    C'K',AL1(03)                                                     
         DC    AL1(0)                                                           
DEMGKEN  DS    0C                                                               
         SPACE 2                                                                
DEMG1    DC    C'1   '                                                          
         DC    AL1(204)                                                         
         DC    AL2(DEMG1EN-DEMG1)                                               
         DC    CL20'MEN BRANDS',AL1(07,02,03,04)                                
         DC    X'21',AL1(07)                                                    
         DC    X'22',AL1(02)                                                    
         DC    X'21',AL1(02)                                                    
         DC    X'23',AL1(02)                                                    
         DC    X'32',AL1(03)                                                    
         DC    X'41',AL1(04)                                                    
         DC    C'G',AL1(07)                                                     
         DC    C'J',AL1(02)                                                     
         DC    C'G',AL1(02)                                                     
         DC    C'L',AL1(02)                                                     
         DC    C'N',AL1(03)                                                     
         DC    C'K',AL1(03)                                                     
         DC    C'P',AL1(04)                                                     
         DC    C'R',AL1(04)                                                     
         DC    AL1(0)                                                           
DEMG1EN  DS    0C                                                               
         SPACE 2                                                                
DEMG2    DC    C'2   '                                                          
         DC    AL1(205)                                                         
         DC    AL2(DEMG2EN-DEMG2)                                               
         DC    CL20'WOMEN BRANDS',AL1(05,02,03,04)                              
         DC    X'11',AL1(05)                                                    
         DC    X'22',AL1(02)                                                    
         DC    X'21',AL1(02)                                                    
         DC    X'23',AL1(02)                                                    
         DC    X'32',AL1(03)                                                    
         DC    X'41',AL1(04)                                                    
         DC    C'A',AL1(05)                                                     
         DC    C'C',AL1(05)                                                     
         DC    C'J',AL1(02)                                                     
         DC    C'G',AL1(02)                                                     
         DC    C'L',AL1(02)                                                     
         DC    C'N',AL1(03)                                                     
         DC    C'K',AL1(03)                                                     
         DC    C'P',AL1(04)                                                     
         DC    C'R',AL1(04)                                                     
         DC    AL1(0)                                                           
DEMG2EN  DS    0C                                                               
         SPACE 2                                                                
DEMG3    DC    C'3   '                                                          
         DC    AL1(206)                                                         
         DC    AL2(DEMG3EN-DEMG3)                                               
         DC    CL20'ADULT BRANDS',AL1(06,02,03,04)                              
         DC    X'11',AL1(06)                                                    
         DC    X'12',AL1(06)                                                    
         DC    X'22',AL1(02)                                                    
         DC    X'21',AL1(02)                                                    
         DC    X'23',AL1(02)                                                    
         DC    X'32',AL1(03)                                                    
         DC    X'41',AL1(04)                                                    
         DC    C'A',AL1(06)                                                     
         DC    C'C',AL1(06)                                                     
         DC    C'E',AL1(06)                                                     
         DC    C'J',AL1(02)                                                     
         DC    C'G',AL1(02)                                                     
         DC    C'L',AL1(02)                                                     
         DC    C'N',AL1(03)                                                     
         DC    C'K',AL1(03)                                                     
         DC    C'P',AL1(04)                                                     
         DC    C'R',AL1(04)                                                     
         DC    AL1(0)                                                           
DEMG3EN  DS    0C                                                               
         SPACE 2                                                                
DEMG4    DC    C'4   '                                                          
         DC    AL1(207)                                                         
         DC    AL2(DEMG4EN-DEMG4)                                               
         DC    CL20'CHILDREN BRANDS',AL1(05,08,02,03)                           
         DC    X'11',AL1(05)                                                    
         DC    X'12',AL1(08)                                                    
         DC    X'22',AL1(02)                                                    
         DC    X'21',AL1(02)                                                    
         DC    X'23',AL1(02)                                                    
         DC    X'32',AL1(03)                                                    
         DC    C'A',AL1(05)                                                     
         DC    C'C',AL1(05)                                                     
         DC    C'E',AL1(08)                                                     
         DC    C'J',AL1(02)                                                     
         DC    C'G',AL1(02)                                                     
         DC    C'L',AL1(02)                                                     
         DC    C'N',AL1(03)                                                     
         DC    C'K',AL1(03)                                                     
         DC    AL1(0)                                                           
DEMG4EN  DS    0C                                                               
         SPACE 2                                                                
DEMG5    DC    C'5   '                                                          
         DC    AL1(208)                                                         
         DC    AL2(DEMG5EN-DEMG5)                                               
         DC    CL20'TOTAL',AL1(09,0,0,0)                                        
         DC    X'11',AL1(09)                                                    
         DC    X'12',AL1(09)                                                    
         DC    X'21',AL1(09)                                                    
         DC    X'22',AL1(09)                                                    
         DC    X'23',AL1(09)                                                    
         DC    X'32',AL1(09)                                                    
         DC    X'41',AL1(09)                                                    
         DC    C'A',AL1(09)                                                     
         DC    C'C',AL1(09)                                                     
         DC    C'E',AL1(09)                                                     
         DC    C'G',AL1(09)                                                     
         DC    C'J',AL1(09)                                                     
         DC    C'L',AL1(09)                                                     
         DC    C'N',AL1(09)                                                     
         DC    C'K',AL1(09)                                                     
         DC    C'P',AL1(09)                                                     
         DC    C'R',AL1(09)                                                     
         DC    AL1(0)                                                           
DEMG5EN  DS    0C                                                               
         SPACE 2                                                                
DEMGEND  DC    X'FF'                                                            
         EJECT                                                                  
         EJECT                                                                  
NONE     EQU   000                                                              
HOMES    EQU   001                                                              
METROA   EQU   002                                                              
METROB   EQU   003                                                              
ADJ1     EQU   004                                                              
ADJ2     EQU   005                                                              
ADJ3     EQU   006                                                              
FEBP     EQU   007                                                              
MAYP     EQU   008                                                              
JULP     EQU   009                                                              
NOVP     EQU   010                                                              
HHW1     EQU   011                                                              
HHW2     EQU   012                                                              
HHW3     EQU   013                                                              
HHW4     EQU   014                                                              
REACH    EQU   015                                                              
CABLE    EQU   016                                                              
CBLA     EQU   017                                                              
CBLB     EQU   018                                                              
W1217    EQU   025                                                              
W1224    EQU   028                                                              
W1234    EQU   029                                                              
W1249    EQU   030                                                              
W1254    EQU   031                                                              
W1264    EQU   032                                                              
WO12     EQU   033                                                              
W1824    EQU   040                                                              
W1834    EQU   041                                                              
W1849    EQU   042                                                              
W1854    EQU   043                                                              
W1864    EQU   044                                                              
WO18     EQU   045                                                              
W2534    EQU   046                                                              
W2549    EQU   047                                                              
W2554    EQU   048                                                              
W2564    EQU   049                                                              
WO25     EQU   050                                                              
W3549    EQU   051                                                              
W3554    EQU   052                                                              
W3564    EQU   053                                                              
WO35     EQU   054                                                              
W5054    EQU   055                                                              
W5064    EQU   056                                                              
WO50     EQU   057                                                              
W5564    EQU   058                                                              
WO55     EQU   059                                                              
WO65     EQU   060                                                              
WWORK    EQU   065                                                              
M1217    EQU   075                                                              
M1224    EQU   078                                                              
M1234    EQU   079                                                              
M1249    EQU   080                                                              
M1254    EQU   081                                                              
M1264    EQU   082                                                              
MO12     EQU   083                                                              
M1824    EQU   090                                                              
M1834    EQU   091                                                              
M1849    EQU   092                                                              
M1854    EQU   093                                                              
M1864    EQU   094                                                              
MO18     EQU   095                                                              
M2534    EQU   096                                                              
M2549    EQU   097                                                              
M2554    EQU   098                                                              
M2564    EQU   099                                                              
MO25     EQU   100                                                              
M3549    EQU   101                                                              
M3554    EQU   102                                                              
M3564    EQU   103                                                              
MO35     EQU   104                                                              
M5054    EQU   105                                                              
M5064    EQU   106                                                              
MO50     EQU   107                                                              
M5564    EQU   108                                                              
MO55     EQU   109                                                              
MO65     EQU   110                                                              
V25      EQU   121                                                              
V211     EQU   122                                                              
V611     EQU   123                                                              
V1217    EQU   125                                                              
VO2      EQU   127                                                              
V1224    EQU   128                                                              
V1234    EQU   129                                                              
V1249    EQU   130                                                              
V1254    EQU   131                                                              
V1264    EQU   132                                                              
VO12     EQU   133                                                              
V1824    EQU   140                                                              
V1834    EQU   141                                                              
V1849    EQU   142                                                              
V1854    EQU   143                                                              
V1864    EQU   144                                                              
VO18     EQU   145                                                              
V2534    EQU   146                                                              
V2549    EQU   147                                                              
V2554    EQU   148                                                              
V2564    EQU   149                                                              
VO25     EQU   150                                                              
V3549    EQU   151                                                              
V3554    EQU   152                                                              
V3564    EQU   153                                                              
VO35     EQU   154                                                              
V5054    EQU   155                                                              
V5064    EQU   156                                                              
VO50     EQU   157                                                              
V5564    EQU   158                                                              
VO55     EQU   159                                                              
VO65     EQU   160                                                              
V217     EQU   172                                                              
V224     EQU   173                                                              
V234     EQU   174                                                              
V249     EQU   175                                                              
V254     EQU   176                                                              
V264     EQU   177                                                              
V615     EQU   178                                                              
V617     EQU   179                                                              
V624     EQU   180                                                              
V634     EQU   181                                                              
V649     EQU   182                                                              
V654     EQU   183                                                              
V664     EQU   184                                                              
VO6      EQU   185                                                              
*&&                                                                             
