*          DATA SET CPGENINTER AT LEVEL 009 AS OF 08/17/78                      
*              DSECT TO COVER INTERFACE TAPE RECORD                             
         SPACE 2                                                                
CPINTERD DSECT                                                                  
         SPACE 1                                                                
CPIAREC  DS    0CL40               AGENCY NAME RECORD                           
CPIATYPE DS    CL1                 A                                            
CPIACODE DS    CL2                 AGENCY CODE                                  
CPIANAME DS    CL33                AGENCY NAME OR ADDRESS                       
CPIAWICH DS    CL1                 1(NAME) OR 2(ADDREDD)                        
         DS    CL3                                                              
         SPACE 2                                                                
         ORG   CPIAREC                                                          
CPIBREC  DS    0CL40               REQUEST FOR AGENCY                           
CPIBTYPE DS    CL1                 B                                            
CPIBAGY  DS    CL2                 AGENCY CODE                                  
CPIBSTRT DS    CL6                 START DATE                                   
CPIBEND  DS    CL6                 END DATE                                     
         DS    CL25                                                             
         SPACE 2                                                                
         ORG   CPIAREC                                                          
CPICREC  DS    0CL40               CLIENT NAME RECORD                           
CPICTYPE DS    CL1                 C                                            
CPICCODE DS    CL3                 CLIENT CODE                                  
CPICNAME DS    CL20                CLIENT NAME                                  
CPICOFF  DS    CL1                 OFFICE CODE                                  
         DS    CL14                                                             
         SPACE 2                                                                
         ORG   CPIAREC                                                          
CPIDREC  DS    0CL40               DATA RECORD                                  
CPIDTYPE DS    CL1                 D                                            
CPIDAGY  DS    CL2                 AGENCY CODE                                  
CPIDMED  DS    CL1                 MEDIA                                        
CPIDCLT  DS    CL3                 CLIENT CODE                                  
CPIDMKT  DS    CL2                 MARKET NUMBER                                
CPIDAFFL DS    CL1                 AFFILIATE                                    
CPIDTARG DS    CL1                 TARGET DEMO NUMBER                           
CPIDDEMO DS    CL1                 DEMO NUMBER                                  
CPIDSERV DS    CL1                 RATING SERVICE (A/N)                         
CPIDDP   DS    CL1                 DAYPART CODE                                 
CPIDSL   DS    CL1                 SPOT LENGTH                                  
CPIDPROG DS    CL1                 PROGRAM CODE                                 
CPIDEQIV DS    CL2                 EQUIVALENCY FACTOR                           
CPIDYEAR DS    CL1                 YEAR                                         
CPIDMON  DS    CL1                 MONTH                                        
CPIDSPOT DS    CL4                 NUMBER OF SPOTS                              
CPIDCASH DS    CL4                 DOLLARS                                      
CPIDPNTS DS    CL4                 POINTS                                       
CPIDIMPS DS    CL4                 IMPRESSIONS (000)                            
CPIDMKWT DS    CL2                 MARKET WEIGHT                                
         DS    CL2                                                              
