*          DATA SET CPGENDPLUT AT LEVEL 009 AS OF 03/04/80                      
*              DAY PART CODE LOOK-UP TABLE                                      
         SPACE 3                                                                
DPLUTAB  CSECT                                                                  
         DC    X'10',C'DAY ',C'DAY '         DAY (UK)                           
         DC    X'11',C'DAY ',C'DAY '         WEEKDAY                            
         DC    X'12',C'DAY ',C'WEM '         WEEKEND  MORNING                   
         DC    X'20',C'PRE ',C'PRE '         PRE-PEAK (UK)                      
         DC    X'21',C'ELY ',C'WEA '         WEEKEND  AFTERNOON                 
         DC    X'22',C'ELY ',C'ELY '         EARLY FRINGE                       
         DC    X'23',C'ELY ',C'PAC '         PRIME ACCESS                       
         DC    X'30',C'PEAK',C'PEAK'         PEAK (UK)                          
         DC    X'32',C'PRI ',C'PRI '         REGULAR PRIME                      
         DC    X'40',C'POST',C'POST'         POST-PEAK (UK)                     
         DC    X'41',C'LTE ',C'LTE '         LATE FRINGE                        
         DC    X'91',C'ELY ',C'TEF '        TOTAL EARLY FRINGE  2X              
         DC    X'92',C'FRG ',C'TFR '        TOTAL FRINGE        2X+4X           
         DC    X'93',C'TEV ',C'TEV '         TOTAL EVENING      92+32           
         DC    X'99',C'TOT ',C'TOT '         OVERALL TOTAL                      
         DC    C'A',C'EAM ',C'EAM '         EARLY MORNING                       
         DC    C'C',C'DAY ',C'DAY '          DAYTIME                            
         DC    C'E',C'WEM ',C'WEM '          WEEKEND MORING                     
         DC    C'G',C'WEA ',C'WEA '          WEEKEND AFTERNOON                  
         DC    C'J',C'ELY ',C'ELY '          EARLY FRINGE                       
         DC    C'L',C'PAC ',C'PAC '          PRIME ACCESS                       
         DC    C'N',C'PRI ',C'PRI '          PRIME                              
         DC    C'P',C'LTE ',C'LTE '          LATE FRINGE                        
         DC    C'R',C'LLT ',C'LLT '          LATE LATE                          
         DC    X'FF'                                                            
