*          DATA SET CPINQFFD   AT LEVEL 002 AS OF 10/07/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TC03FFD      DATE 10/07/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
CPQHEADH DS    CL8                                                              
CPQHEAD  DS    CL60     1    2   60   A    P    N         T         Y           
CPQSERVH DS    CL8                                                              
CPQSERV  DS    CL17     1   63   17   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6      3    2    6   A    P    N         T         Y           
CPQCLIH  DS    CL8                                                              
CPQCLI   DS    CL24     3    9   24   A    U    N         T    I    Y           
         DS    CL8                                                              
         DS    CL5      3   35    5   A    P    N         T         Y           
CPQDATH  DS    CL8                                                              
CPQDAT   DS    CL13     3   41   13   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL4      3   58    4   A    P    N         T         Y           
CPQTYPH  DS    CL8                                                              
CPQTYP   DS    CL9      3   65    9   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6      4    2    6   A    P    N         T         Y           
CPQMARH  DS    CL8                                                              
CPQMAR   DS    CL24     4    9   24   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL5      4   35    5   A    P    N         T         Y           
CPQDEMH  DS    CL8                                                              
CPQDEM   DS    CL15     4   41   15   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6      4   58    6   A    P    N         T         Y           
CPQFILH  DS    CL8                                                              
CPQFIL   DS    CL14     4   65   14   A    U    N    M    T         Y           
CPQTABH  DS    CL8                                                              
CPQTAB   DS    CL1      5   78    1   A    U    N         T         Y           
CPQDAT1H DS    CL8                                                              
CPQDAT1  DS    CL78     6    2   78   A    P    N         T         Y           
CPQDAT2H DS    CL8                                                              
CPQDAT2  DS    CL78     7    2   78   A    P    N         T         Y           
CPQDAT3H DS    CL8                                                              
CPQDAT3  DS    CL78     8    2   78   A    P    N         T         Y           
CPQDAT4H DS    CL8                                                              
CPQDAT4  DS    CL78     9    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    10    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    11    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    12    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    13    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    14    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    15    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    16    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    17    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    18    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    19    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    20    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    21    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    22    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    23    2   78   A    P    N         T         Y           
CPQDATLH DS    CL8                                                              
CPQDATL  DS    CL78    24    2   78   A    P    N         T         Y           
CPQLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
CPQWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1966 BYTES                            
