*          DATA SET CPREQFED   AT LEVEL 003 AS OF 10/12/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TC04FED      DATE 10/12/83                 
         SPACE 1                                                                
TC04FED  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL79     6    2   79   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL79     7    2   79   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL79     8    2   79   A    P    N         T         Y           
ENQFRSTH DS    CL8                                                              
ENQFRST  DS    CL78     9    2   78   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL78    10    2   78   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL78    11    2   78   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL78    12    2   78   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL78    13    2   78   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL78    14    2   78   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL78    15    2   78   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL78    16    2   78   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL78    17    2   78   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL78    18    2   78   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL78    19    2   78   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL78    20    2   78   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL78    21    2   78   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL78    22    2   78   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL78    23    2   78   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL1     24    2    1   A    U    N         T         Y           
ENQLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
ENQWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1563 BYTES                            
