*          DATA SET CPREQSAVE  AT LEVEL 001 AS OF 07/11/78                      
REQSAVE  DSECT                                                                  
*                                                                               
*                                                                               
         DS    4F        RESERVED                                               
PREQNDX1 DS    H         PREV REQUEST INDEX TO REQTBL ENTRY                     
PREQNUM  DS    CL1                    NUMBER                                    
PREQACTN DS    CL1                    ACTION                                    
*                                                                               
LADR     DS    CL4       LAST REQUEST DISK ADR                                  
LREQNUM  DS    CL1                    NUMBER                                    
LREQNUM1 DS    CL1                    SUB NUMBER                                
LREQMED  DS    CL1                    MEDIA                                     
LREQMED1 DS    CL1                    MEDIA BIT MASK                            
LREQACTN DS    CL1                    ACTION                                    
LREQOPTN DS    CL1                    OPTION                                    
LREQINCR DS    H                      INCREMENT                                 
LREQCNTR DS    H                      COUNTER                                   
LREQNDX  DS    H                      INDEX TO REQTBL                           
LREQNDX1 DS    H                      INDEX TO REQTBL ENTRY                     
LREQFLTR DS    CL1                    FILTER                                    
LREQFMT  DS    CL3                    FORMAT OPTIONS                            
*                                                                               
STATUS   DS    CL1       TERMINAL STATUS                                        
DDS      DS    CL1       DDS TERMINAL =1                                        
LREQID   DS    CL2       LAST REQUEST USER ID                                   
         DS    CL16      N/D                                                    
         DS    CL2       RESERVED                                               
*                                                                               
*                                                                               
         DS    1900C     SIZE OF LARGEST SCREEN                                 
*                                                                               
*                                                                               
DISPFLDS DS    2H        DISPLAY FLDS NUM OF FLDS & SEQ NUM OF 1ST              
         DS    18CL4                  DISK ADRS                                 
LKEY     DS    CL42      LAST REQUEST INITIALISED KEY                           
LREQREC  DS    CL106     LAST REQUEST INITIALISED RECORD                        
LREQMAP  DS    CL72      LAST REQUEST SCREEN MAP                                
         DS    CL44      N/D                                                    
         EJECT                                                                  
