*          DATA SET CPREQFDD   AT LEVEL 003 AS OF 10/12/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TC04FDD      DATE 10/12/83                 
         SPACE 1                                                                
TC04FDD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL78     6    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78     7    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78     8    2   78   A    P    N         T         Y           
CRDDATAH DS    CL8                                                              
CRDDATA  DS    CL78     9    2   78   A    U    N         T         N           
         DS    CL8                                                              
         DS    CL78    10    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL78    11    2   78   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL1     12    2    1   A    U    N         T         Y           
CRDLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
CRDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 528  BYTES                            
