*          DATA SET CT0EDI03   AT LEVEL 002 AS OF 04/24/92                      
*                                                                               
*  CT0EDI03:  CTMAD0E INPUT FRAME DSECT                                         
*                                                                               
*  $MAD ITEM TYPE 1302         (PACKAGE TRAILER: IN)                            
*                                                                               
CT0EIN03 DSECT                                                                  
*                                                                               
PKTRID   DS    CL4                 RECORD ID (PEND)                             
PKTRNUM  DS    CL6                 NUMBER OF PROGRAMS                           
PKTRFILL DS    CL990               FILLER                                       
