*          DATA SET CT0EDI04   AT LEVEL 002 AS OF 04/24/92                      
*                                                                               
*  CT0EDI04:  CTMAD0E INPUT FRAME DSECT                                         
*                                                                               
*  $MAD ITEM TYPE 1303         (FILE TRAILER: IN)                               
*                                                                               
CT0EIN04 DSECT                                                                  
*                                                                               
FTRAID   DS    CL4                 RECORD ID (FEND)                             
FTRAPACK DS    CL6                 NUMBER OF PACKAGES                           
FTRAFILL DS    CL990               FILLER                                       
