*          DATA SET CT0EDI01   AT LEVEL 008 AS OF 10/11/95                      
*                                                                               
*  CT0EDI01:  CTMAD0E INPUT FRAME DSECT                                         
*                                                                               
*  $MAD ITEM TYPE 3100         (PACKAGE HEADER:  IN)                            
*                                                                               
CT0EIN01 DSECT                                                                  
*                                                                               
PACKID   DS    CL4                 RECORD ID (PACK)                             
PACKAGY  DS    CL10                SIGN ON IDNUMBER EFFECTIVE DATE              
PACKMED  DS    CL1                 C(ABLE)S(YNDICATION)N(ETWORK)                
PACKCLI  DS    CL3                 CLIENT CODE                                  
PACKCLIN DS    CL20                CLIENT NAME                                  
PACKNET  DS    CL4                 NETWORK CODE                                 
PACKEST  DS    CL3                 ESTIMATE CODE                                
PACKESTN DS    CL20                ESTIMATE NAME                                
PACKESST DS    CL8                 ESTIMATE START DATE YYYYMMDD                 
PACKESEN DS    CL8                 ESTIMATE END DATE YYYYMMDD                   
PACKPCOD DS    CL3                 PACKAGE CODE                                 
PACKPNAM DS    CL16                PACKAGE NAME                                 
PACKBASE DS    CL1                 DEMO BASE V(PH)I(MPRESSION)                  
PACKCOST DS    CL10                PACKAGE COST                                 
PACKDEMS DS    CL133               UP TO 19 TARGET DEMOS CATEGORIES             
*                                  FROM EST HDR "HOMES" IS EXCLUDED             
PACKALOC DS    CL3                 PRODUCT FOR ALL UNITS TO                     
*                                  BE ALLOCATED AGAINST (OPTIONAL)              
PACKCNT  DS    CL16                CONTRACT FOR CONFIRMATION REPORT             
PACKPLAN DS    CL16                PLAN FOR CONFIRMATION REPORT                 
PACKCRDT DS    CL8                 CRAETION DATE FOR CONF. REPORT               
PACKOVR  DS    CL1                 IF=Y DONT CHECK IF UNITS UNDER PACK.         
PACKNAD  DS    CL15                5 NAD DEMO CATEGORIES                        
PACKFILL DS    CL712               FILLER                                       
