*          DATA SET CT11DO03   AT LEVEL 006 AS OF 07/16/91                      
*                                                                               
*  CT11DO03:  CTMAD11 INPUT FRAME DSECT                                         
*                                                                               
*  $MAD ITEM TYPE 132          (DEMOGRAPHIC VALUES:  DV)                        
*                                                                               
CT11O03  DSECT                                                                  
*                                                                               
DVCOMBO  DS    CL1                 Y = INVENTORY IS A COMBO                     
DVBOOK   DS    CL8                 BOOK TO WHICH DATA PERTAINS                  
DVDEMOCT DS    CL2                 NUMBER OF DEMOGRAPHICS                       
*  FOLLOWING ITEMS APPEAR VARIABLE NUMBER OF TIMES DEPENDENT UPON               
*    VALUE IN DVDEMOCT                                                          
DVDEMLEN DS    CL1                 LENGTH OF FOLLOWING DEMO VALUE               
DVDEMO   DS    CL1                 VARIABLE LENGTH DEMOGRAPHIC VALUE            
