*          DATA SET CT11DI05   AT LEVEL 004 AS OF 07/16/91                      
*                                                                               
*  CT11DI05:  CTMAD11 INPUT FRAME DSECT                                         
*                                                                               
*  $MAD ITEM TYPE 144          (INVENTORY BY NUMBER:  IN)                       
*                                                                               
CT11IN05 DSECT                                                                  
*                                                                               
ININVNUM DS    CL4                 INVENTORY NUMBER                             
ININVDTE DS    CL8                 INVENTORY NUMBER EFFECTIVE DATE              
INSTDT   DS    CL8                                                              
INENDT   DS    CL8                                                              
INCOMPET DS    CL1                 Y  = INCLUDE COMPETITIVE                     
INRATES  DS    CL1                 Y  = INCLUDE RATES                           
INAVGCOM DS    CL1                 0  = NO ACTION                               
*                                  1  = AVERAGE FOLLOWING ITEM                  
*                                  2  = COMBO FOLLOWING ITEM                    
