*          DATA SET CT11DI01   AT LEVEL 005 AS OF 07/16/91                      
*                                                                               
*  CT11DI01:  CTMAD11 INPUT FRAME DSECT                                         
*                                                                               
*  $MAD ITEM TYPE 140          (BASIC HEADLINE INFORMATION:  BH)                
*                                                                               
CT11IN01 DSECT                                                                  
*                                                                               
BHSTAT   DS    CL5                 STATION CALL + MEDIA                         
BHSERV   DS    CL1                 SERVICE: 1ST LETTER                          
BHSTDT   DS    CL8                 FLIGHT START DATE                            
BHENDT   DS    CL8                 FLIGHT END DATE                              
BHCOMPET DS    CL1                 Y = INCLUDE COMPETITIVE                      
BHRATES  DS    CL1                 Y = INCLUDE RATES                            
