*          DATA SET CT12DO04   AT LEVEL 003 AS OF 07/16/91                      
*                                                                               
*  CT11DO04:  CTMAD11 INPUT FRAME DSECT                                         
*                                                                               
*  $MAD ITEM TYPE 133          (RATIONALE INFORMATION:  RI)                     
*                                                                               
CT11O04  DSECT                                                                  
*                                                                               
RIRATL#  DS    CL2                 RATIONALE NUMBER                             
RIRATLIN DS    CL2                 LINE NUMBER W/IN RATIONALE                   
RIRATL   DS    CL1                 VARIABLE LENGTH RATIONALE TEXT               
