*          DATA SET CT1XDO03   AT LEVEL 007 AS OF 02/28/92                      
*                                                                               
*  CT1XDO03:  CTMAD10-12 INPUT FRAME DSECT                                      
*                                                                               
*  $MAD ITEM TYPE 132          (DEMOGRAPHIC VALUES:  DV)                        
*                                                                               
CT1XO03  DSECT                                                                  
*                                                                               
DVCOMBO  DS    CL1                 Y = INVENTORY IS A COMBO                     
DVBOOK   DS    CL8                 BOOK TO WHICH DATA PERTAINS                  
DVDEMOCT DS    CL2                 NUMBER OF DEMOGRAPHICS                       
*  FOLLOWING ITEMS APPEAR VARIABLE NUMBER OF TIMES DEPENDENT UPON               
*    VALUE IN DVDEMOCT                                                          
DVDEMLEN DS    CL1                 LENGTH OF FOLLOWING DEMO VALUE               
DVDEMO   DS    CL1                 VARIABLE LENGTH DEMOGRAPHIC VALUE            
