*          DATA SET CTDEBFDD   AT LEVEL 001 AS OF 10/08/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0FFDD      DATE 10/08/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL78     3    2   78  L  P H             T        Y              
DEBHDR1H DS    XL8                                                              
DEBHDR1  DS    CL78     4    2   78  L  P H             T        Y              
DEBSE2H  DS    XL8                                                              
DEBSE2   DS    CL3      5    2    3  A  U N             T        Y              
DEBTRAPH DS    XL8                                                              
DEBTRAP  DS    CL8      5    6    8  A  U N             T        Y              
DEBTYPEH DS    XL8                                                              
DEBTYPE  DS    CL3      5   15    3  A  U N             T        Y              
DEBLENGH DS    XL8                                                              
DEBLENG  DS    CL3      5   19    3  A  U N             T        Y              
DEBTESTH DS    XL8                                                              
DEBTEST  DS    CL8      5   23    8  A  U N             T        Y              
DEBDATAH DS    XL8                                                              
DEBDATA  DS    CL48     5   32   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      6    6    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   15    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      6   19    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      6   23    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL48     6   32   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      7    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      7    6    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      7   15    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      7   19    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      7   23    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL48     7   32   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      8    6    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   15    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      8   19    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      8   23    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL48     8   32   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      9    6    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      9   15    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      9   19    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8      9   23    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL48     9   32   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     10    6    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   15    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     10   19    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     10   23    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL48    10   32   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11    6    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   15    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   19    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   23    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL48    11   32   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12    6    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   15    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   19    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   23    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL48    12   32   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13    6    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   15    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   19    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   23    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL48    13   32   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14    6    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   15    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   19    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   23    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL48    14   32   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15    6    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   15    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   19    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   23    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL48    15   32   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16    6    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   15    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   19    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   23    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL48    16   32   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17    6    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   15    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   19    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   23    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL48    17   32   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18    6    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   15    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   19    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   23    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL48    18   32   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19    6    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   15    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   19    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   23    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL48    19   32   48  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20    6    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   15    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   19    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   23    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL48    20   32   48  A  U N             T        Y              
         DS    XL1                                                              
         DS    XL2    INDICS= 1                                                 
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2112 BYTES                            
