*          DATA SET CTDEBREGS  AT LEVEL 001 AS OF 10/15/09                      
*************************************************************                   
*        DSECT TO COVER TCB REGISTERS                       *                   
*************************************************************                   
         SPACE 1                                                                
DEBUGREG DSECT                                                                  
TCBPSW   DS    A                                                                
TCBPSWA  DS    A                                                                
TCBR0    DS    A                                                                
TCBR1    DS    A                                                                
TCBR2    DS    A                                                                
TCBR3    DS    A                                                                
TCBR4    DS    A                                                                
TCBR5    DS    A                                                                
TCBR6    DS    A                                                                
TCBR7    DS    A                                                                
TCBR8    DS    A                                                                
TCBR9    DS    A                                                                
TCBRA    DS    A                                                                
TCBRB    DS    A                                                                
TCBRC    DS    A                                                                
TCBRD    DS    A                                                                
TCBRE    DS    A                                                                
TCBRF    DS    A                                                                
