*          DATA SET CTDEBFED   AT LEVEL 001 AS OF 10/08/09                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0FFED      DATE 10/08/09                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL78     3    2   78  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL78     4    2   78  L  P H             T        Y              
DEBSELH  DS    XL8                                                              
DEBSEL   DS    CL3      5    2    3  A  U N             T        Y              
DEBLINH  DS    XL8                                                              
DEBLIN   DS    CL75     5    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      6    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75     6    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      7    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75     7    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      8    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75     8    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75     9    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    10    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    11    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    12    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    13    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    14    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    15    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    16    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    17    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    18    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    19    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    20    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    21    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    22    6   75  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL75    23    6   75  L  P N             T        Y              
DEBSXXH  DS    XL8                                                              
DEBSXX   DS    CL3     24    2    3  A  U N             T        Y              
DEBLXXH  DS    XL8                                                              
DEBLXX   DS    CL75    24    6   75  L  P N             T        Y              
         DS    XL1                                                              
         DS    XL2    INDICS=                                                   
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2056 BYTES                            
