*          DATA SET CTESSA2D   AT LEVEL 013 AS OF 12/09/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0EA2D      DATE 12/09/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
XF1TYPNH DS    CL8                                                              
XF1TYPN  DS    CL16     9    2   16  L  P N             T        Y              
XF1TYPH  DS    CL8                                                              
XF1TYP   DS    CL3      9   20    3  A  U H             T        Y    1         
XF1TYPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16     9   37   16  L  P N             T        Y              
XF1RNMH  DS    CL8                                                              
XF1RNM   DS    CL8      9   55    8  A  U H             T        Y    2         
XF1RNMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      9   68    4  L  P N             T        Y              
XF1MODH  DS    CL8                                                              
XF1MOD   DS    CL1      9   74    1  A  U H             T        Y    3         
XF1MODX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    10    2   16  L  P N             T        Y              
XF1BNMH  DS    CL8                                                              
XF1BNM   DS    CL10    10   20   10  A  U H             T        Y    4         
XF1BNMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    10   37   16  L  P N             T        Y              
XF1MTOH  DS    CL8                                                              
XF1MTO   DS    CL12    10   55   12  A  U H             T        Y    5         
XF1MTOX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    11    2   16  L  P N             T        Y              
XF1DSNH  DS    CL8                                                              
XF1DSN   DS    CL44    11   20   44  A  U H             T        Y    6         
XF1DSNX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    12    2   16  L  P N             T        Y              
XF1FTMH  DS    CL8                                                              
XF1FTM   DS    CL8     12   20    8  A  U H             T        Y    7         
XF1FTMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    12   37   16  L  P N             T        Y              
XF1TTMH  DS    CL8                                                              
XF1TTM   DS    CL8     12   55    8  A  U H             T        Y    8         
XF1TTMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    13    2   16  L  P N             T        Y              
XF1FDAH  DS    CL8                                                              
XF1FDA   DS    CL8     13   20    8  A  U H             T        Y    9         
XF1FDAX  DS    CL8                                                              
XF1FFLH  DS    CL8                                                              
XF1FFL   DS    CL1     13   30    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL16    13   37   16  L  P N             T        Y              
XF1TDAH  DS    CL8                                                              
XF1TDA   DS    CL8     13   55    8  A  U H             T        Y   11         
XF1TDAX  DS    CL8                                                              
XF1TFLH  DS    CL8                                                              
XF1TFL   DS    CL1     13   64    1  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL78    15    2   78  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL78    16    2   78  A  P H             T        Y              
XF1ACT1H DS    CL8                                                              
XF1ACT1  DS    CL3     17    2    3  A  U N             T        Y              
XF1LIN1H DS    CL8                                                              
XF1LIN1  DS    CL74    17    6   74  A  P N             T        Y              
XF1ACT2H DS    CL8                                                              
XF1ACT2  DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
XF1TENDH DS    CL8                                                              
XF1TEND  DS    CL1     23    2    1  L  P N             T        Y              
XF1LAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
XF1WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1264 BYTES                            
