*          DATA SET CTESSA1D   AT LEVEL 014 AS OF 12/09/98                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0EA1D      DATE 12/09/98                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL16     9    2   16  L  P N             T        Y              
XF2EIDH  DS    CL8                                                              
XF2EID   DS    CL8      9   20    8  A  U H             T        Y    1         
XF2EIDX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16     9   37   16  L  P N             T        Y              
XF2FNMH  DS    CL8                                                              
XF2FNM   DS    CL8      9   55    8  A  U H             T        Y    2         
XF2FNMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL16    10    2   16  L  P N             T        Y              
XF2LOADH DS    CL8                                                              
XF2LOAD  DS    CL1     10   20    1  A  U H             T        Y    3         
XF2LOADX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    11    2   78  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL78    12    2   78  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL78    13    2   78  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL16    14    2   16  L  P N             T        Y              
XF2DNOH  DS    CL8                                                              
XF2DNO   DS    CL10    14   20   10  L  P N             T        Y              
XF2TNOH  DS    CL8                                                              
XF2TNO   DS    CL8     14   31    8  L  P N             T        Y              
XF2SNOH  DS    CL8                                                              
XF2SNO   DS    CL30    14   41   30  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    15    2   16  L  P N             T        Y              
XF2DREH  DS    CL8                                                              
XF2DRE   DS    CL10    15   20   10  L  P N             T        Y              
XF2TREH  DS    CL8                                                              
XF2TRE   DS    CL8     15   31    8  L  P N             T        Y              
XF2SREH  DS    CL8                                                              
XF2SRE   DS    CL30    15   41   30  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    16    2   16  L  P N             T        Y              
XF2DCOH  DS    CL8                                                              
XF2DCO   DS    CL10    16   20   10  L  P N             T        Y              
XF2TCOH  DS    CL8                                                              
XF2TCO   DS    CL8     16   31    8  L  P N             T        Y              
XF2SCOH  DS    CL8                                                              
XF2SCO   DS    CL30    16   41   30  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    18    2   16  L  P N             T        Y              
XF2LIN1H DS    CL8                                                              
XF2LIN1  DS    CL78    19    2   78  L  P N             T        Y              
XF2LIN2H DS    CL8                                                              
XF2LIN2  DS    CL78    20    2   78  L  P N             T        Y              
XF2LIN3H DS    CL8                                                              
XF2LIN3  DS    CL78    21    2   78  L  P N             T        Y              
XF2LIN4H DS    CL8                                                              
XF2LIN4  DS    CL78    22    2   78  L  P N             T        Y              
XF2LIN5H DS    CL8                                                              
XF2LIN5  DS    CL78    23    2   78  L  P N             T        Y              
XF2TENDH DS    CL8                                                              
XF2TEND  DS    CL1     24    2    1  L  P N             T        Y              
XF2LAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
XF2WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1152 BYTES                            
