*          DATA SET CTESSF6D   AT LEVEL 001 AS OF 06/18/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0EF6D      DATE 06/18/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL16     4    2   16  L  P H             T        Y              
BDEAGYH  DS    XL8                                                              
BDEAGY   DS    CL2      4   20    2  A  U N             T        Y    1         
BDEAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16     4   37   16  L  P H             T        Y              
BDEIDH   DS    XL8                                                              
BDEID    DS    CL5      4   54    5  A  U N             T        Y    2         
BDEIDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16     6    2   16  L  P N             T        Y              
BDEEIDH  DS    XL8                                                              
BDEEID   DS    CL8      6   20    8  A  U H             T        Y   18         
BDEEIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16     6   37   16  L  P N             T        Y              
BDEPQUH  DS    XL8                                                              
BDEPQU   DS    CL10     6   54   10  A  U H             T        Y   21         
BDEPQUX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16     7    2   16  L  P N             T        Y              
BDEFILH  DS    XL8                                                              
BDEFIL   DS    CL60     7   20   60  A  U H             T        Y   19         
BDEFILX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16     8    2   16  L  P N             T        Y              
BDESUBH  DS    XL8                                                              
BDESUB   DS    CL60     8   20   60  A  U H             T        Y   20         
BDESUBX  DS    XL8                                                              
BDETENDH DS    XL8                                                              
BDETEND  DS    CL1      9    2    1  L  P N             T        Y              
BDELAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
BDEWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 400  BYTES                            
