*          DATA SET CTESSFFD   AT LEVEL 009 AS OF 07/14/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0EFFD      DATE 07/14/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
ESSMSGH  DS    CL8                                                              
ESSMSG   DS    CL60     1    2   60  L  P H             T        Y              
ESSSRVH  DS    CL8                                                              
ESSSRV   DS    CL17     1   63   17  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6      2    2    6  L  P N             T        Y              
ESSRECH  DS    CL8                                                              
ESSREC   DS    CL8      2   10    8  A  U H        M    T    I   Y              
         DS    CL8                                                              
         DS    CL6      2   20    6  L  P N             T        Y              
ESSACTH  DS    CL8                                                              
ESSACT   DS    CL8      2   27    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      2   37    3  L  P N             T        Y              
ESSKEYH  DS    CL8                                                              
ESSKEY   DS    CL39     2   41   39  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      3    2    7  L  P N             T        Y              
ESSOPTH  DS    CL8                                                              
ESSOPT   DS    CL70     3   10   70  A  U N             T        Y              
ESSTABH  DS    CL8                                                              
ESSTAB   DS    CL1      4   10    1  A  U N             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 320  BYTES                            
