*          DATA SET CTESSF7D   AT LEVEL 001 AS OF 06/18/02                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0EF7D      DATE 06/18/02                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL17     4    2   17  L  P H             T        Y              
REFAGYH  DS    XL8                                                              
REFAGY   DS    CL2      4   20    2  A  U N             T        Y    1         
REFAGYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17     4   37   17  L  P H             T        Y              
REFTIDH  DS    XL8                                                              
REFTID   DS    CL5      4   55    5  A  U N             T        Y    2         
REFTIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17     5    2   17  L  P N             T        Y              
REFVERH  DS    XL8                                                              
REFVER   DS    CL3      5   20    3  A  U H             T        Y   28         
REFVERX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17     5   37   17  L  P N             T        Y              
REFLEVH  DS    XL8                                                              
REFLEV   DS    CL3      5   55    3  A  U H             T        Y   29         
REFLEVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17     6    2   17  L  P N             T        Y              
REFSYSH  DS    XL8                                                              
REFSYS   DS    CL7      6   20    7  A  U H             T        Y    3         
REFSYSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17     6   37   17  L  P N             T        Y              
REFSUBH  DS    XL8                                                              
REFSUB   DS    CL7      6   55    7  A  U H             T        Y    4         
REFSUBX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17     7    2   17  L  P N             T        Y              
REFTABH  DS    XL8                                                              
REFTAB   DS    CL5      7   20    5  A  U H             T        Y    5         
REFTABX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17     7   37   17  L  P N             T        Y              
REFACTH  DS    XL8                                                              
REFACT   DS    CL1      7   55    1  A  U H             T        Y    6         
REFACTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17     8    2   17  L  P N             T        Y              
REFDTMH  DS    XL8                                                              
REFDTM   DS    CL1      8   20    1  A  U H             T        Y    7         
REFDTMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17     8   37   17  L  P N             T        Y              
REFPLFMH DS    XL8                                                              
REFPLFM  DS    CL8      8   55    8  A  U H             T        Y    8         
REFPLFMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17     9    2   17  L  P N             T        Y              
REFDELMH DS    XL8                                                              
REFDELM  DS    CL8      9   20    8  A  U H             T        Y    9         
REFDELMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17     9   37   17  L  P N             T        Y              
REFEORH  DS    XL8                                                              
REFEOR   DS    CL8      9   55    8  A  U H             T        Y   10         
REFEORX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    10    2   17  L  P N             T        Y              
REFTEXTH DS    XL8                                                              
REFTEXT  DS    CL8     10   20    8  A  U H             T        Y   11         
REFTEXTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    10   37   17  L  P N             T        Y              
REFNULLH DS    XL8                                                              
REFNULL  DS    CL8     10   55    8  A  U H             T        Y   12         
REFNULLX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    11    2   17  L  P N             T        Y              
REFMONYH DS    XL8                                                              
REFMONY  DS    CL8     11   20    8  A  U H             T        Y   13         
REFMONYX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    11   37   17  L  P N             T        Y              
REFDATFH DS    XL8                                                              
REFDATF  DS    CL8     11   55    8  A  U H             T        Y   14         
REFDATFX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    12    2   17  L  P N             T        Y              
REFSPCH  DS    XL8                                                              
REFSPC   DS    CL1     12   20    1  A  U H             T        Y   30         
REFSPCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    12   37   17  L  P N             T        Y              
REFBDEH  DS    XL8                                                              
REFBDE   DS    CL8     12   55    8  A  U H             T        Y   28         
REFBDEX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    13    2   17  L  P N             T        Y              
REFSQLBH DS    XL8                                                              
REFSQLB  DS    CL10    13   20   10  A  U H             T        Y   15         
REFSQLBX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    13   37   17  L  P N             T        Y              
REFSQLAH DS    XL8                                                              
REFSQLA  DS    CL10    13   55   10  A  U H             T        Y   16         
REFSQLAX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    14    2   17  L  P N             T        Y              
REFSQLIH DS    XL8                                                              
REFSQLI  DS    CL1     14   20    1  A  U H             T        Y   17         
REFSQLIX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    14   37   17  L  P N             T        Y              
REFTABNH DS    XL8                                                              
REFTABN  DS    CL24    14   55   24  A  U H             T        Y   18         
REFTABNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    15    2   17  L  P N             T        Y              
REFHSRH  DS    XL8                                                              
REFHSR   DS    CL6     15   20    6  A  U H             T        Y   20         
REFHSRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    15   37   17  L  P N             T        Y              
REFHERH  DS    XL8                                                              
REFHER   DS    CL6     15   55    6  A  U H             T        Y   21         
REFHERX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    16    2   17  L  P N             T        Y              
REFDSRH  DS    XL8                                                              
REFDSR   DS    CL6     16   20    6  A  U H             T        Y   22         
REFDSRX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    16   37   17  L  P N             T        Y              
REFDERH  DS    XL8                                                              
REFDER   DS    CL6     16   55    6  A  U H             T        Y   23         
REFDERX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    17    2   17  L  P N             T        Y              
REFDSCH  DS    XL8                                                              
REFDSC   DS    CL6     17   20    6  A  U H             T        Y   24         
REFDSCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    17   37   17  L  P N             T        Y              
REFDECH  DS    XL8                                                              
REFDEC   DS    CL6     17   55    6  A  U H             T        Y   25         
REFDECX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10    17   64   10  L  P N             T        Y              
REFDCNH  DS    XL8                                                              
REFDCN   DS    CL1     17   75    1  A  U H             T        Y   31         
REFDCNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    18    2   17  L  P N             T        Y              
REFKEYH  DS    XL8                                                              
REFKEY   DS    CL50    18   20   50  A  U H             T        Y   26         
REFKEYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    19    2   17  L  P N             T        Y              
REFFORMH DS    XL8                                                              
REFFORM  DS    CL53    19   20   53  A  U H             T        Y   27         
REFFORMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    20    2   78  A  U H             T        Y   27         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    21    2   78  A  U H             T        Y   27         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    22    2   78  A  U H             T        Y   27         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    23    2   78  A  U H             T        Y   27         
         DS    XL8                                                              
REFTENDH DS    XL8                                                              
REFTEND  DS    CL1     24    2    1  L  P N             T        Y              
REFLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
REFWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1936 BYTES                            
