*          DATA SET CTESSB9D   AT LEVEL 008 AS OF 07/14/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0EB9D      DATE 07/14/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      5    2    9  A  P H             T        Y              
REPREQH  DS    CL8                                                              
REPREQ   DS    CL3      5   27    3  A  U N             T        Y   50         
REPREQX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      6    2    9  A  P H             T        Y              
REPWHENH DS    CL8                                                              
REPWHEN  DS    CL10     6   27   10  A  U N             T        Y   51         
REPWHENX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     7    2   14  A  P N             T        Y              
REPDESTH DS    CL8                                                              
REPDEST  DS    CL10     7   27   10  A  U N             T        Y   52         
REPDESTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      8    2    6  A  P N             T        Y              
REPSYSH  DS    CL8                                                              
REPSYS   DS    CL7      8   27    7  A  U N             T        Y  100         
REPSYSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      9    2    4  A  P N             T        Y              
REPTYPH  DS    CL8                                                              
REPTYP   DS    CL1      9   27    1  A  U N             T        Y  101         
REPTYPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8     10    2    8  A  P N             T        Y              
REPLNGSH DS    CL8                                                              
REPLNGS  DS    CL13    10   27   13  A  U N             T        Y  102         
REPLNGSX DS    CL8                                                              
REPLNGFH DS    CL8                                                              
REPLNGF  DS    CL13    10   45   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   27    1  A  U N             T        Y              
REPLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
REPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 272  BYTES                            
