*          DATA SET CTESSFDD   AT LEVEL 002 AS OF 10/23/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0EFDD      DATE 10/23/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL16     5    2   16  L  P H             T        Y              
ESSIDH   DS    XL8                                                              
ESSID    DS    CL5      5   20    5  A  U N             T        Y    1         
ESSIDX   DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16     7    2   16  L  P N             T        Y              
ESSVERH  DS    XL8                                                              
ESSVER   DS    CL3      7   20    3  A  U H             T        Y    3         
ESSVERX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16     7   37   16  L  P N             T        Y              
ESSLEVH  DS    XL8                                                              
ESSLEV   DS    CL3      7   54    3  A  U H             T        Y    2         
ESSLEVX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16     7   60   16  L  P N             T        Y              
ESSHCODH DS    XL8                                                              
ESSHCOD  DS    CL1      7   77    1  A  U H             T        Y    8         
ESSHCODX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16     8    2   16  L  P N             T        Y              
ESSINHH  DS    XL8                                                              
ESSINH   DS    CL1      8   20    1  A  U H             T        Y    4         
ESSINHX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16     8   37   16  L  P N             T        Y              
ESSNFTPH DS    XL8                                                              
ESSNFTP  DS    CL1      8   54    1  A  U H             T        Y    5         
ESSNFTPX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16     8   60   16  L  P N             T        Y              
ESSRCOMH DS    XL8                                                              
ESSRCOM  DS    CL1      8   77    1  A  U H             T        Y    6         
ESSRCOMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16     9    2   16  L  P N             T        Y              
ESSENIDH DS    XL8                                                              
ESSENID  DS    CL8      9   20    8  A  U H             T        Y   10         
ESSENIDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16     9   37   16  L  P N             T        Y              
ESSELUH  DS    XL8                                                              
ESSELU   DS    CL8      9   54    8  A  U H             T        Y   11         
ESSELUX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    10    2   16  L  P N             T        Y              
ESSPWDH  DS    XL8                                                              
ESSPWD   DS    CL8     10   20    8  A  U H             T        Y   14         
ESSPWDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    10   37   16  L  P N             T        Y              
ESSEKEYH DS    XL8                                                              
ESSEKEY  DS    CL10    10   54   10  A  U H             T        Y   15         
ESSEKEYX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    11    2   16  L  P N             T        Y              
ESSFACH  DS    XL8                                                              
ESSFAC   DS    CL8     11   20    8  A  U H             T        Y   16         
ESSFACX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    11   37   16  L  P N             T        Y              
ESSCOMH  DS    XL8                                                              
ESSCOM   DS    CL1     11   54    1  A  U H             T        Y   18         
ESSCOMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    11   60   16  L  P N             T        Y              
ESSCORH  DS    XL8                                                              
ESSCOR   DS    CL1     11   77    1  A  U H             T        Y   32         
ESSCORX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    12    2   16  L  P N             T        Y              
ESSRBLH  DS    XL8                                                              
ESSRBL   DS    CL8     12   20    8  A  U H             T        Y   19         
ESSRBLX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    12   37   16  L  P N             T        Y              
ESSTSTH  DS    XL8                                                              
ESSTST   DS    CL1     12   54    1  A  U H             T        Y   20         
ESSTSTX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    12   60   16  L  P N             T        Y              
ESSBINH  DS    XL8                                                              
ESSBIN   DS    CL1     12   77    1  A  U H             T        Y   33         
ESSBINX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    13    2   16  L  P N             T        Y              
ESSSLIMH DS    XL8                                                              
ESSSLIM  DS    CL3     13   20    3  A  U H             T        Y   23         
ESSSLIMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    13   37   16  L  P N             T        Y              
ESSFTPSH DS    XL8                                                              
ESSFTPS  DS    CL8     13   54    8  A  U H             T        Y   24         
ESSFTPSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    14    2   16  L  P N             T        Y              
ESSATIMH DS    XL8                                                              
ESSATIM  DS    CL8     14   20    8  A  U H             T        Y   30         
ESSATIMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    14   37   16  L  P N             T        Y              
ESSTRACH DS    XL8                                                              
ESSTRAC  DS    CL2     14   54    2  A  U H             T        Y   31         
ESSTRACX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    14   60   16  L  P N             T        Y              
ESSSIMH  DS    XL8                                                              
ESSSIM   DS    CL1     14   77    1  A  U H             T        Y   34         
ESSSIMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    16    2   16  L  P N             T        Y              
ESSEPUH  DS    XL8                                                              
ESSEPU   DS    CL10    16   20   10  A  U H             T        Y   28         
ESSEPUX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    16   37   16  L  P N             T        Y              
ESSLINEH DS    XL8                                                              
ESSLINE  DS    CL10    16   54   10  A  U H             T        Y   29         
ESSLINEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    17    2   16  L  P N             T        Y              
ESSLOCNH DS    XL8                                                              
ESSLOCN  DS    CL30    17   20   30  A  U H             T        Y   22         
ESSLOCNX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    18    2   16  L  P N             T        Y              
ESSCPHOH DS    XL8                                                              
ESSCPHO  DS    CL40    18   20   40  A  U H             T        Y   26         
ESSCPHOX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    19    2   16  L  P N             T        Y              
ESSCNAMH DS    XL8                                                              
ESSCNAM  DS    CL40    19   20   40  L  U H             T        Y   27         
ESSCNAMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    21    2   16  L  P N             T        Y              
ESSNFFRH DS    XL8                                                              
ESSNFFR  DS    CL40    21   20   40  L  U H             T        Y   41         
ESSNFFRX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    22    2   16  L  P N             T        Y              
ESSNFTOH DS    XL8                                                              
ESSNFTO  DS    CL40    22   20   40  L  U H             T        Y   42         
ESSNFTOX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    23    2   16  L  P N             T        Y              
ESSNFIPH DS    XL8                                                              
ESSNFIP  DS    CL40    23   20   40  L  U H             T        Y   43         
ESSNFIPX DS    XL8                                                              
ESSTENDH DS    XL8                                                              
ESSTEND  DS    CL1     24    2    1  L  P N             T        Y              
ESSLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
ESSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1560 BYTES                            
