*          DATA SET CTFUSFFD   AT LEVEL 020 AS OF 04/09/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA08FFD      DATE 04/09/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
FUSMSGH  DS    CL8                                                              
FUSMSG   DS    CL60     1    2   60  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL17     1   63   17  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      2    2    6  L  P H             T        Y              
FUSACTNH DS    CL8                                                              
FUSACTN  DS    CL8      2   10    8  A  U N        M    T    I   Y    1         
FUSACTNX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      2   19    6  L  P H             T        Y              
FUSSYSH  DS    CL8                                                              
FUSSYS   DS    CL8      2   27    8  A  U N             T        Y    2         
FUSSYSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      2   36    7  L  P H             T        Y              
FUSPRGH  DS    CL8                                                              
FUSPRG   DS    CL5      2   44    5  A  U N             T        Y    3         
FUSPRGX  DS    CL8                                                              
FUSPRGDH DS    CL8                                                              
FUSPRGD  DS    CL30     2   50   30  A  P N             T        Y              
FUSUHDH  DS    CL8                                                              
FUSUHD   DS    CL7      3    2    7  L  P H             T        Y              
FUSUIDH  DS    CL8                                                              
FUSUID   DS    CL8      3   10    8  A  P N             T        Y    4         
FUSUIDX  DS    CL8                                                              
FUSFLD1H DS    CL8                                                              
FUSFLD1  DS    CL7      4    2    7  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      4   10    3  A  U H             T        Y    5         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL62     4   15   62  A  P N             T        Y              
FUSFLD2H DS    CL8                                                              
FUSFLD2  DS    CL7      5    2    7  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      5   10    3  A  U H             T        Y    6         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL62     5   15   62  A  P N             T        Y              
FUSFLD3H DS    CL8                                                              
FUSFLD3  DS    CL7      6    2    7  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      6   10    3  A  U H             T        Y    7         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL62     6   15   62  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7      7    2    7  L  P N             T        Y              
FUSFILTH DS    CL8                                                              
FUSFILT  DS    CL67     7   10   67  A  U H             T        Y    8         
FUSFILTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8    2    7  L  P N             T        Y              
FUSOPTNH DS    CL8                                                              
FUSOPTN  DS    CL67     8   10   67  A  U H             T        Y   10         
FUSOPTNX DS    CL8                                                              
FUSTAB1H DS    CL8                                                              
FUSTAB1  DS    CL1      8   79    1  A  U N             T        Y    9         
FUSTAB1X DS    CL8                                                              
FUSLHD1H DS    CL8                                                              
FUSLHD1  DS    CL79    10    2   79  L  P H             T        Y              
FUSLHD2H DS    CL8                                                              
FUSLHD2  DS    CL79    11    2   79  L  P H             T        Y              
FUSLIN1H DS    CL8                                                              
FUSLIN1  DS    CL18    12    2   18  A  P N             T        Y              
FUSINP1H DS    CL8                                                              
FUSINP1  DS    CL11    12   22   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    12   40   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    12   60   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    13    2   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   22   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    13   40   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    13   60   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    14    2   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   22   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    14   40   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    14   60   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    15    2   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   22   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    15   40   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    15   60   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    16    2   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   22   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    16   40   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    16   60   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    17    2   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   22   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    17   40   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    17   60   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    18    2   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   22   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    18   40   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    18   60   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    19    2   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   22   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    19   40   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    19   60   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    20    2   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   22   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    20   40   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    20   60   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    21    2   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   22   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    21   40   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    21   60   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    22    2   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   22   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    22   40   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    22   60   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    23    2   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    23   22   11  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL18    23   40   18  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    23   60   11  A  U N             T        Y              
FUSTAB2H DS    CL8                                                              
FUSTAB2  DS    CL1     24    2    1  A  U N             T        Y              
FUSLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
FUSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2080 BYTES                            
