*          DATA SET CTGENBED   AT LEVEL 001 AS OF 08/21/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BBED      DATE 08/21/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL13     5    2   13  A  P H             T        Y              
PNMLUIDH DS    CL8                                                              
PNMLUID  DS    CL8      5   20    8  A  U N             T        Y  100         
PNMLUIDX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13     6    2   13  A  P N             T        Y              
PNMDESCH DS    CL8                                                              
PNMDESC  DS    CL60     6   20   60  A  U N             T        Y  101         
PNMDESCX DS    CL8                                                              
PNMMSGH  DS    CL8                                                              
PNMMSG   DS    CL68     7    2   68  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL4      7   72    4  L  P H             T        Y              
PNMPAGEH DS    CL8                                                              
PNMPAGE  DS    CL3      7   77    3  A  P H             T        Y              
PNMTBARH DS    CL8                                                              
PNMTBAR  DS    CL15     8    2   15  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL32     8   18   32  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL29     8   51   29  A  P H             T        Y              
PNMPNDAH DS    CL8                                                              
PNMPNDA  DS    CL20     9    2   20  A  U N             T        Y              
PNMPNDBH DS    CL8                                                              
PNMPNDB  DS    CL20     9   28   20  A  U N             T        Y              
PNMPNDCH DS    CL8                                                              
PNMPNDC  DS    CL20     9   54   20  A  U N             T        Y              
PNMPNDDH DS    CL8                                                              
PNMPNDD  DS    CL20    10    2   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    10   28   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    10   54   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    11    2   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    11   28   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    11   54   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    12    2   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    12   28   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    12   54   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    13    2   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    13   28   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    13   54   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    14    2   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    14   28   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    14   54   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    15    2   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    15   28   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    15   54   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    16    2   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    16   28   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    16   54   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    17    2   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    17   28   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    17   54   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    18    2   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    18   28   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    18   54   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    19    2   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    19   28   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    19   54   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    20    2   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    20   28   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    20   54   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    21    2   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    21   28   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    21   54   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    22    2   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    22   28   20  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL20    22   54   20  A  U N             T        Y              
PNMBBARH DS    CL8                                                              
PNMBBAR  DS    CL78    23    2   78  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A  P H             T        Y              
PNMLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
PNMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1696 BYTES                            
