*          DATA SET CTGENF4D   AT LEVEL 009 AS OF 12/19/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BF4D      DATE 12/19/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL16     5    2   16  L  P H             T        Y              
XFIAGYH  DS    CL8                                                              
XFIAGY   DS    CL2      5   20    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     6    2   16  L  P H             T        Y              
XFISYSH  DS    CL8                                                              
XFISYS   DS    CL7      6   20    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     6   37   16  L  P H             T        Y              
XFISUBH  DS    CL8                                                              
XFISUB   DS    CL7      6   55    7  A  U N             T        Y              
XFIDACNH DS    CL8                                                              
XFIDACN  DS    CL16     7    2   16  L  P H             T        Y              
XFIDACH  DS    CL8                                                              
XFIDAC   DS    CL8      7   20    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     7   37   16  L  P H             T        Y              
XFITICH  DS    CL8                                                              
XFITIC   DS    CL8      7   55    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL17     8    2   17  L  P H             T        Y              
XFIGNUMH DS    CL8                                                              
XFIGNUM  DS    CL5      8   20    5  A  U N             T        Y              
XFITABH  DS    CL8                                                              
XFITAB   DS    CL16    10    2   16  L  P N             T        Y              
XFILAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
XFIWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 264  BYTES                            
