*          DATA SET CTGENC7D   AT LEVEL 001 AS OF 01/23/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BC7D      DATE 01/23/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      4    2    6  L   P    H         T        Y              
LSTSYSH  DS    CL8                                                              
LSTSYS   DS    CL7      4    9    7  A   U    N         T        Y    1         
LSTSYSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      4   20    7  L   P    H         T        Y              
LSTPRGH  DS    CL8                                                              
LSTPRG   DS    CL3      4   28    3  A   U    N         T        Y    2         
LSTPRGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      4   37    8  L   P    N         T        Y              
LSTLNGH  DS    CL8                                                              
LSTLNG   DS    CL13     4   46   13  A   U    N         T        Y    3         
LSTLNGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      6    2    3  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6      6    6    6  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      6   15    7  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4      6   24    4  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11     6   30   11  L   P    N         T        Y              
LSTACTH  DS    CL8                                                              
LSTACT   DS    CL3      7    2    3  A   U    N         T        Y              
LSTLINH  DS    CL8                                                              
LSTLIN   DS    CL74     7    6   74  A   P    N         T        Y              
LSTACT2H DS    CL8                                                              
LSTACT2  DS    CL3      8    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74     8    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74     9    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    10    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    11    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    12    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    13    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    14    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    15    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    16    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    17    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    18    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    19    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    20    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    21    6   74  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL74    22    6   74  A   P    N         T        Y              
LSTLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1680 BYTES                            
