*          DATA SET CTGENFDD   AT LEVEL 001 AS OF 03/06/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BFDD      DATE 03/06/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL11     5    2   11  A  P H             T        Y              
OUTTYPEH DS    XL8                                                              
OUTTYPE  DS    CL10     5   27   10  A  U N             T        Y  100         
OUTTYPEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
OUTDESTH DS    XL8                                                              
OUTDEST  DS    CL5      7   27    5  A  U H             T        Y  101         
OUTDESTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16     8    2   16  A  P N             T        Y              
OUTCLASH DS    XL8                                                              
OUTCLAS  DS    CL1      8   27    1  A  U H             T        Y  102         
OUTCLASX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     9    2   12  A  P N             T        Y              
OUTPRTYH DS    XL8                                                              
OUTPRTY  DS    CL2      9   27    2  A  U H             T        Y  103         
OUTPRTYX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    10    2   17  A  P N             T        Y              
OUTPWRCH DS    XL8                                                              
OUTPWRC  DS    CL4     10   27    4  A  U H             T        Y  104         
OUTPWRCX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL15    11    2   15  A  P N             T        Y              
OUTTAPEH DS    XL8                                                              
OUTTAPE  DS    CL4     11   27    4  A  U H             T        Y  105         
OUTTAPEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    12    2   16  A  P N             T        Y              
OUTCPYSH DS    XL8                                                              
OUTCPYS  DS    CL1     12   27    1  A  U H             T        Y  106         
OUTCPYSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL17    13    2   17  A  P N             T        Y              
OUTSTATH DS    XL8                                                              
OUTSTAT  DS    CL1     13   27    1  A  U H             T        Y  107         
OUTSTATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL19    14    2   19  A  P N             T        Y              
OUTPWRDH DS    XL8                                                              
OUTPWRD  DS    CL1     14   27    1  A  U H             T        Y  108         
OUTPWRDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    15    2   12  A  P N             T        Y              
OUTTDETH DS    XL8                                                              
OUTTDET  DS    CL6     15   27    6  A  U H             T        Y  109         
OUTTDETX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    16    2   12  A  P N             T        Y              
OUTUREQH DS    XL8                                                              
OUTUREQ  DS    CL1     16   27    1  A  U H             T        Y  110         
OUTUREQX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11    17    2   11  A  P N             T        Y              
OUTFCHH  DS    XL8                                                              
OUTFCH   DS    CL1     17   27    1  A  U H             T        Y  111         
OUTFCHX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL18    18    2   18  A  P N             T        Y              
OUTCHRSH DS    XL8                                                              
OUTCHRS  DS    CL4     18   27    4  A  U H             T        Y  112         
OUTCHRSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     18   33    7  A  P N             T        Y              
OUTCHR2H DS    XL8                                                              
OUTCHR2  DS    CL4     18   42    4  A  U H             T        Y  113         
OUTCHR2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     18   48    7  A  P N             T        Y              
OUTCHR3H DS    XL8                                                              
OUTCHR3  DS    CL4     18   57    4  A  U H             T        Y  114         
OUTCHR3X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7     18   63    7  A  P N             T        Y              
OUTCHR4H DS    XL8                                                              
OUTCHR4  DS    CL4     18   72    4  A  U H             T        Y  115         
OUTCHR4X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    20    2   16  A  P N             T        Y              
OUTFMNH  DS    XL8                                                              
OUTFMN   DS    CL3     20   27    3  A  U H             T        Y  116         
OUTFMNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    20   33   16  A  P N             T        Y              
OUTFMDH  DS    XL8                                                              
OUTFMD   DS    CL6     20   51    6  A  U H             T        Y  117         
OUTFMDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    21    2   16  A  P N             T        Y              
OUTPGNH  DS    XL8                                                              
OUTPGN   DS    CL3     21   27    3  A  U H             T        Y  118         
OUTPGNX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    21   33   16  A  P N             T        Y              
OUTPGDH  DS    XL8                                                              
OUTPGD   DS    CL6     21   51    6  A  U H             T        Y  119         
OUTPGDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    23    2   16  A  P N             T        Y              
OUTPQCH  DS    XL8                                                              
OUTPQC   DS    CL1     23   27    1  A  U H             T        Y  120         
OUTPQCX  DS    XL8                                                              
OUTOTABH DS    XL8                                                              
OUTOTAB  DS    CL1     24   27    1  A  U N             T        Y              
OUTLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
OUTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 880  BYTES                            
