*          DATA SET CTGENBFD   AT LEVEL 002 AS OF 09/24/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BBFD      DATE 09/24/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  L  P N             T        Y              
LSTLUIDH DS    CL8                                                              
LSTLUID  DS    CL8      5   10    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      5   20    9  L  P N             T        Y              
LSTUIDH  DS    CL8                                                              
LSTUID   DS    CL10     5   30   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     5   41   12  L  P N             T        Y              
LSTNAMEH DS    CL8                                                              
LSTNAME  DS    CL8      5   54    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12     5   64   12  L  P N             T        Y              
LSTNLSTH DS    CL8                                                              
LSTNLST  DS    CL1      5   77    1  A  U N             T        Y              
LSTHED1H DS    CL8                                                              
LSTHED1  DS    CL79     7    2   79  A  P H             T        Y              
LSTHED2H DS    CL8                                                              
LSTHED2  DS    CL79     8    2   79  A  P H             T        Y              
LSTACT1H DS    CL8                                                              
LSTACT1  DS    CL3      9    2    3  A  U N             T        Y              
LSTLIN1H DS    CL8                                                              
LSTLIN1  DS    CL74     9    6   74  A  P N             T        Y              
LSTACT2H DS    CL8                                                              
LSTACT2  DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    10    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    11    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    12    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
LSTLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1616 BYTES                            
