*          DATA SET CTGENEED   AT LEVEL 003 AS OF 09/11/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BEED      DATE 09/11/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL12     5    2   12  L   P    H         T        Y              
AUTAGYH  DS    CL8                                                              
AUTAGY   DS    CL8      5   15    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12     6    2   12  L   P    H         T        Y              
AUTTYPH  DS    CL8                                                              
AUTTYP   DS    CL2      6   15    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12     7    2   12  L   P    H         T        Y              
AUTNAMH  DS    CL8                                                              
AUTNAM   DS    CL18     7   15   18  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12     8    2   12  L   P    H         T        Y              
AUTINITH DS    CL8                                                              
AUTINIT  DS    CL2      8   15    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    10    2   12  L   P    H         T        Y              
AUTPWDH  DS    CL8                                                              
AUTPWD   DS    CL10    10   15   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    12    2   12  L   P    N         T        Y              
AUTCMTSH DS    CL8                                                              
AUTCMTS  DS    CL60    12   15   60  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    14    2   12  L   P    N         T        Y              
AUTUSR1H DS    CL8                                                              
AUTUSR1  DS    CL60    14   15   60  A   U    N         T        Y              
AUTUSR2H DS    CL8                                                              
AUTUSR2  DS    CL60    15   15   60  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    17    2   12  L   P    N         T        Y              
AUTSYSH  DS    CL8                                                              
AUTSYS   DS    CL7     17   15    7  A   U    N         T        Y              
AUTSHDH  DS    CL8                                                              
AUTSHD   DS    CL78    19    2   78  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL12    21    2   12  L   P    N         T        Y              
AUTACCSH DS    CL8                                                              
AUTACCS  DS    CL12    21   15   12  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    22    2   12  L   P    N         T        Y              
AUTPRG1H DS    CL8                                                              
AUTPRG1  DS    CL65    22   15   65  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    23    2   12  L   P    N         T        Y              
AUTPRG2H DS    CL8                                                              
AUTPRG2  DS    CL65    23   15   65  A   U    N         T        Y              
AUTTABH  DS    CL8                                                              
AUTTAB   DS    CL1     24    2    1  A   U    N         T        Y              
AUTLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
AUTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 784  BYTES                            
