*          DATA SET CTGENCCD   AT LEVEL 005 AS OF 06/01/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BCCD      DATE 06/01/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL9      5    2    9  A  P H             T        Y              
REPREQH  DS    XL8                                                              
REPREQ   DS    CL3      5   27    3  A  U N             T        Y   50         
REPREQX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      6    2    9  A  P H             T        Y              
REPWHENH DS    XL8                                                              
REPWHEN  DS    CL10     6   27   10  A  U N             T        Y   52         
REPWHENX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14     7    2   14  A  P N             T        Y              
REPDESTH DS    XL8                                                              
REPDEST  DS    CL10     7   27   10  A  U N             T        Y   54         
REPDESTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     8    2   12  A  P N             T        Y              
REPOTYPH DS    XL8                                                              
REPOTYP  DS    CL6      8   27    6  A  U N             T        Y   56         
REPOTYPX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    10    2   12  A  P N             T        Y              
REPFORH  DS    XL8                                                              
REPFOR   DS    CL6     10   27    6  A  U N             T        Y  101         
REPFORX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     12    2    8  A  P N             T        Y              
REPSYSH  DS    XL8                                                              
REPSYS   DS    CL1     12   27    1  A  U N             T        Y  110         
REPSYSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8     13    2    8  A  P N             T        Y              
REPPGMH  DS    XL8                                                              
REPPGM   DS    CL7     13   27    7  A  U N             T        Y  120         
REPPGMX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12    14    2   12  A  P N             T        Y              
REPOIDH  DS    XL8                                                              
REPOID   DS    CL8     14   27    8  A  U N             T        Y  130         
REPOIDX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     15   27    1  A  U N             T        Y              
REPLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
REPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 344  BYTES                            
