*          DATA SET CTGENF1D   AT LEVEL 001 AS OF 05/17/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BF1D      DATE 05/17/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A   P    N         T        Y              
NARUSERH DS    CL8                                                              
NARUSER  DS    CL10     5    8   10  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL4      5   30    4  A   P    N         T        Y              
NARLANGH DS    CL8                                                              
NARLANG  DS    CL13     5   37   13  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL6      5   56    6  A   P    N         T        Y              
NARSYSH  DS    CL8                                                              
NARSYS   DS    CL8      5   64    8  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL4      6    2    4  A   P    N         T        Y              
NARTYPH  DS    CL8                                                              
NARTYP   DS    CL11     6    8   11  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL5      6   30    5  A   P    N         T        Y              
NARMEDH  DS    CL8                                                              
NARMED   DS    CL9      6   37    9  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL6      6   56    6  A   P    N         T        Y              
NARCLIH  DS    CL8                                                              
NARCLI   DS    CL5      6   64    5  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL11     8    2   11  A   P    N         T        Y              
NARDESCH DS    CL8                                                              
NARDESC  DS    CL60     8   15   60  A   U    H         T        Y              
NARHDRH  DS    CL8                                                              
NARHDR   DS    CL4     10    2    4  A   P    N         T        Y              
NARDATAH DS    CL8                                                              
NARDATA  DS    CL66    10    8   66  A   U    N         T        Y              
NARSTDH  DS    CL8                                                              
NARSTD   DS    CL3     10   76    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     11    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL66    11    8   66  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   76    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     12    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL66    12    8   66  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   76    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     13    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL66    13    8   66  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   76    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     14    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL66    14    8   66  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   76    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     15    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL66    15    8   66  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   76    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     16    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL66    16    8   66  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   76    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     17    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL66    17    8   66  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   76    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     18    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL66    18    8   66  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   76    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     19    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL66    19    8   66  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   76    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     20    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL66    20    8   66  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   76    3  A   U    N         T        Y              
NARHDRXH DS    CL8                                                              
NARHDRX  DS    CL4     21    2    4  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL66    21    8   66  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   76    3  A   U    N         T        Y              
NARLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
NARWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1440 BYTES                            
