*          DATA SET CTGEN91D   AT LEVEL 013 AS OF 08/09/17                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0B91D      DATE 08/09/17                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL9      4    2    9  A  P H             T        Y              
INAALPHH DS    XL8                                                              
INAALPH  DS    CL2      4   15    2  A  U H             T        Y  100         
INAALPHX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     4   32   12  A  P N             T        Y              
INAUSERH DS    XL8                                                              
INAUSER  DS    CL10     4   47   10  A  P N             T        Y  105         
INAUSERX DS    XL8                                                              
INAUSNMH DS    XL8                                                              
INAUSNM  DS    CL21     4   58   21  A  P N             T        Y  106         
INAUSNMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     5    2   12  A  P N             T        Y              
INATEAMH DS    XL8                                                              
INATEAM  DS    CL14     5   15   14  A  U H             T        Y  115         
INATEAMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL12     5   32   12  A  P N             T        Y              
INADTAH  DS    XL8                                                              
INADTA   DS    CL8      5   47    8  A  P N             T        Y  120         
INADTAX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL8      5   58    8  A  P N             T        Y              
INACTRYH DS    XL8                                                              
INACTRY  DS    CL11     5   67   11  A  P N             T        Y  110         
INACTRYX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14     7    2   14  A  P H             T        Y              
INAANADH DS    XL8                                                              
INAANAD  DS    CL10     7   17   10  A  U H             T        Y  125         
INAANADX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14     7   32   14  A  P H             T        Y              
INAARODH DS    XL8                                                              
INAAROD  DS    CL10     7   47   10  A  U H             T        Y  130         
INAARODX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79     9    2   79  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL79    10    2   79  A  P N             T        Y              
INASYS1H DS    XL8                                                              
INASYS1  DS    CL7     11    2    7  A  U N             T        Y              
INANAD1H DS    XL8                                                              
INANAD1  DS    CL10    11   12   10  A  U N             T        Y              
INAROD1H DS    XL8                                                              
INAROD1  DS    CL10    11   25   10  A  U N             T        Y              
INASYS2H DS    XL8                                                              
INASYS2  DS    CL7     12    2    7  A  U N             T        Y              
INANAD2H DS    XL8                                                              
INANAD2  DS    CL10    12   12   10  A  U N             T        Y              
INAROD2H DS    XL8                                                              
INAROD2  DS    CL10    12   25   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     13    2    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   12   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   25   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     14    2    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   12   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   25   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     15    2    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   12   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   25   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     16    2    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   12   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   25   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     17    2    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   12   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   25   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     18    2    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   12   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   25   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     19    2    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   12   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   25   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     20    2    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   12   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   25   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     21    2    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   12   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   25   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL7     22    2    7  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   12   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   25   10  A  U N             T        Y              
INASYSLH DS    XL8                                                              
INASYSL  DS    CL7     23    2    7  A  U N             T        Y              
INANADLH DS    XL8                                                              
INANADL  DS    CL10    23   12   10  A  U N             T        Y              
INARODLH DS    XL8                                                              
INARODL  DS    CL10    23   25   10  A  U N             T        Y              
INAFOOTH DS    XL8                                                              
INAFOOT  DS    CL78    24    2   78  L  P H             T        Y              
INALAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
INAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1280 BYTES                            
