*          DATA SET CTGENBAD   AT LEVEL 001 AS OF 08/28/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BBAD      DATE 08/28/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL9      5    2    9  A  P H             T        Y              
REPREQH  DS    XL8                                                              
REPREQ   DS    CL3      5   27    3  A  U N             T        Y   50         
REPREQX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      6    2    9  A  P H             T        Y              
REPWHENH DS    XL8                                                              
REPWHEN  DS    CL10     6   27   10  A  U N             T        Y   51         
REPWHENX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14     7    2   14  A  P N             T        Y              
REPDESTH DS    XL8                                                              
REPDEST  DS    CL10     7   27   10  A  U N             T        Y   52         
REPDESTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
REPOTYPH DS    XL8                                                              
REPOTYP  DS    CL6      8   27    6  A  U N             T        Y  150         
REPOTYPX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL16    10    2   16  A  P N             T        Y              
REPEXFMH DS    XL8                                                              
REPEXFM  DS    CL1     10   27    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL50    10   30   50  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
REPIDH   DS    XL8                                                              
REPID    DS    CL8     12   10    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6     12   20    6  A  P N             T        Y              
REPSYSH  DS    XL8                                                              
REPSYS   DS    CL7     12   27    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     12   37    7  A  P N             T        Y              
REPPGMH  DS    XL8                                                              
REPPGM   DS    CL7     12   45    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6     13    2    6  A  P N             T        Y              
REPAGYAH DS    XL8                                                              
REPAGYA  DS    CL2     13   10    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6     13   20    6  A  P N             T        Y              
REPPWDH  DS    XL8                                                              
REPPWD   DS    CL1     13   27    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     13   37    7  A  P N             T        Y              
REPCIDH  DS    XL8                                                              
REPCID   DS    CL8     13   45    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL9     13   54    9  A  P N             T        Y              
REPLUDH  DS    XL8                                                              
REPLUD   DS    CL12    13   64   12  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     14    2    7  A  P N             T        Y              
REPSYNH  DS    XL8                                                              
REPSYN   DS    CL1     14   10    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6     14   20    6  A  P N             T        Y              
REPIDTH  DS    XL8                                                              
REPIDT   DS    CL9     14   27    9  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL5     14   37    5  A  P N             T        Y              
REPUSEDH DS    XL8                                                              
REPUSED  DS    CL2     14   45    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL9     14   54    9  A  P N             T        Y              
REPLMTH  DS    XL8                                                              
REPLMT   DS    CL12    14   64   12  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1     15   27    1  A  U N             T        Y              
REPLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
REPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 592  BYTES                            
