*          DATA SET CTGENLNI   AT LEVEL 001 AS OF 06/24/97                      
*                                                                               
*              DSECT TO COVER LOTUS NOTES ADMIN USER ID                         
         SPACE 1                                                                
CTLNID   DSECT                                                                  
CTLNIEL  DS    CL1       X         ELEMENT CODE X'BF'                           
CTLNIELQ EQU   X'BF'                                                            
CTLNILEN DS    CL1       X         ELEMENT LENGTH                               
*                                                                               
CTLNINUM DS    XL2       X         LOTUS NOTES ADMIN USER ID NUMBER             
CTLNILNQ EQU   *-CTLNID                                                         
         SPACE 1                                                                
         EJECT                                                                  
