*          DATA SET CTGENF7D   AT LEVEL 006 AS OF 09/26/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BF7D      DATE 09/26/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      5    2    8  A   P    H         T        Y              
PRTIDH   DS    CL8                                                              
PRTID    DS    CL8      5   13    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10     6    2   10  A   P    N         T        Y              
PRTPRIDH DS    CL8                                                              
PRTPRID  DS    CL14     6   13   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14     6   37   14  A   P    N         T        Y              
PRTNPQDH DS    CL8                                                              
PRTNPQD  DS    CL14     6   52   14  A   U    N         T        Y              
PRTMSGH  DS    CL8                                                              
PRTMSG   DS    CL68     7    2   68  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL4      7   72    4  L   P    H         T        Y              
PRTPAGEH DS    CL8                                                              
PRTPAGE  DS    CL3      7   77    3  A   P    H         T        Y              
PRTTBARH DS    CL8                                                              
PRTTBAR  DS    CL15     8    2   15  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL31     8   18   31  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL30     8   50   30  A   P    H         T        Y              
PRTPQDAH DS    CL8                                                              
PRTPQDA  DS    CL14     9    2   14  A   U    N         T        Y              
PRTPQDBH DS    CL8                                                              
PRTPQDB  DS    CL14     9   18   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14     9   34   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14     9   50   14  A   U    N         T        Y              
PRTPQDCH DS    CL8                                                              
PRTPQDC  DS    CL14     9   66   14  A   U    N         T        Y              
PRTPQDDH DS    CL8                                                              
PRTPQDD  DS    CL14    10    2   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    10   18   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    10   34   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    10   50   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    10   66   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    11    2   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    11   18   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    11   34   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    11   50   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    11   66   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    12    2   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    12   18   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    12   34   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    12   50   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    12   66   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    13    2   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    13   18   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    13   34   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    13   50   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    13   66   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    14    2   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    14   18   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    14   34   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    14   50   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    14   66   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    15    2   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    15   18   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    15   34   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    15   50   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    15   66   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    16    2   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    16   18   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    16   34   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    16   50   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    16   66   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    17    2   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    17   18   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    17   34   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    17   50   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    17   66   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    18    2   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    18   18   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    18   34   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    18   50   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    18   66   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    19    2   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    19   18   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    19   34   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    19   50   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    19   66   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    20    2   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    20   18   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    20   34   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    20   50   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    20   66   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    21    2   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    21   18   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    21   34   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    21   50   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    21   66   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    22    2   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    22   18   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    22   34   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    22   50   14  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    22   66   14  A   U    N         T        Y              
PRTBBARH DS    CL8                                                              
PRTBBAR  DS    CL78    23    2   78  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL78    24    2   78  A   P    H         T        Y              
PRTLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
PRTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2032 BYTES                            
