*          DATA SET CTGENCED   AT LEVEL 002 AS OF 08/30/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BCED      DATE 08/30/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  L   P    N         T        Y              
LSTAGYH  DS    CL8                                                              
LSTAGY   DS    CL8      5   10    8  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL4      5   20    4  L   P    H         T        Y              
LSTTYPH  DS    CL8                                                              
LSTTYP   DS    CL3      5   25    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4      5   29    4  L   P    H         T        Y              
LSTNAMEH DS    CL8                                                              
LSTNAME  DS    CL18     5   34   18  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL8      5   55    8  L   P    H         T        Y              
LSTPSWDH DS    CL8                                                              
LSTPSWD  DS    CL10     5   64   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL79     6    2   79  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL79     7    2   79  L   P    H         T        Y              
LSTACT1H DS    CL8                                                              
LSTACT1  DS    CL3      8    2    3  A   U    N         T        Y              
LSTLIN1H DS    CL8                                                              
LSTLIN1  DS    CL75     8    6   75  A   P    N         T        Y              
LSTACT2H DS    CL8                                                              
LSTACT2  DS    CL3      9    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75     9    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    10    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    11    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    12    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    13    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    14    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    15    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    16    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    17    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    18    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    19    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    20    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    21    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    22    6   75  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL75    23    6   75  A   P    N         T        Y              
LSTLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1808 BYTES                            
