*          DATA SET CTGENCAD   AT LEVEL 002 AS OF 06/06/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BCAD      DATE 06/06/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL13     4    2   13  L  P N             T        Y              
DDSDEPH  DS    CL8                                                              
DDSDEP   DS    CL8      4   16    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      4   27    8  L  P N             T        Y              
DDSLEVH  DS    CL8                                                              
DDSLEV   DS    CL10     4   36   10  A  U N             T        Y              
DDSOP1H  DS    CL8                                                              
DDSOP1   DS    CL32     6    2   32  L  P N             T        Y              
DDSIP1H  DS    CL8                                                              
DDSIP1   DS    CL3      6   35    3  A  U N             T        Y              
DDSOP2H  DS    CL8                                                              
DDSOP2   DS    CL32     6   42   32  L  P N             T        Y              
DDSIP2H  DS    CL8                                                              
DDSIP2   DS    CL3      6   75    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32     7    2   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      7   35    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32     7   42   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      7   75    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32     8    2   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8   35    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32     8   42   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      8   75    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32     9    2   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   35    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32     9   42   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9   75    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    10    2   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10   35    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    10   42   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10   75    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    11    2   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   35    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    11   42   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11   75    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    12    2   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12   35    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    12   42   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12   75    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    13    2   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   35    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    13   42   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13   75    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    14    2   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   35    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    14   42   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14   75    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    15    2   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   35    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    15   42   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15   75    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    16    2   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16   35    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    16   42   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16   75    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    17    2   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   35    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    17   42   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17   75    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    18    2   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18   35    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    18   42   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18   75    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    19    2   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19   35    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    19   42   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19   75    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    20    2   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20   35    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    20   42   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20   75    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    21    2   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   35    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    21   42   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21   75    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    22    2   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22   35    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    22   42   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22   75    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    23    2   32  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23   35    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL32    23   42   32  L  P N             T        Y              
DDSIPLH  DS    CL8                                                              
DDSIPL   DS    CL3     23   75    3  A  U N             T        Y              
DDSPFKH  DS    CL8                                                              
DDSPFK   DS    CL16    24    2   16  L  P H             T        Y              
DDSLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
DDSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1936 BYTES                            
