*          DATA SET CTGENC6D   AT LEVEL 001 AS OF 03/01/01                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BC6D      DATE 03/01/01                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      5    2    6  L  P N             T        Y              
SCRNAMEH DS    XL8                                                              
SCRNAME  DS    CL10     5    9   10  A  U N             T        Y  101         
SCRNAMEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      5   21    6  L  P N             T        Y              
SCRSORCH DS    XL8                                                              
SCRSORC  DS    CL32     5   28   32  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1      5   79    1  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL78     6    2   78  L  P N             T        Y              
SCRTXT1H DS    XL8                                                              
SCRTXT1  DS    CL78     7    2   78  A  U N             T        Y  102         
SCRTXT1X DS    XL8                                                              
SCRTXT2H DS    XL8                                                              
SCRTXT2  DS    CL78     8    2   78  A  U N             T        Y  102         
SCRTXT2X DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78     9    2   78  A  U N             T        Y  102         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    10    2   78  A  U N             T        Y  102         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    11    2   78  A  U N             T        Y  102         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    12    2   78  A  U N             T        Y  102         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    13    2   78  A  U N             T        Y  102         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    14    2   78  A  U N             T        Y  102         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    15    2   78  A  U N             T        Y  102         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    16    2   78  A  U N             T        Y  102         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    17    2   78  A  U N             T        Y  102         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    18    2   78  A  U N             T        Y  102         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    19    2   78  A  U N             T        Y  102         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    20    2   78  A  U N             T        Y  102         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    21    2   78  A  U N             T        Y  102         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    22    2   78  A  U N             T        Y  102         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    23    2   78  A  U N             T        Y  102         
         DS    XL8                                                              
         DS    XL8                                                              
         DS    CL78    24    2   78  A  U N             T        Y  102         
         DS    XL8                                                              
SCRLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
SCRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1888 BYTES                            
