*          DATA SET CTGENAFP   AT LEVEL 001 AS OF 01/14/99                      
*                                                                               
*              DSECT TO COVER AFP USER ID POINTER ELEMENT                       
         SPACE 1                                                                
CTAFPD   DSECT                                                                  
CTAFPEL  DS    CL1       X         ELEMENT CODE X'C4'                           
CTAFPELQ EQU   X'C4'                                                            
CTAFPLEN DS    CL1       X         ELEMENT LENGTH                               
*                                                                               
CTAFPNUM DS    XL2       X         AFP USER ID NUMBER                           
CTAFPLNQ EQU   *-CTAFPD                                                         
         SPACE 1                                                                
         EJECT                                                                  
