*          DATA SET CTGENF8D   AT LEVEL 003 AS OF 08/29/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BF8D      DATE 08/29/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  A   P    N         T        Y              
IDAIDH   DS    CL8                                                              
IDAID    DS    CL10     5   15   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL38     7    2   38  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL38     7   42   38  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL38     8    2   38  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL38     8   42   38  A   P    N         T        Y              
IDAATTAH DS    CL8                                                              
IDAATTA  DS    CL3      9    2    3  A   U    N         T        Y              
IDAATNAH DS    CL8                                                              
IDAATNA  DS    CL33     9    7   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3      9   42    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33     9   47   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    10    7   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   42    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    10   47   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    11    7   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   42    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    11   47   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    12    7   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   42    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    12   47   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    13    7   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   42    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    13   47   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    14    7   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   42    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    14   47   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    15    7   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   42    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    15   47   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    16    7   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   42    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    16   47   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    17    7   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   42    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    17   47   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    18    7   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   42    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    18   47   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    19    7   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   42    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    19   47   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    20    7   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   42    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    20   47   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    21    7   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   42    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    21   47   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    22    7   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     22   42    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL33    22   47   33  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23    2    1  A   U    N         T        Y              
IDALAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
IDAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1688 BYTES                            
