*          DATA SET CTGENB1D   AT LEVEL 001 AS OF 05/17/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BB1D      DATE 05/17/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      5    2    9  A   P    H         T        Y              
REQREQH  DS    CL8                                                              
REQREQ   DS    CL3      5   27    3  A   U    N         T        Y   50         
REQREQX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      6    2    9  A   P    H         T        Y              
REQWHENH DS    CL8                                                              
REQWHEN  DS    CL10     6   27   10  A   U    N         T        Y   51         
REQWHENX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     7    2   14  A   P    N         T        Y              
REQDESTH DS    CL8                                                              
REQDEST  DS    CL10     7   27   10  A   U    N         T        Y   52         
REQDESTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      9    2    4  A   P    N         T        Y              
REQUSERH DS    CL8                                                              
REQUSER  DS    CL10     9    8   10  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL4      9   30    4  A   P    N         T        Y              
REQLANGH DS    CL8                                                              
REQLANG  DS    CL13     9   37   13  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL6      9   56    6  A   P    N         T        Y              
REQSYSH  DS    CL8                                                              
REQSYS   DS    CL8      9   64    8  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL4     10    2    4  A   P    N         T        Y              
REQTYPH  DS    CL8                                                              
REQTYP   DS    CL11    10    8   11  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL5     10   30    5  A   P    N         T        Y              
REQMEDH  DS    CL8                                                              
REQMED   DS    CL9     10   37    9  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL6     10   56    6  A   P    N         T        Y              
REQCLIH  DS    CL8                                                              
REQCLI   DS    CL5     10   64    5  A   U    H         T        Y              
REQLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
REQWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 312  BYTES                            
