*          DATA SET CTGENA4D   AT LEVEL 001 AS OF 10/11/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BA4D      DATE 10/11/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      5    2    9  A   P    H         T        Y              
REPREQH  DS    CL8                                                              
REPREQ   DS    CL3      5   20    3  A   U    N         T        Y   50         
REPREQX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      6    2    9  A   P    H         T        Y              
REPWHENH DS    CL8                                                              
REPWHEN  DS    CL10     6   20   10  A   U    N         T        Y   51         
REPWHENX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     7    2   14  A   P    N         T        Y              
REPDESTH DS    CL8                                                              
REPDEST  DS    CL10     7   20   10  A   U    N         T        Y   52         
REPDESTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     8    2   11  A   P    N         T        Y              
REPOTYPH DS    CL8                                                              
REPOTYP  DS    CL6      8   20    6  A   U    N         T        Y  150         
REPOTYPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9     10    2    9  A   P    N         T        Y              
REPLTYPH DS    CL8                                                              
REPLTYP  DS    CL8     10   20    8  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL7     10   37    7  A   P    N         T        Y              
REPIDH   DS    CL8                                                              
REPID    DS    CL8     10   45    8  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL10    10   54   10  A   P    N         T        Y              
REPINIDH DS    CL8                                                              
REPINID  DS    CL12    10   65   12  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     11   27    1  A   U    N         T        Y              
REPLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
REPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 288  BYTES                            
