*          DATA SET CTGENWEB   AT LEVEL 001 AS OF 03/17/11                      
* WEB ACCESS CONTROL ELEMENT                                                    
*                                                                               
WEBELD   DSECT                                                                  
WEBEL    DS    XL1                 ELEMENT CODE                                 
WEBELQ   EQU   X'E5'                                                            
WEBLN    DS    XL1                 ELEMENT LENGTH                               
WEBFLAG  DS    XL1                 WEB CONTROL FLAGS                            
WEBFIP   EQU   X'01'               IP CHECK OFF                                 
WEBFAC   EQU   X'02'               ACCESS CODE CHECK ON                         
WEBFSS   EQU   X'04'               SINGLE SIGN ON OFF                           
WEBACT   DS    CL1                 ACCESS CODE TYPE                             
WEBARASQ EQU   C'R'                RSA ACCESS CODE CHECK                        
WEBACOD  DS    CL10                ACCESS CODE                                  
         DS    XL10                N/D                                          
WEBNID   DS    XL40                NETWORK ID                                   
         DS    XL10                N/D                                          
WEBLNQ   EQU   *-WEBELD                                                         
