*          DATA SET CTGENFILE  AT LEVEL 018 AS OF 06/30/20                      
                                                                                
* DSECTS TO COVER CTFILE RECORDS                                                
*                                                                               
* USER- = NUMERIC USER ID                                                       
* 2AGY- = 2 CHR AGENCY ID                                                       
* SN    = SEQUENCE NUMBER                                                       
* SY    = SYSTEM CHR    A=ACC                                                   
* OV    = SYSTEM NUMBER 06=ACC                                                  
* PG    = PROGRAM CODE                                                          
* SC    = SOURCE CODE / SCREEN CODE                                             
* SP    = SPECIAL CODE                                                          
* MC    = MEDIA CODE                                                            
* TY    = TYPE                                                                  
                                                                                
*RECORD TYPE   **************** KEY DISPLACEMENT ******************             
*              00 01 - 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24             
*                                                                               
*PROGRAM(WRTR) 01 ..   .. .. 2AGY- SY PG OV <-----NAME CL8-------->             
*USER(DRIVER)  02 ..   .. 2AGY- <-------CODE CL8------> .. .. .. ..             
*DSCHEME       03 ..   .. .. .. .. .. .. .. .. .. .. .. 2AGY- -CODE             
*TWX ADDRESEE  A' ..   .. .. .. .. .. .. USER- <--LIST ID CL6--> SN             
*LATEST DEMO   B' ..   .. .. .. .. .. .. .. .. .. .. .. .. .. .. ..             
*COMMENT       C' ..   .. USER- SY <------COMMENT ID-CL10------> SN             
*DEMO NAME     D' ..   .. .. .. .. .. .. .. .. .. TY MC 2AGY- SC DN             
*PROG NUM      D' P'   .. .. .. .. .. .. .. .. TY SC <-PROG-> -BOOK             
*ALPH MARKET   D' M'   .. .. .. .. .. .. .. MC SC <MNAME-> TY MN UM             
*DEMO UPDATE   D' U'   .. .. LDATE MW SDATE EDATE PT .. .. .. .. ..             
*ERROR         E' ..   .. .. .. .. .. .. .. .. .. .. .. .. .. OV EN             
*SECURITY      F' -- SEE SEACSFILE --                                           
*DEMO FORM     G' ..   .. .. .. .. .. FT MC SC 2AGY- LC YY MM -DEMO             
*HUT           H' ..   .. .. .. .. .. .. .. .. DY -TIME YR .. .. ..             
*ID            I' ..   .. .. .. .. .. <---------NAME CL10--------->             
*ID            I' ..   .. .. .. .. .. .. .. .. .. .. .. .. .. UID#-             
*ID            9B'01'2AGY .. .. .. .. .. .. .. .. .. .. .. .. UID#-             
*JCL           J' ..   .. .. .. .. <--------JCL ID CL10--------> SN             
*AUTHORIZATION K' ..   .. .. .. .. .. .. .. .. .. .. .. USER- -MRKT             
*LIB SCRIPT    L' S'   .. .. .. .. <--------NAME CL10 ---------> SN             
*LIB EXTRACT   L' Q'   .. .. .. .. <--------NAME CL10 ---------> SN             
*SCREEN MAP    M' ..   .. .. OV PG SC 2AGY- .. .. .. .. .. .. .. ..             
*SCREEN MAP    M' ..   .. .. OV PG SC USER- .. .. .. .. .. .. .. ..             
*DEMO CODE     N' ..   .. .. .. .. .. .. .. .. .. .. TY MC 2AGY- SC             
*OUTPUT TYPE   O' ..   .. .. .. .. <-----OUTPUT TYPE CL10------> SN             
*PROFILE       P' ..   .. .. .. .. .. .. .. .. .. SY PROG- USER- SN             
*PROF DTY      P' 01   .. .. .. .. .. .. .. .. .. .. <-DOCTYPE-> ..             
*PROF USR/DTY  P' 02   .. .. .. .. .. .. .. .. USER- <-DOCTYPE-> ..             
*DEMO ADJUST   Q' ..   .. .. .. .. SC MC 2AGY- SP <-CLI--> YY MM HC             
*DEMO AGY      R' ..   .. .. .. .. .. SC MC 2AGY- SP <-CLI--> YY MM             
*STAT CAL LET  S' ..   .. .. .. .. .. .. .. .. .. .. SC MC YY MM PG             
*USERPROF      U' ..   .. SY <-PROG-> LG 2AGY- MC <-CLI--> .. .. ..             
*USERPROF      U' ..   .. SY <-PROG-> LG USER- MC <-CLI--> .. .. ..             
*USERPROF      U' ..   .. SY <-PROG-> LG USER- SIXPACK <-WRTCD-> ..             
*USERPROF      U' ..   .. SY <-PROG-> LG USER- UC LC <-ACCOUNT-> ..             
*VALUE         V' ..   .. .. .. .. .. .. .. TY SY MED <-FILT> ON PN             
*SYSLIST       W' ..   .. .. .. .. .. 2AGY- TY <----LIST-CL6---> SN             
*CPP EXTRACT   X' ..   2AGY- <-CLI--> <-PROD-> EN YY MM DD YY MM DD             
*CPP PROJECT   Y' ..   .. .. .. .. .. .. .. .. .. .. 2AGY- FC YY MM             
*INTER TAPE    Z' ..   .. .. .. .. .. .. .. .. .. USER- SY PROG- LC             
*FACPAK APPLS  3' A'   .. .. .. .. .. .. .. .. .. .. .. .. .. AP ..             
*FACPAK SESYS  3' S'   .. .. .. .. .. .. .. .. .. .. .. .. .. SE ..             
*FACPAK PRGMS  3' P'   .. .. .. .. .. .. .. .. .. .. .. .. .. SE ..             
*DDS SECURITY  3' D'   .. .. .. .. .. .. .. .. .. .. .. .. .. .. ..             
*EASI STATION  3' E'   .. .. .. .. .. .. MD <----STATION CODE----->             
*SYS ACCESS    5' ..   .. .. .. .. .. .. .. .. .. .. .. .. .. 2AGY-             
*SCRIPT        7' ..   .. .. .. .. .. <------SCRIPT-CL8-----> SEQN-             
*PROG VERSION  07TS.   <----PROGRAM NAME-----> .. .. .. .. .. .. ..             
*PRINTER NAME  08 ..   USER- <--PNAME--> .. .. .. .. .. .. .. .. ..             
*                                                                               
*              0-1-2-3-4-5-6-7-8-9-0-1-2-3-4-5-6-7-8-9-0-1-2-3-4-               
*                                                                               
*IP SUBNET     3'I'VR............<-------IP SUBNET ID-CL16------>               
*TERMINAL      T'............<-TERMINAL-CL8-><---PASSWORD-CL10-->               
*TERMINAL      T'............................................TNUM               
*                                                                               
*PERSONAL      0'2AGY........................................ANUM               
*PERSONAL      0'2AGY................DATETIME<--PASSWORD-CL10--->               
*PERSONAL      0'2AGY<-PERSONAL ID-->DATETIME<--PASSWORD-CL10--->               
*PERSONAL      0'2AGYOFFC<--------------LAST NAME-CL18------>INIT               
*                                                                               
*??????        8'CYYDDDSE2AGY<--TYPE--><---KEY------>......HHMMSS               
                                                                                
*##FILENAME CTFILE                                                              
*##PROCESS ACTIVE RECORD ON                                                     
*##PROCESS ACTIVE KEY OFF                                                       
                                                                                
*              DSECT TO COVER PROGRAM RECORD IN CTGENPGREC                      
*              X'01' PROGRAM SAVE RECORD FOR WRITERS                            
                                                                                
*              DSECT TO COVER USER RECORDS (DRIVER)                             
*                                                                               
CT02REC  DSECT                     USER RECORDS (DRIVER)                        
CT02KEY  DS    0CL25     V         KEY                                          
CT02KTYP DS    CL1       C         RECORD TYPE X'02'                            
CT02KTYQ EQU   X'02'                                                            
CT02KSPR DS    CL10      X         SPARE (BINARY ZEROES)                        
CT02KAGY DS    CL2       C         ALPHA AGENCY CODE                            
CT02KCOD DS    CL8       C         CODE                                         
         DS    CL4       X                                                      
CT02LEN  DS    CL2       X         RECORD LENGTH                                
CT02STAT DS    CL1       X         STATUS                                       
CT02DATA DS    0C        V         DATA                                         
                                                                                
*              DSECT TO COVER DSCHEME RECORDS (PRODUCTION DATES)                
*                                                                               
CTDSREC  DSECT                     DSCHEME RECORDS (PRODUCTION DATES)           
CTDSKEY  DS    0CL25     V         KEY                                          
CTDSKTYP DS    CL1       C         RECORD TYPE                                  
CTDSKTYQ EQU   X'03'                                                            
CTDSKSPR DS    CL20      X         SPARE (BINARY ZEROES)                        
CTDSKAGY DS    CL2       C         ALPHA AGENCY CODE                            
CTDSKCOD DS    CL2       C         SCHEME CODE                                  
CTDSLEN  DS    CL2       X         RECORD LENGTH                                
CTDSSTAT DS    CL1       X         STATUS                                       
CTDSDATA DS    0C        V         DATA                                         
                                                                                
*              DSECT TO COVER TWX ADDRESSEE RECORDS                             
*                                                                               
CTAREC   DSECT                     TWX ADDRESSEE RECORDS                        
CTAKEY   DS    0CL25     V         KEY                                          
CTAKTYP  DS    CL1       C         RECORD TYPE C'A'                             
CTAKTYPQ EQU   C'A'                                                             
CTAKSPAR DS    CL15      X         SPARE (BINARY ZEROES)                        
CTAKUSER DS    CL2       X         USER-ID NUMBER                               
CTAKID   DS    CL6       C         TWX ADDRESSEE LIST-ID                        
CTAKSUB  DS    CL1       X         SUB NUMBER                                   
CTALEN   DS    CL2       X         RECORD LENGTH                                
CTASTAT  DS    CL1       X         STATUS                                       
CTADATA  DS    0C        V         DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'02' DESCRIPTION ELEMENT)             
*                                       (X'03' POINTER ELEMENTS)                
                                                                                
*              DSECT TO COVER LATEST DEMO BOOK RECORD                           
*                                                                               
CTBREC   DSECT                     LATEST DEMO BOOK RECORD                      
CTBKEY   DS    0CL25     V         KEY                                          
CTBKTYP  DS    CL1       C         RECORD TYPE                                  
CTBKTEQU EQU   C'B'                                                             
         DS    CL24      X         SPARE                                        
CTBLEN   DS    XL2       X         RECORD LENGTH                                
CTBSTAT  DS    XL1       X         STATUS                                       
CTBDATA  DS    0C        V         DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'02' LATEST BOOK ELEMENTS)            
                                                                                
*              DSECT TO COVER COMMENT RECORDS                                   
*                                                                               
CTCREC   DSECT                     COMMENT RECORDS                              
CTCKEY   DS    0CL25     V         KEY                                          
CTCKTYP  DS    CL1       V         RECORD TYPE 'C'                              
CTCKTYPQ EQU   C'C'                                                             
CTCKSPAR DS    CL10      C         SPARE (BINARY ZEROES)                        
CTCKUSER DS    CL2       C         USER CODE                                    
CTCKSYS  DS    CL1       C         SYSTEM (S=SPOT A=ACCOUNT P=PRINT)            
*                                         (R=REP M=MEDLINE C=CONTROL)           
CTCKID   DS    CL10      C         COMMENT ID                                   
CTCKSUB  DS    CL1       X         SUB NUMBER                                   
CTCLEN   DS    CL2       X         RECORD LENGTH                                
CTCSTAT  DS    CL1       X         STATUS                                       
CTCDATA  DS    0C        V         DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'02' DESCRIPTION ELEMENT)             
*                                       (X'04' INDEX ELEMENT) OR                
*                                       (X'10' DATA  ELEMENT) OR                
*                                       (X'11' INCLUDE ELEMENT)                 
                                                                                
*              DSECT TO COVER DEMO NAME RECORDS                                 
*                                                                               
CTDREC   DSECT                     DEMO NAME RECORDS                            
CTDKEY   DS    0CL25     V         KEY                                          
CTDKTYP  DS    CL1       C         RECORD TYPE                                  
CTDKTEQU EQU   C'D'                                                             
         DS    CL18      X         SPARE                                        
CTDKFILE DS    CL1       C         FILE TYPE (T=TPT, P=PAV ETC.)                
CTDKMED  DS    CL1       C         MEDIA CODE                                   
CTDKAGY  DS    XL2       V         AGENCY CODE (X'FFFF'=DEFAULT)                
CTDKCODE DS    XL1       V         SPECIAL CODE (X'FF'=DEFAULT)                 
CTDKDEMO DS    XL1       X         DEMO NUMBER                                  
CTDLEN   DS    XL2       X         RECORD LENGTH                                
CTDSTAT  DS    XL1       X         STATUS                                       
CTDDATA  DS    0C        V         DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'02' DESCRIPTION ELEMENT)             
*&&US                                                                           
*              DSECT TO COVER PROGRAM NUMBER EQUATE RECORDS                     
*                                                                               
CTDPREC  DSECT                     PROGRAM NUMBER EQUATE RECORDS                
CTDPKEY  DS    0CL25     V         KEY                                          
CTDPKTYP DS    CL1       C         RECORD TYPE                                  
CTDPKTEQ EQU   C'D'                                                             
CTDPKTY2 DS    CL1       C         SUB RECORD TYPE                              
CTDPKT2E EQU   C'P'                                                             
         DS    CL16      X         SPARE                                        
CTDPKFIL DS    CL1       C         FILE TYPE (N=NETWORK, T=SPOT TV)             
CTDPKSRC DS    CL1       C         SOURCE CODE                                  
CTDPKPCD DS    XL3       X         PROGRAM CODE                                 
CTDPKBOK DS    XL2       X         BOOK (X'FF'=DEFAULT) REVERSE SEQ.            
CTDPLEN  DS    XL2       X         RECORD LENGTH                                
CTDPSTAT DS    XL1       X         STATUS                                       
CTDPDATA DS    0C        V         DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'02' EQUATE ELEMENT)                  
*&&                                                                             
*&&US                                                                           
*              DSECT TO COVER ALPHA MARKET RECORDS                              
*                                                                               
CTDMREC  DSECT                     ALPHA MARKET RECORDS                         
CTDMKEY  DS    0CL25     V         KEY                                          
CTDMKTYP DS    CL1       C         RECORD TYPE                                  
CTDMKTEQ EQU   C'D'                                                             
CTDMKTY2 DS    CL1       C         SUB RECORD TYPE                              
CTDMKT2E EQU   C'M'                                                             
         DS    CL15      X         SPARE                                        
CTDMKMED DS    CL1       C         MEDIA (R=RADIO, T=TV)                        
CTDMKSRC DS    CL1       C         SOURCE (A=ARBITRON, N=NIELSON)               
CTDMKMKT DS    CL3       C         MARKET NAME                                  
CTDMKBKT DS    CL1       C         BOOK TYPE (DEFAULT X'FF')                    
CTDMKNUM DS    XL2       X         MARKET NUM                                   
CTDMLEN  DS    XL2       X         RECORD LENGTH                                
CTDMSTAT DS    XL1       X         STATUS                                       
CTDMDATA DS    0C        V         DATA (NO ELEMS)                              
*&&                                                                             
*              DSECT TO COVER ERROR RECORDS                                     
*                                                                               
CTEREC   DSECT                     ERROR RECORDS                                
CTEKEY   DS    0CL25     V         KEY                                          
CTEKTYP  DS    CL1       C         RECORD TYPE 'E'                              
CTEKTYPQ EQU   C'E'                                                             
CTEKSPAR DS    CL22      C         SPARE (BINARY ZEROES)                        
CTEKSYS  DS    CL1       X         SYSTEM NUMBER (0=MULTI-SYSTEM)               
CTEKNUM  DS    CL1       X         ERROR NUMBER                                 
CTELEN   DS    CL2       X         RECORD LENGTH                                
CTESTAT  DS    CL1       X         STATUS                                       
CTEDATA  DS    0C        V         DATA (X'02' DESCRIPTION)                     
                                                                                
*              DSECT TO COVER DEMO FORMULA RECORDS                              
*                                                                               
CTGREC   DSECT                     DEMO FORMULA RECORDS                         
CTGKEY   DS    0CL25     V         KEY                                          
CTGKTYP  DS    CL1       C         RECORD TYPE                                  
CTGKTEQU EQU   C'G'                                                             
         DS    CL14      X         SPARE                                        
CTGKFMS  DS    0CL3                FILE/MEDIA/SOURCE                            
CTGKFILE DS    CL1       C         FILE TYPE (T=TPT, P=PAV ETC.)                
CTGKMED  DS    CL1       C         MEDIA CODE                                   
CTGKSRC  DS    CL1       C         SOURCE CODE                                  
CTGKAGY  DS    XL2       V         AGENCY CODE (X'FFFF'=DEFAULT)                
CTGKCODE DS    XL1       V         LOOKUP CODE (X'FF'=DEFAULT)                  
CTGKSTRT DS    XL2       X         START BOOK (BINARY YYMM)                     
CTGKDEMO DS    XL2       V         DEMO CODE                                    
CTGLEN   DS    XL2       X         RECORD LENGTH                                
CTGSTAT  DS    XL1       X         STATUS                                       
CTGDATA  DS    0C        V         DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'02' DESCRIPTION ELEMENT)             
*                                       (X'03' PRECISION ELEMENT)               
*                                       (X'04' POLISH FORMULA ELEMENT)          
*                                       (X'05' INPUT FORMULA ELEMENT)           
                                                                                
*              DSECT TO COVER HUT RECORDS (NETWORK)                             
*                                                                               
CTHREC   DSECT                     HUT RECORDS (NETWORK)                        
CTHKEY   DS    0CL25     V         KEY                                          
CTHTYP   DS    CL1       C         RECORD TYPE 'H'                              
CTHTYPQ  EQU   C'H'                                                             
CTHSPAR  DS    CL17      X         SPARE (BINARY ZEROS)                         
CTHDAY   DS    CL1       C         DAY                                          
CTHTIME  DS    CL2       X         START TIME (MILITARY)                        
CTHYEAR  DS    CL1       X         YEAR                                         
         DS    CL3       X         SPARE (BINARY ZEROS)                         
CTHLEN   DS    CL2       X         RECORD LENGTH                                
CTHSTAT  DS    CL1       X         STATUS                                       
CTHDATA  DS    0C        V         DATA (X'01' ACTIVITY)                        
*                                       (X'90' HUT ELEMENT)                     
                                                                                
*              DSECT TO COVER ID RECORDS                                        
*                                                                               
CTIREC   DSECT                     ID RECORDS                                   
CTIKEY   DS    0CL25     C         KEY                                          
CTIKTYP  DS    CL1       C                                                      
CTIKTYPQ EQU   C'I'                                                             
CTIKSPAR DS    CL14      C         SPARE (BINARY ZEROES)                        
CTIKID   DS    CL10      C         ID NAME                                      
         ORG   CTIKID                                                           
         DS    XL8                 N/D                                          
CTIKNUM  DS    XL2                 ID NUMBER                                    
CTILEN   DS    CL2       X         RECORD LENGTH                                
CTISTAT  DS    CL1       X         STATUS                                       
CTIDATA  DS    0C        V         DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'02' DESCRIPTION - ID NUM)            
*                                       (X'03' PRINCIPAL ID ELEMENT)            
*                                       (X'06' TWO CHR AGY ID ELEMENT)          
*                                       (X'07' USER ID OPTIONS ELEMENT)         
*                                       (X'20' ID ELEMENTS)                     
*                                       (X'21' SYSTEM ELEMENTS)                 
*                                       (X'33' UK AGENCY ELEMENT)               
*                                       (X'34' VALID DESTINATION)               
*                                       (X'36' ORIGIN DETAILS)                  
*                                       (X'30' DESTINATION DETAIL)              
*                                       (X'31' ATTENTION DETAIL)                
*                                       (X'3A' VALID PRINTER ELEMENT)           
*                                       (X'42' OUTPUT TYPE CODE)                
*                                       (X'23' PROGRAM TEST ELEMENTS)           
                                                                                
*              DSECT TO COVER ID (X'9B) RECORDS (AGY PASSIVE RECORD)            
*                                                                               
CT9BREC  DSECT                     ID (X'9B) RECORDS (AGY PASSIVE)              
CT9BKEY  DS    0CL25     C         KEY                                          
CT9BKTYP DS    CL1       C                                                      
CT9BKTYQ EQU   X'9B'                                                            
CT9BKKEY DS    0CL24                                                            
CT9BKSUB DS    XL1       X         SUB TYPE                                     
         DS    CL23                                                             
*                                                                               
CT9BLEN  DS    CL2       X         RECORD LENGTH                                
CT9BSTAT DS    CL1       X         STATUS                                       
CT9BDATA DS    0C        V         DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'02' DESCRIPTION - ID NAME)           
*                                                                               
         ORG   CT9BKKEY                                                         
         DS    XL1                 SUB TYPE                                     
CT9BKS01 EQU   X'01'               SUB TYPE FOR AG-UID# PASSIVE RECORD          
CT9BKAGY DS    CL2       C         AGENCY (ONLY FOR AG-UID# PASS REC)           
         DS    XL19      X         SPACE (BINARY ZEROES)                        
CT9BKNUM DS    XL2                 ID NUMBER                                    
                                                                                
*              DSECT TO COVER JCL AND COMM RECORDS                              
*                                                                               
CTJREC   DSECT                     JCL AND COMMENT RECORDS                      
CTJKEY   DS    0CL25     V         KEY                                          
CTJKTYP  DS    CL1       C         RECORD TYPE C'J' OR 'C'                      
CTJKTYPQ EQU   C'J'                                                             
CTCOTYPQ EQU   C'C'                                                             
CTJKSPAR DS    CL13      B         SPARE (BINARY ZEROES)                        
CTJKID   DS    CL10      C         JCL ID                                       
CTJKSUB  DS    CL1       X         SUB NUMBER                                   
CTJLEN   DS    CL2       X         RECORD LENGTH                                
CTJSTAT  DS    CL1       X         STATUS                                       
CTJDATA  DS    0C        V         DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'02' DESCRIPTION ELEMENT)             
*                                       (X'04' INDEX ELEMENT) OR                
*                                       (X'10' DATA  ELEMENT) OR                
*                                       (X'11' INCLUDE ELEMENT)                 
                                                                                
*              DSECT TO COVER AUTHORIZATION RECORDS                             
*                                                                               
CTKREC   DSECT                     AUTHORIZATION RECORDS                        
CTKKEY   DS    0CL25     V         KEY                                          
CTKKTYP  DS    CL1       C         RECORD TYPE C'K'                             
CTKKTYPQ EQU   C'K'                                                             
CTKKSPAR DS    CL20      B         SPARE (BINARY ZEROES)                        
CTKKUSER DS    CL2       C         USER CODE                                    
CTKKMKT  DS    CL2       B         MARKET NUMBER                                
CTKLEN   DS    CL2       B         RECORD LENGTH                                
CTKSTAT  DS    CL1       X         STATUS                                       
CTKDATA  DS    0C        V         DATA (X'01' ACTIVITY)                        
*                                       (X'92' AUTHORIZATION)                   
                                                                                
*              DSECT TO COVER LIBRARY RECORDS                                   
*                                                                               
CTLREC   DSECT                     LIBRARY BOOK RECORDS                         
CTLKEY   DS    0CL25     V         KEY                                          
CTLKTYP  DS    CL1       C         RECORD TYPE C'L'                             
CTLKTYPQ EQU   C'L'                                                             
CTLKSCR  DS    CL1                                                              
CTLKSCRQ EQU   C'S'                SCRIPT RECORD SOURCE IDENTIFIER              
CTLKXTRQ EQU   C'Q'                XTRACT RECORD SOURCE IDENTIFIER              
CTLKSPAR DS    CL12      C         SPARE (BINARY ZEROES)                        
CTLKNAME DS    CL10      C         BOOK NAME                                    
CTLKSUB  DS    CL1       X         SUB (LINE) NUMBER                            
CTLLEN   DS    CL2       X         RECORD LENGTH                                
CTLSTAT  DS    CL1       X         STATUS                                       
CTLDATA  DS    0C        V         DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'02' DESCRIPTION ELEMENT)             
*                                       (X'04' INDEX ELEMENT) OR                
*                                       (X'10' DATA  ELEMENT) OR                
*                                       (X'11' INCLUDE ELEMENT)                 
                                                                                
*              DSECT TO COVER SCREEN FIELD MAP RECORDS                          
*                                                                               
CTMREC   DSECT                     SCREEN FIELD MAP RECORDS                     
CTMKEY   DS    0CL25     V         KEY                                          
CTMKTYP  DS    CL1       C         RECORD TYPE C'M'                             
CTMKTYPQ EQU   C'M'                                                             
CTMKSPAR DS    CL11      X         SPARE (BINARY ZEROES)                        
CTMKSYS  DS    CL1       X         OVERLAY SYSTEM NUMBER                        
CTMKPROG DS    CL1       X         PROGRAM NUMBER                               
CTMKSCRN DS    CL1       X         SCREEN NUMBER                                
CTMKUSER DS    CL2       X         ALPHA USER ID OR ZEROES                      
CTMKOTHR DS    CL8       X         SPARE FOR KEY EXPANSION                      
CTMKLEN  DS    CL2       X         RECORD LENGTH                                
CTMSTAT  DS    CL1       X         STATUS                                       
CTMDATA  DS    0C        V         DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'B1' FIELD MAP ELEMENTS)              
                                                                                
*              DSECT TO COVER DEMO CODE RECORDS                                 
*                                                                               
CTNREC   DSECT                     DEMO CODE RECORDS                            
CTNKEY   DS    0CL25     V         KEY                                          
CTNKTYP  DS    CL1       C         RECORD TYPE                                  
CTNKTEQU EQU   C'N'                                                             
         DS    CL19      X         SPARE (BINARY ZEROES)                        
CTNKFILE DS    CL1       C         FILE TYPE (T=TPT, P=PAV ETC.)                
CTNKMED  DS    CL1       C         MEDIA CODE                                   
CTNKAGY  DS    CL2       V         AGENCY CODE (X'FFFF'=DEFAULT)                
CTNKCODE DS    CL1       V         SPECIAL CODE (X'FF'=DEFAULT)                 
CTNLEN   DS    CL2       X         RECORD LENGTH                                
CTNSTAT  DS    CL1       X         STATUS                                       
CTNDATA  DS    0C        V         DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'02' CODE/NAME ELEMENTS)              
                                                                                
*              DSECT TO COVER OUTPUT TYPE RECORD                                
*                                                                               
CTOREC   DSECT                     OUTPUT TYPE RECORD                           
CTOKEY   DS    0CL25     V         KEY                                          
CTOKTYP  DS    CL1       C         RECORD TYPE 'O'                              
CTOKTYPQ EQU   C'O'                                                             
CTOKSPAR DS    CL13      X         SPARE (BINARY ZEROES)                        
CTOKID   DS    CL10      C         OUTPUT TYPE ID                               
CTOKSUB  DS    CL1       X         SUB NUMBER                                   
CTOLEN   DS    CL2       X         RECORD LENGTH                                
CTOSTAT  DS    CL1       X         STATUS                                       
CTODATA  DS    0C        V         DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'38' OUTPUT TYPE DETAIL)              
                                                                                
*              DSECT TO COVER PROFILE RECORDS                                   
*                                                                               
CTPREC   DSECT                     PROFILE RECORDS                              
CTPKEY   DS    0CL25     V         KEY                                          
CTPKTYP  DS    CL1       C         RECORD TYPE 'P'                              
CTPKTYPQ EQU   C'P'                                                             
CTPKSPAR DS    CL18      X         SPARE (BINARY ZEROES)                        
CTPKSYS  DS    CL1       C         SYSTEM                                       
CTPKPROG DS    CL2       C         PROGRAM                                      
CTPKORIG DS    CL2       C         ORIGINATING OFFICE OVERRIDE                  
*                                  (PROGRAM DEFAULT HAS 2X'00')                 
CTPKSUB  DS    CL1       X         SUB NUMBER                                   
CTPLEN   DS    CL2       X         RECORD LENGTH                                
CTPSTAT  DS    CL1       X         STATUS                                       
CTPDATA  DS    0C        V         DATA (X'01' ACTIVITY)                        
*                                       (X'02' PROGRAM DESCRIPTION)             
*                                       (X'40' DESTINATION CODE)                
*                                       (X'41' ATTENTION TYPE)                  
*                                       (X'42' OUTPUT ID TYPE CODE)             
*                                       (X'43' OUTPUT MODE TYPE CODE)           
*                                       (X'44' PRIORITY)                        
*                                       (X'45' READER CLASS)                    
*                                       (X'46' SORT DATA FORMULA)               
*                                       (X'47' PQ PASSWORD)                     
*                                       (X'48' PROCESSING INSTRUCTIONS)         
*                                       (X'4A' PACKING INSTRUCTIONS)            
*                                       (X'4B' SHORT DESCRIPTION)               
*                                       (X'4C' SHIPPING INSTRUCTIONS)           
*                                       (X'4D' JCL EXCEPTION)                   
*                                       (X'4E' PHASE EXCEPTION)                 
*                                       (X'4F' REPORT FORM CODE)                
*                                       (X'50' SQL TRANFORM FORMULA)            
*                                       (X'51' REPORT TYPE)                     
*                                       (X'52' ARCHIVE CLASS)                   
*                                       (X'53' ARCHIVE STATUS)                  
*                                       (X'54' ARCHIVE DOCUMENT TYPE)           
*                                       (X'55' PRINT AT DDS)                    
*                                       (X'56' TIMING ELEMENT)                  
                                                                                
*              DSECT TO COVER PROFILE DOCTYPE RECORDS                           
*                                                                               
CTPDREC  DSECT                     PROFILE RECORDS                              
CTPDKEY  DS    0CL25     V         KEY                                          
CTPDKTYP DS    XL1       C         RECORD TYPE X'97' (LOWER CASE 'P')           
CTPDKYPQ EQU   X'97'                                                            
CTPDKTY1 DS    XL1       X         RECORD SUBTYPE                               
CTPDKT1Q EQU   X'01'               DOCTYPE RECORD                               
CTPDKT2Q EQU   X'02'               USERID/DOCTYPE RECORD                        
CTPDSPAR DS    CL17      X         SPARE (BINARY ZEROES)                        
CTPDKUID DS    XL2       X         USER ID (ONLY FOR TYPE 2 RECORDS)            
CTPDKDTY DS    XL4       X         DOC TYPE                                     
CTPDLEN  DS    XL2       X         RECORD LENGTH                                
CTPDSTAT DS    XL1       X         STATUS                                       
CTPDDATA DS    0C        V         DATA (X'01' ACTIVITY)                        
*                                       (X'40' ARCHIVE DOCUMENT TYPE)           
                                                                                
*              DSECT TO COVER DEMO ADJUSTMENT RECORDS                           
*                                                                               
CTQREC   DSECT                     DEMO ADJUSTMENT RECORDS                      
CTQKEY   DS    0CL25     V         KEY                                          
CTQKTYP  DS    CL1       C         RECORD TYPE                                  
CTQKTEQU EQU   C'Q'                                                             
         DS    CL13      X         SPARE (BINARY ZEROES)                        
CTQKSRC  DS    CL1       C         SOURCE CODE                                  
CTQKMED  DS    CL1       C         MEDIA CODE                                   
CTQKAGY  DS    CL2       V         AGENCY CODE (X'FFFF'=DEFAULT)                
CTQKCODE DS    CL1       V         SPECIAL CODE (X'FF'=DEFAULT)                 
CTQKCLI  DS    CL3       V         CLIENT CODE (X'FFFFFF'=DEFAULT)              
CTQKBOOK DS    CL2       X         START BOOK (BINARY YYMM)                     
CTQKHUT  DS    CL1       X         HUT FILE CODE (BOOK)                         
CTQLEN   DS    CL2       X         RECORD LENGTH                                
CTQSTAT  DS    CL1       X         STATUS                                       
CTQDATA  DS    0C        V         DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'03' RULES ELEMENT)                   
*                                       (X'04' HUT CODES ELEMENTS)              
*                                       (X'05' INPUT LINES ELEMENTS)            
                                                                                
*              DSECT TO COVER DEMO AGENCY CONTROL (DCON) RECORDS                
*                                                                               
CTRREC   DSECT                     DEMO AGENCY CONTROL RECORDS                  
CTRKEY   DS    0CL25     V         KEY                                          
CTRKTYP  DS    CL1       C         RECORD TYPE                                  
CTRKTEQU EQU   C'R'                                                             
         DS    CL14      X         SPARE (BINARY ZEROES)                        
CTRKSRC  DS    CL1       C         SOURCE CODE                                  
CTRKMED  DS    CL1       C         MEDIA CODE                                   
CTRKAGY  DS    CL2       V         AGENCY CODE (X'FFFF'=DEFAULT)                
CTRKCODE DS    CL1       V         SPECIAL CODE (X'FF'=DEFAULT)                 
CTRKCLI  DS    CL3       V         CLIENT CODE (X'FFFFFF'=DEFAULT)              
CTRKBOOK DS    CL2       X         START BOOK (BINARY YYMM)                     
CTRLEN   DS    CL2       X         RECORD LENGTH                                
CTRSTAT  DS    CL1       X         STATUS                                       
CTRDATA  DS    0C        V         DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'03' DCON OPTIONS ELEMENT)            
*                                       (X'04' MARKET CONTROL ELEMENTS)         
                                                                                
*              DSECT TO COVER STATION CALL LETTER CHANGE LIST RECORDS           
*                                                                               
CTSREC   DSECT                     STATION CALL LETTER CHANGE                   
CTSKEY   DS    0CL25     V         KEY                                          
CTSKTYP  DS    CL1       C         RECORD TYPE                                  
CTSKTEQU EQU   C'S'                                                             
         DS    CL19      X         SPARE                                        
CTSKSRC  DS    CL1       C         SOURCE CODE                                  
CTSKMED  DS    CL1       C         MEDIA CODE                                   
CTSKBOOK DS    XL2       X         START BOOK (BINARY YYMM)                     
CTSKPAGE DS    XL1       X         PAGE NUMBER                                  
CTSLEN   DS    XL2       X         RECORD LENGTH                                
CTSSTAT  DS    XL1       X         STATUS                                       
CTSDATA  DS    0C        V         DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'02' DESCRIPTION ELEMENTS)            
                                                                                
*              DSECT TO COVER IP SUBNET ID RECORDS                              
*                                                                               
CTIPREC  DSECT                     IP SUBNET ID RECORDS                         
CTIPKEY  DS    0CL25     V         KEY                                          
CTIPKTYP DS    CL1       C         RECORD TYPE                                  
CTIPKTEQ EQU   C'3'                                                             
CTIPKTY2 DS    CL1       C         SUB RECORD TYPE                              
CTIPKT2E EQU   C'I'                                                             
         DS    XL7       X         SPARE                                        
CTIPKSID DS    XL16      C         128 BIT ADDR, 1S COMPLEMENT                  
CTIPLEN  DS    XL2       X         RECORD LENGTH                                
CTIPSTAT DS    XL1       X         STATUS                                       
CTIPDATA DS    0C        V         DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'02' DESCRIPTION ELEMENTS)            
*                                       (X'15' SUBNET MASK ELEMENT)             
*                                       (X'1F' PRINCIPAL ID ELEMENT)            
*                                       (X'20' ID ELEMENTS)                     
                                                                                
*              DSECT TO COVER TERMINAL RECORDS                                  
*                                                                               
CTTREC   DSECT                     TERMINAL RECORDS                             
CTTKEY   DS    0CL25     C         KEY                                          
CTTKTYP  DS    CL1       C         RECORD TYPE 'T'                              
CTTKTYPQ EQU   C'T'                                                             
CTTKSPAR DS    CL6       C         SPARE (BINARY ZEROES)                        
CTTKTID  DS    0CL8      C         TERMINAL ID                                  
CTTKLINE DS    CL4       C         LINE ID                                      
CTTKADDR DS    CL4       C         TERMINAL ADDRESS                             
CTTKPASS DS    CL10      C         PASSWORD (OR BINARY ZEROES)                  
*                                  PASSIVE=16X'00',H'TNUM'                      
CTTLEN   DS    CL2       X         RECORD LENGTH                                
CTTSTAT  DS    CL1       X         STAT (X'01' PASSIVE COPY)                    
*                                       (X'02' RECORD HAS X'26' EL)             
*                                       (X'04' PRINTER TERMINAL)                
*                                       (X'08' PRINTER AUTO MODE)               
CTTDATA  DS    0C        V         DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'02' DESCRIPTION - OPTIONAL)          
*                                       (X'03' POINTER ELEMENT)                 
*                                       (X'1F' PRINCIPAL ID ELEMENT)            
*                                       (X'20' ID ELEMENTS)                     
*                                       (X'21' SYSTEM ELEMENTS)                 
*                                       (X'23' PROGRAM TEST ELEMENTS)           
*                                       (X'24' APPLID ELEMENTS)                 
*                                       (X'25' TERMINAL DEFN ELEMENT)           
*                                       (X'26' LOGICAL UNIT ID ELEMENT)         
*                                       (X'27' TERMINAL INFO ELEMENT)           
*                                       (X'28' PRINTER ID ELEMENT)              
*                                       (X'29' PRINTER QUEUE ELEMENTS)          
                                                                                
*              DSECT TO COVER USER PROFILE RECORDS                              
*                                                                               
CTUREC   DSECT                     USER PROFILE RECORDS                         
CTUKEY   DS    0CL25     V         KEY                                          
CTUKTYP  DS    CL1       C         RECORD TYPE 'U'                              
CTUKTYPQ EQU   C'U'                                                             
CTUKSPAR DS    CL10      X         SPARE (BINARY ZEROES)                        
CTUKSYS  DS    CL1       C         SYSTEM  (ON-LINE=T)                          
CTUKPROG DS    CL3       C         PROGRAM (OFF-LINE 1ST BYTE=0)                
*                                                                               
CTUKPAGE DS    CL1       X         PAGE NUMBER (TO BE REMOVED)                  
         ORG   CTUKPAGE                                                         
CTUKLANG DS    CL1       X         LANGUAGE CODE (DEFN. RECORD ELSE 0)          
*                                                                               
CTUKAGY  DS    CL2       C         AGENCY (FIELD RECORDS HAVE 2X'00')           
         ORG   CTUKAGY                                                          
CTUKUID  DS    XL2       X         USER ID NUMBER (IF NOT AGENCY ALPHA)         
*                                                                               
CTUKMED  DS    CL1       C         MEDIA  (AGENCY DEFAULT HAS 1X'00')           
CTUKCLT  DS    CL3       C         CLIENT (MEDIA  DEFAULT HAS 3X'00')           
CTUKBCT  DS    CL2       X         BOOK CAT  (CLI DEFAULT HAS 2X'00')           
         DS    CL1       X         SPARE  (BINARY ZEROES)                       
         ORG   CTUKMED                                                          
CTUKNAM  DS    CL6                 SIXPACK'D WRITER NAME (FOR $DQU)             
         DS    CL1                 SPARE                                        
         ORG   CTUKMED                                                          
CTUKUNT  DS    CL1       C         ACCPAK UNIT                                  
CTUKLDG  DS    CL1       C         ACCPAK LEDGER                                
CTUKACT  DS    CL3       C         ACCPAK ACCOUNT                               
         DS    CL2                 SPARE (BINARY ZEROES)                        
CTULEN   DS    CL2       X         RECORD LENGTH                                
CTUSTAT  DS    CL1       X         STATUS                                       
CTUDATA  DS    0C        V         DATA FOR FIELD DESCRIPTION RECORDS -         
*                                       (X'01' ACTIVITY ELEMENT)                
*                                       (X'02' DESCRIPTION ELEMENT)             
*                                       (X'70' FIELD DEFINITION)                
*                                       (X'71' POST VALIDATION)                 
*                                                                               
*                                  DATA FOR PROFILE VALUE RECORDS               
*                                       (X'01' ACTIVITY ELEMENT)                
*                                       (X'72' VALUE ELEMENTS)                  
*                                       (X'73' KEY FIELD VALUE ELEMENT)         
                                                                                
*              DSECT TO COVER PERSONAL AUTHORIZATION RECORDS                    
*                                                                               
CT0REC   DSECT                     PERSONAL AUTHORIZATION RECORDS               
CT0KEY   DS    0CL25     V         KEY                                          
CT0KTYP  DS    CL1       C         RECORD TYPE                                  
CT0KTEQU EQU   C'0'                                                             
CT0KAGY  DS    CL2       C         AGENCY ALPHA CODE                            
CT0KEYS  DS    0CL22                                                            
*                                  AUTHORIZATION NUMBER RECORDS                 
         DS    XL20      X         SPARE (BINARY ZEROES)                        
CT0KNUM  DS    XL2       X         PERSON AUTH NUMBER (X'FFFF'-X'0000')         
*                                  AUTHORIZATION CODE RECORDS                   
         ORG   CT0KEYS                                                          
CT0KPID  DS    CL8       C         PERSONAL ID IF REQUIRED ELSE NULLS           
CT0KDTM  DS    0XL4      X         EFFECTIVE DATE/TIME 1'S COMPLEMENT           
CT0KDTD  DS    XP(DT02X)L2         EFFECTIVE DATE 1'S COMPLEMENT                
CT0KDTT  DS    XL2       X         EFFECTIVE TIME 1'S COMPLEMENT                
CT0KCODE DS    CL10      C         SECRET LOG-ON CODE                           
*                                  PERSON RECORDS                               
         ORG   CT0KEYS                                                          
CT0KOFFC DS    CL2       C         OFFICE CODE                                  
CT0KLAST DS    CL18      C         LAST NAME                                    
CT0KFI   DS    CL1       C         FIRST INITIAL                                
CT0KMI   DS    CL1       C         MIDDLE INITIAL                               
*                                                                               
CT0LEN   DS    XL2       X         RECORD LENGTH                                
CT0STAT  DS    XL1       X         STATUS (X'20' LOCKED)                        
CT0DATA  DS    0C        V         DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'03' POINTER ELEMENTS)                
*                                       (X'21' SYSTEM ELEMENTS)                 
                                                                                
*              DSECT TO COVER VALUE RECORDS                                     
*                                                                               
CTVREC   DSECT                     VALUE RECORDS                                
CTVKEY   DS    0CL25     V         KEY                                          
CTVKTYP  DS    CL1       C         RECORD TYPE 'V'                              
CTVKTYPQ EQU   C'V'                                                             
CTVKSPAR DS    CL16      X         SPARE (BINARY ZEROES)                        
CTVKREC  DS    CL1       C         RECORD TYPE 'F'=FILTER                       
*                                              'O'=OPTION                       
CTVKSYS  DS    CL1       C         SYSTEM (SEE COMMENT RECORD)                  
CTVKKEY  DS    CL4       V         MEDIA FILTER=AGYALPH/MEDIA                   
*                                  ACCOUNT FILTER=COMPANY/UNIT/LEDGER           
*                                  REQUEST OPTION=AGYALPH/PROGRAM               
CTVKNUM  DS    CL1       X         OPTION/FILTER NUMBER                         
CTVKPAGE DS    CL1       X         PAGE NUMBER                                  
CTVLEN   DS    CL2       X         RECORD LENGTH                                
CTVSTAT  DS    CL1       X         STATUS                                       
CTVDATA  DS    0C        V         DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'A0' NAME ELEMENT)                    
*                                       (X'A1' VALUE ELEMENTS)                  
                                                                                
*              DSECT TO COVER SYSTEM LIST RECORDS                               
*                                                                               
CTWREC   DSECT                     SYSTEM LIST RECORDS                          
CTWKEY   DS    0CL25     V         KEY                                          
CTWKTYP  DS    CL1       C         RECORD TYPE 'W'                              
CTWKTYPQ EQU   C'W'                                                             
CTWKSPAR DS    CL14      X         SPARE (BINARY ZEROES)                        
CTWKAGY  DS    CL2       X         AGENCY CODE OR BINARY ZEROES                 
CTWKREC  DS    CL1       C         SUB-RECORD TYPE -                            
CTWKRLIN EQU   C'L'                LINE LIST                                    
CTWKRUSR EQU   C'I'                USER-ID LIST                                 
CTWKRSYS EQU   C'S'                SYSTEM LIST                                  
CTWKRPTS EQU   C'P'                PTS LIST                                     
CTWKRPRT EQU   C'R'                PRINTER LIST                                 
CTWKRIDG EQU   C'G'                ID GROUP LIST                                
CTWKRAGY EQU   C'A'                AGENCY LIST                                  
CTWKID   DS    CL6       C         LIST ID                                      
CTWKSUB  DS    CL1       X         SUB-NUMBER                                   
         ORG   CTWKSUB                                                          
CTWKSYSN DS    XL1       X         FACPAK SYSTEM NUMBER (OR 0 FOR ALL)          
*&&US                                                                           
CTWKSPOT EQU   X'02'               SPOT                                         
CTWKNET  EQU   X'03'               NET                                          
CTWKPRNT EQU   X'04'               PRINT                                        
CTWKMPL  EQU   X'05'               MEDIA PLANNING                               
CTWKACC  EQU   X'06'               ACC                                          
CTWKTAL  EQU   X'07'               TALENT                                       
CTWKREP  EQU   X'08'               REP                                          
CTWKMBA  EQU   X'09'               MEDIA BASE                                   
CTWKCTL  EQU   X'0A'               CONTROL                                      
CTWKCPP  EQU   X'0C'               COST PER POINT                               
CTWKSTR  EQU   X'0D'               SPOT TRAFFIC                                 
CTWKPER  EQU   X'0E'               PERSON                                       
*&&                                                                             
*&&UK                                                                           
CTWKMED  EQU   X'04'               MEDIA                                        
CTWKMPL  EQU   X'05'               MEDIA PLANNING                               
CTWKACC  EQU   X'06'               ACC                                          
CTWKFEE  EQU   X'06'               FEE                                          
CTWKMBA  EQU   X'09'               MEDIA BASE                                   
CTWKCTL  EQU   X'0A'               CONTROL                                      
CTWKPER  EQU   X'0E'               PERSON                                       
*&&                                                                             
CTWLEN   DS    CL2       X         RECORD LENGTH                                
CTWSTAT  DS    CL1       X         STATUS                                       
CTWDATA  DS    0C        V         DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'02' DESCRIPTION ELEMENT)             
*                                       (X'A4' LIST ELEMENTS)                   
*                                       (X'A5' LIST INCLUDE ELEMENTS)           
                                                                                
*              DSECT TO COVER CPP EXTRACT RULES RECORD                          
*                                                                               
CTXREC   DSECT                     CPP EXTRACT RULES RECORD                     
CTXKEY   DS    0CL25     V         KEY                                          
CTXKTYP  DS    CL1       C         RECORD TYPE C'X'                             
CTXKTYPQ EQU   C'X'                                                             
CTXKSPAR DS    CL9       X         SPARE (BINARY ZEROES)                        
CTXKAGY  DS    CL2       C         AGENCY CODE                                  
CTXKCLT  DS    CL3       C         CLIENT CODE (OR 3X'00')                      
CTXKPRD  DS    CL3       C         PRODUCT NUMBER (OR 3X'00')                   
CTXKEST  DS    CL1       X         ESTIMATE NUMBER (OR X'00')                   
CTXKSTRT DS    CL3       PWOS      START DATE (OR 3X'00')                       
CTXKEND  DS    CL3       PWOS      END DATE (OR 3X'00')                         
CTXLEN   DS    CL2       X         RECORD LENGTH                                
CTXSTAT  DS    CL1       X         STATUS                                       
CTXDATA  DS    0C        V         DATE (X'01' ACTIVITY ELEMENT)                
*                                       (X'74' DEMO EXTRACT ELEMENT)            
*                                       (X'76' PROGTYP EQUIV ELEMENT)           
                                                                                
*              DSECT TO COVER CPP PROJECTION FORMULA RECORD                     
*                                                                               
CTYREC   DSECT                     CPP PROJECTION FORMULA                       
CTYKEY   DS    0CL25     V         KEY                                          
CTYKTYP  DS    CL1       C         RECORD TYPE C'Y'                             
CTYKTYPQ EQU   C'Y'                                                             
CTYKSPAR DS    CL19      X         SPARE (BINARY ZEROES)                        
CTYKAGY  DS    CL2       C         AGENCY CODE                                  
CTYKFORM DS    CL1       C         FORMULA CODE                                 
CTYKYEAR DS    CL1       X         YEAR                                         
CTYKMON  DS    CL1       X         MONTH                                        
CTYLEN   DS    CL2       X         RECORD LENGTH                                
CTYSTAT  DS    CL1       X         STATUS                                       
CTYDATA  DS    0C                  DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'78' FACTOR ELEMENT)                  
                                                                                
*              DSECT TO COVER INTERFACE TAPE RECORDS                            
*                                                                               
CTZREC   DSECT                     INTERFACE TAPE RECORDS                       
CTZKEY   DS    0CL25     V         KEY                                          
CTZTYP   DS    CL1       C         RECORD TYPE C'Z'                             
CTZTYPQ  EQU   C'Z'                                                             
CTZSPAR  DS    CL18      C         SPARE (BINARY ZEROS)                         
CTZUSER  DS    CL2       X         USER-ID NUMBER                               
CTZSYS   DS    CL1       C         SYSTEM                                       
CTZPGM   DS    CL2       C         PROGRAM                                      
CTZLGR   DS    CL1       C         LEDGER                                       
CTZLEN   DS    CL2       X         RECORD LENGTH                                
CTZSTAT  DS    CL1       X         STATUS                                       
CTZDATA  DS    0C        V         DATA (X'01' ACTIVITY ELEMENT                 
*                                       (X'B2' INTERFACE ELEMENT)               
                                                                                
*              DSECT TO COVER FACPAK TABLE RECORDS                              
*                                                                               
CT3REC   DSECT                     FACPAK TABLE RECORDS                         
CT3KEY   DS    0CL25     V         KEY                                          
CT3KTYP  DS    CL1       C         RECORD TYPE 3                                
CT3KTYPQ EQU   C'3'                                                             
CT3KKEY  DS    CL24                REST OF KEY                                  
CT3LEN   DS    CL2       X         LENGTH                                       
CT3STAT  DS    CL1       X         STATUS                                       
CT3DATA  DS    0C                  DATA (X'01' ACTIVITY)                        
*                                       (X'02' DESCRIPTION)                     
*                                       (X'26' LUID)                            
*                                       (X'E2' APPLICATION ACCESS)              
*                                                                               
         ORG   CT3KKEY                                                          
CT3SSUB  DS    CL1       C         SUB TYPE                                     
CT3SYSQ  EQU   C'S'                SE SYSTEM RECORD                             
CT3SSPAR DS    CL21      C         SPARE (BINARY ZEROS)                         
CT3SSE   DS    XL1       C         SE NUMBER                                    
         DS    XL1                 SPARE                                        
*                                                                               
         ORG   CT3KKEY                                                          
CT3ASUB  DS    CL1       C         SUB TYPE                                     
CT3APLQ  EQU   C'A'                APPLICATION RECORD                           
CT3ASPAR DS    CL21      C         SPARE (BINARY ZEROS)                         
CT3AAPPL DS    XL1       X         FAC APPLICATION NUMBER                       
         DS    XL1                 SPARE                                        
*                                                                               
         ORG   CT3KKEY                                                          
CT3PSUB  DS    CL1       C         SUB TYPE                                     
CT3PRGQ  EQU   C'P'                PROGRAM RECORD                               
CT3PSPAR DS    CL12      C         SPARE (BINARY ZEROS)                         
CT3PSYS  DS    XL1       X         SYSTEM                                       
CT3PCTRY DS    XL1       X         COUNTRY                                      
CT3PPROG DS    CL7       C         PROGRAM                                      
         DS    XL2                 SPARE                                        
*                                                                               
         ORG   CT3KKEY                                                          
CT3ESUB  DS    CL1       C         SUB TYPE                                     
CT3EASIQ EQU   C'E'                EASY LINK STATION RECORD                     
CT3ESPAR DS    CL17      C         SPARE (BINARY ZEROS)                         
CT3EMED  DS    CL1       C         MEDIA CODE                                   
CT3ESTAT DS    CL5       X         STATION CODE                                 
*                                                                               
         ORG   CT3KKEY                                                          
CT3DSUB  DS    CL1       C         SUB TYPE                                     
CT3DDSDL EQU   C'D'                DDS DEPT LEVEL SECURITY                      
CT3DSPAR DS    CL23      C         SPARE (BINARY ZEROS)                         
*                                                                               
                                                                                
*              DSECT TO COVER SYSTEM ACCESS RECORDS                             
*                                                                               
CT5REC   DSECT                     SYSTEM ACCESS RECORDS                        
CT5KEY   DS    0CL25     V         KEY                                          
CT5KTYP  DS    CL1       C         RECORD TYPE                                  
CT5KTYPQ EQU   C'5'                                                             
CT5KSPAR DS    CL22      C         SPARE (BINARY ZEROS)                         
CT5KALPH DS    CL2       X         ALPHA AGENCY ID                              
CT5LEN   DS    CL2       X         RECORD LENGTH                                
CT5STAT  DS    CL1       X         STATUS                                       
CT5DATA  DS    0C        V         DATA (X'01' ACTIVITY ELEMENT)                
*                                       (X'02' USER-ID ELEMENT)                 
*                                       (X'1B' AGENCY LABEL ELEMENT)            
*                                       (X'21' SYSTEM ELEMENTS)                 
*                                       (X'B4' AGENCY GROUP DETAILS)            
*                                       (X'B6' ASSOC AGENCY LIST)               
*                                       (X'BC' UK MEDIA AGENCY)                 
                                                                                
CT7REC   DSECT                     SCRIPT OBJECT RECORD                         
CT7KEY   DS    0CL25     V         KEY                                          
CT7KTYP  DS    CL1       C         RECORD TYPE                                  
CT7KTYPQ EQU   C'7'                SCRIPT RECORD                                
         DS    CL14      X         SPARE BINARY ZEROES                          
CT7KCODE DS    CL8       C         SCRIPT CODE                                  
CT7SEQNO DS    CL2       C         RECORD SEQUENCE NUMBER                       
CT7LEN   DS    CL2       X         RECORD LENGTH                                
CT7STAT  DS    CL1       X         STATUS                                       
CT7DATA  DS    0C        V         SCRIPT STRING STARTS HERE                    
CT7KEYL  EQU   *-CT7KEY                                                         
                                                                                
CT8REC   DSECT                     LOCK RECORD                                  
CT8KEY   DS    0CL25     V         KEY                                          
CT8KTYP  DS    CL1       C         RECORD TYPE                                  
CT8KTYPQ EQU   C'8'                                                             
CT8KDATE DS    CL3       X         DATE CYYDDD                                  
CT8KSE   DS    CL1       X         SE NUMBER                                    
CT8KAG   DS    CL2       C         AGENCY ALPHA                                 
CT8KTYPE DS    CL2       X         RECORD TYPE                                  
CT8KKEY  DS    CL10      C         KEY                                          
         DS    CL3       X         SPARE BINARY ZEROS                           
CT8KTIME DS    CL3       X         REQ TIME PL3 HH:MM:SS (COMPLIMENTED)         
CT8LEN   DS    CL2       X         RECORD LEN                                   
CT8STAT  DS    CL1       X         STATUS                                       
CT8DATA  DS    0C        V         DATA (X'B7' LOCKET ENTRY ELEMENT)            
                                                                                
*##PROCESS ACTIVE RECORD OFF                                                    
*##PROCESS ELEMENT ON                                                           
*              DSECT TO COVER ACTIVITY ELEMENT (X'01')                          
*                                                                               
CTACTD   DSECT                     ACTIVITY ELEMENT (X'01')                     
CTACTEL  DS    CL1       X         ELEMENT CODE                                 
CTACTELQ EQU   X'01'                                                            
CTACTLEN DS    CL1       X         ELEMENT LENGTH (5)                           
CTACTDT  DS    CL3       B         DATE OF LAST ACTIVITY (YMD)                  
CTACTLNQ EQU   *-CTACTD                                                         
CTACTLLO DS    XL2                 DATE LAST LOGGED IN (YM) BINARY              
         DS    XL2                                                              
CTACTL2Q EQU   *-CTACTD                                                         
                                                                                
*              DSECT TO COVER DESCRIPTION ELEMENT (X'02')                       
*                                                                               
CTDSCD   DSECT                     DESCRIPTION ELEMENT                          
CTDSCEL  DS    CL1       X         ELEMENT CODE X'02'                           
CTDSCELQ EQU   X'02'                                                            
CTDSCLEN DS    CL1       X         ELEMENT LENGTH (DESCRIPTION+2)               
*##DATATYPE RESTOFEL                                                            
CTDSC    DS    0CL60     C         DESCRIPTION                                  
*                                  (ID RECORDS HAVE H'ID NUM' HERE)             
                                                                                
*              DSECT TO COVER LATEST BOOK ELEMENTS                              
*                                                                               
CTBKD    DSECT                     LATEST BOOK ELEMENT                          
CTBKEL   DS    CL1       X         ELEMENT CODE                                 
CTBKELEQ EQU   X'02'                                                            
CTBKLN   DS    CL1       X         ELEMENT LENGTH                               
CTBKSRC  DS    CL1       C         SOURCE CODE                                  
CTBKMED  DS    CL1       C         MEDIA CODE                                   
CTBKYM   DS    CL2       X         LATEST BOOK (BINARY YYMM)                    
CTBKLNEQ EQU   *-CTBKD                                                          
*&&US                                                                           
*              DSECT TO COVER PROGRAM EQUATE ELEMENTS                           
*                                                                               
CTDPD    DSECT                     PROGRAM EQUATE                               
CTDPEL   DS    CL1       X         ELEMENT CODE                                 
CTDPELEQ EQU   X'02'                                                            
CTDPLN   DS    CL1       X         ELEMENT LENGTH                               
CTDPMED  DS    CL1       C         FILE CODE (N=NETWORK T=SPOT TV)              
CTDPSRC  DS    CL1       C         SOURCE CODE                                  
CTDPPCD  DS    CL3       X         PROGRAM CODE                                 
CTDPBK   DS    CL2       X         BOOK (X'FF' = DEFAULT) REVERSE SEQ.          
CTDPLNEQ EQU   *-CTDPD                                                          
*&&                                                                             
                                                                                
*              DSECT TO COVER PASSIVE POINTER ELEMENT                           
*                                                                               
CTPASD   DSECT                                                                  
CTPASEL  DS    CL1       X         ELEMENT CODE X'03'                           
CTPASELQ EQU   X'03'                                                            
CTPASLEN DS    CL1       X         ELEMENT LENGTH - (04)=NUMBER                 
*                                                   (NN)=NAME                   
*##DATATYPE RESTOFEL                                                            
CTPASDTA DS    0C        V         NUMBER/NAME                                  
                                                                                
*              DSECT TO COVER DEMO CONTROL (DCON) OPTIONS ELEM (X'03')          
*                                                                               
CTROD    DSECT                                                                  
CTROECDE DS    XL1                 ELEMENT CODE                                 
CTROECDQ EQU   X'03'                                                            
CTROLEN  DS    XL1                 ELEMENT LENGTH                               
CTROOPT1 DS    XL1                 OPTION BYTE 1                                
CTROOPT2 DS    XL1                 OPTION BYTE 2                                
CTROOPT3 DS    XL1                 OPTION BYTE 3                                
CTROOPT4 DS    XL1                 OPTION BYTE 4                                
CTROOPT5 DS    XL1                 OPTION BYTE 5                                
CTROELNQ EQU   *-CTROD             ELEMENT LENGTH                               
                                                                                
*              DSECT TO COVER DCON MARKET CONTROL ELEMENT (X'04')               
*                                                                               
CTRMD    DSECT                                                                  
CTRMECDE DS    XL1                 ELEMENT CODE                                 
CTRMECDQ EQU   X'04'                                                            
CTRMLEN  DS    XL1                 ELEMENT LENGTH                               
CTRMTYPE DS    XL1                 MARKET LIST TYPE                             
CTRMTPV  EQU   X'00'                VALID                                       
CTRMTPI  EQU   X'FF'                INVALID                                     
CTRMFXLQ EQU   *-CTRMD             FIXED OVERHEAD LENGTH                        
CTRMMKTS DS    0XL2                ARRAY OF MARKET CODES                        
*&&US                                                                           
*              DSECT TO COVER DEMO FORMULA PRECISION ELEM (X'03')               
*                                                                               
CTPRECSD DSECT                                                                  
CTPRECDE DS    X                   ELEMENT CODE                                 
CTPRECDQ EQU   X'03'                                                            
CTPRELEN DS    X                   ELEMENT LENGTH                               
CTPRECCD DS    X                   PRECISION CODE                               
CTPRECCD_FORMULA_PRECISION_ADJUSTMENT EQU X'20'                                 
CTPRECFL DS    X                   FLAGS                                        
CTPRECFL_NO_DIRECT_TRANSFER EQU X'80'                                           
CTPRECFL_INDEXED_DEMO       EQU X'40'                                           
CTPRECFL_EQUATED_FORMULA    EQU X'20'                                           
CTPRECFL_NO_OP_DEMO         EQU X'10'                                           
CTPRELNQ EQU   *-CTPRECSD          ELEMENT LENGTH                               
                                                                                
*              DSECT TO COVER DFORM POLISH FORMULA ELEMENT (X'04')              
*                                                                               
CTDPFCD  DSECT                                                                  
CTDPFCDE DS    X                   ELEMENT CODE                                 
CTDPFCDQ EQU   X'04'                                                            
CTDPFLEN DS    X                   ELEMENT LENGTH                               
CTDPFCFQ EQU   *-CTDPFCD           FIXED OVERHEAD LENGTH                        
CTDPFORM DS    0X                  INPUT FORMULA                                
CTDPFLNQ EQU   *-CTDPFCD           ELEMENT LENGTH                               
                                                                                
*              DSECT TO COVER DFORM INPUT FORMULA ELEMENT (X'05')               
*                                                                               
CTDINCD  DSECT                                                                  
CTDINCDE DS    X                   ELEMENT CODE                                 
CTDINCDQ EQU   X'05'                                                            
CTDINLEN DS    X                   ELEMENT LENGTH                               
CTDINCS# DS    X                   SEQUENCE NUMBER                              
CTDINCFQ EQU   *-CTDINCD           FIXED OVERHEAD LENGTH                        
CTDINIF  DS    0X                  INPUT FORMULA                                
CTDINLNQ EQU   *-CTDINCD           ELEMENT LENGTH                               
*&&                                                                             
*              DSECT TO COVER INDEX ELEMENT (X'04')                             
*                                                                               
CTINDD   DSECT                     INDEX ELEMENT                                
CTINDEL  DS    CL1       X         ELEMENT CODE                                 
CTINDELQ EQU   X'04'                                                            
CTINDLEN DS    CL1       X         ELEMENT LENGTH (254)                         
CTINDHI  DS    CL1       X         HIGHEST SEQ # USED                           
CTINDEX  DS    CL251     X         250X1 BYTE INDEX ENTRIES +                   
*                                  1 BYTE ZERO ENTRY FOR SPLIT                  
*                                  INDEX REUSE CYCLE                            
                                                                                
*              DSECT TO COVER AGENCY ALPHA ID ELEMENT (X'06')                   
*                                                                               
CTAGYD   DSECT                     AGENCY ALPHA ID ELEMENT                      
CTAGYEL  DS    CL1       X         ELEMENT CODE                                 
CTAGYELQ EQU   X'06'                                                            
CTAGYLEN DS    CL1       X         ELEMENT LENGTH (6)                           
CTAGYID  DS    CL2       C         AGENCY ALPHA ID                              
CTAGYLNG DS    XL1       X         AGENCY LANGUAGE                              
CTAGYIDT DS    CL1       C         ID TYPE CODE                                 
CTAGYTAQ EQU   C'A'                ID TYPE CODE ACTUALS                         
CTAGYTEQ EQU   C'E'                ID TYPE CODE ESTIMATES                       
CTAGYTMQ EQU   C'M'                ID TYPE CODE MEDIA                           
CTAGYTTQ EQU   C'T'                ID TYPE CODE TEST                            
CTAGYTCQ EQU   C'C'                ID TYPE CODE CLITEST                         
CTAGYTDQ EQU   C'D'                ID TYPE CODE DORMANT                         
CTAGYTRQ EQU   C'R'                ID TYPE CODE (A)RCHIVE                       
CTAGYTOQ EQU   C'O'                ID TYPE CODE OFFICE                          
CTAGYTXQ EQU   C'X'                ID TYPE CODE CROSSFILE                       
CTAGYLNQ EQU   *-CTAGYD                                                         
                                                                                
*CTGENIDO - ID OPTIONS ELEMENT DSECT CONTAINS ELEMENT TYPE X'07'                
       ++INCLUDE CTGENIDO                                                       
                                                                                
*              DSECT TO COVER DATA ELEMENT (X'10')                              
*                                                                               
CTDATD   DSECT                     DATA ELEMENT                                 
CTDATEL  DS    CL1       X         ELEMENT CODE X'10'                           
CTDATELQ EQU   X'10'                                                            
CTDATLEN DS    CL1       X         ELEMENT LENGTH (DATA+2)                      
*##DATATYPE RESTOFEL                                                            
CTDATA   DS    0CL80     C         COMPRESSED DATA                              
                                                                                
*              DSECT TO COVER INCLUDE ELEMENT (X'11')                           
*                                                                               
CTINCD   DSECT                     INCLUDE ELEMENT                              
CTINCEL  DS    CL1       X         ELEMENT CODE X'11'                           
CTINCELQ EQU   X'11'                                                            
CTINCLEN DS    CL1       X         ELEMENT LENGTH (26)                          
CTINCLUD DS    CL24      C         KEY OF INCLUDED BOOK                         
                                                                                
*              DSECT TO COVER IP SUBNET MASK ELEMENT (X'15')                    
*                                                                               
CTIPMD   DSECT                     IP SUBNET MASK ELEMENT                       
CTIPMEL  DS    CL1       X         ELEMENT CODE X'15'                           
CTIPMELQ EQU   X'15'                                                            
CTIPMLEN DS    CL1       X         ELEMENT LENGTH (MASK+2)                      
CTIPM    DS    0XL16     C         MASK (128BIT)                                
                                                                                
*              DSECT TO COVER IP PU ID ELEMNT(X'16')                            
*                                                                               
CTIPPD   DSECT                     IP PUID ELEMENT                              
CTIPPEL  DS    CL1       X         ELEMENT CODE X'16'                           
CTIPPELQ EQU   X'16'                                                            
CTIPPLEN DS    CL1       X         ELEMENT LENGTH (MASK+2)                      
CTIPPFLG DS    XL1       X         PUID FLAG                                    
CTIPPFIP EQU   X'80'               PUID CONVERTED IP ADDRESS                    
*                                  (ELSE JUST STRAIGHT TEXT)                    
CTIPPID  DS    0XL40     C         PU ID                                        
CTIPPLNQ EQU   *-CTIPPD                                                         
                                                                                
*              DSECT TO COVER IP RESOURCE NAME ELEMENT (X'17')                  
*                                                                               
CTIPRD   DSECT                     IP RESOURCE NAME ELEMENT                     
CTIPREL  DS    CL1       X         ELEMENT CODE X'17'                           
CTIPRELQ EQU   X'17'                                                            
CTIPRLEN DS    CL1       X         ELEMENT LENGTH (MASK+2)                      
*                                                                               
CTIPRNAM DS    0XL40     C         RESOURCE NAME                                
CTIPRLNQ EQU   *-CTIPRD                                                         
                                                                                
*              DSECT TO COVER AGENCY LABEL ELEMENT (X'1B')                      
*                                                                               
CTAGCD   DSECT                     DATA ELEMENT                                 
CTAGCEL  DS    CL1       X         ELEMENT CODE X'1B'                           
CTAGCELQ EQU   X'1B'                                                            
CTAGCLEN DS    CL1       X         ELEMENT LENGTH                               
CTAGCCOD DS    CL4       X         AGENCY LABEL                                 
CTAGCLNQ EQU   *-CTAGCD                                                         
                                                                                
*              DSECT TO COVER AGENCY ACCESS DATES  (X'1C')                      
*                                                                               
CTACCD   DSECT                     DATA ELEMENT                                 
CTACCEL  DS    CL1       X         ELEMENT CODE X'1B'                           
CTACCELQ EQU   X'1C'                                                            
CTACCLEN DS    CL1       X         ELEMENT LENGTH                               
CTACCNAD DS    CL3       X         AGENCY NO ACCESS DATE                        
CTACCROD DS    CL3       X         AGENCY READ ONLY ACCESS DATE                 
CTACCLNQ EQU   *-CTACCD                                                         
CTACCSYS DS    X                   SYSTEM                                       
CTACCSNA DS    CL3                 SYSTEM NO ACCESS DATE                        
CTACCSRO DS    CL3                 SYSTEM READ ONLY ACCESS DATE                 
CTACCSYL EQU   *-CTACCSYS                                                       
                                                                                
*              DSECT TO COVER PRINCIPAL ID ELEMENT (X'1F')                      
*                                                                               
CTPIDD   DSECT                     PRINCIPAL ID ELEMENT                         
CTPIDEL  DS    CL1       X         ELEMENT CODE X'1F'                           
CTPIDELQ EQU   X'1F'                                                            
CTPIDLEN DS    CL1       X         ELEMENT LENGTH (12)                          
CTPID    DS    CL10      C         PRINCIPAL ID NAME (LEFT ALIGNED)             
                                                                                
*              DSECT TO COVER ID ELEMENT (X'20')                                
*                                                                               
CTIDD    DSECT                     ID ELEMENT                                   
CTIDEL   DS    CL1       X         ELEMENT CODE X'20'                           
CTIDELQ  EQU   X'20'                                                            
CTIDLEN  DS    CL1       X         ELEMENT LENGTH (12 OR 6)                     
CTID     DS    CL10      C         ID NAME (LEFT ALIGNED)                       
         ORG   CTID                                                             
         DS    XL2       X         X'0000' ID LIST, X'0001' AGENCY              
CTIDAGY  DS    CL2       C         AGENCY ALPHA                                 
         DS    XL6                                                              
         ORG   CTID                NEW ELEMENT HAS TYPE PLUS V/L DATA           
CTIDTYP  DS    XL1       X         ELEMENT TYPE                                 
CTIDNEQ  EQU   X'80'               NEW ELEMENT - FIRST BIT MUST BE ZERO         
CTIDROQ  EQU   X'40'               READ ONLY ITEM                               
CTIDNUQ  EQU   X'20'               LAST TWO BYTES OF EL IS AN ID NUMBER         
CTIDAGQ  EQU   X'02'               NAME IS AN AGENCY                            
CTIDLIQ  EQU   X'01'               NAME IS A LIST                               
CTIDNAM  DS    CL8       C         ELEMENT NAME (DEPENDS ON TYPE)               
                                                                                
*              DSECT TO COVER SYSTEM AUTHORIZATION ELEMENT (X'21')              
*                                                                               
CTSYSD   DSECT                     SYSTEM AUTHORIZATION ELEMENT                 
CTSYSEL  DS    CL1       X         ELEMENT CODE                                 
CTSYSELQ EQU   X'21'                                                            
CTSYSLEN DS    CL1       X         ELEMENT LENGTH (VARIABLE)                    
CTSYSNUM DS    CL1       X         SYSTEM NUMBER (FOR CALLOV)                   
CTSYSSE  DS    CL1       X         SE NUMBER (FOR TASK ID)                      
CTSYSAGB DS    CL1       X         BINARY AGENCY/COMPANY                        
CTSYSIND DS    XL1       X         INDICATORS                                   
CTSYSINF EQU   X'80'               NEW FORMAT ELEMENT                           
CTSYSIYP EQU   X'40'               PASSWORD IS REQUIRED FOR SYSTEM              
CTSYSINP EQU   X'20'               PASSWORD NOT REQUIRED FOR SYSTEM             
*&&US                                                                           
CTSYSNCA EQU   X'10'               AGENCY USES NCA CABLE DATA                   
CTSYSRAD EQU   X'08'               AGENCY USES M STREET RADIO DATA              
CTSYSMF  EQU   X'04'               AGENCY USES MEDIA FRAMEWORKS DATA            
CTSYSOWN EQU   X'02'               AGENCY USES SRDS OWNERSHIP DATA              
*&&                                                                             
*&&UK                                                                           
CTSYSBNV EQU   X'08'               BOOK CATS DEFAULT TO NEGATIVE                
CTSYSBWR EQU   X'04'               BOOK CATS DEFAULT TO WRITE                   
CTSYSBRD EQU   CTSYSBNV+CTSYSBWR   BOOK CATS DEFAULT TO READ-ONLY               
*&&                                                                             
CTSYSPRI DS    CL2       X         RELATIVE PRIORITY - REDUNDANT                
         ORG   CTSYSPRI                                                         
CTSYSLID DS    XL2       X         LIMIT ACCESS RECORD ID                       
CTSYSLMT DS    CL4       C         ACCESS LIMIT                                 
         DS    XL2       X         N/D                                          
CTSYSALL DS    CL2       X         ALL AUTHORIZATION LEVEL                      
CTSYSL1Q EQU   *-CTSYSD            LENGTH OF FIXED PORTION OF ELEMENT           
CTSYSPGM DS    0CL3      X         AUTHORIZATION LEVELS - 2 BYTES/PROG.         
                                                                                
*              DSECT TO COVER PROGRAM ELEMENT (X'22')                           
*                                                                               
CTPGMD   DSECT                     PROGRAM ELEMENT                              
CTPGMEL  DS    CL1       X         ELEMENT CODE                                 
CTPGMELQ EQU   X'22'                                                            
CTPGMLEN DS    CL1       X         ELEMENT LENGTH                               
CTPGMNAM DS    CL7       X         PROGRAM NAME                                 
CTPGMNUM DS    XL1       X         PROGRAM NUMBER                               
CTPGMOVL DS    XL1       X         PROGRAM OVERLAY NUMBER                       
CTPGMPRT DS    XL1       X         PROGRAM PRIORITY                             
CTPGMSRT DS    XL1       X         TABLE SORT PRIORITY                          
CTPGMIN1 DS    XL1       X         PROGRAM INDICATORS 1                         
CTPGMIN2 DS    XL1       X         PROGRAM INDICATORS 1                         
CTPGMIN3 DS    XL1       X         PROGRAM INDICATORS 1                         
CTPGMIN4 DS    XL1       X         PROGRAM INDICATORS 1                         
CTPGMMAX DS    XL1       X         MAX TASKS FOR PROGRAM                        
CTPGMCTR DS    XL1       X         COUNTRY CODE                                 
CTPGMTXT DS    XL2       X         GETTXT MESSAGE NUMBER                        
CTPGML1Q EQU   *-CTPGMD            LENGTH OF FIXED PART                         
CTPGMAGY DS    0CL2      C         AGENCY LIST                                  
                                                                                
*              DSECT TO COVER PROGRAM TEST ELEMENT (X'23')                      
*                                                                               
CTPRGD   DSECT                     PROGRAM TEST ELEMENT                         
CTPRGEL  DS    CL1       X         ELEMENT CODE X'23'                           
CTPRGELQ EQU   X'23'                                                            
CTPRGLEN DS    CL1       X         ELEMENT LENGTH (7)                           
CTPRGRAM DS    CL4       C         ON LINE - TSPP (S=SYSTEM P=PROGRAM)          
CTPRGTST DS    CL1       C         TEST VERSION (S/B A, B OR C)                 
                                                                                
*              DSECT TO COVER TERMINAL APPLICATION ID ELEMENT (X'24')           
*                                                                               
CTAPLD   DSECT                     TERMINAL APPLICATION ID ELEMENT              
CTAPLEL  DS    XL1       X         ELEMENT CODE X'24'                           
CTAPLELQ EQU   X'24'                                                            
CTAPLLEN DS    XL1       X         ELEMENT LENGTH (11)                          
CTAPLFLG DS    XL1       X         FLAG                                         
CTAPLID  DS    CL8       C         VTAM APPLICATION ID LEFT ALLIGNED            
                                                                                
*              DSECT TO COVER TERMINAL DEFN ELEMENT (X'25')                     
*                                                                               
CTTRMD   DSECT                     TERMINAL DEFINITION ELEMENT                  
CTTRMEL  DS    XL1       X         ELEMENT CODE X'25'                           
CTTRMELQ EQU   X'25'                                                            
CTTRMLEN DS    XL1       X         ELEMENT LENGTH (32)                          
CTTRMDEV DS    XL1       X         DEVICE 01=TRM,02=PC,81=PRT,82=SHUT           
CTTRMTYP DS    XL1       X         TYPE   01=3270,02=TWX                        
CTTRMCTY DS    XL1       X         COUNTRY CODE                                 
CTTRMAGY DS    CL2       C         AGENCY ALPHA                                 
CTTRMOFC DS    CL1       C         OFFICE CODE                                  
CTTRMFL1 DS    XL1       X         FLAG BYTE 1 01=DDS1,02=DDS2                  
CTTRMFL2 DS    XL1       X         FLAG BYTE 2                                  
CTTRMAT1 DS    XL1       X         ATTRIBUTE BYTE 1=ABCDEFGH                    
CTTRMAT2 DS    XL1       X         ATTRIBUTE BYTE 2=ABCDEFGH                    
CTTRMLTY DS    CL1       C         LINE TYPE  B=BSC,L=LCL,S=SDLC,T=TWX          
CTTRMLSP DS    XL2       X         LINE SPEED CPS (BAUD/8)                      
CTTRMPSP DS    XL2       X         PRINTER SPEED CPS OR LPM                     
CTTRMPST DS    CL1       C         PRINTER SPEED TYPE B/C/L                     
CTTRMPRQ DS    XL1       X         PRINTER NUMBER OF PRQ ENTRIES                
CTTRMPBS DS    XL2       X         PRINTER BUFFER SIZE                          
CTTRMNDE DS    XL1       X         01=DDN 02=ATL 03=CHI 04=LAX 05=DDL           
*                                  06=DAL 07=TOR 08=BLN 09=JWN 10=DET           
*                                  11=MDR 12=DDG 13=MAN 14=LEE 15=AGB           
*                                  16=NYT 17=FFT 18=HAM 19=FRA                  
CTTRMLNE DS    CL4       C         LINE ID                                      
CTTRMCU  DS    XL1       X         CU ADDR                                      
CTTRMDV  DS    XL1       X         DV ADDR                                      
CTTRMESC DS    XL1       X         ESCAPE SEQUENCE NUMBER                       
CTTRMAT3 DS    XL1       X         ATTRIBUTE BYTE 3=ABCDEFGH                    
         DS    XL2       X         SPARE                                        
                                                                                
*              DSECT TO COVER TERMINAL VTAM MUID ELEMENT (X'26')                
*                                                                               
CTLUID   DSECT                     TERMINAL VTAM MUID ELEMENT                   
CTLUIEL  DS    XL1       X         ELEMENT CODE X'26'                           
CTLUIELQ EQU   X'26'                                                            
CTLUILEN DS    XL1       X         ELEMENT LENGTH (11)                          
CTLUIFLG DS    XL1       X         FLAG X'80'=THIS IS A BTAM LUID               
CTLUIID  DS    CL8       C         LOGICAL UNIT LEFT ALLIGNED                   
                                                                                
*              DSECT TO COVER TERMINAL INFO ELEMENT (X'27')                     
*                                                                               
CTTIND   DSECT                     TERMINAL INFO ELEMENT                        
CTTINEL  DS    CL1       X         ELEMENT CODE X'27'                           
CTTINELQ EQU   X'27'                                                            
CTTINLEN DS    CL1       X         ELEMENT LENGTH (VENDOR+20)                   
CTTINSER DS    CL15      C         SERIAL NUMBER                                
CTTINDAT DS    CL3       P         DATE SERIAL NUMBER LAST CHANGED              
CTTINVEN DS    0CL30     C         VENDOR                                       
                                                                                
*              DSECT TO COVER PRINTER ID ELEMENTS                               
*                                                                               
CTPRTD   DSECT                     PRINTER ID ELEMENT                           
CTPRTEL  DS    CL1       X         ELEMENT CODE X'28'                           
CTPRTELQ EQU   X'28'                                                            
CTPRTLEN DS    CL1       X         ELEMENT LENGTH (6)                           
CTPRTID  DS    CL2       X         PRINTER LOCATION ID                          
CTPRTNUM DS    CL1       X         PRINTER NUMBER (WITHIN ID)                   
                                                                                
*              DSECT TO COVER DEFAULT PRINTER QUEUE ENTRY ELEMENTS              
*                                                                               
CTPRQD   DSECT                     DEFAULT PRINTER QUEUE ENTRY                  
CTPRQEL  DS    CL1       X         ELEMENT CODE X'29'                           
CTPRQELQ EQU   X'29'                                                            
CTPRQLEN DS    CL1       X         ELEMENT LENGTH (8)                           
CTPRQDTA DS    0CL6      V         QUEUE ENTRY                                  
CTPRQUSR DS    XL2       X         USER ID                                      
CTPRQSUB DS    CL3       C         SUB ID                                       
CTPRQCLS DS    CL1       C         CLASS                                        
                                                                                
*              DSECT TO COVER DESTINATION DETAIL (X'30')                        
*                                                                               
CTDSTD   DSECT                     DESTINATION DETAIL                           
CTDSTEL  DS    CL1       X         ELEMENT CODE X'30'                           
CTDSTELQ EQU   X'30'                                                            
CTDSTLEN DS    CL1       X         ELEMENT LENGTH (100 OR 166)                  
CTDSTNAM DS    CL33      C         NAME                                         
CTDSTADD DS    CL33      C         ADDRESS                                      
CTDSTLG1 DS    CL7       C         LOGO 1                                       
CTDSTLG2 DS    CL7       C         LOGO 2                                       
CTDSTPOW DS    CL4       C         POWER CODE                                   
CTDSTRUT DS    CL2       C         SHIPPING ROUTE                               
CTDSTLFC DS    CL2       C         LASER FORM CODE CHEQUES                      
CTDSTSPR DS    CL10      C         SPARE                                        
CTDSTAD2 DS    CL33      C         OPTIONAL ADDRESS LINE 3 (LENGTH=166)         
CTDSTAD3 DS    CL33      C         OPTIONAL ADDRESS LINE 4                      
                                                                                
*              DSECT TO COVER ATTENTION DETAIL ELEMENT (X'31')                  
*                                                                               
CTATTND  DSECT                     ATTENTION DETAIL ELEMENT                     
CTATTEL  DS    CL1       X         ELEMENT CODE X'31'                           
CTATTELQ EQU   X'31'                                                            
CTATTLEN DS    CL1       X         ELEMENT LENGTH (L'DETAIL + 5)                
CTATTTYP DS    CL3       C         ATTENTION TYPE                               
CTATTDET DS    0CL33     C         ATTENTION DETAIL                             
                                                                                
*              DSECT TO COVER UK AGENCY DEFINITION ELEMENT                      
*                                                                               
CTUKAD   DSECT                     UK AGENCY DEFINITION                         
CTUKAEL  DS    CL1       X         ELEMENT CODE X'33'                           
CTUKAELQ EQU   X'33'                                                            
CTUKALEN DS    CL1       X         ELEMENT LENGTH                               
CTUKALIN DS    CL4       C         LINE-ID                                      
CTUKAIPA DS    CL3       C         IPA AGENCY ID                                
                                                                                
*              DSECT TO COVER US AGENCY EXTRA INFO ELEMENT                      
*                                                                               
CTUSAD   DSECT                     US AGENCY EXTRA INFO                         
CTUSAEL  DS    CL1       X         ELEMENT CODE X'33'                           
CTUSAELQ EQU   X'33'                                                            
CTUSALEN DS    CL1       X         ELEMENT LENGTH                               
CTUSADPI DS    CL1       C         DARE PARTNER ID                              
CTUSADRC DS    CL5       C         DARE ROUTING CODE                            
CTUSADMQ DS    XL2       X         MQ SERIES ID NUMBER                          
CTUSADFL DS    XL1       X         DARE FLAG                                    
CTUSADFX EQU   X'80'               DARE XML USER                                
CTUSALNQ EQU   *-CTUSAD                                                         
CTUSAVEN DS    CL10                VENDOR NAME                                  
CTUSALN2 EQU   *-CTUSAD                                                         
                                                                                
*              DSECT TO COVER VALID DESTINATION ELEMENTS (X'34')                
*                                                                               
CTVALD   DSECT                     VALID DESTINATION ELEMENT                    
CTVALEL  DS    CL1       X         ELEMENT CODE X'34'                           
CTVALELQ EQU   X'34'                                                            
CTVALLEN DS    CL1       X         ELEMENT LENGTH (16)                          
CTVALDST DS    CL10      C         VALID DESTINATION ID                         
*                                  OR H'0',C'LISTNAME'                          
*                                  OR H'1',C'AG      '                          
CTVALNUM DS    CL2       X         VALID DESTINATION ID NUMBER                  
CTVALSPR DS    CL2       X         SPARE                                        
                                                                                
*              DSECT TO COVER ORIGIN DETAIL ELEMENT (X'36')                     
*                                                                               
CTORGD   DSECT                     ORIGIN DETAIL ELEMENT                        
CTORGEL  DS    CL1       X         ELEMENT CODE                                 
CTORGELQ EQU   X'36'                                                            
CTORGLEN DS    CL1       X         ELEMENT LENGTH (68)                          
CTORGNAM DS    CL33      C         NAME                                         
CTORGADD DS    CL33      C         ADDRESS                                      
                                                                                
*              DSECT TO COVER OUTPUT DETAIL ELEMENT (X'38')                     
*                                                                               
CTOUTD   DSECT                     OUTPUT DETAIL ELEMENT                        
CTOUTEL  DS    CL1       X         ELEMENT CODE X'38'                           
CTOUTELQ EQU   X'38'                                                            
CTOUTLEN DS    CL1       X         ELEMENT LENGTH (32) OR 64 FOR NEW            
CTOUTCLS DS    CL1       C         OUTPUT CLASS                                 
CTOUTPRI DS    CL2       C         OUTPUT PRIORITY                              
CTOUTPOW DS    CL4       C         POWER CODE (USED IN FNO= )                   
CTOUTCC  DS    CL4       C         CARRIAGE CONTROL TAPE                        
CTOUTCPY DS    CL1       N         NUMBER OF COPIES (1-9) FOR POWER LST         
CTOUTDIS DS    CL1       C         OUTPUT DISPOSITION                           
CTOUTSEP DS    CL1       C         SEPERATORS (N=NO)                            
CTOUTTAP DS    CL6       C         OUTPUT TAPE DETAILS                          
CTOUTSTA DS    CL1       X         X'80' = OK FOR USER TO REQUEST               
CTOUTTYP DS    CL1       C         OUTPUT TYPE - P=PRINT,Q=QUEUE,B=BOTH         
CTOUTCHR DS    CL4       C         CHARS= VALUE 1                               
CTOUTCH2 DS    CL4       C         CHARS= VALUE 2                               
*                                                                               
CTOUTCH3 DS    CL4       C         CHARS= VALUE 3                               
CTOUTCH4 DS    CL4       C         CHARS= VALUE 4                               
CTOUTFCH DS    C         C         FICHE CLASS LETTER                           
CTOUTFMN DS    X         X         NUMBER OF FORMDEFS                           
CTOUTFMD DS    CL6       C         FORMDEF= VALUE                               
CTOUTPGN DS    X         X         NUMBER OF PAGEDEFS                           
CTOUTPGD DS    CL6       C         PAGEDEF= VALUE                               
CTOUTPQC DS    CL1       C         PRINT QUEUE CLASS                            
         DS    CL8       C         SPARE                                        
CTOUTLLQ EQU   *-CTOUTD                                                         
                                                                                
*              DSECT TO COVER VALID PRINTER ELEMENT (X'3A')                     
*                                                                               
CTPRND   DSECT                                                                  
CTPRNEL  DS    CL1       X         ELEMENT CODE X'3A'                           
CTPRNELQ EQU   X'3A'                                                            
CTPRNLEN DS    CL1       X         ELEMENT LENGTH (11)                          
CTPRNNUM DS    CL1       X         RPINTER NUMBER                               
CTPRNLIN DS    CL4       C         LINE                                         
CTPRNADD DS    CL4       C         ADDRESS                                      
         ORG   CTPRNNUM                                                         
CTPRNFLG DS    XL2                 LIST NAMED IF ZERO                           
CTPRNLST DS    CL6                 LIST NAME                                    
         DS    X                                                                
                                                                                
*              NOTES ON PROFILE ELEMENTS BELOW (X'40' - X'4F')                  
*              PROFILE TYPE                  PROFILE DATA                       
*              -----------                   ------------                       
*              S=SACRED (NO OVERRIDES)                                          
*              P=PERMANENT                                                      
*              D=DAY OF WEEK                 3 BYTE DAY (MON,TUE ETC)           
*              T=TEMPORARY (UNTIL DATE)      3 BYTE PACKED DATE                 
*              DSECT TO COVER DESTINATION CODE ELEMENT (X'40')                  
*                                                                               
CTDCOD   DSECT                                                                  
CTDCOEL  DS    CL1       X         ELEMENT CODE X'40'                           
CTDCOELQ EQU   X'40'                                                            
CTDCOLEN DS    CL1       X         ELEMENT LENGTH (18)                          
CTDCOTYP DS    CL1       C         PROFILE TYPE (SEE NOTE ABOVE)                
CTDCODTA DS    CL3       V         PROFILE DATA (SEE NOTE ABOVE)                
CTDCODE  DS    CL10      C         DESTINATION ID                               
CTDCNUM  DS    CL2       X         DESTINATION ID NUMBER                        
                                                                                
*              DSECT TO COVER ATTENTION TYPE ELEMENT (X'41')                    
*                                                                               
CTACOD   DSECT                                                                  
CTACOEL  DS    CL1       X         ELEMENT CODE X'41'                           
CTACOELQ EQU   X'41'                                                            
CTACOLEN DS    CL1       X         ELEMENT LENGTH (9)                           
CTACOTYP DS    CL1       C         PROFILE TYPE (SEE NOTE ABOVE)                
CTACODTA DS    CL3       V         PROFILE DATA (SEE NOTE ABOVE)                
CTACODE  DS    CL3       C         ATTENTION TYPE CODE                          
                                                                                
*              DSECT TO COVER OUTPUT TYPE CODE ELEMENT (X'42')                  
*              ALSO USED FOR X'43' OUTPUT MODE TYPE ELEMENT                     
*                                                                               
CTOCOD   DSECT                                                                  
CTOCOEL  DS    CL1       X         ELEMENT CODE X'42'                           
CTOCOELQ EQU   X'42'                                                            
CTOCOLEN DS    CL1       X         ELEMENT LENGTH (16)                          
CTOCOTYP DS    CL1       C         PROFILE TYPE (SEE NOTE ABOVE)                
CTOCODTA DS    CL3       V         PROFILE DATA (SEE NOTE ABOVE)                
CTOCODE  DS    CL10      C         OUTPUT TYPE CODE                             
                                                                                
*              DSECT TO COVER PRIORITY CODE ELEMENT (X'44')                     
*                                                                               
CTPRID   DSECT                                                                  
CTPRIEL  DS    CL1       X         ELEMENT CODE X'44'                           
CTPRIELQ EQU   X'44'                                                            
CTPRILEN DS    CL1       X         ELEMENT LENGTH (9 USED TO BE 8)              
CTPRITYP DS    CL1       C         PROFILE TYPE (SEE NOTE ABOVE)                
CTPRIDTA DS    CL3       V         PROFILE DATA (SEE NOTE ABOVE)                
CTPRITY  DS    0CL2      C         OLD TWO BYTE FIELD (NOT USED)                
CTPRISC  DS    CL1       C         SORT CODE FOR WRAPPER                        
CTPRIPT  DS    CL1       C         TYPE CODE (EG FILE MARKER)                   
CTPRIPO  DS    CL1       C         OUTPUT CODE (EG CONFIDENTIAL)                
                                                                                
*              DSECT TO COVER READER CLASS ELEMENT (X'45')                      
*                                                                               
CTRCLD   DSECT                                                                  
CTRCLEL  DS    CL1       X         ELEMENT CODE X'45'                           
CTRCLELQ EQU   X'45'                                                            
CTRCLEN  DS    CL1       X         ELEMENT LENGTH (7)                           
CTRCLTYP DS    CL1       C         PROFILE TYPE (SEE NOTE ABOVE)                
CTRCLDTA DS    CL3       V         PROFILE DATA (SEE NOTE ABOVE)                
CTRCLASS DS    CL1       C         READER CLASS                                 
                                                                                
*              DSECT TO COVER SORT DATA FORMULA (X'46')                         
*                                                                               
CTSRTD   DSECT                                                                  
CTSRTEL  DS    CL1       X         ELEMENT CODE X'46'                           
CTSRTELQ EQU   X'46'                                                            
CTSRTLEN DS    CL1       X         ELEMENT LENGTH (6+2N)                        
CTSRTTYP DS    CL1       C         PROFILE TYPE (SEE NOTE ABOVE)                
CTSRTDTA DS    CL3       V         PROFILE DATA (SEE NOTE ABOVE)                
CTSRTFRM DS    0CL2      X         2 BYTE SORT FORMULA                          
*                                  BIT 0 0=ASCENDING 1=DESCENDING               
*                                  BITS 1-7  DISPLACEMENT INTO REQUEST          
*                                  BITS 8-15 LENGTH OF SORT FIELD               
                                                                                
*              DSECT TO COVER PRTQUE PASSWORD  ELEMENT (X'47')                  
*                                                                               
CTPQPD   DSECT                                                                  
CTPQPEL  DS    CL1       X         ELEMENT CODE X'47'                           
CTPQPELQ EQU   X'47'                                                            
CTPQPLEN DS    CL1       X         ELEMENT LENGTH (12)                          
CTPQPTYP DS    CL1       C         PROFILE TYPE (SEE NOTE ABOVE)                
CTPQPDTA DS    CL3       V         PROFILE DATA (SEE NOTE ABOVE)                
CTPQPWD  DS    CL6       C         PRTQUE REPORT PASSWORD                       
                                                                                
*              DSECT TO COVER PROCESSING INSTRUCTIONS (X'48')                   
*                                                                               
CTPRCD   DSECT                                                                  
CTPRCEL  DS    CL1       X         ELEMENT CODE X'48'                           
CTPRCELQ EQU   X'48'                                                            
CTPRCLEN DS    CL1       X         ELEMENT LENGTH (L'INSTRUCTION +6)            
CTPRCTYP DS    CL1       C         PROFILE TYPE (SEE NOTE ABOVE)                
CTPRDTA  DS    CL3       V         PROFILE DATA (SEE NOTE ABOVE)                
CTPRCINS DS    0C        C         INSTRUCTIONS TO OPERATOR                     
                                                                                
*              DSECT TO COVER PRTQUE RETAIN CLASS ELEMENT (X'49')               
*                                                                               
CTPQCD   DSECT                                                                  
CTPQCEL  DS    CL1       X         ELEMENT CODE X'49'                           
CTPQCELQ EQU   X'49'                                                            
CTPQCLEN DS    CL1       X         ELEMENT LENGTH (7 OR 8)                      
CTPQCTYP DS    CL1       C         PROFILE TYPE (SEE NOTE ABOVE)                
CTPQCDTA DS    CL3       V         PROFILE DATA (SEE NOTE ABOVE)                
CTPQCLAS DS    CL1       C         PRTQUE RETAIN CLASS                          
CTPQCLA2 DS    CL1       C         PRTQUE RETAIN CLASS FOR SOON REQUEST         
                                                                                
*              DSECT TO COVER PACKING INSTRUCTIONS (X'4A')                      
*                                                                               
CTPAKD   DSECT                                                                  
CTPAKEL  DS    CL1       X         ELEMENT CODE X'4A'                           
CTPAKELQ EQU   X'4A'                                                            
CTPAKLEN DS    CL1       X         ELEMENT LENGTH (L'INSTRUCTION +6)            
CTPAKTYP DS    CL1       C         PROFILE TYPE (SEE NOTE ABOVE)                
CTPAKDTA DS    CL3       V         PROFILE DATA (SEE NOTE ABOVE)                
CTPAKINS DS    0C        C         INSTRUCTIONS TO PACKING                      
                                                                                
*              DSECT TO COVER REPORT SHORT DESCRIPTION                          
*                                                                               
CTSDSD   DSECT                                                                  
CTSDSEL  DS    CL1       X         ELEMENT CODE X'4B'                           
CTSDSELQ EQU   X'4B'                                                            
CTSDSLEN DS    CL1       X         ELEMENT LENGTH (L'INSTRUCTION +6)            
CTSDSTYP DS    CL1       C         PROFILE TYPE (SEE NOTE ABOVE)                
CTSDSDTA DS    CL3       V         PROFILE DATA (SEE NOTE ABOVE)                
CTSDSTXT DS    CL11      C         DESCRIPTION TEXT                             
CTSDSLNQ EQU   *-CTSDSD                                                         
                                                                                
*              DSECT TO COVER SHIPPING INSTRUCTIONS                             
*                                                                               
CTSHPD   DSECT                                                                  
CTSHPEL  DS    CL1       X         ELEMENT CODE X'4C'                           
CTSHPELQ EQU   X'4C'                                                            
CTSHPLEN DS    CL1       X         ELEMENT LENGTH (L'INSTRUCTIONS +6)           
CTSHPTYP DS    CL1       C         PROFILE TYPE (SEE NOTE ABOVE)                
CTSHPDTA DS    CL3       V         PROFILE DATA (SEE NOTE ABOVE)                
CTSHPINS DS    0C        C         SHIPPING INSTRUCTIONS                        
                                                                                
*              DSECT TO COVER JCL EXCEPTION ELEMENT (X'4D')                     
*                                                                               
CTJCLD   DSECT                                                                  
CTJCLEL  DS    CL1       X         ELEMENT CODE X'4D'                           
CTJCLELQ EQU   X'4D'                                                            
CTJCLLEN DS    CL1       X         ELEMENT LENGTH (16)                          
CTJCLTYP DS    CL1       C         PROFILE TYPE (SEE NOTE ABOVE)                
CTJCLDTA DS    CL3       V         PROFILE DATA (SEE NOTE ABOVE)                
CTJCLEX  DS    CL10      C         JCL BOOK                                     
                                                                                
*              DSECT TO COVER TEST PHASE ELEMENT (X'4E')                        
*                                                                               
CTPHSD   DSECT                                                                  
CTPHSEL  DS    CL1       X         ELEMENT CODE X'4E'                           
CTPHSELQ EQU   X'4E'                                                            
CTPHSLEN DS    CL1       X         ELEMENT LENGTH (10)                          
CTPHSTYP DS    CL1       C         PROFILE TYPE (SEE NOTE ABOVE)                
CTPHSDTA DS    CL3       V         PROFILE DATA (SEE NOTE ABOVE)                
CTPHS01  DS    CL1       C         01 PHASE (DEFAULT=SPACE)                     
CTPHS02  DS    CL1       C         02 PHASE (DEFAULT=SPACE)                     
CTPHS03  DS    CL1       C         03 PHASE (DEFAULT=SPACE)                     
CTPHS04  DS    CL1       C         04 PHASE (DEFAULT=SPACE)                     
                                                                                
*              DSECT TO COVER REPORT FORM CODE                                  
*                                                                               
CTFRMD   DSECT                                                                  
CTFRMEL  DS    CL1       X         ELEMENT CODE X'4F'                           
CTFRMELQ EQU   X'4F'                                                            
CTFRMLEN DS    CL1       X         ELEMENT LENGTH (L'INSTRUCTION +6)            
CTFRMTYP DS    CL1       C         PROFILE TYPE (SEE NOTE ABOVE)                
CTFRMDTA DS    CL3       V         PROFILE DATA (SEE NOTE ABOVE)                
CTFRMCOD DS    CL2       C         FORM CODE                                    
CTFRMLNQ EQU   *-CTFRMD                                                         
                                                                                
*              DSECT TO COVER SQL TRANFORMATION FORMULA                         
*                                                                               
CTSQLD   DSECT                                                                  
CTSQLEL  DS    CL1       X         ELEMENT CODE X'50'                           
CTSQLELQ EQU   X'50'                                                            
CTSQLLEN DS    CL1       X         ELEMENT LENGTH                               
CTSQLTYP DS    CL1       C         PROFILE TYPE (SEE NOTE ABOVE)                
CTSQLDTA DS    CL3       V         PROFILE DATA (SEE NOTE ABOVE)                
CTSQLFLG DS    XL1       X         SQL REFORM FLAG                              
CTSQLCOD DS    CL5       C         SQL REFORM CODE                              
CTSQLLNQ EQU   *-CTSQLD                                                         
                                                                                
*              DSECT TO COVER ARCHIVE REPORT TYPE                               
*                                                                               
CTARTD   DSECT                                                                  
CTARTEL  DS    CL1       X         ELEMENT CODE X'51'                           
CTARTELQ EQU   X'51'                                                            
CTARTLEN DS    CL1       X         ELEMENT LENGTH                               
CTARTTYP DS    CL1       C         PROFILE TYPE (SEE NOTE ABOVE)                
CTARTDTA DS    CL3       V         PROFILE DATA (SEE NOTE ABOVE)                
CTARTCOD DS    CL1       C         ARCHIVE REPORT TYPE (E.G.INVOICE)            
CTARTLNQ EQU   *-CTARTD                                                         
                                                                                
*              DSECT TO COVER ARCHIVE CLASS                                     
*                                                                               
CTARCD   DSECT                                                                  
CTARCEL  DS    CL1       X         ELEMENT CODE X'52'                           
CTARCELQ EQU   X'52'                                                            
CTARCLEN DS    CL1       X         ELEMENT LENGTH                               
CTARCTYP DS    CL1       C         PROFILE TYPE (SEE NOTE ABOVE)                
CTARCDTA DS    CL3       V         PROFILE DATA (SEE NOTE ABOVE)                
CTARCCOD DS    CL1       C         ARCHIVE REPORT CLASS                         
CTARCLNQ EQU   *-CTARCD                                                         
                                                                                
*              DSECT TO COVER ARCHIVE STATUS                                    
*                                                                               
CTARSD   DSECT                                                                  
CTARSEL  DS    CL1       X         ELEMENT CODE X'53'                           
CTARSELQ EQU   X'53'                                                            
CTARSLEN DS    CL1       X         ELEMENT LENGTH                               
CTARSTYP DS    CL1       C         PROFILE TYPE (SEE NOTE ABOVE)                
CTARSDTA DS    CL3       V         PROFILE DATA (SEE NOTE ABOVE)                
CTARSTAO DS    CL1       C         ARCHIVE STATUS OVERNIGHT                     
CTARSTAS DS    CL1       C         ARCHIVE STATUS SOON                          
CTARSTAQ EQU   C'A'                . ARCHIVE                                    
CTARSTEQ EQU   C'E'                . ELIGIBLE FOR ARCHIVE                       
         DS    CL2       C         SPARE                                        
CTARSLNQ EQU   *-CTARSD                                                         
                                                                                
*              DSECT TO COVER ARCHIVE DOCUMENT TYPE                             
*                                                                               
CTADTD   DSECT                                                                  
CTADTEL  DS    CL1       X         ELEMENT CODE X'54'                           
CTADTELQ EQU   X'54'                                                            
CTADTLEN DS    CL1       X         ELEMENT LENGTH                               
CTADTTYP DS    CL1       C         PROFILE TYPE (SEE NOTE ABOVE)                
CTADTDTA DS    CL3       V         PROFILE DATA (SEE NOTE ABOVE)                
CTADTCOD DS    XL4       X         ARCHIVE DOCUMENT TYPE (BINARY)               
CTADTLNQ EQU   *-CTADTD                                                         
                                                                                
*              DSECT TO COVER PRINT AT DDS ELEMENT (X'55')                      
*                                                                               
CTPADD   DSECT                                                                  
CTPADEL  DS    CL1       X         ELEMENT CODE X'55'                           
CTPADELQ EQU   X'55'                                                            
CTPADLEN DS    CL1       X         ELEMENT LENGTH (08 OR 14)                    
CTPADTYP DS    CL1       C         PROFILE TYPE (SEE NOTE ABOVE)                
CTPADDTA DS    CL3       V         PROFILE DATA (SEE NOTE ABOVE)                
CTPADFLG DS    CL1       C         PRINT AT DDS FLAG                            
CTPADPQB DS    CL1       C         PRINT QUEUE BURST FLAG                       
CTPADOUT DS    CL6       C         OPTIONAL NEW OUTPUT TYPE                     
CTPADLNQ EQU   *-CTPADD                                                         
                                                                                
*              DSECT TO COVER TIMING ELEMENT                                    
*                                                                               
CTTIMED  DSECT                                                                  
CTTIMELQ EQU   X'56'                                                            
CTTIMEL  DS    CL1       X         ELEMENT CODE X'56'                           
CTTIMLEN DS    CL1       X         ELEMENT LENGTH (6)                           
CTTIME   DS    CL4       F         AVERAGE TIME/REQUEST (2 DEC PLACES)          
                                                                                
*              DSECT TO COVER PRINT DATE AT DDS ELEMENT (X'57')                 
*                                                                               
CTPDDD   DSECT                                                                  
CTPDDEL  DS    XL1       X         ELEMENT CODE X'57'                           
CTPDDELQ EQU   X'57'                                                            
CTPDDLEN DS    XL1       X         ELEMENT LENGTH (09)                          
CTPDDTYP DS    CL1       C         PROFILE TYPE (SEE NOTE ABOVE)                
CTPDDDTA DS    CL3       V         PROFILE DATA (SEE NOTE ABOVE)                
CTPDDATE DS    XL3       C         DATE THAT PRINT@DDS EL IS EFFECTIVE          
CTPDDLNQ EQU   *-CTPDDD                                                         
                                                                                
*              DSECT TO COVER ARCHIVE DOCUMENT TYPE ELEMENT (X'40')             
*                                                                               
CTDTYD   DSECT                                                                  
CTDTYEL  DS    XL1       X         ELEMENT CODE X'40'                           
CTDTYELQ EQU   X'40'                                                            
CTDTYLEN DS    XL1       X         ELEMENT LENGTH (05/17)                       
CTDTYSYS DS    CL1       C         SYSTEM                                       
CTDTYPRG DS    CL2       C         PROGRAM                                      
CTDTYIDN DS    XL2       X         USER ID NUMBER                               
CTDTYIDA DS    CL10      C         USER ID ALPHA                                
CTDTYLNQ EQU   *-CTDTYD                                                         
                                                                                
*              DSECT TO COVER PROFILE FIELD DEFINITION ELEMENT (X'70')          
*                                                                               
CTFDD    DSECT                                                                  
CTFDEL   DS    CL1       B         ELEMENT CODE (X'70')                         
CTFDELQ  EQU   X'70'                                                            
CTFDLEN  DS    CL1       B         ELEMENT LENGTH (L'DESC + 26)                 
CTFDNUM  DS    CL1       B         FIELD NUMBER                                 
CTFDTYPE DS    CL1       C         FIELD TYPE C=CHARACTERS (EBCDIC)             
*                                             N=NUMBERIC (BINARY)               
*                                             X=HEXADECIMAL                     
*                                             (TYPE O IS STORED AS C)           
CTFDOTHR DS    CL1       X         X'80'=DDS PROFILE OPTION                     
*                                  X'40'=DEFAULT VALUE NOT INPUT                
*                                  X'20'=VALUE IS A MEDIA OFFICE                
CTFDDEF  DS    CL1       V         DEFAULT VALUE                                
CTFDLIST DS    CL20      C         LIST OF ACCEPTABLE VALUES                    
CTFDDESC DS    0C        C         FIELD DESCRIPTION (MAX 30)                   
                                                                                
*              DSECT TO COVER PROFILE RECORD POST EDIT ELEMENT                  
*                                                                               
CTPEDD   DSECT                                                                  
CTPEDEL  DS    CL1       X         ELEMENT CODE X'71'                           
CTPEDELQ EQU   X'71'                                                            
CTPEDLEN DS    CL1       X         ELEMENT LENGTH (4)                           
CTPEDVRN DS    XL2       C         VALIDATION ROUTINE NUMBER                    
CTPEDLNQ EQU   *-CTPEDD                                                         
                                                                                
*              DSECT TO COVER PROFILE VALUE ELEMENT (X'72')                     
*                                                                               
CTPVD    DSECT                                                                  
CTPVEL   DS    CL1       X         ELEMENT CODE (X'72')                         
CTPVELQ  EQU   X'72'                                                            
CTPVLEN  DS    CL1       X         ELEMENT LENGTH (20)                          
CTPVPAGE DS    CL1       X         PAGE NUMBER                                  
CTPVSTAT DS    CL2       X         16 STATUS BITS (1=DONT OVERRIDE)             
CTPVALUE DS    CL16      V         PROFILE VALUES                               
                                                                                
*              DSECT TO COVER PROFILE KEY FIELD VALUE ELEMENT (X'73')           
*                                                                               
CTPKD    DSECT                                                                  
CTPKEL   DS    CL1       X         ELEMENT CODE (X'73')                         
CTPKELQ  EQU   X'73'                                                            
CTPKLEN  DS    CL1       X         ELEMENT LENGTH (L'CTPKVAL + 3)               
CTPKFLD  DS    XL1       X         KEY FIELD CODE                               
CTPKFBCQ EQU   1                   BOOKING CATEGORY                             
CTPKVAL  DS    0C        V         KEY FIELD VALUE AS ENTERED/DISPLAYED         
                                                                                
*              DSECT TO COVER DEMO EXTRACT ELEMENT (X'74')                      
*                                                                               
CTDXD    DSECT                                                                  
CTDXEL   DS    CL1       X         ELEMENT CODE (X'74')                         
CTDXELQ  EQU   X'74'                                                            
CTDXLEN  DS    CL1       X         ELEMENT LENGTH (L'LIST+2)                    
CTDXLIST DS    CL1       X         LIST OF DEMO NUMBERS TO BE EXTRACTED         
*                                  (X'F1'=FIRST  DEMO IN ESTIMATE)              
*                                  (X'F2'=SECOND DEMO IN ESTIMATE)              
                                                                                
*              DSECT TO COVER MEDIA OFFICE LIST ELEMENT (X'75')                 
*                                                                               
CTOFD    DSECT                                                                  
CTOFEL   DS    CL1       X         ELEMENT CODE (X'75')                         
CTOFELQ  EQU   X'75'                                                            
CTOFLEN  DS    CL1       X         ELEMENT LENGTH (20)                          
CTOFSTAT DS    CL3       X         STATUS BYTES                                 
CTOFOFFS DS    0CL180    V         OFFICE VALUES                                
                                                                                
*              DSECT TO COVER PROGRAM TYPE EQUIVALENT ELEMENT (X'76')           
*                                                                               
CTPQD    DSECT                                                                  
CTPQEL   DS    CL1       X         ELEMENT CODE (X'76')                         
CTPQELQ  EQU   X'76'                                                            
CTPQLEN  DS    CL1       X         ELEMENT LENGTH (6)                           
CTPQDP   DS    CL3       C         DAY PART CODE  OR  FIRST BYTE X'00'          
*                                  AND BYTES 2-3 = PRESENT PROGTYPE             
CTPQCODE DS    CL1       X         PROGTYPE FOR CPP SYSTEM                      
                                                                                
*              DSECT TO COVER CPP PROJECTION FACTOR ELEMENT (X'78')             
*                                                                               
CTPFD    DSECT                                                                  
CTPFEL   DS    CL1       X         ELEMENT CODE (X'78')                         
CTPFELQ  EQU   X'78'                                                            
CTPFLEN  DS    CL1       X         ELEMENT LENGTH (4)                           
CTPFACT  DS    CL2       X         PROJECTION FACTOR                            
                                                                                
*              DSECT TO COVER HUT ELEMENT (X'90')                               
*                                                                               
CTHUTD   DSECT                                                                  
CTHUTEL  DS    CL1       B         ELEMENT CODE (X'90')                         
CTHUTELQ EQU   X'90'                                                            
CTHUTLEN DS    CL1       B         ELEMENT LENGTH (100)                         
CTHUTLST DS    CL96      X         LIST OF 48 WEEKLY HUTS                       
*                                  EACH IS A HALF-WORD (1 DEC. PLACE)           
         DS    CL2                 SPARE                                        
                                                                                
*              DSECT TO COVER AUTHORIZATION ELEMENT                             
*                                                                               
CTAUTHD  DSECT                                                                  
CTAUTEL  DS    CL1       B         ELEMENT CODE X'92'                           
CTAUTELQ EQU   X'92'                                                            
CTAUTLEN DS    CL1       B         ELEMENT LENGTH (16)                          
CTAUTAST DS    CL2       B         ARB START BOOK (Y/M BINARY)                  
CTAUTAND DS    CL2       B         ARB END BOOK                                 
CTAUTNST DS    CL2       B         NSI START BOOK                               
CTAUTNND DS    CL2       B         NSI END BOOK                                 
         DS    CL6                 SPARE                                        
                                                                                
*              DSECT TO COVER VALUE NAME ELEMENTS                               
*                                                                               
CTVNMD   DSECT                                                                  
CTVNMEL  DS    CL1       X         ELEMENT CODE X'A0'                           
CTVNMELQ EQU   X'A0'                                                            
CTVNMLEN DS    CL1       X         ELEMENT LENGTH (L'NAME + 2)                  
CTVNMNAM DS    0CL15     C         OPTION/FILTER NAME                           
                                                                                
*              DSECT TO COVER BYTE VALUE ELEMENTS                               
*                                                                               
CTVVLD   DSECT                                                                  
CTVVLEL  DS    CL1       X         ELEMENT CODE X'A1'                           
CTVVLELQ EQU   X'A1'                                                            
CTVVLLEN DS    CL1       X         ELEMENT LENGTH (L'NAME + 4)                  
CTVVLCHR DS    CL1       V         BYTE VALUE                                   
CTVVLTYP DS    CL1       C         CHARACTER TYPE                               
*                                  A=ALPHA,N=NUMERIC,H=HEX                      
CTVVLNAM DS    0CL30     C         VALUE NAME                                   
                                                                                
*              DSECT TO COVER LIST ELEMENTS                                     
*                                                                               
CTLSTD   DSECT                                                                  
CTLSTEL  DS    CL1       X         ELEMENT CODE X'A4'                           
CTLSTELQ EQU   X'A4'                                                            
CTLSTLEN DS    CL1       X         ELEMENT LENGTH (L'CTLSTDTA + 3)              
CTLSTIND DS    CL1       X         LIST ENTRY INDICATOR X'80' = NO-OP           
CTLSTDTA DS    0C        V         LIST ENTRY                                   
                                                                                
*              DSECT TO COVER LIST INCLUDE ELEMENT                              
*                                                                               
CTLIND   DSECT                                                                  
CTLINEL  DS    CL1       X         ELEMENT CODE X'A5'                           
CTLINELQ EQU   X'A5'                                                            
CTLINLEN DS    CL1       X         ELEMENT LENGTH (8)                           
CTLINC   DS    CL6       C         ID OF INCLUDED LIST                          
CTLINLNQ EQU   *-CTLIND                                                         
                                                                                
*              DSECT TO COVER FIELD MAP ELEMENTS                                
*                                                                               
CTMAPD   DSECT                                                                  
CTMAPEL  DS    CL1       X         ELEMENT CODE X'B1'                           
CTMAPELQ EQU   X'B1'                                                            
CTMAPLEN DS    CL1       X         ELEMENT LENGTH (L'CTMAPLIT+5)                
CTMAPFLD DS    CL1       X         RELATIVE TWA FIELD NUMBER                    
CTMAPSUB DS    CL1       X         SUB FIELD NUMBER                             
CTMAPNUM DS    CL1       X         DATA FIELD NUMBER OR ZERO IF LITERAL         
CTMAPLIT DS    0C        C         LITERAL FIELD VALUE                          
                                                                                
*              DSECT TO COVER INTERFACE ELEMENT                                 
*                                                                               
CTIFTD   DSECT                                                                  
CTIFTEL  DS    CL1       X         ELEMENT CODE X'B2'                           
CTIFTELQ EQU   X'B2'                                                            
CTIFTLEN DS    CL1       X         ELEMENT LENGTH (126)                         
CTIFTUSR DS    CL10      C         USER ID FOR PRINTING                         
CTIFTLTP DS    CL1       C         LABEL TYPE-                                  
*                                            1=STANDARD                         
*                                            2=NON-STD WITH TAPE MARK           
*                                            3=NON-STD W/O TAPE MARK            
*                                            4=NO LABELS WITH TAPE MARK         
*                                            5=NO LABELS W/O TAPE MARK          
CTIFTLD1 DS    CL40      C         LABEL DATA 1-40                              
CTIFTLD2 DS    CL40      C         LABEL DATA 41-80                             
CTIFTNTM DS    CL1                 NO EOF TMS (TYPE 2,3,4,5 ONLY)               
CTIFTRPB DS    CL1       B         NO OF RECORDS PER BLOCK                      
CTIFTATT DS    CL20      C         'ATTN' PERSON'S NAME                         
CTIFTSBP DS    CL1       C         SHORT BLOCK PAD CHAR.                        
*                                  X'00' = NO SHORT BLOCK PADDING.              
         DS    CL10      C         SPARE                                        
                                                                                
*              DSECT TO RATE ELEMENT                                            
*                                                                               
CTRATED  DSECT                                                                  
CTRAEL   DS    CL1       X         ELEMENT CODE X'B3'                           
CTRAELQ  EQU   X'B3'                                                            
CTRALEN  DS    CL1       X         ELEMENT LENGTH X'0B'                         
CTRADATE DS    CL3       P         EFFECTIVE DATE                               
         DS    CL2       C         SPARE                                        
CTRARATE DS    CL4       X         RATE (4 DEC. PLACES)                         
CTRALNQ  EQU   *-CTRATED                                                        
                                                                                
*              DSECT TO AGENCY GROUP DETAILS ELEMENT                            
*                                                                               
CTAGDD   DSECT                                                                  
CTAGDEL  DS    CL1       X         ELEMENT CODE                                 
CTAGDELQ EQU   X'B4'                                                            
CTAGDLEN DS    CL1       X         ELEMENT LENGTH                               
CTAGDHG  DS    CL2       X         HOLDING COMPANY MASTER ID                    
CTAGDAG  DS    CL2       X         AGENCY GROUP MASTER ID                       
CTAGDTY  DS    CL1       C         DDS CLIENT TYPE                              
CTAGDDA  DS    CL1       C         DDS ACCESS LEVEL CODE (0=NORMAL)             
CTAGDDAY EQU   X'80'               BYPASS PASSWORD SECURITY CHECKS              
CTAGDDAN EQU   X'40'               NO DDS TERMINAL ACCESS                       
CTAGDDAP EQU   X'20'               NO DDS PASSWORD OVERIDE                      
CTAGOPTS DS    XL1       X         AGENCY OPTIONS                               
CTAGSAP  EQU   X'80'               SAP  AGENCY                                  
CTAGTST  EQU   X'40'               TEST AGENCY                                  
CTAGUAT  EQU   X'20'               UAT  AGENCY                                  
CTAGTNG  EQU   X'10'               TRAINING AGENCY                              
         DS    XL1       C         SPARE                                        
CTAGDLNQ EQU   *-CTAGDD                                                         
CTAGDCTY DS    XL1       X         AGENCY COUNTRY CODE                          
CTAGDCUR DS    CL3       C         AGENCY CURRENCY                              
CTAGDL2Q EQU   *-CTAGDD                                                         
                                                                                
*              DSECT TO DATE SCHEME DESCRIPTION ELEMENT                         
*                                                                               
CTDSDD   DSECT                                                                  
CTDSDEL  DS    CL1       B         ELEMENT CODE                                 
CTDSDELQ EQU   X'B5'                                                            
CTDSDLEN DS    CL1       B         ELEMENT LENGTH                               
CTDSDNUM DS    XL1       X         DATE SEQUENCE NUMBER                         
CTDSDSCR DS    CL15      C         SCREEN DESCRIPTION                           
CTDSDCOL DS    CL8       C         COLUMN DESCRIPTION                           
CTDSDOPT DS    XL1       X         OPTIONS                                      
CTDSDOPR EQU   X'80'               PRINT ON CLIENT REPORT                       
         DS    XL3       V         N/D                                          
CTDSDLNQ EQU   *-CTDSDD                                                         
                                                                                
*              DSECT TO ASSOCIATED AGENCY LIST ELEMENT                          
*                                                                               
CTAGLD   DSECT                                                                  
CTAGLEL  DS    CL1       X         ELEMENT CODE                                 
CTAGLELQ EQU   X'B6'                                                            
CTAGLLEN DS    CL1       X         ELEMENT LENGTH (VARIABLE)                    
CTAGLAID DS    CL2       C         AGENCY TWO CHR CODE                          
CTAGLMAX EQU   20                  MAXIMUM NUMBER OF AGENCIES IN LIST           
                                                                                
*              DSECT TO COVER LOCKET ENTRY ELEMENT                              
*                                                                               
CTLKLD   DSECT                     LOCKET ENTRY ELEMENT                         
CTLKLEL  DS    CL1       X         ELEMENT CODE                                 
CTLKLELQ EQU   X'B7'                                                            
CTLKLLEN DS    CL1       X         ELEMENT LENGTH FIXED                         
CTLKLT1  DS    CL3       X         PL3 (REQUEST TIME) HH:MM:SS                  
CTLKLT2  DS    CL3       X         PL3 (COMPLETION TIME)                        
CTLKLUID DS    CL8       C         LUID OF REQUESTOR                            
CTLKLLNQ EQU   *-CTLKLD                                                         
                                                                                
*              DSECT TO COVER SECURITY AGENCY APLHA ID ELEMENT                  
*                                                                               
CTSEAD   DSECT                     SECURITY AGENCY APLHA ID                     
CTSEAEL  DS    CL1       X         ELEMENT CODE                                 
CTSEAELQ EQU   X'B8'                                                            
CTSEALEN DS    CL1       X         ELEMENT LENGTH FIXED                         
CTSEAAID DS    CL2       C         AGENCY ALPHA ID                              
CTSEALNQ EQU   *-CTSEAD                                                         
                                                                                
*              DSECT TO COVER AGENCY ACCESS DETAILS ELEMENT                     
*                                                                               
CTAADD   DSECT ,                   AGENCY ACCESS DETAILS                        
CTAADEL  DS    CL1       X         ELEMENT CODE                                 
CTAADELQ EQU   X'B9'                                                            
CTAADLEN DS    CL1       X         ELEMENT LENGTH                               
*TAADATO DS    XL2       X         ADV TIMEOUT IN MINUTES                       
CTAAPWRN DS    XL1       X         PASSWORD EXPIRY WARNING DAYS                 
         DS    XL1       X                                                      
CTAADPTO DS    XL1       X         CONNECT PASSWORD TIMEOUT IN DAYS             
CTAADPML DS    XL1       C         MINIMUM LENGTH OF PASSWORD                   
CTAADPRU DS    XL1       C         PASSWORD REUSE NUMBER                        
CTAADFLG DS    CL1       C         ACCESS CONTROLS FLAG                         
CTAADPRQ EQU   X'80'               PERSON ID REQUIRED WITH PASSWORD             
CTAADCON EQU   X'40'               CHECK CONNECT ONCE ONLY SAME PWD.            
CTAAD2OF EQU   X'20'               AGENCY USING 2 CHAR MEDIA OFFICES            
CTAADDAB EQU   X'10'               AGENCY LOCKED FOR DATA BUILD (R/O)           
CTAADDCL EQU   X'08'               AGENCY USING CLIENT LEVEL LIMIT ACC          
CTAADDCC EQU   X'04'               ALLOW MAINT OF CLIENT LIMIT ACC              
**AADTRA EQU   X'02'               AGY IS A TRAINING AGENCY>>CTAGYOPTS          
**AADDTA EQU   X'01'               AGY IS A DDS TEST AGENCY>>CTAGYOPTS          
CTAADPTW DS    XL1       X         PASSWORD TIMEOUT WARNING IN DAYS             
CTAACSTN DS    XL1       X         CLIENT SERVICE TEAM # - DDTEAMLST            
CTAADPVR DS    XL1       X         PASSWORD VALIDATION RULE NUMBER              
CTAADPME DS    XL1       X         PASSWORD MAXIMUM ERRORS                      
CTAAEXPD DS    XL1       X         INACTIVE PASSWORD EXPIRY IN DAYS             
CTAAEXPG DS    CL8       C         INACTIVE PASSWORD EXPIRY GROUP               
CTAADLNQ EQU   *-CTAADD                                                         
                                                                                
*              DSECT TO COVER CFM AGENCY LIST ELEMENT                           
*                                                                               
CTCAGD   DSECT                     CFM AGENCY LIST DETAILS                      
CTCAGEL  DS    CL1       X         ELEMENT CODE                                 
CTCAGELQ EQU   X'C5'                                                            
CTCAGLEN DS    CL1       X         ELEMENT LENGTH                               
CTCAGAGY DS    0CL2      X         CFM AGENCY                                   
CTCAGLNQ EQU   *-CTCAGD                                                         
                                                                                
*              DSECT TO COVER SCRIPT TEXT ELEMENT                               
*                                                                               
CTSCRD   DSECT                     SCRIPT TEXT ELEMENT                          
CTSCREL  DS    CL1       X         ELEMENT CODE                                 
CTSCRELQ EQU   X'E1'                                                            
CTSCRLEN DS    CL1       X         ELEMENT LENGTH MAX 255                       
CTSCRSEQ DS    CL1       X         SEQUENCE NO.                                 
CTSCRDTA DS    0C        S         DATA - SCRIPT TEXT                           
CTSCRLNQ EQU   *-CTSCRD                                                         
                                                                                
*              DSECT TO COVER APPLICATION ACCESS                                
*                                                                               
CTAPPD   DSECT                     APPLICATION ACCESS                           
CTAPPEL  DS    CL1       X         ELEMENT CODE                                 
CTAPPELQ EQU   X'E2'                                                            
CTAPPLEN DS    CL1       X         ELEMENT LENGTH                               
CTAPPFLG DS    XL1       X         FLAG                                         
CTAPPUPQ EQU   X'80'               UPDATIVE ACCESS                              
CTAPPRDQ EQU   X'40'               READ ONLY ACCESS                             
CTAPPNUM DS    XL1       X         APPLICATION NUMBER                           
         DS    CL5                 SPARE                                        
CTAPLLNQ EQU   *-CTAPPD                                                         
                                                                                
*              DSECT TO COVER DDS DEPT LEVEL SECURITY ELEMENT                   
*                                                                               
CTDDSSD  DSECT                     DDS DEPT LEVEL SECURITY ELEMENT              
CTDDSDL  DS    CL1       X         ELEMENT CODE                                 
CTDDSDLQ EQU   X'E3'                                                            
CTDDSLEN DS    CL1       X         ELEMENT LENGTH 11                            
CTDDSDLV DS    XL1       X         DEPT LEVEL                                   
CTDDSBIT DS    XL8       X         64 SECURITY BITS                             
CTDDSLNQ EQU   *-CTDDSSD                                                        
                                                                                
*              DSECT TO COVER SCRIPT BOOK NAME ELEMENT                          
*                                                                               
CTPAND   DSECT                     SCRIPT BOOK NAME ELEMENT                     
CTPANDL  DS    CL1       X         ELEMENT CODE                                 
CTPANDLQ EQU   X'E4'                                                            
CTPANLEN DS    XL1       X         ELEMENT LENGTH 11                            
         DS    XL5                 BOOK=                                        
CTPANBK  DS    XL10      C         BOOK NAME                                    
         DS    XL5                 LVL=                                         
CTPANLV  DS    XL3       C         LEVEL                                        
         DS    XL1                                                              
CTPANDAT DS    XL8       C         DATE                                         
CTPANLNQ EQU   *-CTPAND                                                         
                                                                                
*CTGENBCREC                                                                     
       ++INCLUDE CTGENBCREC                                                     
                                                                                
*CTGENSTTWX                                                                     
       ++INCLUDE CTGENSTTWX                                                     
                                                                                
*CTGENPGREC                                                                     
       ++INCLUDE CTGENPGREC                                                     
                                                                                
*CTGENFAX                                                                       
       ++INCLUDE CTGENFAX                                                       
                                                                                
*CTGENPHASE                         KEYS ARE X'0501'                            
       ++INCLUDE CTGENPHASE                                                     
                                                                                
*CTGENDTYPE                                                                     
       ++INCLUDE CTGENDTYPE                                                     
                                                                                
*CTGENADDIR    ADDS DIRECTORY RECS  KEYS ARE X'0504'                            
                                                                                
*CTGENADSTA    ADDS STATION RECS    KEYS ARE X'0506'                            
                                                                                
*CTGENEASYL    EASYLINK             KEYS ARE X'0507'                            
                                                                                
*CTGENDARE     DARE EDICT INFO      KEYS ARE X'0508'                            
                                                                                
*CTGENBTY      BATCH TYPE RECORDS   KEYS ARE X'06'                              
       ++INCLUDE CTGENBTY                                                       
*&&US                                                                           
*CTGENZEN      CLI/REP ZENITH REC   KEYS ARE X'0509'/X'050A' CLI/REP            
       ++INCLUDE CTGENZEN                                                       
                                                                                
*CTGENOFC      OFFICE REC           KEYS ARE X'050B'                            
       ++INCLUDE CTGENOFC                                                       
*&&                                                                             
*              DSECT TO EXCHANGE RATE RECORDS                                   
*                                                                               
CTRTREC  DSECT                     EXCHANGE RATE RECORD                         
CTRTKEY  DS    0CL25     V         KEY                                          
CTRTKTYP DS    CL1       C         RECORD TYPE C'7'                             
CTRTEQU  EQU   C'7'                                                             
         DS    CL16      X         SPARE (BINARY ZEROS)                         
CTRTCTRY DS    XL1       X         COUNTRY CODE X                               
         DS    CL6       X         SPARE (BINARY ZEROS)                         
CTRTSEQ  DS    XL1       X         SEQUENCE NUMBER                              
CTRTLEN  DS    XL2       X         RECORD LENGTH                                
CTRTSTAT DS    XL1       X         STATUS                                       
CTRTDATA DS    0X        V         DATA (X'10' COUNTRY NAME)                    
*                                       (X'B3' RATE ELEMENTS)                   
                                                                                
*              DSECT FOR DUMP EMAIL RECORDS                                     
*                                                                               
CTDEREC  DSECT                     DUMP EMAIL RECORD                            
CTDEKEY  DS    0CL25     V         KEY                                          
CTDEKTYP DS    CL1       C         RECORD TYPE X'09'                            
CTDEKTYQ EQU   X'09'                                                            
CTDEKSUB DS    XL1                 SUB-TYPE TO IDENTIFY ON/OFFLINE              
CTDEKSON EQU   X'00'                                                            
CTDEKSOF EQU   X'01'                                                            
CTDEKVAR DS    0X                                                               
*                             ***  ONLINE                                       
         DS    CL21      X         SPARE (BINARY ZEROS)                         
CTDESYS  DS    XL1       X         SYSTEM                                       
CTDEPRG  DS    XL1       X         PROGRAM                                      
*                             ***  OFFLINE                                      
         ORG   CTDEKVAR                                                         
         DS    CL20      X         SPARE (BINARY ZEROS)                         
CTDEOSYS DS    CL1       X         SYSTEM (=SYSLRPLT)                           
CTDERPT  DS    CL2       X         REPORT ID (Z5, D5 ETC)                       
         ORG                                                                    
*                             ***  THE REST OF THE RECORD                       
CTDELEN  DS    XL2       X         RECORD LENGTH                                
CTDESTAT DS    XL1       X         STATUS                                       
CTDEDATA DS    0X        V         DATA (X'10' COUNTRY NAME)                    
CTDEELM  DS    X                   ELEMENT                                      
CTDEELMQ EQU   X'09'                                                            
CTDELN   DS    X                   LENGTH                                       
CTDELNQ  EQU   L'CTDEEML+2                                                      
CTDEEML  DS    XL50                EMAIL ID                                     
CTDERECL EQU   *-CTDEREC                                                        
*                                       (X'B3' RATE ELEMENTS)                   
                                                                                
*CTGENRAD - RADIO UPLOAD RECORD - TYPE X'99' RESERVED                           
                                                                                
*CTGENPROV - PROGRAM VERSION CONTROL (PROVER) RECORDS                           
*            CONTAINS RECORD TYPE X'07' AND ELEMENT TYPE X'BA'                  
       ++INCLUDE CTGENPROV                                                      
                                                                                
*CTGENTOU - TIME OUT ELEMENT - CONTAINS ELEMENT TYPE X'BB'                      
       ++INCLUDE CTGENTOU                                                       
                                                                                
*CTGENSPU - SECURITY PRINCIPLE USER ID  - CONTAINS ELEMENT TYPE X'BE'           
       ++INCLUDE CTGENSPU                                                       
                                                                                
*CTGENLNI - UK LOTUS NOTES ADMIN USER ID ELEMENT - TYPE X'BF'                   
       ++INCLUDE CTGENLNI                                                       
                                                                                
*CTGENPNM - PRINTER NAME (PNAME) RECORDS.                                       
*            CONTAINS RECORD TYPE X'08' AND ELEMENT TYPE X'C0'                  
       ++INCLUDE CTGENPNM                                                       
                                                                                
*CTGENAFP - AFP USER ID ELEMENT - TYPE X'C4'                                    
       ++INCLUDE CTGENAFP                                                       
                                                                                
*              DSECT TO COVER THE DEMO UPDATE RECORDS                           
*                                                                               
CTDURECD DSECT                     DEMO UPDATE RECORD DSECT                     
CTDUKEY  DS    0XL25      V        PRIMARY KEY                                  
CTDURTYP DS    X          X        RECORD TYPE                                  
CTDURTYQ EQU   C'D'                                                             
CTDUSRTP DS    X          X        SUB-RECORD TYPE                              
CTDUSRTQ EQU   C'U'                                                             
         DS    XL10       X        SPARE (BINARY ZEROS)                         
CTDULDAT DS    XP(DT02)L2 X        DATE OF UPDATE (COMPRESSED)                  
CTDUBFLG DS    X          X        BOOK FLAG                                    
CTDUBFMQ EQU   1                   -MONTHLY BOOK                                
CTDUBFWQ EQU   2                   -WEEKLY BOOK                                 
CTDUSDAT DS    XP(DT02)L2 X        START DATE OF BOOK (COMPRESSED)              
CTDUEDAT DS    XP(DT02)L2 X        END DATE OF BOOK (COMPRESSED)                
CTDUPTYP DS    X          C        POSTING TYPE                                 
CTDUPNET EQU   C'N'                -NETWORK (BROADCAST)                         
CTDUPSYN EQU   C'S'                -SYNDICATION                                 
CTDUPCBL EQU   C'C'                -CABLE                                       
CTDUPHSP EQU   C'H'                -HISPANIC                                    
CTDDTYPE DS    C          X        DATA TYPE                                    
CTDDPROG EQU   C'P'                -PROGRAM                                     
CTDDCOMM EQU   C'C'                -COMMERCIAL                                  
CTDDMXM  EQU   C'M'                -MINUTE BY MINUTE                            
CTDVTYPE DS    X          X        VIEWING TYPE                                 
*                                  -FOR EQUATES, SEE DBXLIVD IN                 
*                                   DEDBEXTRAD                                  
         DS    XL3        X        SPARE                                        
CTDULEN  DS    XL2        X        RECORD LENGTH                                
CTDUSTAT DS    XL1        X        STATUS                                       
CTDUDATA DS    0C         V        DATA                                         
*                                                                               
CTDU30D  DSECT                     DSECT TO COVER '30' ELEMENT                  
CTDU30CD DS    X                   ELEMENT CODE                                 
CTDU30Q  EQU   X'30'                                                            
CTDU30LN DS    X                   ELEMENT LENGTH                               
CTDU30BK DS    XL2                 DEMO BOOK (YYWW OR YYMM)                     
CTDU30LQ EQU   *-CTDU30CD                                                       
