*          DATA SET CTGENDAD   AT LEVEL 001 AS OF 08/28/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BDAD      DATE 08/28/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
LSTIDH   DS    XL8                                                              
LSTID    DS    CL8      5   10    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P N             T        Y              
LSTSYSH  DS    XL8                                                              
LSTSYS   DS    CL7      5   27    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      5   37    7  A  P N             T        Y              
LSTPGMH  DS    XL8                                                              
LSTPGM   DS    CL7      5   45    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
LSTAGYAH DS    XL8                                                              
LSTAGYA  DS    CL2      6   10    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      6   20    6  A  P N             T        Y              
LSTPWDH  DS    XL8                                                              
LSTPWD   DS    CL1      6   27    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      6   37    7  A  P N             T        Y              
LSTCIDH  DS    XL8                                                              
LSTCID   DS    CL8      6   45    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL9      6   54    9  A  P N             T        Y              
LSTLUDH  DS    XL8                                                              
LSTLUD   DS    CL12     6   64   12  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
LSTSYNH  DS    XL8                                                              
LSTSYN   DS    CL1      7   10    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      7   20    6  A  P N             T        Y              
LSTIDTH  DS    XL8                                                              
LSTIDT   DS    CL9      7   27    9  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL5      7   37    5  A  P N             T        Y              
LSTUSEDH DS    XL8                                                              
LSTUSED  DS    CL2      7   45    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL9      7   54    9  A  P N             T        Y              
LSTLMTH  DS    XL8                                                              
LSTLMT   DS    CL12     7   64   12  A  U H             T        Y              
LSTHDLNH DS    XL8                                                              
LSTHDLN  DS    CL78     9    2   78  A  P H             T        Y              
LSTHDLUH DS    XL8                                                              
LSTHDLU  DS    CL78    10    2   78  A  P H             T        Y              
LSTACT1H DS    XL8                                                              
LSTACT1  DS    CL3     11    2    3  A  U N             T        Y              
LSTLIN1H DS    XL8                                                              
LSTLIN1  DS    CL74    11    6   74  A  P N             T        Y              
LSTACT2H DS    XL8                                                              
LSTACT2  DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    12    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    23    6   74  A  P N             T        Y              
LSTLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1704 BYTES                            
