*          DATA SET CTGENF5D   AT LEVEL 008 AS OF 12/19/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BF5D      DATE 12/19/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL16     5    2   16  L  P H             T        Y              
XAGAGYH  DS    CL8                                                              
XAGAGY   DS    CL2      5   20    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     6    2   16  L  P H             T        Y              
XAGSYSH  DS    CL8                                                              
XAGSYS   DS    CL7      6   20    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     6   37   16  L  P H             T        Y              
XAGSUBH  DS    CL8                                                              
XAGSUB   DS    CL7      6   54    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     8    2   16  L  P N             T        Y              
XAGLEVH  DS    CL8                                                              
XAGLEV   DS    CL3      8   20    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL16     8   37   16  L  P N             T        Y              
XAGVERH  DS    CL8                                                              
XAGVER   DS    CL3      8   54    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL16     9    2   16  L  P N             T        Y              
XAGTYPH  DS    CL8                                                              
XAGTYP   DS    CL3      9   20    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL16     9   37   16  L  P N             T        Y              
XAGFLTSH DS    CL8                                                              
XAGFLTS  DS    CL3      9   54    3  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL16    10    2   16  L  P N             T        Y              
XAGPSZH  DS    CL8                                                              
XAGPSZ   DS    CL8     10   20    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL16    10   37   16  L  P N             T        Y              
XAGSSZH  DS    CL8                                                              
XAGSSZ   DS    CL8     10   54    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL16    11    2   16  L  P N             T        Y              
XAGFCODH DS    CL8                                                              
XAGFCOD  DS    CL1     11   20    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL16    11   37   16  L  P N             T        Y              
XAGFTIMH DS    CL8                                                              
XAGFTIM  DS    CL5     11   54    5  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL17    12    2   17  L  P N             T        Y              
XAGGNUMH DS    CL8                                                              
XAGGNUM  DS    CL5     12   20    5  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL16    12   37   16  L  P N             T        Y              
XAGEKEYH DS    CL8                                                              
XAGEKEY  DS    CL10    12   54   10  A  U H             T        Y              
XAGTENDH DS    CL8                                                              
XAGTEND  DS    CL1     13    2    1  L  P N             T        Y              
XAGLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
XAGWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 496  BYTES                            
