*          DATA SET CTGENB0D   AT LEVEL 002 AS OF 01/02/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BB0D      DATE 01/02/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL9      5    2    9  L  P H             T        Y              
REPREQH  DS    XL8                                                              
REPREQ   DS    CL3      5   27    3  A  U N             T        Y   50         
REPREQX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      6    2    9  L  P H             T        Y              
REPWHENH DS    XL8                                                              
REPWHEN  DS    CL10     6   27   10  A  U N             T        Y   51         
REPWHENX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14     7    2   14  L  P N             T        Y              
REPDESTH DS    XL8                                                              
REPDEST  DS    CL10     7   27   10  A  U N             T        Y   52         
REPDESTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL10     8    2   10  L  P H             T        Y              
REPSYSH  DS    XL8                                                              
REPSYS   DS    CL8      8   27    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15     9    2   15  L  P H             T        Y              
REPCURFH DS    XL8                                                              
REPCURF  DS    CL3      9   27    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL15    10    2   15  L  P N             T        Y              
REPCURTH DS    XL8                                                              
REPCURT  DS    CL3     10   27    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    11    2   10  L  P N             T        Y              
REPTYPH  DS    XL8                                                              
REPTYP   DS    CL10    11   27   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    12    2   10  L  P N             T        Y              
REPCLIH  DS    XL8                                                              
REPCLI   DS    CL10    12   27   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    13    2   10  L  P N             T        Y              
REPPERH  DS    XL8                                                              
REPPER   DS    CL17    13   27   17  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   27    1  A  U N             T        Y              
REPLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
REPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 360  BYTES                            
