*          DATA SET CTGENE2D   AT LEVEL 004 AS OF 06/25/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BE2D      DATE 06/25/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P N             T        Y              
DCLSYSH  DS    CL8                                                              
DCLSYS   DS    CL7      5   10    7  A  U H             T        Y  100         
DCLSYSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      5   20    4  A  P N             T        Y              
DCLLANGH DS    CL8                                                              
DCLLANG  DS    CL13     5   27   13  A  U H             T        Y  102         
DCLLANGX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   42    7  A  P N             T        Y              
DCLMSGH  DS    CL8                                                              
DCLMSG   DS    CL5      5   50    5  A  U H             T        Y  103         
DCLMSGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   62    7  A  P N             T        Y              
DCLQNMEH DS    CL8                                                              
DCLQNME  DS    CL8      5   70    8  A  U N             T        Y  104         
DCLQNMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
DCLTRNSH DS    CL8                                                              
DCLTRNS  DS    CL1      6   10    1  A  U N             T        Y  106         
DCLTRNSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      6   20    3  A  P N             T        Y              
DCLRFPH  DS    CL8                                                              
DCLRFP   DS    CL3      6   27    3  A  U N             T        Y  107         
DCLRFPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL79     8    2   79  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL79     9    2   79  A  P H             T        Y              
DCLACT1H DS    CL8                                                              
DCLACT1  DS    CL2     10    2    2  A  U N             T        Y              
DCLLIN1H DS    CL8                                                              
DCLLIN1  DS    CL76    10    5   76  A  P N             T        Y              
DCLACT2H DS    CL8                                                              
DCLACT2  DS    CL2     11    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    11    5   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    12    5   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    13    5   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    14    5   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    15    5   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    16    5   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    17    5   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    18    5   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    19    5   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    20    5   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    21    5   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     22    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    22    5   76  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     23    2    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL76    23    5   76  A  P N             T        Y              
DCLLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
DCLWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1712 BYTES                            
