*          DATA SET CTGENSTTWX AT LEVEL 010 AS OF 01/27/88                      
*              DSECT TO COVER TRAFFIC STATION TWX NUMBER RECORD                 
         SPACE                                                                  
CSTREC   DSECT                                                                  
CSTKEY   DS    0CL25     V         KEY                                          
CSTKTYP  DS    CL1       C         RECORD TYPE C'6'                             
CSTKTEQU EQU   C'5'                                                             
CSTKSPAR DS    CL19      X         SPARE (BINARY ZEROS)                         
CSTKSTA  DS    CL5       X         STATION XXXXM                                
CSTLEN   DS    XL2       X         RECORD LENGTH                                
CSTSTAT  DS    XL1       X         STATUS                                       
CSTDATA  DS    0X        V         DATA X'10' LN=46 20 TWX                      
*                                                   20 TWX/ANSWERBACK           
*                                                    4 DDS CODE-FUTURE          
*                                       X'21' LN=26 ADDR LINE 1                 
*                                       X'22' LN=26 ADDR LINE 2                 
*                                       X'23' LN=26 ADDR LINE 3 (OPT)           
*                                       X'24' LN=26 ADDR LINE 4 (OPT)           
*                                       X'30' LN=20 TELEPHONE NUMBER            
*                                       X'40' LN= 6 COMMERCIAL TYPE             
*                                       X'F1' LN= 5 DATE LAST CHANGE            
