*          DATA SET CTGENA7D   AT LEVEL 001 AS OF 12/15/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BA7D      DATE 12/15/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL4      5    2    4  A  P H             T        Y              
DISTYPH  DS    CL8                                                              
DISTYP   DS    CL8      5   10    8  A  U H             T        Y              
DISSYLH  DS    CL8                                                              
DISSYL   DS    CL6      5   20    6  L  P H             T        Y              
DISSYSH  DS    CL8                                                              
DISSYS   DS    CL7      5   27    7  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL4      5   36    4  A  P N             T        Y              
DISNUMH  DS    CL8                                                              
DISNUM   DS    CL2      5   41    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
DISDS1H  DS    CL8                                                              
DISDS1   DS    CL60     7   15   60  L  U N             T        Y              
DISU1LH  DS    CL8                                                              
DISU1L   DS    CL12     9    2   12  A  P H             T        Y              
DISUP1H  DS    CL8                                                              
DISUP1   DS    CL60     9   15   60  A  U H             T        Y              
DISU2LH  DS    CL8                                                              
DISU2L   DS    CL12    10    2   12  L  P H             T        Y              
DISR1LH  DS    CL8                                                              
DISR1L   DS    CL12    12    2   12  L  P N             T        Y              
DISRD1H  DS    CL8                                                              
DISRD1   DS    CL60    12   15   60  A  U H             T        Y              
DISR2LH  DS    CL8                                                              
DISR2L   DS    CL12    13    2   12  L  P N             T        Y              
DISTABH  DS    CL8                                                              
DISTAB   DS    CL1     14    2    1  A  U N             T        Y              
DISLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
DISWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 400  BYTES                            
