*          DATA SET CTGENJIMB  AT LEVEL 006 AS OF 10/24/94                      
CTGJIMD  DSECT                                                                  
CTGKEY   DS    0CL32                                                            
CTGKSYS  DS    XL1                                                              
CTGKSYSQ EQU   X'00'                                                            
CTGKSTYP DS    XL1                                                              
CTGKSTYQ EQU   X'38'                                                            
CTGKNAME DS    CL8                 PROFS ID NAME                                
         DS    CL22                                                             
CTGKLENQ EQU   *-CTGKEY            EQUATED KEY LENGTH                           
CTGKSTAT DS    XL4                 KEY STATUS                                   
CTGDA    DS    XL4                 DISK ADDRESS                                 
         ORG   CTGKLENQ                                                         
CTGRECLN DS    XL2                 RECORD LENGTH                                
CTGSTAT  DS    XL4                 STATUS BYTES                                 
CTGLIND  DS    XL4                 LINKAGE BYTES                                
CTGJIMQ  EQU   *-CTGKEY            LENGTH EQUATE                                
