*          DATA SET CTGEND2D   AT LEVEL 003 AS OF 04/19/18                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BD2D      DATE 04/19/18                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL8      5    2    8  A  P N             T        Y              
LSTTERMH DS    XL8                                                              
LSTTERM  DS    CL8      5   12    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   22    6  A  P N             T        Y              
LSTSYSH  DS    XL8                                                              
LSTSYS   DS    CL7      5   30    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL4      5   40    4  A  P N             T        Y              
LSTPWRDH DS    XL8                                                              
LSTPWRD  DS    CL10     5   49   10  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      5   61    7  A  P N             T        Y              
LSTTAPLH DS    XL8                                                              
LSTTAPL  DS    CL8      5   70    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
LSTDEVH  DS    XL8                                                              
LSTDEV   DS    CL8      6   12    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL4      6   22    4  A  P N             T        Y              
LSTTYPH  DS    XL8                                                              
LSTTYP   DS    CL8      6   30    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      6   40    7  A  P N             T        Y              
LSTCTRYH DS    XL8                                                              
LSTCTRY  DS    CL6      6   49    6  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      6   61    6  A  P N             T        Y              
LSTAGYH  DS    XL8                                                              
LSTAGY   DS    CL2      6   70    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
LSTOFCH  DS    XL8                                                              
LSTOFC   DS    CL2      7   12    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL4      7   22    4  A  P N             T        Y              
LSTNODEH DS    XL8                                                              
LSTNODE  DS    CL8      7   30    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL4      7   40    4  A  P N             T        Y              
LSTLINEH DS    XL8                                                              
LSTLINE  DS    CL4      7   49    4  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL4      7   61    4  A  P N             T        Y              
LSTCUDVH DS    XL8                                                              
LSTCUDV  DS    CL4      7   70    4  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL8      8    2    8  A  P N             T        Y              
LSTESCH  DS    XL8                                                              
LSTESC   DS    CL3      8   12    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL4      8   22    4  A  P N             T        Y              
LSTSTATH DS    XL8                                                              
LSTSTAT  DS    CL8      8   30    8  A  U H             T        Y              
LSTHEADH DS    XL8                                                              
LSTHEAD  DS    CL78    10    2   78  A  P N             T        Y              
LSTACT1H DS    XL8                                                              
LSTACT1  DS    CL3     11    2    3  A  U N             T        Y              
LSTLIN1H DS    XL8                                                              
LSTLIN1  DS    CL73    11    7   73  A  P N             T        Y              
LSTACT2H DS    XL8                                                              
LSTACT2  DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    12    7   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    13    7   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    14    7   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    15    7   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    16    7   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    17    7   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    18    7   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    19    7   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    20    7   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    21    7   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    22    7   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    23    7   73  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     24    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL73    24    7   73  A  P N             T        Y              
LSTLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1768 BYTES                            
