*          DATA SET CTGENF0D   AT LEVEL 002 AS OF 01/02/08                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BF0D      DATE 01/02/08                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  L  P N             T        Y              
LSTSYSH  DS    XL8                                                              
LSTSYS   DS    CL7      5   16    7  A  U H             T        Y  101         
LSTSYSX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   42    5  L  P N             T        Y              
LSTTYPH  DS    XL8                                                              
LSTTYP   DS    CL10     5   56   10  A  U H             T        Y  102         
LSTTYPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13     6    2   13  L  P N             T        Y              
LSTCFRMH DS    XL8                                                              
LSTCFRM  DS    CL4      6   16    4  A  U H             T        Y  103         
LSTCFRMX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      6   21    5  L  P N             T        Y              
LSTCRTOH DS    XL8                                                              
LSTCRTO  DS    CL4      6   27    4  A  U H             T        Y  104         
LSTCRTOX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   42    6  L  P N             T        Y              
LSTPERH  DS    XL8                                                              
LSTPER   DS    CL17     6   56   17  A  U H             T        Y  105         
LSTPERX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      7    2    7  L  P N             T        Y              
LSTCLIH  DS    XL8                                                              
LSTCLI   DS    CL7      7   16    7  A  U N             T        Y  106         
LSTCLIX  DS    XL8                                                              
LSTCLINH DS    XL8                                                              
LSTCLIN  DS    CL20     7   27   20  L  P H             T        Y              
LSTHDRH  DS    XL8                                                              
LSTHDR   DS    CL79     9    2   79  L  P H             T        Y              
LSTHDR2H DS    XL8                                                              
LSTHDR2  DS    CL79    10    2   79  L  P H             T        Y              
LSTACT1H DS    XL8                                                              
LSTACT1  DS    CL3     11    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     11   12    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     11   17    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    11   23   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    11   41   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     11   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    11   61   18  A  U N             T        Y              
LSTACT2H DS    XL8                                                              
LSTACT2  DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     12   12    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     12   17    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    12   23   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    12   41   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     12   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    12   61   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     13   12    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     13   17    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    13   23   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    13   41   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     13   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    13   61   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     14   12    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     14   17    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    14   23   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    14   41   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     14   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    14   61   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     15   12    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     15   17    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    15   23   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    15   41   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     15   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    15   61   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     16   12    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     16   17    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    16   23   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    16   41   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     16   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    16   61   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     17   12    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     17   17    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    17   23   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    17   41   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     17   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    17   61   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     18   12    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     18   17    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    18   23   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    18   41   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     18   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    18   61   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     19   12    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     19   17    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    19   23   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    19   41   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     19   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    19   61   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     20   12    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     20   17    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    20   23   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    20   41   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     20   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    20   61   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     21   12    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     21   17    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    21   23   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    21   41   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     21   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    21   61   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     22   12    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     22   17    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    22   23   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    22   41   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     22   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    22   61   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     23   12    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     23   17    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    23   23   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    23   41   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     23   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    23   61   18  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     24    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     24    6    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3     24   12    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL5     24   17    5  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL17    24   23   17  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL10    24   41   10  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL8     24   52    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL18    24   61   18  A  U N             T        Y              
LSTLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2280 BYTES                            
