*          DATA SET CTGENACD   AT LEVEL 001 AS OF 05/12/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BACD      DATE 12/05/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL12     5    2   12  L  P N             T        Y              
LSTTYPEH DS    CL8                                                              
LSTTYPE  DS    CL2      5   15    2  A  U H             T    I   Y  100         
LSTTYPEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL4      5   22    4  L  P N             T        Y              
LSTNAMEH DS    CL8                                                              
LSTNAME  DS    CL10     5   27   10  A  U H             T        Y  101         
LSTNAMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   79    1  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL79     6    2   79  L  P H             T        Y              
LSTACT1H DS    CL8                                                              
LSTACT1  DS    CL3      7    2    3  A  U N             T        Y              
LSTLIN1H DS    CL8                                                              
LSTLIN1  DS    CL75     7    6   75  A  P N             T        Y              
LSTACT2H DS    CL8                                                              
LSTACT2  DS    CL3      8    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75     8    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75     9    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    10    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    11    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    12    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    13    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    14    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    15    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    16    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    17    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    18    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    19    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    20    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    21    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    22    6   75  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL75    23    6   75  A  P N             T        Y              
LSTLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1776 BYTES                            
