*          DATA SET CTGENDBD   AT LEVEL 005 AS OF 12/19/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BDBD      DATE 12/19/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL16     9    2   16  L  P N             T        Y              
XF2EIDH  DS    CL8                                                              
XF2EID   DS    CL8      9   20    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL16     9   37   16  L  P N             T        Y              
XF2FNMH  DS    CL8                                                              
XF2FNM   DS    CL8      9   55    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL16    10    2   16  L  P N             T        Y              
XF2LOADH DS    CL8                                                              
XF2LOAD  DS    CL1     10   20    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL78    11    2   78  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL78    12    2   78  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL78    13    2   78  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL16    15    2   16  L  P N             T        Y              
XF2DNOH  DS    CL8                                                              
XF2DNO   DS    CL8     15   20    8  L  P N             T        Y              
XF2TNOH  DS    CL8                                                              
XF2TNO   DS    CL8     15   30    8  L  P N             T        Y              
XF2SNOH  DS    CL8                                                              
XF2SNO   DS    CL30    15   40   30  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    17    2   16  L  P N             T        Y              
XF2DREH  DS    CL8                                                              
XF2DRE   DS    CL8     17   20    8  L  P N             T        Y              
XF2TREH  DS    CL8                                                              
XF2TRE   DS    CL8     17   30    8  L  P N             T        Y              
XF2SREH  DS    CL8                                                              
XF2SRE   DS    CL30    17   40   30  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL16    19    2   16  L  P N             T        Y              
XF2DCOH  DS    CL8                                                              
XF2DCO   DS    CL8     19   20    8  L  P N             T        Y              
XF2TCOH  DS    CL8                                                              
XF2TCO   DS    CL8     19   30    8  L  P N             T        Y              
XF2SCOH  DS    CL8                                                              
XF2SCO   DS    CL30    19   40   30  L  P N             T        Y              
XF2TENDH DS    CL8                                                              
XF2TEND  DS    CL1     20    2    1  L  P N             T        Y              
XF2LAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
XF2WORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 672  BYTES                            
