*          DATA SET CTGENFBD   AT LEVEL 003 AS OF 05/17/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BFBD      DATE 05/17/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A   P    H         T        Y              
TSTSYSH  DS    CL8                                                              
TSTSYS   DS    CL7      5   27    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4      6    2    4  A   P    H         T        Y              
TSTTYPEH DS    CL8                                                              
TSTTYPE  DS    CL1      6   27    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL6      7    2    6  A   P    H         T        Y              
TSTNUMH  DS    CL8                                                              
TSTNUM   DS    CL6      7   27    6  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8      8    2    8  A   P    H         T        Y              
TSTLANGH DS    CL8                                                              
TSTLANG  DS    CL13     8   27   13  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL5      9    2    5  A   P    H         T        Y              
TSTIDXH  DS    CL8                                                              
TSTIDX   DS    CL2      9   27    2  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL9     10    2    9  A   P    H         T        Y              
TSTSUBH  DS    CL8                                                              
TSTSUB   DS    CL2     10   27    2  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL4     11    2    4  L   P    H         T        Y              
TSTTXTH  DS    CL8                                                              
TSTTXT   DS    CL20    11   27   20  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL15    12    2   15  L   P    H         T        Y              
TSTOADRH DS    CL8                                                              
TSTOADR  DS    CL20    12   27   20  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL16    13    2   16  A   P    H         T        Y              
TSTOREFH DS    CL8                                                              
TSTOREF  DS    CL20    13   27   20  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL7     14    2    7  A   P    N         T        Y              
TSTMSGH  DS    CL8                                                              
TSTMSG   DS    CL60    14   10   60  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL60    15   10   60  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7     16    2    7  A   P    N         T        Y              
TSTLENH  DS    CL8                                                              
TSTLEN   DS    CL3     16   10    3  L   P    H         T        Y              
TSTOTABH DS    CL8                                                              
TSTOTAB  DS    CL1     17   10    1  A   U    N         T        Y              
TSTLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
TSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 504  BYTES                            
