*          DATA SET CTGENA8D   AT LEVEL 004 AS OF 04/25/11                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BA8D      DATE 04/25/11                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL9      5    2    9  A  P H             T        Y              
REPREQH  DS    XL8                                                              
REPREQ   DS    CL3      5   27    3  A  U N             T        Y   50         
REPREQX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      6    2    9  A  P H             T        Y              
REPWHENH DS    XL8                                                              
REPWHEN  DS    CL10     6   27   10  A  U N             T        Y   51         
REPWHENX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14     7    2   14  A  P N             T        Y              
REPDESTH DS    XL8                                                              
REPDEST  DS    CL10     7   27   10  A  U N             T        Y   52         
REPDESTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
REPOTYPH DS    XL8                                                              
REPOTYP  DS    CL6      8   27    6  A  U N             T        Y  150         
REPOTYPX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14     9    2   14  A  P N             T        Y              
REPCTYH  DS    XL8                                                              
REPCTY   DS    CL11     9   27   11  A  U N             T        Y  200         
REPCTYX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    10    2   13  A  P N             T        Y              
REPACCSH DS    XL8                                                              
REPACCS  DS    CL7     10   27    7  A  U N             T        Y  201         
REPACCSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL13    11    2   13  A  P N             T        Y              
REPSECAH DS    XL8                                                              
REPSECA  DS    CL7     11   27    7  A  U N             T        Y  202         
REPSECAX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL1     12   27    1  A  U N             T        Y              
REPLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
REPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 320  BYTES                            
