*          DATA SET CTGENE5D   AT LEVEL 001 AS OF 01/28/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BE5D      DATE 01/28/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      5    2    9  L   P    H         T        Y              
TVRAGRH  DS    CL8                                                              
TVRAGR   DS    CL1      5   12    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      5   15    7  L   P    H         T        Y              
TVRCOMH  DS    CL8                                                              
TVRCOM   DS    CL40     5   24   40  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9      6    2    9  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      6   12    5  L   P    N         T        Y              
TVRDTOH  DS    CL8                                                              
TVRDTO   DS    CL10     6   20   10  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL15     7   10   15  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL20     7   30   20  L   P    N         T        Y              
TVRT1H   DS    CL8                                                              
TVRT1    DS    CL8      9   17    8  A   U    H         T        Y              
TVRP1H   DS    CL8                                                              
TVRP1    DS    CL5      9   30    5  A   U    H         T        Y              
TVRT2H   DS    CL8                                                              
TVRT2    DS    CL8     11   17    8  A   U    H         T        Y              
TVRP2H   DS    CL8                                                              
TVRP2    DS    CL5     11   30    5  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8     13   17    8  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL5     13   30    5  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8     15   17    8  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL5     15   30    5  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8     17   17    8  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL5     17   30    5  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8     19   17    8  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL5     19   30    5  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8     21   17    8  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL5     21   30    5  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8     23   17    8  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL5     23   30    5  A   U    H         T        Y              
TVRLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
TVRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 432  BYTES                            
