*          DATA SET CTGEND6D   AT LEVEL 004 AS OF 08/20/07                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BD6D      DATE 08/20/07                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL6      4    2    6  A  P N             T        Y              
LSTSYSTH DS    XL8                                                              
LSTSYST  DS    CL7      4   10    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      4   20    7  A  P N             T        Y              
LSTPRGMH DS    XL8                                                              
LSTPRGM  DS    CL2      4   28    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL9      4   32    9  A  P N             T        Y              
LSTORGNH DS    XL8                                                              
LSTORGN  DS    CL10     4   43   10  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12     4   55   12  A  P N             T        Y              
LSTPROTH DS    XL8                                                              
LSTPROT  DS    CL10     4   69   10  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
LSTFRMCH DS    XL8                                                              
LSTFRMC  DS    CL2      5   10    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      5   20    7  A  P N             T        Y              
LSTATYPH DS    XL8                                                              
LSTATYP  DS    CL3      5   28    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL9      5   32    9  A  P N             T        Y              
LSTDSTIH DS    XL8                                                              
LSTDSTI  DS    CL10     5   43   10  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12     5   55   12  A  P N             T        Y              
LSTOUTPH DS    XL8                                                              
LSTOUTP  DS    CL10     5   69   10  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
LSTPRSCH DS    XL8                                                              
LSTPRSC  DS    CL1      6   10    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
LSTPRPTH DS    XL8                                                              
LSTPRPT  DS    CL1      6   28    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL9      6   32    9  A  P N             T        Y              
LSTPRPOH DS    XL8                                                              
LSTPRPO  DS    CL1      6   43    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12     6   55   12  A  P N             T        Y              
LSTRCLAH DS    XL8                                                              
LSTRCLA  DS    CL1      6   69    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL5      7    2    5  A  P N             T        Y              
LSTSPHSH DS    XL8                                                              
LSTSPHS  DS    CL1      7   10    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      7   20    7  A  P N             T        Y              
LSTSJCLH DS    XL8                                                              
LSTSJCL  DS    CL1      7   28    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      7   32    6  A  P N             T        Y              
LSTAFPH  DS    XL8                                                              
LSTAFP   DS    CL1      7   43    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12     7   55   12  A  P N             T        Y              
LSTRTNCH DS    XL8                                                              
LSTRTNC  DS    CL1      7   69    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      8    2    7  A  P N             T        Y              
LSTARCH  DS    XL8                                                              
LSTARC   DS    CL1      8   10    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      8   20    7  A  P N             T        Y              
LSTPADH  DS    XL8                                                              
LSTPAD   DS    CL1      8   28    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      8   32    7  A  P N             T        Y              
LSTPQBH  DS    XL8                                                              
LSTPQB   DS    CL1      8   43    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL78    10    2   78  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL78    11    2   78  A  P H             T        Y              
LSTACT1H DS    XL8                                                              
LSTACT1  DS    CL3     12    2    3  A  U N             T        Y              
LSTLIN1H DS    XL8                                                              
LSTLIN1  DS    CL74    12    6   74  A  P N             T        Y              
LSTACT2H DS    XL8                                                              
LSTACT2  DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    23    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     24    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    24    6   74  A  P N             T        Y              
LSTLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1912 BYTES                            
