*          DATA SET CTGENE3D   AT LEVEL 003 AS OF 01/23/03                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BE3D      DATE 01/23/03                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL16     5    2   16  A  P N             T        Y              
SECALPHH DS    XL8                                                              
SECALPH  DS    CL2      5   20    2  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL16     6    2   16  L  P N             T        Y              
SECSYSH  DS    XL8                                                              
SECSYS   DS    CL7      6   20    7  A  U H             T        Y              
SECSHDH  DS    XL8                                                              
SECSHD   DS    CL78     8    2   78  L  P H             T        Y              
         DS    XL8                                                              
         DS    CL16     9    2   16  L  P N             T        Y              
SECALLH  DS    XL8                                                              
SECALL   DS    CL1      9   20    1  A  U H             T        Y              
SECTBARH DS    XL8                                                              
SECTBAR  DS    CL26    11    2   26  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL24    11   29   24  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL26    11   54   26  A  P H             T        Y              
SECPN01H DS    XL8                                                              
SECPN01  DS    CL7     12    2    7  L  P N             T        Y              
SECPV01H DS    XL8                                                              
SECPV01  DS    CL1     12   11    1  A  U H             T        Y              
SECPN02H DS    XL8                                                              
SECPN02  DS    CL7     12   14    7  L  P N             T        Y              
SECPV02H DS    XL8                                                              
SECPV02  DS    CL1     12   23    1  A  U H             T        Y              
SECPN03H DS    XL8                                                              
SECPN03  DS    CL7     12   26    7  L  P N             T        Y              
SECPV03H DS    XL8                                                              
SECPV03  DS    CL1     12   35    1  A  U H             T        Y              
SECPN04H DS    XL8                                                              
SECPN04  DS    CL7     12   38    7  L  P N             T        Y              
SECPV04H DS    XL8                                                              
SECPV04  DS    CL1     12   49    1  A  U H             T        Y              
SECPN05H DS    XL8                                                              
SECPN05  DS    CL7     12   52    7  L  P N             T        Y              
SECPV05H DS    XL8                                                              
SECPV05  DS    CL1     12   61    1  A  U H             T        Y              
SECPN06H DS    XL8                                                              
SECPN06  DS    CL7     12   64    7  L  P N             T        Y              
SECPV06H DS    XL8                                                              
SECPV06  DS    CL1     12   73    1  A  U H             T        Y              
SECPN07H DS    XL8                                                              
SECPN07  DS    CL7     13    2    7  L  P N             T        Y              
SECPV07H DS    XL8                                                              
SECPV07  DS    CL1     13   11    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     13   14    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   23    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     13   26    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   35    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     13   38    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   49    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     13   52    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   61    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     13   64    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     13   73    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     14    2    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   11    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     14   14    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   23    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     14   26    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   35    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     14   38    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   49    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     14   52    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   61    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     14   64    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     14   73    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     15    2    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   11    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     15   14    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   23    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     15   26    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   35    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     15   38    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   49    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     15   52    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   61    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     15   64    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     15   73    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     16    2    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   11    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     16   14    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   23    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     16   26    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   35    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     16   38    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   49    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     16   52    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   61    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     16   64    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     16   73    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     17    2    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   11    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     17   14    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   23    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     17   26    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   35    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     17   38    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   49    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     17   52    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   61    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     17   64    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     17   73    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     18    2    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   11    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     18   14    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   23    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     18   26    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   35    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     18   38    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   49    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     18   52    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   61    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     18   64    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     18   73    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     19    2    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   11    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     19   14    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   23    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     19   26    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   35    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     19   38    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   49    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     19   52    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   61    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     19   64    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     19   73    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     20    2    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   11    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     20   14    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   23    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     20   26    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   35    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     20   38    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   49    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     20   52    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   61    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     20   64    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     20   73    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     21    2    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   11    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     21   14    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   23    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     21   26    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   35    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     21   38    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   49    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     21   52    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   61    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     21   64    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     21   73    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     22    2    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   11    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     22   14    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   23    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     22   26    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   35    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     22   38    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   49    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     22   52    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   61    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     22   64    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     22   73    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     23    2    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23   11    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     23   14    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23   23    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     23   26    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23   35    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     23   38    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23   49    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     23   52    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23   61    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     23   64    7  L  P N             T        Y              
         DS    XL8                                                              
         DS    CL1     23   73    1  A  U H             T        Y              
SECTENDH DS    XL8                                                              
SECTEND  DS    CL1     24    2    1  L  P N             T        Y              
SECLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
SECWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2032 BYTES                            
