*          DATA SET CTGENDDD   AT LEVEL 001 AS OF 03/06/13                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BDDD      DATE 03/06/13                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL11     4    2   11  A  P N             T        Y              
LSTTYPEH DS    XL8                                                              
LSTTYPE  DS    CL10     4   18   10  A  U H             T        Y  100         
LSTTYPEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5    2    5  A  P N             T        Y              
LSTDESTH DS    XL8                                                              
LSTDEST  DS    CL5      5   10    5  A  U H             T        Y  100         
LSTDESTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   18    5  A  P N             T        Y              
LSTCLASH DS    XL8                                                              
LSTCLAS  DS    CL1      5   26    1  A  U H             T        Y  101         
LSTCLASX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   34    5  A  P N             T        Y              
LSTPRTYH DS    XL8                                                              
LSTPRTY  DS    CL2      5   42    2  A  U H             T        Y  102         
LSTPRTYX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      5   50    5  A  P N             T        Y              
LSTPWRCH DS    XL8                                                              
LSTPWRC  DS    CL4      5   58    4  A  U H             T        Y  103         
LSTPWRCX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL7      5   66    7  A  P N             T        Y              
LSTTAPEH DS    XL8                                                              
LSTTAPE  DS    CL4      5   74    4  A  U H             T        Y  104         
LSTTAPEX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
LSTCPYSH DS    XL8                                                              
LSTCPYS  DS    CL1      6   10    1  A  U H             T        Y  105         
LSTCPYSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      6   18    6  A  P N             T        Y              
LSTSTATH DS    XL8                                                              
LSTSTAT  DS    CL1      6   26    1  A  U H             T        Y  106         
LSTSTATX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      6   34    5  A  P N             T        Y              
LSTPWRDH DS    XL8                                                              
LSTPWRD  DS    CL1      6   42    1  A  U H             T        Y  107         
LSTPWRDX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL4      6   50    4  A  P N             T        Y              
LSTTDETH DS    XL8                                                              
LSTTDET  DS    CL6      6   58    6  A  U H             T        Y  108         
LSTTDETX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL5      6   66    5  A  P N             T        Y              
LSTFCHH  DS    XL8                                                              
LSTFCH   DS    CL1      6   74    1  A  U H             T        Y  109         
LSTFCHX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
LSTCHRSH DS    XL8                                                              
LSTCHRS  DS    CL4      7   10    4  A  U H             T        Y  110         
LSTCHRSX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   18    6  A  P N             T        Y              
LSTAFPH  DS    XL8                                                              
LSTAFP   DS    CL1      7   26    1  A  U H             T        Y  111         
LSTAFPX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6      7   34    6  A  P N             T        Y              
LSTPQCH  DS    XL8                                                              
LSTPQC   DS    CL1      7   42    1  A  U H             T        Y  112         
LSTPQCX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL79     9    2   79  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL79    10    2   79  A  P H             T        Y              
LSTACT1H DS    XL8                                                              
LSTACT1  DS    CL3     11    2    3  A  U N             T        Y              
LSTLIN1H DS    XL8                                                              
LSTLIN1  DS    CL74    11    6   74  A  P N             T        Y              
LSTACT2H DS    XL8                                                              
LSTACT2  DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    12    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    23    6   74  A  P N             T        Y              
LSTLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1848 BYTES                            
