*          DATA SET CTGENE1DS  AT LEVEL 006 AS OF 06/25/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BE1D      DATE 06/25/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A  P H             T        Y              
DCTSYSH  DS    CL8                                                              
DCTSYS   DS    CL7      5   10    7  A  U H             T        Y  100         
DCTSYSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   20    7  A  P H             T        Y              
DCTNUMH  DS    CL8                                                              
DCTNUM   DS    CL5      5   28    5  A  U H             T        Y  102         
DCTNUMX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      5   37    8  A  P H             T        Y              
DCTLANGH DS    CL8                                                              
DCTLANG  DS    CL13     5   47   13  A  U H             T        Y  103         
DCTLANGX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      5   62    7  A  P N             T        Y              
DCTQNMEH DS    CL8                                                              
DCTQNME  DS    CL8      5   70    8  A  U N             T        Y  111         
DCTQNMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6    2    7  A  P N             T        Y              
DCTPRGH  DS    CL8                                                              
DCTPRG   DS    CL8      6   10    8  A  U N             T        Y  107         
DCTPRGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   20    7  A  P N             T        Y              
DCTSUBH  DS    CL8                                                              
DCTSUB   DS    CL8      6   28    8  L  U N             T        Y  109         
DCTSUBX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      6   37    7  A  P N             T        Y              
DCTLMTH  DS    CL8                                                              
DCTLMT   DS    CL2      6   47    2  A  U N             T        Y  108         
DCTLMTX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     6   62   11  A  P N             T        Y              
DCTTRNSH DS    CL8                                                              
DCTTRNS  DS    CL1      6   74    1  A  U N             T        Y  104         
DCTTRNSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      7    2    7  A  P N             T        Y              
DCTRFPH  DS    CL8                                                              
DCTRFP   DS    CL3      7   10    3  A  U N             T        Y  113         
DCTRFPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL3      7   74    3  A  P N             T        Y              
DCTOKAYH DS    CL8                                                              
DCTOKAY  DS    CL1      7   78    1  A  U N             T        Y  114         
DCTOKAYX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL28     8    2   28  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL20     8   31   20  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL28     8   52   28  A  P N             T        Y              
DCTMSG1H DS    CL8                                                              
DCTMSG1  DS    CL79     9    2   79  L  U H             T        Y  105         
DCTMSG1X DS    CL8                                                              
DCTMSG2H DS    CL8                                                              
DCTMSG2  DS    CL79    10    2   79  L  U H             T        Y  105         
DCTMSG2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL31    11    2   31  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    11   34   13  L  P N             T        Y              
         DS    CL8                                                              
         DS    CL33    11   48   33  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    12    6   70  A  P N             T        Y              
DCTXEQUH DS    CL8                                                              
DCTXEQU  DS    CL70    13    6   70  A  U N             T        Y  106         
DCTXEQUX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL70    14    6   70  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL70    15    6   70  A  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL70    16    6   70  A  U N             T        Y  106         
         DS    CL8                                                              
DCTXEQXH DS    CL8                                                              
DCTXEQX  DS    CL70    17    6   70  A  U N             T        Y  106         
DCTXEQXX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL78    18    2   78  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19    2    2  A  P N             T        Y              
DCTCMMTH DS    CL8                                                              
DCTCMMT  DS    CL70    19    6   70  A  U N             T        Y  115         
DCTCMMTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     19   78    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20    2    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    20    6   70  A  U N             T        Y  115         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     20   78    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21    2    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    21    6   70  A  U N             T        Y  115         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     21   78    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     22    2    2  A  P N             T        Y              
DCTCMMXH DS    CL8                                                              
DCTCMMX  DS    CL70    22    6   70  A  U N             T        Y  115         
DCTCMMXX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL2     22   78    2  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    23    2   79  A  P N             T        Y              
DCTLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
DCTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1872 BYTES                            
