*          DATA SET CTGENAAD   AT LEVEL 004 AS OF 04/16/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BAAD      DATE 04/16/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      4    2    7  L  P H             T        Y              
PRVPTYH  DS    CL8                                                              
PRVPTY   DS    CL1      4   10    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      4   20    8  L  P H             T        Y              
PRVPSTH  DS    CL8                                                              
PRVPST   DS    CL1      4   29    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      4   37    8  L  P H             T        Y              
PRVSYSH  DS    CL8                                                              
PRVSYS   DS    CL7      4   46    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      4   55    8  L  P H             T        Y              
PRVPNMH  DS    CL8                                                              
PRVPNM   DS    CL8      4   64    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      5    2    5  L  P H             T        Y              
PRVLANGH DS    CL8                                                              
PRVLANG  DS    CL13     5   20   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     6    2   16  L  P N             T        Y              
PRVDATRH DS    CL8                                                              
PRVDATR  DS    CL20     6   20   20  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL15     6   46   15  L  P N             T        Y              
PRVVLVH  DS    CL8                                                              
PRVVLV   DS    CL7      6   64    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     7    2   16  L  P N             T        Y              
PRVREP1H DS    CL8                                                              
PRVREP1  DS    CL9      7   20    9  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL15     7   46   15  L  P N             T        Y              
PRVREP2H DS    CL8                                                              
PRVREP2  DS    CL9      7   64    9  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL16     8    2   16  L  P N             T        Y              
PRVHIGHH DS    CL8                                                              
PRVHIGH  DS    CL1      8   20    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL79     9    2   79  A  P N             T        Y              
PRVMSGH  DS    CL8                                                              
PRVMSG   DS    CL79    10    2   79  L  U H             T        Y  105         
PRVMSGX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL31    11    2   31  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    11   34   13  L  P H             T        Y              
         DS    CL8                                                              
         DS    CL33    11   48   33  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12    2    1  A  P N             T        Y              
PRVTXT1H DS    CL8                                                              
PRVTXT1  DS    CL70    12    6   70  L  U N             T        Y  106         
PRVTXT1X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     12   80    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     13    2    1  A  P N             T        Y              
PRVTXT2H DS    CL8                                                              
PRVTXT2  DS    CL70    13    6   70  L  U N             T        Y  106         
PRVTXT2X DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13   80    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    14    6   70  L  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     14   80    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    15    6   70  L  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15   80    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    16    6   70  L  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     16   80    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    17    6   70  L  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   80    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     18    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    18    6   70  L  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     18   80    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    19    6   70  L  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   80    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    20    6   70  L  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     20   80    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21    2    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    21    6   70  L  U N             T        Y  106         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21   80    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22    2    1  A  P N             T        Y              
PRVTXTLH DS    CL8                                                              
PRVTXTL  DS    CL70    22    6   70  L  U N             T        Y  106         
PRVTXTLX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     22   80    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL79    23    2   79  A  P N             T        Y              
PRVTENDH DS    CL8                                                              
PRVTEND  DS    CL1     24    2    1  L  P N             T        Y              
PRVLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
PRVWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1880 BYTES                            
