*          DATA SET CTGENE6DS  AT LEVEL 003 AS OF 06/30/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BE6D      DATE 06/30/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      5    2    9  A  P H             T        Y              
DCRREQH  DS    CL8                                                              
DCRREQ   DS    CL3      5   27    3  A  U N             T        Y   50         
DCRREQX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      6    2    9  A  P H             T        Y              
DCRWHENH DS    CL8                                                              
DCRWHEN  DS    CL10     6   27   10  A  U N             T        Y   51         
DCRWHENX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     7    2   14  A  P N             T        Y              
DCRDESTH DS    CL8                                                              
DCRDEST  DS    CL10     7   27   10  A  U N             T        Y   52         
DCRDESTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      8    2    6  A  P H             T        Y              
DCRSYSH  DS    CL8                                                              
DCRSYS   DS    CL7      8   27    7  A  U N             T        Y  100         
DCRSYSX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      8   41    7  A  P N             T        Y              
DCRQNMEH DS    CL8                                                              
DCRQNME  DS    CL8      8   50    8  A  U N             T        Y  102         
DCRQNMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      9    2    8  A  P N             T        Y              
DCRLNGFH DS    CL8                                                              
DCRLNGF  DS    CL11     9   27   11  A  U N             T        Y  101         
DCRLNGFX DS    CL8                                                              
DCRLNG1H DS    CL8                                                              
DCRLNG1  DS    CL13    10   27   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    11   27   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    12   27   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    13   27   13  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    14   27   13  A  P N             T        Y              
DCRLNGXH DS    CL8                                                              
DCRLNGX  DS    CL13    15   27   13  A  P N             T        Y              
DCRLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
DCRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 376  BYTES                            
