*          DATA SET CTGENAED   AT LEVEL 002 AS OF 08/30/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BAED      DATE 08/30/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      5    2    9  L   P    H         T        Y              
REPREQH  DS    CL8                                                              
REPREQ   DS    CL3      5   27    3  A   U    N         T        Y   50         
REPREQX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      6    2    9  L   P    H         T        Y              
REPWHENH DS    CL8                                                              
REPWHEN  DS    CL10     6   27   10  A   U    N         T        Y   51         
REPWHENX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     7    2   14  L   P    N         T        Y              
REPDESTH DS    CL8                                                              
REPDEST  DS    CL10     7   27   10  A   U    N         T        Y   52         
REPDESTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     8    2   10  L   P    N         T        Y              
REPAGYH  DS    CL8                                                              
REPAGY   DS    CL8      8   27    8  A   U    N         T        Y  100         
REPAGYX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL10     9    2   10  L   P    N         T        Y              
REPTYPH  DS    CL8                                                              
REPTYP   DS    CL3      9   27    3  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    10    2   10  L   P    N         T        Y              
REPNAMH  DS    CL8                                                              
REPNAM   DS    CL18    10   27   18  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    11    2   10  L   P    N         T        Y              
REPSYSH  DS    CL8                                                              
REPSYS   DS    CL8     11   27    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12   27    1  A   U    N         T        Y              
REPLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
REPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 288  BYTES                            
