*          DATA SET CTGENFAD   AT LEVEL 001 AS OF 08/28/14                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BFAD      DATE 08/28/14                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P H             T        Y              
IDSIDH   DS    XL8                                                              
IDSID    DS    CL8      5   15    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL6      5   27    6  A  P H             T        Y              
IDSSYSH  DS    XL8                                                              
IDSSYS   DS    CL8      5   41    8  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL3      5   55    3  A  P N             T        Y              
IDSIDNH  DS    XL8                                                              
IDSIDN   DS    CL5      5   60    5  A  U N             T        Y              
IDSUSEDH DS    XL8                                                              
IDSUSED  DS    CL12     5   68   12  A  P N             T        Y              
IDSIDSYH DS    XL8                                                              
IDSIDSY  DS    CL18     6   55   18  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL9      7    2    9  A  P N             T        Y              
IDSAGYAH DS    XL8                                                              
IDSAGYA  DS    CL2      7   15    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL8      7   27    8  A  P N             T        Y              
IDSLANGH DS    XL8                                                              
IDSLANG  DS    CL13     7   41   13  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12     7   55   12  A  P N             T        Y              
IDSPQIH  DS    XL8                                                              
IDSPQI   DS    CL10     7   68   10  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12     8    2   12  A  P N             T        Y              
IDSPIDH  DS    XL8                                                              
IDSPID   DS    CL10     8   15   10  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12     8   27   12  A  P N             T        Y              
IDSACCRH DS    XL8                                                              
IDSACCR  DS    CL2      8   41    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12     8   55   12  A  P N             T        Y              
IDSCWCH  DS    XL8                                                              
IDSCWC   DS    CL1      8   68    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12     9    2   12  A  P N             T        Y              
IDSPPUH  DS    XL8                                                              
IDSPPU   DS    CL1      9   15    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12     9   27   12  A  P N             T        Y              
IDSATOUH DS    XL8                                                              
IDSATOU  DS    CL4      9   41    4  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL9     10    2    9  A  P N             T        Y              
IDSIDTH  DS    XL8                                                              
IDSIDT   DS    CL9     10   15    9  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6     10   27    6  A  P N             T        Y              
IDSAFPH  DS    XL8                                                              
IDSAFP   DS    CL10    10   41   10  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL10    11    2   10  A  P N             T        Y              
IDSID1H  DS    XL8                                                              
IDSID1   DS    CL65    11   15   65  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     12    2    7  A  P N             T        Y              
IDSID2H  DS    XL8                                                              
IDSID2   DS    CL65    12   15   65  A  U H             T        Y              
IDSID3H  DS    XL8                                                              
IDSID3   DS    CL65    13   15   65  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     14    2    7  A  P N             T        Y              
IDSPE1H  DS    XL8                                                              
IDSPE1   DS    CL65    14   15   65  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL10    15    2   10  A  P N             T        Y              
IDSPE2H  DS    XL8                                                              
IDSPE2   DS    CL65    15   15   65  A  U N             T        Y              
IDSSHDH  DS    XL8                                                              
IDSSHD   DS    CL78    16    2   78  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL12    17    2   12  A  P N             T        Y              
IDSSEAGH DS    XL8                                                              
IDSSEAG  DS    CL10    17   15   10  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL11    18    2   11  A  P N             T        Y              
IDSSPWDH DS    XL8                                                              
IDSSPWD  DS    CL1     18   15    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    19    2   12  A  P N             T        Y              
IDSACCSH DS    XL8                                                              
IDSACCS  DS    CL16    19   15   16  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL8     20    2    8  A  P N             T        Y              
IDSPRIH  DS    XL8                                                              
IDSPRI   DS    CL4     20   15    4  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     21    2    7  A  P N             T        Y              
IDSPA1H  DS    XL8                                                              
IDSPA1   DS    CL65    21   15   65  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL11    22    2   11  A  P N             T        Y              
IDSPA2H  DS    XL8                                                              
IDSPA2   DS    CL65    22   15   65  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL11    23    2   11  A  P N             T        Y              
IDSPA3H  DS    XL8                                                              
IDSPA3   DS    CL65    23   15   65  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1     24   15    1  A  U N             T        Y              
IDSLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
IDSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1400 BYTES                            
