*          DATA SET CTGENB2AD  AT LEVEL 001 AS OF 03/06/90                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BB2D      DATE 03/06/90                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      5    2    9  A   P    H         T        Y              
REQREQH  DS    CL8                                                              
REQREQ   DS    CL3      5   27    3  A   U    N         T        Y   50         
REQREQX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      6    2    9  A   P    H         T        Y              
REQWHENH DS    CL8                                                              
REQWHEN  DS    CL10     6   27   10  A   U    N         T        Y   51         
REQWHENX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     7    2   14  A   P    N         T        Y              
REQDESTH DS    CL8                                                              
REQDEST  DS    CL10     7   27   10  A   U    N         T        Y   52         
REQDESTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL8      9    2    8  A   P    N         T        Y              
REQTERMH DS    CL8                                                              
REQTERM  DS    CL8      9   12    8  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL4      9   22    4  A   P    N         T        Y              
REQPWRDH DS    CL8                                                              
REQPWRD  DS    CL10     9   28   10  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL7      9   39    7  A   P    N         T        Y              
REQTAPLH DS    CL8                                                              
REQTAPL  DS    CL8      9   48    8  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL6     11    2    6  A   P    N         T        Y              
REQDEVH  DS    CL8                                                              
REQDEV   DS    CL8     11   12    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     11   22    4  A   P    N         T        Y              
REQTYPH  DS    CL8                                                              
REQTYP   DS    CL8     11   28    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7     11   39    7  A   P    N         T        Y              
REQCTRYH DS    CL8                                                              
REQCTRY  DS    CL6     11   48    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6     11   57    6  A   P    N         T        Y              
REQAGYH  DS    CL8                                                              
REQAGY   DS    CL2     11   65    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6     11   70    6  A   P    N         T        Y              
REQOFCH  DS    CL8                                                              
REQOFC   DS    CL2     11   78    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     13    2    4  A   P    N         T        Y              
REQLUIDH DS    CL8                                                              
REQLUID  DS    CL4     13   12    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     13   22    4  A   P    N         T        Y              
REQNODEH DS    CL8                                                              
REQNODE  DS    CL8     13   28    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     13   39    4  A   P    N         T        Y              
REQLINEH DS    CL8                                                              
REQLINE  DS    CL4     13   48    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     13   57    2  A   P    N         T        Y              
REQCUH   DS    CL8                                                              
REQCU    DS    CL2     13   65    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     13   70    2  A   P    N         T        Y              
REQDVH   DS    CL8                                                              
REQDV    DS    CL2     13   78    2  A   U    N         T        Y              
REQLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
REQWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 480  BYTES                            
