*          DATA SET CTGENEFD   AT LEVEL 001 AS OF 04/22/96                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BEFD      DATE 04/22/96                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL10     5    2   10  L  P N             T        Y              
CURCURH  DS    CL8                                                              
CURCUR   DS    CL3      5   13    3  A  U H             T        Y  100         
CURCURX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL13     7    2   13  L  P H             T        Y              
CURFULNH DS    CL8                                                              
CURFULN  DS    CL35     7   16   35  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13     8    2   13  L  P H             T        Y              
CURUNITH DS    CL8                                                              
CURUNIT  DS    CL5      8   16    5  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13     9    2   13  L  P H             T        Y              
CURDECH  DS    CL8                                                              
CURDEC   DS    CL1      9   16    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    10    2   13  L  P H             T        Y              
CURPFXH  DS    CL8                                                              
CURPFX   DS    CL3     10   16    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    11    2   13  L  P H             T        Y              
CURSFXH  DS    CL8                                                              
CURSFX   DS    CL3     11   16    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    12    2   13  L  P H             T        Y              
CURMINH  DS    CL8                                                              
CURMIN   DS    CL7     12   16    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    13    2   13  L  P H             T        Y              
CURMAXH  DS    CL8                                                              
CURMAX   DS    CL7     13   16    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL13    14    2   13  L  P H             T        Y              
CURMAXBH DS    CL8                                                              
CURMAXB  DS    CL10    14   16   10  A  U N             T        Y              
CURTABH  DS    CL8                                                              
CURTAB   DS    CL1     15    2    1  A  U N             T        Y              
CURLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
CURWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 352  BYTES                            
