*          DATA SET CTGENFFD   AT LEVEL 004 AS OF 06/21/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BFFD      DATE 06/21/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
GENMSGH  DS    CL8                                                              
GENMSG   DS    CL60     1    2   60  L  P H             T        Y              
GENSRVH  DS    CL8                                                              
GENSRV   DS    CL17     1   63   17  A  U N        M    T        Y              
         DS    CL8                                                              
         DS    CL6      2    2    6  L  P N             T        Y              
GENRECH  DS    CL8                                                              
GENREC   DS    CL8      2   10    8  A  U H        M    T    I   Y              
         DS    CL8                                                              
         DS    CL6      2   20    6  L  P N             T        Y              
GENACTH  DS    CL8                                                              
GENACT   DS    CL8      2   27    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL3      2   37    3  L  P N             T        Y              
GENKEYH  DS    CL8                                                              
GENKEY   DS    CL39     2   41   39  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      3    2    7  L  P N             T        Y              
GENOPTH  DS    CL8                                                              
GENOPT   DS    CL70     3   10   70  A  U N             T        Y              
GENTABH  DS    CL8                                                              
GENTAB   DS    CL1      4   10    1  A  U N             T        Y              
         DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
         DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 320  BYTES                            
