*          DATA SET CTGENBBD   AT LEVEL 001 AS OF 12/15/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BBBD      DATE 12/15/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      5    2    9  A  P H             T        Y              
REPREQH  DS    CL8                                                              
REPREQ   DS    CL3      5   27    3  A  U N             T        Y   50         
REPREQX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      6    2    9  A  P H             T        Y              
REPWHENH DS    CL8                                                              
REPWHEN  DS    CL10     6   27   10  A  U N             T        Y   51         
REPWHENX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     7    2   14  A  P N             T        Y              
REPDESTH DS    CL8                                                              
REPDEST  DS    CL10     7   27   10  A  U N             T        Y   52         
REPDESTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
REPTYPH  DS    CL8                                                              
REPTYP   DS    CL6      8   27    6  A  U N             T        Y  150         
REPTYPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
REPAPPH  DS    CL8                                                              
REPAPP   DS    CL8      9   27    8  A  U H             T        Y  151         
REPAPPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     10    2    1  A  U N             T        Y              
REPLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
REPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 224  BYTES                            
