*          DATA SET CTGENEDD   AT LEVEL 001 AS OF 01/28/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BEDD      DATE 01/28/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL1      4   79    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17     5    2   17  L   P    H         T        Y              
NICVATH  DS    CL8                                                              
NICVAT   DS    CL10     5   29   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL24     6    2   24  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL76     7    2   76  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL6      8   16    6  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL7      8   31    7  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL9      8   46    9  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL8      9   15    8  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL8      9   31    8  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL36     9   42   36  A   P    H         T        Y              
NICEEL1H DS    CL8                                                              
NICEEL1  DS    CL10    10    2   10  L   P    H         T        Y              
NICWEL1H DS    CL8                                                              
NICWEL1  DS    CL10    10   13   10  A   U    N         T        Y              
NICMEL1H DS    CL8                                                              
NICMEL1  DS    CL10    10   29   10  A   U    N         T        Y              
NICEEA1H DS    CL8                                                              
NICEEA1  DS    CL5     10   42    5  A   U    N         T        Y              
NICEEB1H DS    CL8                                                              
NICEEB1  DS    CL5     10   48    5  A   U    N         T        Y              
NICEEC1H DS    CL8                                                              
NICEEC1  DS    CL5     10   54    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    11    2   10  L   P    H         T        Y              
NICWEL2H DS    CL8                                                              
NICWEL2  DS    CL10    11   13   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    11   29   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     11   42    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     11   48    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     11   54    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    12    2   10  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL10    12   13   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    12   29   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     12   42    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     12   48    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     12   54    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    13    2   10  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL10    13   13   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    13   29   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     13   42    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     13   48    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     13   54    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    14    2   10  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL10    14   13   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    14   29   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     14   42    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     14   48    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     14   54    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    15    2   10  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL10    15   13   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    15   29   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     15   42    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     15   48    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     15   54    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16    2    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL6     16   16    6  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL7     16   31    7  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL9     16   46    9  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL8     17   15    8  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL8     17   31    8  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL36    17   42   36  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL6     18   17    6  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL6     18   31    6  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL36    18   42   36  A   P    H         T        Y              
NICEEL2H DS    CL8                                                              
NICEEL2  DS    CL10    19    2   10  L   P    H         T        Y              
NICWEL3H DS    CL8                                                              
NICWEL3  DS    CL10    19   13   10  A   U    N         T        Y              
NICMEL3H DS    CL8                                                              
NICMEL3  DS    CL10    19   29   10  A   U    N         T        Y              
NICEEA3H DS    CL8                                                              
NICEEA3  DS    CL5     19   42    5  A   U    N         T        Y              
NICEEB3H DS    CL8                                                              
NICEEB3  DS    CL5     19   48    5  A   U    N         T        Y              
NICEEC3H DS    CL8                                                              
NICEEC3  DS    CL5     19   54    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    20    2   10  L   P    H         T        Y              
NICWEL4H DS    CL8                                                              
NICWEL4  DS    CL10    20   13   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    20   29   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     20   42    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     20   48    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     20   54    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    21    2   10  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL10    21   13   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    21   29   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     21   42    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     21   48    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     21   54    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    22    2   10  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL10    22   13   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    22   29   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     22   42    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     22   48    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     22   54    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    23    2   10  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL10    23   13   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    23   29   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     23   42    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     23   48    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     23   54    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    24    2   10  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL10    24   13   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    24   29   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     24   42    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     24   48    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     24   54    5  A   U    N         T        Y              
NICLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
NICWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1616 BYTES                            
