*          DATA SET CTGEND9D   AT LEVEL 002 AS OF 06/22/15                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BD9D      DATE 06/22/15                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
LSTIDH   DS    XL8                                                              
LSTID    DS    CL8      5   10    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      5   20    6  A  P N             T        Y              
LSTSYSH  DS    XL8                                                              
LSTSYS   DS    CL7      5   27    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7      5   37    7  A  P N             T        Y              
LSTPGMH  DS    XL8                                                              
LSTPGM   DS    CL7      5   51    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      6    2    6  A  P N             T        Y              
LSTAGYAH DS    XL8                                                              
LSTAGYA  DS    CL2      6   10    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      6   20    6  A  P N             T        Y              
LSTPWDH  DS    XL8                                                              
LSTPWD   DS    CL1      6   27    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL13     6   37   13  A  P N             T        Y              
LSTCIDH  DS    XL8                                                              
LSTCID   DS    CL10     6   51   10  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6      7    2    6  A  P N             T        Y              
LSTLUIDH DS    XL8                                                              
LSTLUID  DS    CL8      7   10    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL10     7   20   10  A  P N             T        Y              
LSTPWRH  DS    XL8                                                              
LSTPWR   DS    CL4      7   31    4  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL10     7   37   10  A  P N             T        Y              
LSTLFCH  DS    XL8                                                              
LSTLFC   DS    CL2      7   51    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL5      7   61    5  A  P N             T        Y              
LSTDARH  DS    XL8                                                              
LSTDAR   DS    CL8      7   67    8  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL78     9    2   78  A  P H             T        Y              
         DS    XL8                                                              
         DS    CL78    10    2   78  A  P H             T        Y              
LSTACT1H DS    XL8                                                              
LSTACT1  DS    CL3     11    2    3  A  U N             T        Y              
LSTLIN1H DS    XL8                                                              
LSTLIN1  DS    CL74    11    6   74  A  P N             T        Y              
LSTACT2H DS    XL8                                                              
LSTACT2  DS    CL3     12    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    12    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
         DS    XL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    XL8                                                              
         DS    CL74    23    6   74  A  P N             T        Y              
LSTLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1680 BYTES                            
