*          DATA SET CTGENTOU   AT LEVEL 001 AS OF 05/10/96                      
*                                                                               
*              DSECT TO COVER TIME OUT ELEMENT                                  
         SPACE 1                                                                
CTTOUD   DSECT                                                                  
CTTOUEL  DS    CL1       X         ELEMENT CODE X'BB'                           
CTTOUELQ EQU   X'BB'                                                            
CTTOULEN DS    CL1       X         ELEMENT LENGTH                               
*                                                                               
CTTOUADV DS    XL2       X         ADV TMEOUT 1 - 3600 MINUTES                  
         DS    XL8       C         N/D                                          
CTTOULNQ EQU   *-CTTOUD                                                         
         SPACE 1                                                                
         EJECT                                                                  
