*          DATA SET CTGENC1D   AT LEVEL 010 AS OF 05/14/99                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BC1D      DATE 05/14/99                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
IDUTBARH DS    CL8                                                              
IDUTBAR  DS    CL78     5    2   78  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL78     6    2   78  A  P H             T        Y              
IDULUOAH DS    CL8                                                              
IDULUOA  DS    CL8      7    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      7   11    1  A  P N             T        Y              
IDULUNAH DS    CL8                                                              
IDULUNA  DS    CL8      7   13    8  A  U N             T        Y              
IDULUOBH DS    CL8                                                              
IDULUOB  DS    CL8      7   27    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      7   36    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      7   38    8  A  U N             T        Y              
IDULUOCH DS    CL8                                                              
IDULUOC  DS    CL8      7   52    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      7   61    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      7   63    8  A  U N             T        Y              
IDULUODH DS    CL8                                                              
IDULUOD  DS    CL8      8    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8   11    1  A  P N             T        Y              
IDULUN2H DS    CL8                                                              
IDULUN2  DS    CL8      8   13    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      8   27    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8   36    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      8   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      8   52    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      8   61    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      8   63    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      9    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      9   11    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      9   13    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      9   27    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      9   36    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      9   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      9   52    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1      9   61    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      9   63    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     10    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   11    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   13    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   27    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   36    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   52    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   61    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     10   63    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   11    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   13    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   27    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   36    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   52    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   61    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     11   63    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   11    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   13    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   27    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   36    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   52    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   61    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     12   63    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   11    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   13    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   27    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   36    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   52    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   61    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     13   63    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   11    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   13    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   27    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   36    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   52    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   61    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     14   63    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   11    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   13    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   27    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   36    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   52    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   61    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     15   63    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   11    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   13    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   27    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   36    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   52    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   61    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     16   63    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   11    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   13    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   27    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   36    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   52    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   61    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     17   63    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   11    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   13    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   27    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   36    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   52    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   61    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     18   63    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   11    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   13    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   27    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   36    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   52    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   61    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     19   63    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   11    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   13    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   27    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   36    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   52    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   61    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     20   63    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   11    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   13    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   27    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   36    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   52    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   61    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     21   63    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22    2    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   11    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   13    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   27    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   36    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   38    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   52    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL1     22   61    1  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8     22   63    8  A  U N             T        Y              
IDUBBARH DS    CL8                                                              
IDUBBAR  DS    CL78    23    2   78  A  P H             T        Y              
IDUMSGH  DS    CL8                                                              
IDUMSG   DS    CL60    24    2   60  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL3     24   64    3  A  P H             T        Y              
IDUOKH   DS    CL8                                                              
IDUOK    DS    CL1     24   68    1  A  U N             T        Y              
IDULAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
IDUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2320 BYTES                            
