*          DATA SET CTGENC0D   AT LEVEL 007 AS OF 08/21/97                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BC0D      DATE 08/21/97                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      5    2    9  A  P H             T        Y              
REPREQH  DS    CL8                                                              
REPREQ   DS    CL3      5   27    3  A  U N             T        Y   50         
REPREQX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      6    2    9  A  P H             T        Y              
REPWHENH DS    CL8                                                              
REPWHEN  DS    CL10     6   27   10  A  U N             T        Y   51         
REPWHENX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     7    2   14  A  P N             T        Y              
REPDESTH DS    CL8                                                              
REPDEST  DS    CL10     7   27   10  A  U N             T        Y   52         
REPDESTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
REPOTYPH DS    CL8                                                              
REPOTYP  DS    CL6      8   27    6  A  U N             T        Y  150         
REPOTYPX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL12    10    2   12  A  P N             T        Y              
REPUIDH  DS    CL8                                                              
REPUID   DS    CL10    10   27   10  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL12    11    2   12  A  P N             T        Y              
REPNAMH  DS    CL8                                                              
REPNAM   DS    CL4     11   27    4  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL12    12    2   12  A  P N             T        Y              
REPLUIDH DS    CL8                                                              
REPLUID  DS    CL8     12   27    8  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1     13   27    1  A  U N             T        Y              
REPLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
REPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 288  BYTES                            
