*          DATA SET CTGENB6D   AT LEVEL 001 AS OF 04/04/05                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BB6D      DATE 04/04/05                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    XL8                                                              
         DS    CL9      5    2    9  A  P H             T        Y              
REPREQH  DS    XL8                                                              
REPREQ   DS    CL3      5   27    3  A  U N             T        Y   50         
REPREQX  DS    XL8                                                              
         DS    XL8                                                              
         DS    CL9      6    2    9  A  P H             T        Y              
REPWHENH DS    XL8                                                              
REPWHEN  DS    CL10     6   27   10  A  U N             T        Y   51         
REPWHENX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL14     7    2   14  A  P N             T        Y              
REPDESTH DS    XL8                                                              
REPDEST  DS    CL10     7   27   10  A  U N             T        Y   52         
REPDESTX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
REPOTYPH DS    XL8                                                              
REPOTYP  DS    CL6      8   27    6  A  U N             T        Y  150         
REPOTYPX DS    XL8                                                              
         DS    XL8                                                              
         DS    CL6     10    2    6  A  P N             T        Y              
REPSYSTH DS    XL8                                                              
REPSYST  DS    CL7     10   10    7  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     10   20    7  A  P N             T        Y              
REPPRGMH DS    XL8                                                              
REPPRGM  DS    CL2     10   28    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL9     10   32    9  A  P N             T        Y              
REPORGNH DS    XL8                                                              
REPORGN  DS    CL10    10   43   10  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    10   55   12  A  P N             T        Y              
REPPROTH DS    XL8                                                              
REPPROT  DS    CL10    10   69   10  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
REPFRMCH DS    XL8                                                              
REPFRMC  DS    CL2     11   10    2  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     11   20    7  A  P N             T        Y              
REPATYPH DS    XL8                                                              
REPATYP  DS    CL3     11   28    3  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL9     11   32    9  A  P N             T        Y              
REPDSTIH DS    XL8                                                              
REPDSTI  DS    CL10    11   43   10  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    11   55   12  A  P N             T        Y              
REPOUTPH DS    XL8                                                              
REPOUTP  DS    CL10    11   69   10  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6     12    2    6  A  P N             T        Y              
REPPRSCH DS    XL8                                                              
REPPRSC  DS    CL1     12   10    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     12   20    7  A  P N             T        Y              
REPPRPTH DS    XL8                                                              
REPPRPT  DS    CL1     12   28    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL9     12   32    9  A  P N             T        Y              
REPPRPOH DS    XL8                                                              
REPPRPO  DS    CL1     12   43    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    12   55   12  A  P N             T        Y              
REPRCLAH DS    XL8                                                              
REPRCLA  DS    CL1     12   69    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL5     13    2    5  A  P N             T        Y              
REPSPHSH DS    XL8                                                              
REPSPHS  DS    CL1     13   10    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL7     13   20    7  A  P N             T        Y              
REPSJCLH DS    XL8                                                              
REPSJCL  DS    CL1     13   28    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL6     13   32    6  A  P N             T        Y              
REPAFPH  DS    XL8                                                              
REPAFP   DS    CL1     13   43    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL12    13   55   12  A  P N             T        Y              
REPRTNCH DS    XL8                                                              
REPRTNC  DS    CL1     13   69    1  A  U H             T        Y              
         DS    XL8                                                              
         DS    CL1     14   27    1  A  U N             T        Y              
REPLAST  DS    XL1                                                              
         DS    XL2    INDICS=1                                                  
REPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 632  BYTES                            
