*          DATA SET CTGENA5D   AT LEVEL 001 AS OF 05/20/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BA5D      DATE 20/05/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      5    2    9  A  P H             T        Y              
REPREQH  DS    CL8                                                              
REPREQ   DS    CL3      5   20    3  A  U N             T        Y   50         
REPREQX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      6    2    9  A  P H             T        Y              
REPWHENH DS    CL8                                                              
REPWHEN  DS    CL10     6   20   10  A  U N             T        Y   51         
REPWHENX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     7    2   14  A  P N             T        Y              
REPDESTH DS    CL8                                                              
REPDEST  DS    CL10     7   20   10  A  U N             T        Y   52         
REPDESTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     8    2   14  A  P N             T        Y              
REPTYPH  DS    CL8                                                              
REPTYP   DS    CL1      8   20    1  A  U N             T        Y   53         
REPTYPX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      9    2    6  A  P N             T        Y              
REPNAMEH DS    CL8                                                              
REPNAME  DS    CL10     9   20   10  A  U N             T        Y   54         
REPNAMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     10   20    1  A  U N             T        Y              
REPLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
REPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 224  BYTES                            
