*          DATA SET CTGENDARE  AT LEVEL 005 AS OF 12/27/94                      
***********************************************************************         
* RECORD SAVED BY SRDAR00 TO KEEP TRACK OF WHAT WAS LAST PROCESSED BY           
* IT EVERY 30 MINUTES.                                                          
***********************************************************************         
CTDARREC DSECT                                                                  
CTDARKEY DS    0CL25                                                            
CTDARTYP DS    XL1                 TYPE                                         
CTDARTYQ EQU   X'05'                                                            
CTDARSUB DS    XL1                 SUBTYPE                                      
CTDARSBQ EQU   X'08'                                                            
         DS    XL10                SPARE                                        
CTDARSYS DS    XL1                 FACPACK SYSTEM NUMBER                        
         DS    XL12                SPARE                                        
CTDARLEN DS    XL2                 RECORD LENGTH                                
CTDARSTA DS    XL1                 RECORD STATUS                                
CTDAR1ST DS    0X                  A(FIRST ELEMENT)                             
*                                                                               
CTDARELD DSECT                                                                  
CTDAREL  DS    XL1                 ELEMENT FOR SAVED EDICT INFO                 
CTDARELQ EQU   X'10'                                                            
CTDARLN  DS    XL1                 LENGTH OF THE ELEMENT                        
CTDARDAT DS    XL3                 DATE OF LAST SAVE                            
CTDAREDA DS    XL4                 DISK ADDRESS FOR EDICTA                      
CTDAREDR DS    XL4                 DISK ADDRESS FOR EDICTR                      
CTDARLNQ EQU   *-CTDARELD          LENGTH OF THE ELEMENT                        
