*          DATA SET CTGENA6D   AT LEVEL 001 AS OF 05/23/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BA6D      DATE 23/05/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      5    2    9  A  P H             T        Y              
UPDREQH  DS    CL8                                                              
UPDREQ   DS    CL3      5   20    3  A  U N             T        Y   50         
UPDREQX  DS    CL8                                                              
         DS    CL8                                                              
         DS    CL9      6    2    9  A  P H             T        Y              
UPDWHENH DS    CL8                                                              
UPDWHEN  DS    CL10     6   20   10  A  U N             T        Y   51         
UPDWHENX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL14     7    2   14  A  P N             T        Y              
UPDDESTH DS    CL8                                                              
UPDDEST  DS    CL10     7   20   10  A  U N             T        Y   52         
UPDDESTX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL6      8    2    6  A  P N             T        Y              
UPDNAMEH DS    CL8                                                              
UPDNAME  DS    CL10     8   20   10  A  U N             T        Y   54         
UPDNAMEX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      9   20    1  A  U N             T        Y              
UPDLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
UPDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 184  BYTES                            
