*          DATA SET CTGENC5D   AT LEVEL 001 AS OF 01/28/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BC5D      DATE 01/28/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      5    2    9  L   P    H         T        Y              
LSTAGRH  DS    CL8                                                              
LSTAGR   DS    CL1      5   12    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      5   78    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3      6    2    3  L   P    H         T        Y              
         DS    CL8                                                              
         DS    CL9      6    8    9  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL10     6   18   10  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL5      6   28    5  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL7      6   44    7  L   P    N         T        Y              
LSTSEL1H DS    CL8                                                              
LSTSEL1  DS    CL3      7    2    3  A   U    H         T        Y              
LSTLIN1H DS    CL8                                                              
LSTLIN1  DS    CL72     7    7   72  A   P    H         T        Y              
LSTSEL2H DS    CL8                                                              
LSTSEL2  DS    CL3      8    2    3  A   U    H         T        Y              
LSTLIN2H DS    CL8                                                              
LSTLIN2  DS    CL72     8    7   72  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3      9    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL72     9    7   72  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3     10    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL72    10    7   72  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3     11    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL72    11    7   72  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL72    12    7   72  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL72    13    7   72  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL72    14    7   72  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL72    15    7   72  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL72    16    7   72  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL72    17    7   72  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL72    18    7   72  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL72    19    7   72  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL72    20    7   72  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL72    21    7   72  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL72    22    7   72  A   P    H         T        Y              
LSTLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1568 BYTES                            
