*          DATA SET CTGENA3D   AT LEVEL 001 AS OF 08/16/95                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BA3D      DATE 08/16/95                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  L  P N             T        Y              
LSTPTYH  DS    CL8                                                              
LSTPTY   DS    CL1      5   10    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   20    8  L  P N             T        Y              
LSTPSTH  DS    CL8                                                              
LSTPST   DS    CL1      5   29    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   37    8  L  P N             T        Y              
LSTSYSH  DS    CL8                                                              
LSTSYS   DS    CL7      5   46    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   55    8  L  P N             T        Y              
LSTPNMH  DS    CL8                                                              
LSTPNM   DS    CL8      5   64    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL5      6    2    5  L  P N             T        Y              
LSTLANGH DS    CL8                                                              
LSTLANG  DS    CL13     6   20   13  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL79     8    2   79  A  P H             T        Y              
         DS    CL8                                                              
         DS    CL79     9    2   79  A  P H             T        Y              
LSTACT1H DS    CL8                                                              
LSTACT1  DS    CL3     10    2    3  A  U N             T        Y              
LSTLIN1H DS    CL8                                                              
LSTLIN1  DS    CL74    10    6   74  A  P N             T        Y              
LSTACT2H DS    CL8                                                              
LSTACT2  DS    CL3     11    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    11    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     12    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    12    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     13    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    13    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     14    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    14    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     15    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    15    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     16    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    16    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     17    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    17    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     18    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    18    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     19    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    19    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     20    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    20    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     21    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    21    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     22    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    22    6   74  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL3     23    2    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL74    23    6   74  A  P N             T        Y              
LSTLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1632 BYTES                            
