*          DATA SET CTGENF3D   AT LEVEL 008 AS OF 08/26/94                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA0BF3D      DATE 08/26/94                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL5      5    2    5  L  P H             T        Y              
EASEMEDH DS    CL8                                                              
EASEMED  DS    CL1      5   10    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL7      5   20    7  L  P H             T        Y              
EASESTAH DS    CL8                                                              
EASESTA  DS    CL7      5   28    7  A  U N             T        Y              
EASTENDH DS    CL8                                                              
EASTEND  DS    CL1      6    2    1  A  U N             T        Y              
EASLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
EASWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 64   BYTES                            
