*          DATA SET CTGLUFFD   AT LEVEL 006 AS OF 01/19/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TE10FFD      DATE 01/19/87                 
         SPACE 1                                                                
TE10FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
GLUHEADH DS    CL8                                                              
GLUHEAD  DS    CL60     1    2   60  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL17     1   63   17  A   U    N         T        Y              
GLUPRMTH DS    CL8                                                              
GLUPRMT  DS    CL32     3    2   32  A   P    N         T        Y              
GLUGUESH DS    CL8                                                              
GLUGUES  DS    CL1      3   35    1  A   U    N         T        Y    4         
GLUGUESX DS    CL8                                                              
GLUCORNH DS    CL8                                                              
GLUCORN  DS    CL1      5    3    1  A   P    N         T        Y    1         
GLUCORNX DS    CL8                                                              
GLUCURSH DS    CL8                                                              
GLUCURS  DS    CL1      5    7    1  A   U    N         T    I   Y    2         
GLUCURSX DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   11    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   15    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   19    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   23    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   27    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   31    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   35    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      5   39    1  A   P    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL33     6    5   33  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL35     6   46   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      7    3    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7    5    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      7    7    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   11    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   15    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   19    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   23    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   27    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   31    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   35    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      7   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      7   39    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL35     7   46   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      8    5    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      8   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL35     8   46   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9    3    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      9    5    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9    7    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      9   11    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      9   15    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      9   19    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      9   23    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      9   27    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      9   31    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      9   35    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1      9   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9   39    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL35     9   46   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10    5    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL35    10   46   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11    3    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     11    5    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11    7    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     11   11    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     11   15    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     11   19    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     11   23    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     11   27    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     11   31    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     11   35    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     11   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     11   39    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL35    11   46   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12    5    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     12   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL35    12   46   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13    3    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13    5    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13    7    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13   11    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13   15    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13   19    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13   23    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13   27    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13   31    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13   35    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     13   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   39    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL35    13   46   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14    5    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL35    14   46   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15    3    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15    5    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15    7    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15   11    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15   15    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15   19    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15   23    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15   27    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15   31    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15   35    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     15   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   39    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL35    15   46   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16    5    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL35    16   46   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17    3    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17    5    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17    7    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   11    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   15    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   19    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   23    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   27    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   31    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   35    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     17   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     17   39    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL35    17   46   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18    5    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     18   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL35    18   46   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19    3    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19    5    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19    7    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   11    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   15    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   19    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   23    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   27    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   31    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   35    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     19   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     19   39    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL35    19   46   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20    5    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     20   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL35    20   46   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21    3    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21    5    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21    7    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21   11    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21   15    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21   19    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21   23    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21   27    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21   31    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21   35    1  A   U    N         T        Y    3         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     21   37    1  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     21   39    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL35    21   46   35  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL33    22    5   33  A   P    N         T        Y              
GLUSCORH DS    CL8                                                              
GLUSCOR  DS    CL35    22   46   35  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL1     23    3    1  A   P    N         T        Y    1         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     23    7    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     23   11    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     23   15    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     23   19    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     23   23    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     23   27    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     23   31    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     23   35    1  A   U    N         T        Y    2         
         DS    CL8                                                              
         DS    CL8                                                              
         DS    CL1     23   39    1  A   P    N         T        Y    1         
         DS    CL8                                                              
GLULAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
GLUWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 2936 BYTES                            
