*          DATA SET CTLFMDFD   AT LEVEL 001 AS OF 07/19/93                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA02DFD      DATE 07/19/93                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      4    2    9  A  P N             T        Y              
SYSALPHH DS    CL8                                                              
SYSALPH  DS    CL2      4   15    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      5    2    7  A  P N             T        Y              
SYSCTRYH DS    CL8                                                              
SYSCTRY  DS    CL11     5   15   11  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL12     6    2   12  A  P N             T        Y              
SYSUSERH DS    CL8                                                              
SYSUSER  DS    CL10     6   15   10  A  U H             T        Y              
SYSUSNMH DS    CL8                                                              
SYSUSNM  DS    CL33     6   30   33  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL8      7    2    8  A  P N             T        Y              
SYSGRUPH DS    CL8                                                              
SYSGRUP  DS    CL10     7   15   10  A  U H             T        Y              
SYSGRNMH DS    CL8                                                              
SYSGRNM  DS    CL33     7   30   33  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL10     8    2   10  A  P N             T        Y              
SYSHOLDH DS    CL8                                                              
SYSHOLD  DS    CL10     8   15   10  A  U H             T        Y              
SYSHONMH DS    CL8                                                              
SYSHONM  DS    CL33     8   30   33  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11     9    2   11  A  P N             T        Y              
SYSTYPEH DS    CL8                                                              
SYSTYPE  DS    CL1      9   15    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL12    10    2   12  A  P N             T        Y              
SYSSECAH DS    CL8                                                              
SYSSECA  DS    CL2     10   15    2  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL12    11    2   12  A  P N             T        Y              
SYSDDSAH DS    CL8                                                              
SYSDDSA  DS    CL1     11   15    1  A  U H             T        Y              
SYSDAMGH DS    CL8                                                              
SYSDAMG  DS    CL50    11   30   50  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL11    13    2   11  A  P N             T        Y              
SYSACCSH DS    CL8                                                              
SYSACCS  DS    CL65    13   15   65  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL11    14    2   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL65    14   15   65  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL11    15    2   11  A  P N             T        Y              
SYSCABLH DS    CL8                                                              
SYSCABL  DS    CL1     15   15    1  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1     16   15    1  A  U N             T        Y              
SYSLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
SYSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 664  BYTES                            
