*          DATA SET CTLFME7D   AT LEVEL 002 AS OF 12/18/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA02E7D      DATE 12/18/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6   A    P    N         T         Y           
MAPSYSH  DS    CL8                                                              
MAPSYS   DS    CL7      5   10    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      5   19    7   A    P    N         T         Y           
MAPPROGH DS    CL8                                                              
MAPPROG  DS    CL7      5   27    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6      5   36    6   A    P    N         T         Y           
MAPSCRNH DS    CL8                                                              
MAPSCRN  DS    CL2      5   44    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      5   48    7   A    P    N         T         Y           
MAPUSERH DS    CL8                                                              
MAPUSER  DS    CL11     5   56   11   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL35     7    2   35   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL35     8    2   35   A    P    N         T         Y           
MAPFNUMH DS    CL8                                                              
MAPFNUM  DS    CL3      9    3    3   A    U    N         T         Y           
MAPFVALH DS    CL8                                                              
MAPFVAL  DS    CL60     9    8   60   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3     10    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL60    10    8   60   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3     11    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL60    11    8   60   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3     12    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL60    12    8   60   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3     13    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL60    13    8   60   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3     14    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL60    14    8   60   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3     15    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL60    15    8   60   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3     16    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL60    16    8   60   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3     17    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL60    17    8   60   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3     18    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL60    18    8   60   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3     19    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL60    19    8   60   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3     20    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL60    20    8   60   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3     21    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL60    21    8   60   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3     22    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL60    22    8   60   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3     23    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL60    23    8   60   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL3     24    3    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL60    24    8   60   A    U    N         T         Y           
MAPLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
MAPWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1470 BYTES                            
