*          DATA SET CTLFMFCD   AT LEVEL 002 AS OF 12/18/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA02FCD      DATE 12/18/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     5    2   11   A    P    N         T         Y           
ERRSYSAH DS    CL8                                                              
ERRSYSA  DS    CL7      5   15    7   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL9      6    2    9   A    P    N         T         Y           
ERRNUMH  DS    CL8                                                              
ERRNUM   DS    CL3      6   15    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7      7    2    7   A    P    N         T         Y           
ERRMSGH  DS    CL8                                                              
ERRMSG   DS    CL60     7   15   60   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1      8   15    1   A    U    N         T         Y           
ERRLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
ERRWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 157  BYTES                            
