*          DATA SET CTLFME5AD  AT LEVEL 002 AS OF 08/24/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA02E5D      DATE 08/24/00                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     5    2   11  A  P H             T        Y              
DEMSRCH  DS    CL8                                                              
DEMSRC   DS    CL8      5   15    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      5   26    8  A  P H             T        Y              
DEMSUBFH DS    CL8                                                              
DEMSUBF  DS    CL8      5   36    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      5   46    9  A  P N             T        Y              
DEMPSWDH DS    CL8                                                              
DEMPSWD  DS    CL10     5   60   10  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     6    2   11  A  P N             T        Y              
DEMAGYH  DS    CL8                                                              
DEMAGY   DS    CL7      6   15    7  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL9      6   26    9  A  P N             T        Y              
DEMCODEH DS    CL8                                                              
DEMCODE  DS    CL1      6   36    1  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     6   46   11  A  P N             T        Y              
DEMCLIH  DS    CL8                                                              
DEMCLI   DS    CL3      6   60    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL10     7    2   10  A  P H             T        Y              
DEMBOOKH DS    CL8                                                              
DEMBOOK  DS    CL8      7   15    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL6      8    2    6  A  P N             T        Y              
DEMLUPRH DS    CL8                                                              
DEMLUPR  DS    CL65     8   15   65  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7      9    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL65     9   15   65  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL5     10    2    5  A  P N             T        Y              
DEMVMARH DS    CL8                                                              
DEMVMAR  DS    CL70    10   10   70  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7     11    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    11   10   70  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL77    12    2   77  A  U H             T        Y              
DEMVMAXH DS    CL8                                                              
DEMVMAX  DS    CL77    13    2   77  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7     14    2    7  A  P N             T        Y              
DEMIMARH DS    CL8                                                              
DEMIMAR  DS    CL70    14   10   70  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7     15    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    15   10   70  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL77    16    2   77  A  U H             T        Y              
DEMIMAXH DS    CL8                                                              
DEMIMAX  DS    CL77    17    2   77  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7     18    2    7  A  P N             T        Y              
DEMOMARH DS    CL8                                                              
DEMOMAR  DS    CL70    18   10   70  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL7     19    2    7  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL70    19   10   70  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL77    20    2   77  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL77    21    2   77  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL77    22    2   77  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL77    23    2   77  A  U H             T        Y              
DEMOMAXH DS    CL8                                                              
DEMOMAX  DS    CL72    24    2   72  A  U H             T        Y              
         DS    CL8                                                              
         DS    CL1     24   76    1  A  U N             T        Y              
DEMLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
DEMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1736 BYTES                            
