*          DATA SET CTLFMFFD   AT LEVEL 003 AS OF 04/11/86                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA02FFD      DATE 04/11/86                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
BASHDRH  DS    CL8                                                              
BASHDR   DS    CL60     1    2   60  A   P    N         T        Y              
BASSRVH  DS    CL8                                                              
BASSRV   DS    CL17     1   63   17  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11     2    2   11  A   P    N         T        Y              
BASTYPEH DS    CL8                                                              
BASTYPE  DS    CL8      2   15    8  A   U    H         T    I   Y              
         DS    CL8                                                              
         DS    CL6      2   26    6  A   P    N         T        Y              
BASACTNH DS    CL8                                                              
BASACTN  DS    CL8      2   34    8  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL3      2   44    3  A   P    N         T        Y              
BASKEYH  DS    CL8                                                              
BASKEY   DS    CL29     2   48   29  A   U    H         T        Y              
BASTABH  DS    CL8                                                              
BASTAB   DS    CL1      2   79    1  A   U    N         T        Y              
BASLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
BASWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 218  BYTES                            
