*          DATA SET CTLFMF2D   AT LEVEL 004 AS OF 02/07/89                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA02F2D      DATE 02/07/89                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     4    2   11  A   P    H         T        Y              
TRMIDH   DS    CL8                                                              
TRMID    DS    CL9      4   15    9  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      6    2    6  A   P    N         T        Y              
TRMVENDH DS    CL8                                                              
TRMVEND  DS    CL30     6   15   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10     7    2   10  A   P    N         T        Y              
TRMSENOH DS    CL8                                                              
TRMSENO  DS    CL15     7   15   15  A   U    N         T        Y              
TRMDATEH DS    CL8                                                              
TRMDATE  DS    CL24     7   36   24  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL11     8    2   11  A   P    N         T        Y              
TRMDSCAH DS    CL8                                                              
TRMDSCA  DS    CL60     8   15   60  A   U    N         T        Y              
TRMDSCBH DS    CL8                                                              
TRMDSCB  DS    CL60     9   15   60  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     10   15    1  A   U    N         T        Y              
TRMLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
TRMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 328  BYTES                            
