*          DATA SET CTLFMEBD   AT LEVEL 002 AS OF 12/18/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA02EBD      DATE 12/18/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     5    2   11   A    P    N         T         Y           
TWXIDH   DS    CL8                                                              
TWXID    DS    CL6      5   15    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11     6    2   11   A    P    N         T         Y           
TWXDESCH DS    CL8                                                              
TWXDESC  DS    CL60     6   15   60   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL12     8    2   12   A    P    N         T         Y           
TWXDST1H DS    CL8                                                              
TWXDST1  DS    CL65     8   15   65   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL65     9   15   65   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL65    10   15   65   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL65    11   15   65   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL65    12   15   65   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL65    13   15   65   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL65    14   15   65   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL65    15   15   65   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL65    16   15   65   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL65    17   15   65   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     18   15    1   A    U    N         T         Y           
TWXLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
TWXWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 882  BYTES                            
