*          DATA SET CTLFMFED   AT LEVEL 016 AS OF 08/11/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA02FED      DATE 08/11/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      4    2    7  A   P    H         T        Y              
IDSIDH   DS    CL8                                                              
IDSID    DS    CL8      4   15    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL6      4   26    6  A   P    H         T        Y              
IDSSYSH  DS    CL8                                                              
IDSSYS   DS    CL8      4   34    8  A   U    N         T        Y              
IDSIDNH  DS    CL8                                                              
IDSIDN   DS    CL14     4   48   14  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL9      6    2    9  A   P    N         T        Y              
IDSAGYAH DS    CL8                                                              
IDSAGYA  DS    CL2      6   15    2  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8      7    2    8  A   P    N         T        Y              
IDSLANGH DS    CL8                                                              
IDSLANG  DS    CL13     7   15   13  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL12     8    2   12  A   P    N         T        Y              
IDSPIDH  DS    CL8                                                              
IDSPID   DS    CL10     8   15   10  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL12     9    2   12  A   P    N         T        Y              
IDSACCRH DS    CL8                                                              
IDSACCR  DS    CL1      9   15    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL10    11    2   10  A   P    N         T        Y              
IDSID1H  DS    CL8                                                              
IDSID1   DS    CL65    11   15   65  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL7     12    2    7  A   P    N         T        Y              
IDSID2H  DS    CL8                                                              
IDSID2   DS    CL65    12   15   65  A   U    H         T        Y              
IDSID3H  DS    CL8                                                              
IDSID3   DS    CL65    13   15   65  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL7     14    2    7  A   P    N         T        Y              
IDSPE1H  DS    CL8                                                              
IDSPE1   DS    CL65    14   15   65  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    15    2   10  A   P    N         T        Y              
IDSPE2H  DS    CL8                                                              
IDSPE2   DS    CL65    15   15   65  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL12    17    2   12  A   P    N         T        Y              
IDSSEAGH DS    CL8                                                              
IDSSEAG  DS    CL10    17   15   10  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL11    18    2   11  A   P    N         T        Y              
IDSSPWDH DS    CL8                                                              
IDSSPWD  DS    CL1     18   15    1  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL12    19    2   12  A   P    N         T        Y              
IDSACCSH DS    CL8                                                              
IDSACCS  DS    CL16    19   15   16  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL8     20    2    8  A   P    N         T        Y              
IDSPRIH  DS    CL8                                                              
IDSPRI   DS    CL4     20   15    4  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL7     21    2    7  A   P    N         T        Y              
IDSPA1H  DS    CL8                                                              
IDSPA1   DS    CL65    21   15   65  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL11    22    2   11  A   P    N         T        Y              
IDSPA2H  DS    CL8                                                              
IDSPA2   DS    CL65    22   15   65  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL11    23    2   11  A   P    N         T        Y              
IDSPA3H  DS    CL8                                                              
IDSPA3   DS    CL65    23   15   65  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL1     24   15    1  A   U    N         T        Y              
IDSLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
IDSWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1072 BYTES                            
