*          DATA SET CTLFMEDD   AT LEVEL 003 AS OF 05/17/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA02EDD      DATE 05/17/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     5    2   11  A   P    N         T        Y              
HUTDAYH  DS    CL8                                                              
HUTDAY   DS    CL4      5   15    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10     6    2   10  A   P    N         T        Y              
HUTTIMH  DS    CL8                                                              
HUTTIM   DS    CL6      6   15    6  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4      7    2    4  A   P    N         T        Y              
HUTYEARH DS    CL8                                                              
HUTYEAR  DS    CL3      7   15    3  N   U    N         T        Y              
         DS    CL8                                                              
         DS    CL36     9   14   36  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL3     10   10    3  A   P    N         T        Y              
HUTJAN1H DS    CL8                                                              
HUTJAN1  DS    CL4     10   15    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     10   25    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     10   35    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     10   45    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     11   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     11   15    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     11   25    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     11   35    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     11   45    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     12   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     12   15    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     12   25    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     12   35    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     12   45    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     13   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     13   15    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     13   25    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     13   35    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     13   45    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     14   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     14   15    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     14   25    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     14   35    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     14   45    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     15   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     15   15    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     15   25    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     15   35    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     15   45    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     16   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     16   15    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     16   25    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     16   35    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     16   45    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     17   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     17   15    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     17   25    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     17   35    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     17   45    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     18   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     18   15    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     18   25    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     18   35    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     18   45    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     19   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     19   15    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     19   25    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     19   35    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     19   45    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     20   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     20   15    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     20   25    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     20   35    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     20   45    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL3     21   10    3  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL4     21   15    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     21   25    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     21   35    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4     21   45    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     23   15    1  A   U    N         T        Y              
HUTLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
HUTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 856  BYTES                            
