*          DATA SET CTLFMEED   AT LEVEL 003 AS OF 08/27/91                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA02EED      DATE 08/27/91                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL17     5    2   17  A   P    N         T        Y              
FACCODEH DS    CL8                                                              
FACCODE  DS    CL1      5   20    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10     6    2   10  A   P    N         T        Y              
FACDATEH DS    CL8                                                              
FACDATE  DS    CL5      6   20    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL17     8    2   17  A   P    N         T        Y              
FACFACTH DS    CL8                                                              
FACFACT  DS    CL4      8   20    4  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1      9   20    1  A   U    N         T        Y              
FACLAST  DS    CL1                                                              
         DS    CL2    INDICS=X                                                  
FACWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 120  BYTES                            
