*          DATA SET CTLFME1D   AT LEVEL 002 AS OF 05/05/87                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA02E1D      DATE 05/05/87                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      5    2    9  L   P    N         T        Y              
BCMIDH   DS    CL8                                                              
BCMID    DS    CL8      5   12    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9      6    2    9  L   P    N         T        Y              
BCMDATEH DS    CL8                                                              
BCMDATE  DS    CL10     6   12   10  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9      8    2    9  L   P    N         T        Y              
BCMLISTH DS    CL8                                                              
BCMLIST  DS    CL60     8   12   60  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL9      9    2    9  L   P    N         T        Y              
BCMSUBJH DS    CL8                                                              
BCMSUBJ  DS    CL60     9   12   60  L   U    N         T        Y              
         DS    CL8                                                              
         DS    CL65    11   10   65  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL65    12   10   65  A   P    H         T        Y              
BCML1H   DS    CL8                                                              
BCML1    DS    CL7     13    2    7  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     13   10    1  A   P    H         T        Y              
BCMM1H   DS    CL8                                                              
BCMM1    DS    CL60    13   12   60  L   U    N    M    T        N              
         DS    CL8                                                              
         DS    CL1     13   74    1  A   P    H         T        Y              
BCML2H   DS    CL8                                                              
BCML2    DS    CL7     14    2    7  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     14   10    1  A   P    H         T        Y              
BCMM2H   DS    CL8                                                              
BCMM2    DS    CL60    14   12   60  L   U    N    M    T        N              
         DS    CL8                                                              
         DS    CL1     14   74    1  A   P    H         T        Y              
BCML3H   DS    CL8                                                              
BCML3    DS    CL7     15    2    7  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     15   10    1  A   P    H         T        Y              
BCMM3H   DS    CL8                                                              
BCMM3    DS    CL60    15   12   60  L   U    N    M    T        N              
         DS    CL8                                                              
         DS    CL1     15   74    1  A   P    H         T        Y              
BCML4H   DS    CL8                                                              
BCML4    DS    CL7     16    2    7  L   P    N         T        Y              
         DS    CL8                                                              
         DS    CL1     16   10    1  A   P    H         T        Y              
BCMM4H   DS    CL8                                                              
BCMM4    DS    CL60    16   12   60  L   U    N    M    T        N              
         DS    CL8                                                              
         DS    CL1     16   74    1  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL65    17   10   65  A   P    H         T        Y              
         DS    CL8                                                              
         DS    CL65    18   10   65  A   P    H         T        Y              
BCMLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
BCMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 937  BYTES                            
