*          DATA SET CTLFME6D   AT LEVEL 002 AS OF 12/18/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA02E6D      DATE 12/18/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL11     5    2   11   A    P    N         T         Y           
DEMSRCH  DS    CL8                                                              
DEMSRC   DS    CL8      5   15    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8      6    2    8   A    P    N         T         Y           
DEMSUBFH DS    CL8                                                              
DEMSUBF  DS    CL8      6   15    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11     7    2   11   A    P    N         T         Y           
DEMAGYH  DS    CL8                                                              
DEMAGY   DS    CL2      7   15    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11     8    2   11   A    P    N         T         Y           
DEMCODEH DS    CL8                                                              
DEMCODE  DS    CL1      8   15    1   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11     9    2   11   A    P    N         T         Y           
DEMCLIH  DS    CL8                                                              
DEMCLI   DS    CL3      9   15    3   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    10    2   10   A    P    N         T         Y           
DEMBOOKH DS    CL8                                                              
DEMBOOK  DS    CL6     10   15    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     11    2    8   A    P    N         T         Y           
DEMHUTH  DS    CL8                                                              
DEMHUT   DS    CL2     11   15    2   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     13    2    8   A    P    N         T         Y           
DEMMODRH DS    CL8                                                              
DEMMODR  DS    CL65    13   15   65   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL5     14    2    5   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL65    14   15   65   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10    16    2   10   A    P    N         T         Y           
DEMADJRH DS    CL8                                                              
DEMADJR  DS    CL65    16   15   65   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL5     17    2    5   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL65    17   15   65   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL65    18   15   65   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL65    19   15   65   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL65    20   15   65   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     21   15    1   A    U    N         T         Y           
DEMLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
DEMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 795  BYTES                            
