*          DATA SET CTLFMSAVE  AT LEVEL 003 AS OF 10/12/77                      
LFMSAVE  DSECT                     CONTROL FILE MAINT - SAVE STORAGE            
*                                                                               
         DS    CL16                                                             
*                                  USER SAVE AREA#1 (46 BYTES)*********         
LTYPE    DS    CL1                 LAST RECORD TYPE                             
LACTN    DS    CL1                 LAST ACTION                                  
LNEXT    DS    CL1                 LAST NEXT FLAGS                              
LKEY     DS    CL25                LAST KEY                                     
LCOUNT   DS    CL1                 LAST COUNT                                   
         DS    CL17                                                             
*                                                                               
         DS    CL2                                                              
*                                                                               
         DS    2000C               RESERVED FOR LARGEST SCREEN                  
*                                                                               
*                                  USER SAVE AREA#2 (240 BYTES)********         
