*          DATA SET CTLFME2D   AT LEVEL 002 AS OF 12/18/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA02E2D      DATE 12/18/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL16     5    2   16   A    P    N         T         Y           
UNICODEH DS    CL8                                                              
UNICODE  DS    CL8      5   20    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL15     7    2   15   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL5      9   19    5   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL5      9   27    5   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL5      9   35    5   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL5      9   43    5   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL5      9   51    5   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL5      9   59    5   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL5     10   10    5   A    P    N         T         Y           
UNIW1H   DS    CL8                                                              
UNIW1    DS    CL6     10   19    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     10   27    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     10   35    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     10   43    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     10   51    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     10   59    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL5     11   10    5   A    P    N         T         Y           
UNIM1H   DS    CL8                                                              
UNIM1    DS    CL6     11   19    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     11   27    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     11   35    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     11   43    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     11   51    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     11   59    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     12   10    6   A    P    N         T         Y           
UNIA1H   DS    CL8                                                              
UNIA1    DS    CL6     12   19    6   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     12   27    6   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     12   35    6   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     12   43    6   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     12   51    6   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     12   59    6   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL5     14   10    5   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     14   19    7   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL3     14   28    3   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL5     14   35    5   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL5     14   43    5   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL7     14   50    7   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL5     14   59    5   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL6     14   67    6   A    P    N         T         Y           
UNIH1H   DS    CL8                                                              
UNIH1    DS    CL6     15   10    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     15   19    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     15   27    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     15   35    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     15   43    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     15   51    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     15   59    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     15   67    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     17    2    7   A    P    N         T         Y           
UNISPECH DS    CL8                                                              
UNISPEC  DS    CL16    17   10   16   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL7     19    2    7   A    P    N         T         Y           
UNIDESCH DS    CL8                                                              
UNIDESC  DS    CL60    19   10   60   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     19   78    1   A    U    N         T         Y           
UNILAST  DS    CL1                                                              
         DS    CL2    INDICS=I                                                  
UNIWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 786  BYTES                            
