*          DATA SET CTLFMF4D   AT LEVEL 002 AS OF 12/18/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA02F4D      DATE 12/18/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      5    2    8   A    P    N         T         Y           
DEMPASSH DS    CL8                                                              
DEMPASS  DS    CL10     5   15   10   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL26     7    2   26   A    P    N         T         Y           
         DS    CL8                                                              
         DS    CL26     8    2   26   A    P    N         T         Y           
DEMLIN1H DS    CL8                                                              
DEMLIN1  DS    CL8      9    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8      9   12    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6      9   22    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     10    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     10   12    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     10   22    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     11    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     11   12    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     11   22    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     12    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     12   12    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     12   22    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     13    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     13   12    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     13   22    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     14    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     14   12    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     14   22    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     15    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     15   12    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     15   22    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     16    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     16   12    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     16   22    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     17    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     17   12    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     17   22    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     18    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     18   12    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     18   22    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     19    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     19   12    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     19   22    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     20    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     20   12    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     20   22    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     21    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     21   12    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     21   22    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     22    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     22   12    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     22   22    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     23    2    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL8     23   12    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL6     23   22    6   A    U    N         T         Y           
DEMTABH  DS    CL8                                                              
DEMTAB   DS    CL1     24    2    1   A    U    N         T         Y           
DEMLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
DEMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 804  BYTES                            
