*          DATA SET CTLFME0D   AT LEVEL 005 AS OF 01/27/88                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA02E0D      DATE 01/27/88                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL7      5    2    7  L   P    N         T        Y              
TWXSTAH  DS    CL8                                                              
TWXSTA   DS    CL7      5   12    7  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14     7    2   14  L   P    N         T        Y              
TWXTWXH  DS    CL8                                                              
TWXTWX   DS    CL21     7   18   21  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14     8    2   14  L   P    N         T        Y              
TWXTWXAH DS    CL8                                                              
TWXTWXA  DS    CL21     8   18   21  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14     9    2   14  L   P    N         T        Y              
TWXDDSTH DS    CL8                                                              
TWXDDST  DS    CL5      9   18    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    11    2   14  L   P    N         T        Y              
TWXAD1H  DS    CL8                                                              
TWXAD1   DS    CL25    11   18   25  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    12    2   14  L   P    N         T        Y              
TWXAD2H  DS    CL8                                                              
TWXAD2   DS    CL25    12   18   25  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    13    2   14  L   P    N         T        Y              
TWXAD3H  DS    CL8                                                              
TWXAD3   DS    CL25    13   18   25  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL14    14    2   14  L   P    N         T        Y              
TWXAD4H  DS    CL8                                                              
TWXAD4   DS    CL25    14   18   25  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL13    15    2   13  L   P    N         T        Y              
TWXTELH  DS    CL8                                                              
TWXTEL   DS    CL20    15   18   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL10    16    2   10  L   P    N         T        Y              
TWXTYPH  DS    CL8                                                              
TWXTYP   DS    CL20    16   18   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL21    19    2   21  L   P    N         T        Y              
TWXDATH  DS    CL8                                                              
TWXDAT   DS    CL8     19   24    8  L   P    N         T        Y              
TWXTAGH  DS    CL8                                                              
TWXTAG   DS    CL1     20    2    1  L   P    N         T        Y              
TWXLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
TWXWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 539  BYTES                            
