*          DATA SET CTLFMF7D   AT LEVEL 002 AS OF 12/18/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA02F7D      DATE 12/18/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL8      5    2    8   A    P    N         T         Y           
STAMEDH  DS    CL8                                                              
STAMED   DS    CL8      5   15    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL11     6    2   11   A    P    N         T         Y           
STASRCH  DS    CL8                                                              
STASRC   DS    CL8      6   15    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL10     7    2   10   A    P    N         T         Y           
STABOOKH DS    CL8                                                              
STABOOK  DS    CL8      7   15    8   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL79     9    2   79   A    P    N         T         Y           
STAFLD1H DS    CL8                                                              
STAFLD1  DS    CL78    10    2   78   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    11    2   78   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    12    2   78   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    13    2   78   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    14    2   78   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    15    2   78   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    16    2   78   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    17    2   78   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    18    2   78   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    19    2   78   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    20    2   78   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    21    2   78   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    22    2   78   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL78    23    2   78   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL74    24    2   74   A    U    N         T         Y           
STATABH  DS    CL8                                                              
STATAB   DS    CL1     24   78    1   A    U    N         T         Y           
STALAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
STAWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1486 BYTES                            
