*          DATA SET CTLFME8D   AT LEVEL 002 AS OF 12/18/83                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA02E8D      DATE 12/18/83                 
         SPACE 1                                                                
*                     LINE COLM LEN  A/N  PROT BRIL MODF TRNS CURS DEL          
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL13     5    2   13   A    P    N         T         Y           
MKTMNUMH DS    CL8                                                              
MKTMNUM  DS    CL5      5   17    5   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL14     7    2   14   A    P    N         T         Y           
MKTASRTH DS    CL8                                                              
MKTASRT  DS    CL6      7   17    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL12     8    2   12   A    P    N         T         Y           
MKTAENDH DS    CL8                                                              
MKTAEND  DS    CL6      8   17    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL14    10    2   14   A    P    N         T         Y           
MKTNSRTH DS    CL8                                                              
MKTNSRT  DS    CL6     10   17    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL12    11    2   12   A    P    N         T         Y           
MKTNENDH DS    CL8                                                              
MKTNEND  DS    CL6     11   17    6   A    U    N         T         Y           
         DS    CL8                                                              
         DS    CL1     12   17    1   A    U    N         T         Y           
MKTLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
MKTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 186  BYTES                            
