*          DATA SET CTLFMATAD  AT LEVEL 002 AS OF 12/30/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA02A5D      DATE 12/30/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
RMKMKIDH DS    CL8                                                              
RMKMKID  DS    CL4      3    2    4  A  P Z             T        Y              
         DS    CL8                                                              
         DS    CL1      3    6    1  A  P N             T        Y              
RMKLBLH  DS    CL8                                                              
RMKLBL   DS    CL25     4   22   25  A  P N             T        Y              
RMKSRCLH DS    CL8                                                              
RMKSRCL  DS    CL7      5   26    7  A  P N             T        Y              
RMKSRCH  DS    CL8                                                              
RMKSRC   DS    CL8      5   34    8  A  U N             T        Y              
RMKMSGLH DS    CL8                                                              
RMKMSGL  DS    CL29     6    4   29  A  P N             T        Y              
RMKMSGRH DS    CL8                                                              
RMKMSGR  DS    CL29     6   39   29  A  P N             T        Y              
RMKMK1H  DS    CL8                                                              
RMKMK1   DS    CL1      7    2    1  A  U N        M    T    I   N              
RMKMKA1H DS    CL8                                                              
RMKMKA1  DS    CL29     7    4   29  A  P N             T        Y              
RMKMK2H  DS    CL8                                                              
RMKMK2   DS    CL1      7   37    1  A  U N             T        N              
RMKMKA2H DS    CL8                                                              
RMKMKA2  DS    CL29     7   39   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      8    2    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29     8    4   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      8   37    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29     8   39   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      9    2    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29     9    4   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1      9   37    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29     9   39   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     10    2    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29    10    4   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     10   37    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29    10   39   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     11    2    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29    11    4   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     11   37    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29    11   39   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12    2    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29    12    4   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     12   37    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29    12   39   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     13    2    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29    13    4   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     13   37    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29    13   39   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14    2    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29    14    4   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     14   37    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29    14   39   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15    2    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29    15    4   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     15   37    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29    15   39   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16    2    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29    16    4   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     16   37    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29    16   39   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17    2    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29    17    4   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     17   37    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29    17   39   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     18    2    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29    18    4   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     18   37    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29    18   39   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19    2    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29    19    4   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     19   37    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29    19   39   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20    2    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29    20    4   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     20   37    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29    20   39   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21    2    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29    21    4   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     21   37    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29    21   39   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL1     22    2    1  A  U N             T        N              
         DS    CL8                                                              
         DS    CL29    22    4   29  A  P N             T        Y              
RMKMKLH  DS    CL8                                                              
RMKMKL   DS    CL1     22   37    1  A  U N             T        N              
RMKMKALH DS    CL8                                                              
RMKMKAL  DS    CL29    22   39   29  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL27    23   21   27  A  P N             T        Y              
RMKLAST  DS    CL1                                                              
         DS    CL2    INDICS=XX                                                 
RMKWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1672 BYTES                            
