*          DATA SET CTLFMF9D   AT LEVEL 005 AS OF 08/11/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA02F9D      DATE 08/11/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      5    2    6  A   P    N         T        Y              
PROSYSTH DS    CL8                                                              
PROSYST  DS    CL7      5   10    7  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL7      5   19    7  A   P    N         T        Y              
PROPRGMH DS    CL8                                                              
PROPRGM  DS    CL2      5   28    2  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL9      5   32    9  A   P    N         T        Y              
PROORGNH DS    CL8                                                              
PROORGN  DS    CL10     5   43   10  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL12     5   55   12  A   P    N         T        Y              
PROPROTH DS    CL8                                                              
PROPROT  DS    CL10     5   69   10  A   U    H         T        Y              
         DS    CL8                                                              
         DS    CL16     7    2   16  A   P    N         T        Y              
PROVALSH DS    CL8                                                              
PROVALS  DS    CL60     7   19   60  A   P    N         T        Y              
PRODSCLH DS    CL8                                                              
PRODSCL  DS    CL16     8    2   16  A   P    H         T        Y              
PROPRODH DS    CL8                                                              
PROPROD  DS    CL40     8   19   40  A   U    N         T        Y              
PRODESLH DS    CL8                                                              
PRODESL  DS    CL16     9    2   16  A   P    H         T        Y              
PRODSTIH DS    CL8                                                              
PRODSTI  DS    CL10     9   19   10  A   U    N         T        Y              
PROATTLH DS    CL8                                                              
PROATTL  DS    CL16    10    2   16  A   P    H         T        Y              
PROATYPH DS    CL8                                                              
PROATYP  DS    CL3     10   19    3  A   U    N         T        Y              
PROOUTLH DS    CL8                                                              
PROOUTL  DS    CL16    11    2   16  A   P    H         T        Y              
PROOUTPH DS    CL8                                                              
PROOUTP  DS    CL10    11   19   10  A   U    N         T        Y              
PROMODLH DS    CL8                                                              
PROMODL  DS    CL10    11   32   10  A   P    H         T        Y              
PROMODPH DS    CL8                                                              
PROMODP  DS    CL10    11   43   10  A   U    N         T        Y              
PROSDSLH DS    CL8                                                              
PROSDSL  DS    CL12    11   55   12  A   P    H         T        Y              
PROSDSCH DS    CL8                                                              
PROSDSC  DS    CL11    11   69   11  A   U    N         T        Y              
PROPQPLH DS    CL8                                                              
PROPQPL  DS    CL16    12    2   16  A   P    H         T        Y              
PROPQPWH DS    CL8                                                              
PROPQPW  DS    CL6     12   19    6  A   U    N         T        Y              
PROPQRLH DS    CL8                                                              
PROPQRL  DS    CL10    12   32   10  A   P    H         T        Y              
PROPQRCH DS    CL8                                                              
PROPQRC  DS    CL1     12   43    1  A   U    N         T        Y              
PROFRMLH DS    CL8                                                              
PROFRML  DS    CL12    12   55   12  A   P    H         T        Y              
PROFRMCH DS    CL8                                                              
PROFRMC  DS    CL2     12   69    2  A   U    N         T        Y              
PROPRTLH DS    CL8                                                              
PROPRTL  DS    CL16    13    2   16  A   P    H         T        Y              
PROPRSCH DS    CL8                                                              
PROPRSC  DS    CL1     13   19    1  A   U    N         T        Y              
PROPPTLH DS    CL8                                                              
PROPPTL  DS    CL10    13   32   10  A   P    H         T        Y              
PROPRPTH DS    CL8                                                              
PROPRPT  DS    CL1     13   43    1  A   U    N         T        Y              
PROPXPTH DS    CL8                                                              
PROPXPT  DS    CL2     13   45    2  A   P    N         T        Y              
PROPPOLH DS    CL8                                                              
PROPPOL  DS    CL12    13   55   12  A   P    H         T        Y              
PROPRPOH DS    CL8                                                              
PROPRPO  DS    CL1     13   69    1  A   U    N         T        Y              
PROPXPOH DS    CL8                                                              
PROPXPO  DS    CL2     13   71    2  A   P    N         T        Y              
PRORDCLH DS    CL8                                                              
PRORDCL  DS    CL16    14    2   16  A   P    H         T        Y              
PRORCLAH DS    CL8                                                              
PRORCLA  DS    CL1     14   19    1  A   U    N         T        Y              
PROSRTLH DS    CL8                                                              
PROSRTL  DS    CL16    15    2   16  A   P    H         T        Y              
PROSRTFH DS    CL8                                                              
PROSRTF  DS    CL59    15   19   59  A   U    N         T        Y              
PROJCLLH DS    CL8                                                              
PROJCLL  DS    CL16    16    2   16  A   P    H         T        Y              
PROSJCLH DS    CL8                                                              
PROSJCL  DS    CL10    16   19   10  A   U    N         T        Y              
PROPHSLH DS    CL8                                                              
PROPHSL  DS    CL16    17    2   16  A   P    H         T        Y              
PROSPHSH DS    CL8                                                              
PROSPHS  DS    CL16    17   19   16  A   U    N         T        Y              
PROPROLH DS    CL8                                                              
PROPROL  DS    CL16    18    2   16  A   P    H         T        Y              
PROPRCAH DS    CL8                                                              
PROPRCA  DS    CL59    18   19   59  A   U    N         T        Y              
PROPRCBH DS    CL8                                                              
PROPRCB  DS    CL59    19   19   59  A   U    N         T        Y              
PROPACLH DS    CL8                                                              
PROPACL  DS    CL16    20    2   16  A   P    H         T        Y              
PROPACAH DS    CL8                                                              
PROPACA  DS    CL59    20   19   59  A   U    N         T        Y              
PROPACBH DS    CL8                                                              
PROPACB  DS    CL59    21   19   59  A   U    N         T        Y              
PROSHPLH DS    CL8                                                              
PROSHPL  DS    CL16    22    2   16  A   P    H         T        Y              
PROPINAH DS    CL8                                                              
PROPINA  DS    CL59    22   19   59  A   U    N         T        Y              
PROPINBH DS    CL8                                                              
PROPINB  DS    CL59    23   19   59  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL1     24   19    1  A   U    N         T        Y              
PROLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
PROWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1392 BYTES                            
