*          DATA SET CTLFMEAD   AT LEVEL 003 AS OF 11/12/86                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA02EAD      DATE 11/12/86                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      5    2    9  A   P    N         T        Y              
LSTTYPEH DS    CL8                                                              
LSTTYPE  DS    CL8      5   15    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      5   26    7  A   P    N         T        Y              
LSTIDH   DS    CL8                                                              
LSTID    DS    CL8      5   34    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL11     5   44   11  A   P    N         T        Y              
LSTDESCH DS    CL8                                                              
LSTDESC  DS    CL24     5   56   24  A   U    N         T        Y              
LSTL1H   DS    CL8                                                              
LSTL1    DS    CL78     7    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78     8    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78     9    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    10    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    11    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    12    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    13    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    14    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    15    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    16    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    17    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    18    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    19    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    20    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    21    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    22    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78    23    2   78  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL76    24    2   76  A   U    N         T        Y              
LSTLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
LSTWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1664 BYTES                            
