*          DATA SET CTLFMREQ   AT LEVEL 001 AS OF 10/04/78                      
*              DSECT TO COVER CONTROL SYSTEM REQUEST CARD                       
*                                                                               
REQD     DSECT                                                                  
REQHDR   DS    0CL26                                                            
       ++INCLUDE DMREQHDR                                                       
REQUEST  DS    0CL80                                                            
REQPROG  DS    CL2                 PROGRAM NUMBER                               
         DS    CL7                                                              
REQAGYA  DS    CL2                 AGENCY ALPHA ID                              
         DS    CL55                                                             
REQSTOR  DS    CL12                REQUESTOR NAME                               
         DS    CL2                                                              
