*          DATA SET CTLFMF1D   AT LEVEL 001 AS OF 12/18/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA02F1D      DATE 12/18/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL9      5    2    9  A  P N             T        Y              
DEMFILEH DS    CL8                                                              
DEMFILE  DS    CL8      5   15    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL8      6    2    8  A  P N             T        Y              
DEMSUBFH DS    CL8                                                              
DEMSUBF  DS    CL8      6   15    8  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     7    2   11  A  P N             T        Y              
DEMAGYH  DS    CL8                                                              
DEMAGY   DS    CL2      7   15    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     8    2   11  A  P N             T        Y              
DEMCODEH DS    CL8                                                              
DEMCODE  DS    CL14     8   15   14  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11     9    2   11  A  P N             T        Y              
DEMDEMOH DS    CL8                                                              
DEMDEMO  DS    CL3      9   15    3  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL11    11    2   11  A  P N             T        Y              
DEMFLD1H DS    CL8                                                              
DEMFLD1  DS    CL5     11   15    5  A  U N             T        N              
         DS    CL8                                                              
         DS    CL11    12    2   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6     12   15    6  A  U N             T        N              
         DS    CL8                                                              
         DS    CL11    13    2   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL7     13   15    7  A  U N             T        N              
         DS    CL8                                                              
         DS    CL11    14    2   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   15    4  A  U N             T        N              
         DS    CL8                                                              
         DS    CL11    15    2   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   15    4  A  U N             T        N              
         DS    CL8                                                              
         DS    CL11    16    2   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     16   15    5  A  U N             T        N              
         DS    CL8                                                              
         DS    CL11    17    2   11  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5     17   15    5  A  U N             T        N              
DEMTABH  DS    CL8                                                              
DEMTAB   DS    CL1     18   15    1  A  U N             T        Y              
DEMLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
DEMWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 408  BYTES                            
