*          DATA SET CTLFMF3AD  AT LEVEL 001 AS OF 07/06/92                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA02F3D      DATE 07/06/92                 
         SPACE 1                                                                
*                     LINE COLM LEN A/N PROT BRIL MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
         DS    CL8                                                              
         DS    CL6      4    2    6  A   P    N         T        Y              
FLDSYSH  DS    CL8                                                              
FLDSYS   DS    CL8      4   15    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL7      4   26    7  A   P    N         T        Y              
FLDPRGH  DS    CL8                                                              
FLDPRG   DS    CL8      4   34    8  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL4      4   44    4  A   P    N         T        Y              
FLDDSCH  DS    CL8                                                              
FLDDSC   DS    CL30     4   49   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL15     5    2   15  A   P    N         T        Y              
FLDPEDTH DS    CL8                                                              
FLDPEDT  DS    CL1      5   20    1  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL78     7    2   78  A   P    N         T        Y              
FLDFNUMH DS    CL8                                                              
FLDFNUM  DS    CL2      8    2    2  A   P    N         T        Y              
FLDFDSCH DS    CL8                                                              
FLDFDSC  DS    CL30     8    6   30  A   U    N         T        Y              
FLDFTYPH DS    CL8                                                              
FLDFTYP  DS    CL2      8   41    2  A   U    N         T        Y              
FLDFVALH DS    CL8                                                              
FLDFVAL  DS    CL20     8   48   20  A   U    N         T        Y              
FLDFDFTH DS    CL8                                                              
FLDFDFT  DS    CL5      8   72    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2      9    2    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL30     9    6   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2      9   41    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20     9   48   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5      9   72    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     10    2    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL30    10    6   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     10   41    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    10   48   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     10   72    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     11    2    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL30    11    6   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     11   41    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    11   48   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     11   72    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     12    2    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL30    12    6   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     12   41    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    12   48   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     12   72    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     13    2    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL30    13    6   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     13   41    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    13   48   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     13   72    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     14    2    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL30    14    6   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     14   41    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    14   48   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     14   72    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     15    2    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL30    15    6   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     15   41    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    15   48   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     15   72    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     16    2    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL30    16    6   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     16   41    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    16   48   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     16   72    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     17    2    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL30    17    6   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     17   41    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    17   48   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     17   72    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     18    2    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL30    18    6   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     18   41    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    18   48   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     18   72    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     19    2    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL30    19    6   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     19   41    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    19   48   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     19   72    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     20    2    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL30    20    6   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     20   41    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    20   48   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     20   72    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     21    2    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL30    21    6   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     21   41    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    21   48   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     21   72    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     22    2    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL30    22    6   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     22   41    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    22   48   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     22   72    5  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     23    2    2  A   P    N         T        Y              
         DS    CL8                                                              
         DS    CL30    23    6   30  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL2     23   41    2  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL20    23   48   20  A   U    N         T        Y              
         DS    CL8                                                              
         DS    CL5     23   72    5  A   U    N         T        Y              
FLDLAST  DS    CL1                                                              
         DS    CL2    INDICS=1                                                  
FLDWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1816 BYTES                            
