*          DATA SET CTLNKFFDS  AT LEVEL 002 AS OF 01/24/00                      
         SPACE 1                                                                
*              DSECT TO COVER SCREEN TA22FFD      DATE 01/24/00                 
         SPACE 1                                                                
TA22FFD  DSECT                                                                  
         DS    CL64                                                             
*                     LINE COLM LEN A/N P B H C S MODF TRNS CUR DEL ID#         
         SPACE 1                                                                
LNKMSGH  DS    CL8                                                              
LNKMSG   DS    CL60     1    2   60  A  P N             T        Y              
LNKSRVH  DS    CL8                                                              
LNKSRV   DS    CL17     1   63   17  A  U N             T        Y              
LNKFDSCH DS    CL8                                                              
LNKFDSC  DS    CL5      3    2    5  A  P N             T        Y              
LNKPHSH  DS    CL8                                                              
LNKPHS   DS    CL4      3    9    4  A  U N             T    I   Y              
         DS    CL8                                                              
         DS    CL19     3   18   19  A  P N             T        Y              
LNKSHRTH DS    CL8                                                              
LNKSHRT  DS    CL1      3   38    1  A  U N             T        Y              
LNKLOADH DS    CL8                                                              
LNKLOAD  DS    CL6      4    2    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      4   10    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      4   18    5  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      4   30    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL6      4   38    6  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL5      4   46    5  A  P N             T        Y              
LNKNUM0H DS    CL8                                                              
LNKNUM0  DS    CL2      5    4    2  A  U N             T        Y              
LNKHDR0H DS    CL8                                                              
LNKHDR0  DS    CL4      5   11    4  A  P N             T        Y              
LNKODR0H DS    CL8                                                              
LNKODR0  DS    CL2      5   20    2  A  U N             T        Y              
LNKNU14H DS    CL8                                                              
LNKNU14  DS    CL2      5   32    2  A  U N             T        Y              
LNKHD14H DS    CL8                                                              
LNKHD14  DS    CL4      5   39    4  A  P N             T        Y              
LNKOD14H DS    CL8                                                              
LNKOD14  DS    CL2      5   48    2  A  U N             T        Y              
LNKNUM1H DS    CL8                                                              
LNKNUM1  DS    CL2      6    4    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      6   11    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2      6   20    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2      6   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      6   39    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2      6   48    2  A  U N             T        Y              
LNKNUM2H DS    CL8                                                              
LNKNUM2  DS    CL2      7    4    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      7   11    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2      7   20    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2      7   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      7   39    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2      7   48    2  A  U N             T        Y              
LNKNUM3H DS    CL8                                                              
LNKNUM3  DS    CL2      8    4    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   11    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2      8   20    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2      8   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      8   39    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2      8   48    2  A  U N             T        Y              
LNKNUM4H DS    CL8                                                              
LNKNUM4  DS    CL2      9    4    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      9   11    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2      9   20    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2      9   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4      9   39    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2      9   48    2  A  U N             T        Y              
LNKNUM5H DS    CL8                                                              
LNKNUM5  DS    CL2     10    4    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   11    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     10   20    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     10   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     10   39    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     10   48    2  A  U N             T        Y              
LNKNUM6H DS    CL8                                                              
LNKNUM6  DS    CL2     11    4    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     11   11    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   20    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     11   39    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     11   48    2  A  U N             T        Y              
LNKNUM7H DS    CL8                                                              
LNKNUM7  DS    CL2     12    4    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   11    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   20    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     12   39    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     12   48    2  A  U N             T        Y              
LNKNUM8H DS    CL8                                                              
LNKNUM8  DS    CL2     13    4    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     13   11    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   20    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     13   39    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     13   48    2  A  U N             T        Y              
LNKNUM9H DS    CL8                                                              
LNKNUM9  DS    CL2     14    4    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   11    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   20    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     14   39    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     14   48    2  A  U N             T        Y              
LNKNUMAH DS    CL8                                                              
LNKNUMA  DS    CL2     15    4    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   11    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   20    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     15   39    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     15   48    2  A  U N             T        Y              
LNKNUMBH DS    CL8                                                              
LNKNUMB  DS    CL2     16    4    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   11    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   20    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     16   39    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     16   48    2  A  U N             T        Y              
LNKNUMCH DS    CL8                                                              
LNKNUMC  DS    CL2     17    4    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     17   11    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   20    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     17   39    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     17   48    2  A  U N             T        Y              
LNKNUMDH DS    CL8                                                              
LNKNUMD  DS    CL2     18    4    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   11    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   20    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     18   39    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     18   48    2  A  U N             T        Y              
LNKNUMEH DS    CL8                                                              
LNKNUME  DS    CL2     19    4    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     19   11    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   20    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     19   39    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     19   48    2  A  U N             T        Y              
LNKNUMFH DS    CL8                                                              
LNKNUMF  DS    CL2     20    4    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   11    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   20    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     20   39    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     20   48    2  A  U N             T        Y              
LNKNU10H DS    CL8                                                              
LNKNU10  DS    CL2     21    4    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     21   11    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   20    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     21   39    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     21   48    2  A  U N             T        Y              
LNKNU11H DS    CL8                                                              
LNKNU11  DS    CL2     22    4    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   11    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   20    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     22   39    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     22   48    2  A  U N             T        Y              
LNKNU12H DS    CL8                                                              
LNKNU12  DS    CL2     23    4    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     23   11    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     23   20    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     23   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     23   39    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     23   48    2  A  U N             T        Y              
LNKNU13H DS    CL8                                                              
LNKNU13  DS    CL2     24    4    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     24   11    4  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL2     24   20    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL2     24   32    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL4     24   39    4  A  P N             T        Y              
LNKLORDH DS    CL8                                                              
LNKLORD  DS    CL2     24   48    2  A  U N             T        Y              
         DS    CL8                                                              
         DS    CL12    24   52   12  A  P N             T        Y              
         DS    CL8                                                              
         DS    CL13    24   65   13  A  P N             T        Y              
LNKLAST  DS    CL1                                                              
         DS    CL2    INDICS=                                                   
LNKWORK  DS    0D     START OF REMAINING WORK                                   
*                     SPACE USED SO FAR = 1624 BYTES                            
